{"user_rating": 4.0, "review_count": 2431, "name": "Hotel Riu Yucatan", "reviews": [{"rating": 5.0, "title": "group holiday to the rui yucatan", "text": "a group of 12 of us went to the rui yucatan. we have been holidaying as a group for the last 5 years the last 2 years being at the rui merangue in paurta plata dominican republic. we honestly thought we could not better the dominican but we have all agreed that the yucatan in mexico topped it. the hotel was fantastic with the staff being very friendly and attentive (when you go look out for ricardo in the outside bar) . the pools could have been a bit cleaner but i think alot of that was to do with not so clean people using them! the beach was fantastic lovely sea yes there are sandbags but these are great for sitting on and cooling off or diving off or even getting swept off on a rough day. the weather was fantastic but beware use high factor there were a few red over cooked bodies about. only downside is the mossi's they love new blood, the spray you get from the uk is useless you need to buy 'OFF' as soon as you can from the shops locally. the accomodation was very spacious and always kept spotless by the hardworking maids. the food was excellent with there always being plenty of choice and dont forget the themed restaurants they are well worth the visit.we all had a great holiday and will be back . ignore all the negative reviews people post ,you will really have no worries enjoy we did.", "user": "mexicoSolihull", "date": "August 25, 2008", "id": 19330245}, {"rating": 5.0, "title": "Fabulous Fabulous holiday!!", "text": "This was our first trip to Mexico and won't be our last.", "user": "MichaelAndLucy", "date": "August 22, 2008", "id": 19244616}, {"rating": 4.0, "title": "Its a good hotel/holiday", "text": "We booked the holiday as a wedding package and got married in the grounds of the Riu Yucatan which turned out to be perfect and completely hassle free.", "user": "ichecktripadtoomuch", "date": "August 21, 2008", "id": 19194868}, {"rating": 3.0, "title": "A Nice Trip", "text": "We were upgraded on arrival to the best suite in the hotel (huge sitting room, huge balcony, double bathroom etc) so if this review seems too good to be true, that could have something to do with it! Only saw brief glimpses of other rooms but they looked nice.", "user": "ldan", "date": "August 9, 2008", "id": 18788015}, {"rating": 4.0, "title": "Great time at the Riu Yucatan but...", "text": "The communal areas were always clean and tidy, staff were friendly enough, however they did seem to prefer serving Americans to us British for the obvious reason of a better tip.", "user": "Chazb94", "date": "August 3, 2008", "id": 18573101}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I was a little concerned about what I had read about the Riu Yucatan here and deep down was not looking forward to being dissapointed. How wrong was I.", "title": "Our Honeymoon", "helpfulness": 4, "user": "Rockape2", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17995863, "likes": {"liked": "— Clean, Tidy and comfortable", "disliked": "— Nothing to disalike"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Along with my new wife I stayed there at the start of July for two weeks and we loved every minute of our time.", "title": "An okay resort", "helpfulness": 3, "user": "Bridget1720", "date": "July 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 17872011, "likes": {"liked": "— Beautiful grounds, great staff!", "disliked": "— Food was mediocre."}}, {"rating": 5.0, "title": "great holiday", "text": "We were greeted by friendly staff on our arrival and we introduced to the hotel and shortly after our room.", "helpfulness": 5, "user": "lilley1968", "date": "July 14, 2008", "id": 17860394}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The room was very tidy, clean. The shower and toilet were clean. All the towels smelled fresh and clean. We had a balcony which overlooked a small garden area. For the next to weeks the room maid kept the room in this condition. The beds were a little hard, however I never had trouble sleeping.", "title": "Five star luxury - No but .......", "helpfulness": 8, "user": "Brookster", "date": "July 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17829852, "likes": {"liked": "— The staff and the cleanliness", "disliked": "— Guests who were rude to the staff"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The food and drink was very good. There is plenty to choose from, fruit, salads, steaks, chicken, local, etc etc. The other three restaurants have a like selection of food. We were looked after by Totti one of the waiters. He did a brilliant job of looking after us and made sure we experienced many a tequila boom boom!", "title": "Shame about the beaches", "user": "BeachBoyz", "date": "July 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 17741437, "likes": {"liked": "— Entertainment a bit Billy Butlins but great effort on the smembers of staff", "disliked": "— Beaches and Lack of available Sun beds"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "i went with my husband and son (8) for 2 weeks and the only problem we had was the mosquitos which kept eating us to bites! the hotel room was spotless and cleaned daily and the fridge was restocked every other day. we enjoyed the holiday so much that we have booked to go back this xmas. my son cried when we left as he did not want to go home . the staff in the entire resort where happy and helpful. the kids club girl patty was lovely he loved going there and it gave us time to sun bathe etc. we did see the sand whales on the beach but if thats all you have to complain about i think thats its nature and enjoy what we have got at that time", "title": "briliant", "helpfulness": 1, "user": "mishJersey", "date": "August 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18531597, "likes": {"liked": "— the location being able to go out of resort, food and staff", "disliked": "— mosquitos"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Date of stay – 15th – 29th July", "title": "Fantastic holiday at the Yucatan", "helpfulness": 8, "user": "jan1403", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 18476818, "likes": {"liked": "— Everything", "disliked": "— Lack of teenager activities"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Flight – Good flight with Thomsonfly, took off an hour late but made up some time and landed half an hour late. Immigration was a nightmare – 2 officers for over 300 people and took over an hour. We finally boarded the coach for a pleasant coach ride to the Riu Yucatan.", "title": "riu yucatan was indescribably awesome!!", "helpfulness": 7, "user": "goodiegoodieyumyum", "date": "July 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18462337, "likes": {"liked": "— hard question!! umm how much there was to entertain you", "disliked": "— it made my cheeks hurt from smiling to much!"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Check In – Was very easy, staff came to us in the lobby with a welcome drink, issued our wristbands and provided us with an envelope with our room key, safe key and towel cards. I had emailed the hotel about 2 weeks before requesting 4 rooms close together on the 3rd floor. They replied stating they would try their best but couldn’t guarantee it. I was pleased to find all the rooms were on the 3rd floor in block 7. We were allocated 7318, 7319, 7324 & 7325.", "title": "Ant problem", "helpfulness": 2, "user": "yburr", "date": "July 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 18408702, "likes": {"liked": "— We were close to the pool and ocean", "disliked": "— The ants and not enough air conditioned areas (like eating areas )"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Welcome meeting – Thomson reps gave us information on various excursions but what I thought was a nice touch was that staff from various departments were introduced to us.", "title": "Fantastic Holiday", "helpfulness": 9, "user": "dp47", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18016982, "likes": {"liked": "— Crushed Ice in the drinks", "disliked": "— nothing"}}, {"rating": 4.0, "title": "A lovely stay at the Yucatan", "text": "My husband, my two kids and I stayed at the Yucatan for 11 nights in August and had a great holiday. We have been to Mexico before and love the country which helps. We have also stayed at Riu hotels before, but not this one.", "user": "Hairbear99", "date": "August 30, 2008", "id": 19548487}, {"rating": 3.0, "title": "Jenny, Essex, Disappointed Riu hotel fan", "text": "The size of our room was more than adequate for the 4 of us and was very clean. We had none of the cleanliness or smell issues that others have reported. The maid was very good and cleaned to a high standard every day (usually whilst we were at breakfast) and left towel art for the kids 3 or 4 times during our stay, which was nice. We were in block 4 which was very near the pool and beach restaurant, not so near the main building. Although we didn't have much of a view from the balcony (only the Riu Tequila's beach alley really) we liked the position and although we were in range of noise from the shows at night it didn't bother us. Anyone who wants to avoid noise at any cost would be better off in blocks 1,2,3,7,8 & 9.", "user": "jennywrenEssexUK", "date": "August 28, 2008", "id": 19459964}, {"rating": 1.0, "title": "Riu: The Most dissapointing experience", "text": "The food was fine, but look elsewhere if you're into gourmet dining. We've had better food at Riu's in the past, but it wasn't a disaster and they try hard. They have a nice juice bar and the breakfasts are good. Of the A La Cartes the Steakhouse was by far the best. I thought the Mexican was OK too but none of us were that keen on the Asian. Imagine Chinese food made by someone in boxing gloves...I'm just not used to my (non)crispy duck in chunks...!", "user": "Gptour", "date": "August 27, 2008", "id": 19403207}, {"rating": 4.0, "title": "Rui Quality, little crowded", "text": "The pools were great and the kids liked the novelty of a swim up bar they were allowed to use. The drinks were very nice. From the pools it is but a few steps to the lovely beach. Yes I know it's been eroded and the sand whales are everywhere, but it's still gorgeous. It looks as though efforts to rebuild the beach are succeeding and good luck to them.", "user": "vacationsamany", "date": "August 25, 2008", "id": 19354666}, {"rating": 5.0, "title": "Missing it loads!!", "text": "Good spots for lounging around the pools are hard to get after 07.30 so be prepared to play the towel game. On the other hand, sunbeds were plentiful on the beach and easy to get at any time of day.", "user": "dadio77", "date": "August 25, 2008", "id": 19331091}], "location": {}, "stars": 3.5, "variance": {"poor": 119, "average": 360, "very good": 792, "terrible": 64, "excellent": 1096}, "aka": "Riu Yucatan Playacar Hotel Playa Del Carmen", "slim_ranking": 0.372448979592, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "* Located in the Yucatan peninsula, 3 km/ 1.9 miles from Playa del Carmen * In Playacar's resort area, along with the Riu Palace Mexico, Riu Palace Riviera Maya, Riu Playacar and the ClubHotel Riu Tequila hotels * Main building and 2-storey buildings * Mexican \"Hacienda\" style architecture * Surrounded by 40,000 m2/44,000 sq. yards of lush gardens * On the beachfront * Complimentary sun loungers on the beach * Next to the Mexican Street * 800 m/2,650 ft. from various shops * 55 km/34 miles from Cancun Int'l. Airport * Credit cards accepted: Visa, MasterCard, Amex, Diners"}