{"user_rating": 4.5, "review_count": 858, "name": "Hotel Rival", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Rival is a trendy hotel on the edge of the small park of Mariatorget. It's a hundred yards from the underground station; which is two stops from Gamla Stan - the old town. You can walk to the old town in fifteen minutes.", "title": "Unrivalled", "user": "JerryFXD", "date": "June 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69059022}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Much is made of the fact its owned by Benny Andersson but other than an ABBA CD among the collection in the room, there is no mention of the band. The style is trendy and relaxed. The lobby is darkly lit and relaxing in orange tones which aren't exactly subtle but somehow work.", "title": "Trendy Hotel with ABBA flair", "user": "traveller_2905_10", "date": "June 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 68963592}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "The rooms are modern and trendy with a small reading corner. The teddy bear was a nice touch. It had a large comfortable bed with feather quilts and pillows. It gave both of us the best two nights sleep of our trip.", "title": "Stylish hotel in centre of Stockholm", "helpfulness": 1, "user": "HKFoodie", "date": "June 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 66690089}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We asked for and got a bath - but didn't use it due to the 28 degree heat. Along with the bath was a separate wet-room with a plate-sized shower head. Plenty of Crabtree and Evelyn gels and scrubs.", "title": "Great hotel", "user": "ceebeee", "date": "May 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 65127130}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "By the lift was a coffee machine and water / ice dispenser along with two free to use internet enabled PCs.", "title": "Great, unique hotel", "user": "Brett S", "date": "May 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65039710}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "This was our second stay at the Hotel Rival and it was just as good as the first time. There may be grander hotels in Stockholm but the Hotel Rival is uber-cool, stylish, comfortable and not in the least pretentious (as we've found some of the grander hotels around the world in the past). The staff can't do enough for you although we also found most of the people in Stockholm to be friendly and approachable.", "title": "Great again", "user": "contented_wanderers", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74270305}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We ate in the restaurant on the first evening, where we met a Swedish friend, and the food was excellent. This was mirrored by the breakfast buffet which was included in the price and which was wide ranging enough to meet pretty much all tastes.", "title": "Still THE place to stay in Stockholm", "helpfulness": 1, "user": "HeikoMaximilian", "date": "August 5, 2010", "detail_rating": {"sleep": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 73888806}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Again we chose a Superior Room which was airy and spacious enough for us with a lovely big balcony overlooking a very quiet courtyard. The rooms at the front of the hotel overlook a picturesque square but we prefer the peace and quiet of the back courtyard.", "title": "Our Second Time at the Rival. It's a Pleasure!", "helpfulness": 2, "user": "TravelMomzee", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72487865}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "The hotel is owned by Benny Anderson from ABBA and therefore a mecca for all ABBA fans, although the ABBA memorabilia is discrete and not so in your face that it would bother non-fans either. There is of course an ABBA CD or two in the bedrooms so that you can have a bit of a morning dance to your favourite ABBA track!", "title": "Loved the Rival!", "user": "MaltaTeresa", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71050550}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Although the Rival has been around for quite a few years now (time flies), it is still unquestionnably THE place to stay in Stockholm. The location (Södermalm, close to Götsgatan), the atmosphere (trendy, lively, young), the service (reliable, friendly, professional), the rooms (spacious, great design, functional) as well as the bar, restaurant and coffee shop are all first rate compared to other hotels in Stockholm and around Scandinavia - where prizes are typically higher than quality. It's not cheap either, but you get your money's worth.......", "title": "A Superb Modern Hotel on a Pretty Square in one of Europe's Loveliest Cities", "user": "Ron F", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 70458514}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The hotel is just what you've been waiting for. The beds are great, the movies in the room are endless, the food is amazing, the room service quick, the maids are funny, the breakfast is divine, the location convenient... I could go on.", "title": "Absolutely perfect in every way.", "helpfulness": 1, "user": "flyingmamma", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109413147}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Mariatorget is the park the hotel faces onto and is so picturesque and sweet.", "title": "Excellent, Top Notch, Very Nice, Cool, Hip Hotel in Great Location. Loved It.", "helpfulness": 3, "user": "mrfoxycat", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107628377}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "There is just nothing wrong with this hotel. Everything is right.", "title": "Superb hotel with a personal touch", "helpfulness": 1, "user": "lephantome", "date": "April 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 106085798}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "That's usually hard to say since we travel with our 7-year-old, but it was truly easy to have a kid with us there.", "title": "Great hotel in good location", "helpfulness": 1, "user": "S&ALLondon", "date": "April 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 105623212}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "Go there now. And try the cheesecake!", "title": "Wonderful hotel in wonderful area!", "user": "TonyinEdinburgh", "date": "April 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105238531}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Clean and Nice 4 star hotel. Close to cinema and good restaurants", "title": "Best Breakfast in Stockholm", "user": "Chrillan", "date": "March 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 99080478}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "No hotel is Stockholm is cheap. Found the Rival good value for money.", "title": "Excellent Hotel", "user": "Nick_Marks", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 98668672}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Relaxed and informal setting with helpful staff.", "title": "Loved this hotel!", "user": "gmkathy2", "date": "February 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95940861}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Rooms are individually designed and modern might not be to everyone's taste but the comfort of rooms (I stayed in the cheapest option) was superb. Excellent quaility bedding, a bathroom as big as the room with top end fixtures. Room scame with CD's DVDs, surround sound system and flat screen TV.", "title": "Fab service in a modern funky hotel", "user": "holidaychicLondon", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 95088586}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The room I stayed in appeared as if it had been something more industrial in the past but fitted out to a high spec.", "title": "Fabulous Rival for the second time!", "helpfulness": 1, "user": "parislights", "date": "January 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95020965}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Don't be distracted with all the comments regarding the hotel being owned by one of the Abba members and the homage to the group in both the style and the music. The Rival stands as an excellent hotel on its own. The room are not big, but they are very well stocked (even with some CDs of course), and the hotels is full of details, form the free coffee and cookies all day, the fast internet conection and a staff ready to help. The breakfast is excellent.", "title": "Going to Stockholm? Stay at the Rival", "helpfulness": 1, "user": "ARUANO", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118572200}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "The hotel is not right in the center but situated in the \"southern\" island but, first, a lot of interesting things and most of the modern stuff happens there, and the center is reachable both by foot or with the excellent metro system (stop steps away from The Rival). We would definetely repeat.", "title": "Mama Mia meets Ingmar Bergman", "helpfulness": 1, "user": "EdinburghMaltman", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118366603}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Benny Andersson's hotel in Stockholm's Soderholm district, an old art deco cinema now transformed into a chic boutique hotel, is a gem. The rooms are themed with the Swedish film industry as the subject matter: films, stars and directors. Not large, but well appointed with an upmarket quality IKEA feel about them, so very domestic in scale. The skinny first floor balcony over the width of the street elevation. has high stools and an elbow top overlooking the square, trees and a fountain immediately over the road. Bedecked with flowers, it is a lovely spot to sip a beer from in the late afternoon sun. And sip you will, as here and elsewhere the cost of alcohol is prohibitive and even Swedish salary levels cannot bridge the difference, one needs to be dedicated to pay these prices. Sodermalm is an up and and coming area, only about 10 minutes walk to the old and very touristy, Gamla Stan, Staff were very efficient and friendly, indeed all aspects of this hotel are very well run - chains please take note.", "title": "Sexy stylish and fun", "user": "farrowp", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 118352678}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "A word of caution: if you arrive by tram or bus, the hotel is a 25 minute stroll or three stops on the underground. Alternatively, if seized by a moment of madness, you take a taxi, expect to pay arond 35 Euros for a sub -10 minute journey.", "title": "Nicest hotel in Stockholm", "user": "CascaisMane", "date": "September 16, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118185837}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "A Super Trooper hotel and a lovely city, so long as you avoid the taxis and drink in moderation.", "title": "Probably best hotel in Stockholm.", "helpfulness": 1, "user": "birddogilainen", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 118184512}, {"rating": 2.0, "stay_parameters": "Stayed November 2005", "text": "Spent the weekend at the Rival and choose the hotel after reading the reviews. OK the good points - 300m from the underground with good access to Gamla Stan and shopping areas, located in a quiet square, helpful staff...", "title": "Disappointing", "helpfulness": 9, "user": "Redbaytraveller", "date": "November 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4129372}, {"rating": 5.0, "title": "Amazing!", "text": "On the negative side - noisy bar packed with 'non-guests' and no seats! Cinema queues in the lobby blocking all entrances, poor breakfasts, small rooms -more style than substance. Don't go at the weekends -its noisy, crowded - won't stay there again.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 16, 2005", "id": 4121062}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Sorry i didn't enjoy it -", "title": "Great atmosphere", "user": "hobbit123", "date": "November 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4120668}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Brilliant hotel, very clean and modern, pretty good location, very helpful staff. It's nice to stay in a hotel that doesn't adhere to the boring hotel style that most places do. One of a kind, each room is apparantly slightly different. Ours had a huge flat screen tv, playstation and dvd player (you can hire dvds from reception) the colours in the room were very inviting and relaxing too and there's a funky window with blind between the bathroom and bedroom which makes for much amusement. one of the best i've ever stayed in and i've stayed in a lot of places! one small drawback, if you're there on a weekend and not completely drunk, the music from the bar downstairs sounds like it's in the bedroom with you and goes on til around 2/3am?, so maybe not great if you're putting kids to bed...", "title": "One of the best", "user": "chris57500", "date": "November 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4107314}, {"rating": 4.0, "title": "Perfect spot to modern Stockholm", "text": "We stayed in the Rival for two days 11th - 13th Nov and really liked the Hotel. It was in a great location close to the shops and just a short work to the Old town. The rooms were small but practical however, the breakfasts more than made up for it (despite it being nearly midday we weren't made to feel pressurised to leave)!", "helpfulness": 3, "user": "Michael B", "date": "October 13, 2005", "id": 4019151}, {"rating": 4.0, "title": "Good - but is it the best?", "text": "Stayed here for a short break last Summer - chose it because it was top rated on Tripadvisor, and because it's part owned by Benny from ABBA...", "user": "EuroLondon", "date": "April 24, 2010", "id": 62328824}, {"rating": 5.0, "title": "Funky hotel", "text": "I agree with one of the previous reviewers - it's a great hotel, but I'm not sure if it's the very best in Stockholm.", "user": "MarkPP", "date": "April 13, 2010", "id": 61187732}, {"rating": 5.0, "title": "Definetly Recommend!", "text": "Decent location - not in the City Centre, but in a pleasant enough residential square, and a short walk to most of the main attractions. The surrounding area is kind of trendy/up and coming, so perhaps it's a bit more interesting.", "user": "helveeta", "date": "April 11, 2010", "id": 60964942}, {"rating": 4.0, "title": "GREAT! But is it the best one around?", "text": "Fairly expensive for what you get - stayed in a deluxe room, which was a decent size, but not massive. Comfortable bed. Decent bathroom with separate bathtub and shower cubicle. The wall between the bathroom and the bedroom is glass, but there's a venetian blind system if you're shy... Some nice touches - dvd player, free dvd rental, and a giveaway CD to take home, featuring the staff singing a jaunty little Abba-style song. And there's Swedish movie-themed artwork on the walls.", "user": "PerfectStay", "date": "March 26, 2010", "id": 59613512}, {"rating": 5.0, "title": "Definitely a keeper!", "text": "Had breakfast in the hotel each day - the restaurant is quite fun. Lots of red velvet, felt quite cool. Decent spread, plus also the usual stuff to order.", "user": "Dollyna", "date": "March 4, 2010", "id": 57727254}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Nice, clean, and trendy hotel with friendly and professional staff. The superior room was a decent size, though not overly generously sized. A bowl of chocolate covered toffees were in the room, and re-filled every day -- yummy! The breakfast buffet was ok, but just ok. There was an area with computers to use by the guests and free coffees and biscuits, which was nice (although the biscuits ran out from time to time, so staff ought to check this regularly). I hope people weren't gorging on them, although that might have been the case, in which case that's pretty low. The whole hotel is very stylish, and the bar area in the cinema lobby was particularly stylish. It's in an ok area, easily accessible by the undergound train. We walked into town, which was a fair walk, but perfectly ok. For shoppers, please be aware that shops close really early in Stockholm, especially at the weekends (between 4 and 6), and most smaller shops are closed all day on Sundays. The shops I wanted all closed at 4 on the Saturday and were closed on Sundays, so I didn't get much shopping done. Some of the bigger chain stores are open on Sundays as well. Just a word of caution there if you want to get some shopping done.", "title": "Really nice hotel with nice staff", "user": "Foreigner_in_London", "date": "April 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 103463263}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We have been home for a day or two, and I can't get 'Dancing Queen' out of my head. We met our college daughter (who's studying abroad) for a weekend at the Rival (pronounced ree-VAL) and it was terrific. The room was comfortable , the heated marble bathroom floor was a treat, the overhead rainforest shower head was a delight, and the breakfast was terrific- we ordered omelettes and french toast, but I would go back just for the croissants- awesome. The 'pillow menu' meant that each of us could choose our favorite type of pilow, which was fun. And we couldn't resist playing the ABBA CDs (and others) and piping the music into the bathroom. When my husband opened his shaving kit, he realized that he had unexpectedly gotten through security in the US and in Germany with his Swiss army knife, and he didn't want to risk trying to get home with it too. He took it to the front desk, where they promised to mail it home, and it arrived at our house just a day after we got home. Terrific front desk staff.", "title": "My husband's new favorite hotel", "helpfulness": 3, "user": "Gemini607", "date": "March 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 102094708}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We took a taxi from Arlanda airport, after agreeing on a 490 SEK fixed price. We returned to the airiport with Taxi Stockholm, thinking it was a 520 fixed price, but they charged us 577SEK, which was really annoying.", "title": "Excellent Hotel, Great Stay", "user": "Blondie1980", "date": "March 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101530702}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "It was a 20 minute walk from the hotel to the Grand Hotel, and just over 20 minutes from the hotel to the City Hall. We thoroughly enjoyed our stay and would highly recommend it.", "title": "friendly and superbly professional service", "user": "Oskubuska", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99927648}, {"rating": 4.0, "title": "Staying with Abba", "text": "We booked this Hotel for our honeymoon to Sweden and we weren't disappointed with our choice. Great hotel, staff and location. The only downside was our room was on the small side, but it was clean and tidy and had everything we needed for our week's stay. The Hotel is in good walking distance to many local attractions and into the centre of Stockholm. The staff were very friendly, efficient and helpful. The in-house restaurant is slightly expensive for a meal, but then this is to be expected in Stockholm. The staff in the bar were particularly friendly and I can highly recommend their cocktails!!", "helpfulness": 5, "user": "travelust72", "date": "March 11, 2011", "id": 99746452}, {"rating": 5.0, "title": "fabulous time", "text": "The Hotel Rival was excellent. Fabulous decor - just as you would expect from the Swedish! The Staff were really helpful - the receptionist helped us orient ourselves on the first day. The hotel includes a good restaurent, a cafe and a cinema (bizarre but cool!). The staff were lovely and made us feel really welcome. The best thing? The breakfasts ... mmmmm yum!", "helpfulness": 3, "user": "caseydee", "date": "February 28, 2006", "id": 4563765}, {"rating": 5.0, "title": "Perfect hotel", "text": "We spent a three day winter break at the Rival. We had initially booked a Superiour room, which looked great, but upgraded to a deluxe room on arrival after being tempted by the extra floor space and large window with great views over Mariatorget Square. This also featured the window from the bathroom into the bedroom, handy for watching Swedish Telly whilst in the bath or just checking up on your partner!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 7, 2006", "id": 4441019}, {"rating": 5.0, "title": "Best Hotel in Stockholm!", "text": "The whole hotel is very trendy but also feels very cosy. The restaurant and bar are good, but even better is the fantastic Cafe which is really lively and seems to attract a lot of locals. You can have a very good (and slightly cheaper) light evening meal here. All the staff (and it seems every one in Stockholm)speaks perfect English and are very friendly.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 12, 2006", "id": 4347954}, {"rating": 5.0, "title": "Great Location, scrumptious beds!!", "text": "Like the whole of Stockholm, the hotel and Cafe seems very child-friendly. I don't know if Stockholm is having a baby boom but I have never seen so many (well behaved) children in my life.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 10, 2006", "id": 4335316}, {"rating": 5.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "This is the best hotel I have stayed at in Europe and it would have been tempting to stay inside if it were not for Stockholm being such a fantastic city to explore. PS Don't miss the Vasa Museum.", "title": "Yes, it's as good as they say", "helpfulness": 8, "user": "mypitboss", "date": "November 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4146611}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed at the Rival for 4 nights (it was originally going to be for only 2 nights but we loved it so much we extended our stay) in August.", "title": "A hip hotel with an eye for detail and a great location.", "user": "LaPage", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116693702}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The staff were brilliant - very helpful and spoke amazing english! We would ask them for recommendations and we also borrowed Boules from them to play in the park opposite and they have an extensive DVD library which we made a lot of use from also.", "title": "Fabulous hotel!", "user": "RoamerLosAngeles", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116679750}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The balcony room we stayed in was large and the balcony overlooked the park and had a lovely flower box on it to add to the warm feel of the area. The room had CDs and DVDs you could access and the bed was very comfy and fairly large. The bathroom was the best part - heated floor, large bath tub for 2, a huge shower and great lighting and speakers for the music so you could listen to that also if you so wished in the bathroom.", "title": "Stylish, comfortable and well located!", "user": "lucarotterdam", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116609736}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The breakfast was hearty and the rolls from the bakery downstairs were delicious. The bar area was very cool and the balcony overlooked the park. The cafe / bakery downstairs was heavenly and a fair price for the wonderful selection of food and wine. We regularly bought meals here and took them up to our room to eat on the balcony.", "title": "Trendy hotel, love to get back.", "user": "Stan1972", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116597849}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Soder - the area itself is a buzzing, young, laid-back place - which is very accessible to the museums and the old town.", "title": "Fabbatastic in Summer Night City!", "user": "metroburns", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116439582}, {"rating": 5.0, "title": "Just Right!", "text": "I highly recommend the Rival for anyone looking for a less conventional place to stay in Stockholm. The room was quite comfortable, with a great bed, a delightful balcony and the requesite ABBA cd (the hotel is owned by Benny Andersson). The breakfast was terrific, and extras like yummy Swedish pancakes and capuccinos were included with the smorgasbord; there was no need to eat for the rest of the day. The neighborhood is great - on a quiet square but one block from the Metro and lots of cool shops.", "user": "NewYorkPickytraveler", "date": "May 12, 2010", "id": 63922750}, {"rating": 4.0, "title": "Cool Digs in Stockholm", "text": "This is the place to stay if you want an off beat luxury and yet trendy hotel. The standard rooms are small but have all the essentials-even the pre-requist Abba music for the in room cd/dvd player! Fun plus is the in room teddy bear!", "user": "Travelers-4MA", "date": "May 9, 2010", "id": 63691212}, {"rating": 4.0, "title": "Lovely hotel in Sodermalm", "text": "Breakfast is excellent and served in the perfect dinning room- with a view over the delightful park/ fountains of this Mariagret square. Location is great- surrounded by artists and small designer/boutique shops and excellent bakeries. Walking distance to Sulssen and Garam Salam. Only complaint is that they could not locate my essential date book- which I left behind by mistake.", "user": "jamien19", "date": "May 9, 2010", "id": 63620836}, {"rating": 4.0, "title": "Wonderful Hotel in Sodermalm!", "text": "We stayed here in august 2009, at the start of our Swedish tour. The hotel is stylish and the staff extremely friendly. The location worked well for us, with bars and restaurants nearby and we were able to use the metro to get to all of the city centre sites. The breakfast was included and was exceptionally good. Our room was a little on the small side and the shower flooded - nothing we couldn't deal with but we hardly spent any time in the room. If you needed to spend more time in the hotel the small room and the odd shower arrangement could be a worry.... Overall a good base in Stockholm. Great cocktails in the stylish bar as well!", "user": "southie_and_middsy", "date": "April 29, 2010", "id": 62785861}, {"rating": 4.0, "title": "Comfortable Stylish and Friendly especially in a crisis!", "text": "We stayed here last June on our honeymoon in a Standard Room on the 3rd floor. Our room was small, but it worked well because there was efficient storage space. That is to say, there were closets in which to store our luggage, and the safe had a wall socket so we could charge our cell phones and cameras securely. As my husband just said, \"Small but perfectly formed.\" The sheets and bed were very comfortable - high thread count! The bathroom was massive by comparison, and I loved the shower. Our room opened up onto a residential courtyard of sorts, so we were away from street noise but got fresh air through our open windows. The decor was modern but not eccentric, and I really loved the reading alcove. There were also free DVDs and CDs available, in case we got tired of wandering around Stockholm. The staff were friendly and offered great dinner suggestions.", "user": "rthomp", "date": "April 25, 2010", "id": 62402655}, {"rating": 4.0, "title": "Funky, Friendly With Good Location", "text": "For our 48hr whizz tour of Stockholm a friend recommendend Hotel Rival. We were not disappointed. Upon arrival you actually enter through the impressive cinema foyer lots of bright colours and even a bed in reception! The staff are very friendly, speak very good english and are there to help you. We had a deluxe room overlooking the park which was lovely (and quiet too). The room is amazing, not to mention the bathroom which has a window through to the bedroom so you can (there is a blind to pull down also) watch TV on the flat screen wall from the bath! Genius! Sooo relaxing, and the bed is even better, and the little teddy that welcomes you is a nice touch. We did have a problem playing the rented DVD but with a quick chat from the guy on reception and it was sorted. I have to say also that the under floor heating was very welcomed on a cold September morning!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 20, 2005", "id": 3925419}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The underground is near, as is a station for the overground train that takes you to Stockholm central for coaches to airports. The hotel is within walking distance to many restaurants and shops but without being touristy. A very safe area to go wandering around in and very funky (Sodermalm is the cool area of Stockholm). Only problem is we arrived on a Sunday to find many of the restaurants/tourist sites closed so do be aware of this.", "title": "The hotel in Stockholm", "helpfulness": 6, "user": "katrineCPH", "date": "September 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3835745}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I wouldn't say it was a cheap stay, and though the food at the gorgeous cafe adjoining it was lovely, it was about £15 for two sandwiches and juices! But the hotel on the whole was lovely, it's a shame the 'honesty bar' has closed as that sounded fun. As a couple doing sightseeing in Septemeber we were slightly overshadowed by a large busy conference that was going on - but at least the place had a vibe!", "title": "Stylish and Brilliant", "helpfulness": 5, "user": "Crazy-Gracie", "date": "August 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3814634}, {"rating": 5.0, "title": "Best hotel in the World !!!", "text": "We - me, husband, daughter aged 4 and my parents (in their 60s)- recently stayed 4 nights at this wonderful hotel.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 22, 2005", "id": 3795459}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "My parents had a deluxe double room and the rest of us, having originally booked an executive double, got upgraded to one of the suites. Since we had a small child with us this was really great - spacious suite with enormous balcony overlooking the back at the hotel, with wonderful views of churches etc, and of course the dvd (we knew there would be one and had brought some of our daughters favorites!) came in handy after a long day of sightseeing. The bathroom was wonderful, the furniture just right and the bed very comfortable. They have a pillow menu that you can choose from if the one provided does not suit you. There were some cds and dvds in our room , and the hotel has dvds for rent as well.", "title": "Rival, We will be back!", "helpfulness": 3, "user": "bugattiPD", "date": "August 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3768170}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Overall, we found this hotel didn't quite live up to its reputation and price. The room was rather small and not really special in terms of design and asthetics, in light of the price we paid. The one good thing was the bed, which was comfortable and had good quality bedlinen. The bathroom was particularly small, and the toiletry supplies were not refreshed after the first night (the open shower gel and shampoo bottles were still in the shower).", "title": "Not that impressed", "helpfulness": 1, "user": "CM002", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 113099384}, {"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "The breakfast buffet was nice, with good quality foods, and it was great to sit outside on the balcony. However, breakfast service was poor, the table was dirty, and we had to set it ourselves by stealing the cutlery, napkins, etc from other tables.", "title": "Great location and fun design hotel", "user": "misselaneyous", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 112869854}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Just 15m walk from the gamla stan, great stop in stockholm. The abba credentials certainly intrigue... Was it wasnt overtly \"abba branded\" and just a nice place to stay. Some great touches, notably cafe adjacent to the hotel and coffee/computer stations on every level which were really useful for work (and getting a cappuccino before doing so!). If you were forced to find fault, the minimalist design possibly a little old fashioned (hard lines, quite small rooms, red everywhere!), but all in all a very nice stay.", "title": "Great Hotel", "user": "NWTraveler73", "date": "June 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 112037228}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We thoroughly enjoyed our stay at the Hotel Rival in July, 2010. As others have said, it's modern, chic, and hip boutique hotel with alot of shops and restaurants within walking distance. Staff was very helpful in suggesting a restaurant for dinner. We enjoyed the breakfast buffet. Our room was nice with a comfortable bed. I love the music and DVD selection which is a nice touch. We would definitely stay here again if we were in Stokholm.", "title": "Top notch", "user": "trasbash", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 110741867}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Fantastic hotel with a great little cafe, friendly and helpful staff, neat little touches and a seriously comfy bed.", "title": "Cool and chic hotel that needs just a bit of attention to detail", "helpfulness": 1, "user": "cdn_laowai", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 109542673}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We took two rooms here in August for three days. One superior double room and one standard single room for our son. Both rooms were very clean and comfortable. The single room was small but perfectly adequate for one person. The location in Sodermalm is a plus as it is a short walk to Gamla Stan Old Town, while still offering a local, young and vibrant neighborhood. As there were no tour groups, breakfast was relaxing, not crowded, and offered a great quality and variety experience. While the wait staff did not approach us for our orders, when we asked for coffee or custom cooked orders they were happy to meet our requests with a smile. The staff at the front desk was extremely willing to offer advice and assistance with our questions. They advised us not to buy a Stockholm Card unless we planned to visit a great number of museums. Instead, we bought tickets on the Hop on Hop Off Bus that were good for two days and we used this for most of our transportation. The Cafe in the hotel was just ok and a bit expensive. If you exit the front door and turn right there are several cafes with better quality and value. There is a 7 Eleven to the right coming out the front door, and even better, leaving the 7 Eleven there is a Coop grocery store right across the street. There is a charming park outside the hotel. We highly recommend this hotel.", "title": "Very satisfactory", "helpfulness": 2, "user": "Shanghai_8", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117095380}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "After our first two nights at another very good hotel in Stockholm, we were worried about our decision to change hotels. However, since I spent my formative years listening to ABBA (don't judge me by my taste in music), I insisted that we stay at the 'ABBA Hotel', the Hotel Rival for a couple of nights. We were not disappointed. It was very different from our previous hotel. We liked it equally, but for different reasons. The whole concept of the Rival is great - an old theatre (and apartments) turned hotel. The hotel bars and restaurant are reminiscent of the grand era of theatres of days past. Also, from the lobby to the bars and rooms, the hotel has a very retro feel. The neighbourhood is also interesting and the hotel is still an easy walk to the old town and other sites. We very much enjoyed our stay - from the ABBA (and other) CDs in the room, to the variety of DVDs that can be borrowed from the front desk. The coffe/tea alcove on the 4th(?) floor was also great. Breakfast was amazing but as per previous reviews, the staff are not too attentive so if you do want an omelete or pancakes, i.e. a special order, you may have to go to the cashier area to get a waiter/waitress to take your order. In our experience, they were not milling around the tables. The service could have been better. However, we would definitely go back and next trip to Stockholm, we may be splitting our time between two hotels again!", "title": "'I do, I do, I do......love you' (the Hotel Rival)", "user": "Faith N", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117080255}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Our stay here was 2 nights while in Stockholm waiting to board our ship, Oceania Insignia.", "title": "Wonderful Boutique Hotel", "user": "jtamchay", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116798905}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I found this hotel online and we received their summer special rate for a deluxe double with air conditioning, 1850 SEK.. The room was clean, large and overlooked the park across the street. The bathroom was large and had a tub and a free standing shower area. The amenties included hair products, body lotions, tooth brush and paste and shaving cream with blade.", "title": "Well done Benny Andersson!", "user": "PeterSummers", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116733110}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We ate in the restaurant and the food was very good although the dinner menu is limited. Breakfast was included and it was a hot and cold buffet with a huge variety to choose from.", "title": "Charming hotel and friendly staff", "helpfulness": 1, "user": "AlohaHonolulu", "date": "August 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116728850}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I have been a guest since the opening.", "title": "The best hotel of all", "user": "Susanne H", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117836241}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I am staying in Rival every month of the year", "title": "Lovely place, great services", "user": "camiceblu", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117693425}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I travel all over EU and US.", "title": "Absolutely loved the hotel", "helpfulness": 2, "user": "StellaKvB", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117367429}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "No hotel is as nice as Rival. Why: kind, helpful employees, the same people. Makes you feel like home. Clean room and perfect beds. Cotton wool on the beds, nothing artificial.", "title": "Stylish, comfortable and well located", "helpfulness": 2, "user": "M Jawad S", "date": "August 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117345728}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Can not be any better.", "title": "Stockholm's best chic hotel in sodermalm", "helpfulness": 1, "user": "gregk10", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117303696}, {"rating": 5.0, "title": "My favorite Hotel while in Scandinavia, nearly perfect.....", "text": "Can't write enough good things about this hotel. On this trip spent time in a legitimate five-star in Copenhagen and a supposed five-star in Oslo and this was by far the very best of the three. The location is adequate with a nice park across the street from the hotel where locals congregate, it is not very far from the downtown Stockholm area, the staff polite (in spite of me making myself a nuisance more than once), and the cafe and restaurant food delightful. There is an in-house theatre during the Fall - Spring, big screen TV's in each room, internet access for all, and a fairly lively bar with the coolest lounge chairs ever!! No tubs if that's your thing. My Pet Peeve while there: the doors to the rooms are heavy, and slam shut loudly. Do the Hotel Rival, you'll appreciate yourself for it.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 13, 2005", "id": 3759915}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Agree with almost all previous comments. Great hotel, well designed, friendly staff, great buffet breakfast. Loved the location. \"Budget\" room booked on Internet was small (pack light) but well designed. Location at the back of the hotel was quiet, and we even picked up a free wi-fi signal from a neighboring apartment. Got a peak at one of the rooms with balcony at the front--much more spacious, but not worth it for us, as we spent very little time in the room. Too busy exploring the city.", "title": "Ratings right on target", "user": "sasthije", "date": "August 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3753529}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Such a great little hotel. The room was small but very well designed and so you didn't mind-- great big tv on the wall, good design, and nice shower. You almost have the feel of staying at a friend's studio apartment, as it is very cozy and functional. The bed was a bit soft in case you have a bad back, but very comfy all the same. The staff were all very friendly and the breakfast was very good and served late! The location is very nice, on a beautiful and quiet little square in what is a very hip little neighborhood. We got a good rate online, which meant we got a room on a low floor facing the back, but we still got great light and it was still quiet (despite being just a floor or two above the bar).", "title": "Great hotel", "helpfulness": 1, "user": "gvaguy", "date": "August 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3744925}], "location": {"country": "Sweden", "continent": "Europe"}, "stars": 4, "variance": {"poor": 17, "average": 30, "very good": 223, "terrible": 2, "excellent": 586}, "aka": "Rival Hotel Stockholm", "slim_ranking": 0.00621118012422, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Hotel Rival is Stockholm's first boutique hotel, located on Sodermalms heights in classic premises in Stockholm. The Rival is a small, modern, individual hotel with unique top-level service. The 99 rooms have high technical standards with an unique interior decorations as well as Internet access. The seventh floor, with its magnificent view, is reserved for suites. The classic cinema Rival has been meticulously renovated and equipped with the latest in multi-media technology. The movie theatre will accommodate 700 conference guests, and the premises are well suited for events and meetings. There are 5 more conference rooms and a generous foyer outside the theatre for exhibits and mingling. The cocktail bar (original art deco), the bar, the bistro and the café will serve both hotel guests and local inhabitants."}