{"user_rating": 4.0, "review_count": 148, "name": "Hotel Deutscher Hof", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Driving into Trier without any hotel reservations, I visited the local Tourist Information office. I provided them with my price range (under 80 euros) and this was one of the recommendations. For 69 euros, I received a typical single bed room in a very nice hotel. The hotel property and room were very clean and the staff was very pleasant. I believe you had to pay all of 2 euros for a wi-fi connection...a very reasonable price! The off-street parking cost 2 euros/day...a bargain! They were just a short walk away from the lovely downtown. I would highly recommend this hotel.", "title": "Glad I stumbled across this hotel", "helpfulness": 4, "user": "Bill L", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 16349049}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We stayed at the Hotel Deutscher Hof for one night at the beginning of Easter on the way to Luxembourg.", "title": "Good Hotel", "helpfulness": 2, "user": "wareinbelgium", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14631576, "likes": {"liked": "— Friendly Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "It was a nice quiet hotel but very effecient and helpful staff. We did arrive late as we got lost en route and trying to find the hotel in Trier. Breakfast was plentiful and popular.", "title": "Great value", "helpfulness": 3, "user": "Smems", "date": "February 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13237405, "likes": {"liked": "— Staff and spacious rooms"}}, {"rating": 5.0, "title": "Great hotel with lovely staff and good food", "text": "We were going to drive to the Porta Nigra but the receptionist advised us that is was an easy walk. We took the advice and found that walking to most of the attractions was easy and pleasant, despite the cold (zero) weather.", "helpfulness": 4, "user": "FANDA", "date": "December 14, 2007", "id": 11547270}, {"rating": 5.0, "title": "whauw", "text": "Great value hotel, stayed for one night on business and it only cost 62euro. Staff were very helpful, the wi-fi wouldn't work on my laptop, and they guy at reception did everything he could to try and get it to work (which it didn't in the end, but I don't hold that against the hotel, that's just my laptop!). Very clean and spacious rooms. Comfy beds, and just a walk from the city centre. Another plus, free parking for guests. Didn't get a chance to use the leisure facilities but was delighted that a 3 star hotel actually had them. Next time!!!", "helpfulness": 4, "user": "PVK3005", "date": "July 23, 2007", "id": 8223017}, {"rating": 4.0, "title": "deutsher hof for a good experience", "text": "We have just returned from a long week-end in Hotel Deutscher Hof in Trier. The hotel is excellent. It is very well run and maintained and is spotlessly clean throughout. The level of service is exceptional .. ALL staff are extremely efficient and are really helpful & friendly. The Wellness are is really nice and very relaxing. The continental breakfast is one of the best we have experienced.", "helpfulness": 5, "user": "briannewman", "date": "February 20, 2007", "id": 6815671}], "location": {"country": "Germany", "continent": "Europe", "city": "Trier"}, "stars": 3.5, "variance": {"poor": 3, "average": 20, "very good": 70, "terrible": 1, "excellent": 54}, "aka": "Deutscher Hof Hotel", "slim_ranking": 0.191489361702, "description": "Just like home – only more relaxed...Hotels are places where the daily routine is left behind. You’re the guest of people who have your best in mind. And sometimes even a bit more than that. That’s the way it is with us.Where we are: right in the middle of Roman Trier, there where the forum was. What we are: whole-hearted hosts. You can see that from our many loving details. You can feel that from the careful way we create atmosphere. And you can even taste these details: it’s not just our jams that are homemade. It’s the personal accents that make the difference. That’s why our guests return again and again."}