{"user_rating": 4.5, "review_count": 755, "name": "Hotel Santa Fe, The Hacienda and Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We really needed a break away from children so were not necessarily looking to have a condo-style hotel (which this is not), but sort of now wish we did because we had to go out for every single meal and the plaza is not close at all or easy to park in. At the time we booked, we thought we would be able to walk to the plaza, but this was not practical at all and we ended up taking turns going out for take-out and then coming back to our room, which was very nice (but small). Over all this was a decent Santa Fe visit, but you really would not want more than 2 humans in a room there.", "title": "Nice hotel but far from plaza", "user": "Ollie4u", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 16370019, "likes": {"liked": "— Nice building architecture in line with Santa Fe community", "disliked": "— small rooms and distance to plaza"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I stayed here for a writers conference I was attending. This property has a nice small intimate feel to it and yet has the services of a larger hotel, including a terrific spa. The staff almost without exception goes above and beyond without being intrusive. Eloy at the front desk goes out of his way to make you feel welcomed, and nothing is too big a problem to handle. Nothing was ever a problem for Eloy, he always met every request cheerfully. The waitresses in the restaurant were always happy to help out, even with my challenging dietary restrictions. They didn't mind at all getting the kitchen to make a variation on a menu item so I could eat it. At dinner time, they never glared when asking for multiple refills of bread or drink, always happy to accommodate. Breakfast here is excellent and while the buffet is fine, I recommend the hot items on the menu, which I felt were very reasonably priced. I think the hotel has one of the better breakfasts I've had during a hotel stay. I highly recommend getting a junior suite over a room, the living area of the junior suite makes all the difference. I was happy to have a mini-bar with fridge and a microwave to boot. I just felt really at home here. I had writers come up to my suite and the front desk was always happy to phone housekeeping to do an early make up of my room so it was ready for my visitors. Really, this property felt like a home away from home. It's a ten minute walk to the historic plaza. But what's really cool is they have a London style cab that will shuttle you around town. (Be sure to tip, though the service is free). I also tipped the maid 5 dollars a day, and you know it was much appreciated and my room was always cleaned to perfection. The trick in always staying at a hotel is letting people know you appreciate their effort with a thank you and a tip that's deserved. There is construction currently going on near the back of the hotel and you might want to ask for a room away from the construction. I was away from the construction and could not hear it at all. Not in the slightest. Definitely definitely get a balcony room and again go for a junior suite. I was very happy here and was sorry to leave. Oh by the way, some have had negative comments about the bed sheets being rough, I thought they were just fine, and the bed was very comfy, didn't want to get out of bed in the morning. The towel supply was excellent. All in all a hotel in the city section of Santa Fe that is intimate, friendly, and homey. One last thing, I had left a document on a banquet table, and hours later couldn't find it. The staff dug through the garbage and found it, this was above and beyond.", "title": "A nice base for visiting Santa Fe", "helpfulness": 3, "user": "Hgood1", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15994485, "likes": {"liked": "— the homey feeling of the place"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "Staying at this hotel was a truly relaxing experience. Staff was helpful. Place was quiet, a fire always going when we were in the lounge having a plentiful breakfast and a late afternoon snack. Found the shuttle service easy to use and economical. The spa personell were great, as everyone we had contact with during our stay.", "title": "Wonderful", "helpfulness": 2, "user": "springful", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 15445800, "likes": {"liked": "— relaxing atmosphere, flute music, art pieces, fresh fruit", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "I'm actually there as I write this, and looked at past reviews and was surprised at some of the negatives. This is my - our - fourth stay at the Hotel Santa Fe, and it has come to feel like home to me. We are in one of the junior suites, which has a separate sitting room, so that two people can comfortably spread out. The amenities of the room are cozy, clean, and adequate.", "title": "I'm Always Content Here", "helpfulness": 4, "user": "dedalus449", "date": "April 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 14936193, "likes": {"liked": "— The warmth that is felt everywhere. The hotel seems to like itself.", "disliked": "— A bit of a longer walk to the plaza than I would like."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "But what I really like are the public spaces: the dining area, the lounge area, where in the evening they have a fire going, the general bustle and warmth of the place. The decor is Native American, but not intrusively so, as at La Fonda. The staff acts as if they like being here, and the general sense of service is first rate.", "title": "overrated", "helpfulness": 2, "user": "MinnesotaTravelindog", "date": "February 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 13844981, "likes": {"liked": "— Style", "disliked": "— cramped"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We relocated from Arizona to Florida recently and took the drive across country to move. I have always wanted to visit Santa Fe, so we stopped there for our first night. We had our dog and a truck full of luggage so we needed to find a place that we were comfortable with. I read a bunch of reviews on Trip Advisor and decided on the Hotel Santa Fe and really enjoyed it! The hotel was beautiful and the room was spacious and clean. We stayed in a junior suite and loved that there was a separate room with a couch and a TV that we could stretch out in and that it was inexpensive. We also didn't have any problems with our pet staying there. The only hitch we had was that the internet wasn't wireless, you needed a connection. But we called the front desk and they provided us with what we needed immediately, so the problem was resolved. When we wanted to go to dinner, the front desk was very helpful in giving us suggestionso on where to go. We only stayed one night, but I would recommend it to anyone staying in Santa Fe as it is close to all of the attractions and really has that \"Santa Fe\" feel.", "title": "Great Experience", "helpfulness": 4, "user": "Froggie758", "date": "January 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12766906, "likes": {"liked": "— Very nice and inexpensive and pet friendly."}}, {"rating": 2.0, "title": "Not So Great!", "text": "The room felt unclean and badly needs updating. Smells moldy/mildewy. Bed sheets were clean (meaning washed) but old and ripped, and worst of all made us itchy. Hotel is pet friendly which is great, but I'm allergic to pet hair and got the feeling pets had been in the bed previously (thus causing the itching). Shutters on patio doors broken. Semi close to downtown; free shuttle was great and easily available. Overall, I do not recommend this hotel!", "helpfulness": 3, "user": "MsAmer1693", "date": "January 12, 2008", "id": 12559573}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Loved the architecture and furnishings. Very good value. Within walking distance of the Paza but not too convenient.", "title": "Loved It", "helpfulness": 2, "user": "talwazir", "date": "January 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 12199164, "likes": {"liked": "— Ambiance", "disliked": "— Distance from plaza"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "For your typical Santa Fe vacation, with lots of plaza-bound walking, this place is okay. The location is a bit farther than we wanted which made walking into the plaza area at night a bit unreasonable. (So too did the weather but that was more unexpected). Hotel Santa Fe is fine, but not as great as we expected based on all the descriptions. Our room had a decent view of the mountains despite the parking lot foreground. We were also next to the guest laundry which resulted in some odd sounds coming from the bathroom in the middle of the night. The furnishings were quite typical for a more 'traditional' room and the bed was nice and firm. Lots of pillows too. In terms of price it was very reasonable with the Expedia rate, and considering the time of year and other rates, it was the best going for a 3star and above room. The in-room internet was supposedly 9.95/day (completely within 'fancy' hotel range) but we were able to hook up to a free wireless internet without problems (likely from the next \"less fancy\" hotel down the road). In all the Hotel Santa Fe was fine, but not close enough for walking, not enough character for being farther away. In sum, it was unexpectedly plain.", "title": "Hotel Santa Fe--Unexpectedly plain", "helpfulness": 2, "user": "Gazoots", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 2.0}, "id": 12198412, "likes": {"liked": "— supporting Native American owned business", "disliked": "— just so plain for what it could be"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "My wife and I visited Santa Fe the week leading up to Christmas 2007. We have stayed at a few hotels in Santa Fe over the last several years, and this year, based upon a recommendation from a friend, we booked a room in the Hacienda section of the Hotel Santa Fe (the only Native American owned hotel in Santa Fe).", "title": "Great Hotel Off the Plaza", "helpfulness": 3, "user": "FlyingGeese", "date": "December 31, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 12154102}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Living in the area, I’ve passed the Hotel Santa Fe on numerous occasions. When booking a room in Santa Fe, I’ve never considered this property because of its location. It’s off the beaten path of anything typical in Santa Fe. Too many blocks from the plaza for an easy stroll, yet close enough to not justify driving a car to and fro, it’s never seemed the ideal location. (In the end, it’s about a 15 to 20 minute walk each way to the main action of the plaza.)", "title": "Significant stroll from Plaza but nice", "helpfulness": 3, "user": "Muriel12", "date": "October 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 21016244}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The Picuris Pueblo of New Mexico holds majority ownership of this hotel. The property features adobe design and is decorated with Native American/New Mexican-style artwork and furniture. A bit over 15 years old, the hotel is beginning to show a need for renovation, but it has not lost its overall appeal and edge.", "title": "Dated but charming; exceptional service", "helpfulness": 3, "user": "Mike_D_Ann_Arbor", "date": "August 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 19546539, "likes": {"liked": "— Everyone on staff was amazing.", "disliked": "— The sad old pine furniture in the rooms needs an upgrade."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I had been booked (via a conference rate) for a traditional king. I arrived late in the afternoon and was upgraded to a Santa Fe suite. Under normal circumstances, this upgrade would reflect about a $50 upcharge. My room had a small living/sitting area with a fridge, sink and wetbar. Adjacent to the sitting area was a small balcony (only large enough for standing—not sitting). Through an archway was the king-sized bed. Both the bedroom and sitting area featured traditional tube TVs. The shower/tub and toilet were separate from a small sink area that, in total, comprised the bathroom. The particular floor I occupied also featured complimentary coffee and tea each morning.", "title": "Hotel Santa Fe disappointing", "helpfulness": 3, "user": "Colorado2Travels", "date": "August 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 19205905, "likes": {"liked": "— Location and Pueblo style", "disliked": "— Crowded room in need of upgrade"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "My room was quite nice. The furniture was in good condition and typical Santa Fe design. The carpet was worn but clean. The shower/tub area was the most worn area and could certainly use an upgrade. The bed was ever so comfortable and had a lovely, warm duvet cover. I knew the property was booked on the nights of my stay, so I was stunned at how quiet it was. I can’t remember the last time I experienced such a calm, quiet hotel.", "title": "Nicer than the Eldorado and much better value.", "helpfulness": 3, "user": "gingersnap126", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 18278427, "likes": {"liked": "— Service, hacienda decor,"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "(I should note that a colleague of mine had been upgraded to a room in Hotel Santa Fe’s La Hacienda section. While I didn’t see the room, she said it was stunning. Its configuration sounded similar, with each room being larger and a fireplace featured in the sitting area. Complimentary cocktails and snacks were provided each evening in a commons area near her room.)", "title": "Nice for the price", "user": "NicaCasey", "date": "May 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 16439427}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Although this hotel was a little out of the way, its still a quick walk to all the attractions of downtown Santa Fe. If you don't want to walk they will drive you anywhere nearby in their van or British Taxi Cabs. The hacienda is separated from the main hotel and has added features of a lounge where you can get a free breakfast.", "title": "Great hotel near downtown", "helpfulness": 2, "user": "newtonmatraveler", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 10058616}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The rooms where well decorated and although not huge, quite comfortable and new. We looked at the other hotels downtown and the Hotel Santa Fe is equal to many, but costs less. We found a special deal on Expedia for $199/night. Again, it is not in the heart of the action, but the benefit is that it is much quieter.", "title": "Terrific treat!", "helpfulness": 3, "user": "njtransfer", "date": "October 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 10032735, "likes": {"liked": "— butler and free shuttle service", "disliked": "— long walk into town"}}, {"rating": 5.0, "title": "Very Nice", "text": "After reading all the various reviews on the top hotels in the area we decided to take a chance at the Hacienda@ Hotel Santa Fe.Our check in went smoothly and we were greeted by our \"Butler\" at the front desk-he escorted us to to a separate annex in the back of the hotel which is opened with a gate key for additional security. Our room was on the 4th floor which is really street level- I expressed my disappointment because our view was of the parking lot-our butler called the front desk and asked for other available rooms to show us. We took a short tour and aside from \"upgrading\" at an additional charge we decided to stay in the original room offered us. It was in fact lovely with a gas fireplace and a comfortable sitting area(not bright and sunny)The bathroom was small but quality-my guess is the rooms were recently refurbished. The bed was very comfortable with great sheets and comfortable pillows. There was a bowl of fresh fruit and two bottles of water set on the table with a nice note from the hotel. Our butler showed us the consierge lounge and bought us our first round of drinks . The lounge was cozy and well appointed. There was a very friendly women acting as bartender and hostess. Other guests were friendly as if we were in a friends home. The hotel offers free shuttle service into town and to local restaurants- many times it was our butler who drove us in and he always reconfirmed our dinner reservations and offered his opinions which were very helpful. We did a lot of tipping which might have been why his service was so attentive but we were happy to do it because this young man was so charming and helpful.(Even bringing extra chocolates to our room) Our deal was wonderful and although the hotel is outside of town(people do walk in) I would stay there again. I even had an 80 min massage for a very reasonable price- the room was not special but I was told they are building a complete spa in the near future. We spent no time in the main hotel and did not eat there(even though breakfast was included) it was a great homebase to come back and relax in after exploring the area!", "helpfulness": 4, "user": "nightfly", "date": "August 25, 2007", "id": 8504578}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Stayed on Friday night. In town on business. The Hacienda (35 rooms) is part of the larger Hotel Santa Fe, which is a few blocks away from the main square. The streets around the hotel are busy commercial streets but it was not noisy. The room was large and comfortable, with a nice tile shower (no bath) and a working fireplace. The bed and bedding were terrific. The room had blinds -- I wished it also had curtains, especially since it was a first floor room. The continental breakfast was mediocre. The staff was very polite and courteous. Parking was very close and free. All in all an excellent stay and perfect for couples.", "title": "Very cute", "helpfulness": 6, "user": "member74", "date": "August 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8466131, "likes": {"liked": "— Pretty", "disliked": "— Very old average age, plus bar closed too early"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "A lovely looking hotel with many little touches which add to the aesthetic, love the wig wam in the back garden though have no idea what the purpose of it was! We stayed in August so the hotel was busy but there was always room by the pool. Never used the free shuttle service as it was very conveniently located for downtown, really no more that a 5 or 10 minute walk. Would certainly go again.", "title": "A great experience", "helpfulness": 4, "user": "UGrunewald", "date": "August 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8429217}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We stayed at La Hacienda which is co-located with the Hotel Santa Fe. It shares common services and check-in is in the main hotel lobby.", "title": "Good Interior Design; Management Problems Pop Up Frequently", "helpfulness": 6, "user": "RalphinSandestin", "date": "October 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 5920928, "likes": {"liked": "— Internet access was very good; art and decor were very pleasant", "disliked": "— Room was not set up well for use with a computer, maintenance problems"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Travellers pay a premium price for the Hacienda, in part because of the unique rooms with fireplaces and butler service. Our room was decorated very nicely, We enjoyed the art in the hallway and the butler was very helpful in bringing our luggage into the room. The fireplace worked well.", "title": "Good location & environment, at a reasonable price", "helpfulness": 5, "user": "Andre", "date": "September 29, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5889642}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Unfortunately, there were problems. Maintenance appears to be a problem generally as there were a few light bulbs burned out and the hallway we were in was dark. We tried to have a sink fixed and called a couple of times but were told that the engineering department was not available on Monday. The sink was never repaired.", "title": "Pleased with the Hotel Santa Fe", "helpfulness": 6, "user": "MarkCC", "date": "September 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5829724, "likes": {"liked": "— Large junior suite", "disliked": "— A little further from the Plaza than I would have preferred"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The room was fairly expensive ($250 or so per night) and included a breakfast bar. The bar included bread, pastry, coffee, fruit and cold cereal. For another $4.00 per person, we could eat in the restaurant and order a hot breakfast. We usually ate the buffet although the last day the buffet was closed for a group and there was a message to go to to the restaurant if we wanted breakfast. The buffet was not bad on any of the several days but was very limited. The Holiday Inn Express locations we stayed in on the trip provided more options. For the extra cost, you can get a breakfast about equal to a Denny's or a Waffle House for about the same as the extra cost but with a carpeted floor and nicer decor while eating your eggs.", "title": "My favorite", "helpfulness": 5, "user": "Englishman1975", "date": "September 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5799278, "likes": {"liked": "— Its a package deal - I love it all. Supreme Comfort", "disliked": "— I wish there was a view of the mountains out of the window but thats a really short drive"}}, {"rating": 1.0, "title": "Never Again", "text": "The butler service sounds good. The reality is that there was often no one available. We ended up finding a hotel cart to take our own luggage out on the last day. Other times throughout our stay we attempted to locate a butler for assistance and usually gave up as no one was available. When taking our luggage out to the car, another guest asked me for assistance assuming I was working for the hotel and they had been unable to find help with their questions or luggage. I could probably have picked up a few extra bucks by offering to help others with their luggage.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "July 17, 2006", "id": 5476116}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stayed at the Hacienda at Hotel Santa Fe from Jan. 8 to 13, 2007. Our room was very similar to that described by the previous reviewer. It was attractively furnished, and the fireplace was most welcome and gave ample heat for the room in the January weather. The service was excellent. The included breakfast was very good. The hotel's location is very convenient if driving, and I would respectfully disagree with the previous reviewer who said one could not walk to the plaza from there. My wife and I did in a 10 minute walk, and we are both 71. The Hacienda offers a happy hour in the lounge from 4:30 to 8:30PM with light snacks and a cash bar. This is where the \"be careful\" comes in. Upon checking out, I found a $30.00 charge on my bill for two glasses of wine which we had there. I checked with the front desk, and there was no mistake- that was the price for the two glasses of wine at the cash bar in the lounge. I wish we had been forewarned, and we would have taken a different course. Except for this rude shock upon getting my bill, the experience was super and we would not hesitate to return (but no wine in the Hacienda lounge!).", "title": "Very nice, but be careful!", "helpfulness": 8, "user": "Toofaraway", "date": "January 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6595180, "likes": {"liked": "— The facility was very attractively furnished, well located, and very comfortable.", "disliked": "— When they host conventions or business meetings, restaurant and parking spaces may be hard to locate."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Fifth visit to Santa Fe, first Christmas visit. Hotel Santa Fe Hacienda was beautiful, clean, with pure Santa Fe decor. Being from San Antonio, Texas, my children, my parents and I loved the hotel and the responsive staff. Not close enough to walk to Plaza, the shuttle was always, and quickly, available. The continental breakfast was nice, in a lovely room overlooking the Santa Fe Railtrain, Santa Fe Basin mountains and local developing tourist area. There was a beautiful fireplace and a Christmas tree in each room of the Hacienda section. We were lucky to see a beautiful snowfall while there and it was a lovely postcard trip. They even provided a wheelchair for my mother to vist the Plaza. I am a real critic, but I had no complaint about this visit. Photos on web site were just as we found it. In all my visits, the was the best value for the cost, butler staff and just plain overall great!", "title": "Lovely Santa Fe experience, and very good value.", "helpfulness": 5, "user": "boerneite", "date": "January 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6563474, "likes": {"liked": "— hotel decor", "disliked": "— Downtown was not close enough to walk"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My wife and I stayed at Hotel Santa Fe for 4 nights. We had a wonderful stay. If we had any regret at all it was that we did not upgrade to one of the small suite rooms. Our room was very comfortable but we did not have a seating area which would have been nice after all day walking the town. Housekeeping was excellent and the basic facilities offer everything you would need. The Hotel is a little further from the Plaza than many of the other hotels but is is very quiet and the two authentic purple \"London \" taxi cabs provide free shuttle service to and from most all Santa Fe attractions and restaurants. This was a very convenient feature and we never had to wait more than 7 or 8 minutes to be picked up. This was a big plus for us. The decor and ambiance of the Hotel is awesome and very authentic. We were very satisfied and would enthusiastically recommend this hotel. As noted above we would suggest an upgrade to one of the small suites, they ae really not that much more expensive.", "title": "Hotel Santa Fe- excellent choice!", "helpfulness": 5, "user": "bilo94", "date": "November 13, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6120813, "likes": {"liked": "— decor and ambiance of the entire facility- on call shuttle service as needed.", "disliked": "— room we selected was a bit too small for us."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We had great meals at:", "title": "The Hacienda", "helpfulness": 4, "user": "aessakelares", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5962665, "likes": {"liked": "— The experience of Butler Service.", "disliked": "— Not a long enough time to stay."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Bistro 315- very intimate and great wine list", "title": "A Wonderful Stay...", "helpfulness": 4, "user": "4evr29", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5929049, "likes": {"liked": "— beautiful quiet private hotel", "disliked": "— nothing"}}, {"rating": 5.0, "title": "loved the hotel santa fe", "text": "Just driving up to the hotel and seeing the beautiful exterior we knew we were in for a wonderful stay. The outside is typical adobe and has wonderful plants and art work around. Checking in was a breeze and as a matter of fact, the young man who checked us in had graduated from where my husband is from. Since the hotel is only 3 floors it is quaint and homey feeling. The room is very nice with a very large bed (comfortable) and one of the best things was the balcony thru french doors to the outside. It was wonderful in the mornings. The bathroom is small - but I don't like anyone else in there when I am - so who cares. We purchased breakfast with our room rate. My husband went down every morning and had a full breakfast and I came later and had fruit. In the evening, the lounge was very nice. Try the fruit passion margaritta. Angela (behind bar) has her own \"special\". The hotel is .6 from the plaza and is a nice little walk. Maybe a little far after staying out all day. We would definitely go back to this hotel.", "user": "ninnasuttle", "date": "July 8, 2007", "id": 8079562}, {"rating": 5.0, "title": "Excellent Hotel", "text": "My wife and I just returned from five nights in the Hacienda section of the Santa Fe Hotel. From the separate key-card controlled entrance, the separate lounge, and the spacious rooms with full shower stalls to the free shuttle service within a mile of the hotel, we thoroughly enjoyed our time at this hotel. Also, we found the hotel restaurant, Amaya, to be excellent as well. We had dinner there more than once, enjoying the buffalo filet, Kobe sirloin and salmon. Our only criticism of the room would be the pillows (down/feather pillows drive me crazy). The art works around the hotel are very nice and the hotel was perhaps the quitest place I've ever stayed.", "user": "Dorkin", "date": "July 8, 2007", "id": 8078690}, {"rating": 5.0, "title": "Super Hotel!", "text": "Beautiful and c lean south-western style rooms. A butler was on duty most of the time to answer questions. Very good continental breakfast each morning, and good appetizers in the evening--all included in the cost. Free New York Times each day. Pretty pool and jacuzzi area. We walked to most attractions near the plaza. It was .6 mi to the plaza itself. Owned by an Indian tribe, and tribal members worked at the hotel. All staff was very friendly and polite. Would definitely stay here again.", "user": "CaliforniaWeekend", "date": "July 3, 2007", "id": 8052965}, {"rating": 4.0, "title": "Just got back", "text": "We just returned from a two-night stay at the Hotel Santa Fe. We booked a jr. Picuris suite; it must be high season, because it was pretty expensive. The room was like two small connected rooms but the opening between them is large -- I guess more like a small bedroom (about 12 x 12) and a small sitting room (also about 12 x 12). The bathroom is also very small, but the shower is excellent. BUT the room was clean and nicely furnished, southwestern style, and most importantly, the beds (including the sofabed) were VERY comfortable. The air conditioning worked well, and boy did we need it - it was close to 100 degrees both days we were there. The hotel's ambiance is very nice and it's location is great -- a short walk to the plaza, but practically across the street from the \"railyard\", the part of Santa Fe now being developed as retail/restaurants. On one of the days we were there, we were so hot and tired by the time we reached the top of Canyon Rd. that we called for the shuttle -- a really nice amenity. Back to the hotel, and right down to the pool/hot tub; also a treat.", "user": "HappyTrails51", "date": "June 25, 2007", "id": 7989063}, {"rating": 3.0, "title": "Disappointing Service by Hotel Staff", "text": "We did not eat at the hotel, but we did eat at two nearby restaurants. For lunch we ate at Cafe Dominic, on the way to the Plaza. What a find! It's a coffee shop, cafe, place to sit and read, etc., etc., Wonderful. For dinner that night, we ate at Cowgirl barbecue, and loved it. We weren't looking for haute cuisine - the southwestern style Philly cheesestead (on a tortilla) suited my daughter just fine, and my T-bone was great, as was my husband's mixed grill. Desserts were delicious and service was friendly and excellent.", "user": "willhh", "date": "May 23, 2007", "id": 7674168}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I stayed at the Hacienda property at the Hotel Santa Fe. We chose the hotel because of the reviews here, the spa service available, the ability to walk to the plaza, and the fact that we were booking last minute and this was one of the only hotels with availability. We had a suite with a King bed and separate sitting area with fireplace. The plaza is about a 5-10 minute walk away. Fine in comfortable shoes, maybe take the shuttle if you are dressed up in your heels for dinner.", "title": "Nice, but not fantastic", "helpfulness": 3, "user": "psmfamily", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 2.0}, "id": 7656306, "likes": {"liked": "— excellent service", "disliked": "— saggy bed, mediocre room, lack of views,"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "What we liked:", "title": "Very Good Stay at Hotel Santa Fe", "helpfulness": 5, "user": "mmob100", "date": "May 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 7571638}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "There is a small spa room right at the Hacienda. It was nice to be able to get a massage and then be able to go back to our room without even having to walk outdoors.", "title": "Hotel = Great. Staff = Not as great", "helpfulness": 4, "user": "Norcal.Vaughan", "date": "May 1, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7489391, "likes": {"liked": "— The location and amenities", "disliked": "— The front desk staff"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The lobby areas and small gardens around the hotel were well decorated and very pretty.", "title": "Great Place, Great Service!", "helpfulness": 3, "user": "oliver1956", "date": "April 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7404902, "likes": {"liked": "— Decor", "disliked": "— Location was a bit far from town, but not bad."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The butlers were very nice and brought us fresh fruit and plenty of bottled water at no charge. They also had great information regarding local restaurants.", "title": "Cozy Getaway", "helpfulness": 4, "user": "ldat7", "date": "February 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6809652}], "location": {"country": "United States", "city": "Santa Fe"}, "stars": 4, "variance": {"poor": 30, "average": 81, "very good": 185, "terrible": 16, "excellent": 443}, "aka": "Hotel Santa Fe And Hacienda And Spa", "slim_ranking": 0.237288135593, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Hotel Santa Fe and the Hacienda and Spa, the only Native American Owned hotel in Santa Fe, is located just blocks from the Santa Fe Plaza in historic downtown Santa Fe and in the heart of the Guadalupe Railyard District."}