{"user_rating": 4.5, "review_count": 53, "name": "Hotel Spa Atlantico", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This was perhaps the hotel selection I most agonized about in planning our recent trip to Northern Spain. I wanted to stay on the coast somewhere in the vicinity of Pontevedre to give us maximum opportunity for good day trips. I also wanted to be in a place where there would be enough to do to keep us interested but without being in a resort area overrun with tourists and high rise buildings. In the end the thing that sold me on this place was the red bird symbol denoting peace and quiet that Michelin uses in its guides. We got lucky. Though we bought a pig in a poke, or rather a bird on a limb, it all worked out just great.", "title": "Peace, quiet and very good food in Pontevedre area of Galicia", "helpfulness": 1, "user": "FloridaTravelmum", "date": "September 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20033777, "likes": {"liked": "— Resort like atmosphere with classy homelike interiors and excellent restaurant", "disliked": "— Lack of nearby town with any good facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The hotel lived up to its symbol. It was not directly on the sea, but rather set above it about 500 meters, giving us views from our second story window over the pines and onto the sea with a waterfall below our balcony overlooking the hotel’s lovely garden. It was idyllic. The grounds overall were nicely landscaped, with a small version of one of those small graneries on stilts that Galicia is famous for, right next to the outdoor pool set in another nice garden. The hotel had lovely home like public rooms, a nice bar, a sundeck, and a spa. It also had an excellent restaurant where we had one of the better meals of the trip. No wonder so many of the guests appeared to be staying on half pension terms.", "title": "Absolutely Fabulous", "helpfulness": 4, "user": "MickleoverKeith", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8720003, "likes": {"liked": "— Quality of Facilities and Staff"}}], "location": {"country": "Spain", "region": "Galicia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 2, "average": 3, "very good": 15, "terrible": 1, "excellent": 32}, "aka": "Mar Atlantico Hotel", "slim_ranking": 0.173913043478, "description": "Situated on Galicia´s beautiful O Grove peninsula, Hotel Spa Atlantico is 500 metres from San Vicente Beach and marina. This charming Hotel offers outdoor pool, spa and free WI-FI."}