{"user_rating": 4.5, "review_count": 129, "name": "Hotel Residenza 100 Torri", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This was our second stay at this hotel and we can definitely recommend it. Tucked away down a side street about 5 mins walk from the main square in the old town, it has its own off street parking which is brilliant. The staff here are extremely helpful and even allocated the room we'd previously stayed in. We stayed in the main hotel (not the annex). Room was spacious and spotlessly clean. Free Wifi worked brilliantly! Their recommendations for local restaurants were perfect. Will be back!", "title": "A little piece of heaven", "helpfulness": 3, "user": "IrishfoodieDublin", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136463526}, {"rating": 5.0, "title": "Great place, people and location", "text": "We found this place on the web and it looked nice and to be well placed in the center of Ascoli town. It fulfilled all expectations and on top of that it was new, fresh and very clean. Very helpful staff that gave us nice tips of what to do around in the region. We can absolutely recommend this place", "helpfulness": 3, "user": "Stocc", "date": "July 18, 2012", "id": 134744122}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Spent 2 nights on return from Puglia in very hot weather. Although located in centre of old part of town and approached via a couple of narrow streets it was located by satnav without any difficulty. The route is also signposted but might not be so easy to follow. Plenty of courtyard secure parking. Public rooms and reception spacious and interesting but our room was a little on the small side for a 4 star hotel. We had difficulty getting the air conditioning to get the room temperature to a satisfactory level and were surprised at the lack of in room information. Also we were not briefed that the door electronic card also operated the hotel entrance door and had to wait a liong time to get back in the first evening. Despite this the reception was otherwise very helpful.The hotel is very well placed for a stroll around this very picturesque town. Recommend a visit to Ascoli Piceno..", "title": "Excellent location", "helpfulness": 4, "user": "rjg4321", "date": "July 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 134357881}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed for 5 nights at this hotel with our 2 year old daughter and had a great time in this beautiful town. We booked for 3 nights in the Corte 1 apartment which is in the block adjoining the hotel and then 2 nights in the big suite in the main hotel.", "title": "2 different rooms in great town", "helpfulness": 8, "user": "libero7", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133820411}, {"rating": 4.0, "title": "Decor relaxed & sophisticated excellent service", "text": "Pros :-", "helpfulness": 5, "user": "MsCastroRides", "date": "July 9, 2012", "id": 133820305}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed in this nicely restored building for 3 nights last October. Excellent location in easy walking distance to all the main sights of Ascoli Piceno. Room was very comfortable with nice terrace for sitting. Very helpful staff with excellent dining recommendations, Good buffet breakfast. Was a little bit difficult to find at first but if we had gone a bit farther we would have seen the signs.", "title": "Lovely Boutique Hotel in Center of Town", "helpfulness": 4, "user": "Lrising", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150795832}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed here at the beginning of October 2012 for 3 days. It was wonderful as it is located in the centre of the city. It was easy to find driving in as you just need to follow the hotel signs.The reception staff were always helpful and very friendly. The breakfast buffet had a wide variety of choices. Definitely would stay again.", "title": "Awesome Hotel", "helpfulness": 3, "user": "JWBM", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142884402}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "It was the second time my wife and I visited this hotel (last time 2 years ago). Driving a big car to the hotel in the center of the medieval city can sometmes be pretty challenging due to the small roads and cars being parked on every spot you can imagine, but the arrival makes you forget about all that. This is a lovely palazzo, extremely well located, close to the Piazza del Popolo in the city center.", "title": "Lovely palazzo in a charming city", "helpfulness": 3, "user": "Erik_Tervuren", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139660330}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We were very happy they allocated the same room to us (Nr. 104). We went again for a superior double room: large sleeping area with nicely decorated bed and a relatively small, but well equipped bathroom. Superb airco (helpful in a city which can be pretty hot during the summer).", "title": "Beautiful hotel, Great location", "helpfulness": 3, "user": "MSL501", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139600047}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Breakfast is typically Italian with cakes and excellent coffees. The hotel staff are extremely helpful (e.g. excellent advice on restaurants and making reservations for you) and the hotel has a closed parking area, adjacent to the hotel.", "title": "Beautiful hotel", "helpfulness": 3, "user": "Heather187835", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139470143}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "With out a reservation and the daylight running out we found the Residenza 100 Torri. The staff were wonderful and the location in the historical center of Ascoli Piceno is great. This is a beautiful town with a wonderful historical center. The hotel offered very modern and nicely decorated rooms with a nice breakfast and the staff helped us with a very nice restaurant reservation. It has a very romantic feel.", "title": "A lucky find in Ascoli Piceno", "helpfulness": 4, "user": "jhager", "date": "June 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132463597}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Two great discoveries: Ascoli Piceno AND Hotel Residenza 100 Torri, both found on a one-month tour of some less touristy but charming European spots.", "title": "Two Great Finds", "helpfulness": 8, "user": "malvagna", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130265439}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Ascoli was virtually tourist-free and had many surprises from the fotrtress park to the wonderful Caffe Meletti to the large public squares. And, of course, it was conveniently located to many of the Marche region’s treasures. It quickly felt like home.", "title": "Really Loved the Cento Torri", "helpfulness": 8, "user": "threegigs", "date": "May 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129828930}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Yes, Residenza 100 Torri was hard to find the first time, but locals, including a policeman, were quite helpful. The policeman even saluted us every time we saw him afterward on the street.", "title": "fabulous base to explore Ascoli", "helpfulness": 11, "user": "nicolas s", "date": "March 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126099916}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The hotel is a work of art in every way, including the restoration details, artwork, lighting and decor. Everything was classy and elegant but not intimidating, stuffy or fake in any way. Breakfast, as was the entire hotel, was fit for a magazine shoot. Hospitality from the owner and staff was 6 star.", "title": "Delightful Hotel in a Beautiful Town", "helpfulness": 16, "user": "Mayo Gal", "date": "January 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122485066}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The first thing about the hotel is location....perfect. A short walk to the Piazza Popolo and the shopping district. The second thing is the ambiance of the rooms....huge beamed ceilings, luxurious bedding, impeccable cleanliness, and good breakfasts...what more could you ask for?", "title": "Great little hotel", "helpfulness": 5, "user": "india1939", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174214821}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Well, the TV could be larger! We were in a suite with two bedrooms and a central living room which was on the second floor and accessible by private elevator. The beds were comfy, there was a little terrace in the living room and one of the bedrooms. The towels were plush, the bathroom spotless and fully tiled, the shower hot and plenty. A great little hotel with a private car park (gated), knowledgeable staff, and within walkable distance to restaurants, shopping and churches. Don't miss this gem.", "title": "Awesome", "helpfulness": 3, "user": "Annelies K", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173195061}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "For 8 nights we've stayed in Ascoli Piceno in Hotel 100 Torri. Our first time in The Marché and what a great time we had! Ascoli is by far the nicest city I have been to in Italy! The old center is like Florence but less touristic. And only nice Italian people, who were very friendly, especially in the hotel. The service was great, we had a typical italian room with airco and balcony. You're car is safe parked on their own square. In the evenening there is Always something to do. Even an opera with an real orcheastra on the main piazza Popolo. The beach is only 30 km away and in the natural parc we did a 4 hours hike. An awesome holiday! Jacques & Annelies", "title": "A FIRST CLASS HOTEL", "user": "Viaggiatori1", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162570131}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "A quiet oasis just a short (5 minutes) to one of the most beautiful piazzas in Italy. From the moment we arrived we knew we had chosen a great place. Our car was parked for us, we were checked in with speed and efficiency and we were given assistance with our bags.", "title": "A Very Special Place", "helpfulness": 1, "user": "BigSky91", "date": "May 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160881930}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "The room was pleasant and comfortable. The bed restful and the bath more than adequate with its supply of towels.", "title": "Warm and Welcome Feel in great location", "user": "Drfrew", "date": "May 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 160288870}], "location": {"country": "Italy", "region": "Marche", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 1, "very good": 31, "terrible": 0, "excellent": 96}, "slim_ranking": 0.133333333333, "description": "A wonderful 14 bedroom boutique hotel in the center of Ascoli Piceno. All rooms are lavishly furnished and different from the others. A meeting room with a capacity of 40 persons is at your entire disposal. Can be organized special events on request."}