{"user_rating": 4.0, "review_count": 165, "name": "Hotel Lusso", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "From the moment Steve picked me up as part of the airport transfer, the overall experience was positive. The hotel itself is in an excellent location in downtown Spokane. The room was a good size, well maintained and quiet. The hotel staff were very friendly and helpful. My early airport shuttle was on time.", "title": "Believe the positive reviews", "helpfulness": 1, "user": "Opposable_Mind", "date": "February 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95428039}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Within a few blocks of the hotel there was a good selection of restaurants, a mall and the Riverfront Park.", "title": "Mixed Bag", "helpfulness": 5, "user": "JPDMAD", "date": "January 21, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 93992031}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I will stay here again when I return to Spokane.", "title": "Good rates, great location", "helpfulness": 1, "user": "jrn1982", "date": "January 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92714947}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I visit Spokane 3-4 times per year so this time decided to stay somewhere different since I was not driving.", "title": "Not the Davenport, but that's okay....", "user": "jpug2002", "date": "January 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 92652754}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I stayed here about 4 years ago. At that time they had a very nice restaurant and very good continental breakfast. Much has changed.", "title": "Davenport amenities, but lower prices", "user": "IncurableTraveler", "date": "December 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 90333149}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This hotel had been beautifully restored and decorated. The staff is very friendly and efficient. The rates are very good. I would gladly stay again and would gladly recommend the hotel to others. Minor complaints: 1. The \"Lusso Suite\" was very nice (fireplace, extra-large bathroom, but with only one sink), but it is not a \"suite\" as that word is commonly used in the hotel industry. It is a single hotel room (although larger than usual) and a bathroom. 2. I agree with earlier posts about the horrors of providing \"Fiji\" bottled water while proclaiming that you are eco friendly. The're still doing it. 3. Our room key and replacement key failed to work, necessitating repeated trips back down to the front desk.", "title": "Overall, excellent. Some minor \"complaints.\"", "helpfulness": 1, "user": "hcajones", "date": "July 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115260908}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I have stayed here a few times over the past year, great location right in downtown and usually a great rate. But NO in-room coffee! why? it just doesnt make sense, i cant think of any other hotel that doesnt have in room coffee. my room this time was dark, smaal window and only 2 low watt lights and no desk lamp which made it really hard to work.. The AC didnt work so the room was too warm. and how about a bar of soap instead of \"Shower Gel\" mounted to the wall?", "title": "great location - but no in room coffee!", "user": "golf4funn", "date": "June 23, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 114677462}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "The location and price are good but not sure if i will be back for business trips.", "title": "What? No coffee pots? And Fiji water? Puh-leeze!", "helpfulness": 1, "user": "Stevan_A", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104107168}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "I love this hotel. It is luxurious at an affordable price. If you want to be be amazed by the furnishings and pleased by the price, this is your hotel. But be forewarned: there are no coffee pots in the room. There is no way to make hot water, except pouring it out of a tap. Yes, they serve coffee and \"coffee cake\" in the lobby, but I have traveled 32,000 miles by car in the last three years and this is the first hotel I ever stayed at that didn't have a coffee pot in the room. Also, they claim to be eco-friendly but offer Fiji water in each room. The natives of Fiji have no access to water because the people who bottle Fiji water have bought the aquifers. Also, the empty bottles are shipped from China, filled in Fiji, then shipped to their destination. Talk about a carbon footprint! The hotel lost call eco-friendly points with me the minute I saw a card on the bedside extolling the hotel's interest in the environment, yet had Fiji water on the desk.", "title": "Luxury at an affordable price...", "helpfulness": 2, "user": "KarenCD", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100563940}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The Hotel Lusso was surprisingly wonderful. I have stayed at its sister hotel across the street, The Davenport, many times. It's one of my favorite hotels anywhere, and I almost always stay there when travelling to Spokane on business. However the room rate this time was higher than that allowed by my company, so I decided to give the Hotel Lusso a try, as the room was $40 cheaper than the Davenport.", "title": "Free upgrade to Suite for 25th Anneversary!", "helpfulness": 2, "user": "frasure6", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97439000}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The hotel Lusso is now owned by the Davenport Hotel just across the street. So guests of the Lusso can take in the spectacular Lobby of the old Davenport while enjoying the more fairly priced rooms at the Lusso.", "title": "OLD WORLD CHARM!", "user": "simmonskUSA", "date": "September 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81602352}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Rooms are spacious and bathrooms huge. Comfy beds, lovely sheets. If you like old world charm, the Lusso captures it. Hallways are a bit of a maze, but add to the Lusso's charm. And attached to it is a lovely pub for simple meals and great draft beers.", "title": "Good boutique hotel in central location", "user": "manswa", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 66651041}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The lobby is a bit heavy and stuffy and could use some perking up, but it does fit the overall definition of old world.", "title": "2nd times not always a charm", "user": "darylhollie", "date": "May 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65725364}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Definite value for money compared to its sisters across the street.", "title": "Fabulous Hotel in Downtown Spokane", "user": "smith717", "date": "May 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65635657}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The downside to the Lusso is its staff. What a shame that service mindedness and client-centeredness are not core to the Davenport management's clalims. Staff are young and lack finesse and courtesy comparable to its 4 stars. This is hard to understand as the Davenport appears to pride itself on service, yet simply fails to deliver. A problem that must ultimately stem from the owners and managers themselves.", "title": "I'll go back", "user": "kudsk", "date": "May 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 65084684}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This hotel is a little old but redone very tastefully. We stayed on the 4th floor and heard very little road noise- the service is impeccable and the lobby very nice- I have stayed at the Davaneport and the towers - all are nice but this is more qiuet & the beds were as comfortable as the Davenport. If you are not looking for extreme opulence ( go to the Davenport across the street if you are) but just a very nice little hotel with good service - this is it.", "title": "Quaint & quiet", "user": "beckyjo77", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89789735}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The Hotel Lusso is located in the heart of downtown Spokane and you can easily walk to great restaurants and the downtown area. Hotel Lusso is small, quaint & classic. We enjoyed our personal service when we arrived. We loved the room with the very high ceilings, comfy pillow top bed and lots of room. There was coffee and coffee cake at 6 a.m. in the morning which was awesome! The price is right at this place as well. Parking is $15.00 for the night at a secure garage a block away.", "title": "Classic hotel with great price", "user": "AWaysToGo", "date": "November 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86742500}, {"rating": 3.0, "stay_parameters": "Stayed October 2010", "text": "The hotel itself was fine, nothing more and nothing less. On checking in I was told there would be a $10 deposit added to my bill for the room key! No, I don't think so - if the hotel has a key system that encourages people to forget to give their key back, that's their problem not mine. I was told the deposit had been removed. On checking out, there it was, still on the bill. At every turn the hotel was trying to get more money - water in the room ($4), peanut brittle ($5.95) etc.... Don't get me wrong, I will always be willing to pay for something I use, but it all felt tacky and a bit desperate. I stay in alot of hotels but probably won't be staying here again.", "title": "An OK hotel, nothing special but disappointingly money-grabbing", "helpfulness": 1, "user": "acdc_10", "date": "November 2, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 85783101}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Spent two nights at the beautiful Hotel Lusso in spokane next to the more famous Davenport Hotel. The Lusso has just been remodeled- beautiful lobby with inviting fireplace for relaxing. The rooms were spacious and comfortable (we stayed in a suite) with LCD TV and comfy leather chairs. Loved the Soft Peanut Brittle left on the pillow at turndown. Highly recommend this small (48 room) boutique hotel for leisure travel and relaxation!", "title": "Quaint, heart of downtown, personalized attention", "user": "lilikoi", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83304247}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "This is a completely remodeled hotel right in the center of Spokane (A city which gets cooler and cooler every time I visit it...) It has the look and feel of an old school city hotel but with a lot of updates. Very nicely decorated and impossibly high ceilings in the room. Here are the Pros and Cons:", "title": "Nice Boutique Hotel, Excellent Location, a few simple changes could make it a \"5\"", "helpfulness": 1, "user": "Kat&John", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 82385780}], "location": {"country": "United States", "city": "Spokane"}, "stars": 3.5, "variance": {"poor": 13, "average": 19, "very good": 55, "terrible": 4, "excellent": 74}, "aka": "Lusso Hotel Spokane", "slim_ranking": 0.170212765957}