{"user_rating": 4.0, "review_count": 284, "name": "Hotel Villa e Palazzo Aminta", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Booked through expedia and got 1 night free as september is alot cheaper than august. it worked out £100 a night room only, which may sound alot, but its worth every penny! you do need a car as it is out of the way and the road is not safe for you to walk on all the way to stresa centre.", "title": "amazing, fantastic & worth every penny!", "helpfulness": 4, "user": "DeVito", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 3.0}, "id": 11181573, "likes": {"liked": "— food", "disliked": "— location"}}, {"rating": 5.0, "title": "Perfect hotel for honeymooners", "text": "breakfast is alot if you dont have it included but you can go to stresa centre and get a cappuccino and cornetto for around 4 euro each, so much better than hotel prices!", "helpfulness": 3, "user": "marion80", "date": "September 26, 2007", "id": 10006542}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "i would heavily recommend this hotel and the restaurant is incredible.", "title": "Absolutely fabulous!", "helpfulness": 4, "user": "SGIDDI", "date": "September 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10001545, "likes": {"liked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We have dined at gordon ramseys restaurant, jamie olivers restaurant and they do not even compare to the restaurant here. the food is incredible and make jamie olivers restaurant look appaling! Honestly, i am not lying, the food is incredible. we had duck ragu with pasta, amazing.", "title": "Excellent hotel but beware...lots of cracks in the", "helpfulness": 3, "user": "DaveWapping", "date": "September 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 2.0}, "id": 8875148}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "A small boutique hotel that is what do you require for a perfect honeymoon. We hade a nice room overlooking the Islands and the lake the room was exceptionally clean, staff very friendly and the breakfast buffet was the best we have ever had in many other hotels.", "title": "amazing view", "helpfulness": 2, "user": "kmiroSingapore", "date": "September 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8864407}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My wife and I have just come back from a week at the Villa Aminta and I'm at a complete loss to understand the negative comments about this hotel. Sure, the furnishings are a bit over the top for UK taste and it is not very convenient if you want to stroll into Stresa but the hotel was lovingly restored to its original glory by the new owners (the Zanettas) in 2000 after a lot of research and it has been beautifully done at enormous cost. The public rooms are tasteful, if a bit ornate, and the rooms are very comfortable. On the small side, and again a bit ornate, but fitted out with state of the art electronics like flat screen TVs and the marble bathrooms with gold fittings function perfectly. The staff are as charming and helpful as any of the other 5-star hotels we stay in regularly and the food was excellent. The menu was varied, with good sized (not enormous) portions and the wine list also varied and affordable. Daniela, Clara and Alice are all very helpful and obliging at the front desk and the dining room staff, ably led by Vincenzo, are excellent. Elisa runs the bar with great charm and efficiency. The rooms on the side of the hotel over the front entrance get some muted train noise but they are double glazed and using the a/c cuts it out. As far as the trip to Stresa is concerned the hotel lays on a courtesy car to take guests in and bring them back six times a day, which is more than adequate for most needs. We look forward to going back.", "title": "In a class of its own", "helpfulness": 5, "user": "Rivertest1", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8711088, "likes": {"liked": "— Its all round 5-star proficiency", "disliked": "— The occasional noise from the trains"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We were not sure what to expect at the Villa Aminta since neither of us had been to the Italian Lakes. It turned out to be fabulous! We flew into Milan Malpensa and rented a car for the drive to Stresa. It was an easy, 45 minute drive to beautiful Lake Maggiore. We had just done a lot of sightseeing in London and Paris so the laid back town of Stresa was just what we needed! We booked with American Express which included a deluxe breakfast with champagne, cheeses, and hot egg dishes. We spent a lot of time hanging out by the pool (which as other reviews mention, is freezing!). We also took a drive into Switzerland (about one hour). If you want an action packed tourist adventure Stresa is probably not for you. If you want to sleep late, eat great food and wine and just hang out Stresa is perfect.", "title": "A Truly Relaxing Place!", "helpfulness": 3, "user": "MarinMeme", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8655810}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The hotel is really ornate and beautiful. We had a balcony room overlooking the lake. It was cozy but large enough for two people. The bathroom was spacious and well equipped although the soaps and lotions were gross. The service in the hotel is a little stuffy and formal. We loved the food at breakfast but found dinner to be over priced and not very flavorful. We had a fantastic dinner at the Hotel Verbano, they pick you up by boat and take you across to the Island.", "title": "Exquisite", "helpfulness": 5, "user": "JanEcre", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8052664, "likes": {"liked": "— view from terrace", "disliked": "— nothing"}}, {"rating": 2.0, "title": "Poor Service, Terrible Attitude, Over-rated hotel", "text": "One outing I would avoid is the Agency Boroni wine trip. Unless you know nothing about wine and have no wine tasting experience you will be bored. Also we never walked into town, the road is just too busy. We drove in for dinner and had no trouble finding parking.", "helpfulness": 13, "user": "Nick027", "date": "June 29, 2007", "id": 8024962}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Overall it is a beautiful hotel in a romantic setting. I will defintely go back!", "title": "beautiful aminta", "helpfulness": 3, "user": "Giny", "date": "June 27, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 8004526, "likes": {"liked": "— beautiful hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "BEAUTIFUL HOTEL !!!! My wife and I really enjoyed our stay here. The suite was perfect and the quality of the furniture and linens was impeccable. We had a view from the balcony of our suite of Lago Maggiore that was amazing. Try getting up early one morning just to see the fabulous colors of the sunrise over the lake and moutains, I promise you that it will be a vision that you will never forget.. The staff at the hotel was great ,as was the owner of the hotel and his daughter who is the hotel manager .", "title": "Fantastico !!", "helpfulness": 13, "user": "Pontedera", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5905202, "likes": {"liked": "— The location and the quality of the hotel itself, as well as the fine food and service", "disliked": "— That we had to leave !! We actually extended our stay from 3 nghts to 6 nights."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The food in the restaurant whether for breakfast or dinner was some of the best that we have ever had,and let's not forget the delicious cappuccino . I highly recommend this beautiful hotel to anyone who likes feeling at home in a true luxury setting. We will return here next spring and hopefully for many years to come.", "title": "Could Have Been Better", "helpfulness": 8, "user": "Pauper", "date": "September 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 5835668, "likes": {"liked": "— VIew of the islands in front of the hotel", "disliked": "— Noise, ornate decor, hotel not value for money, restaurant not value for money"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Hotel Villa Aminta has a nice view of the lake, but is situated on the main road with the railway line just behind - the rooms are rather noisy. The hotel is ornately decorated throughout, which may appeal to some people. There was a wedding taking place over the period of our stay which distracted staff away from other hotel guests' needs. In summary, the hotel and the hotel restaurant are both average and both over-priced. We stayed in 6 hotels throughout our stay in Italy and this was our least favourite.", "title": "Very impressive hotel.", "helpfulness": 4, "user": "GINKYS", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5810340, "likes": {"liked": "— LUXURY", "disliked": "— OAP'S"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We have just returned from a fabulous stay at Villa Minta.", "title": "Mixed views", "helpfulness": 7, "user": "LoverofItaly", "date": "September 3, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 5765304, "likes": {"liked": "— Service and views", "disliked": "— Bedroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Our bedroom was 415, we were very pleased with it APART from it having an inter-contecting door. Room next door was OAP 's who were DEAF!!!!!!!!!!!!!!! Infact 70% of the guests needed zimmer frames.!!!!", "title": "Holiday Heaven", "helpfulness": 7, "user": "Tibot", "date": "August 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5623924, "likes": {"liked": "— bathroom", "disliked": "— No light coke in the minibar"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007", "text": "Hotel is perfectly nice to look at and the staff seem pleasant enough. But the location is terrible! Its sandwiched between the main road up the west side of the Lake and a very busy (including during the night) railway line, Our lake view room had a large balcony from where we could see the trains and cars rather than just imaging what they looked like from inside our (small) room.", "title": "The wrong price", "helpfulness": 7, "user": "dinninwi", "date": "June 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 7729130}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "Hotel should not be premium priced. Location means its noisy and therefore simply not good enough for the kind of money they charge. Suggest staying at a hotel more centrally in Stresa.", "title": "Favoloso", "helpfulness": 7, "user": "vasf73", "date": "April 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7344734}, {"rating": 1.0, "title": "Stole money out of the safe", "text": "The bedrooms are really nice, well kept and very clean! The service is the best I've ever had at any hotel I've stayed in. The quality of the service is excellent and the employees are extremely friendly and helpful. I strongly recommend it, not only for the service and price, but for the location as well.", "helpfulness": 27, "user": "odeonjim", "date": "January 18, 2007", "id": 6615881}, {"rating": 1.0, "stay_parameters": "Stayed September 2006", "text": "We arrived around the clock of 12.00 and try to check in. The girl from the reception told us that there was a problem, because she didn’t have a room with Lakeview. They had a room on the right site of the Hotel with view on the train rail. I told them that we are not happy with the situation and that I booked a room with Lakeview and not something else.", "title": "orrible sty,a lot of wedding", "helpfulness": 4, "user": "mark80", "date": "October 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6029464}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "After 2 ½ hours waiting I told the ladies after the receptions that I want to now what happening now. The two ladies how must help with this problem they didn’t do anything. They sent the whole time the stagier to us. The girl was very friendly but also nerves because see didn’t now what to do", "title": "Pleasant stay", "helpfulness": 7, "user": "Sacchini", "date": "October 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5924997, "likes": {"liked": "— Overall quality", "disliked": "— Location"}}], "location": {"country": "Italy", "region": "Piedmont", "continent": "Europe"}, "stars": 5, "variance": {"poor": 17, "average": 36, "very good": 49, "terrible": 21, "excellent": 161}, "aka": "Hotel e Palazzo Aminta", "slim_ranking": 0.171428571429, "description": "On the shores of the Lake Maggiore, Villa & Palazzo Aminta is the luxury Resort where you can regenerate your body and soul by revealing authentic emotions in one of the most exclusive places of the world. The resort is located in the town of Stresa in the area with the luxuriant vegetation, overlooking the enchanting Borromean Gulf, is a refined jewel member of the Leading Hotels of the World."}