{"user_rating": 4.0, "review_count": 659, "name": "Hotel La Mariposa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I stayed 3 nights at La Mariposa and it was excellent. The staff was very friendly and the service was great. La Mariposa is up on the ridge and the view from the hotel can't be beat. They also have a cool, negative edge pool overlooking the ocean. A nice buffet breakfast was included too. The rooms were very large, the A/C worked great and mine had a hammock and hot tub on the deck. I had a car but the hotel has a shuttle to take you down to the beach. Overall, definitely worth the extra dollars compared to other locations.", "title": "Stunning view, great service", "user": "EasyGoingMidwestGuy", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123110224}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "So much to like: breathtaking views, fabulous pool, excellent umbrella-like trees providing natural shady spots around the pool, superb free breakfasts on the outdoor terrace that sustained us until happy hour, beautiful grounds, a nice variety of rooms (from our ocean-facing room with private balcony in the main building to chic cottages with modern furnishings), restaurants in walking distance, beaches accessible via foot down the hill, handy free shuttle into town (with easy walk to park entrance), diverse and international clientele (guests from Italy, France, Canada, USA, Latin America; some couples, some families). We were delighted with our stay and highly recommend it as the ideal place to stay in Manuel Antonio for beauty and relaxation. We spent far more time at the hotel than we'd expected to, since it was so pleasant there. Leisurely breakfasts followed by poolside lounging and afternoons at the beach became our routine. Unbeatable location for sunset-viewing. The staff varied; most were really nice, a few were cooler and less efficient.", "title": "Gorgeous setting, splendid experience", "helpfulness": 1, "user": "flex_nc", "date": "January 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123075601}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "Out of all of the hotels we stayed at during our CR trip this hotel definately had the best view. It's situated at the top of a hill and looks directly out to the crescent-shaped Manuel Antonio park and beach. The staff there seem to bank on this view alone as the service is attentive but very impersonal. The check-in desk failed to even give us a brief overview of the property and we didn't learn until the last day that they offered a free shuttle. The map that they give you of the area is deceiving as it seems that the beach is just a short walk, but in actuality it's a solid 20 minutes and is strenuous as it is on a road that is rocky and at least a 60 degree incline at times. The best and most economical way of getting back and forth to the beach is taking the public bus which stops just a short walk in front of the hotel. The fee is only 250 colones and runs rather frequently. The breakfast at the hotel is okay, pretty run of the mill, but it's free so you really can't complain. Overall there are parts of the hotel that seem pretty dated and other areas that seem like they have recently been updated. The juxtaposition of the two do give off a sense of tackiness at times. The rooms are big and most have a balcony, the mattresses are a little flimsy and could definately use a renovation to modernize the rooms. I did like the showers in the rooms that were extra large and made it easy for washing off after a beach day.", "title": "Impressive views...", "helpfulness": 2, "user": "Belugafingers", "date": "January 11, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 122915596}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "The views are incredible. However, this is far from a luxury hotel. The service is lacking (especially at he front desk) and the toiletries in our room were partially used. We lacked hand soap in our room when we first got there. The bed was not actually a double bed but rather two twins pushed together.", "title": "Great location, lousy service and rooms", "helpfulness": 1, "user": "Acgnyc", "date": "January 9, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 122851235}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Overall, I suspect the Manuel Antonio area is overpriced and overdeveloped at this point.", "title": "Absolutely lovely.", "helpfulness": 1, "user": "SF A", "date": "January 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 122663009}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Don't know why this isn't ranked higher....what a beautiful place with a terrific and helpful staff", "title": "worth every penny!!!!", "user": "rencar", "date": "January 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122602098}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "the included breakfast was always delicious with many choices, all the pools were clean and inviting (though they could've been a bit warmer), and our room was spacious, comfortable, and clean. Easy to walk to many nice eateries. Staff helped us arrange a white water rafting trip through Unique Adventures which was just terrific!", "title": "wildlife at your front door", "user": "lajolla1", "date": "January 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122535954}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "No wonder this is in the 1000 Places to See Before You Die. STAY HERE!", "title": "Overpriced Hotel -- Don't stay here", "helpfulness": 3, "user": "NatlParkTravelers", "date": "January 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 122406462}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "My daughter loved the animals but it took us some time to figure out where they were ..wish the hotel had helped us out here when we arrived as we said we really wanted to see a lot of animals.", "title": "Like paradise....", "helpfulness": 2, "user": "Lorraine1147", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122335175}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Go near rooms 20-25 and the white face monkeys are nearby often in the afternoon...you might even get them on your balcony if you are lucky to have those rooms.", "title": "Great stay on our honeymoon", "helpfulness": 1, "user": "dandaman711", "date": "December 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122219109}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at LaMariposa in August for my birthday. We had an amazing time. The hotel has the best view in Central America. I was treated like a king. We stayed in the penthouse, a little more money but what a view. Had a hot tub on our huge balcony. All glass walls and windows facing the ocean. Loved the restaurant. The chef made me a special dinner on my actual birthday. He saw us at lunch time and came out to the table and told me about it. Then took me into the kitchen and showed it to me. Lobsters, huge prawns, mahi, tuna. Table was all decorated, and right at the edge of the terrace. It looks like you are hanging over the ocean. Lester was a great waiter and bartender. We ate at a few other nearby places while we were there but always ended up saying we should have eaten at our own place. August is the slow season so we may have gotten more personalized service because of that, I am not sure. But I am going back in February to try it again.", "title": "Awesome Experience", "user": "EBR1961", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120471166}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I recently went to Costa Rica for our Honeymoon and stayed at La Mariposa. We had the BEST time, the BEST view, the BEST service and the BEST food. The staff did an excellent job book excursions for us, providing us with information on local attractions and restaurants. We were in room 40 in the main building and LOVED it. It was on the top floor with a wonderful ocean view. I believe the staff gave us a complimentary upgrade since it was our honeymoon and that was MUCH appreciated :) Beautiful, breathtaking and will definitely be back.", "title": "BEST choice in Manuel Antonio/Quepos!", "helpfulness": 2, "user": "Lindsey C", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120463763}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Went here in Jan 2009 for my anniversary. The hotel is beyond beautiful!!! It was summertime in Costa Rica and we enjoyed the beautiful sunsets and the infinity pool. The people and staff were extremely friendly. I stayed in the older part of the hotel. The room was a little dated but the view from the balcony made up for it. I enjoyed watching monkeys jump from tree to tree. The hotel offered French cuisine which became a little boring after a few days. We also had a blast zip lining & ATV Riding. I would definitely recommend La Mariposa,,, especially if staying in the new section...", "title": "Breath Taking Views!!!!!!!!", "helpfulness": 1, "user": "MissLady71", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 120351199}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We had a nice room in the building to the left of the reception. no. 55, nice layout, nice furnishing, georgeous view and balcony. We also looked at other rooms and felt that the main building had great, possibly better views, but sometimes odd layouts and more of an outdated 70s feel. The rooms below the pool were more modern, not bad at all but obviously located somewhat lower. staff was great and always extra helpful.", "title": "view was so good, we didn't leave our rooms", "helpfulness": 3, "user": "stefanowitsch212", "date": "November 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120182193}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Excellent rooms, great location, there is plenty of shuttles to the beach but the pool is so good you do not need to go. Friendly staff and excellent breakfast.", "title": "luxurious", "helpfulness": 5, "user": "channi", "date": "October 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119363029}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "I was worried by some of the negative reviews on this site before staying at La Mariposa, but I had a wonderful experience. The staff are unfailingly helpful and polite, the views are amazing and I loved the bar area overlooking the pool - perfect at any time of the day but especially at sunset. It's also well situated near several great restaurants (Karolas and Sunspot), which was handy since I didn't have a car", "title": "Lovely hotel", "helpfulness": 4, "user": "ao23", "date": "February 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4565026}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I stayed for three nights in a standard room and one night in a junior suite. I will say that the standard rooms 17 through 20 face the service driveway through a very thin screen of plants and the balcony is more of a shared walkway, so our junior suite with huge balcony, hammock and ocean view was a much better value. However, my confirmation clearly said the standard room had a garden/parking view so I don't feel I was misled in any way.", "title": "excellent choice; would stay here again!", "helpfulness": 6, "user": "HappyNapa", "date": "January 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4331107}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "My wife, 9 year old son and I loved this place. Room was clean and spacious. The staff was friendly and helpful. A request for a refridgerator was responded to within minutes Two wonderful pools one with a bar...try the house drink, you won't be sorry. I liked it so much I asked for the recipe. Something to sip on poolside during hot Florida summers. Restaurant and staff were welcoming and accommodating. Great view as well. We brought back our catch from fishing one day and they cooked it for us.", "title": "Nice hotel.", "helpfulness": 1, "user": "Chris E", "date": "December 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121620625}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The hotel was a short trip to Manuel Antonio. A short walk to a number of other restaurants, bars, casino and Butterfly Garden. We just wish we could have stayed here the entire time we were in the area. Online reservations said there were no rooms the first two nights we were in the area. Too bad because there were. Stayed at Byblos across the street.", "title": "Thinking of moving in - permanently!", "helpfulness": 2, "user": "musashiwasajedi", "date": "December 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121472408}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "When we return to Costa Rica, we will definitely be staying and I'll call the hotel direct to make sure my entire stay is here.", "title": "Everything I hoped it would be", "user": "happydaze80", "date": "December 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 121284633}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We recently stayed at La Mariposa for three nights and the end of our journey before returning back to San Francisco and it was a truly a wonderful experience. We arrived without a reservation and rented a premium ocean view room at a reduced rate and were offered one of the newer and more modern rooms below the pool area (#61). This is a downstairs/ground floor room that still offered an excellent view of the ocean from inside the rooom. The view from the patio was amazing at sunset and we often had full view to watch monkeys, iguanas, bats, etc.", "title": "Best hotel experience We've Ever Had", "user": "msmith0825", "date": "November 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121066099}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The room was decently sized and furnished. The bed was large and very comfortable, shower and bathroom decent as well. The room had AC, television, safe, refrigerator, alarm clock and phone. Lighting was good. My only real complaint about this room would be that the exterior glass doors were a little awkward to open and close and they didn't seal completely once closed. Since there was no screen on the door the way the room was designed to maximize the ocean view (100% ceiling to floor glass panels with sliding glass doors) it meant small bugs would occasionally get into the room. Another minor annoyance was that the WIFI signal (or even 3G cell signal for that matter) didn't quite reach into this particular room but this was easily remedied by heading over to the pool for a bit of web browsing.", "title": "Wonderful Boutique Hotel", "user": "Rebecca S", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120921481}], "location": {"country": "Costa Rica", "continent": "Central America"}, "stars": 3.5, "variance": {"poor": 31, "average": 62, "very good": 170, "terrible": 31, "excellent": 365}, "aka": "La Mariposa Hotel", "slim_ranking": 0.265306122449, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Set in one of the most magnificent settings in the world, Hotel La Mariposa stands majestically a top the highest point in Manuel Antonio and is best known for its award-winning 360 degree view overlooking the blue waters of the Pacific Ocean and the Manuel Antonio National Park, in Costa Rica. Nature and luxury flawlessly combine with 60 well-appointed rooms in a Spanish-Mediterranean architectural design and tropical gardens with walkways and trails meticulously landscaped to reflect the natural beauty of Costa Rica’s abundant plant and wildlife. Experience the stunning magic of the legendary Manuel Antonio sunsets while sipping a tropical cocktail at our “Sunset Bar and Lounge”, while dining in our world-class international restaurant “Le Papillon” With over 38 years experience, our personalized service and unforgettable views have made La Mariposa a top choice for the most discriminating travellers, who relish both its intimacy and magnificence."}