{"user_rating": 3.0, "review_count": 75, "name": "Hotel Lavas Tacotal", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We were not impressed with this hotel. We had a lower room (1st floor on a 2 room building) and found that the window in the bathroom was open to some of the operating mechanical equipment for the hotel. The noise was so loud we had to close the window and the bathroom door in order to sleep. The staff in the diningroom stood around and did not offer any service except to tell us that we should go elsewhere for dinner (we had booked this hotel because there was an on site restaurant). While the room was kept clean by the housekeeping staff, the hotel is definitely showing wear. We went to the pool for a swim and found a chair at the bottom, we moved it ourselves even though there were staff standing around. The loungers at the pool were all broken. I say look elsewhere, you can do better.", "title": "Move On.", "user": "Rhonda M", "date": "February 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 125207327}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Dreadful design, dreadful management.", "title": "Tacky hotel", "user": "magoye", "date": "February 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 124708762}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Whoever designed this tacky hotel needs to be shot. Should have a wonderful view situated as it is at the base of the Arenal volcano with floor to ceiling windows...which have a marvelous view into the cabins opposite. No net curtains so once you draw the curtains you have no privacy whatsoever, and if you look out you see what the people opposite are doing inside their room. Other minus points:", "title": "Good Value. Poor Service", "user": "CDBAlbq", "date": "February 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124040823}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "- crackly swaety mattress covers on the bed (we removed ours after a particularly uncomfortable night)", "title": "Strange, but beautiful place", "helpfulness": 1, "user": "ckizer", "date": "February 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124037044}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "- the fridge was SO noisy we had to turn it off to sleep", "title": "Room with a view", "user": "denverflier", "date": "January 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123787882}, {"rating": 2.0, "stay_parameters": "Stayed November 2011", "text": "We ended up here on our package tour only because the original hotel booking fell through. We were originally placed in one of the \"chalets\" which may have been nice except that it was dusty with something gross on top of the bedcovers (possibly dead insects or *shudder* rodent feces?!) and the sink and toilet both backed up & started to overflow following the first usage. We were transfered to a cleaner standard room, but it was still not up to par - musty blankets, etc. The food was mediocre, at best. The service was awful. On our first night, the bar only had two beers & less than two bottles of wine behind the bar, & when they ran out (we were a group of 13, having dinner), they said there was nothing they could do. One of our group members suggested they run down the block to purchase more (& suggested they would be well-compensated for their efforts), but the \"bartender\" shrugged and did nothing. Tables were sticky & lacking salt & pepper. The pools looked dirty & we never saw a soul using them. The Wi-Fi was difficult to use. The front desk staff was unhelpful. The view of the volcano was lovely, though it was dormant. Overall, not a winning \"resort\". There should be plenty of better options available in the area.", "title": "May have once been lovely (& could be again) but currently a poor choice...", "helpfulness": 1, "user": "SteffiLovesTravel", "date": "January 26, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 123670383}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "If you are here to watch TV or spend time on the Internet, you're in the wrong place. But if you want an inexpensive, comfortable, clean, quiet place to stay in a lovely setting close to the volcano (which is, alas, currently dormant), this is it. There are chalets and motel-style rooms, two small pools, a charming open bar/dining area (where the WiFi works fine), a large friendly lobby, and a surprisingly big souvenir/clothing store (which for some reason was never open during out stay). The staff are extremely helpful and speak good English, and the food (which was part of our group package) was nothing fancy, but just fine. A very good place to locate yourself while you explore the area.", "title": "Comfortable, quiet, lovely setting", "helpfulness": 1, "user": "Georgie_A_NJ", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123434066}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "This hotel, when the volcano is visible, has a great view of the volcano and has a very aesthetically pleasing walkway to the rooms, with palm trees, flowers, a pond with fish along the way. I didn't make the booking so didn't know the cost, so cost excluded it was a nice place for those looking to get away from everyday life. They need to extend the WiFi range, have both bars working at the pools.", "title": "Much potential..but lacking in a few aspects", "user": "pmm3744", "date": "January 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 123209764}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Pros: Two pools, each with great view of the volcano. Spacious 'chalet' cabins, three beds each (family of 5 could fit in one). Great breakfast food, nice bar. Didn't try the spa but it's supposedly good.", "title": "Big disappointment", "user": "Cabaez", "date": "January 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 122440525}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Cons: Weak WiFi connection from room (need to be by restaurant/lobby to get any strength). Weak shower head. unattended/non-functioning bars at either pool. No glass cups/ice machines available. Staff was alright, could have been friendlier. No computers to access. There were light switches outside, so technically a stranger could walk to your cabin and turn on the main light from outside..weird", "title": "Better choices nearby!!!", "user": "dakappa", "date": "November 10, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 120440160}, {"rating": 2.0, "stay_parameters": "Stayed November 2011", "text": "Rooms had plumbing & mold issues (in multiple rooms). View of volcano is great. Food was poor to mediocre at best. Staff wasn't friendly or very accommodating. I would definitely try another hotel.", "title": "Needs updating, repairs, better service.", "user": "2txgirlsmom", "date": "November 9, 2011", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 120388346}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "We stayed in lots of hotels in CR, but this one was the only one we had trouble with. The Front Desk man was the rudest, uncompromising person I've ever dealt with at a hotel (and I've stayed in many!). The pool was dirty and looked like it hasn't been cleaned for ages. The air conditioner in the room leaked and made a lot of noise (which made it impossible to sleep considering it was also really hot out). The bathroom was also pretty disgusting - looked like it hasn't been cleaned since last night's stay. The hotel was also relatively far from the center (La Fortuna) - it would be a 15 min drive on the taxis there. Speaking of taxis - they're all scam artists in Arenal (if you order the taxi through this hotel). They charge you for the mileage it takes them to get to the hotel in addition to where they take you. So by the time they get to you, they already clocked $20 worth!!! Be careful with them - and the hotel desk guy is not helpful at all with them because he gets a cut out of every time he calls you a taxi!!!! Be mindful of that. And don't stay at this hotel if you want a peaceful vacation. Oh, and the WIFI didn't work.", "title": "DO NOT STAY HERE!!", "user": "Cizofworld", "date": "May 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 106677484}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "From our lovely cabin, a gorgeous view of Arenal. The view is wonderful. The grounds of Lavas Tocotal are extremely well kept, and a joy to wonder through. The staff are very professional and helpful.", "title": "Nature at it's best", "user": "Chago1", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98915073}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Suggestion: be sure and visit Ecotermales----the real, rustic hot springs! Go around four in the afternoon, stay for dinner---and enjoy the magic---monkeys included.", "title": "Amazing quality / value", "user": "Philitwins", "date": "January 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93019689}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Probably one of the best view of the volcano. We stayed in a regular room and were very supprised by the quality. We paid $134 for 2 nights !! Incredible deal. We did not try the retaurant... but once for the breakfast (included in the price). Very basic....", "title": "Amazing views, gorgeous grounds, beautiful rooms.", "helpfulness": 1, "user": "Need2TravelGA", "date": "November 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 86158899}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "This was part of an EF package tour so I had no say in the booking. It was mainly average but I found the bed comfy enough. The giant window wall that did not open was kind of problematic esp. with a glass door that also needed to be covered by a curtain. We also did not like the fact that our door had to be locked WITH THE KEY to remain closed. No latch would require you to locate the quickly in an emergency.", "title": "A Beautiful setting", "user": "CSturgeo", "date": "July 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 133440047}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We had difficulty adjusting the A/C and when the staff left a window in the bathroom open which we did not see, the A/C was useless.", "title": "great view of volcano", "user": "MizzouLizard", "date": "June 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 132487536}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The view from this hotel was stunning and we spent as much time as possible outside in the very attractive gardens.", "title": "Wave at the Volcano, Pass this Hotel BYE BYE", "helpfulness": 1, "user": "DivaLadyJ_28", "date": "June 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 132071648}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The view of the volcano is the reason to visit this hotel. The picture is not a lie, and it was awesome one morning we were there. We were fortunate to have one of the cabins so it had a lot of space, it was fairly quiet, and the A/C worked. The kids enjoyed the pool, and the restaurant/bar area was kind of cool with a tiki hut style roof and open air views. The meals were ok, and they had some wifi in the lobby. On the negative side, we had no water pressure in the shower, some friends had no hot water, our refrigerator did not work, and the electric plugs were out on one side of the room. We had a king-size bed, which was great, but it was a little saggy.", "title": "Lower first floor building", "user": "Amanda H", "date": "March 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 1.0, "location": 4.0}, "id": 126313333}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "There was so much disatification that I'm just going to list the error of this hotel's ways! While giving credit to the few things that were OK. I was traveling for semi-business so this trip was not paid with personal dollars. But I felt so bad ANYBODY had to pay money on this place. Fellow TA Reviewers...trust me...I am very fair and honest! just read my other reviews. Had I not been on a tour with native Spanish speakers I would've been lost because outside of housekeeping staff, no one else was very nice.", "title": "Good for the price", "user": "Denise L", "date": "March 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125912876}], "location": {"country": "Costa Rica", "continent": "Central America"}, "stars": 3, "variance": {"poor": 16, "average": 20, "very good": 18, "terrible": 11, "excellent": 10}, "aka": "Lavas Tacotal Hotel", "slim_ranking": 0.875, "description": "At hotel Lavas Tacotal you can enjoy the natural greatness of the Arenal Volcano. Its amazing conic shape and constant volcanic activity, the Arenal Volcano is one of the most important attractions in Costa Rica. Walk through trails of solidified lava, ride across exhuberant forests, the activity of the Arenal Volcano during the day or by night. The amazing spectacle of incandescent lava flowing from the crater is truly breathtaking. The hotel amenities includes air conditioning, maid service, pool, restaurant, tennis, bar, laundry, spa, 24 hour security, souvenir shop, and private parking. handicap facilities, and non smoking rooms are also available. The room amenities includes cable TVs, balcony, safe deposit boxes, telephones, mini bars, and Internet connection."}