{"user_rating": 3.5, "review_count": 46, "name": "Hotel Sidi Bou Fares", "reviews": [{"rating": 1.0, "title": "Great setting, not a great choice", "text": "The setting is great! Sidi Bou Said is a quaint, quiet, quintessential Tunisian town. However, Hotel Sidi Bou Fares was not what we expected. Rustic, traditional bedding (read that: straw mattresses), hobbit-sized room with a even smaller, b-a-r-e-l-y functional bathroom squeezed out of the square room space. Friendly host/owner/desk manager - but not truly fluent in English. We heard the heavy rain pounding the block ceiling all night and left for elsewhere the next day. Then, we discovered that Hotel Sidi Bou Fares was also overpriced, by 50%. Also, the credit card was hammered as if the price was in US$ instead of TD - another 30% rip! Take a peek, chat with the host, but stay at Carthage property.", "helpfulness": 15, "user": "dmeade", "date": "March 9, 2006", "id": 4596504}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "The 24-hour desk staff are multi-lingual, and ever-helpful with matters of finding taxis and restaurants. Breakfast is quite nice, outside in the patio sunshine or shade, usually with one of the local cats for company -- not begging, just being amiable. Sometime there are a couple of pet tortoises sunning as well. Walk around the corner for superb hilltop views over the city at sunrise and sunset. It is near the President's palace, so there is a bit of security to negotiate if you drive out over the top of the hill -- usually just a wave. You have to run the gauntlet of the tourist market when you walk down the hill; there is an art gallery worth visiting on the way down on the right, just before the street goes from cobbled to asphalt. The hotel and the district combine to make a memorable destination.", "title": "Our kind of place -- quirky and comfortable.", "helpfulness": 1, "user": "seegarjm", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 88872187}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "A very sweet hotel in a great location in a quiet side street off the main tourist square in picturesque Sidi Bou Said. The rooms are set around a beautiful courtyard with plants, chairs and a gazebo. Staff were very friendly (they served us breakfast even though we were up really late!). Breakfast was the standard hotel breakfast (yoghurt, bread, jam and Dairylea-style cheese).", "title": "Hotel de charme with some nice touches but no frills for the price", "helpfulness": 1, "user": "HamnMaus", "date": "August 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 38456259}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "We thought the hotel was a bit overpriced as the rooms were small and fairly basic. They did have ensuites and a wardrobe, but no frills. The shower temperature was a bit unpredictable; more cold than hot. The air con however was very good especially as the rooms were quite small.", "title": "Simple accommodation in quiet surroundings.", "helpfulness": 1, "user": "Steinthor", "date": "July 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 34619679}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We knew the price beforehand and decided to pay it anyway as we wanted a charming hotel with character. On that front we weren't disappointed.", "title": "Charming hotel, but a bit expensive.", "helpfulness": 1, "user": "spw1984", "date": "May 20, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 16252103}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I stayed in Hotel Sidi Bou Fares for 3 nights and immediately found it a haven of peace, especially enjoyable sitting in the courtyard reading a book. It was not easy for me to find the hotel, perhaps did not receive the best information from the taxi driver who dropped me off few streets away (he tried to charge me more than we agreed on, so wasn't really helpful). The room itself was tiny but the bed comfortable and bathroom clean, which for me is very important; star rating does not mean much if the bathroom isn't clean. Staff did not seem to understand much in English but happy to express themselves in body language if needed! I was able to have my breakfast at the time best suited to my needs, enough for me but some would expect more. Short walk from the hotel there is a magnificent view over Cap Bon, loved it... great village to stay for a few days.", "title": "Charming haven of tranquillity", "user": "TRC3", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15101163, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here one night and then moved to another hotel. It was too uncomfortable here and certainly not worth the price. The rooms are tiny, with barely room for a suitcase. The bathroom is so tiny you have to keep the bathroom door open to bend down to the sink. The shower is suffocating. And this is for a double room! Also the room is dark and musty, no air conditioning and tiny windows. The only redeeming feature would be the cute tiles and courtyard. However, the staff was very curt, unfriendly and treated us like we were in a crowded grocery store check out line.", "title": "Tiny, uncomfortable and rude staff", "helpfulness": 1, "user": "fun_adventure", "date": "June 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 131619488}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "If you want to stay in Sidi, this hotel is in a great location. I can't comment on whether it is overpriced, as we made plans at the last minute so didn't look around. The room is beautiful, but is extremely tiny, so be prepared. Beds are not terribly comfortable, but I had taken red-eye in that morning, so was fine for me. There is a lovely courtyard where they serve you breakfast. If you are in any sort of hurry though, definitely make that clear, as even though we were the only people eating that morning we had trouble getting coffee. The folks there are extremely nice though - not a bad choice overall.", "title": "Great location and courtyard", "user": "winnie1000", "date": "May 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 130625656}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "the location is great - the entire town of sidi bou said is amazing. the rooms are tiled beautifully and the courtyard creates a very charming staying experience.", "title": "Lovely location and hotel", "user": "radsk", "date": "April 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127950168}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "I echo the other reviews here. It is a lovely property and affordable for this location. Ask for extra blankets (duvet in french!), and definitely take a taxi from the train station, it's an up hill walk with luggage and its no fun.", "title": "Beautiful property", "user": "islandgirl32226", "date": "March 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126307800}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed here for two nights over Christmas and would definitely recommend it. It was cold but the lovely tiled rooms, though small, were well heated. The staff were friendly and helpful.", "title": "A good choice", "helpfulness": 2, "user": "Giff69", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122430541}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "Hotel Bou Fares is a charming little hotel in the most charming suburb of Tunis. What the hotel lacks in luxury it makes up for in charm. We spent 3 nights there when we first arrived in Tunisia. We then rented a car and drove south but came back and spent our last night at Hotel Bou Fares. We liked it the best of all the hotels we stayed in.", "title": "Great choice", "helpfulness": 1, "user": "KerryBorn", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12906432}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel consists of about 8 rooms around a courtyard. The rooms are beautifully tiled and have private baths. Breakfast is served in the courtyard. I was a little worried about the weather in December but it was sunny and in the 60s every day except one. We ate breakfast in our room but most people ate in the courtyard. Breakfast was simple but good.", "title": "Not fancy, bit pricey, but charming", "helpfulness": 1, "user": "knievel", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7193608, "likes": {"liked": "— Charm, staff", "disliked": "— Lack of amenities, price"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The staff is friendly and helpful. I had a problem on my last day and the 2nd shift manager could not have been more helpful. He even lent me his cell phone when I had to go into the city.", "title": "tight quarters, but charming", "helpfulness": 1, "user": "pamsrollz", "date": "November 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6093440, "likes": {"liked": "— central location", "disliked": "— small size of the room"}}, {"rating": 5.0, "title": "Quiet and charming", "text": "It is very inexpensive and easy to get into the city - about a 20 min train ride. It was nice to see the city but we were always so happy to get back to Sidi Bou Said. (My feedback only applies to the winter. I have heard that Sidi Bou Said is extremely crowded with tourists in the summer. )", "helpfulness": 4, "user": "melshocker", "date": "November 5, 2006", "id": 6059193}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "Booking the hotel was the only part that was not perfect. The hotel was great about responding to emails but I had to send a deposit via Western Union. I had never sent money that way before. I thought the Western Union charge for sending the money was rather high.", "title": "Beautiful little Oasis", "helpfulness": 12, "user": "Phileasfox", "date": "May 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5038479}], "location": {"country": "Tunisia", "continent": "Africa", "city": "Sidi Bou Said"}, "variance": {"poor": 4, "average": 16, "very good": 13, "terrible": 5, "excellent": 8}, "aka": "Sidi Bou Fares Hotel", "slim_ranking": 1.0}