{"user_rating": 4.5, "review_count": 279, "name": "Hotel Alcyon", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "This hotel is in a great location and only a couple of minutes walk to the beach and all the restaurants and bars. It is very clean and well maintained. Good value for money. The rooms are small but adequate and the bathroom was ok. Our shower was broken (swung from side to side and you had to follow it!!) but was powerful and there was always hot water. Towels are dire. You can see though them they are so old. Overall a pleasant experience but this hotel does nothing to stand out from the crowd.", "title": "Adequate hotel, good location.", "helpfulness": 1, "user": "Emma6814", "date": "May 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 30654800}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My wife and I were so looking forward to a long weekend at this hotel in Biarritz; however, we were sorely disappointed. Although a superior room, our bedroom was cramped and extremely draughty, such that we both repeatedly woke up cold in the night. The bath was frankly ridiculous and barely large enough to wash a small dog, let alone a person! One of the attractions of the hotel was the \"salon\" downstairs as a place to read and relax: however, the TV seemed to be always tuned into MTV on volume and guarded by a couple of the owners' (?) daughters. Breakfast was really nothing more than a cold stodgy croissant, which was rather a let down. Although the owners were pleasant enough, a hotel best to avoid.", "title": "Didn't live up to expectations", "helpfulness": 3, "user": "LondonChieftain", "date": "April 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 2.0, "rooms": 1.0}, "id": 27859594}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We booked a shower room with large bed, assuming that that would mean a decent sized bedroom. However, even for just 2 nights the room itself was too small to be comfortable - although it was stylish and clean. The big downside was the ensuite shower room, which was \"cloakroom sized\" and the space in front of the basin and loo was very tight. Had we have booked into a cheaper room, such as 204 - the ensuite and bedroom was of a completely different size - which seemed completely contradictory to get a better sized room for a cheaper rate. We can recommend the hotel but not that room range - which will also apply to 105 and 205 - I guess", "title": "Small boutique hotel,small bedroom(305) and unacceptably small ensuite", "user": "SandIWestYorkshire", "date": "April 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 27386833}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I can't recommend this hotel enough. We stayed there in September for about 5 days and the visit was flawless. I learned of the hotel from the reviews on TripAdvisor and we weren't disappointed. This is a small hotel run by a small but very helpful staff. They provide a simple breakfast each morning that in our opinion was perfect. The staff helped us figure out where to park our rental car (there is a free parking lot about a 5 min. walk from the hotel). The room had everything we needed including free wireless. A lot of the other hotels in and around Biarritz were pricey and crowded. If you're looking for a big hotel with lots of amenities then this is probably not the place for you. However if you're looking for a little oasis in what can be a very crowded and busy place then you will love this hotel. They even have sound proof windows and black out shades that slide down on the outside of the windows. This hotel is a gem. I highly recommend it!!", "title": "Fantastic find in Biarritz", "user": "hd3530", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22319233, "likes": {"liked": "— Small, personalized, very well run hotel", "disliked": "— The night manager was a bit strange"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The hotel Alcyon is gorgeous me and my friend spent a lovely stay in Biarritz as it was the 1st time for us...the staff was really helpful they gave us such good advices ( where to go and eat.....) and the room we had was great with 3 big windows and little balcony......", "title": "What a wonderful stay!", "user": "jeankikiParis", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20611696, "likes": {"liked": "— decoration and staff", "disliked": "— car parking"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We spent three nights here in October 09. This boutique hotel is in a great location with a wonderful 19th century facade. The interior decor is quite modern and our room was very well laid out. We were particularly impressed by the presence of a window in our bathroom, almost unheard of in hotels these days. The staff were very friendly and helpful. They recommended two excellent restaurants, one of which served the best foie gras we've ever tasted! The ambiance of the Alcyon was very relaxed and we thoroughly enjoyed our stay here. Would have no hesitation in recommending this hotel.", "title": "Excellent hotel. Well run and very friendly.", "helpfulness": 1, "user": "SeanMulligan", "date": "January 5, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 52671124}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed in this hotel for one night. The room was very small and it appears that they have 3 different size rooms on each floor and different prices for each room! The bathroom was tiny and would not suit a larger person. The continental breakfast was good. The hotel itself was spotless clean but the bed was not very comfortable. It is up an hill and only 5 minutes walk to the beach. It has steep steps into the reception area and would therefore not advise it for anyone who is disabled. No air-con in the rooms and therefore had to open the window which made the room very noisy. There is no immediately parking and the nearest car park was approximately 15 euros a day. If I visited the area again I would not stay at this hotel.", "title": "Boutique Hotel, not disabled friendly!", "helpfulness": 1, "user": "interlude19", "date": "October 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 45694460}, {"rating": 3.0, "title": "O.K. hotel but smallest bathroom in the world!!!", "text": "The location of this hotel is excellent, just a block from the beach and close to the main shopping area and the casino. There is no bar or restaurant in the hotel but these are available close by. I would not however recommend this hotel to anyone large in stature - as the bathroom is incredibly small and it would be impossible for a large person to move around it.", "helpfulness": 1, "user": "Basque_Explorer", "date": "September 28, 2009", "id": 45345414}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "However the hotel was spotless clean and nobody goes to the basque country to stay in their room anyway.", "title": "Good hotel but nothing special", "user": "BunkyVA", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 44081648}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "One tip, we did find a bit of noise in the mornings from the reception desk so if you can avoid staying on the first floor I would recommend that.", "title": "Fairly good", "user": "JulieClaret", "date": "September 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 39895746}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I stayed in a superior room with my wife and 5 year old daughter - not sure about the other reviews regarding the size of the bathroom as we found it to be an excellent size and certainly no issues with the towels being too thin!! The only negative was the fact there was no air con but Eric (the proprietor) assured us this was being installed next year. The room had double glazed windows/shutters but when opened it was noisy during the night time, however the room decor was great - very contemporary in design and you could see the owners took great care in their hotel. The bed was large but a little uncomfortable for more than a couple of nights - as it dipped in the middle - or perhaps just used to my own bed! The daily room cleaning was brilliant. Location is superb, approx 200m to the main beach. Eating out can be somewhat expensive, a average meal for the 3 of us (with a bottle of wine) was a little under 100 Euro!! A pint of beer will certainly cost you 6 to 7 Euro - so be warned. However, this did not spoil a great holiday and would definately recommend a visit to the local food market (a great choice) and the 2 seafood restaurants at the port is highly recommended. Located very close to the airport (but no airport noise at all) and the beach is fantastic (especially as we've lived in Manly, Australia for the past 12 years!). We recommend breakfast at the cafe on the main beach (under the casino) - not the cheapest but the best service and value and a brilliant view watching the surfers. We didn't try the hotel breakfast so unable to comment. Overall, an excellent holiday and we would be inclined to return to the same hotel but only for a long weekend perhaps.", "title": "Great Choice!", "user": "Georgiel1", "date": "September 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39858377}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Excellent quiet hotel in a busy city. Room was good and en suite excellent with a great shower! Breakfast was a real surprise - a lovely selection of fresh fruit, fresh orange juice, yoghurts, meat, cheese, cakes, bread, etc,etc. Very well placed for the main beach and restaurants. Try the Collonades opposite the Casino for a quiet drink while 'people-watching'!! The food is pretty good there too.", "title": "Wonderful find - close to amenties, but quiet - lovely Breakfast", "user": "ckhmold", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38833531}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "I stayed at the Alcyon in September 08 with a group of ten of us on a golf holiday. As it is a small hotel we took up quite a number of its rooms. It is conveniently located close to the centre of Biarritz. The staff were friendly and helpful, even ringing ahead to golf clubs to check they were open during unseasonal rain. The breakfast wasn't awe inspiring, but perfectly okay. I had the superior room which was a decent size, but some of the other rooms were a bit pokey to be honest.", "title": "Convenient, clean and friendly", "user": "romannose73", "date": "July 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35447061}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "All in all it's quite a nice hotel, not one you would want to stay in for too long, but for a smaller boutique place that has convenience written all over it, it is perfect. For price and location it was spot on. Just get the superior room.", "title": "Lovely and Welcoming Boutique Hotel", "user": "nickodimos", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33484156}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Stayed here for 2 nights and was absolutely pleased with the hotel and Eric the owner could not be friendlier. I even forgot my charger and he called me and met me at the airport before I flew out! WOW!", "title": "Great Location, Good Value", "user": "MadamJosephine", "date": "June 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32938004}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Hotel: lovely, boutique style.", "title": "Its no more that I would expect for the money but I really liked it", "helpfulness": 1, "user": "AllanBLondon", "date": "July 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 72018268}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Location: excellent, next to everything but quite noisy, especially at night", "title": "Really charming and friendly stay", "user": "Choccyho", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71884443}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Room: superior room with balcony very nice, but at 140 euros a night it should be. Standard rooms looked small. Free and fast wireless - big plus.", "title": "Excellent hotel - and fanastic value too!", "user": "AilLondon", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 66590041}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Service. MMMMM. At first I thought the owner was rude, and I heard her tell someone on the phone that 'she had no problem', suggesting the caller was also finding her rude. However, she refused no request and by the end I really liked her. I think its just she is French and has not yet, hopefully never, adopted the 'have a nice day' fake smile that we have all become used to.", "title": "Very nice, friendly, most convenient, would recommend", "user": "RebelRanter", "date": "May 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63493122}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Overall - really pleased. Stay here.", "title": "Great location, value for money and owners!", "helpfulness": 1, "user": "CandidKiwi", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60550619}], "location": {"country": "France", "region": "Aquitaine", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 22, "very good": 71, "terrible": 0, "excellent": 183}, "aka": "Alcyon Hotel Biarritz", "slim_ranking": 0.0147058823529, "description": "Christine & Eric welcome you in Biarritz at Hotel Alcyon.If you are looking for a quiet, comfort and warming place, you have chosen the best place in the centre of the Basque city, Biarritz !Designed by local architect Raymond Larrebat Tudor, this building dates back from the 19th century.A complete non smoking establishment, our charming hotel and its 15 rooms has been completely renovated and modernized, well equiped with quilt on comfort bed,air-conditionning, flat screen, mini fridge, making tea & coffee facilities, safety box, phone, hair-drying, double glazing and black-out blinds."}