{"user_rating": 4.0, "review_count": 759, "name": "Hotel Weber Ambassador Capri", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This hotel is situated in a spectacular location overlooking Marina Piccola. Our room was spacious, clean and had wonderful views over the bay from our balcony. We found the reception staff to be particularly helpful and welcoming. The hotel provides a free mini bus every ten to fifteen minutes until 2 am to and from Capri town and also to the port when you leave. Breakfast offered everything you could imagine and the restaurant served food all day although most people ate out either in small restaurants in the vicinity or in Capri town which is an experience not to be missed, particularly in the evening when the day trippers have left. We have high standards and thoroughly recommend this hotel. We can't wait to return!", "title": "Look no further - stay here!", "helpfulness": 1, "user": "flubadub", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34540884}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The room was separate from Hotel with it's own terrace. Furnished to a very high standard and very clean, plugs and mirrors in the right place [very important!] Reception staff were very friendly. Food was excellent. Overall ...excellent!!", "title": "Absolutely Fantastic!!", "helpfulness": 1, "user": "redcastlecottage", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34009820}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Having stayed in excellent hotels in Amalfi and Positano we expected good things of this 4 star hotel in Capri. Unfortunatelty we found that the rooms were small and in the style of a travel lodge. The worst aspect by far was the attitude of the staff who were negative and at times aggresive.", "title": "Avoid - Terrible Staff!", "helpfulness": 2, "user": "GB9", "date": "June 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 33081415}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "location fantastic, rooms spacious and clean, a very nice touch is the drinks and snacks reception on arrival. The bus service second to none and we found the staff very helpful and full of smiles. Breakfast on the terrace with an amazing views. My friends and I were very happy and will definately be recommending to others and visiting again.", "title": "excellent location", "helpfulness": 1, "user": "zenado", "date": "June 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32640238}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed here at the start of June. After touring around Italy for a few weeks, we were looking forward to our stay at the Weber and to relax for a few days. But we ended up been very disappointed.", "title": "Do not recommend", "helpfulness": 3, "user": "kiwiabroad100", "date": "June 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 32447346}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I stayed in the Weber with my faincee and we were very disappointed with it.", "title": "A very average hotel but good value", "helpfulness": 1, "user": "SMZeus", "date": "June 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 31711019}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The hotel is just grand....pool area is very disappointing, staff appear to be going through the motions, but have little real interest in what they are doing or in you.", "title": "Gorgeous views, quiet, but removed from town . . .", "helpfulness": 3, "user": "nancyandashesh", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31231520}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "They do have very regular free transfers to Capri, but I would never recommend this hotel.", "title": "Great hotel for your trip to Capri", "user": "yahootraveler", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30908959}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Mixed feelings. We went with another couple, stayed 4 days in Positano before coming here for 2 nights. We loved the view--the rugged beauty of Capri is unsurpassed. We had reserved a superior room (ocean view from window) E147 and one deluxe room (ocean view from small terrace) E162. We both got upgraded to rooms with large balconies (2 chaise lounges, a table with 2 chairs and umbrella.) Rooms 449 and 501.", "title": "Beautiful beachside hotel, wonderful service", "helpfulness": 2, "user": "RngMma", "date": "May 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 30393920}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "HOTEL. Perched on a cliff overlooking the best beach on Capri (a rocky beach, small and slightly stinky, but pretty to look at). The rooms were average size and clean, but it does NOT deserve 4 stars. Everything a tiny bit on the shabby side--needs updating. The bathroom was ok size. As for the towels, I dismissed the previous reviewers as being overly picky, but they WERE like sandpaper!! I've never even noticed towels at a hotel before, and these were horrendous. If I'd been sunburned, it would've been unbearable to use them. Thin, dingy, and scratchy. I line-dry my towels at home, and they don't feel like that--not sure what they do to those towels to make them feel so crunchy. Adequate accomodation, and the view sure made up for the drawbacks.", "title": "The best location!!", "user": "aggiezeta", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26501884}, {"rating": 4.0, "title": "Best location and view in Capri", "text": "I was very happy with this hotel. The views of the beach and the cliffs over the water are amazing and the hotel's restaurant is out on the terrace overlooking this stunning view. The breakfast at the hotel is very good, featuring italian meats and cheeses, pasta..more than your standard continental breakfast. The location is perfect. Its just a short walk down to the Marina Piccola beach. From the other hotels in town you would have to take a bus to the beach, which is a deal breaker for me. The Weber provides a free van to and from town all day and night which is very convienient. There are some amazing restaurants and outdoor cafes in town so you'll want to go there every night.", "helpfulness": 1, "user": "Starling78", "date": "March 10, 2009", "id": 25952525}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Ok so there is one down side..the rooms are small and not particularly nice. The beds were uncomfortable too. It is definately a hotel and not a resort. What they are mainly offering is the location. There are other hotels downtown which I have no doubt have nicer rooms and probably a better in house restaurant but for me being right in the prime beach location definately trumps a jacuzzi tub and a mini bar.", "title": "Great choice for a nice stay in Capri", "user": "BitterSweetKid", "date": "February 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 24367934, "likes": {"liked": "— Fantastic views and great shuttle service"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "Prior to our arrival at the Weber I doubted our vacation would be great because we had a very hard time finding 3 rooms in the same hotel even if we booked them early march (for august-if you want to book the hotel of your liking in Capri I suggest booking at least 6-8 months ahead as the island offers limited accommodation),and some reviews of the Weber here gave me reasons to worry.At first our agency found a hotel in Marina Grande(I wouldn't recommend a hotel in this area because is noisy and the beach is a long walk away),but then the hotel wouldn't send the confirmation so we finally booked 3 rooms at the Weber.We booked standard rooms(no view) but were given Deluxe rooms(sea view) at the same price as there was a room mix-up.", "title": "Felt like movie stars!", "helpfulness": 1, "user": "travelroos03", "date": "February 7, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 24357160}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Hotel is great:a very nice touch was the welcoming buffet,great view,very good breakfast (suited perfectly for germans and americans ), the shuttle service every 10 minutes to and from the city is a blessing and it runs till after midnight(renting a car is recommended only for very good drivers as streets are the narrowest i have ever seen and there are a lot of serpentines),the also have a pool which is quite small and not at all deep,but you can at least use the sunchairs (as they are quite expensive at the beach,and it is unconfortable to use a beach towel as the beach is made of little pebbles).", "title": "Amazing hotel for a great price", "helpfulness": 1, "user": "Hayesch", "date": "December 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22731301, "likes": {"liked": "— Location, Location, Location!", "disliked": "— Towels"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We stayed at the lowest floor and had a small deck with a table and chairs.The room was spacious and clean.It smelled nice especially considering there were no windows (there was a glass door with sun blinds).There are so many things to see in Capri we didn't get to use our rooms much.", "title": "Only a word: a dream", "user": "HelgaBerlin", "date": "November 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21740579}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "From the website and trip advisor reviews, we expected a lot more from this hotel. At best, it is a totally average 2 star hotel. The buffet breakfast was terrible - definitely avoid. The staff was totally uninterested and unfriendly, although one of the shuttle drivers was nice. Do more research and find somewhere else. PS: go to La Pergola Restaurant - food and service were both amazing.", "title": "Beware - not a 4 star hotel", "helpfulness": 3, "user": "skh36", "date": "June 15, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 32417664}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed at Hotel Weber for four nights last May and didn’t like it. Others may have reasonable experiences there, but it didn’t meet our expectations, and I wouldn’t go back. Off the bat, I’ll say that the hotel was reasonably clean, and I’m from New York, so I wasn’t surprised or put off by the small room. But the accommodations were closer to motel than hotel, and the staff attitude ranged from unhelpful to outright unfriendly.", "title": "Avoid,Avoid,Avoid!!!!!", "helpfulness": 3, "user": "jeremysteplaton61", "date": "June 12, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 32163773}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": ".", "title": "return to capri", "helpfulness": 1, "user": "robertbellbrook", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31931916}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "this is our second stay at hotel weber and we were pleased with the service. the rooms were spacious and clean. the hotel helped arrange a wonderful boat ride around the island. the breakfast although extra (11 euros) is exceptional and rivals the better buffet breakfasts in the us. the hotel is located on the side of the island opposite the main post. it is a beautiful location ,quiet and includes a small pool and beach. the second pool was still under construction and looks like it will be ready later this summer.the only concerns were that the front desk gave us some minor misinformation on when certain events in anacapri were open but they did not cause us to miss anything. the hotel provides shuttle service to and from capri at no cost on a regular basis. they also will pick you up and drop you off at the port for a reasonable 3 euro per person. we definitely would chose to stay here again. it is a great value for the money. they give a 10% discount if you pay cash. the price is excellant for the service and location", "title": "Gorgeous ocean view, access, and experience you can hear, see, smell + awesome transport to Capri central", "helpfulness": 1, "user": "kcautumn", "date": "June 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31811717}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Ongoing transportation - They picked us up from Marina Grande (a HUGE plus) and every 15 min they offered service to/from Capri and the hotel (Marina Piccola). Champagne greeting upon arrival, responsive to requests thereafter. Clean rooms with postcard ready ocean view + patio for a little more $ (or shared one for no extra)! Beach is rocky - so don't expect El Caribe. Shower design led to water overflow, but not a big deal. Overall - this hotel is a great deal! We chose to skip breakfast - so can't comment on that.", "title": "good value, great location", "helpfulness": 1, "user": "lrr720", "date": "June 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 31798044}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 4, "variance": {"poor": 47, "average": 64, "very good": 258, "terrible": 56, "excellent": 334}, "slim_ranking": 0.558139534884, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "The Weber Ambassador Hotel is a four-star luxury hotel, right on the Marina Piccola Beach on the island of Capri. No beach in the world is more fashionable than Marina Piccola, where the international jet set moor their yachts during the summer. But Marina Piccola beach is more than just the favourite meeting place for the rich and famous: it's also a site of great natural beauty, with pristine waters and superb view of the Faraglioni."}