{"user_rating": 4.5, "review_count": 563, "name": "Hotel Ritz Madrid by Orient-Express", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "I feel horrible, I tried to love it. I bet about 40 years ago I would have adored it. The good:hand loomed carpet, marble bathroom, great location, wonderful service, great view of the museums. Instead of listing the bad I'll just say that I felt like I was in a nightmare version of Versailles.", "title": "I feel so bad!", "helpfulness": 4, "user": "PICKYTRAVELER27", "date": "May 15, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 5076755}, {"rating": 4.0, "title": "Old World Elegance", "text": "The major props that they get is the private guide that they recommended to my travel agent -her name is Isabel Cortes and is one of the most incredible people I've ever met. I would recommend using her--she knows everything and more and takes wonderful pictures. And of course Omar--one of the hotels drivers that drove us around for the day in an S Class Mercedes.", "helpfulness": 8, "user": "diamondsgirl", "date": "May 6, 2006", "id": 5038407}, {"rating": 5.0, "title": "Spectacular Hotel", "text": "All in all, I didn't cry when I got there, I just wasn't head over heels with it. I think they said they are renovating soon so I would probably go back after the renovation but not before.", "helpfulness": 6, "user": "joansmithe", "date": "April 7, 2006", "id": 4949980}, {"rating": 5.0, "title": "First class setting in a old world setting", "text": "We recently stayed at the Ritz Hotel in Madrid Spain. We were there for 2 nights May1st and 2nd 2006. This hotel is all about \"old world elegance\". We booked through American Express and were upgraded to a junior suite upon arrival. It had a spacious bedroom with twin beds. (We gladly gave up a deluxe room with a king bed to have the separate livingroom) the bathroom was small with only one sink in the vanity. The rain down shower head didnt work that well. The common rooms are very opulently decorated, and yet not stuffy. The Ritz has a beautiful outdoor garden where we had lunch both days, and a formal diningroom, Goya, where breakfast is served daily and dinner most nights. A word of caution about dining at the Ritz.Make your reservations prior to arriving for dinner at the Goya restaurant. If you wait until you arrive, as we did , it was fully booked both nights and our only other choice was to eat in the Hall Bar (tapas).", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 12, 2006", "id": 4455396}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The conceirge arranged for a last minute side trip to Toledo,which we highly recommend taking. Toledo is a stunningly beautiful city. One not to be missed if you are as close as Madrid. We would definitely stay here again over the Westin Madrid, because it had a cozier less business-like atmosphere.", "title": "Let me clarify", "helpfulness": 10, "user": "bubba89", "date": "January 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4391461}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Staying at the Ritz was like staying in a museum. From the time we entered the lobby to the comfort of our room, we had a feeling as though we'd stepped back in time. The service was excellent, the facilities first rate, and the overall experience unmatchable.", "title": "Old World Elegance", "helpfulness": 13, "user": "ShutterGo", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6559887, "likes": {"liked": "— Overall sense of history and luxury", "disliked": "— Cost of meals in the restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We've stayed in Four Seasons/Ritz Carltons in the US and the decor in those was brand new old Europe. In this hotel, the carpets are original (and are repaired rather than replaced) and this reflects the general sense of having traveled back in time. If you want new and shiney, this isn't the place to stay. If you've ever visited Hearst Castle and wished you could stay a night, this is the place.", "title": "Totally pampered", "helpfulness": 8, "user": "VanGogh2", "date": "December 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6314595, "likes": {"liked": "— comfort and location", "disliked": "— expense of breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The only downside was the expensive food. Our most expensive meal while in Madrid was our breakfast at the Ritz.", "title": "Excellent every time", "helpfulness": 5, "user": "Cojones", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6308452, "likes": {"liked": "— The service. Turndown service with daily Ritz news (weather report and things to do) was a nice touch", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Our room at a basic rate (see below) was spacious, including a large bathroom and a flat panel tv. When we needed an extra pillow, the service was prompt and they offered a pillow menu to made a choice.", "title": "A Let Down", "helpfulness": 8, "user": "Brum74", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 6062837}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The Madrid Bus stops right out front. It's 14 euros and is the best way to travel around Madrid. It makes frequent stops and you can hop on and off at different sites around Madrid.", "title": "Worst concierce service in the world!", "helpfulness": 5, "user": "poliana23", "date": "November 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6049711, "likes": {"liked": "— Location", "disliked": "— Concierge and bathroom"}}, {"rating": 5.0, "title": "Enchanting", "text": "The hotel is right in the heart of Madrid across the street from the Prado Musuem. Elegance throughout if not bit dated, but who cares, this is pure luxury of the old fashioned kind. The location is wonderful, the buffet breakfast massive and very well presented. Our room was comfortable and although a bit dated, served us well. Beware of the ridiculously priced room bar. Far too expensive even for those on expense account. Service was terrific and could not be faulted. Old world charm in a fast paced city. There are many green spaces around and this ever so nice to come back to after exhausting sightseeing.", "user": "lisamanners", "date": "October 11, 2008", "id": 20796734}, {"rating": 4.0, "title": "pleased with the decision to stay here", "text": "A wonderful hotel in a wonderful city.", "user": "BiginMadrid", "date": "September 11, 2008", "id": 19977440}, {"rating": 3.0, "title": "Rooms need work but the restaurant was terrific!", "text": "Spent a couple of days in Madrid and after lengthy research on the hotels in the city booked the Ritz Hotel for our stay. As far as location is concerned the hotel is ideal and across the road from the Westin Palace hotel (which probably would have been our first choice but didn't seem to have availability for the time we were there even though I was looking to book months ago) We got a good rate with TravelRepublic (cheaper than the hotel website) who I had never booked with before", "user": "Elisabeth_7", "date": "June 21, 2008", "id": 17097572}, {"rating": 5.0, "title": "Loved the Ritz in Madrid", "text": "Anyway, having booked the Ritz I was pleased with the decision despite a number of reviews commenting upon the decor,etc around the hotel. We got there a little early but the staff invited us to have a drink (on the house) in the garden terrace whilst the room was being prepared. We were then escorted to our room (non-smoking) which was on the top floor. I must that say that given the number of previous reviews I have read regarding standard of rooms - I was pleasantly surprised. I wasn't sure whether this was the case due to being slightly out of the main tourist season. The room was bigger than I expected with built in wardrobes, the furniture was of a reasonable standard and in keeping with a traditional hotel. The bathroom was fine if not slightly small compared to the size of the room but no matter. The room had a TV/DVD - and (unlike any of the other hotels in Madrid it appears) with English speaking channels (BBC; Sky news; CNN this certainly made a difference) The hotel breakfast was perfectly adequate and the staff were attentive and polite at all times. We noticed a number of other residents walking around in jeans/t-shirts in the day but for dinner those dining in the restaurant the men did all have ties/jackets. We didn't eat at the hotel - the food was pricey and we prefered to head to the sol area which was only 10-15mins walk away. We did however do high tea at the Ritz (well you've got to haven't you) and had evening drinks in the lobby which was pleasant. There was a turndown service every evening with the maid leaving little chocolates, fruit, even a cake on our arrival! They didn't start cleaning too early in the morning either which is what I have read about some hotels", "user": "Karin246", "date": "June 8, 2008", "id": 16783144}, {"rating": 5.0, "title": "Could Use a Few Updates, but Still a Great Hotel", "text": "This hotel is not cheap but with most things in life you get what you pay for and having walked around the city and seen the various locations of the hotels I had considered booking I was glad I decided to go for the Ritz. Those on the noisy Gran Via would be fine if you are young and with a group of frends, I guess. If you want a more hip and trendy hotel then the nearby Villa Real and Urban looked ok but the location and the little extras at the Ritz are what really set this hotel (and probably the Palace) apart from the others downtown.", "user": "WynneWoody", "date": "April 9, 2008", "id": 14911762}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Still one of Madrid's great hotels despite the fact not much money seems to be going on improving its facilities, rooms included. Its greatest assets are its location - just a few steps away from the museums - and its garden where you can eat and drink (but at what prices!!). Good service, pleasant staff. When reserving, make sure you ask whether breakfast is included. Continental breakfast (from a poor buffet) is being charged at EUR 30.- per person! While our stay was pleasant, would look for something more up-to-date next time.", "title": "Pleasant stay at an old-fashioned hotel", "user": "blacklab", "date": "June 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7857214, "likes": {"liked": "— large beds", "disliked": "— price of the breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We first stayed at the Ritz in the mid-80s and have returned numerous times. The Ritz has a beautiful garden to have a a drink, a sherry or a glass of wine, and a great terrace to have breakfast. The Ritz adjoins the Prado, is near the other art museums, is near the Retiro (great for a jog), and is near the old part of Madrid with its great tapas restaurants. Thus, all the best you can ask for along with an excellent staff and service.", "title": "Great hotel but could use some upgrading", "helpfulness": 1, "user": "JAH123", "date": "May 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7711865, "likes": {"liked": "— Great historic hotel and location", "disliked": "— Wedding noise"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2003, traveled as a couple", "text": "However, to maintain its status among the best European hotels, I suggest that the bathrooms should be upgraded and the wedding noise on weekends be curtailed after midnight. Grand hotels are great places for weddings, but guests should not be listening to a band at 3AM.", "title": "Excellent", "user": "fortune", "date": "May 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7569110, "likes": {"liked": "— Cleanliness + location", "disliked": "— Going home!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Checked in at this grand hotel + were given a fabulous room. Staff were lovely + could not do enough. Only had breakfast at the hotel which was plentiful. Hotel in a great location next to the Prado + a short walk from El Retiro park. Really enjoyed this romantic stay!", "title": "lovely hotel", "helpfulness": 4, "user": "MPL", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7269840}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The Ritz is a lovely old fashioned hotel. It is very central next door to the Prada gallery and within walking distance to most of the attractions. We arrived on a Saturday evening and were given a room on the 5th floor. On the original booking it had said that we might be upgraded to a larger room. We mentioned this and they promised we would be moved the next day. We were moved to a huge room also on the 5th floor which was really lovely. Both rooms had massive bathrooms and bath robes. There were no tea/coffe making facilities in the rooms but there was a fairly expensive drinks bar. Our breakfast was included in the room price and was very good. Lots of fresh fruit, cold meat platters, pastries and full cooked breakfast. The service was one of the best I have ever come across in a hotel and the staff were really nice and friendly. All in all a very enjoyable trip. I would certainly recommend this hotel. OK the restaurant and lounge drinks prices are expensive but you do not have to eat there.", "title": "Amazing Weekend", "helpfulness": 1, "user": "hollyReading.Berks", "date": "February 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6763219, "likes": {"liked": "— the look, the feel and how amazing the Ritz is!", "disliked": "— quiet!"}}, {"rating": 3.0, "title": "Nothing ritzy here", "text": "Before choosing the", "user": "ormega", "date": "May 20, 2009", "id": 30383581}, {"rating": 5.0, "title": "Just wonderful", "text": "Before choosing this hotel I read the reviews some were impressed others were sorely disappointed. I stand with those that were disappointed! Even if you get what you think is a good deal it is not. Breakfast buffet was with minimal choices you are not informed that eggs can be ordered any way you like other than the runny scrambled version offered and you definitely get the feeling that you are being rushed out. They booked a day trip for us and had us on the wrong train for the return when we bought it to their attention they just about accused us of lying.", "user": "ChristineGrisel", "date": "May 9, 2009", "id": 29631121}, {"rating": 5.0, "title": "Elegance and olde world charm", "text": "There are some old things that are precious and some that are just old this hotel happens to be just old and stuffy.", "user": "CMC777", "date": "April 18, 2009", "id": 28270836}, {"rating": 5.0, "title": "Can't be beat...", "text": "I spent 3nights and 4 days at the Ritz. The Personnel is really very professional, efficient and helpful. They reserved tables in restaurants for us, helped with guided tours.... It is a true luxurious hotel & even though the colours on the carpets do look a bit faded what the heck, this is the mythical Ritz Hotel in Madrid after all. The hall, the restaurant and the staircase were much smaller than I thought but then perhaps it's better that way. The lounge is lovely and cosy for aperitifs, after dinner drinks (their Irish coffee is delicious, 16 euros) and for the scrumptious high tea (30 euros per person) , the only restaurant (used for breakfast too) is quite intimate, with silver cutlery. I would have liked the different cheeses to be named at the breakfast buffet to be able to buy the same back home. It’s a shame that there are no Spanish specialities available, (for breakfast & dinner) just international type food. For breakfast we wanted Serrano ham and we were charged 40 euros for one serving. Wi-fi costs 10 euros per hour or 16 euros per day. Go along to the many internet cafes around the area, 1 euro for 15 minutes. A big bottle of whisky or wine at the El Corte Ingles supermarkets will cost the same as a mini bottle in the mini-bar. In fact everything there is very expensive, but then again, you do have the quality and the numerous personnel at your disposal, so you have to know what you really want to pay for. Okay, just to split hairs, I'd say that the brass handle on the toilet door that kept falling off had not been repaired before our arrival (and still kept falling off when we left) and my husband got fed up of seeing the shade on one of the wall lamps all lopsided and put it straight! But that's all, oh yes, there seems to be something missing, a little \"je-ne-sais-quoi\". Even though the hotel's not that big, I never sensed a sort of “home from home” type atmosphere that I've found in other hotels of this genre. Is it because the personnel want to be discrete or is it because it’s the Spanish character?", "user": "laurajyl", "date": "April 16, 2009", "id": 28154107}, {"rating": 5.0, "title": "Lovely if faded", "text": "We went to the Westin Palace Hotel, just across the road, for dinner at the ASIS GALLERY RESTAURANT. The food was good but a bit too salty for us & the service was so fast that we had indigestion!! We had hardly ordered drinks than the starters arrived. The plates were taken away as soon as we had put our forks down, the main meal arrived etc etc. The Asian waitresses were not very professional either.", "user": "Battistini1", "date": "March 29, 2009", "id": 27022121}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Very simply, seriously expensive hotels should not have previous occupants hairs lying around the bathroom and toilet floors!", "title": "Hairs in the bathroom not mine!", "helpfulness": 4, "user": "dannymcl", "date": "October 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 5964412, "likes": {"liked": "— Location", "disliked": "— Hairs in the bedroom left by previous guest(s)"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "My room was surprisingly small and overlooked an internal room space. There were few amenities in the room - no coffee maker nor kettle and the TV had a pretty poor selection of channels.", "title": "Great week at the Ritz", "helpfulness": 9, "user": "elderlytraveler", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5792601, "likes": {"liked": "— Elegance and location", "disliked": "— Price"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "Hi Speed internet connection via Eurospot was incredibly expensive at around €20 per day - that's simply a rip off.", "title": "More of the same...", "helpfulness": 4, "user": "Campanu", "date": "August 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 5711303, "likes": {"liked": "— The location, and the fact of being at the Ritz.", "disliked": "— Every single thing separated."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "The desk in the room just seemed to be too low or the chair too high.", "title": "Does not deserve the name or 5 star rating", "helpfulness": 19, "user": "Travel_Hedonist", "date": "July 21, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 5.0}, "id": 5494632}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Location good but overall, the hotel did just not have that \"wow\" factor that really good hotels do.", "title": "Classical elegance in Madrid", "helpfulness": 5, "user": "JChua", "date": "May 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5183385}, {"rating": 5.0, "title": "The Perfect Luxury Experience", "text": "My husband and I spent a week at the Ritz Madrid -- the tail end of our European vacation. Everything was beyond perfection. From the moment we checked in to its elegant, Belle Epoque lobby, the staff did everything in its power to ensure that our stay was exceptional. Our room was large, with gorgeous furniture and a comfortable bed. Two walk-in closets, one for hanging clothes, one for folding items and sitting on a soft bench while dressing, made teh room even more spacious. Then there was the enormous bathroom, complete with bathtub, separate shower, water closet with dorr for privacy, towel warmers, and two sinks. Mornings were a pleasure.", "user": "ysolde", "date": "August 3, 2009", "id": 36598555}, {"rating": 5.0, "title": "Formal Old World Charm", "text": "Our package included brunch each morning, served out on the sunny terrace. The food was delicious (I grew partiicularly fond of a Spanish breakfast pastry known as a \"magdalena\"), and included eggs, a variety of cheeses and meats, pastries, fruits, as well as the traditional coffee, tea, and juice. Kudos to Betty, who seated us at our favorite sunny table every morning!", "user": "nanicinema", "date": "July 6, 2009", "id": 34046035}, {"rating": 5.0, "title": "Grand Luxury Hotel!", "text": "The Ritz provides l'Occitane products in its bathrooms. At first, I thought they would not be up to the standards of a hotel of this category, but I was pleassantly surprised with the showere gel.", "user": "CoRo1979", "date": "June 15, 2009", "id": 32415283}, {"rating": 5.0, "title": "Only Great Things to Say about the Ritz !!", "text": "This hotel is filled with style, class, and tradtition. It is also within the museum triangle (The Prado, Reina Sofia, and Thyssen-Bornemisza are all within a block or so). For art lovers, this is the place to stay. The staff is exceptionally good. Had we not had to go back to work, we would not have left.", "user": "TexasTigerDallas", "date": "May 29, 2009", "id": 31078713}, {"rating": 4.0, "title": "top but overexpensive !", "text": "We love The Ritz, and the next time we are in Madrid, we will stay there.", "user": "t2803h", "date": "May 21, 2009", "id": 30432840}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We stayed there for a weekend and it was a beautiful experience. Service was excellent and the hotel beautiful.Many people have commented on the \"run-down\" aspects of this hotel, but I found every bit charming. There are so many perfectly reserved places and brand new hotels that this grande dame made you feel like you are sharing history. Lovely details like the nightcaps you receive in you room,or the welcoming cake or the emroidered slippers, or the fresh orchids in the bathroom makes this one of those unforgettable experiences. It is not overly expensive(about 300 euros a nigth for a standard room2 sharing ).", "title": "Old school glamour", "helpfulness": 1, "user": "Notna", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 26109444}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Situated in the centre near the Prado museum, you can walk anywhere.", "title": "Superb Hotel!!!", "user": "SusanaBaires", "date": "March 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25895870}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "We loved the tearoom with its beautiful baroque furniture and chandeliers.", "title": "Classic and Majestic", "user": "MJSKS", "date": "January 27, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23962198}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "the only negative thing was the restaurent. it is not very good. We had the menu de degustacion, and it was very weak. madrid has many netter option to eat, so dont waste your time by going to the hotel restaurent. the service was impecable, but that still does not make a mediocre meal worht the 110euros perhead it costs.", "title": "Fine Hotel", "helpfulness": 1, "user": "atticuss", "date": "December 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22545095, "likes": {"liked": "— Quality", "disliked": "— Room a little tired"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I was at the Ritz Madrid 3 weeks ago and what a surprise I had… I did not know what to expect, but must admit that the fantastic and personalized service really impressed me and made me feel like a queen…", "title": "Well branded", "helpfulness": 9, "user": "99winter", "date": "November 17, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 21935185, "likes": {"liked": "— leaving on the final day", "disliked": "— limited breakfast buffet"}}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 5, "variance": {"poor": 24, "average": 47, "very good": 123, "terrible": 15, "excellent": 354}, "aka": "Ritz Madrid", "slim_ranking": 0.0416666666667, "description": "Located in the best area of Madrid, facing the Prado and the Thyssen Museum, Hotel Ritz is a legendary 104 years old Grande Dame from Europe. The standard of its service and unrivaled prestige have earned it a place among the world's best hotels. Immaculately presented rooms and suites, and elegant dining in our restaurants and our beautiful al fresco garden terrace in summer, make Hotel Ritz the perfect place to stay in Madrid."}