{"user_rating": 3.5, "review_count": 167, "name": "Hotel Sunlite Shinjuku", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Location : 8 mins walk to Shinjuku Station which is one of the main interchange station. From here there are trains heading to Narita Airport, Shibuya (fashion shopping), Akihabara (electronics and electrical heaven), Tokyo, Harajuku (Meiji Shrine and more fashion shopping), Kanga (ski, snowboard and adventure gear but you have to ask locals how to walk there from the train station). Area surrounding Shinjuku Station has even more shopping malls, restaurants and clubs. There is a Shinto temple just walking distance to the hotel. 24 hours Lawson's convenience store is about 50m from hotel.", "title": "Good location and great value", "helpfulness": 1, "user": "sabaiwanderer19", "date": "April 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 104214601}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Hotel : Helpful staff. Free wifi with best reception at lower floors. Ice machine and beer/drink vending machine at level 2. Free laundry facilities.", "title": "Excellent stay, great location", "helpfulness": 1, "user": "cathy_n_phan", "date": "April 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103552974}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "Room: Spacious twin room with fridge, TV, tea making, husk/foam pillow combo and comfortable beds. Bathroom/toilet is a little small but that is common in Japan. Plus point is toilet bowl has automated rinsing function... quite a novelty. Great shower pressure and complete toiletries supply.", "title": "A good budget hotel to consider", "helpfulness": 1, "user": "evonc", "date": "March 13, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 99977223}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My friend and I had a very comfortable four nights stay here. The hotel staff were very professional and helpful. Our room (with two single beds) was spacious but the bathroom was quite small. There was a TV, phone and mini fridge in the room. Room service is available and you could get the laundry done for free in the building (same hotel) across the street. Internet was available however the computer is quite dated and slow.", "title": "Value for money", "user": "Celarence", "date": "February 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97059413}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Hotel is quite close to both JR and local train stations, also close to great shopping and there were many places to eat at. There's a convenient store just a minute away.", "title": "Fun in Tokyo", "helpfulness": 1, "user": "poplico", "date": "February 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95947038}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Booked this hotel via Asiarooms during May 2009. This is the first time that we experience the ‘legendary’ size of a typical hotel room in Japan. The room we got was a semi-bed which means the bed size is more of a single bed plus so it can get pretty squeezy. The bathroom is so small that I kept knocking on the walls. The hotel looks a bit dated as well but it comes with free Wifi. The hotel is a good 20 minutes’ walk from the JR Shinjuku Station. The price for a room in Shinjuku is crazy. Hence, for the price we paid for the room here, I must say it is quite a bargain. It could be double the price if you are staying around JR Shinjuku Station.", "title": "Small room but good location", "helpfulness": 1, "user": "WanderLex", "date": "August 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116665273}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Location is about 20 min. from the JR station, but the subway is just 5 minutes away. Room was standard as all rooms in Japan are quite small. Rooms were clean and there was a small bathtub in the room which was nice. The staff was quick and efficient. Free use of internet on two computers in the lobby. Just simple, nothing special but good value.", "title": "Simple but good value", "helpfulness": 1, "user": "LindsayP020", "date": "August 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 116556404}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Convenience store next door, Starbucks and local coffeeshop Doutor & Veloce within 3 minutes walking distance. And also the buzz and restaurants of Shinjuku very close by.", "title": "Good hotel for the rate we paid", "user": "Ganga72", "date": "July 29, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 115977085}, {"rating": 2.0, "stay_parameters": "Stayed May 2011", "text": "My husband and I needed a place to stay during our <20 hour layover in Tokyo, and we are satisfied with what we paid for. We didn't know that it was a bit of a walk from the main station in Shinjuku (at least 15-20 minutes) although there's a smaller station a mere 5-minute walk from the hotel, which probably connects to the major stations. Importantely, though, the area is safe and quiet at night. Still, the front doors are locked at some point during the night, but we just had to call the front desk before checking out (at 4AM) so we could get out.", "title": "Traveler Beware", "user": "WKM1914", "date": "May 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 110313233}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The hotel's staff are not overly warm, but were friendly enough (and spoke enough English) to make us feel welcome. Plus, they were very responsive to our emails (responding within the hour), which we appreciated.", "title": "Not too bad. But may not stay there if i m using JR pass", "helpfulness": 1, "user": "eneres1205", "date": "April 27, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 105813675}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My only complaints about this hotel are the lack of an English-written sign outside identifying the hotel...the only large sign is written in Japanese and a lack of space. The room, while functional, clean, and modern, is VERY small. Not enough room to comfortably maneuver between the bed and the desk, if someone is sitting in the chair, and barely enough floor space to handle three large pieces of luggage.", "title": "Nice Place To Stay For A Short Trip To Tokyo...", "helpfulness": 2, "user": "daverrco", "date": "April 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128145710}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "As I had written, the room itself is very clean, modern, and functional. The bed may be a bit hard for Western standards, it's about as comfortable as a futon mattress on the floor. The bathroom is small, but modern and clean. The toilets have the nice modern features, heated seat, and bidet option. The shower had incredible water pressure...which was really nice. The countertop in the bathroom was large enough to put toiletries on.", "title": "Bargain hotel. So long as you're not after the ritz.", "user": "Chris B", "date": "April 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127070940}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "The hotel, located in the Shinjuku District of Tokyo, is safe. The front desk asks that you leave your room key at the desk before venturing out. A word of warning to late-night partiers...the front desk is closed between 2:00AM and 6:00AM...so if you're out late, be sure to get back before they close, otherwise you may not be able to get back into your room, or the hotel, for that matter. There are two buildings that are owned by the hotel, right across a small alley from each other. The restaurant is in one of the buildings, the front desk is located in the other. The room numbering system is a bit atypical. We were in room 1402...you'd think that the room would be on the 14th floor, but no. The hotel is 10 stories tall, and our room was on the 4th floor. I think because we were in the \"annex\" building, they assigned a \"1\" designation as part of the room number.", "title": "very cheap and best ratio quality price", "helpfulness": 1, "user": "mauro c", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126618274}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The staff is friendly, but speaks very little English. They were helpful with providing directions to the Shinjuku Bus Terminal, located near the Shinjuku Train Station, a 15 minute walk from the hotel. If you have a lot of luggage, a taxi will take you to the station for about 700 yen.", "title": "A delightful Hotel", "helpfulness": 6, "user": "Maria295", "date": "March 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 125828375}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Breakfast, lunch, and dinner is offered in the hotel's cafe. Prices are reasonable. Breakfast for two ran about 2000 yen. It was buffet style, but they do offer an ala carte menu for breakfast as well. The food was a cut above average. Nothing spectacular, but good. Bacon, sausage, eggs, toast, and a variety of Japanese dishes were offered on the buffet line. We did not eat lunch or dinner at the hotel, as our stay in Tokyo was brief.", "title": "Good for family traveler", "helpfulness": 1, "user": "drsivak", "date": "March 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125649519}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We stayed at the hotel in last January 2012. Room's fine. It's small but quite ok for us. Mini market (Lawson) is just 2 minutes walk from the hotel. JR station is about 10 minutes away. Receptionists were very helpful. They can only speak a bit English but they gave us many simple directions to many interesting places. Unfortunately, they don't have wifi connection in rooms. It's not a big deal because there are two free online computers in the lobby that we can used.", "title": "It's a nice hotel!", "helpfulness": 3, "user": "Leo W", "date": "February 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124761549}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Clean, nice and simple room and I enjoyed the area too. Reception was very helpful when needed but too bad they closed the frontdoor at 2am. At that time of our visit it was too warm in the room but because I was able to open the window freely it helped a little. Free access to internet in the lobby was very nice too for those how doesn't own a laptop.", "title": "Very nice overall", "helpfulness": 3, "user": "denni497", "date": "December 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 121847419}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Stayed here from 6-11th Dec. Overall, we (me, husband and 14yr son) are satisfied with the hotel. We booked a triple room with 3single beds. Read the reviews and do not expect a huge room with much space, but this is certainly adequate for basic travel needs. The 2am curfew does not impose much of inconvenience as we were back by 9pm most of the time.", "title": "Good, Clean and convenient Hotel", "helpfulness": 2, "user": "JuneLow", "date": "December 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 121694836}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Plus - Clean, polite staffs, 1min walk to convenient store(Lawson and Family Mart), 5min walk to subway station.", "title": "Average Hotel in Shinjuku", "helpfulness": 2, "user": "Kenny F", "date": "September 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118467234}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Minus - Long walk to Shinjuku Station (about 10-15min), can be quite tiring after a long day visit outside.", "title": "You get what you pay for", "helpfulness": 1, "user": "Kayw1_10", "date": "September 17, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 118226560}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "stars": 3, "variance": {"poor": 6, "average": 55, "very good": 86, "terrible": 1, "excellent": 19}, "aka": "Sunlite Hotel Shinjuku", "slim_ranking": 0.455882352941}