{"user_rating": 4.5, "review_count": 151, "name": "Hotel Real Intercontinental Tegucigalpa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "My husband and I came to Honduras for work and we had to stay in this hotel for a month while waiting for our permanent place to be ready. My only complaint would be is I speak a couple of languages, but Spanish is not one of them, so not always I had luck getting from the staff what I needed and ordering food at the restaurant was challenging sometimes. The reception people do speak English, apart from them, you will have 50/50 luck getting what you need if you don't speak Spanish. Other than that, I do agree that this is very nice hotel, yes I would stay here again, and yes I would recommend it.", "title": "Yes, I liked it", "user": "nova68", "date": "June 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 16658607}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "Great hotel in the centre of town. The rooms are reasonably sized and really clean and comfortable. Bathrooms in the room are quite small but really very clean and nice. The restaurant in the hotel is great and they have a nice small pool. The staff are all super helpful and friendly too. All in all a great place to stay for a few days.", "title": "Great business hotel", "user": "NewcastleRoy", "date": "January 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12520667, "likes": {"liked": "— The location", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I stayed here for four nights while doing with work with the Honduran Govt. For those of you who don't know Teguz, it is a rough city in which to navigate, work, and exist. The roads are bad, short, twisty, and hilly and traffic is a nightmare. That said, the city has a few \"nice areas\", but nothing that is really pedestrian friendly, so this hotel is a great oasis for people working in Teguz.", "title": "Excellent hotel", "helpfulness": 3, "user": "DJ", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11650615, "likes": {"liked": "— Staff and rooms", "disliked": "— Charges for internet were a bit high."}}, {"rating": 5.0, "title": "Loved the InterContinental", "text": "First, location. The hotel is strategically placed in front of a large mall, for better or worse, close to a food court with a mix of fast food from the US and Honduras. It quite easy to buy phone cards for cellphones, groceries at the store (coffee and water), clothing if you need it, gifts, etc. For those who want US food, TGIFridays and Tony Roma are across the street. Behind Roma's is Las Cebollinas, a mexican restaurant on par with Chilis, good, but not great.", "helpfulness": 4, "user": "Bunnyrabbit115", "date": "December 17, 2007", "id": 11629733}, {"rating": 5.0, "title": "Excellence Throughout!!! If in Tegucigalpa, STAY HERE!!!", "text": "Second, the hotel. The staff is outstanding, friendly, willing to help, no attitude, and overall very competent and gracious.The lobby is a beautiful, peaceful mix of Central America meets Moorish architecture. The lobby bar is nice and the music on Friday nights is great. The pool area is relaxing, but the pool is quite warm, so it's not really \"refreshing\" after a day in a hot truck driving around the city.", "helpfulness": 12, "user": "stags_leap1997", "date": "February 22, 2007", "id": 6830951}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "This hotel offered it all. The Internet connection was good, the staff was attentive, a nice swimming pool, the bar has to be one of the best in Tegucigalpa, a good gym and the hotel is well located. Having a mall across the street was a bonus since I could pop over there to eat if I was in a hurry.", "title": "Terrific place to stay", "user": "CaracasCorrespondent", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39401350}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The hotel is pretty good. The service was very kind and the restaurants are good -which in Honduras is essential. You do not want to go and eat outside normally. The sensation of having 3 security people with guns at the entrance of the hotel seems shocking at first, but after a while you get accostumed to them. The rooms are very nice and the pool is great (if it does not rain).", "title": "I was there just before the political issue", "user": "elmasgrande", "date": "July 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34433534}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I stayed at the Intercontinental Real San Pedro Sula in Feb. 2009 and was very pleasantly surprised. The staff were courteous, the hotel was beautiful, the breakfast quite extensive (although food at the hotel seem expensive in general), the rooms spacious and tasteful, and the pool was lovely to lounge by.", "title": "Great atmosphere. Great pool.", "user": "Kiwibeandip", "date": "April 13, 2009", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "service": 4.0}, "id": 27938322}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Over all, i enjoyed my stay there. And from what i could tell, (although i really didn't explore) you had might as well stay in a nice hotel while in San Pedro Sula because there's nothing else there.", "title": "A Quiet Place in a Chaotic City", "helpfulness": 1, "user": "misterbradley", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21685964, "likes": {"liked": "— Quiet Room with Comfortable Beds", "disliked": "— Bathroom was small"}}, {"rating": 5.0, "title": "Outstanding. Simply outstanding!", "text": "The shower was hot and strong. I don't remember the bed being particularly uncomfortable. The wireless internet was reliable. All in all, a very nice hotel.", "user": "wiger1", "date": "June 8, 2008", "id": 16783541}], "location": {"country": "Honduras", "region": "Francisco Morazan Department", "continent": "Central America", "city": "Tegucigalpa"}, "stars": 4, "variance": {"poor": 4, "average": 12, "very good": 57, "terrible": 5, "excellent": 73}, "aka": "Intercontinental Hotel Real Tegucigalpa", "slim_ranking": 0.16, "description": "Real InterContinental Tegucigalpa is right where you want to be, located in the up-and-coming financial district, across from Honduras best shopping complex offering more than 150 stores right across our lobby. Whether you’re travelling on business or your trip is purely for pleasure you can experience the best ambience of Tegucigalpa such as a chill out night at Nau Lounge offering a unique sushi bar lounge concept next to the pool. Enjoy the perfect steak and a variety of wines carefully selected by our sommelier at Factory Steak and Lobster. All our 157 rooms are designed to make your stay memorable; the fastest internet connection for your entertainment, sound proof windows for your comfort and a positive and vibrant atmosphere will surely make your stay with us one to remember…"}