{"user_rating": 4.0, "review_count": 327, "name": "Hotel Bristol", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Just returned from our 15 day trip round central and Eastern Europe beginning proceedings at the Hotel Bristol. I have to say that our stay at the Bristol could not have been better and started our holiday off in style.", "title": "Fabulous Hotel in a fabulous city", "helpfulness": 4, "user": "jimbojetset", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 131321720}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We arrived early evening and were greeted by the friendly and smiling receptionist who quickly checked us in and showed us to our room. The room itself was perfectly sized, clean, modern and with a swish and spacious bathroom. The only downside as we quickly found out, was that the AC was not working! - we called reception and while we were out on they attempted to fix it. On our return from a fairly inebriated evening the receptionist explained that it could not be fixed however they speediy offered us a change to the room next door which of course did have functioning AC - a quick and satisfactory solution!!", "title": "Excellent", "helpfulness": 3, "user": "BritTravellingAround", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129934210}, {"rating": 4.0, "title": "Would recommend", "text": "The breakfast in the morning was in the main varied, plentiful and tasty with a variety of cold meats, cheeses, breads and some hot items. The usual cold drinks and coffees were also on offer.", "helpfulness": 1, "user": "Lyn L", "date": "April 30, 2012", "id": 129085891}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The most impressive feature of the hotel were its staff, all of whom were upbeat, pleasant and always willing to offer advice or assistance. The staff here are a credit to the hotel and the management should be very proud of who they have working for them. In fact we found people in Budapest to be very friendly and warm with nothing ever too much trouble.", "title": "Nothing to complain during our stay.", "helpfulness": 1, "user": "Tomas Tumppi L", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 127982290}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The hotel is located slightly out of the centre but thank to Budapests excellent transport network you can be in the heart of the action in 10 minutes. We specifically chose this hotel for it's location near to Keleti station as we were moving on by train from here to Bratislava. Keleti is an easy 10 minute walk even when laden with heavy luggage.", "title": "Enjoyable Stay, friendly staff", "user": "SamMurrayMidlands", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 126733290}, {"rating": 1.0, "title": "No room for us..", "text": "The excuse for us was that the bus of the group that was staying in their hotel broke down and the group had to stay extra days. They paid for our taxi to the hotel soho that was about 7 min by foot. I still wonder which hotel was better Bristol or Soho?", "helpfulness": 3, "user": "Morid", "date": "October 31, 2011", "id": 119971187}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We arrived to the Bristol hotel late in the evening just to find out that they could not provide us with the room we had booked and already prepaid through Ebookers. The receptionist said, that the hotel had a large group staying with them and that one group member had had an accident and could not leave the hotel. However, I believe that they had overbooked and trying to lie about it since the very same thing had happened to another guest some weeks earlier (based on a review in TripAdvisor). I would have appreciated the truth.", "title": "Overbooked - no room available", "helpfulness": 5, "user": "LiisaMimosa", "date": "October 27, 2011", "detail_rating": {"location": 3.0, "service": 1.0}, "id": 119781447}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The hotel offered us two beers and a taxi to another hotel in the outskirts of the city. Nevertheless, I will never return to this hotel nor do I recommend it to anyone.", "title": "Quite good hotel, sketchy inconvenient neighborhood", "helpfulness": 1, "user": "joeblitzflick", "date": "October 11, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 119185112}, {"rating": 3.0, "title": "can't review - no room at the \"Inn\" - so average for everything as I don't want to grade what we didn't get", "text": "This hotel is very close to the train station, so don't bother trying to hire a cab to get there from the station (they refuse). The physical facilities are outstanding: contemporary design, comfortable, nice bathrooms. Service was usually OK, but there were some rather gruff front desk staff who seemed to have time-warped here from the socialist era. Breakfast was excellent. The only reason I don't give top rating here is that the location is both inconvenient and a little dicey. I was occasionally uncomfortable walking to the hotel from the subway (skinheads). The prosperity of the local commercial enterprises is somewhat lacking (i.e., lots and lots of empty storefronts) and what does seem to be prospering is the sex trade (I was twice propositioned by women I can only presume to have been professionals within 1 block of the apartment). That said, I do recommend this hotel: good value, very nice rooms, just know what you're getting into.", "user": "A TripAdvisor user", "date": "October 2, 2011", "id": 118860558}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Arrived on time to find a very large group cheking in and to be told the room we had booked through e-bookers was not available! The resident had broken his leg and needed to stay there. The hotel had booked us into another hotel and got (and paid) for a taxi to get us there. Wonder how the man is?", "title": "Great location and comfortable stay", "user": "NewEnglandTraveler62", "date": "August 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116124693}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The hotel was lovely. The location was great - on the main street, just a short walk from the waterfront. It's surrounded by lots of shops, restaurants and cafes. The staff was very helpful, responding to every request politely and quickly. Breakfas in the hotel dining room was very good with an excellent choice of both local and \"American\" style foods. Our room was spotless, the bed very comfortable and the view out the windows lovely. I would definitely recommend this hotel if you're planning a stay in Opatija.", "title": "Great location, lovely room, helpful staff", "user": "crosswycke", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150362139}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This is a lovely hotel, first and foremost the staff were very polite and helpful with all our needs, the rooms are very luxurious, modern and clean. They have a good selection of hot and cold food for breakfast, we stayed twice in four days on our trip through Croatia and really did feel relaxed there both times. The first room was perfect, there is only one thing that bothered me slightly in our second room, two single mattresses were put together with separate single covers to try and make it a double bed, which is a pet hate of mine, other than that we loved it there and would highly recommend it!!", "title": "Quality!", "user": "Explorer305", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148645059}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Hotel Bristol is very nice Hotel, located in the center of Opatija. Service is perfect. Rooms are good and clean. Breakfast is varied. Recommend walk around in the Opatija and enjoy in the beuty of that place", "title": "Nice hotel in the heart of the most beutiful city in Adriatic Coast", "user": "iAdriano", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146096425}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Our room was on the side, up towards the stadium. You could hear the fans, but after 10 it was quiet. The cafe was quite nice, being able to sit outside on the main street. There are places to the left and right for food and shopping. The main market is a block away.", "title": "A bit out of date, good location!", "user": "andrini", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144767216}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "In June this year we stayed at the Hotel Bristol for the second time. We returned as the first visit was great. This stay for four days was equally as good. The staff are friendly and helpful, The hotel is clean and quiet and very central to the town. Parking was provided, and the cafe was really nice for lunch where the food is excellent. Would we stay again, yes we would!", "title": "A class Act", "user": "R M", "date": "November 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144349298}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed at the Hotel Bristol in Opatija, Croatia as part of a Grand Circle tour. It is right on the main street, a 2 minute walk from the seaside promenade. It has a marvelous spa with sauna and jacuzzi (be warned, it is au naturale!). The massage was marvelous and my wife got a great foot massage. Breakfast buffet was superb. Free wifi in the rooms but the computers in the lobby had a slight charge.", "title": "great location", "helpfulness": 3, "user": "CoachLo", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134827689}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Just came back from two days in Bristol and again, it was great.", "title": "My third visit", "helpfulness": 1, "user": "Givencys", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134046122}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Opatija is one of my favorite places in Istra and Bristol is simply great hotel.", "title": "Close to everything", "user": "Miriam D", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133909069}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "From the comfortable and stylish room, perfect spa, best Croatian food and good service.", "title": "Not again,...", "helpfulness": 1, "user": "WatchFox", "date": "July 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 133221774}, {"rating": 4.0, "title": "Beautiful Hotel in a great location.", "text": "Try and U will see.", "helpfulness": 1, "user": "Bob1600", "date": "June 20, 2012", "id": 132395422}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This is a very elegant hotel which is easy to find on the main busy street in the center of Opatija. If arriving by car, there is no designated area for stopping in front of the hotel, so one is obligated to temporarily park in a yellow lined area. The hotel will provide a temporary parking card to put on the dashboard of your car, to avoid ticketing while going through the checkin process. Our room had an excellent ocean view and a balcony. The room was not large, but very adequate. The room was nicely decorated with pleasant dual earthtone colors on the walls, and plenty of crown molding throughout the room, adding an elegant touch. The bathroom was completely marble and glitzy clean, with great lighting, an exhaust fan, a wall phone, magnifying mirror and a good grade and assortment of toiletries. The bathtub/shower had great water pressure and hot water was instant. The room has airconditioning, which worked excellently. Power to the room is controlled by inserting your room key into a slot near the room door. There was plenty of closet space, desk area, and lamps for good lighting. Power outlets are also generously positioned throughout the room, and on both sides of the bed. We had a large comfortable double bed (not two beds joined together). The TV was the older tube type but worked fine, with numerous English channels. The balcony has a double glass door which helps to buffer the outside noise. Internet was included in our rate, and the front desk provided us with a 24hr ticket, renewable with a new one upon expiration. The internet connection speed was amazingly excellent and stable! Breakfast was included in our rate, and it was outstanding, exceeding our expectations! There were multiple selections of eggs in various fashions - simple scrambled, scrambled with plenty of veggies and ham, hard boiled, or made to order. Bacon, sausages, hams, cheeses, cereals, etc. Freshly cut fruit salad was also excellent, surrounded by a broad selection of breakfast desserts. The dining area is one floor above ground level, and it is large with tables nicely spaced to avoid a cramped feeling. Windows surround the dining area on 3 sides, and provide a nice view and great natural lighting.", "title": "Elegant Hotel, Good Location", "helpfulness": 4, "user": "Bavarianride", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131028843}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "With the hotel being located in the center of Opatija, its an easy walk to virtually any part of Opatija from this location. There is a park in front of the hotel, so it is a very short walk down to the seaside promenade. There are terrific restaurants, pharmacy, bakeries, coffee shops, and stores close to the Bristol. We ate at a small Italian restuarant called Roko, which was only about a block or so from the hotel, and the food was extremely good, and reasonably priced. Hotel parking is only on the street, very limited spaces, and costs 10euros per day. This was the only drawback during our stay. My car would not fit into the last remaining parallel parking space because another customer had double parked. The front desk made an earnest but unsuccessful attempt to contact the owner. We arrived on a very busy weekend, so free parking around the hotel was impossible. The front desk ultimately recommended that we park at the Grand Hotel parking garage, which was two blocks east of the Bristol. We parked there for one night (90kunas), and the next day moved our car to a free space on the hill next to our hotel. The front of the hotel facing the main street has a generously large indoor and outdoor sitting area with a coffee shop, which is great for people watching, relaxing and enjoying internet. The entire staff at the hotel was always friendly and helpful. We would not hesitate to return to this hotel.", "title": "Architectural Is Eye Candy", "helpfulness": 2, "user": "Darbymo", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130784116}, {"rating": 5.0, "title": "Great!", "text": "Hotel Bristol is conveniently located in Opatija, Croatia's main street. The grocery and chocolate stores are within blocks, e park is across the street, and the main tourist street is right out the door. Foodhotel ambience, and rooms were just perfect. We stayed here while on a Smartours trip named Jewels of the Adriatic. Htis would have to be one of them!nAmenities include free Wifi, robes, attractive public rooms, and friendly staff.", "helpfulness": 1, "user": "Monamacduff", "date": "May 24, 2012", "id": 130522983}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed at Hotel Bristol while on a Gate 1 tour of Croatia and Slovenia. It is located right near the main drag of Opatija and minutes to the water. It is a beautifully restored hotel which we learned was used to house refugees during the Yugoslav war. The breakfast was good and there was a free-wi in the lobby as well as singing entertainment in the bar area in the evening.", "title": "Not the best choice.", "helpfulness": 1, "user": "belka58", "date": "May 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 130427427}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Our room was a fair size and the bathroom was fine. It was very clean as well.", "title": "BEAUTIFUL & COMFY HOTEL", "helpfulness": 2, "user": "gabaldonshari", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129512327}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed 2 nights in this hotel in October of this year. It is centrally situated with the access to all city attractions, since the city is fairly small. Well appointed, nicely sized rooms, some of them with the views of the Adriatic. Free Wi-Fi is a nice touch. The hotel is spotless and well taken care off by the personnel, which seems to be invisible, yet very effective. There is a great coffee shop/bar in the lobby, serving limited assortment of sandwiches and desserts, along with coffees, teas and alcoholic beverages. We didn't go to the hotel restaurant, but it is there for your pleasure. There are a lot of other nice places to eat. I can't avoid to tell a few words about the Opatija itself. What a pleasant little town it is. Clean and attractive, with nice architecture. October is way past high season and there are not too many tourists, which we didn't complain about. I would urge you to visit it if only for a couple of days. And Bristol hotel would be a nice place to stay while visiting.", "title": "Very nice hotel in the beautiful city", "helpfulness": 2, "user": "hollandpa", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143703897}, {"rating": 4.0, "title": "Lovely old hotel", "text": "We just spent 4 nights in this lovely hotel. The location is great. It is on the main street and the seaside is close. The staff is friendly and helpful. The rooms are spacious and very nicely decorated. The bathrooms are large and modern. The breakfast is very good.We enjoyed our stay here in this wonderful city.", "user": "Lynhart", "date": "October 17, 2012", "id": 143072074}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had two nights at this hotel during our Croatia and Slovenia tour. It is right on the main street but there is a blind on the window that can be closed if the traffic bothers. We managed to keep the blind open and weren't too concerned about the traffic even though the town seems to stay alive until around 10.00 pm. The room was comfortable and we found most of the staff friendly but we got sent off one morning when we tried to go to breakfast earlier than their published time.", "title": "Well located", "helpfulness": 1, "user": "Ozitravel", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 142680238}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We found the location very convenient to do a bit of shopping and to walk down to the promenade path. Room was comfortable and the breakfast was quite good. We'd be happy to stay here again.", "title": "great hotel!", "helpfulness": 2, "user": "Colette R", "date": "September 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140329683}, {"rating": 4.0, "title": "Perfectly fine hotel with great location", "text": "beautiful hotel, spacious rooms, friendly staff, excellent buffet breakfast (with caviar!), great central location. Has lots of extra little touches eg. washing line over bath you can pull out which is handy. Try out the cakes in the cafe section!", "helpfulness": 2, "user": "The_YTT", "date": "August 17, 2012", "id": 137418839}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "Excellent hotel, close to metro and train station. Extensive breakfast buffet. Free car park very near. Lots of markets and bars nearby. The only downside is the surrounding area which is shady.", "title": "Great modern affordable hotel", "helpfulness": 2, "user": "DjDmitry", "date": "March 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 125559564}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I sincerely recommend this hotel.", "title": "Very enjoyable stay!", "helpfulness": 2, "user": "epukiro", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125324415}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We travelled as a couple and stayed here for 6 nights in February. The hotel is located two blocks from Keleti station (which is why we chose it, as we arrived in the early evening and didn't feel like a long trek through an unfamiliar city). Although the surrounding area is slightly scruffy and visually nothing to write home about we felt perfectly safe at all times.", "title": "i recommended", "helpfulness": 1, "user": "dimitra P", "date": "January 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123123235}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The staff all spoke good English and were really friendly and helpful.They gave good advice about visiting the hot-spring baths and other sights. Our departing flight was in the early evening but when we checked out in the morning we could leave our baggage in a securely locked luggage room. The airport taxi we booked arrived dead on time and when we left, the manager on duty even came out to wave goodbye - a nice touch.", "title": "Overbooking", "helpfulness": 3, "user": "Lupma", "date": "January 3, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 122468306}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "Our room was on the first floor and faced the courtyard, which meant that it was absolutely quiet. Although not large it was comfortable and had all the amenities you would expect, including a (overpriced) mini-bar. The extra pillows we asked for arrived promptly, and on the two occasions when the sound packed up on one of the English-language TV channels (the service provider's fault, not the hotel's) the problem was quickly fixed.", "title": "good hotel / Value", "user": "kingluie", "date": "December 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 122192166}, {"rating": 5.0, "title": "Bristol Hotel Will No Disappoint You", "text": "Although the room is small, the cleanliness is exceptional. The location is perfect, both for the points of interest in Caen, and eating establishments for all tastes and budgets. What stands out most is Bristol's propriorter and staff, equal to or better than any 4 star concierge. Did I mention the 60 Euro value?", "helpfulness": 3, "user": "Nancy_and_Dennis", "date": "May 9, 2007", "id": 7568926}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "I chose this hotel based on its vicinity to various points of interest. I wanted to be able to walk around. That I did. The train station is really close by. I came here by train from Slovakia. The train station outside was under construction. I walked down to the hotel with one rolling bag. The reception was extremely friendly and spoke English. They offered me a room of my choice. The room was clean, spacious, and comfortable beds. It offered toiletries in the bathroom. No tub but a great shower. The view was into a pretty woman's apartment, way too close to comfort. From here I was able to walk to both ends of the city. There are several grocery stores nearby. Some all night stores for snacks and sodas. It is easy to catch an underground train to any part of the city. Walk either direction and there is an underground train station. The nightlife is excellent here, the people were so warm and friendly despite my diverse ethnicity. The breakfast was excellent. Pork and cheese is plentiful in Europe. When I asked for an alternate meat at the hotel the manager in the restaurant always brought me chicken from the kitchen. As soon as I walked in he would automatically bring me some chicken cold cuts. I have beautiful memories of this hotel and Budapest. The reception will help you with the maps and help you get anywhere on a budget.", "title": "Some Details of a Great Budget Hotel", "helpfulness": 2, "user": "LotusPrins", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115124625}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The Bristol is a very clean and comfortable hotel, slightly off the main attractions of Budapest, but this is not that important as possibly the best public transport system in the world is only a few steps away.", "title": "Perfectly Satisfactory", "user": "JimmyTheBairn", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114909287}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Everything is new and sparkling and the staff are very friendly and helpful. Breakfasts are good with plenty of choice although the hot selection could definitely be hotter and the juices could be less artificial. Breads are fresh though and the coffee is good.", "title": "\"nice hotel \"", "helpfulness": 1, "user": "Gravydavey_10", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113903661}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Rooms are reasonable sized and I found the beds very comfortable. Air-con a bit sluggish in cooling the room after hot days out. Not much choice of channels on the TV and BBC World had a poor picture quality. Self-tuning seemed to be impossible. Mini-bar as usual ridiculously over-priced, but good for cooling your own drinks.", "title": "New hotel, needs a bit more breaking in.", "helpfulness": 1, "user": "meg1978", "date": "March 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 100849737}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "All in all I think we got a good deal at £50 for two B&B per night. Loads of better hotels in Budapest in better locations, but not at that price, I'd imagine.", "title": "Brilliant hotel!", "helpfulness": 1, "user": "Nuttyslack_10", "date": "February 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 4.0}, "id": 95777871}], "location": {"country": "Hungary", "region": "Central Hungary", "continent": "Europe", "city": "Budapest"}, "stars": 4, "variance": {"poor": 3, "average": 31, "very good": 159, "terrible": 6, "excellent": 128}, "aka": "Bristol Hotel Budapest", "slim_ranking": 0.182634730539}