{"user_rating": 4.5, "review_count": 160, "name": "Hotel Pod Roza", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This hotel worked perfectly for my family (wife and 3 kids aged 15, 13 and 11) plus parents in law. Very good location 2 minutes from main square, comfortable rooms which were not fussy but spacious. Our room was quite noisy as we were close to Florianska St. Really nice breakfast, very helpful staff, all in all highly recommended.", "title": "Charming hotel in central location", "helpfulness": 1, "user": "Donk-Argyle", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 156519405}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "First time in Krakow. Beautiful city. Excellent hotel, ideally located within 5 minutes walk of main square. Good restaurants and bars close by. Stayed in a standard double room which was well presented and spotlessly clean. Weather was very cold but hotel was comfortable with underfloor heating in the bathroom. Room was cleaned and towels were changed everyday. Staff were extremely friendly and helpful. Bar area within main restaurant was small with limited seating available at the bar counter. Breakfast was excellent with plenty of choice and alternatives available on request. Will definitely be returning to Krakow again and will choose to stay in this hotel again. Would highly recommend to other travellers to Krakow.", "title": "Hotel Pod Roza Krakow", "helpfulness": 1, "user": "Paula M", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156273733}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We have just returned from a 3 night stay at Pod Roza. We had a lovely room with beautiful bathroom with lots of hot water and underfloor heating with clean towels everyday. The room was well furnished with lovely bedding and lighting.", "title": "Great hotel", "helpfulness": 1, "user": "betterholmes", "date": "March 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155594341}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Breakfast was great they do a brilliant soft boiled egg and a good cold buffet. The coffee with breakfast is excellent. We ate in both the restaurants in the evening and they were very good.", "title": "Great location - friendly staff", "user": "GillAberdeen", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155246575}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "All the staff were very helpful and friendly. The reception staff organised a driver to take us to Auschwitz-Birkenau, we asked at 9.30am if it was possible and the driver turned up half an hour later, the trip was well worth it and our driver Micheal was excellent in sorting everything for us and very informative.", "title": "Should be A Five Star", "helpfulness": 1, "user": "Lida O", "date": "March 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 153990072}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Unfortunately stayed only one night on business to attend gala dinner at the hotel that evening and several meetings the following day. The hotel is a wonderful hotel, full of character just 1 minute walk from the main square and on one of the main pedestrian areas... Service and food was good (for Poland) and my room was spacious, decor simple, elegant and good quality. Only negative is that my room was on an upper floor overlooking the street... And Krakow is a university town that never sleeps which meant that the students and tourists were singing until the early hours of the morning... So get a room at the back or away from the street!", "title": "Charming hotel, wonderful location!", "helpfulness": 2, "user": "Curvy_Traveller", "date": "January 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148747320}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Just returned from this hotel and must say it was very nice. On arrival the reception staff were very helpful and polite and we checked in very quickly with no hassle, our room, 313, was really nice and clean with a king size bed and a large bathroom with underfloor heating and air conditioning in the main room. The sheets and towels were changed every day and there was slippers and bath gowns provided, it also had a well stocked mini bar, tv, hairdryer, safe and large wardrobes.", "title": "Great hotel", "helpfulness": 1, "user": "stigg33", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147237711}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The hotel is just off the main square and is very central to quite a lot of bars and restaurants along with many of the main attractions, and will arrange any trips you might like to do but they are a little more expensive than along the road.", "title": "Fabulous Hotel", "helpfulness": 1, "user": "Drew0812", "date": "December 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147135183}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Great location being located very close to the main square with its wonderful cafes and restaurants. Overall our stay represented excellent value for money. I have absolutely no hesitation in recommending this hotel.", "title": "Ideal location, huge room, stately elegance. Iffy wifi", "helpfulness": 1, "user": "2011Italy", "date": "December 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 146945009}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Family of four, we easily shared one huge room with two marble and modern bathrooms. You just don't find woodwork like this in hotels (or anywhere) anymore. Tromp l'oeil painting on the wall. We had issues with the wifi due to the location of our room within the hotel (at the end of a long hallway far from the reception desk) and ended up having to sit in the reception to keep a connection. Also the staff was not very knowledgeable about basic amenities in Krakow, which was surprising (e.g.: where can we get a cup of coffee early in the morning?). FYI -- there is a Starbucks in the train station that is open early -- we were catching a 7 am-ish train. You cannot beat the amazing location on the pedestrian-only center, just half a block from the main square of Krakow. About 10 minutes' walk to the train station.", "title": "Excellent location", "helpfulness": 3, "user": "mrsmills55", "date": "November 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145341963}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We stayed here at the beginning of October 2012 for 3 nights. The reception staff were very friendly and helped us to book at trip to Auschwitz. Our room on the 3rd floor overlooked the rooftops of the neighbouring buildings and towards the main square and we were lucky enough to be able to watch the piper in the church tower from our room windows. The room was clean and tidy, and the bathroom spotless. Our room had a king size bed along with a large seating area. Complimentary toiletries were plentiful and our room was cleaned daily. Breakfast was a little disappointing and better can probably be found outside of the hotel. The hotel is well located on one of the main shopping streets and approximately a 2 minute work from the main square. All in all I would recommend the Hotel Pod Roza.", "title": "Excellent location", "helpfulness": 2, "user": "Aimee047", "date": "October 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143478550}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My wife and I stayed in the Hotel Pod Roza for 5 nights; the hotel is a one minute walk from the main market square in Krakow. The wireless internet connection which was constantly on and off which was frustrating, we had a street facing room which ensured we were woken by the refuse cart doing its rounds each morning. Aside from these two points, the hotel was clean, attractive and had a great spa bath and separate shower, it was generally a nice place to stay with friendly staff. The breakfast was quite basic, so as we had not prepaid for breakfast and we were so centrally located we went outside of the hotel for breakfast. We did however prefer the sister hotel around the corner Hotel Stary mentioned in an earlier review.", "title": "Great central location and a reasonably good hotel", "helpfulness": 2, "user": "FoodieGastroGourmet", "date": "October 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 142124964}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I just finished a trip to Poland last week and must say that the Hotel Pod Roza was a highlight of my trip. From the fantastic breakfast included in the price, to the huge rooms, this hotel has it all. Not to mention that is is located ion a historic building in the heart of old town. I highly recommend this to anyone thinking of visiting Krakow, you will not find a better location and hotel in the city.", "title": "Best Location in Krakow", "helpfulness": 3, "user": "Ted F", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141832145}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "After tiring travel a warm welcome from the Pod Roza staff set us up for a few relaxing days in this beautiful medieval city. Alas, drunken roisterers in the side street below our window in a luxurious room on the first floor kept us awake much of the first night; but upon asking for an alternative room, we were promptly offered another, much quieter and higher up, similarly well-appointed (the bathrooms are all marble and modernity) room. The hotel restaurant is quiet, the food excellent, service outstanding. Front desk help and advice for excursions invaluable.", "title": "Luxury under the rose", "helpfulness": 2, "user": "Biblioswiss", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141337130}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "When we arrived after a tiring trip by night train we were hoping to get a room even though it was way before check-in time. It turned out that our junior suite was not yet available but luckily they could put us in an alternative suite.", "title": "Top hotel in centre of the city", "helpfulness": 1, "user": "eh_64", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 141276540}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed in this hotel for 3 nights in December . Our first time in Krakow . Lovely hotel with very friendly and helpful reception staff . Martin was lovely and gave us a lot of information, Room was great with a lovely bathroom just a shame we overlooked the glass roof and reception area, and disappointed they had no iron available but that was quickly sorted by Martin and our clothes were collected by maid and ironed free of charge. Breakfast was nice but we didn't have any meals there as it did look a bit quiet. Position of hotel was just perfect right off the main square. Would definitely recommend this hotel for first timers in Krakow .", "title": "Lovely Little Break in Krakow", "helpfulness": 1, "user": "AndyandPaulG", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151301659}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "What an experience fine rooms, a beautiful, bar/restaurant and such lovely old touches that have been finally restored and add to the grand-nice of this hotel!", "title": "The fine old grand hotel of Krakow", "user": "BeanyExplorer", "date": "February 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151191425}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The auditorium is fantastic and fine place to eat breakfast.", "title": "An absolute treasure", "helpfulness": 1, "user": "RoxyHot10", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150405143}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My only criticisms are pillows!! Not good invest in some quality pillows and tea making facilities, it would have been nice to have some complimentary facilities for making tea or coffee in your room! These are minor faults and I will be back! Plus location is perfect!", "title": "4* hotel", "helpfulness": 1, "user": "Masood S", "date": "January 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150261654}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I booked our trip to Krakow as a treat for my husband's birthday, and had spent some time looking at hotels before I decided on Hotel Pod Roza.", "title": "Perfect Stay!", "user": "Trudyaline", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150008206}], "location": {"country": "Poland", "region": "Southern Poland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 5, "average": 12, "very good": 59, "terrible": 2, "excellent": 82}, "aka": "Pod Roza Hotel", "slim_ranking": 0.148305084746}