{"user_rating": 4.0, "review_count": 31, "name": "Hotel Le Blizzard", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "This was our third stay but the first since the refurbishment. The bar remains THE great feature but spa and rooms a close second. Great atmosphere, lots of comfy sofas. Prices are high but this is cal disere so not surprising.", "title": "For us the best hotel in val disere", "helpfulness": 1, "user": "wipeout75", "date": "January 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 123452184}, {"rating": 2.0, "title": "Poor service", "text": "Room was great. Huge comfy bed, lovely view of the mountain.", "helpfulness": 4, "user": "bonvivant22", "date": "January 4, 2012", "id": 122515395}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Spa is lovely with lots if relaxing areas. My wife loved her massage. Outdoor pool and hot tub fun additions in the snow. Huge indoor hot tub and swanky if sparsely equipped new gym. I'm guessing it's not well used anyway.", "title": "Only had drinks in the bar....", "helpfulness": 2, "user": "davidsw11", "date": "December 24, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0}, "id": 122064332}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Tips... Dine at la lodge. Superb value", "title": "Lovely", "helpfulness": 5, "user": "skier198021", "date": "March 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 101045845}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Family & friends, we didn't stay at the hotel but had dinner in the restaurant.", "title": "Especially wonderful", "helpfulness": 1, "user": "Mebb", "date": "February 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 95421774}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We have just arrived home from 11 days at Le Blizzard - it was recommended by friends who had stayed their previously (prior to renovation) and also another friend who had stayed elsewhere, but popped his head in for a look and WISHED he was staying there!!!", "title": "Gemutlich in Val d'Isere", "helpfulness": 3, "user": "katstrov", "date": "January 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94897761}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Very well positioned - it is not ski in/out, but not too far to walk to lifts - streets very icy and dangerous, but that is an issue of the village. Although it is on the main street, our room was street side and it was not noisy at all. The hotel is beautifully appointed, looking just the way a ski chalet should look. The bedrooms were lovely. We were on the top floor, so had very high loft like ceilings, but I don't know what the rooms below us would be like. Our two adjoining rooms and a living area inbetween - all three rooms had large plazma tvs, so no fighting over tvs (not that we had much time for tv). 1 bedroom to share for the family which was a bit of a pain when everyone is trying to get out quickly to ski, but 2 separate toilets (1 in each bedroom) which helped. The bathroom was however very spacious, with a basin and bench at either side, so we weren't on top of each other. Just another shower would have been handy. The mini bar was on the house. My only annoyance was that water was not provided by the bedside table every day - there was water in the fridge (1 bottle per day) but they did not take into account that we were 4 in the room, not 2. The breakfasts were lovely - a really good selection of fresh fruit in the mornings, such as raspberries, blackberries, strawbs, mountain berries along with more mundane fruits. The bar at Le Blizzard is a popular meeting spot for locals as well as guests, so it always had a really good buzz and lounge area was large, with lovely groupings of sofa's so all guests could easily be accommodated. The staff (particularly a young man by the name of Alex) were very helpful and welcoming. We did not choose half board and we are glad for that. We ate in the restaurant on our first night and the food was fairly average for the price - there were so many good restaurants nearby, that it was good to have variety. A separate restaurant downstairs which belongs to the hotel had much better food and a better atmosphere. Also - the outdoor pool and spa were a great hit with the kids!! Anyway, all in all, we had a great time in Val d'Isere and would definitely stay at Le Blizzard again.", "title": "Fabulous and wouldn’t hesitate to recommend and return!", "helpfulness": 1, "user": "RetailEyes", "date": "January 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94684314}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "We didn’t know what to expect having previously being disappointed in the standard of hotels in Val disere . We regularly stay in 5 star hotels across the globe and have to congratulate the Blizzard in finding an exceptional balance of delivering an extremely high class s of service whilst maintaining the family friendly welcoming feel We had the best time ever….our only regret is that it is fully booked for when we want to return! It’s so stylish and comfortable and all the staff are wonderful . The bar is a great scene as well! I am very critical as I work in a company that measures customer service and we travelled all the way from LA so had high expectations! If you get the opportunity then don’t hesitate book it now!! Normally I complain!", "title": "Hopefully a uniquely bad experience in the restaurant but wouldn't risk it again", "helpfulness": 1, "user": "Ilovetravel16", "date": "January 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 1.0}, "id": 94407640}, {"rating": 1.0, "stay_parameters": "Stayed February 2010", "text": "Although I've not stayed at Le Blizzard, we visit Val D'Isere regularly and often go for dinner. IN the past we've had great experiences but our most recent visit in Jan'11 was so bad I wouldn't risk going again as you can have such a nice experience elsewhere in the resort. The main issue was how rude the staff were when we said we were unhappy - every restaurant can have a bad day and an apology and bottle of wine would have fixed it (there were 12 of us) but instead the middle aged lady running the restaurant couldn't care less. We felt redeemed when one of our group went to talk to the hotel manager the next day and received a free round of cocktails in the bar for all of us - more than we expected and a nice gesture.", "title": "A wizard should destroy Hotel Blizzard", "helpfulness": 2, "user": "Biltong40", "date": "January 8, 2011", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 92157731}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "variance": {"poor": 3, "average": 4, "very good": 8, "terrible": 2, "excellent": 14}, "aka": "Hotel Le Blizzard France/Savoie", "slim_ranking": 0.439024390244}