{"user_rating": 3.5, "review_count": 1862, "name": "Hotel St. James", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "An ideal location that is clean, economical and convenient with a courteous staff. Had a double room on the fourth floor with no elevator problems. Easy walk down the beautiful marble back hallway steps if adverse to a short wait. Treasure of a deli next door! Not luxurious, but did not visit the city for hotel amenities. Perfect for tourists who sleep, shower and experience the city. Hub of location for most desired visitor locations. Will definitely return.", "title": "A bargain ideal location", "helpfulness": 3, "user": "FKW", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 12299498}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "As others have said was not to sure what to expect, but was happy with the stay over all. When we arrived we asked for a room on a low floor after reading the reviews on this site about the lifts being very slow. We got room 208 which is on the second floor directly facing the lifts and stairs so that was fine. With it being on a low floor there was noise of people going up and down the stairs but not overly noisy. Anyways when we went into the room first it was cold so went down to reception to ask them to switch on the radiator as it was behind a panel under window which needed to be screwed off in order to switch it on. They obliged and done it, went to bed that night and woke up the next morning and it was still not working, room was freezing. Said it to them at reception and they said no problem later on when you return from you day out we will move you to another room. One other thing about that room, is that in the bathroom there is a pipe which runs down the wall which is not enclosed so when others where having showers on upper floors you could hear the noise of water rushing down the pipe a bit annoying to say the least. So we were moved to the 8th floor, pretty much the same floor but with out the the noises, radiator worked fine. One other thing about this hotel is that none of the windows lock. Well seemed that way both of the rooms i stayed in you could not lock the windows and in the other room a friend of mine stayed in he could not lock his either. Overall i would have to recommend thou. Worth the money, right in the middle of everything, you could not ask for more.........", "title": "Nice hotel, worth the money better than expected!!!", "helpfulness": 3, "user": "brophylad", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11883382, "likes": {"liked": "— Location", "disliked": "— Unable to lock windows"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Can't complain about this hotel - we paid around £100 per night for a comfortable double room, a stones throw from all the lights and action of Times Square.", "title": "Great Little Place!", "helpfulness": 5, "user": "Pinky_Charl", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11719501, "likes": {"liked": "— Location", "disliked": "— Nothing :)"}}, {"rating": 5.0, "title": "hot spot in new york city", "text": "The rooms were clean and tidy, staff pleasant. A lot of people have said that it could do with a lick of paint but I think it adds to the history of the place - the building is around 100 years old.", "user": "suco", "date": "December 19, 2007", "id": 11681936}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The Cranberry Deli next door but one is excellent, internet access, open all the time, good food - I highly recommend the chicken fajita wrap :-)", "title": "great location", "helpfulness": 2, "user": "russ295", "date": "December 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 11599489, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 3.0, "title": "No Frills But Perfectly Fine", "text": "After searching for hotels on expedia.com I came here to check reviews, and each place had something negative to say - except for this one. Ok, this is no frills to the max, plastic cups in the bathroom, you can pretty much guarantee the elevator will be out - but all we were doing was sleeping there, and getting ready in the morning and it was perfect for our needs. Good sized clean room, nice sized bathroom, plenty of hot water & towels, helpful friendly staff. And the kicker - perfect location to the theater & Times Square and many attractions are no more than a brisk walk. One caveat - request a room away from the street when you book, the street noises can be brutal at 5 a.m. if you're staying there on trash day! I'd much rather spend my money on the theater (oh, see Curtains, it's so wonderful!) or a memorable dinner than a place where I'll be spending most of my time with eyes closed! This place fit the bill nicely.", "helpfulness": 2, "user": "PaulaRuth", "date": "January 31, 2008", "id": 13159711}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Never again will I pay so little for a hotel in NYC. There is a reason this hotel is so cheep. The front desk was unorganized, and the keys are not electronic keys. You only get one key for a dubble ocupancy room and must check the key in and out every time you leave. Out of two elevators only one worked and the one that did work, didn't work well. You would have to walk to the second floor to get the elevator because it did not come to the lobby if called from the lobby. I was on the 9th floor and had to walk up twice because the elevator never came. The rooms were large, probibly the only good thing I can say. However, the beds were worn out, and we could feel the springs comeing through. When I took a shower the water was either too hot or too cold, there was no warm water, just hot and cold. Also, the towels had brown stains on them and hairs that were not ours since the towels hadn't even been used yet. The location was great, but I would never stay at this hotel again. A park bench would be preferable to this hotel.", "title": "Never again", "user": "Elacqudj", "date": "January 29, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 13097204, "likes": {"liked": "— Location", "disliked": "— Hard beds, one key for dubble room, stains on the towels, cleaning lady that just walked in without knocking"}}, {"rating": 4.0, "title": "Great Location", "text": "Budget Hotel , Excellent location , rooms are fine , clean, large bed , full bathroom , TV, and lots of hanging space . But the Location really sets this place it is just 2min walk to times sq etc really good deli next door to hotel for breakfast coffees etc", "helpfulness": 1, "user": "gjp200", "date": "January 28, 2008", "id": 13060075}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The location of this hotel could not have been better. We stayed one night as a stop over. When we arrived, we were greeted by the largest dumpster full of trash right in front of the hotel. This was not a hotel issue, but rather a city thing. The lobby was inviting and the people working at the front desk were friendly. They didn't go out of the way, but they were not rude. One of the two elevators did not work, and the other had problems making it to the first floor lobby. After lugging my bags up 10 stories, I was informed that if you catch the working elevator from the 2nd floor, it works better. The room was nothing fancy, but was clean. I had trouble keeping the temperature regulated, but I think that was more user error than anything else. The bathroom was clean and there was plenty of hot water. As for the location, we were less than a block from Times Square. There were two pubs next to the hotel that were pretty good as well. I would recommend this hotel for singles and/or budget travelers that are looking for a great location and a no frills hotel.", "title": "Great Location for Okay hotel", "helpfulness": 2, "user": "roastandtoast", "date": "January 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 12968291, "likes": {"liked": "— Location", "disliked": "— Elevator Not Working"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed here during the busiest week of the Christmas season. While it is certainly a budget hotel -- and pretends to be nothing but -- the room was clean, the bed comfortable, the bathroom was roomy, with plenty of hot water. The location could not be better. The staff were all very accommodating and extremely pleasant.", "title": "Tremendous Value", "helpfulness": 1, "user": "dancemanva", "date": "January 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "cleanliness": 3.0, "value": 5.0, "rooms": 2.0, "location": 5.0}, "id": 12960478, "likes": {"liked": "— The tremendous value", "disliked": "— Very few amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled with friends", "text": "This was the perfect hotel for us when we went to New York. Cheap Cheap Cheap. With flight, hotel, and insurance the package was only $550.00 for 4 days aprox. and get this the hotel was 1/2 a block from the center of time square durring peak season. We could stay out all night in Time Square with out worring about gtting back to the hotel because we were never out of walking / stumbling distance. The hotel its self wasn't fancy or elaborate but it was clean, had airconditioning and a good size room in a great location. I would book this hotel again if i went back.", "title": "Budget Bargin", "helpfulness": 2, "user": "RMP78", "date": "January 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 12940168, "likes": {"liked": "— Location", "disliked": "— Window View (ally)"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We stayed at this hotel the day of New Years for 5 nights. I would rate this hotel a 2-3 star hotel. It has the best location and price for NYC. Hotels in this area are well over $250+. The rooms were nice, nothing too fancy and the bathrooms were well stocked with towels and they were clean. This hotel is not a resort, but for the price and location, you can't beat it. I have stayed in many different hotels in Times Square and I saved lots of money by staying here at St. James. The service from the front desk was hit or miss, but their map of the city was a life saver. The only complaint was the free wifi internet. Out of the five days I was there, the internet was down for two days. One tip, try to avoid rooms that face the street. These are rooms ending in -03,-04.(ie 203,204,303,304) The noise coming from the street was very loud but the interior rooms are shielded from it.", "title": "I love this place", "helpfulness": 7, "user": "mikko77", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12591203, "likes": {"liked": "— Price and location", "disliked": "— Internet and noise from the street"}}, {"rating": 5.0, "title": "Fantastic Hotel, Loved It!!!!", "text": "This is the perfect hotel to stay in to truly experience what New York city has to offer. Its a fantastic location, I was so surprised how close we were to times square. The hotel itself is pretty basic but its extremely clean. The hotel was great value for location alone and the staff were very helpful at all times. I cant recommend this hotel enough. Looking forward to going back!!!!", "helpfulness": 2, "user": "Gizzy05", "date": "January 11, 2008", "id": 12521855}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "This was my 3rd time staying at the hotel. The ladies at the front desk remembered me from when I was there back in August. Very clean room. Big for a NYC room. Bathroom spotless. Excellent price for the location that you are in which is about a block from Times Square. I like the fact that you have to give your room key to the front desk when you leave the property. That way I didn't have to worry about losing it when I was out and about sightseeing. Will definately be back in the summer when I go on vacation.", "title": "Best Deal in NYC", "helpfulness": 2, "user": "DefyGravity", "date": "January 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12436054, "likes": {"liked": "— Everything especially location", "disliked": "— Can't think of anything I didn't like"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "It has been a great place to stay in NY.", "title": "great value, totally worth it!", "user": "SapereAude", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12334142, "likes": {"liked": "— location and price", "disliked": "— the wireless didnt work all the time"}}, {"rating": 4.0, "title": "will return", "text": "stayed Dec 7th for 1 night for Christmas sightseeing and found the hotel to be just fine. were concerned about some of the reviews, but were totally ok with the hotel. elevator was not slow at all, we were on 8th floor, room was quiet, we had the king size room and it was actually quite roomy. shampoo only and basic bar of soap. but for the price and location, it was great. we only stayed in the room to sleep and the hotel accomodated us by holding our luggage the morning we arrived until check in at 3:00 which allowed us to be out and about. they also kept our luggage after we checked out till around 4:00 as well. would definitely return for another stay. this is no frills, but was fine for our needs.", "helpfulness": 2, "user": "NewJerseyFunfamily", "date": "December 10, 2007", "id": 11469588}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Just returned from a long weekend at the Hotel St. James, which turned out to be a great Big Apple Pick. After reading other reviews, I was a bit unsure what to expect, but I was entirely pleased with our experience. The location is great: a short walk to Times Square, Rockefeller Plaza, Macy's, theatres, etc.; two good deli/snack shops next door, and a Starbucks a short distance down the street. The lobby was much more spacious and inviting than what I'd expected after viewing the pics on the hotel web site, and there's a small sitting/library area adjacent. The staff are friendly and helpful, and we were able to check in at 11:00. Our room was enormous by New York City standards, and though there were no frills, it was spotlessly clean. And, importantly, the mattresses were excellent, with good pillows and very fresh linens. Sure, the walls could stand a new coat of paint, and the carpet was threadbare in spots, but with this sort of convenience, cleanliness, and economical rates, who would have the nerve to nitpick? When I scratch my head to come up with negatives, I guess I could mention that the soap dispenser in the lobby ladies room was never filled while we were there, but that's about #357 on my list of priorities. I highly recommend the St. James and will definitely stay there again.", "title": "Perfect Big Apple Pick!", "helpfulness": 4, "user": "Summer62", "date": "December 10, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 11469307, "likes": {"liked": "— convenience", "disliked": "— no negatives"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Excellent location. The deli next door was awesome. Big rooms for NY standards. Rooms looked aged and clean. No bedbugs although as we were leaving the hotel we did spy one small visitor (cockroach). Manager did say they would be getting the exterminator.", "title": "Will stay here again", "helpfulness": 2, "user": "misnowbunny", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 11312078, "likes": {"liked": "— The cost", "disliked": "— bug"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "we had a reservation for 2 rooms - 3 adults - and one infant. the hotel promised a crib and they did not have one..........they had to go out and buy one. the towels were large enough to dry your face. messages were NEVER given. very shappy, delapidated - they need to invest a lot of money to improve the place.", "title": "excellent location - low class hotel", "helpfulness": 1, "user": "depressed_7", "date": "December 7, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 11293348, "likes": {"liked": "— location", "disliked": "— delapidated"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Considering this hotel is rated 2* any traveller who stays here will be pleasantly suprised. 2 min walk from all the action of times sq and although the hotel has no restaurant there are plenty within a short walk from the hotel. Rooms clean and tidy, v spacious and beds are comfy!", "title": "Excellent Location", "user": "RowEdw", "date": "December 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11281246}], "location": {"country": "United States", "city": "New York City"}, "stars": 2.5, "variance": {"poor": 134, "average": 414, "very good": 889, "terrible": 127, "excellent": 298}, "aka": "St James Hotel New York", "slim_ranking": 0.632054176072, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 5.0}}