{"user_rating": 4.5, "review_count": 270, "name": "Hotel Le St-James", "reviews": [{"rating": 5.0, "title": "Simply the Best!!!", "text": "I have stayed in numerous properties in montreal and by far the best is the Hotel Le St. James! The staff is extremely warm an receptive. They will do or get anything you need with a touch of a button. I forgot my camera in my car, and with out hesitation they went and got it and brought it up to my room. WHat service. The room was very spacious and elegant. The beding is frette and is one of the best sleeps I have had in years. There are no complaints about this hotel, you will not be disappointed.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "September 18, 2005", "id": 3913047}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "My husband and I spent 4 nights at Le Saint James during our first trip to Montreal. I picked the hotel based on other TripAdvisor reviews and was not disappointed in the least. On the contrary, the hotel exceeded many of our expectations and we are both hotel snobs to the extreme. We will typically choose a Four Seasons if we can and our standards for service are set by those experiences.", "title": "Amazing hotel in a beautiful city", "helpfulness": 18, "user": "hopkinz", "date": "September 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3881497}, {"rating": 5.0, "title": "Sublime experience at the St. James", "text": "We booked through the Leading Hotels of the World site and received a \"Stay 4 nights Pay for 3\" deal. The hotel doesn't discount at all when you book directly. Even so, we were pleasantly surprised to find that we'd been upgraded to a Junior Suite from a King Room when we called to request an early check-in due to a flight change. They were very gracious and even treated us to coffee in the beautiful restaurant while our room was prepared.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "September 4, 2005", "id": 3841320}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "The room was extremely quiet (no view, but the hotel is downtown and surrounded by other buildings) and comfortable. The decor varies from room to room and we had a more modern decor, which suited us just fine. Our bed was super comfortable and the turndown each evening was wonderful, with bottled water, slippers, robes, chocolates and the next day's weather forecast set by the bedside. One of our favorite things was not having any interruptions when we were in our room from housekeeping, yet our room was always done to perfection when we returned from a day of sightseeing and the turndown was complete when we returned from dinner.", "title": "Beware of Expedia booked rooms", "helpfulness": 34, "user": "MarciaB10", "date": "September 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3841287}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "The concierge and front desk staff were professional and very well informed. We went to use the small gym every day and only saw one other person working out during our 4 day stay. The hotel is just around the corner from Toque, which was the dining highlight of our trip. Treat yourself and stay at the St. James in Montreal! We can't wait to go back.", "title": "Perfect end to our honeymoon", "helpfulness": 8, "user": "M28", "date": "August 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3809437}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I stayed at the St. james on August 2-5, 2006.", "title": "An EXCEPTIONAL hotel!!!", "helpfulness": 5, "user": "fredisenb", "date": "August 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5592784, "likes": {"liked": "— Decor, historical value, personal service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Upon arriving at the gorgeous facade of this hotel we were immediately greeted by a warm and professional doorman who quickly retrieved the luggage out of the cab. The doorman complete with shiny brass buttoned coat and white gloves escorted us through the lobby to the front desk. An equally sophisticated front desk staff awaited us there. The check in was quick and we were on our way, but not before being presented with the most beautiful hotel key I have ever seen! A heavy brass key chain with a luxurous red tassel. The luggage was taken up to the room by yet another professional staff member. Upon entering the room we found soft music playing, the perfectly made bed with crisp Frette sheets and the beautiful overhead halogen lighting glowing made the room look absolutely divine. IOur room a junior suite had a bedrrom area with an adjacent sitting area with a desk and chair. The bathroom, a large marble one had a separate shower and deep tub with dual sinks. Everything in tis hotel is of the utmost quality! The towels are thick and gorgeous. The sheets are Frette and the quality of the decorations and furnishings was over-the-top. Upon returning to the lobby area where we found the hotel's restaurant, the XO. The XO is exquisite! A breathtaking dinning room with very high cielings and chandliers. A mezzanine level sits over the restaurant where one can either sit or have coffe, drink etc. The first day, we had breakfast and the service was exceptional as well. The breakfast was beautifully and artfully presented. The portions were small but adequate. It is slightly expensive but a real nice treat of refinement to start your day off right! In the evening, the library adjacent to the entrance is an absolutely divine place to have an after dinner drink as you let your eyes be dazzled by this beautiful room. The hotel houses a rare collection of books and many newspapers are available every day, along with current magazines. It is just a treat to sit down here in the evening or on a rainy day a great place to read a book and cocoon yourself away! The hotel is also very centrally located in the heart of the old section. Its a 5 minute walk or less from all the sights. Notre Dame a gorgeous Basilica is just a couple of blocks away. When in Montreal DO NOT miss the dramatic light show which is presented nighly at 6:30 and 8:00. It is beautiful, dramatic and educational. It will present the history of the church and of Montreal and it is a MUST do! While we were there we did not have a bad meal. I would highly recommend the Pierre du Calvert Restaurant, housed in a 300 year old mansion. Food, Service and decor was outstanding! Gibby's a steak house housed in the Youville Stables is excellent as well. Another hit was Bonaparte which is open for both lunch and dinner. By the way, the Concierge at the hotel named \"Phillipe\" is wonderful (I wanted to take him home with us!) Very knowledgeable, refined and service oriented. He seemed to know what we needed without asking and always gave great recomendations. Along with Phillippe the entire staff was outstanding and we cannot rave about this property more. It was a wonderful 3 days in heaven. I would go back tomorrow! Do yourselves a favor and stay at the St. James when visiting Montreal. A tip: The website lists rack rates which are quite high and Expedia never seems to have them available. I called the hotel directly and spoke to the genral manager which gave us a very reasonable (for this 5 star plus hotel) price of $350.00 (canadian) per night. They upgraded us to a junior suite which although not huge was spaciuos and very comfortable. A great stay at a great hotel!! Congratulations to the owners and staff for \"getting it right\" on this one!!", "title": "well appointed", "helpfulness": 5, "user": "rkr727", "date": "July 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 5462378}, {"rating": 5.0, "title": "Just amazing", "text": "After a glitch with the room, and a conversation with the hotel manager, the situation was set right. The hotel is beautiful, with great art and excellent food. It could easily be stuffy but the staff is helpful and gracious. Exercise room is small but adequate. Junior suites are spacious, and if booking through expedia, are a good value.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 23, 2006", "id": 4997990}, {"rating": 5.0, "title": "Amazing Location! 5 stars plus!", "text": "The nicest hotel in Montréal in the heart of the city, between old montreal and the finacial district. Remind's you of the great hotels in Paris, the streets the ambiance etc The rooms are just gorgeous and I found a gem a littel jewelery store in The International Trade Centre", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 16, 2006", "id": 4627188}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "called ALEXANDRE & FILS if your looking for a deal the got it!!! and the have just gorgeous stuff a must see. The hotel is also 5 minutes from the palais des congres where you have all kind of shows. A 15 minutes walk from the Bell Centre if you like hockey 10 minutes from st laurent street(go east) if you like to dine well and party and 10 minutes from the famous cresent street if you just want to party till dawn.", "title": "elegant and regal", "helpfulness": 8, "user": "DCYOUNG", "date": "November 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4146181}, {"rating": 5.0, "title": "By far the best in Montreal", "text": "Having stayed in over 20 hotels in Montreal, the St James is by far the best hotel, comfortable beds, excellent service and relaxing atmosphere. A definate must - see for travellers to MTL.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 4, 2005", "id": 3735979}, {"rating": 5.0, "title": "#1 reason to visit Montreal", "text": "Having never been to Montreal I was most impressed with the St James. It is the #1 reason I would return to the city. The staff never presented themselves without warmth and a smile. I might have to say it was the best experience I have had in a hotel. The feeling was a cross between a Grand Hotel and B&B with the best of both. Location was key in the old section of Montreal. The rates are very resonable considering what is available to a guest. The room at any other Hotel in New York or Paris would start at $700, our rate was considerbly less. Walking distance from any type of restaurant (formal - casual). My wife and I looked at the Negilan and the Ritz Carlton when we were there. The Ritz Carlton appeared to be tired, The Negilan had a heavy smoking ordor. If it were not for the St. James I probably would not return to Montreal. My only complaint is that there are not any other locations.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "July 28, 2005", "id": 3715641}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Westport, Ct.", "title": "A Gem in Old Montreal", "helpfulness": 10, "user": "CraigJ", "date": "May 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3481834}, {"rating": 5.0, "title": "only one problem", "text": "We stayed at the Le St-James May 13-16 - our second stay (first was in 02, the yr it opened)...everything about this hotel is first class - it's really a small Four Seasons for 2/3's the price......staff was extremely helpful and professional - we had a deluxe junior suite which was spacious a very well decorated - housekeeping was thorough (including turndown)....ate dinner in the Grand Salon, food was very good....don't have a bad thing to say......suprised they only have 4 diamonds, when the St-James clearly deserves 5 diamonds. We will definetly go back.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 19, 2005", "id": 3211082}, {"rating": 5.0, "title": "Best hotel experience ever", "text": "We stayed at this hotel Christmas 2004, arrived quite late, very welcoming on arrival greeted us at the taxi. Service impecable, rooms and general decor outstanding, concierge very helpful. Meals and room service great, resuarant staff great. We just thought it a bit strange that we enjoyed a half bottle of wine one night from the mini bar in the room, enjoyed it so much that we ordered full bottle (room service) that same night, when we examined the bill we had been charged $27 for the half bottle in the room fridge as published and around $72 for the full bottle, We thought this very odd.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "September 19, 2004", "id": 2585577}, {"rating": 5.0, "title": "Great Service", "text": "My husband and I stayed at this hotel for the long weekend in January. We requested that the concierge recommend a few restaurants for us for dinner while we would be there. Alain e-mailed us a good amount of choices, with comments about each, and booked our final choices. All his recommendations were wonderful.", "user": "NYCtravel", "date": "January 31, 2007", "id": 6719425}, {"rating": 4.0, "title": "Wonderful!", "text": "While at the hotel, our stay overall was great. Housekeeping kept our room extremely clean, the concierge helped in every way he could, and honestly all of the staff was extremely helpful, and warm.", "user": "Cissy", "date": "November 20, 2006", "id": 6155895}, {"rating": 5.0, "title": "Best hotel we've stayed at in years", "text": "I would recommend this to anyone whishing to stay in Montreal.", "user": "misssnootysnoots", "date": "October 18, 2006", "id": 5969726}, {"rating": 1.0, "title": "Service lacks a lot", "text": "I just returned from a long weekend in Montreal at the St. James. This hotel is quite beautiful and located in the old section of Montreal. Quite convenient to the airport - about a 20 minute ride with no traffic. Upon arriving at the hotel when you enter the hotel you get the feel of yesteryear as this was once a bank - very grand. I must admit that they do pay attention here to the little things regarding their guests. When I arrived from the airport via cab the doorman proceeded to remove my bag from the trunk of the cab - in doing so he made note from my luggage tag of my name and was quick to address me by my name - a little thing - but it definitely shows you something about this hotel. When I was brought to the reception desk for my check-in it was handled efficiently - though I had to wait a few minutes to make sure that my room was ready (which was odd to me as it was 5pm). My room which was a deluxe king was lovely - large and tastefully decorated. My only qualm was that I was given a room that was right near the elevator (I had made my reservation through Leading Hotels of the World where I am a member - my profile and reservation state to be placed away from elevators - reception needs to pay attention to this - though I will be honest as it did not become a problem because it was extremely quiet and I never heard any noise in relation to the elevator). In detailing my room which was large, there was a large king bed with delicious linens (very European), a desk, a small sitting area with two chairs and a large closet. The bathroom again very large with soaking tub and spa shower stall (with the rain shower fixture) with wonderful products for use. My room was extremely clean - and one very odd thing is that there were no do not disturb signs for ones door - but that did not matter because housekeeping never interrupted you while you were in your room (this usually happens in most hotels at around 7pm as they will come around for turn down service) - but when you went out in the morning as well as in the evening for dinner - you came back to a room that had been attended to. The hotels dining room \"XO\" is breathtaking (I believe some refer to this as the Grand Salon). Very stately for all meals as well as a formal afternoon tea or for drinks (there is also the Library for drinks as well). Please note - if you plan on having breakfast a the hotel do not bother with their continental breakfast (which consists of juice, coffee, and pastries) as their breakfast menu is superb! From presentation to taste - I never had such a fantastic breakfast. I did not dine in the restaurant for dinner but can only imagine how wonderful it must be and next time will try it. The concierge staff is tops. Prior to my arrival I had phoned with some dinner reservation requests which were taken care of perfectly - even a reservation in the top restaurant in Montreal Toques'. The location of the hotel is really quite convenient and just a ten minute walk to the historic area which is filled with shops, galleries and restaurants with a very Eurpoean feel. In summarizing, the hotel is lovely, very European, perfectly situtated and well worth the expense.", "user": "fhartigan", "date": "September 17, 2006", "id": 5810661}, {"rating": 5.0, "title": "Incredible Attention to Detail", "text": "Amazing place. Amazing restaurant. Amazing service. Everything was perfect. Location is topnotch (Vieux Montreal). The buildout of this former Merchant Bank is at a level seldom reached by boutique hotels. The linens are beautiful - high threadcount sheets, down pillows, little Italian floormats and fresh slippers at your bedside at turndown. The staff is expert, confident, and friendly, to a person. The concierges sent us to Milos, the best restaurant we've visited in a long time.", "user": "MoeMan", "date": "August 17, 2006", "id": 5620012}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 5, "variance": {"poor": 4, "average": 13, "very good": 41, "terrible": 4, "excellent": 208}, "aka": "Hotel Le St James", "slim_ranking": 0.0352941176471, "description": "Member of The Leading Hotels of the WorldRenowned for its warm professional service, exceptional interiors and avant-garde elegance, this timeless grand hotel has become the benchmark of hospitality in Canada. This historic building, dating from 1870, is ideally situated in vibrant Old Montreal with easy access to shopping areas, restaurants, and the financial center. With impeccably detailed guest accommodations, each room and suite possesses its own character and personal charm. Le St-James was crowned the 2nd Luxury Hotel in Canada by TripAdvisor for 2012.Named the “most striking dining room in Canada” by the Travel Editor of The Toronto Star in February 2012, XO Le Restaurant offers its guests a modern and innovative cuisine created by celebrated chef Michele Mercuri. In the prestigious Hotel Le St-James, you will find the exclusive Le Spa where intimacy and privacy are respected. In the late 1800’s, Le Spa served as the Merchants Bank vault."}