{"user_rating": 3.5, "review_count": 373, "name": "Hotel Contilia", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "This is a really good place to stay in Rome. Very close to the Termini Station. Breakfast included and clean rooms.", "title": "Really good", "user": "vanessa_Rio", "date": "October 26, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 6014674}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "While the neighborhood is not the most attractive, we felt safe walking around at night to get back to the hotel. The Contilia has been recently renovated throughout, and the room was one of the largest and cleanest we had in Europe (especially at the budget end of the scale). Our room overlooked the courtyard, which was probably quieter than one of the ones that fronts on the street, so ask for one of those. Breakfast was one of the best we had in Europe. Highly recommended, especially with its proximity to the train station.", "title": "Great budget hotel in Rome", "helpfulness": 2, "user": "smithac", "date": "September 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 5798260}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "After pricing numerous hotels in Rome, we booked this hotel with some skepticism because of the negative reviews, and we were pleasantly surprised. Granted, this is not a first class luxury hotel, but it doesn't have first class luxury prices either. Overall, the hotel was clean and quiet. The breakfast was adequate, and the staff were helpful and friendly. The neighborhood isn't the greatest, but it's not scary. Being from New York City, we are used to walking, and we were able to walk to almost everything we wanted to see except the Vatican (which was an easy subway ride away). Yes, the towels are thin, and the temperature of the hot water kept changing in the shower requiring constant adjustments. However, these were minor issues for us. Would definitely recommend this hotel for anyone looking for clean, reasonably priced, basic accommodations.", "title": "Good Value", "helpfulness": 3, "user": "MaryIV", "date": "June 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5351947}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "This hotel was not great but not bad. Traveled together with another couple and had reserved 2 superior rooms. Upon check in we were given two rooms next to each other. The rooms were clean, hard beds, small shower stalls. They advertise jaccuzi showers in some of the suprior rooms which ours had. I am not a large person but I had problems maneuvering around in this shower", "title": "A nice hotel for the price", "helpfulness": 4, "user": "travelsoften", "date": "June 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5342237}, {"rating": 4.0, "title": "OK - Good location", "text": "Our friends' superior room was considerably larger than our superior room. After a discussion with Michael at the front desk they were able to move us the next day. The result was a much larger room with full bath. In short, all suprior rooms are not created equal. And thank you Micheal for your understanding and help.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 3, 2006", "id": 5294706}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "We booked this hotel with much trepidation due to some of the reviews we'd read,but were pleasantly surprised by what we found. The rooms were lovely and spotlessly clean,nicely furnished and a great value for the money. The street where it's located is quite noisey (but who has control over that anyway?),but we found ALL of Rome to be extremely busy and quite crowded. What happened this past week anyway???", "title": "Much better than reviewed!!", "helpfulness": 5, "user": "sierram", "date": "May 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 5185781}, {"rating": 3.0, "title": "Great Location", "text": "We spent 3 nights (5/11-5/13 and again 5/19-5/20) and never felt unsafe or frightened by anyone or anything we encountered. We had streetside rooms and found it quite interesting to have a view of 'real life' in Rome.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 22, 2006", "id": 4995980}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "The staff was quite nice and always helpful,which is always a plus in any hotel.", "title": "Nothing special", "helpfulness": 4, "user": "maineiac", "date": "February 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4520208}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "A convenient walk to the Termini was an added bonus for us as we needed to take the train to Sorrento (take the new high speed...wonderful!)", "title": "average", "helpfulness": 1, "user": "Maryalamb", "date": "February 22, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 4496257}, {"rating": 4.0, "title": "Cheap, clean, convenient", "text": "This was our second trip to Rome and would stay at this hotel again.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "December 1, 2005", "id": 4157715}, {"rating": 5.0, "title": "Good digs in downtown", "text": "We were very happy with this hotel. We paid a little extra for a \"superior\" room and, considering that this is a downtown hotel, we felt that it was a good value. Our accomodations were clean and very satisfactory. Thankfully, it has an elevator. Location was convenient to the rail station, good restaurants, shops and all the sights. The staff was freindly and helpful. We would definitely stay here if ever in Rome again.", "user": "MikemckIndiana_USA", "date": "October 2, 2007", "id": 10029809}, {"rating": 5.0, "title": "The location and price were perfect!", "text": "We stayed at the Hotel Contilia in Rome May 24th - 28th and had a fantastic experience due to its perfect location for everything a tourist could want.", "user": "PrinceRaider", "date": "September 22, 2007", "id": 8851872}, {"rating": 3.0, "title": "Okay but not great", "text": "Our British friends had tipped us about this hotel when they attended a Rugy match the preceding February and we were not disappointed. The halls and bathrooms were all marble, the front desk was effiecient and very helpful, and the main asset was that the main train terminal in Rome was a two block away walk - we caught the subway here and also, the open top get off and on buses to ride all over Rome. We even ate at a couple of sidewalk restaurants down the street, got a good bargain on leather goods at a store nearby, even did our washing at a laundromat across the street, and checked email at a really cheap Internet Cafe down the street....we even walked from here to the Colosseum one day! All this for a Superior room for 100 Euros per night! We definitely will stay here once again and would recommend it to anyone! Enjoy and you will not be sorry!", "user": "Artkeb", "date": "September 14, 2007", "id": 8712565}, {"rating": 2.0, "title": "Italian service....", "text": "This hotel has several things going for it: it is very conveniently located in terms of getting to both the central airport and the Campiani Airport, the room we stayed in was nicely decorated, it was clean, it had a fridge, and a new TV with several cable channels. However, the hotel suffered somewhat in comparison to others we stayed in during our visits to both Florence and Paris, despite the fact that it was considerably more expensive. We were not entirely sure where the extra money was spent: certainly not on lightbulbs, as our room was badly lit for much of our three nights there due to one that had not been replaced; and definitely not the all inclusive breakfast, which was stocked with supercheap food (e.g. fake orange juice, stale bread rolls, nutella-filled croissants). However, this is perhaps what 150 Euros a night gets you in Rome - something okay but not great.", "user": "alikus", "date": "June 26, 2007", "id": 7999401}, {"rating": 1.0, "title": "What a disappointment", "text": "The room was very good: clean, big for European hotels with nice bathroom and modern air-conditioning system. Though no iron/ironing board, no tea/coffee maker. The hotel is very centrally located.", "user": "GI47", "date": "June 14, 2007", "id": 7849178}, {"rating": 5.0, "title": "Loved the Contilia", "text": "This hotel was in the perfect location- literally 3 blocks from the train station, and easy to find. The area is a little seedy, especially at night, but there are always so many people around that I never felt unsafe. We stayed in a quad room, which was very big with a very nice bathroom. The hotel was clean and the staff were extremely friendly and helpful. I would definitely stay here again.", "user": "Liz789", "date": "April 23, 2007", "id": 7417899}, {"rating": 1.0, "title": "A Prison Cell Would Have Been Larger!", "text": "The moment I walked into my room, I knew this holiday was not going well. It was a single room, approx 3 x 2 metres - the smallest on the second floor! The bathroom was tiny - you had to use the toilet either sideways or sitting down as the sink prevents you from standing directly in front of it (when sitting on the toilet, your knees are under the sink)!", "user": "Hellfire500", "date": "April 1, 2007", "id": 7265953}, {"rating": 4.0, "title": "Great location!", "text": "The bed and pillows were extremely hard - I couldn't wait to get up in the morning! The weather was pretty warm, so I turned on the air conditioning, but the room didn't get any cooler (despite leaving it on for hours).", "user": "Debs50", "date": "February 25, 2007", "id": 6837572}, {"rating": 2.0, "title": "A little disappointed", "text": "The staff at the front desk were friendly, but for the first two nights I had no TV due to a very bad reception - I reported this on the first night, but it took them 2 days to respond!", "user": "bebe12", "date": "December 26, 2006", "id": 6500066}, {"rating": 5.0, "title": "Vanessa from Cheshire. Lovely hotel very clean", "text": "The hotel may be in a convenient location in terms of transport, but the area is very run-down. Every building is filthy, graffiti is everywhere and it doesn't feel very safe. I did not enjoy Rome - it is just a filthy city with nothing but small cafes & bars everywhere. The only pleasant region was Vatican City. Luckily I was heading to Berlin afterwards, where the hotel and city were 100 times better!", "user": "gherthy", "date": "December 17, 2006", "id": 6452012}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 46, "average": 80, "very good": 173, "terrible": 16, "excellent": 58}, "aka": "Contilia Hotel Rome", "slim_ranking": 0.411023622047}