{"user_rating": 3.5, "review_count": 80, "name": "Hotel Rincon de San Jose", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Very clean basic room. Free internet. Good breakfast. 24 hour coffee. great restaurant across the street. walking distance to most sites.", "title": "clean basic room", "helpfulness": 1, "user": "LaurieChris", "date": "June 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7975959, "likes": {"liked": "— clean"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Three star hotel. I would not give it more or less. Rooms are clean and the Dutch owner is very friendly. Staff at the reception speaks Spanish and English. Breakfast could be better. This includes, tea, coffee, fruits and slices of toasted bread and jam. Location is okay and the restaurant at the other side of the street (at the corner) is great.", "title": "Good deal", "helpfulness": 2, "user": "Wil1968", "date": "February 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6788959, "likes": {"liked": "— Staff at the reception.", "disliked": "— Breakfast which was quite simple."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Rooms basic but clean, good breakfast, very friendly staff, free internet, free safe. We stayed two nights here and we liked it!", "title": "Nice and good hotel", "helpfulness": 1, "user": "wolf_ffm", "date": "December 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6495575}, {"rating": 4.0, "title": "Great deal in downtown San Jose", "text": "I discovered the Hotel Rincon de San Jose through TripAdvisor and decided to make my reservation through their website based on the reviews and the price. My travel companion and I arrived in San Jose on a Friday night at about 9pm and had arranged for pickup through the hotel ($14). Sure enough, the driver was waiting for us in the mass confusion outside when we arrived, but some other guy who was standing with him outside the airport insisted on taking our two bags the five steps from the curb to the van, and then demanded a tip (we're both guys in our 20s, the bags were really not that cumbersome). We didn't know who he was, but we each gave a dollar and were on our way.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 30, 2006", "id": 5237164}, {"rating": 1.0, "title": "Beware!", "text": "We rode about 20 minutes into the city, and found the hotel staff friendly and helpful. The room was basic but very clean, and breakfast the next morning was great considering we paid $65 including taxes. Our room did not have air conditioning, but it really wasn't necessary anyway.", "helpfulness": 6, "user": "rgwright1", "date": "April 17, 2006", "id": 4982808}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Very friendly & helpful hotel in one of the nicer areas of central San Jose.", "title": "Very Helpful", "helpfulness": 2, "user": "TonyTourer", "date": "November 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4140989}, {"rating": 5.0, "stay_parameters": "Stayed November 2004", "text": "Rooms are clean and simple with polished wood floors.", "title": "Charming little hotel...", "helpfulness": 7, "user": "cdntravelgurl", "date": "July 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3664291}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Staff were exceedingly helpful.", "title": "Charming and friendly", "helpfulness": 13, "user": "njmac", "date": "July 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3639390}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Have stayed there a number of times - always good.", "title": "We loved this place", "helpfulness": 9, "user": "Acemom", "date": "June 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3531830}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "A delayed review of this hotel but since there aren't too many here goes. We stayed at this hotel in November. As the other reviewers said the genuine kindness of the hotel staff was above average. From letting us use their laundry dryer at no charge to letting us warm up leftovers in a microwave, all done with no hesitation. The hotel is very quaint, rooms clean and a good size. If you're looking for an inexpensive clean hotel, this one is a great choice. It's super close to downtown and as another review suggested, check out 'cafe du monde' across the road. Great service, excellent food. We LOVE Costa Rica and look forward to our next trip there in February 06.", "title": "Great Place", "helpfulness": 11, "user": "arisingphoenix", "date": "February 16, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3195390}, {"rating": 4.0, "title": "Quiet and Clean", "text": "We stayed there twice in December 2004. Both rooms were clean and well appointed for less than $40/night. The hotel is just south of the Parque Sabana and a short walk to several restaurants. I had no problems with the free internet computer and was able to check email and book hotels easily.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "February 4, 2005", "id": 3162228}, {"rating": 4.0, "title": "Good choice", "text": "Helpful front desk.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 20, 2004", "id": 2479017}], "location": {"country": "Costa Rica", "continent": "Central America"}, "variance": {"poor": 4, "average": 21, "very good": 35, "terrible": 8, "excellent": 12}, "aka": "Hotel Rincon De San Jose Costa Rica", "slim_ranking": 0.493975903614, "description": "We are a a beautiful three star hotel in the historical center of San Jose Costa Rica. Our characteristic hotel rooms are fully equipped with hot en cold water showers, television and telephone. You will find a warm and inviting accommodation located in three antique colonial mansions in the historical center of San Jose. With its quiet and friendly atmosphere is the perfect place to stay, whether you are traveling for vacations or business. Our restaurant El Jardin is a nice little restaurant in our courtyard garden with its international kitchen strives to serve lunches, dinners, drinks and cocktails for accessible prices. Great presentation, fresh products carefully combined for our dishes! Is the beste way to describe what we mean with a charming dining experience! Our menu offers a choice for every taste at any time, including vegetarian, vegan and gluten free options. Fish, meat, chicken, pastas, salads, sandwiches, wraps, risottos, fresh Costarican coffee , cake, cocktails, fresh mixed tropical juices, cocktails and small snacks or bocas. For meetings, private diners or exhibitions we also offer an executive lounge! All this just a few minutes walking away from the whole host of attractions like museums, The National Theater, shopping district. The most heard from our guest is that they find it surprising to find such a lovely hotel behind these facades. Our guests tend to relax and enjoy San Jose before taking off to explore the rest of Costa Rica to return for an other stay with us to bring their holiday to a nice closure."}