{"user_rating": 3.5, "review_count": 420, "name": "Hotel Sant Agusti", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The Sant Agusti is purported to be the oldest hotel in Barcelona. For all that it is of a good standard with the facilities of a hotel in the 21st century.", "title": "Good hotel, great location, vibrant city.", "user": "montyzuma", "date": "February 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13568096}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The staff were friendly from the receptionist through to the breakfast attendees. Rooms - basic but clean and comfortable. Yes there is a little noise - mostly from cleaning staff on a morning but nothing to cause major irritation. Our room had a small balcony overlooking the street. This was great for watching the comings and goings of this lively, vibrant city. Because the room was double glazed and with shutters none of the street noise affected sleep during the night.", "title": "Noisy and smelly", "helpfulness": 1, "user": "Victorine1", "date": "January 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 12575198, "likes": {"liked": "— Location", "disliked": "— Poor soundproofing, breakfast, bad smell in rooms"}}, {"rating": 1.0, "title": "got robbed in front of the hotel. Hotel locked their doors on us.", "text": "The square in which the hotel is located does have its fair share of \"down at heels\" so those of a \"sensitive\" need to be aware. However we never experienced any problems or none that one would not come across in any large city.", "helpfulness": 3, "user": "Barcelonaexperience", "date": "January 8, 2008", "id": 12440527}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Location, close to La Ramblas and the underground is excellent for exploring. Close by and within a short walk are plentiful shops, restuarants and bars.", "title": "Horrible Seedy Square", "helpfulness": 4, "user": "cosmotravel", "date": "January 7, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 12423898, "likes": {"liked": "— unsafe!"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "This was my first time in Barcelona. A fantastic city. Be warned - you will hardly scratch the surface in a 2-3 day visit. I would recommend a week minimum and would have no hesitation in staying at this hotel again.", "title": "Area surrounding hotel is unsavory - please read my review", "helpfulness": 4, "user": "usuktraveler", "date": "January 5, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 1.0, "rooms": 2.0}, "id": 12362282}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "i had read some of the previous reviews which mentioned the vagrants hanging around the hotel and imagined the worst but there were literally about a handful and they caused you no trouble whatsoever - at night the square had a bar/restaurant open up next door to the hotel so it was just filled with people having a good time (you won't notice it though - the double glazing in the hotel rooms must be made out of something very thick!) - and very handy if you fancy a night cap on the way in! the location was perfect - minutes from the main strip if you wanted it and not far from the cathedral area which had loads of lovely tapas bars. the rooms are clean and the front ones have a nice little balcony overlooking the square - the staff were pleasant and the breakfast pretty good - although i wouldnt recommend the croissants! all in all good value in a great spot", "title": "great location", "helpfulness": 2, "user": "a&ssussex", "date": "July 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8232432, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Husband and I stayed 3 nights end of November . Taxi to the door from airport a reasonable price. Thereafter, everything in walking distance but also close to good rail/bus links. Room and bathroom more than adequate and very clean. Excellent and plentiful breakfast. Hotel is in great location and the police do keep an eye on the needy who congregate at the church in the square. However, they keep themselves to themselves and didn't appear to bother tourists. No kettle in room but little cafe/bakers next door happily made great coffees for you to take away . Staff were friendly and helpful and it was good value for money.", "title": "City Break", "helpfulness": 2, "user": "TaysideTravelbug", "date": "July 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8068648, "likes": {"liked": "— Location, cleanliness and buffet breakfast.", "disliked": "— No kettle in room."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We stayed at the Sant Agusti Hotel for a 3 day trip to celebrate a 30th birthday with a great group of friends. The hotel was in an ideal location about half way down La Ramblas, very near the market too. The reception staff and cleaners were extremely friendly and very helpful and welcoming (breakfast staff not quite so). The rooms were small but really clean and done so every day. The breakfast was more than adequate with a good selection. I would recommend this hotel and would visit again. If you are looking for a fantastic meal out I would recommend Pla - beautiful food but worth booking ahead.", "title": "Great Location and Lovely Hotel", "helpfulness": 2, "user": "enicol", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8004218, "likes": {"liked": "— location", "disliked": "— Breakfast staff were a little bit grumpy."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "My friend and I booked two rooms for two nights in June. We had never visited Barcelona before and I found this hotel through a review in a travel guide which described the location as 'a quiet street off the Rambla'. In the day it did seem relatively quiet, but in the evening a bar next to the hotel put tables and chairs out on the pavement and this was fairly busy all evening till gone 1am. I had a room overlooking the square and although closing the balcony doors shut out a lot of general daytime noise, I still found the first night (a Saturday) very noisy. We retired early as we had had a very early start and were tired, but the hubbub from next door kept me awake - relief came about 1.30am but the respite was only momentary because some hidden nightclub across the road started playing *really* loud music then until gone 4am! Even with earplugs I could not sleep and complained at the desk that I had requested a quiet room, but was told that the hotel was full and person on duty had no knowledge of reservations. My friend was at the back of the hotel but she had trouble with noise from the drains and the kitchen. We were only there for two nights and presumed (rightly) that Sunday night would be quieter, so we put up with it. On the second day the bathroom door in my room locked itself so I couldn't get in (it was one of those locks in the handle) and upon reporting the fact to reception was given a straightened paper clip by the clerk, who then mimed unpicking the lock! We couldn't do it so the cleaner was sent up and she unpicked it expertly.", "title": "Basic but ok", "helpfulness": 4, "user": "lindylou492", "date": "June 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7940087}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My friend and I found breakast 'ok' - but we didn't want much after two restless nights - and we found the rooms clean and not uncomfortable, though small. I was on the 1st floor and my friend on the 2nd. We did not expect tea or coffee facilities but I took a travel kettle and adaptor which I managed to use by plugging into the solitary plug socket in the bathroom (although I was panicking at first because there didn't appear to be anywhere to plug anything in) - and my friend had to unplug her TV to use her hairdryer. They do provide a built-in one but it's rubbish.", "title": "Good location for sightseeing", "helpfulness": 1, "user": "per-occulus", "date": "June 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7802638, "likes": {"liked": "— location", "disliked": "— No kettle in room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Stayed at this hotel at the end of April 07.Booked as a package break for four days.Contacted the hotel direct later on and upgraded to one of the Attic rooms,glad we did as this was spacious with a rooftop view. In all we found the hotel very clean and tidy,We had breakfast there and found the food ok. Had read reports that the food was rubbish and the hotel too ! Its just a short walk the Las Ramblas,less than 100 mertres really. Other reports tell of the many vagrants in the Square, they are no problem ! Take the Areobus from the Airport to Placa de Catalunya then one Metro stop to Liceu. We walked for the bus on return, would say its about 300 metres ! The hotel is in an ideal position, you can walk to many places from here. We would not hesitate to stay here again.We also found the Tourist Buses very good and had a two day pass,its good value.", "title": "Enjoyed our stay in an ideal position", "user": "foxypair", "date": "October 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10328376, "likes": {"liked": "— Liked the Attic Room and the Hotel location", "disliked": "— none"}}, {"rating": 4.0, "title": "BRILLIANT LOCATION", "text": "This hotel is located just off La Ramblas in a fabulous location; close to the fantastic food market, loads of bars and restaurants, and shops. The lobby and rooms and fully refurbished and in excellent condition being clean with modern decor. But, and there is a but [!!!], they refurb is cheap and they have used laminate floors and I would assume absolutely no sound proofing so THE NOISE LEVEL IS LOUD!!! Fine if you are not coming in until the early hours, but if you want an early night [which we did not] forget it! The other problem is in the morning, you can hear the plumbing, every flush, shower and bath emptying, and lots of other activities etc of all those in rooms around you. However, the staff are lovely and breakfast room large, spacious and sunny.", "helpfulness": 3, "user": "SUEPOPPET", "date": "October 24, 2007", "id": 10284146}, {"rating": 4.0, "title": "Excellent location", "text": "We stayed in the hotel for 3 nights, it was very clean the staff were friendly. There are homeless people who vacate the square outside the hotel all the time but do not bother the hotel guests at all. I would have no hesitation in staying there again.", "helpfulness": 1, "user": "SmithyTyrone", "date": "October 3, 2007", "id": 10035406}, {"rating": 2.0, "stay_parameters": "Stayed May 2007", "text": "This hotel used to be a monastery. The lighting is activated by your body heat and lasts for approximately 30 seconds. This leaves you walking along a narrow dark corridor, dark beams in the ceiling. Many dark doors on either side of you reminiscent of the monastery cells. The room was quite clean and had french windows. Bathroom was nearly clean but not quite.", "title": "Not A Good Experience", "helpfulness": 5, "user": "Christiblue", "date": "August 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 8591745, "likes": {"liked": "— French windows in my room", "disliked": "— Almost clean bathroom and poor breakfast"}}, {"rating": 4.0, "title": "Great Location", "text": "Cold breakfast was ok - tea ok for one cup, coffee disgusting. Hot breakfast - scrambled egg that had seen better days. The hotel is approx 50 metres from the middle of the Ramblas - be careful when returning to it at night. There are homless and vagrants in the square outside the hotel from early morning. These guys keep themselves to themselves and don't bother you- I think the church in the square provides food for them. Hotel staff are very nice. We were overcharged for our stay - May bank holiday. Only reason I would go back to this hotel is if it was extremely cheap.", "helpfulness": 2, "user": "Mrss2", "date": "August 11, 2007", "id": 8395649}, {"rating": 5.0, "title": "excellent hotel", "text": "i have stayed at this hotel twice. i took my mum there in 2007 and my boyfriend in 2008. on both occassions the hotel was excellent. the location is fantastic!. the staff are helpful, and the rooms are roomy for a city hotel and the bathroom was roomy and the shower very good. breakfast was a buffet style and fine, the coffee was awful though!.", "user": "moodycow", "date": "April 24, 2008", "id": 15317707}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Location of the hotel is great - extremely easy to find after taking the bus from the airport to Placa de Catalunia. Good location to see the sites from. No hassle from the homeless people outside the hotel whatsoever. Staff pleasant and helpful. Room clean. Breakfast good.", "title": "Please get some soundproofing!", "user": "Schnapped", "date": "April 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 15129502, "likes": {"liked": "— Location", "disliked": "— No sound proofing"}}, {"rating": 5.0, "title": "A great experience!", "text": "The only downside we found was the complete lack of soundproofing in the room. It's a shame but we wouldn't stay here again because of that.", "user": "martygill", "date": "March 19, 2008", "id": 14391861}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "20th wedding anniversary, 5 nights, perfect! Clean room, quiet at night, good sleep, brilliantly adjustable air con. Free safe in room. Good range of help yourself breakfast. Friendly, helpful reception staff. Room to leave kit on last day. Aero-bus straight outside terminal to Placa de Catalunia, five minute walk to hotel down Las Ramlas taking in all the atmosphere! Plenty of people are towing a case at any given time, you don't stand out! Taking the bus means you see everything and overall the journey time is short (35-45 minutes) and cheap, 3 euro something each, each way. All but door to door!", "title": "Great and Cheap", "helpfulness": 1, "user": "Bennnn", "date": "March 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 14040293, "likes": {"liked": "— Bathroom.", "disliked": "— Bedding"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Rita Blue, the bar / restaurant next door vibrant, energetic yet welcoming with friendly staff.", "title": "Take our advice and go somewhere else!", "helpfulness": 1, "user": "wickhamhenwoman", "date": "March 2, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 13980168, "likes": {"liked": "— convenient for La Rambla", "disliked": "— everything else"}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 41, "average": 77, "very good": 229, "terrible": 11, "excellent": 62}, "aka": "Sant Agusti Hotel", "slim_ranking": 0.504798464491, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "The oldest hotel in Barcelona (1840), completely renovated is located in the historical building of the former Convent of Saint Augustine."}