{"user_rating": 3.0, "review_count": 44, "name": "Hotel Reves d'Ocres", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We would gladly return to this hotel, but that is based on realistic expectations for a two-star French hotel.", "title": "Solid choice, if you are realistic.", "helpfulness": 5, "user": "hcajones", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130061374}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel is right on a small main road, but there is virtually no traffic at night so there was never a noise problem. The room was spacious by two-star French standards, and the bathroom was basic but adequate. The room was clean and well-maintained (it's old, but so is France) and had some nice, simple decorating touches. The separate toilet room was a little musty. Our room had a small balcony, and we enjoyed some evening time there despite the main road because traffic was so light. There is a very nice country view across the road from the balcony.", "title": "Early wake-up, false alarm", "helpfulness": 3, "user": "Ed-Idaho-USA", "date": "October 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119534569}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "There is a public parking lot very near the hotel. The hotel gives you a card to put on your dashboard and the parking is then free. The hotel is also within very easy walking distance of Roussillon centre ville and of the ochre mine walking trail.", "title": "Disinterested and Mean", "helpfulness": 1, "user": "Gail N", "date": "October 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 119354009}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The breakfast room was really pleasant. None of the production line feel of many such rooms. But the very basic breakfast was a little overpriced.", "title": "Country style nice big rooms.", "helpfulness": 1, "user": "mccolm", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116773783}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our weather was cool enough that we never tried the air conditioning, about which others have complained.", "title": "Great hotel experience", "helpfulness": 1, "user": "cloudyskiies", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113503616}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "After a very noisy night we chose to leave one night earlier than we had booked.", "title": "Noisy room and extremely rude staff", "user": "Blackbird76", "date": "September 26, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 81088628}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "The receptionist told us we could leave without a problem and that he felt sorry for us. After writing a mediocre (but reasonable) review on the website we booked through, I was threatened by e-mail by the staff of the hotel and they told me they would charge the second night after all because of my review.", "title": "Not Bad but Don't Expect a Lot", "user": "ChristinaW", "date": "August 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 73775464}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I can still not believe it and by now I'm ready for a legal procedure. I'm willing to pay ten times the costs of the room to a lawyer before paying this hotel the second night.", "title": "Missed Opportunity for Excellence", "user": "BellaFigura123", "date": "July 17, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 71214992}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "There aren't a lot of choices in Roussillon, I think there are only two hotels right in town, and this one isn't bad if you don't mind a basic, budget hotel. The room wasn't too bad, and I had a balcony which was nice at night for sitting (during the day, it faces the sun so is too hot), but the room is pretty basic. My main complaint is that the hotel advertises A/C, but my room did not have any. It was broken, in fact, but at least there was a fan or I would have died. When I asked the owner about the A/C, as I saw a unit in the corner of the room, he said it was broken and he was awaiting parts. While the owners seemed nice enough, I suspect they have never actually stayed in the hotel as he kept saying, oh, just open the \"windows\" to cool the room. Well, there were no windows, just one French door (and they had blocked half of it for some odd reason, so only one side opened. But the situation of the hotel with the balcony just meant there was no cross-ventilation at all and the room never cooled down at night. Sure, it was lovely outside, downright refreshing, but the room remained very very hot. I don't think the owners understand that just because it is cool outside does not mean the room will cool down if the outside air cannot enter.", "title": "This Hotel was cheap and so were the owners...the only disappointing aspect of Roussillon!", "helpfulness": 1, "user": "lavenderladies", "date": "July 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 71000258}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "It was clean and had some cute style within the budget, so wasn't bad for two nights. I didn't eat there, I don't eat breakfast. And I give them a big plus for free parking in a lot right across the road, and it is on a main road out of town. So it is a good location with a car. I wanted a place to walk to restaurants and it was great for that, also, which is why this hotel satisfied me. The owners were a little cheaper than necessary in some unusual regard, though, I was surprised. For example, there are virtually no bathroom amenities (okay, I bring my own mostly) except for bath gel/soap. That was provided in a small glass vial. I'm sure they filled it up themself, which is fine. But the first day there were two vials. I took a bath and used up 1-1/2 of them. The second day, they did not even replace them and I was left with only 1/2 vial of soap. This seems a bit excessively cheap as that soap couldn't be worth even a penny to refill.", "title": "Good location, pleasant hotel", "user": "psf1", "date": "June 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 68524495}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The unassuming 2 star hotel is within walking distance of Roussillon town centre and some rooms have lovely views overlooking the valley and mountains beyond. The hosts were attentive without being intrusive and very relaxed about us wishing to upgrade to a bigger room and store our bicyles in their garage. Breakfast was simple but more than adequate. Would recommend this hotel for anyone wishing to stay near the wonderful town of Roussillon which was the pick of the Luberon.", "title": "Great location, views and easy going hosts", "helpfulness": 1, "user": "DongaNBH3", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46454917}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We booked this hotel at the last minute after a change in travel plans and spent 2 nights. It was surprisingly enjoyable and pleasant, though certainly not in the luxury category. The rooms were spacious and clean and although somewhat spartan in their furnishings there were lots of unique decorative touches that gave them character. The common spaces, including breakfast room and patio are charming and the staff were very helpful. It is a little complicated to get breakfast - if you don't put in your order the night before, there is no changing your mind in the morning - but once you get the hang of it, no problem. It was a short hike to the town (in part b/c Rousillon is very hilly) but a good feature of the location is the parking lot next to the hotel. All in all, very good value and experience.", "title": "Unexpectedly pleasant", "user": "artprof13", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 35601368}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "What a great find in an incredibly beautiful town in Provence! The owner was so warm and welcoming. Our room was large and included a private terrace, for a very reasonable rate. We walked up the short hill to get into the main part of town. The hotel was so peaceful, with a nice breakfast for an additional fee, and free parking.", "title": "Absolutely loved this hotel!", "helpfulness": 3, "user": "drmmb", "date": "April 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14968825, "likes": {"liked": "— Warmth and friendliness of the owners", "disliked": "— Nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "I stayed here for two nights in mid-September. Chose it because of price and location.", "title": "OK for the price", "helpfulness": 4, "user": "JC2", "date": "September 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10003596, "likes": {"liked": "— Location", "disliked": "— It's a bit ratty."}}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "variance": {"poor": 5, "average": 11, "very good": 11, "terrible": 9, "excellent": 8}, "aka": "Hotel Reves d Ocres", "slim_ranking": 0.833333333333}