{"user_rating": 4.0, "review_count": 115, "name": "Hotel Ambrose", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Cute Victorian style hotel, odd layout, great location. Complimentary continental breakfast a plus. Newer (private) bathrooms, clean enough. Wifi worked intermittently. Staff seemed quiet so we didn't really ask them for much...Overall we were satisfied with our stay. I would mention that this hotel is more in the range of $100 per night than the $130+ we paid, so shop around for rates.", "title": "Quaint, good location", "helpfulness": 1, "user": "misscrusty", "date": "July 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 115121453}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "My sister and I stayed at the Hotel Manoir Ambrose in February 2011. We are both from South Carolina and didn't know what to expect as it was our first visit to Canada. What we found was a sweet bed & breakfast with loads of character, conveniently located (walkable everywhere & near an easy metro stop), and a welcome host in the Hotel Manoir Ambrose. The staff was extremely helpful and friendly, recommending restaurants and providing directions.", "title": "Warm Hospitality in the Cold Winter", "helpfulness": 1, "user": "Shellsa", "date": "March 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98763942}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "As mentioned in some of the previous posts, this hotel is in the process of undergoing some renovations. Soon the breakfast room (which is currently in a cozy ground floor room) will be moved to a prime location on the second floor right by the front desk. Oh and a word on the breakfast -- the cinnamon raisin bread is delicious toasted! Aside from that, you have many choices of hard-boiled eggs, cereal, yogurt, fruit, bagels, orange juice, coffee, etc. The guest rooms are also getting upgrades. Ours had been freshly painted.", "title": "Perfect location for a short stay", "helpfulness": 3, "user": "worldtwanabe", "date": "February 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 98086152}, {"rating": 4.0, "stay_parameters": "Stayed January 2011", "text": "Overall, this is a warm and cozy bed & breakfast, a perfect escape from the piles of snow outside.", "title": "Comfortable, sweet hotel", "helpfulness": 3, "user": "Alammana", "date": "February 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 96980027}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "This hotel is on a quiet one-way side street in busy Montreal downtown. It is not quite visible from the corner of Stanley and Sherbrook. It is 5 minutes from subway station and here is taxi stand in front of the hotel. Some nice restaurant near-by and the famost Crescent street night life is within 10 minutes on foot. Perfect.", "title": "Cozy boutique hotel in great location", "helpfulness": 2, "user": "DomTC", "date": "February 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95986723}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I've stayed at the Hotel Ambrose twice: once about 25 years ago with my soon-to-be husband, and recently with my son and some friends to visit McGill and Concordia in Montreal. I thought it was great both times! This time we stayed in the Family Suite and we had plenty of room for 5 people. Lovely architectural details including a fireplace and high ceilings, and a BIG jacuzzi tub. Service was friendly, and breakfast was very French. The location is perfect: on a quiet street, but so close to McGill and the attractions of the city. I would not recommend this place if you are looking for chain hotel amenities, but if you want charm and convenience at good rates, Ambrose is perfect.", "title": "Wonderful location, old world charm", "helpfulness": 1, "user": "StJohnFan", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133075588}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We were in Paris surely. A lovely bed and breakfast very well situated near the university. Exceptionally helpful staff, coffee on tap all day, comfy but a bit small room, good breakfast.", "title": "Could be Paris", "user": "Nick H", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132615109}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "I really enjoyed my stay at Hotel Ambrose. I stayed in Room #39, located on the 3rd floor in the front of the hotel, for 3 nights. The room was very big, had a nice TV with lots of channels, 2 single comfortable beds and a sink and shower. Only complaint would be the water pressure in the shower was very low and at 5'10\" I had to bend my knees a bit to get my head under the shower head. Not the best shower I've ever had. The toilet was just down the hall, but not shared. I was really surprised how big/nice the room was for the price!", "title": "Great B&B in Downtown Montreal.", "helpfulness": 1, "user": "CalamariGirl", "date": "June 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131548886}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "The hotel has free WiFi, but the network is unsecured so I was afraid to use it.", "title": "Affordable price, excellent service!", "helpfulness": 3, "user": "fabula11", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129990214}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "All 3 of the receptionists (Ingrid, Francois-Xavier and Sheila) that were on duty during my stay were very kind, helpful and spoke perfect English.", "title": "Good with some issues", "helpfulness": 3, "user": "AnnSatoshi", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 129326098}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The location was great right in the middle of the City and easy walking distance to all shops and metro stations and underground shopping. The staff were very friendly however the old Manager was finishing the day we booked in and a new one was being trained. The new manager was great and very helpful. They allowed us to leave our bags as the room was not ready and then we could go and explore montreal. I would stay there again and the breakfast provided was very good, basic but good. There was no fridge in the room though but you could get ice from downstairs. There is no lift and the staircase is very steep and not very wide but that added to the ambience of the place. Would stay again - very good.", "title": "Good location right in the heart of Montreal - very quaint", "helpfulness": 2, "user": "gsvon", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126803398}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I was disappointed that on the website the room portrayed a fireplace in the picture when in fact it did not have one. Classic Double Room.", "title": "Quirky, good value", "helpfulness": 3, "user": "ExBCer", "date": "December 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122174539}, {"rating": 1.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Loved the location (very close to McGill), friendly staff - but the building itself was the draw for me. Odd shaped, weird stairways, confusing sightlines. I loved it. Dedicated parking was limited. No elevators (not a problem for me). Free wifi. Simple breakfast. Bottom line: well, it's the bottom line. Traveling alone, this place was a bargain. 3 nights for the price of 1.5 nights at a \"normal hotel\".", "title": "Never Judge a Book By its Cover!", "helpfulness": 6, "user": "Jlou101", "date": "November 29, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 121204359}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "I stayed here for three nights during a trip to Montreal with my husband. Upon arriving to this hotel, I was intrigued by the brown stone style buildiing, and the warm and cozy lobby area. However, after exhaustively carrying our own luggage up the long and seemingly neverending staircase, we enter our small standard room, and are immediately overcome by a strong mildew stench that was coming from the bathroom. The shower head had green mold on it. We bought Lysol and ended up cleaning the bathroom thoroughly, ourselves. The carpet was stained from what seemed to be water damage. After we sprayed the room with air freshener, we hoped that we can begin to enjoy our trip to Montreal.", "title": "Good Value, Good Location", "user": "boneman7", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120134746}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "However, unfortunatately this was not the case. Our first night, we were extremely hot. We had the window wide open (it was cold outside, since it was late November), yet no air seemed to get in. I had to sleep with a washcloth that was soaked with ice water around my neck. We had no control over the temperature in the room, and the hotel pumped heat through the hotel and made the room feel like it was 90 degrees. The extreme heat continued for the rest of the trip. On our second night, we were kept up by this strange loud humming sound that was coming from the shower. In addition to the noises and heat, a terrible mattress and horrible pillows contributed to the poor sleep I received. Every morning, I woke up with a sore neck, and I'm still sore after being home for two days. Also, at 7:30 am every morning, we were woken up by someone doing construction in the side of the building. I know this is not under the hotel's control, but it did add to our frustrations nontheless.", "title": "Staying in Montreal? Don't look no further!", "helpfulness": 5, "user": "Remo K", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119461382}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed for two nights at the Hotel Ambrose. Had trouble finding on street parking, but the receptionist pointed us toward a few underground spots further down on Stanley. We found one right at Sherbrooke and Stanley, only about a minutes walk.", "title": "Simple and Quiet", "helpfulness": 1, "user": "r q", "date": "September 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117795194}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The location of the hotel is amazing! Located at the bottom of Mont Royal, with great access to the Metro on a quieter downtown street.", "title": "Why didn't they tell us about the stairs?", "user": "jbrown2618", "date": "September 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 1.0, "service": 5.0}, "id": 117600844}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The reception staff are quiet and unobtrusive, checked us in efficiently. We had an economy room with private bath.", "title": "Good value and location", "helpfulness": 2, "user": "Elle032", "date": "August 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116177143}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "No elevator. However, stairs are not nearly as bad as some on here say. We stayed on the top (3rd) Floor. I am a healthy adult and had no problems with them, maybe a little tiring after a long day. They are part of the charm of staying in a historic spot rather than a chain hotel.", "title": "Cute, friendly and perfectly located", "helpfulness": 2, "user": "Joebrown28", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115905783}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The room was small, but reflected the price we paid. An unexpected plus was the A/C unit, as it was quite hot and humid while we stayed. It was clean and the double bed was comfortable. The washroom was also small, but again clean and well kept. The television was again..very small..but we didn't come to Montreal to watch TV. I would say there was over 20 stations, equally split between the languages.", "title": "Real treasure!", "helpfulness": 2, "user": "Laudy-di", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115157631}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 2.5, "variance": {"poor": 7, "average": 24, "very good": 50, "terrible": 6, "excellent": 28}, "aka": "Manoir Ambrose Montreal", "slim_ranking": 0.323529411765, "description": "Hotel Ambrose is a charming 22 room hotel in the heart of Montreal. Each of our rooms are comfortable and unique. Offering a truly European experience in North America, we pride ourselves in offering the basics of a great hotel: Amazing Location, Exceptional Service, and Clean Impeccable Rooms. On top of that, we strive to make your stay here as value friendly as possible, offering free amenities: Continental Breakfast, WiFi Internet, Cable TV, and more."}