{"user_rating": 4.5, "review_count": 100, "name": "Hotel Fidanka houses", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We arrived in Kalkan in the dark and woke to the most amazing view from our Timber Wooden Suite. This place is amazingly put together, a hazen of tranquality. It is a 20 minute walk to the centre up and down a hill but it is worth it. We were out of season but the staff were very helpful, I imagine in summer sitting in the restaurant in the evening over looking the bay and swimming pool! It was very reasonably priced and easy to book direct with the owners from their website.", "title": "What a hidden gem...", "helpfulness": 1, "user": "GromitManchester", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 28876156}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "This hotel has got to be one of the most unique places I've ever stayed. Arriving back at the hotel after a hard day's sunbathing at one of the beach clubs was nothing short of a joy.", "title": "Absolutely idyllic", "helpfulness": 4, "user": "Lexiloola", "date": "July 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18204833, "likes": {"liked": "— It was beautiful", "disliked": "— Distance from restaurants and bars in central Kalkan - taxis were expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The hotel is built in a very old fashioned style, yet is fairly new. Dramatic fuschia flowers wind their way up the buildings and a family of swallows nest under the canopy.", "title": "great place", "helpfulness": 4, "user": "pictongirl", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10580636, "likes": {"liked": "— Style.", "disliked": "— can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Each room has its own assortment of quirky objects and charmingly mismatched furniture, with a day bed & cushions & chairs on the balcony where you can soak up the sun until it sets (8pm in June)", "title": "An oasis of comfort and calm", "helpfulness": 13, "user": "CoolerKingHilts", "date": "July 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8110717, "likes": {"liked": "— The whole style of relaxed feel of the place - not liek a hotel at all"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This really is a beautiful little hideaway 5 minutes drive from Kalkan. The building is incredibly quirky and arranged over numerous levels. Our room had a separate sitting area furnished in the manner that I would imagine a typical Turkish house would look like, in fact the whole hotel oozes old world charm and it's very easy to relax almost from the moment you arrive.", "title": "Oozes old world charm", "user": "BucksWanderer", "date": "September 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 42611859}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The staff could not have been friendlier, the food we had at both lunch and dinner were excellent, offering a good selection of local dishes and not over-priced wines. The pool area is well kept and there was never a fight to find a spot to lay out with plenty of sunbeds and umbrellas available.", "title": "Unique Hotel with superb views", "helpfulness": 1, "user": "nicnmic", "date": "September 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39987133}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We ate in Kalkan on 4 occasions, there are a myriad of choices there, but our favourite was the roof terrace at Sofra, the fish skewers were to die for as was the chocolate cake (or so my wife tells me!)", "title": "Wonderful", "helpfulness": 1, "user": "PetC", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 36111116}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had a hire car as part of our package and found driving in that part of the world to be pretty straightforward and visited Xanthos, Pattara and the Saklikent Gorge whilst in the area, all of which I would highly recommend as worthwhile trips. Try the trout restaurants as you arrive at Saklikent (we ate at the first one we came to and the food was excellent).", "title": "The most utterly beautiful hotel I've stayed in", "helpfulness": 2, "user": "londoner_lass", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 34531633}, {"rating": 4.0, "title": "A charming and friendly small hotel", "text": "Would I stay there again, most definitely.", "user": "wirralblue", "date": "July 9, 2009", "id": 34329109}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I agree totally with the other reviewers on the prettiness of the hotel. It is by far the loveliest building in this area of Kalkan. Overall we had a very pleasant and relaxing stay there - also using the Villa Mahal Beach Club, which is about 10 minutes away on foot down the hill, but there were a few niggling factors:", "title": "Architectural gem, but room to improve", "helpfulness": 1, "user": "Georgine88", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34199765}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We were not so impressed as one of the reviewers with the food. We had the BBQ twice, which was good, but one other dinner we had there was a disappointing. We felt that they had adapted Turkish cooking to the British taste (chips with everything, but no rice to be had). During our 9 days there the clientele was almost entirely British. There were also a kettle and cups in the room, but no tea or sugar. We thought the breakfast was a bit unimaginative - there was exactly the same choice every day with the bread being especially boring. Orange juice and lemonade were not freshly pressed from fruit, but tasted quite artificial. We did not see the owner once during our stay, instead everything was largely managed by two young guys - very nice - one of whom was almost inseparable from his mobile phone, which he had on during dinner and breakfast service. Room service was superficial. Our bed was made once during the entire stay, a dead moth on one of the rugs in our suite stayed there for the full 9 days. I am surprised nobody mentioned the beds, or were we just unlucky with ours (room Narevi)? It was very small both in width and length and it was impossible for my husband (1,83m) to stretch out.", "title": "Just an artistic hotel with an excellent service", "helpfulness": 4, "user": "GunaySen", "date": "June 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33126498}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I would still very much recommend this hotel, but they could improve on the above points.", "title": "Beautiful haven", "helpfulness": 3, "user": "Xanadustar", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 32348631}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I stayed with my 8 years old daughter at Fidanka last week. I found the hotel from the Small Hotels Book of Turkey. The hotel is established by a grandmother (ex-dentist but an artist now) and her daughter and son in law (who used to be a banker). As a world traveller, it is the best hotel that I have seen in Turkey in terms of original decoration, mix of old and tradition, friendly service and unbelievable tasty lunch and dinner. Terrace of our room (Nar Room, a villa suit) was out of this world! Sunset is the best in Kalkan!", "title": "Beautiful, quirky hotel with high standards but homely feel", "helpfulness": 3, "user": "clairelouisemcfall", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32125294}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The prices are perfect in terms of the quality. 15 turkish lira per large portion of meal (6 pounds) very reasonable.After coming from Istanbul, we found the prices of the meals very reasonable. We stayed at Fidanka 3 nights and ate 2 dinners and 1 lunch. Breakfast was only weakness of the hotel per Turkish standards. They had cereals,yogurt and fresh fruits for international standards but as Turkish person I would expect homemade jams and homemade pastries for breakfast from Fidanka. They had their own olives from their backyard which was excellent and special for me!", "title": "Lose yourelf.....", "user": "AlanL58", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31958115}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed at this hotel for two weeks in September 2009. The hotel had good points and bad points. We booked through Tapestry and picked the Nar Suite based on the assumption that it was a top floor suite (we did not want anyone above us). Upon arrival, I was very disappointed with this room. It was the last room you passed before reaching the roof terrace area and so the staff had a tendency to hang around just outside the bathroom window waiting for customers. The roof terrace itself was directly above the bedroom in the Nar Suite and so we could hear people moving around up there and then furniture being moved at the end of the evening. The layout of the “suite” was a bit strange with one completely empty room, apart from a table, but bare floorboards, which apparently used to house a kitchen. The main door to the suite was not completely secure and was locked with a padlock. The room did not have a kettle but it did have a large fridge. We moved rooms on two occasions so that we did not have to stay in this room. To be fair, the staff dealt with this very well.", "title": "Could do better", "helpfulness": 1, "user": "Claire G", "date": "June 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 68297129}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The breakfasts at the hotel were in a lovely setting, but they did become a bit repetitive over a two week period and they would often run out of key things like bread, juice, glasses, etc.", "title": "Magical Hotel, but can Use a bit of Improvement on Service", "user": "peacefulexplorer", "date": "June 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 67626713}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The service at the hotel was generally good, but as other reviewers have commented, the staff could have done more to create an atmosphere in the evenings. We would often go down to the bar area to have a drink before getting a taxi into town, but we were often the only ones down there and the staff were more interested in their mobile phones than making small talk with the guests. A lot more could have been made of this bar area in the evenings.", "title": "Fabulous - so eclectic - relaxing", "helpfulness": 1, "user": "Alibongo1962", "date": "June 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67348280}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I would agree with all other comments on this site about Kalkan itself and the beachclub near to the hotel. We had a great holiday in Kalkan and will definitely one day return. I do not think that the Fidanka would be my first choice of hotel though.", "title": "Unique hotel but could do with a little more customer service", "helpfulness": 1, "user": "gaypartners", "date": "October 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 47340918}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We recently spent a week at Hotel Fidanka and the hotel is magical in design and location. The hotel is built out of old wood and we stayed in one of the tree house like type rooms which had an amazing balcony that was one of our favorite parts of our trip. The views are fantastic.", "title": "Fidanka - A Very Different Hotel!", "helpfulness": 1, "user": "PandSDorset", "date": "October 14, 2009", "detail_rating": {"cleanliness": 3.0, "location": 5.0, "value": 4.0, "rooms": 3.0}, "id": 46818711}], "location": {"country": "Turkey", "region": "Turkish Mediterranean Coast", "continent": "Europe", "city": "Kalkan"}, "variance": {"poor": 3, "average": 6, "very good": 18, "terrible": 1, "excellent": 72}, "aka": "Fidanka Hotel Kalkan", "slim_ranking": 0.205128205128}