{"user_rating": 3.5, "review_count": 161, "name": "Hotel the Golden Bear", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "OK, so here are my thoughts about the Golden Bear. First, we're going to talk about the stairs. Now I know this is Amsterdam and the dwellings are thin and crowded together but, going up and down those stairs gave me nightmares. Very, very steep and the \"stairs\" are not even as wide as your foot. Getting the picture?", "title": "Watch those stairs...", "helpfulness": 3, "user": "hammonda1", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 15514580, "likes": {"liked": "— Close to the gay scene and a great restaurant steps away called", "disliked": "— The steep stairs"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "I guess I should just add that two years ago I took a bad fall on stairs that were nowhere as steep as these so I did do a double take when I saw them. Keep that in mind if you are booking here. If you have trouble with steep stairs, these are like mountain climbing and could potentially be very dangerous if you are not sure of your \"footing.\"", "title": "Not Worth it at All", "helpfulness": 3, "user": "vmcla", "date": "April 23, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 15279783, "likes": {"liked": "— location", "disliked": "— drab, unfriendly atmosphere"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Knowing ahead of time that everything is expensive in Amsterdam, this hotel is no exception. My bed was very comfortable, I'll say that. The room was a fair size, no problems with noise at all, the shower and sink were both nice but to use the toilet, you had to go out in the hallway to use a public (shared) one.", "title": "OK but wouldn't rush back", "helpfulness": 2, "user": "dave_evans", "date": "April 23, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 15250281, "likes": {"liked": "— location", "disliked": "— noise problem"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "The last two days that I was there, I contracted stomach flu which had me running to the bathroom several times an hour. Luckily, there were no problems getting in to use the toilet but I consider myself very lucky on that count.", "title": "All Around a Great Place to Stay", "helpfulness": 1, "user": "afineguy", "date": "January 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13122920}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "So, now to the \"breakfast.\" It was basically 4 pieces of bread (2 white, 2 brown) some slices of cold meat and cheese plus coffee or tea. It resembled more of a lunch but if you were hungry, it was ok. There was a toaster there if you wanted to toast your own. The eating area is also very cramped so if everyone there showed up to eat at the same time, there'd be trouble.", "title": "The Golden Bear is home to me in Amsterdam", "helpfulness": 2, "user": "arggie", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12731946, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Althounght it is a gay friendly hotel, non gay people are welcome.", "title": "Best deal", "helpfulness": 2, "user": "Tonyloves", "date": "November 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10615813, "likes": {"liked": "— Location", "disliked": "— Stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Best deal comparing price and quality!, specially if you take into account that Amsterdam's hotels are really expensive.", "title": "Good Value and Comfy", "helpfulness": 4, "user": "dubhorse", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10506695, "likes": {"liked": "— Price & Coziness", "disliked": "— Cat"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "It is well located and have a friendly stafff.", "title": "Great and Central", "helpfulness": 2, "user": "mikrosca", "date": "October 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10202897, "likes": {"liked": "— Location", "disliked": "— Stairs"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Worst issue: you almost need climbing apparel to climb so narrow an step stairs, no lift.", "title": "Good for the price but needs to be friendlier", "helpfulness": 3, "user": "BrumTraveller", "date": "October 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10172787, "likes": {"liked": "— Very clean, cheap, quite well-equipped rooms", "disliked": "— Generally unfriendly staff, poor shared facilities"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "The Golden Bear is a small gay hotel in the Leidseplein area of Amsterdam, close to the main gay areas and on the central tram line (2 & 5). I have stayed there about 5 times in the last three years. I have always found it to be extremely clean and well kept. Normally with work I stay in 5 star hotels like the Hilton and the Intercontinental so its a change from them. The service I have had, spending my own money, has always been excellent. Staff ARE friendly in a Dutch (slightly less effusive than the Irish approach but probably more sincere) and if you ask for help they always respond (an attribute that is rare in most 5 star hotels). The rooms vary in size and rarely have en suite facilities. I think thats fair enough as the rooms maintain their 18th century proportions and a sense of coziness - it also keeps the price down for the economic! There are never problems with noise from other rooms (again the architects of the Intercontinentals could learn from this).", "title": "Great Hotel, with Scrupulously Clean Rooms", "helpfulness": 2, "user": "CanadianBoys", "date": "September 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 8721378, "likes": {"liked": "— Location", "disliked": "— Typical Holland spiral stairs are steep and narrow"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Just returned from a 3 day break at the Golden Bear and would say that I would give it a bit of a so so rating really.", "title": "Friendly staff, well located if a little disappointing", "helpfulness": 1, "user": "AlecCampbell", "date": "November 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 22092778, "likes": {"liked": "— Location", "disliked": "— Breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Good things - location makes walking to all major points of interests a maximum of a twenty minute walk away, the staff who are friendly enough.", "title": "Good hotel, in an Amsterdam sort of way.", "helpfulness": 1, "user": "orangeroof", "date": "November 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 21683475, "likes": {"liked": "— the location", "disliked": "— the street noise"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "So so things - room (top floor rear) was clean, shower reasonable power, good TV and DVD with good selection of channels.", "title": "Nice,Modern, but not really a Hotel", "helpfulness": 3, "user": "Aiomara", "date": "October 10, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 20775215, "likes": {"liked": "— Modern up to date room, basic facilities, quietness", "disliked": "— Stairs, Staff not very customer conscious"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Bad things - the breakfast is a real let down (no cereal, fruit, or even fresh milk) just toast and ham and cheese with coffee and orange juice.*There is a great coffee/snack shop around the corner giving great muffins and snacks at a reasonable price so go there instead*, the price (over £100 pn for a Sunday to Tuesday night seems a bit steep in November but Amsterdam is an expensive city for hotels).", "title": "Please Don't Stay Here", "helpfulness": 5, "user": "TCHAD", "date": "July 28, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 18363249, "likes": {"liked": "— the location", "disliked": "— The coincidental fraudulent credit card charges when I returned home"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Overall though the location will be the main selling point of this hotel (although if I stay here again I will not be taking a big suitcase as the stairs make getting it up a strain and getting it down if you are on our own terrifying).", "title": "great location", "user": "malbruMontreal", "date": "May 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 15919681, "likes": {"liked": "— location", "disliked": "— stairs very steep"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Was looking for convenient, gay friendly place to stay for myself and a guy friend. Did an internet search for gay friendly Amsterdam lodging. It was easy to contact/pay online; response to my emails within 24 hours. The Hotel Golden Bear is located on a quiet street near the Leidsestraat, a major road with trendy and regular shops, fancy and pedestrian restaurants and both exclusive and inexpensive hotels. Dam Square is a 20 minute walk to the northeast and the Rijksmuseum is a 20 minute stroll to the southwest. Some rooms were being renovated and was originally told I might have to stay in a smoking room (which I did not want to do). Then I got a response informing me no matter what, I would get a no smoking room. Arrived to a typical multi-floor Amsterdam townhouse after taking a cab from the train station. The receptionist welcomed us and we put away our luggage until our room was ready (we had arrived at 10 am from Houston). The reception area and breakfast room were pleasant and we looked through tourist brochures that were available. We later walked up the small, spiral stairs (similar to those found on a ship). It was a bit difficult to move our bags up the stairway due to the space; however, when we got to our rooms we were very pleased. We were on the third floor and we had a shared shower and toilet on the second floor. The whole facility was very clean ... always with soap, toilet paper, beds made, etc. Each room was a nice size and had a double bed, tv, wash basin, closet, desk and chair. They were painted colorfully and had trendy Ikea-style furniture. My window looked to a wall but still allowed for nice cool air from the outside. My friend's looked to a courtyard below. The morning inclusive meal was hearty enough and consisted of meats, cheeses, rolls, toast, juice, coffee and other items. The receptionists were always helpful when giving us directions to places such as the drug store, restaurants, bars, the trolleys, etc. The price was reasonable and again, good location.", "title": "Cozy and Warm", "helpfulness": 2, "user": "justbstx", "date": "September 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8697820, "likes": {"liked": "— Great location and price, nice room size, pleasant staff and overall cleanliness.", "disliked": "— The traditional stars were very steep and there was a bit of mold in the closet (due to the damp Amsterdam weather)."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "There are probably better deals in Amsterdam. The hotel was just OK. The beds were quite comfortable and the room spacious. David at the front desk was wonderfully friendly and helpful. Breakfast was only average--definitely nothing to write home about.", "title": "Just OK", "helpfulness": 3, "user": "Escena", "date": "July 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 8215986, "likes": {"liked": "— The location", "disliked": "— The stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The stairs are definitely a challenge to anyone with large bags. We were carrying large duffels of sport equipment and it was everything we could do to get them up and down the steep, narrow spiral staircase. Definitely a hazard to older travellers or anyone with limited mobility.", "title": "Alex is the BEST", "user": "big_cute", "date": "April 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7394875, "likes": {"liked": "— Staff"}}, {"rating": 4.0, "title": "The Golden Bear is great value for Amsterdam", "text": "The hotel is conveniently located steps away from a tram line and within easy walking distace of museums and many restaurants and shops. If you stay here definitely check out the Spijker Bar just down the street and say hello to Tim the bartender! He offers great advice on what to see and do in Amsterdam!", "helpfulness": 3, "user": "whitedachshund", "date": "April 5, 2007", "id": 7283208}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My gf and I stayed there for a week and had the best time on our vacation. Alex and the staff were wonderful and helpful with our excursions and other recommendations. Our room was very comfortable and quiet. If you want to be in a central location, then this is the hotel for you.", "title": "We will be back :-)", "helpfulness": 1, "user": "smprods", "date": "March 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7178502, "likes": {"liked": "— The cleanliness of the room and the friendly staff", "disliked": "— nothing"}}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "variance": {"poor": 12, "average": 31, "very good": 51, "terrible": 15, "excellent": 52}, "slim_ranking": 0.485294117647, "description": "Hotel The Golden Bear is a \"straight\"-friendly\" gay hotel. It is the most well known and popular place to stay for gays and lesbians from all over the world.The hotel is located in two historic buildings dating from 1737.Being situated in the very centre of the city and in the middle of the UNESCO World Heritage site, it means that all main touristic places, museums and shops are just around the corner. And are also the main gay bars, saunas and other places of interest only a short stroll away."}