{"user_rating": 5.0, "review_count": 293, "name": "Hotel Mume", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "My advice would be to stay here at least a night or two to really enjoy Kyoto.", "title": "Wow", "helpfulness": 1, "user": "a002537", "date": "July 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168645247}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Fantastic area.", "title": "Perfection! An Unforgettable Experience!", "helpfulness": 1, "user": "renvez", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168278804}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "No Spa, but unbelievably clean, friendly, and spacious comfortable rooms.", "title": "Personalised service", "user": "Dolores D", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167475148}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The butterfly rooms are a little smaller and dark, the Wind rooms are brighter and have a nice view of a little creek and shops. Butterfly if you want to sleep and wind if you want to enjoy view. Two rooms on each floor butterfly on one side and wind on other.", "title": "Wonderful Boutique", "user": "BornaTravelinMan", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166619858}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Even had free drinks in evening at great little bar.", "title": "wonderful second stay", "helpfulness": 2, "user": "heachri", "date": "June 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164437061}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "After a rather scary short time in Tokyo we arrived at Kyoto Station by bullet train, thanks to the map provided we were able to convey to the taxi driver where we wanted to go despite the fact that we speak only a little Japanese and he spoke no English. The driver had a little difficulty finding the hotel but we did get there! Upon arrival we again had some difficulty figuring out whether we were the the right place and how to get it. There is just a red door, no sign, and when you knock there is no answer, you have to press the buzzer on the left wall which I'm pretty sure was kind of hidden by some plants.", "title": "Fantastic Hotel", "helpfulness": 2, "user": "spage89", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171803979}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Once we entered the hotel we were truly able to relax. The room was beautiful, we stayed in the butterfly room on the third floor. There were a couple of odd things in the room, first was that the bed was two double beds pushed together rather than one large queen or king size bed. Since I was travelling with my boyfriend we found this quite an odd arrangement since it meant that we weren't truly sleeping in the same bed. However, if you were travelling with family or friends it would be good as you would be able to pull the beds apart and treat them as two separate beds. Secondly, there is only a pane of glass separating the bath/shower from the bedroom so you are able to clearly see whoever is in the bath/shower from the bed. There was a bamboo kind of blind thing you could roll down but you could still see the person's silhouette. Not an issue for us, but if you're travelling with friends/family it could be.", "title": "Highlight of our trip", "user": "albi2604", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171793973}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "If you are around the hotel at happy hour time I recommend taking advantage of it. We were aware of the free drink happy hour when we booked but didn't realize until we arrived that they offered multiple drinks. On our first day after having one drink my boyfriend was offered a second drink and inquired to the price (so he could pay up front) and was informed that there was no charge. Upon subsequent nights he was offered 3 drinks, and maybe more if we hadn't been hungry and ready for dinner. We were also offered a variety of snacks which the second we finished the last one was promptly replenished. Breakfast was also delicious, a variety of juice, yoghurt, egg, soup, fresh fruit, soup and freshly baked breads. The bread was the absolute highlight of the meal, each day was a croissant and two other varieties which ranged from coffee to chestnut, one day I think we had a blueberry or fruit flavoured one and many others. The chef should be highly commended on these wonderful creations!", "title": "Simply the best", "user": "LindalovesPilates", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171478954}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel staff, I cannot praise them enough! Their English was fantastic and no issues was to big or to small for them. Every night at happy hour they asked how our day was, where we were going for dinner, did we need suggestions if we hadn't decided and did we need directions on how to get to the places and so on. The two best places we ate in Kyoto (a gyoza bar around the corner from the hotel and a ramen restaurant) we suggested by the staff. Every morning at breakfast they would ask where we were going and again give suggestions on where to go and how to get there. They even went so far as to remember our drink preferences. For instance the first day we were served grapefruit juice, which after I took a sip found to be far too sour for my taste. Upon realizing that I didn't like the juice, the girl working (Nagisa I think it was) quickly offered me another drink, orange juice, and every morning after that I was given orange juice instead of grapefruit with out even asking. Upon leaving the hotel for the day they would offer us umbrellas in case of rain and rush to open the door for us and upon returning they take our umbrellas. On our last day they helped organised transport from the hotel to Osaka airport and when we arose early to catch the MK Shuttle (we were flying out of Osaka at 10 so left the hotel around 5) they had a bag of freshly baked bread ready for us and served us coffee and juice while we waited from the shuttle to arrive. Even if they food and rooms we poor (which they most definitely were not) the service provided by the staff would more than make up for it.", "title": "Guidelines-Get the best room in the house", "user": "Ravn", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 171441447}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The hotel itself is in a great location as well. We were able to walk to all the major shrines on the east side of the city including Kiyoumizu-dera, Kodaji, Chion-in, Yasaka-jinga, Nanzen-ji and Ginkauki-ji in an hour to an hour and half depending on which site we went to. It was also a very short walk to Shijo Avenue, the Geisha district, the Ichiriki Teahouse and other major sites around Gion. In fact the only time we left the hotel and need to use an alternate form of transport was when we went to Kinkaku-ji and Ryoan-ji.", "title": "Amazing little hotel", "user": "tad57", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170546470}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "What a beautiful establishment! And the most wonderful service anyone can ask for. My husband and I arrived very late and they were able to welcome us and even gave us an upgrade to the suite on the top floor. It was a beautiful room with a great balcony looking over the river.", "title": "The best part of Kyoto", "user": "drgirlnyu", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164104607}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "They were so attentive especially with reservations and planning the day, down to the bus/train routes/stops etc. Actually, they started helping me long before we even arrived. I sent numerous emails asking about various aspects of my trip and they always replied promptly and thoroughly. Happy hour every afternoon and breakfast was always fantastic. And how gracious were they to always accompany us to the elevator and bow to us as the doors closed. Really tremendous experience. Thanks Hotel Mume!!!", "title": "Secret Sanctuary", "helpfulness": 1, "user": "Zumba12", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163928099}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We spent three nights here & very much enjoyed the experience. I would describe it as a sort of Western style ryokan, mainly because of the personal touch & the beautiful furnishings. The eclectic mix of lampshades, curtains & furniture resulted in a stunning effect. The staff were so helpful & gave us so much information. They made bookings for us in advance of our stay & recommended places to eat, all of which turned out perfectly. We stayed in the Wind room which was lovely & bright, was spotlessly clean & had just about everything we needed. A nice view of the stream below too. The breakfasts are tasty & plentiful & the freshly baked bread a real treat. Best of all we enjoyed happy 'two hours' when we got a chance to sit back & reflect on the day's activities with a nice glass of something!! It was good to speak to fellow travellers too & to staff at this time. At the end of our stay we felt like we had become good 'mates'! The staff were so helpful & we enjoyed taking tea in the lounge..... however, it would have made our stay even more spectacular had we had a kettle in the room - we do so enjoy that morning cup of tea in bed!!!!", "title": "The best hospitality we have experienced!", "helpfulness": 1, "user": "Prem2012", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163610506}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed here in early May on our honeymoon, we stayed in the Butterfly room which was very romantic with dark walls and a glass wall looking into the shower. The room felt like it had a personality. The hotel was very well appointed and felt very luxurious.", "title": "Perfect for Couples. Best Hotel Experience Yet!", "helpfulness": 3, "user": "rabbitluver", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162485302}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The staff were so kind and helpful from the start and they treated you like friends, offering tips and chatting with us about kyoto and our trip. They had a happy hour each evening when they offer drinks (alcoholic and non-alcoholic) for free, they also take time to chat to guests and offer advice about where to go in the evening.", "title": "A slice of heaven!", "helpfulness": 1, "user": "bibeleh", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162204976}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "during the stay, we kept on saying how amazing this place is because the service is unparalleled. it is a very small hotel and therefore they take care of everything and really seem to enjoy it. there is no complaining or expecting tip. in great location. would stay there again without a doubt. the service is total worth any extra cost you might have to pay and in the country where some visitors might not speak the language, this is key and totally worth it.", "title": "couldn't ask for better hotel in kyoto", "helpfulness": 1, "user": "boo99", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175625480}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We spent four days and three nights at Mume, hands on the best service and personal atenttion we've ever experienced in all our travels so far. The decor, location, cleanliness, breakfast and again personal attention were out of this world. If going to Kyoto it is mandatory to stay at Mume.", "title": "Best small boutique hotel we've ever stayed at", "helpfulness": 1, "user": "LAVVphoto", "date": "August 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 174584947}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I stayed here on our honeymoon in Japan. Everything from the rooms, to the breakfasts, to the service was thoughtful and excellently executed. We had the Moon room, which while was somewhat absent of natural light since the window faced an alley way, it was still well lit within the room with all the lights on. The room was quite large compared to the typical Japanese hotel room, and beautifully decorated with a wonderful traditional lantern light, with a mix of modern and traditional. The only con was that the beds are separated into two twins with a bare bar of wood (part of the bed frame) in between, which can be tough for couples, but this seemed to be a common theme in most Japanese hotels we stayed at outside of Tokyo.", "title": "Boutique (Hotel) Beauty!", "helpfulness": 3, "user": "Jennifer B", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174217799}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The breakfasts were delicious, with the sweetest fruit, most flavorful soups, and most chewy breads, and crisp croissants imaginable. A wonderful start to our event filled time in Kyoto.", "title": "Amazing Service 5 STARS ALL AROUND!", "helpfulness": 2, "user": "devinezqui", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172870264}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff was extremely friendly, and spoke English extremely well. Don't be afraid to ask them for recommendations of tourist sights, stores, and restaurants. We had some of the best food during our entire honeymoon during our stay in Kyoto thanks to the staff's excellent restaurant recommendations (namely their recommendations for okonomiyaki and tonkotsu).", "title": "kyoto cool - Mume. Impeccable.", "user": "KobeDeepdish", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172616463}], "location": {"country": "Japan", "region": "Kinki", "continent": "Asia"}, "variance": {"poor": 1, "average": 4, "very good": 16, "terrible": 0, "excellent": 272}, "slim_ranking": 0.00719424460432, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}}