{"user_rating": 4.5, "review_count": 79, "name": "Hotel Franziskushoehe", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I've had the pleasure of staying at the hotel twice...once in the winter and once in the summer. Both times were wonderful. It's a three star hotel with four star service...and a very, friendly staff. the rooms are modern, large, and comfortable. But the best part is the atmosphere of the hotel itself -- it's very warm and cozy and family-friendly. Yet, at the same time, it's got an upscale feel. This is best exemplified in the restaurant, which has a very warm, family-kitchen feel and lots of homey touches (there is even a mural that says, basically, welcome to mama's kitchen), but the food tastes, and is prepared, like an expensive restaurant. the first time I went was on business and I was alone. The second time I brought my family and my 12 year old daughter loved it. they have lots of activities for kids...which my wife and I certainly appreciated (the cooks and waiters quickly figured out my daughters favorite foods and catered to her like she owned the place). The hotel is perfectly located above the charming village of Lohr and has exceptional views. It also has access to a bunch of well-marked trails into the forest. There is an out-door terrace where they host bbqs, has the best views, and is a lovely setting to just relax. The town looks like it came out of a fairy tale...it's adorable. My wife and daughter also took daytrips to Wurburg and the outlet mall in Wertheim. I strongly recommend this romantic, idyllic and comfortable hotel for either a winter weekend or a summer getaway.", "title": "Fantastic Hotel, charming and warm", "user": "Vbg", "date": "September 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8841149, "likes": {"liked": "— The location and the warm, friendly atmosphere.", "disliked": "— the restaurant closes in the afternoon."}}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 1, "average": 5, "very good": 25, "terrible": 0, "excellent": 48}, "slim_ranking": 0.142857142857, "description": "Your 4 Star Hotel in the middle of the scenic forest of the SpessartThe Franziskushöhe, hotel and restaurant with conference rooms in Lohr upon Main in the middle of the scenic Spessart, is the ideal place for an overnight stay, an extended holiday or just a delicious dinner in our restaurant. Our traditional Franconian as well as international cuisine, the comfortable rooms, a scenic landscape and our friendly and personal service are worth a visit. 12 single bedrooms, 48 double rooms, 7 family rooms and 1 junior suite are waiting for you. Whether it be a short trip, a business conference, a family or wedding celebration - you will always find a ready welcome at the Franziskushöhe."}