{"user_rating": 3.5, "review_count": 137, "name": "Hotel Zaida", "reviews": [{"rating": 4.0, "title": "Hotel Zaida What a bargin", "text": "If you are looking for luxury then keep looking but if you are looking for a great value and clean rooms and location , location, location. You can stop looking.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "October 25, 2002", "id": 724261}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We have just returned from a 5 day visit to this wonderful city and we are looking forward to returning next year.", "title": "Good central situation and a small bill on check out.", "helpfulness": 9, "user": "Iris", "date": "April 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3401025}, {"rating": 3.0, "title": "Okay but not more than that..", "text": "We booked a room with Venere and paid on leaving - no deposit required.I was a bit anxious about staying in a 1* hotel but I need not have worried.It was spotlessly clean with clean linen supplied every day.The desk staff were most helpful and wel felt very safe in this quiet area.A creche for toddlers is near the hotel entrance and it was a delight to see the beautiful children arriving each morning.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 9, 2004", "id": 2669074}, {"rating": 4.0, "stay_parameters": "Stayed April 2004", "text": "We breakfasted in a buzzing restaurant called Pando (recommended by the man at Zaido desk) and just 2 minutes walk away.For 3 euro we had fresh squeezed orange juice,coffee.toasted croissant and butter.Yummy.I miss it!The Zaida cost 60 euro per night - what a bargain!It is a 10 minute walk from the Cathedral and all the central activities and just 2 minutes from the main Art gallery of Seville the Museo de Bellas Artes.", "title": "Bargain charming hotel with ambiance in quiet location", "helpfulness": 10, "user": "numbercruncher", "date": "June 26, 2004", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 2223212}, {"rating": 4.0, "title": "A great friendly hotel", "text": "The hotel is in a very quiet street in Seville. Our room had only a small window without any view. If you want better rooms, ask for a room on floors 0 or 1. The aircondition was a very old one but it worked fine. 3 single beds in our room. The room was clean and the bathroom was refurbished lately. But the location is not very good and parking was also quite far (5-10 minutes walk). I would pay more and stay closer to attractions..", "helpfulness": 15, "user": "cathdav", "date": "August 23, 2003", "id": 1257726}, {"rating": 4.0, "title": "worth a visit", "text": "We stayed in Hotel Zaida for several days in mid-April 2004. Located on a twisting, narrow alley well away from main avenues, it provides the advantage of a quiet location which is central to the old part of the city and within easy walking distance of the cathedral, the art museum, good restaurants and lots of shopping. Walking into the hotel is like walking into a Moorish fairy tale. You enter through a tiled courtyard around which 3 stories of rooms are arrayed. The rooms are capacious, clean and recently updated. No one at the front desk spoke English, but they were always unfailingly friendly and willing to work with our extremely limited Spanish and to help us with whatever questions we had. My only warning is that you need a good map to find it! It is located in a proverbial spiderweb of tiny alleys which have no rhyme or reason as to direction (they're all one way). One of our group fortunately was endowed with an internal GPS, so he invariably was the person to direct us, like a homing pigeon, through the maze of alleys and get us back every night. But, what the heck.... the times we did get lost, we had a lot of fun seeing new streets and sights! One of the joys of traveling!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 9, 2003", "id": 1132271}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 1, "variance": {"poor": 11, "average": 20, "very good": 67, "terrible": 16, "excellent": 23}, "aka": "Zaida Hotel Seville", "slim_ranking": 0.535714285714}