{"user_rating": 4.5, "review_count": 430, "name": "Hotel Camelia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008", "text": "Room was small but lovely, french doors & balcony cute, lovely bathroom - beautifully decorated. Husband and I only stayed 3 nights, good value, would definately stay again. Staff lovely, exceptional service, we were early by 4 hours for hours for check in but staff made us cappuccino's, let us freshin up, took care of luggage etc way before booked time. Also provided maps etc, absolutely great location, very central.", "title": "Hotel Camelia - Fantastic Stay", "user": "G0ldC0astGirl", "date": "December 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 22669576, "likes": {"liked": "— good value, central, cute & clean, excellent service.", "disliked": "— no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Lisa Stewart", "title": "Hotel was perfect!", "helpfulness": 2, "user": "TheTitch", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22165405, "likes": {"liked": "— Pretty much everything!", "disliked": "— not a huge choice of places to eat in the evening, but this isn't a big issue"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Gold Coast", "title": "Great value & location", "helpfulness": 3, "user": "m_difruscia", "date": "July 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18355009, "likes": {"liked": "— Location, Room size, Great Value", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Loved Hotel Camelia", "text": "Australia.", "helpfulness": 1, "user": "sjohn271", "date": "May 13, 2008", "id": 16011139}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I booked this hotel for a romantic getaway for me and my fiance as we have always wanted to see the sights of Rome. I had booked another hotel previously...Hotel Lirico...but I had some trouble with this (read my review on Hotel Lirico, Rome).", "title": "Loved Camelia Hotel - cleanest hotel I have stayed in", "helpfulness": 1, "user": "AshleyCheshire", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13005989, "likes": {"liked": "— Cleanliness, helpful staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "I recently visited the Hotel Camelia and found it to be very nice and a great value. The rooms were very clean and although not huge, very comfortable ... exactly as pictured on Venere.com. Breakfast was basic but okay and the staff was very attentive. It has a very convenient location, approximately 4 blocks from Termini Station and about a 15 minute walk to Trevi Fountain and Spanish Steps. Originally, I contacted the hotel directly for rates but found the rates on Venere.com to be much better. Overall, this hotel offers an excellent value as a solid 3 star property and I would definitely stay here again.", "title": "Excellent Value!", "user": "RubyNYC7", "date": "January 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12853053, "likes": {"liked": "— Clean rooms, good location, excellent value.", "disliked": "— Not a great selection for breakfast."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We arrived at midnight on the day of our stay. I rang the guy from the airport to say we would be late. No problem.", "title": "Better than expected", "user": "legendb", "date": "January 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 12248262}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "On arriving the receptionist was friendly and welcoming and gave us a map highlighting all the tourists bits we might be interested in and how to get around (bus numbers etc.)", "title": "Disappointing", "helpfulness": 1, "user": "Carolyn S", "date": "November 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 10777094}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The breakfast is a bit spartan but if you ate pasta and pizza the night before who can handle more than a croissant and some fruit. It was fine but no more than that.", "title": "Horrible", "helpfulness": 2, "user": "kkonstan", "date": "September 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 10009704}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "First night we wanted to eat in the area, I found a restaurant in our guide book and the receptionist phoned up to check if it was fully booked for the night. It wasn't so another tick.", "title": "A nice hotel", "helpfulness": 1, "user": "Anonymous32", "date": "August 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8452542, "likes": {"liked": "— the breakfast", "disliked": "— nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Conveniently located near the Termini station, but a bit off the main city center. However, you need 20-25 minutes to reach Trevi or Spanish steps. Rooms are very nice, comfortable, bathroom great, AC works all the times, free wi-fi in the rooms. Reception staff very friendly and helpfull. Breakfast typically Italian, excellent coffee and one of best juices I have tried. I would recommend if you need to be neat train station (convenient to reach Fuimicino airport from there) so you do not have to carry your luggage a long way or to pay taxis.", "title": "Very satisfied", "helpfulness": 2, "user": "Shule", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 39561591}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Hotel Camelia is a 5-10 min safe walk from termini train station therefore ideal for airport transfer buses, metro, tour buses etc. Very safe area with good choice of restaurants/bars within 5-10 min walk. Small restaurant literally next door to hotel open evenings from 5pm only but food very enjoyable and reasonable. Fairly large supermarket at one end of street good for stocking up as able to store items in hotel room mini bar. Initial contact with hotel via email and they were most helpful. On arrival a member of grou[p was unwell and reception staff with very nice and helped us any way they could. I travelled as 3 friends and were given 1 single room and 2 doubles for single use. Single room was small but spotlessley clean as was whole hotel. Doubles were extremely spacious and all equiped with mini bar, free safe, ample storage, tv, bath/shower, toiletries. For 3* in Rome very good. Only slight issue was single room toilet would not flush but maid got it working and showed us this but next day wouldn't work again! Breakfast fairly simple continental with cereals, fruit, yoghurts, bread/rolls, juice/tea/coffee, pastries and processed cheeses (no meats) but very nice and well stocked all morning (7am-10am). Hotel has free internet access, free tea/coffee all day in reception, lift but no bar and no problem to leave suitcases on check in/out day. Also small toilet area used to get changed in before late transfer back to airport. Altogether very good hotel, pleasant area, helpful staff and spotless! Very good rates available through bookassist.com (approx 60/65 euro per room per night) with small deposit payable on booking and balance direct to hotel at end of stay. Also good late deals on hotels own website. Rome is my favourite city and am really pleased to have found Hotel Camelia as having stayed in quite a few 3* tourist hotels in Rome before I will definately stay here again!", "title": "fantastic hotel - i will go back!", "helpfulness": 1, "user": "happy-holls-cj", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 39422227}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Me and my friend were worried beacause we got such a good price and wondered if there must be something not right. We knew beacause it was near the train station the location might be a bit rough.. However, on arrival at the hotel, I was impressed, the receptionist was friendly and rooms were clean. Some might say the rooms were small but I had no complaints as we were out and about all the time. Local restaurants were cheap and for something more fancy a trip on the metro wasnt far away. It was easy enough to visit all the major sights as the metro was 5mins away. Breakfast was standard and every morning I availed of it. There was a little tea and coffee machine was great to have. All in all I was pleasantly surprised", "title": "Great price , great service and cant say a bad thing about our stay here", "user": "mssmiley09", "date": "August 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39380819}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I highly recommend hotel Camelia. A nice small hotel, excellent service, clean, nice rooms ( we even get a nicer room than before this time). The people at the front desk was very nice and helpful. Still the same people as two years a go when we first stay at this hotel. One morning, we had to go for a day tour very early, and one of them prepared us 2 bags of breakfast (croissant, cookies, orange juice, omelette and boiled egg) so that we won't miss our breakfast. We didn't even ask! :) The location is superb. Close to supermarket, restaurants and 10 minutes walk to Termini station. Would love to stay again for our next trip to Rome.", "title": "Came back for the second time, and still the best", "user": "dahpewe", "date": "August 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 36539868}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Id recommend this hotel to anyone looking for a good base to see the main sites of rome. Placed in between 3 stops on the metro (lines A and B), one of which is the main Termini Station, and maybe a 20 minute walk to the trevi fountain and the pantehon. The rooms arent huge but are more than sufficient, with air con and safe (both of which are free). The breakfast is excellent with Coffee and Juices, Bread, cheeses and Eggs, plus cereals and cakes, and the free internet setup is also brilliant.", "title": "Perfect for a Mini Break", "helpfulness": 2, "user": "jeff1980", "date": "July 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 35655134}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel is just about 10 minutes walk from termini station. On arrival, we were handed over a map of Rome on which the receptionist marked all the major tourist attractions. The staff was very polite and helpful, especially those in the breakfast room. A lot has already been written about the breakfast.The room were nice, clean and comfortable. It was exactly a place where you would like to sleep after hard day's walk in the streets of Rome. There is also free internet service in the lobby.", "title": "Enjoyed my stay there", "user": "madmax78", "date": "July 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 35638825}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The only problem was that it was a bit far off from the major attractions. Termini station is close by from where you can take both the metro lines but if you are staying out late at night(after 12), it is a long walk back and after being so tired you don't really appreciate that.", "title": "Nice hotel - clean and small", "user": "mrmcintosh", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35575428}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This is a great hotel. Only about a 5 min walk from the train station, and close to all of the hop-on-hop off buses and such.", "title": "An oasis of peace in the bustle of Rome.", "helpfulness": 4, "user": "Julie P", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34452793}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The room was remodelled recently. VERY nice!! Clean and spacious!", "title": "Excellent location, friendly & helpful staff - would return.", "helpfulness": 2, "user": "Rome_Lover101", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31958887}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "They don't have a restaurant. We stayed 4 nights and had a free meal included, but you have to walk 2 blocks away to another restaurant at their sister hotel to get it. Not sure I like that, but...", "title": "very good small hotel with excellent service", "user": "celticboySwansea", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 26431474}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 4, "average": 27, "very good": 202, "terrible": 6, "excellent": 191}, "aka": "Camelia Hotel Rome", "slim_ranking": 0.0755905511811}