{"user_rating": 4.5, "review_count": 648, "name": "Hotel Eden", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The duty manager and the staff are probably one of the best I have met. The location is great and the hotel is unique in its own sense.", "title": "Excellent management staff concerned about guest service", "user": "Raviwalia", "date": "May 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 130222336}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "You're probably wondering why I only gave 3 stars. Well, it's just not my scene, that's all. I like modern, chic, minimalist and this is the polar opposite. But that doesn't mean it's bad. On the contrary, the service element was lovely if somewhat too intense for my liking. There was a porter at every corner if you know what I mean. But they were lovely so I really can't complain. If you are looking for that Woody Allen 'Midnight in Paris' feel, look no further. I went for a run around Villa Borghesia which is right beside the hotel - lots of lovely hills and magnificent views of Rome, but it was all those couples making out in broad daylight that made me surmise that Rome remains the true city of love... Back to the hotel. Room I was in wasn't that big and not particularly impressive (when compared against similar type venues such as Excelsior) but again, the service level, such as turn-down service, bedding etc. was excellent. Extras cost the earth but that is the norm around here (€8.50 for a cappuccino). Wifi was €15 but free in the lobby (wow something for free close to Via Veneto...). Room cost around €280 without breakfast so not cheap but many hotels were full. So not bad overall and given handy location, I may go there again.", "title": "Old world feel - Midnight in Paris perhaps?", "user": "Dublin TripAdvisor Member", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 130185013}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I recently spent two days with my family at the Eden Hotel in Rome. I booked the Presidential Suite and yet left with the feeling that I'd had my pocket picked. Below is what I hope is a comprehensive report of my visit so that other readers can weigh up what they are paying for when they consider this hotel.", "title": "Not value for money", "helpfulness": 8, "user": "lg123London", "date": "May 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 129587053}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "1. Airport pick up.", "title": "Lovely looking hotel, off Via Veneto. Great terrace bar.", "user": "CCtravel_12", "date": "May 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0}, "id": 129536940}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Perfectably acceptable, Mercedes Viano and cheerful driver. Nothing more or less than expected.", "title": "Lovely hotel in great location", "user": "Joe C", "date": "May 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129398684}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Salo is the best town on Garda lake, and the hotel is in the center. We stayed in a basic room which was good value for the money. We loved breakfast and roof terrace - both were excellent!", "title": "The best place on Garda lake", "user": "2afrodita", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130848704}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "5 of us stayed and had 3 rooms all of which were clean and reasonablly well equiped. The hotel itself was excellent and the service provided by Mauro and his sister could not have been better. Although on the main road the rooms wre very quite and some had a balcony. As a wheelchair user I really appreciated the facilities in their disabled room. Breakfasts were OK but would have appreciated some fresh fruit.", "title": "M&D May 2012", "user": "Max C", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 130720838}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Six of us stayed here for one night on a tour around Lake Garda. We choose the budget rooms which were excellent value for the money. The room on the top floor is right next to the roof terrace which is ideal for an apro before heading out on the town. The owner has a true passion about the hotel and similar to other reviews gave us an excellent recommendation for a local restaurant. Although only rated as a three star hotel, it puts many more expensive hotels to shame. Very clean, smiling staff, good quality buffet breakfast and more importantly right in the centre of Salo. Of the hotels we stayed in during our week travelling around, we all agreed that we would be more than happy to return to the Hotel Eden.", "title": "Perfect situation in the centre of Salo in a perfect hotel", "user": "ianx17489", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130692938}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We spent two nights at Eden Saló when doing a round trip in nothern Italy. The hotel is situated in the middle of Saló, 100 meters from the lake Garda. This is not an exclusive hotel but that is not a big deal. You have a nice room, with a nice beds, very clean. The only minus could be the shower curtain in plastic. The receptionist (owner?) told everything of interrest upon arrival and also recommended some nice restaurants. We have had a car and even if they had their own parking he gave otther cheaper alternatives to choose from. The breakfast was was excellent for a 3 star hotel. A buffet with a almost everything and very tasty. To recommend!", "title": "Excellent 3 stars - with caring staff", "user": "Two_swedes", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130104266}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Right in the centre of town this charming hotel offers you a perfect room with an amazing view over the Lake Garda - and a balcony too.", "title": "What a view", "user": "stoffer", "date": "May 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 130063265}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "First class Hotel. My wife and I stayed there whilst celebrating her birthday.", "title": "Birthday visit", "helpfulness": 2, "user": "Michael P", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128649687}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "From the moment we arrived until we departed the staff did all they could to help us. The view of Rome from the restaurant was amazing,the rooms were sumptuous and the food, as expected was top quality.", "title": "Excellent hotel, service was fantastic", "user": "Tysin30", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128552164}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Expensive yes but worth every penny.", "title": "A taxing experience", "helpfulness": 2, "user": "vintageman186466", "date": "April 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 128546617}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Great hotel, very good location, breakfast is expensive but the quality of food and service is very high, the view over Rome each morning during breakfast was amazing.", "title": "Perfect Oasis in Rome !", "user": "golftravels", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128479371}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Rooms are very nice, especially for European standard, the hotel staff in all areas are very good.", "title": "Excellent location", "helpfulness": 1, "user": "johncindyaz", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128476026}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Located just a 1-2 minutes walk from the Spanish Steps, this hotel sure has a perfect location for experiencing Rome. Quiet but very central. We stayed here 4 nights, shot lots of photos of both the hotel and Rome, had some real good food and wine here at the La Terrazza restaurant. And this really is a wonderful hotel! Impeccable service, staff always at your disposal if you need them, and the interior really is beautiful. Great beds giving you a good nights sleep, very nice bathroom, and we also had a small balcony. All in all a fantastic hotel, and we are definetely coming back!", "title": "Fantastic place in a great location!", "helpfulness": 2, "user": "erohne", "date": "May 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129340967}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Just spent 4 nights at the Hotel Eden. It is located a 5-10 minute walk from the top of the Spanish Steps. Since it is at the top of the steps, you have to climb the steps or walk up a steep street to get back to the hotel. If you like to walk, but cannot handle steep hills, this is not the hotel for you. The hotel is a 5 star hotel and has prices in line with it's rating. The room service menu doesn't have prices listed. I guess if you have to know the prices, you probably can't afford it anyway. They do have free wifi in the lobby but charge approx 11 Euros per day to have WIFI in your room (and I think that is per device). The staff is very polite and helpful.On our final night the concierge arranged our transport to a very casual trattoria across town. The recommendation was great and the transportation couldn't be beat. The only negatives were that the air conditioning was just good enough, and it was only in the upper 70's outside. The bed was the biggest complaint. It was very hard. I was expecting a luxurious bed at such a nice hotel. Instead, we found the bed to be very hard and not what you would expect from a hotel of this caliber.", "title": "Great location, beautiful atmosphere", "helpfulness": 1, "user": "Travel-from-GA", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 129196741}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This hotel is in need of updating it's heating/A/C system. We had to keep our windows open (but first we had to change rooms for an inside room) to get cool - temps were in the mid 70's - 80. Our first room had no cabinet or drawers for our clothing only a hanger closet. This is a 5 star hotel that doesnt act like one. The concierge wouldnt help us get seats for our return flight home to FL. He did, however, pick nice restaurants. The morning buffet was average with lots of fruits. The cheese and meat selection was minimal. The soupy scrambled eggs were there everyday. There was never a variation in the menu. We were there 11 nites and basically lowered our expectations. There were few Americans at the hotel. There were large Japanese groups and some German and Italian visitors. The furniture and lobby seem dated and have not been updated since 1999, I believe. The view from La Terrazza breakfast room was fabulous. Some of the staff seemed interested in their guests. Others stood around texting.", "title": "No air conditioner or no heat; the manager chooses your options", "helpfulness": 1, "user": "nycgalFlorida", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 129084271}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The Hotel Eden is just off the beaten path a couple of blocks away from the Spanish Steps which is a blessing since it is also away from the hussle and bustle which is a nice break after walking with the crowds 8-10 miles during our stay. The Hotel was clean, very comfortable and had great views of Rome, especially St Peters cathedral. The 6th floor restaurant overlooked the city and every seat had views through the panoramic windows. We ate breakfast every day in the restaurant and there were plenty of choices for everyone: croissants, mazzerella di buffalo, goat cheese, and plenty of fresh fruit. We enjoyed evening cocktails but no dinner although the menu looked very appealing. The staff was very friendly and helpful in every respect. An amusing site was watching 3-4 staff members eagerly packing and repacking our rental car at our departure to Sienna to ensure we had a comfortable ride! All the while I could imagine them thinking, \"I wonder why Americans travel with so much luggage?\" :-))", "title": "Great Views, Great Location!", "user": "Leonard C", "date": "April 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129039049}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Had a truely wonderful 3 night stay at the eden, from the moment we arrived at reception the service was faultless. Our room was beautiful and spotlessly clean, with everything needed to enhance our stay. The restaurant was amazing with the most fabulous and inspiring views of the city!! Breakfast was a treat to look forward to delivered with outstanding service, and attention to detail, by friendly and professional staff.", "title": "magnificent!!!", "user": "liney138", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129023907}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I stayed at Hotel Eden for three nights with my boyfriend. We had a room with a sea view, really nice. The owner, Patricia, will do everything to make you feel at home. She's so kind and speaks italian and english fluently. The hotel is in the centre of Juan les Pins, you'll find lots of restaurants and Patricia will give you advices about what to do and see.", "title": "Totally Advised", "user": "LauraHoneychurch", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115951279}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I'll definitely come back.", "title": "Cheap and Cheerful", "user": "txex1996", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 115537190}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Hotel Eden is in a perfect loaction just a few minutes walk to the beach. The host was simply lovely, full of smiles and good recommendations for restaurants. This is a two star hotel, so the rooms are not luxurious. That being said, they are spacious and clean. The only negative is that the beds are a bit small and the mattresses are not great. Would stay there again.", "title": "Central location and excellent service.", "helpfulness": 1, "user": "B H", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115477490}, {"rating": 1.0, "title": "They canceled my reservation without notifying me.", "text": "I picked this hotel based on a mix of tripadvisor-reviews, availability and my needs for size of room (3 beds).", "helpfulness": 6, "user": "zeldalola", "date": "July 14, 2011", "id": 115344153}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Upon arriving I was met in the stairs by Priscilla who offered to help me carry my luggage up the 3 stairs. (There is no lift there, and this is one of the few drawbacks of the hotel).", "title": "Great stay", "helpfulness": 1, "user": "prebenel", "date": "April 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 105356992}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Being a long-term visitor of the Cote d’Azur due to my business, I stayed most of the times in a couple of hotels in Cannes. After realizing that my last hotel had doubled their prizes over a couple of years, I decided to have a look in the surroundings of Cannes and found this amazing place in Juan les Pins. Amazing merely because of the family who owns it. They make you feel at home and take care as much as they can. Coming back late from Cannes there’s always someone to greet you although you have a key to the hotel. Daughter Patricia is behind the reception and is a great help in whatever you want. The rooms are in Provence style and offer all the comfort you want. I’ve just booked for my fourth stay and really look forward to it.", "title": "At home abroad", "helpfulness": 1, "user": "Cees v", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117414002}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Juan- les- Pins is sandwiched between Cannes and Antibes, and this little hotel was a wonderful find and a great way to end our vacation in France. Hotel is one block from the beach, and we had a sea view from our French windows. Clean, comfortable, good thick towels, and daily room service. Patricia, the owner, speaks English, as does her lovely daughter, and are both very gracious and helpful. Continental breakfast is served in a flower-bedecked garden, and internet is free. Next door is a boulangerie where you can buy mouth-watering pastries and bread (which we ate in the garden one afternoon). Patricia stocks a closet with umbrellas, beach chairs, mats, etc., which were invaluable as some of the beaches are private and can be expensive. Free beaches a few feet down were crowded, but you are on the French Riviera! You can take local buses for 1 euro to Antibes and Cannes; we took the #250 bus to the Nice Airport for 8.5 euro, saving cab fare.", "title": "So sorry to leave you...", "helpfulness": 2, "user": "dolomary", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117126135}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Canot say enough about this hyperactive town, and the Eden Hotel. Loved every minute. Hope Patricia reads this review so she knows how glad we were to have chosen her hotel.", "title": "Excellent value & very friendly, helpful staff", "helpfulness": 1, "user": "iain b", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117121806}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Ideally situated near the beach, shops, restaurants, bars and station, the hotel is just a few minutes walk from anywhere in Juan-les-Pins and just seconds from the sea-front. You can borrow parasols and mats for the beach and they serve continental breakfast until late morning for 7 euro and they have free Wi-Fi in the rooms. There is no lift in the building and reception is on the 1st floor", "title": "Very friendly, great location, would stay again!", "helpfulness": 2, "user": "hjiha", "date": "August 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116453302}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Although it is a 2 star hotel, it is better than most of the 3 stars that we have stayed in (and a couple of 4 stars) and Patricia and her family will do everything they can to ensure that you have a pleasant stay. It seems to attract a lot of repeat business, which says it all.", "title": "Excellent service", "helpfulness": 4, "user": "oro2", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 116442654}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My wife and I made our way from Paris on the TVG. It was quite an experience as I had never been down the French Riveria.", "title": "Great location and feels like home", "helpfulness": 2, "user": "TravelWorldXpert", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126031872}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "When we arrived to our hotel we were greeted like family. This was very exciting to us as we had unpleasant experiences in Paris. The caretaker brought us to our room and shared information about the local area.", "title": "Great choice on a tight budget", "helpfulness": 2, "user": "JoeUtica", "date": "October 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 118818827}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The room was a bit outdated, however very common in Europe. The beds could have been better, but the stellar service made up for it. The location is key as the coastline is steps away from the front door with many shops and restaurants.", "title": "dont miss this hotel", "helpfulness": 1, "user": "francophiles491", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118647455}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We will be returning in the near future!", "title": "Excellent Location, Price and Service", "helpfulness": 4, "user": "David L", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118273898}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "France is expensive. Hoo, boy! Nothing like those 6-Euro Coca-Lights (translation: an $8 Diet Coke!). The Hotel Eden isn't fancy, but it's safe, clean, and smack in the middle of the Riviera, at an affordable price. The beach is two short blocks away, viewable from the hotel if you get the right window. Turn left at the boardwalk, stop at the first restaurant you see, and order the vegetarian wok dish, which will be among the best things you ever tasted (I am not a vegetarian) -- and under E10! Streets filled with cafes are another block or two away. The train station is three short blocks in the other direction. You can be in Cannes in 10 minutes, or better yet, Eze in 30. And if you like to walk, Central Antibes is 30 minutes. A coin laundry is next to the train station. But the best part is Patricia, who runs the joint. Her parents bought the place in the '60s, and she is happy to share her knowledge of the area, in very good English. Parking is available, although you'll want to dump the car in her underground lot and leave it. A car is a pain in these parts. All in all, this is the place to stay in this part of the world unless you really can afford those $8 Cokes.", "title": "Great value, and wonderful service", "helpfulness": 1, "user": "Sarah R", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117726530}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This little hotel was a great find. My husband and I loved the one night we spent there. Patricia and her daughter were most helpful - letting us know where to find the public beach, loaning us an umbrella and beach towels. Our lovely room had a sea view. They also recommended a wonderful seafood restaurant where you could eat on the beach. A great stay - we'd love to return!", "title": "Great find!", "user": "Sron", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133856483}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "I attend Cannes Film Festival every year and have stayed in a few hotels but will definitely make this my first choice from now on. The hotel is in a perfect location in Juan and Juan is the perfect location for Cannes. It's just a short train ride away and it's often a relief to leave the madness behind! The Eden is clean and friendly and reasonably priced (though everything on the French riviera is expensive), but the best thing about the Eden is Patricia. She is a real gem. She does everything she can to make your stay as nice and relaxed as possible - and she doesn't seem to stop working.", "title": "Definitely coming back!", "user": "Alex I", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133379281}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This IS a 2 star hotel - small room, dated furniture and worst of all very thin walls - hence 4 not 5. BUT - and it's a big but - location is great, proprietor as previously mentioned could not be more helpful. She provided map, restaurant suggestions (some better than others), and drew us a map to get to the airport bus. The room had a sea view and efficient double glazing, the shower was good, the bed comfy. Didn't have breakfast @ 7.5 euros, so can't comment, but all in all would definitely recommend this hotel.", "title": "GOOD hotel", "helpfulness": 1, "user": "chocsEdinburgh", "date": "May 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 129413748}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "From the moment I arrived, I knew I'd made a great choice. The lobby is clean and nicely decorated. Although there is no elevator, the owners quickly meet you to carry your suitcases up the stairs. I was pleasantly surprised by my room, new decor, comfortable bed, plenty of shelf space to unpack, tall bright windows. I didn't need to visit the Office of Tourism, as the kind proprietress gave me a map, marked my bus stop and how to get to anything I needed. Really the best part of the place are the owners. Just ask, you will have the local tips for anything you want. Windy day? They will tell you the best beach to be out of the wind. Plus they lend out any beach equipment (beach towels, toys, etc) you might need.", "title": "Hospitality, Location, Comfort and Class!", "helpfulness": 2, "user": "cyclopsina", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129325405}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The beach is a block away, as is the bus. The train station is maybe a three minute walk? No need for a taxi. Great pedestrian area a couple of blocks away with many restaurants. Antibes just 10 minutes away by bus. And there's a wonderful bakery right next door. My favorite thing was the walk around Cap d'Antibes. Don't miss that!", "title": "Great hospitality & location!", "helpfulness": 1, "user": "Cindy L", "date": "March 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126215009}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This hotel was a real find, so much so that I really want to keep it to myself! We loved our stay in the large family room with fully furnished terrace so much and we could not fault the friendliness and helpfulness of this family run hotel. From initial email contact to checkout our experience was excellent.", "title": "A Real Find", "user": "poet123", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 144725449}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Mauro was wonderful, as was his sister, they truly understand the essence of hospitality and nothing was too much trouble. The family room with the terrace was a real delight, and although at first we felt a little exposed sitting out there we soon realised that the windows which overlook it are on the interior corridors and are well curtained so that you are in fact quite private. I don’t think this room is advertised well enough on the website as we were very pleasantly surprised by its outdoor space and furnishings. The furnishings in the room were functional and everywhere was extremely clean. It may not be the most up to date hotel, and it does lack “style” but everything worked well and we were happy with it all. Often hotels are style over substance, here you got a good base to stay, good food, more than adequate accommodations and personal service. We loved it, and I must say here that we travel a lot both for business and pleasure so we are reasonably qualified to make comparisons.", "title": "good reasonable priced hotel", "user": "wpttb", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 141683231}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Breakfast is plentiful and includes cooked to order eggs in addition to the usual continental offerings. The dining room is dated but it has a lovely outside terrace and attentive service so that aspect really didn’t bother us. Parking is a slight issue, none at the hotel and very little in the immediate area aside from an expensive municipal car park. However, the hotel does have an arrangement with a car park reasonably close by and this was where we parked for the duration of our eight night stay. We were very surprised how reasonably priced this option was.", "title": "Great little hotel", "user": "teufelkind", "date": "August 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137538753}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The location of the hotel is excellent, close to the archway leading to the old town, and also close to the Lakeside promenade with its plethora of restaurants. We travelled around in the day time to various other lakeside locations and the theme parks (we had our 15 year old son with us!) and then in the evening returned to base, ate out at a local restaurant and then retired to our terrace with a bottle of wine to while away the hours. We loved it.", "title": "A beautiful honeymoon in Salo", "user": "Balazs N", "date": "August 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 137139040}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "In short we had a fabulous (and very reasonably priced) holiday with Mauro and his staff at the Hotel Eden and wouldn’t hesitate to recommend it to others who want good rustic accommodations in an excellent location at a fair price. Thanks Mauro, we will be back.", "title": "Fantastic break", "user": "David R", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137131978}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Had a great stay here recently. The hotel was very clean and modern with an excellent central location of Salo. The staff were very friendly and very helpful and made us feel welcome all the time. There was a wide selection of foods for breakfast to suit all needs and this again was of good quality.", "title": "Highly recommended", "user": "Tel7", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132256405}, {"rating": 4.0, "title": "great value", "text": "Would highly recommend it to others and hope to return soon.", "user": "elfbigblue", "date": "June 17, 2012", "id": 132159314}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We thought we will stay for a day, end up staying 2. Clean, quiet and owner is very attentive and committed, very good breakfast and also car parking for your car provided which is bit problem in Salo.", "title": "Loved it!", "user": "chrissymay", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132050795}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We have just spent 8 nights at this hotel and loved everything about it! The owners themselves are so helpful and friendly, you instantly feel at home there. We booked a standard room and it had everything we needed, including a little balcony with table and chairs. The free safe was a bonus as often they are to be paid for. Nice toiletries and fluffy towels in the bathroom too. Breakfast excellent for a 3* hotel, all sorts to tempt you - cereal, fruit, different breads and croissants, jams, ham, cheese, sausage, eggs cooked to order, even little tubs of Panna Cotta, Creme Caramel and cakes if you have a sweet tooth like me!", "title": "Very Pleased", "user": "TravelJenn1", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131510321}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The location is perfect on the edge of the old town and a short walk from the lake. Plus it's only a short walk to the bus stop for visiting other towns along the west side of the lake. A walk along the promenade brings you to the ferry if you want to visit the other side of the lake.", "title": "Just great!", "user": "pamatu049", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131460817}, {"rating": 4.0, "title": "Loved Rome but only Liked the Eden", "text": "I so wanted to love this hotel, in fact Inhave friends who recommended it strongly, and I had a hard time choosing where to stay in Rome, but at the end of this experience, it was a very good property in a very good location with good services--- BUT this is not a five star spectacular incredible hotel by my standards.", "helpfulness": 3, "user": "NomadicNina", "date": "May 25, 2012", "id": 130601004}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The good: perfect location, well cleaned rooms, terrific restaurant staff, great views from restaurant as everyone talks about.", "title": "Fantastic hotel in great location", "user": "Marion888", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130567246}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The great: fantastic dinner in restaurant--a meal superbly conceived, executed and prepared--delectable and five stars! Worth every penny!", "title": "Excellent Service", "user": "Pam K", "date": "May 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130440473}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The disappointments: concierge desk overworked and understaffed and not exceedingly helpful, the deluxe rooms small with nonexistent closet/drawer space (hello! I am shopping in Italy!), the breakfast offerings slim and only okay.", "title": "Wonderful Time", "helpfulness": 1, "user": "Mello_Rowe", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130381215}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The reality: my tenacity and refusal to accept \"no\" for an answer eventually led to suite upgrade which made enormous difference; however, many other Platinum AmEx guests were grumbling and unhappy with rooms.", "title": "Beautiful & Friendly", "user": "Oliver578", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130354749}, {"rating": 1.0, "title": "Don't belive the other reviewers", "text": "This is a 2 star hotel at best. It is absoulotly terrible. The room (standard) was really small, no place for luggage, you have to put them by the side of your bed. The shower has no furniting, no place to put anything down. Avoid this hotel.", "user": "E_128", "date": "April 9, 2012", "id": 127535024}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "We stayed here for 3 nights the hotel was in a perfect location easily accessible if traveling without a car and relying on public transport.. The breakfast was excellent and the staff were all very friendly and helpful to all of our needs.. would most defiantly stay here again thanks for a great few days", "title": "Excellent hotel", "helpfulness": 4, "user": "Laurswilf", "date": "October 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118905687}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Could not wish for a better hotel. Fantastic position right next to the entrance to the old town and only 5 minutes from the beautiful lake promenade. The staff are so friendly and helpful and even recommended and booked restaurants for us that were excellent and good value for money. Although basic, the rooms were clean and new towels provided each day. We opted for a Comfort Double, which was more than adequate for our needs. For us this hotel offered superb value for money and Salo is a fantastic place to use as a base. The breakfast was also excellent and can certainly set you up for the day. We will definitely be going back and recommending the Hotel Eden to friends and family..", "title": "Fantastic Hotel - Def use again......", "helpfulness": 3, "user": "KevandJan18", "date": "October 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118870961}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Salo is one of the prettiest resorts on Lake Garda and this hotel is very conveniently situated just 2 minutes from the promenade. We arrived without having reserved car parking in advance but the receptionist helpfully explained the options for parking & we easily found free street parking just minutes from the hotel. The room was lovely, with a balcony, TV and air con & the bathroom was huge & brand new. Breakfast was delicious with plenty of hot & cold choices & the chef was always on hand making sure everyone had what they wanted. A lovely hotel & good value for money - would happily stay there again.", "title": "Hotel Eden, Salo", "helpfulness": 3, "user": "Karen C", "date": "September 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118330943}, {"rating": 5.0, "title": "All the good comments are true!", "text": "....particularly about the location, the courtesy and helpfulness of the proprietors and staff, and the breakfast. The local wine deserves a mention too. We've been there two years in a row, and will be back.", "helpfulness": 3, "user": "nickmcw", "date": "September 10, 2011", "id": 117908757}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 5, "variance": {"poor": 24, "average": 46, "very good": 153, "terrible": 20, "excellent": 405}, "aka": "Hotel Eden Rome", "slim_ranking": 0.055905511811, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "More that 120 years old but the Eden does not \"look its age\". The Eden true soul resides in its rooms and suites, planned so as to create just the right balance between interior architecture and decor. Individual, elegant and refined, our rooms offer the ultimate in comfort and luxury, and provide breathtaking views of Rome."}