{"user_rating": 4.0, "review_count": 364, "name": "Hotel Odinsve", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "stayed at the odinvse in March 2009. We had a standard double, but had asked for a quiet room with a view - which we got. Our room wasn't large but had a conservatory like window extension to it which gave us a nice view. The beds were very comfortable, probably the best I have experienced in a hotel!! We stayed across a Friday and a Saturday night and didn't hear any noise. It is literally a 5 min walk to the main shopping street. Rooms aren't large (unless you get a deluxe) but we found it adequate and also had a decent size bathroom (our room also had a bath) - not all the rooms have a bath. Breakfast was a typical continental affair but the hotel was happy to do an early breakfast for day of departure/early trips etc. Reception also extremely helpful with booking trips etc (and if you book with reception for reykjavik excursions you get a discount). Would stay here again.", "title": "a quiet central hotel", "user": "ss15", "date": "April 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27268852}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "To reiterate the other reviewers, the location of this hotel can't be any better. It is a block away from the main shopping strip in the center of town. But it is off on the side street so it is very quiet at the same time. As Reykjavik downtown is relatively small, being in a central location affords great convenience for shopping, and visiting the restaurants and bars.", "title": "Location can't be beat, free internet and suites!", "helpfulness": 1, "user": "Beckett", "date": "March 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 25758431}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "We stayed in a suite as we had three adults and they were easily able to accommodate us. Our suite had a small living room upstairs with a fold out sofa bed and it proved perfect as we all had the privacy of sleeping on our own beds on separate floors. The room itself was fine and my only complaint would be the size of the bathroom, especially the shower stall. It is so small that you could not raise your arm without bumping your elbow into the glass.", "title": "Rent the apartment", "user": "marysia48", "date": "January 17, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 23631793, "likes": {"liked": "— Location and quiet", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "The hotel provides free wi-fi and it proved invaluable. They also have a desktop computer near the lobby for guests. The morning buffet provides a good spread of cereal, fruits, bread, and smoked salmon.", "title": "A satisfying experience", "helpfulness": 1, "user": "julechkaNY", "date": "January 5, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 23301616, "likes": {"liked": "— Location", "disliked": "— Size of bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The one improvement I would suggest for the hotel is to update its online reservation system as having a robust and secure system should be a must for a hotel of this class. Other than that, we would definitely recommend this hotel to anyone visiting Reykjavik.", "title": "Excellent hotel in the centre of Reykjavik", "helpfulness": 1, "user": "MrMatthew", "date": "December 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22468779}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Had a lovely time in this hotel, room was huge, staff friendly and efficient.", "title": "Great hotel, good service.", "helpfulness": 1, "user": "woodymark2", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31208073}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "Only advice is to take ear plugs if staying on a Friday or Saturday to protect against the weekend revellers (this is the case with any hotel in Reykjavik). Also, if travelling in the summer (mid May onwards) take an eye mask as none of the hotels I stayed in had good curtains and it doesn't get dark. Parking was no problem as their is plenty in Reykjavik.", "title": "GREAT value, great service, nice room w/ window", "user": "somegirlwhotravels", "date": "May 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29727572}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Reykjavik is a lovely city, and would go back in a heart beat.", "title": "Good Location - nice hotel does what it says on the tin!", "helpfulness": 1, "user": "HolidayingTracey", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28686939}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I really enjoyed my stay at Hotel Odinsve! Breakfast was included, which was actually awesome compared to the free hostel breakfasts I've had on the rest of my trip. The room was nice and had a window, which is great, and a door which if I wanted to I could walk out onto the terrace area (though the wind was pretty strong and it didn't have a door handle on the other end so I could've potentially been locked out so I didn't really do it). It looks pretty extravagant on their website but it was nice and humble and down to earth when you get there, smaller than their site makes it seem for some reason. Free Wifi, which is great, but it didn't really work for me in the room, I had to go down to the lobby (but I was using my iPhone which has weaker wireless abilities than a laptop so you may have different luck with a computer). They also had a computer for public use, which was nice, but it was old and very laggy and didn't work for me when I was there. Everyone speaks English, which is amazing. If you want to go somewhere they'll book everything for you.. really great service actually! I was impressed, I thought I'd have to figure everything out on my own but they were able to book me the Blue Lagoon, and a bus to the airport, as well as tell me what good sites to see in Reykjavik. They gave me an awesome impression of Iceland and because of them my stay was fabulous and I definitely want to go back. They are very nice and hard working. I would highly recommend this hotel, it was great for me.", "title": "Good location, clean and friendly hotel although not a 4 star", "user": "PlantHead", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28340523}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "The hotel is in a good location only about 5 minutes walk from the town. Mind you Reykajvik isnt that big so probably anywhere would be classed as central. The staff were very friendly and helpful and booked dinner for us and confirmed our trips. The hotel was very clean and they upgraded us to a room with a balcony over looking the main town. Breakfast was basic but there were enough mini crossants to keep me happy and the tea was nice and hot.", "title": "I had a great time!", "user": "nab1", "date": "April 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27457801}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Stayed at Hotel Odinsve with wife and baby daughter for six nights. Very positive experience. Terrific location - central but off the main streets. Nice comfortable junior suite. Good breakfasts (fresh fruit, variety of breads, pastries, etc.). Friendly staff, a bit scattered at times (e.g. we were nearly charged for a restaurant meal we never had - room numbers were confused). Nonetheless, staff were helpful and accommodating. Overall a wonderful stay.", "title": "Excellent boutique hotel, friendly staff, great location", "user": "hgdf56", "date": "October 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20592561}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Stayed at this hotel with the family for 6 nights in August. Hotel is in a quiet area but only 5 minutes walk from shopping and bars. Rooms and bathrooms aren't huge but are pefectly ok. Hotel is clean, beds are comfortable and breakfast is fine. Breakfast is buffet with fresh fruit, pastries, meat, fish, eggs, cereals etc. we had one evening meal there which was very good. Modern european style food, vegetarian daughter was also impressed. Cheapest wine was about £60 so we passed on that. We had two rooms on the top floor with a joint balcony overlooking the city and the sunsets. We had a hire car and the hotel doesn't have a car park but there is plenty of on and off street parking if you search around. Staff are very helpful and friendly. Reykjavik is a great city, compact with loads of restauarants and bars. Iceland is expensive but excellent, save up and go.", "title": "Quiet hotel near city centre", "user": "vegetarianoption", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 19576547, "likes": {"liked": "— Location", "disliked": "— Room size"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We had a room on the top floor. The room was well furnished and the bathroom was not large but big enough. There was a balcony around two sides of the room. It was nice to be able to look out from the balcony over the city in the fresh air. The hotel is in a quiet residential area, but only a few minutes walk from the main shopping and eating area. The staff were friendly. Breakfast was average. Hotels are expensive in Iceland and I have no others to compare with but we were happy with this hotel for 3 nights. When we were there, there were 20 hours of daylight so maybe heavier darker curtains would be good in the room instead of the light ones.", "title": "Comfortable in a quiet central location", "user": "ThatsNotMyNameOk", "date": "August 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 19346878, "likes": {"liked": "— Comfortable, quiet & central", "disliked": "— Thin curtains"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We stayed at the Odinsve and the hotel staff could not have been more helpful or efficient. Everything was seen to straight away with a smile. As for the previous review moaning about the haunted room, well we stayed in that room for 4 nights and there was no problem, believe me!! The lovely girl on the desk had never heard mention of a ghost (as mentioned in the lonely planet guide) and she photocopied the guide to show to other staff as she couldn't quite believe it!! As for the room being small, well I thought it quite spacious compared to others I have stayed in in other European countries. The beds were incrediably comfortable and everything was exceptionally clean. Some things eg handbasin etc may be getting a bit old but this is really a traditional hotel it is NOT your Hotel 101 ultra modern.Our room had a shared terrace with another room on the same floor but these were the only 2 rooms that did. It was not a problem, it was quite nice to have the doors open in the evening as it was quite warm, but if you didn't like it there were always curtains to draw. Our teenage children shared a smaller L-shaped twin with beds down each end which suited them being away from each other. All in all a traditional hotel in a nice quiet part of town, very peaceful after a very active day and evening, convenient for everything and any faults you could find were fully compensated for by the absolutely excellent staff who were really friendly and would organise you virtually anything!", "title": "The only spirit was that of helpfulness!", "user": "V0yager1", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 18724444, "likes": {"liked": "— Great staff", "disliked": "— Stuffed ducks in the corridor!"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We spent four nights here at the end of a cruise. The guidebooks are high on the hotel, but apparently the people who wrote that stuff never stayed here. The location is good, the staff was nice, and the neighborhood is quieter and more pleasant than some other places where hotels are located. But the room was very small and had only one chair, the bed wasn't real comfortable, the bathroom was tiny, the television wasn't worth much, the ventilation wasn't good, and the breakfast buffet wasn't much. The rate was around $300 US, and you'd pay more at a number of other hotels. If I ever return to Iceland, I'll consider one of them. But we really liked Iceland overall.", "title": "Less Than Expected", "helpfulness": 1, "user": "bigredjohn", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 17671114, "likes": {"liked": "— location", "disliked": "— the room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We spent four nights at Hotel Odinsve and had a wonderful stay.", "title": "Friendly Odinsve", "helpfulness": 1, "user": "TravelCommentator", "date": "December 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22375350, "likes": {"liked": "— The staff were very helpful, handy location", "disliked": "— There was a bit of noise from the restaurant below room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "All the requirements sought in a hotel were met: nice, clean rooms, good location, good value for money, good food and great staff.", "title": "Great location!", "user": "KiwiGirl29", "date": "November 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22300505, "likes": {"liked": "— Location", "disliked": "— Small shower"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "The staff were very friendly and most helpful in providing tips on Reykjavik.", "title": "Perfect and quiet hotel at the heart of Reykjavik center", "user": "Alabastros", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21449897}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The location was a 5 minute drive to the bus station and a 3 minute walk to the main shopping area and plenty of good bars/restaurants (which the staff kindly recommended).", "title": "This is an ideal base for seeing Iceland", "user": "Bossiemossie", "date": "October 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 20894484, "likes": {"liked": "— Location", "disliked": "— Nowhere to unwind"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The breakfast food was good and the restaurant looked very nice although we didn't eat dinner there; it was busy each evening with both locals and tourists.", "title": "Perfect Location!", "user": "acrn05", "date": "October 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20859469, "likes": {"liked": "— Location", "disliked": "— Nothing"}}], "location": {"country": "Iceland", "region": "Capital Region", "continent": "Europe"}, "stars": 4, "variance": {"poor": 18, "average": 58, "very good": 173, "terrible": 6, "excellent": 109}, "aka": "Odinsve Hotel Reykjavík", "slim_ranking": 0.588235294118, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}