{"user_rating": 4.0, "review_count": 62, "name": "Hotel Sao Joao de Deus", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "On a recent trip through Spain and Portugal we spend one night in Elvas at this hotel. I was surprised that our GPS did not list this hotel in their data base and the address provided did not produce a result GPS result either. We had to rely on the old fashion method of stopping folks and asking for directions. Fortunately we received help and finally found the hotel. Without the hotel parking lot this would be a tough place in which to stay. However with the parking it really is a convenient way to visit this medieval walled city. Our room was a bit on the small side, but did provide us with a nice view of the country side. And we were able to smell the orange blossoms in the courtyard below. Our sleep was comfortable and the breakfast the next morning was good. We appreciated the friendly staff at the hotel and enjoyed being able to step out of our door and walk the narrow streets of Elvas. We found a nearby restaurant for a very enjoyable dinner. They just need to make it a bit easier to find.", "title": "Nice Hotel - Hard To Find", "user": "highdesertbadger", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159995441}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We found the guys on reception , especially Louis, very helpful. We had to change our travel plans and the hotel were very accomodating even offering a room with balcony. Unfortunately, we were only able to stay one night in this atmospheric hotel which was originally a military hospital. It therefore has some rooms which are internal -in that they have no natural light.", "title": "VERY GOOD HOTEL", "user": "Kenm007", "date": "April 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157894013}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "It was great just to wander around the hotel and gardens. The hotel is similar to Paradors in Spain and Pousadas in Portugal but about half the cost.The hotel restaurant was closed but there are plenty of reasonably priced restaurants in Elvas and within walking distance.", "title": "Nice hotel, pity about the reception staff", "user": "SolihullBob", "date": "April 15, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157808433}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The room rate included breakfast which could have been better -it was very busy and nobody seemed to be in charge- breakfast is taken in a warren of delightful rooms. The charm of the building outweighed any shortcomings. There was a small indoor smoking area. The room was well appointed - a small problem with the door fixed within minutes.The large car park was almost full when we arrived -it's not supervised so the 'hotel guests only' were probably ignored. Elvas itself is well worth a visit.", "title": "Perfect Hotel in Elvas", "user": "TETE988", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148876896}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "We have just spent a couple of weeks travelling around central Portugal and this was the only hotel where we were not offered help with luggage, or indeed, shown to our room. Pity, because there were two guys on reception and we were the only guests in reception at the time.", "title": "What a discovery", "user": "Ms74", "date": "December 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 146985813}], "location": {"country": "Portugal", "region": "Alentejo", "continent": "Europe"}, "variance": {"poor": 1, "average": 7, "very good": 35, "terrible": 2, "excellent": 17}, "slim_ranking": 0.25}