{"user_rating": 4.5, "review_count": 330, "name": "Hotel Dharma", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Despite a mix up with the rooms (my fault) we had a very enjoyable stay at the Dharma. The rooms were spotlessly clean, modern and a good size (Executive Suite). The bathroom facilities were very good - loved the funky lighting in the steam shower. Being at the back of the hotel, it was very quiet but there was no view - just looks over a small yard and the backs of adjoining properties. The bed was very comfortable, I'm guessing it was a memory foam matress but didn't check?", "title": "Chic, comfortable, great service & good value", "user": "gabsterUK", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143987746}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "The staff were extremely helpfull and friendly - happy to give good advice on booking the attractions, restaurants and help with transport. Wifi was excellent.", "title": "Overpriced", "helpfulness": 2, "user": "rpaulw", "date": "October 27, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 143826214}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Location was actually pretty good. We generally walked everywhere (often aimlessly!) and nothing was too far. We took the Metro to the Vatican (Station is very close by) and ambled back.", "title": "Good accomodation,location &service. Noise can be a bit of a problem.", "helpfulness": 1, "user": "laudanum05", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 143811560}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Couple of tiny things to make it perfect for me. There were no English speaking channels on the TV - not even the obligatory CNN. It would also have been nice to have some kind of a clock in the room. Breakfast could have been more exciting but maybe that's a British thing?", "title": "Nice modern bed and breakfast", "user": "Awesomest", "date": "October 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143809751}, {"rating": 5.0, "title": "better than expected accommodation and great service", "text": "All said, will definitely stay here again!", "user": "Foodgloriousfood88", "date": "October 26, 2012", "id": 143749464}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed at this hotel for a week and we loved it. It's in a great location, you can walk every where, the hotel was spotless and the staff so very friendly. Would recommend to stay at this hotel, it make our holiday even more special.", "title": "Excellent!", "user": "Gemma B", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142222037}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My wife and I thoroughly enjoyed our stay at Hotel Dharma and would recommend it to everyone going to Rome.", "title": "One of the best B&B style hotels I've been to", "user": "travisc826", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142063424}, {"rating": 4.0, "title": "Clean and friendly", "text": "The location is great, only about 2 blocks from a Metro stop (Repubblica). The hotel staff were as nice as any I've encountered at any hotel in the world, especially Carlo, the night manager. He was great at helping us get checked in and fine a good, non-touristy local spot for dinner since we arrived at about 9:00 PM. Furthermore, the location is in a good spot, near the Termini train station and in an area with numerous restaurants. Some of the restaurants are of the usual tourist-trap kind of thing, but there are also plenty of gems to find, especially with the help of the Hotel Dharma Staff.", "user": "Scott G", "date": "October 2, 2012", "id": 141829377}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The rooms are among the best I've seen. I've read reviews saying they're small and that someone \"didn't have enough room to stretch their arms\", which to me is crazy talk. Our room was a suite and had a bedroom on the right and a sitting area and couch on the left. The room is modern looking and the bed is very comfortable. The bathroom is great with a rain-like shower from above and all the amenities I was looking for. And it's en suite.", "title": "An oasis in the hustle and bustle of Rome", "user": "grammycandy", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 141531476}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Overall, Hotel Dharma is a great hotel. I would go back to this hotel every time and would recommend it to everyone who visits.", "title": "Clean, stylish, friendly and great location", "helpfulness": 1, "user": "Nicinici", "date": "September 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141419202}, {"rating": 5.0, "title": "Beautiful hotel, perfect location, and amazing value", "text": "I thought this was a really gorgeous hotel, and it was a really convenient walk from Termini. We stayed in one of the suites with a jacuzzi, which had beautiful, modern and luxurious details, had an amazing view, and was a great price - especially for what we got. Also I thought that the staff was also very friendly and helpfulI. We will definitely be coming back to this hotel next time we visit Rome.", "user": "Lauren B", "date": "October 14, 2012", "id": 142824565}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "This is a hotel that feels more like a private apartment. You enter through a secure private door street level and via the lift rooms are on the third and fifth floor. As the reception is on the fifth you do not pass it unless you need to visit giving the feeling of entering your own private room.", "title": "Could not have chosen better", "user": "Nigel O", "date": "October 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142706562}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We chose to stay in the junior suite on the third floor. The room was excellent shock included a large shower / steam room and wc / dressing area. All lovely and clean nice and quiet and great air con.", "title": "Amazing hotel- a gem in the city!", "user": "janie060763", "date": "October 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142642986}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Location is great only ten minutes from the train station and 100 meters from the underground metro tube station which takes you to Trevi, Spanish steps, popolo and on to Vatican City. You get the tube from the main station to Colosseum etc.", "title": "Friendly staff, good location", "helpfulness": 1, "user": "Jeff G", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142552426}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Overall great value for a high class stay would highly recommend.", "title": "Pleasant Stay and very nice staff", "user": "ren3021", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142414197}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We stayed here as part of our honeymoon. We thought it was fantastic for the price compared with other city centre hotels. We had a jacuzzi in our room and a balcony, which I'm sure you'd pay at least double, if not triple the price for in other Rome hotels. We also liked the modern decor and little touches like mood lighting and a mini bar (although it should be noted that this isn't free, as we naively assumed, because there wasn't a price list!)", "title": "Affordable luxury with excellent service", "user": "jojo21", "date": "October 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 143540950}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The icing on the cake was the outstanding service that we received from the male manager in particular (apologies, I'm terrible with names!) who made us feel at home from the moment we arrived.", "title": "wonderful room, lovely staff!", "user": "sandyandy_11", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143472505}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "All in all a fantastic stay, and one that we hope to repeat in the future.", "title": "Fantastic!", "user": "MsJUT", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143407736}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed at this hotel in October when visiting our son who is currently working in Rome. The central location was ideally situated for getting around Rome, as the metro (which is very simple to use!) is just around the corner and a regular bus stop is nearby. The contemporary boutique style of the room, with clever lighting, made our stay relaxing. The room was spotlessly clean. The buffet breakfast in the trendy restaurant next door was a perfect start to each day. The service that the staff at reception (Daniella), the manager, and also the chap serving breakfast in the restaurant (I don't know his name) was exceptional, very friendly and attentive. we have stayed in many hotels but this was the best service ever. I can honestly say that the people working here genuinely cared about us having a great stay. Would love to return again, thank you.", "title": "Chic and Comfortable", "user": "Nuno_Rocks", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142902653}, {"rating": 5.0, "title": "Great hotel friendly staff", "text": "I really love this hotel - great staff, convenient to Termini and Republicca stations and very clean rooms. My sister and I enjoyed the breakfast served at Cotto hotel. I am sure I will be back and staying again in Dharma on my next travel to Rome. :)", "user": "Nancy R", "date": "October 15, 2012", "id": 142847432}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 1, "variance": {"poor": 1, "average": 14, "very good": 88, "terrible": 1, "excellent": 226}, "slim_ranking": 0.0220472440945, "description": "Situated on 2 floors of a fine 19th century building, Dharma is a perfect accommodation for leisure travelers, looking for a perfect balance between comfort, location and best value for money.Dharma offers accommodation in more room types and suites: every room is different and offers special amenities."}