{"user_rating": 4.5, "review_count": 247, "name": "Hotel Fantasia", "reviews": [{"rating": 4.0, "title": "A steal for the price.", "text": "I got a triple for 47 Euros, reserved only a day or two in advance. Be sure to use their website's reservation system.", "user": "polm23", "date": "April 6, 2011", "id": 103049619}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Even though it was a triple, the room was far from extravagant, but it was a nice place to sleep and they had free unrestricted wireless (SSH works, for example).", "title": "Excellent Hotel, Perfect Location", "user": "PsychLou", "date": "March 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 101107669}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "One catch is that staff are not on-hand twenty-four hours because this is a satellite hotel - it's also a very short distance from the main train station, but the street it's down looks like a back street or residential street compared to the main drag, so it's easy to get lost if you get in late. If you make sure to plot the route from the train station to the parent hotel and from there to this hotel, you'll walk a total of three or four blocks and be very well situated for very little money. I didn't and got a little lost because I got in after dark.", "title": "Excellent value, location and comfort", "user": "Zugmetalli", "date": "March 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 100696098}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Let's get the downsides over and done with first. You have to pay to park. Why on earth they can't include it in the price, or better still not charge (it's not that close to the town centre) at all. There is no lift, which I guess is part and parcel of it being an old building. Lugging a heavy suitcase up 2 flights of stairs wasn't fun. Also, a bathroom that is a wetroom just isn't that practical. On the upsides, the decor is modern and funky and the beds and pillows very comfortable. It's just a short walk to the bars and restaurants in town.", "title": "Nice character", "user": "katherinious", "date": "July 31, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116077482}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Not the bargain we hoped for. Paid through an agency and paid through the nose for a very average hotel. By the time tax and parking were added we were almost at 95 euros. Gripes are no hairdryer in the room, and sometimes no one at the reception to ask for one. One of the windows was right by reception and everyone going to and from could see into our room. I wish that I had paid a little bit more and had gone to a decent hotel this was like a guest house pretending to be a hotel. One the up side the bed was comfortable.", "title": "Good location but wasnt great value", "helpfulness": 2, "user": "JammyNotts", "date": "June 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 2.0}, "id": 114642776}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Put up shortly, this is a great hotel in the quite nice town of Fussen near the border with Austria and the lovely castles. Even if you pay a bit of a steeper price, this will still be worth it. Private, extremely convenient parking, excellent breakfast that you pay for extra (but it's worth it in my opinion). Room decor very nice and atmospheric; we got a big standard room on the top floor with view to the Alps and Fussen castle. Lovely! Other rooms, unless looking over to the parking side (I think these are the minority of rooms) should offer similar gorgeous views. It is very quiet; perhaps the parking and street would be more noisy. Lovely balcony to relax with a great view. Free internet with a good speed even at the top floor (but I use a new mac with a strong wireless antenna).", "title": "Great hotel, location, price, breakfast", "user": "eekandelmo", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 4.0}, "id": 113173536}, {"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "Only downsides - might be steep carrying up the suitcases, but this seems to be the norm in Germany. Pillows are also low quality and do not provide for good enough sleep, but again - this was a common issue in Germany.", "title": "Fantastic!", "user": "Kaori16", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 111464771}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "Overall, a lovely villa, yet another gem of our travels in Bavaria and northern Germany!", "title": "Not the largest rooms, but good location and decent price", "helpfulness": 1, "user": "chasgal1", "date": "April 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 104063349}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We loved our location and the room! The breakfast was wonderful, as well. The hotel is very close to a bicycle rental place, which was a big highlight of our Germany trip! Can't beat the walking distance to the sights of Fussen, either.", "title": "We loved our stay!", "helpfulness": 1, "user": "TJJEFFERY", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116455257}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Stayed one night prior to visiting the nearby castles. Since breakfast was not included, we visited one of the nearby bakeries for morning pastries. Also, several good places for dinner a short walk away. We were happy with the location and the room.", "title": "Good Location", "user": "redrock", "date": "July 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116078256}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Really enjoyed the stay here. Excellent breakfast, good parking. Things may cost a few euro's extra, but its just fine. Easy couple blocks walk to good restaurants.", "title": "Great one night stay!", "user": "europa00", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118040444}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We had a huge room with a really comfortable king size bed and balcony with a beautiful view of Tegelberg and Hohe Schloss. The staff are really friendly. The breakfast was great and kept us going on all day hikes, although it does cost extra. The lounge area was a great addition, with free internet use. The location of the hotel is really good, only two minutes walk from the train station and lots of places to eat (and drink) nearby.", "title": "Highly recommended", "helpfulness": 1, "user": "LittleLarry_31", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117806387}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "To be fair, the room and location was great but...", "title": "False advertising", "helpfulness": 1, "user": "Travelmania79", "date": "September 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 1.0, "service": 3.0}, "id": 117782277}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I travelled with my husband and my parents. I thought I have booked their apartment but I was given a family room with one double bed with 3 single beds in one room. I have checked their booking website again and found out their website does not specify which room you book - you need to book 2 rooms with 4 people to get the apartment. The receptionist said even if we had the apartment, there is no door between the bedrooms. How could they advertise their apartment has two separate bedrooms without doors in between? We ended up paying for another single room for my dad to sleep (he snores loudly). The receptionist did give us 10 Euro discount but still we felt like cheated by their false advertising and confusing booking website. We could have booked two double beds with the money we spend on this hotel.", "title": "Perfect - great concept for families", "user": "coombefarmlad", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117416611}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here for a few nights with 10 people from 10 - 72 years old! The rooms were ideal, with fantastic solutions to fit more beds into the rooms without them feeling overcrowded. The whole hotel is beautifully designed, giving it a boutique vibe, but at the same time with a relaxed atmosphere. It is billed as a budget choice, so there is no restaurant or full-time reception, but everything you need is within a few minutes walk. The staff where incredibly friendly and helpful and the garden is fantastic. The perfect place for a short break in the mountains. (But don't tell everyone, because it is already booked up well in advance!)", "title": "fairy tale hotel", "helpfulness": 1, "user": "catherien", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116812471}], "location": {"country": "Germany", "continent": "Europe"}, "variance": {"poor": 1, "average": 14, "very good": 92, "terrible": 1, "excellent": 139}, "slim_ranking": 0.0555555555556, "description": ""}