{"user_rating": 4.5, "review_count": 70, "name": "Hotel Pension Bosch", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I only stayed for 2 nights in the pension but I found it very, very clean and a comfortable room in an excellent building. I felt that I was in the owner,s home and was treated as a welcomed guest. The breakfast although not a vast choice was well presented and the coffee/tea made fresh for you. The owner gave a map and very helpful directions. The 71 tram which you can get at the bottom of the road takes you into the centre although its quite a pleasant walk of about 20 minutes. The train station is nearby and within walking distance even with a case.This was my first time in Vienna, but I will certainly go back and stay at the Pension Bosch again.", "title": "Beautiful Vienna", "helpfulness": 1, "user": "MyraWestWales", "date": "March 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126345971}, {"rating": 3.0, "title": "Don't, if you like your hot shower", "text": "I stayed in room 5, single. The room itself is OK, small but comfortable. The street is very quiet, didn't need my trusty earplugs to fall asleep. Breakfast quite nice actually. Traditional decor.", "helpfulness": 2, "user": "RomanMR", "date": "December 5, 2011", "id": 121409362}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Now to not so nice.", "title": "Comfortable 'home away from home'", "helpfulness": 1, "user": "Margaret D", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116544607}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I'm a firm believer in a traveller's inalienable right to unlimited amounts of hot water. This place disappoints. Even in perfect conditions hot water last for about 10 minutes, then gradually turns colder. In the morning it's impossible to take a cold shower, probably because other guests got to the bathroom earlier. You are advised to \"wait 10 minutes\", which can of course last indefinitely.", "title": "When in Rome....", "user": "gulietta", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115927720}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Room heat is also provided grudgingly. One night I came to the room late only to find that the radiator is ice cold. Turned off by cleaning staff, apparently. Next morning I put the \"Don't disturb\" sign on the door to prevent ill-meant intrusions. Didn't work. Radiator off on return. Had a little chat with owner about it.", "title": "Great place Great stay!", "user": "speksface", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 114871749}, {"rating": 3.0, "title": "Comfortable and close to the city center", "text": "In actuality, I would give the hotel 3.5 stars. We had one night in Vienna due to a 17 hour layover, and we wanted something on the same line as the airport but close to the city center. Hotel Pension fit the bill. I had printed out the website directions/map to the hotel, we took the S-bahn to the Rennwig station with no issues, and then….. were completely lost. The hotel map did not give any indication which exit to use from the station, and having used the wrong one, none of the streets were on the map. A 5 minute walk quickly turned into half an hour. (Once we found the hotel, it really is a very quick walk to the S-bahn station.) Seems like this could be easily avoided with slightly more descriptive directions on the website.", "helpfulness": 1, "user": "Alybyzrp", "date": "October 20, 2013", "id": 181734772}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We booked the hotel through booking.com, and the website clearly outlined that credit cards were accepted for payment without exception. As we were at the end of our trip, this was perfect as we did not have much cash remaining. Unfortunately, upon arrival, we were told that since we were just staying one night, they wanted us to pay with cash. We clarified that we were going by the instructions we were given and showed how credit card was explicitly shown as accepted, to no avail. Thus, we inquired as to where the closest ATM was - but were not given an answer. In the end, since we had to leave before breakfast, they took pity on us and let us pay with a credit card. If this really is the policy (1 night is cash only), then that should also be specified up front.", "title": "Great location, value for money in addition to cultural and historical experience", "helpfulness": 3, "user": "Stanislava A", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175425599}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Past those two initial issues, we found the room to be large and clean, with very comfortable beds. There was a great city map available and the owner gave us good instructions on how to make a great walking loop through the city center. In summary, we would definitely recommend the hotel, but know upfront about their one night cash policy and also make sure you exit out the right train exit for the map provided on the hotel website to make sense.", "title": "Definitely a good place to stay", "helpfulness": 3, "user": "OhioReiser", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166134126}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "I have stayed in Hotel Pension Bosch while I went on a conference in Vienna. It is excellent value for money combined with the experience of staying in a very clean traditional Viennese house in a very convenient location close to the city. The owners are kind and offer their help whenever needed. I have also recommended it to colleagues who were disappointed with their choice of hotel and they agreed with me after they moved to Hotel Pension Bosch.", "title": "A great value for your money", "user": "EuroJourney13", "date": "July 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165879361}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "My stay here both times was very enjoyable. The location is very good--easily accessible from the airport by public transportation. Just a few minutes walk to trams and Rennweg train station, but on a quiet street. The room (I actually ended up in the same room both times) is clean, fairly roomy, charming and comfortable. The Bosch family is friendly, knowledgeable, and eager to help travelers enjoy the city to the fullest. The breakfast is very nice with good variety of offerings, in a lovely traditional style room. Free wi-fi throughout is an added bonus--fast and strong! It's a great choice when visiting Vienna. I highly recommend it. Next time I go, this is where I will stay.", "title": "comfortable and convenient", "helpfulness": 1, "user": "MaxBV", "date": "June 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164628306}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Our room was comfortable, luminous and warm! Breakfast was complete and tasty, and Barbara always would help us with any thing we would need..........................................", "title": "A good choice in Vienna!", "user": "marianodapia", "date": "April 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 158586941}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Danke schön!! Melisa and Mariano", "title": "Welcoming and Good Value", "helpfulness": 2, "user": "JuJoLondon", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154738023}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The pension appears to be made up of two large appartments in a block. The rooms have high celings, parquet floors and pleasantly old fasioned furniture. We were welcomed by a lady who gave us a city map, leaflets and advice on how to get into town. It looks walkable but we took her advice to walk through the nearby botanic gardens and Belvedere palace gardens before picking up the tram a little later. It was a lovely walk but we got the tram all the way back. The pension is a short walk from the tram stop and Rennweg station where you can get trains directly to and from the airport. Breakfast is a buffet with cereal (good musli), rolls, cold meat, cheese etc. and strong Viennese coffee.", "title": "Nightmare!", "helpfulness": 2, "user": "Mary S", "date": "June 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 132354624}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I would have given Pension Bosch five out of five but the hot water can be iffy in the morning. That said, when the water wasn't hot, we went for breakfast and found the water warm enough for a shower afterwards. There was pleanty of hot water in the evening.", "title": "Welcoming, clean, comfortable and well located", "user": "jasonreggie", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130968044}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "We would happily go back.", "title": "Average accomodation", "helpfulness": 2, "user": "janemcc59", "date": "April 27, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 128944592}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Beautiful building and rooms. You get exactly what you see on their website (rooms are identical, size isn't enhanced in the pictures). The furniture is art nouveau and it seemed in good condition to me. Quiet, amazing personell, they allow pets (the lady of the house was surprised too see we have a dog crate for the night and he doesn't sleep with us on the bed :), and that is rare). Breakfast was very good, not so many things to chose from but good. What i liked the best was that is indeed a pension and not a hotel, you feel like a guest in a friend's house. Loved it.", "title": "Great building and rooms/ pets friendly", "user": "alinutzanutza", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 108031430}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Great location, only a few steps away from S-Bahn (direct from the airport). Walking distance (20-40 minutes) from almost everywhere. Fantastic full breakfast. Clean and comfortable.", "title": "Comfortable, friendly and great for the price", "user": "sbird10", "date": "April 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 104811339}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "Good value for money. I reached the pansion at 1 o'clock in the night, and the owner meet me at that time. The room was clean, and nice. I selected the pansion because there was free Wi-Fi, and it was so. With only small breaks in connection couple of times.", "title": "Good pansion and nice treatment", "user": "TioMio", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89712250}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The pansion is very close to the S-Bahn Stop, Rennweg. I reached it from the airport within 30 minutes. It is a 20 min walking distance to the Vienna Opera House.", "title": "Hotel was OK", "helpfulness": 1, "user": "clogtchr", "date": "July 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 72676709}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Nice coffee in the morning and quite cosy dining room.", "title": "Decent place - excellent value for money.", "user": "a_klein13", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 66646287}], "location": {"country": "Austria", "continent": "Europe"}, "variance": {"poor": 3, "average": 5, "very good": 28, "terrible": 1, "excellent": 33}, "aka": "Bosch Hotel Vienna", "slim_ranking": 0.144414168937, "description": "The hotel is located in a Jugendstil house from the 19. century in close proximity to the Botanical Gardens and the famous Belvedere Palace with its magnificent Barock garden. The city center, with some of Viennas most well known sights such as the state opera, the Burgtheater, museums, concert houses and the Ringstraße, one of the most beautiful streets in the world, is reachable by foot in only 15 minutes. Every morning an extensive breakfast buffet awaits you in our comfortable Jugenstil breakfast room."}