{"user_rating": 4.0, "review_count": 446, "name": "Hotel Les Aiglons Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Property ok, Good value, and an excellent manager in Lara - she sorted a quiet room the night before we went up Mont Blanc so we cold get good rest, and let us use the the spa to recover when we got back down. We'll be back, although might be more relaxed agenda next time.", "title": "Lara is a star", "user": "Jeremy T", "date": "October 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 141868615}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed at this hotel for 4 nights after spending 4 weeks travelling around France. When we arrived we were advised that we had been upgraded to a 'junior suite' which we were really happy about. When we got to our room we were slightly underwhelmed. The room was large which was excellent, money has been spent on the bathrooms but not the rest of the room, but we were happy with the space. The hotel staff were the least responsive of all the hotels we have stayed at, the bar staff were great and ended up giving us the insights we needed to make our stay worthwhile. On the 1st October major works commenced and it was really noisy, the hotel staff were obliging enough to let us check out a day earlier and refund our money.", "title": "Ok but read on", "user": "Ann-Marie C", "date": "October 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141856407}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "From the start, Miguel at the front desk who found a room for us and our three kids in July was wonderful. Room was spacious with a nice modern bathroom. Not in the center of things but just a short walk away. Kids loved the outdoor pool and we did too with the nice view of Mont Blanc. In the confusion (this happens with three kids) we left our video camera at the pool, didn't find it when I returned to look for it but sure enough the front desk staff had it waiting for us. Merci beaucoup!", "title": "Great hotel", "user": "Spyridon", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141664839}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I agree with previous reviewers - everything about this hotel is good: rooms are clean and comfortable, great facilities such as sauna, steam room and pool. We dined in their restaurant - excellent food at very reasonable price. Staff was fantastic. They took time to explain us different options with lifts and mountain train, tickets, passes etc., helped to find laundromat. Nothing was too hard for them. Our special thanks to Ala.", "title": "Excellent hotel", "user": "TravelTO1", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141481530}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "I recommend this hotel as excellent value for money.", "title": "Romantic summer break in the alps", "user": "JoelL52", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 141124554}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Bedrooms a little on the small side, but clean and comfortable.Food acceptable but nothing special. Good location near town centre directly opposite bus stops for free shuttles to ski areas.", "title": "Good amenities and location, but not quite luxury", "user": "NigeH", "date": "January 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150037184}, {"rating": 3.0, "title": "Average Hotel no charm and cold", "text": "Good spa facilities, plus saunas, jacuzzi, and swimming pool, although the latter is outdoor, and whilst heated, if it snows, water soon becomes too cold. Surprised at lack of 'nice' toiletries in bathroom.", "helpfulness": 1, "user": "Nicolas D", "date": "January 19, 2013", "id": 150003441}, {"rating": 1.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Very average hotel. We booked 3 rooms for our family for the WE of the 19/20 jan. So cold in one room that our kids had to ask for an electrical heater. Breakfast in the morning is simple .... and also very average. This hotel is apparently refurbished recently and rooms are OK but with nothing fancy. No minibar which is surprising for what is sold as a 4*. Connectivity is OK but there is a lack of outlets for plugs. The most annoying is this impression that everything is cold in this hotel and cheaply designed. Probably OK if we were in the heart of a main city in Europe but a bit disappointing if you re in Chamonix and look for some authenticity. One final detail which upset me. Only one toilet ... in the lobby area. Imagine the entire hotel going skiing in the morning. Thats where the queue starts.... Overall, if everything else is booked you do not have a bad deal but would advise to look for something a little bit more cozy for that price (220 EUR / night)", "title": "Avoid the spa!", "helpfulness": 2, "user": "Neil R", "date": "January 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 149389123}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "While staying at a different hotel, we came here to use the spa and for a couple's massage. First the spa itself is NOISY and CROWDED. Totally not relaxing or enjoyable. From loud people to kids running around, it was almost comical.", "title": "Basic but good enough", "helpfulness": 1, "user": "Cacahuette2011", "date": "January 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 149344544}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "As for the massage, it was terrible. We each requested deep tissue, and the girls, while nice, barely put even the slightest bit of pressure on our skin. It was like they were simply rubbing oil on us, without any massaging involved at all. I glanced backwards once and noticed my girl glaring off into space, so I cleared my throat to wake her up. Just awful.", "title": "great location but basic hotel", "helpfulness": 1, "user": "liinsh10", "date": "January 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 149152586}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "A clean and contemporary hotel, we enjoyed a week here over Christmas. The standard rooms are small and the walls are quite thin - you can just about hear that people are talking in neighbouring rooms. The bathroom is modern with an excellent shower. The bed is comfortable with good quality linen. There is a TV with BBC 1 & 2 and free wifi.", "title": "A good hotel in a great location with some excellent extras", "helpfulness": 1, "user": "jimandbiz", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 148374775}, {"rating": 3.0, "stay_parameters": "Stayed December 2012", "text": "The hotel offers breakfast which we found excellent compared to the local cafes. We like a cooked breakfast before hitting the slopes and the buffet on offer with eggs, bacon, sausage and hash browns was a real plus. At €15 it's not too expensive for what you get.", "title": "Hotel webpage misleads customers.", "helpfulness": 3, "user": "duran79", "date": "December 29, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 148259552}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "One of the huge benefits of this hotel is the location. Only a 5 minute walk from the town centre, it offers great access to the shops and restaurants. Most importantly however is the fact that is is only 50m from the main bus station in Chamonix that serves all the ski locations in the local area.", "title": "Great location, some great staff, value for money.", "helpfulness": 1, "user": "StephenBell1979", "date": "December 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148224471}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "There is a ski locker room and a spa with hot tub, swimming pool, sauna and steam room. These are all free for guests and were not too busy after getting back at about 4 to 5pm.", "title": "Highly recommend it", "user": "Bonika84", "date": "December 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147993574}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "While the staff are generally friendly and helpful, one particular employee was curt and almost rude on occasion. Don't let this put you off what is essentially a solid hotel. We would stay there again.", "title": "GREAT STAFF", "helpfulness": 2, "user": "Lpkcars", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 147719635}, {"rating": 3.0, "title": "Nice rooms, good location, but spa staff and gym poor", "text": "I booked this hotel due to the write ups and overall it's good but for someone that needed to have a gym whilst away this was a major disappointment.", "helpfulness": 1, "user": "Dave T", "date": "December 15, 2012", "id": 147481791}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "First of all the location - less than 5 mins to the end of the Main Street and close to the bus stop for skiing so both we're ideal. The rooms are a good size with plenty of storage which is needed at the time of year for all the ski gear. Ours went into the eaves through which meant space at one end was very restricted and I banged my head a few times getting things out of that corner.", "title": "tall people be careful", "user": "MartinCanberra", "date": "November 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 145105038}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Breakfast was a buffet and was plentiful with a good selection. The staff in the restaurant and on reception were very good.", "title": "Great location and nice pool", "user": "Shaun321", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 144554823}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Ski storage was excellent as you have your own individual locker downstairs but it has an automated light which is movement activated. Twice when putting my boots on the light went off and I was left fumbling around in the dark to activate th sensor. An accident waiting to happen .", "title": "Nice Hotel", "user": "75Gerry", "date": "November 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144502555}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "However, the first thing was the spa / gym. I train 5 times a week and specifically booked this hotel as it had a gym. I got down there to find that as a guest you had to change in your room and go down as all the lockers were reseved for members. So you have nowhere to put your stuff and if you want to use the gym and then go into the spa you need to go to your room shower and come back which is stupid. I enquired about this with the staff and quite frankly they were abrupt and quite rude. Not what I would expect. The lady I spoke to seemed like she just wanted to get in with her job of sorting out the rest of her day.. She turned out to be the manager.", "title": "Nice hôtel with swimming pool close to center!", "user": "12358132134", "date": "October 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 142198247}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 61, "very good": 184, "terrible": 8, "excellent": 180}, "aka": "Hotel Les Aiglons Chamonix", "slim_ranking": 0.25974025974, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Les Aiglons Resort & Spa with its 107 rooms attracts mountain-lovers and families, both in the summer and winter and a clientele more studious during the mid-season thanks to its spacious seminars rooms. As well as the restaurant and the bar, the hotel offers the services of a genuine mountain SPA, outside swimming pool, steam room and sauna in the garden of the hotel, body care centre and fitness area."}