{"user_rating": 4.5, "review_count": 325, "name": "Hotel Tiber", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "Very modern and clean hotel near the River Tiber, had a water view which was quite nice. Rooms were spacious and very clean. Nice little promenade to go walking after eating at the Hotel restaurant. Food was very good that I ordered, Spaghetti with Lobster but they initially brought out a lobster cracker which I thought was strange but I told the waitress that I wasn't going to wrestle with my food and that the lobster should be already cracked and be incorporated with the pasta. My friend didn't fair so well with her order, her pasta was too al dente so she sent it back and it was still too hard.", "title": "Hotel Tiber", "user": "Cityslicker2010", "date": "May 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 159553534}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The shuttle service was very good and prompt, 6 euros each way to the airport. Breakfast was excellent lots of choice. The location was close to the airport but the surrounding neighborhood wasn't nice to look at however it is ideal if you are staying here for only one night. I would recommend this hotel.", "title": "Modern, Clean, Efficient", "user": "TuscanWino", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159132101}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We used to stay at the Holiday Inn (Parco di Medici) before an early Rome departure, but no more. The Tiber is much closer and a nicer setting for some strolling and experimenting with local eateries. The rooms are of adequate size, clean, and modern. Parking underground is available and reasonably secure (take bags to the room anyway). Breakfast dishes are complete, including eggs etc. Being a Monday, local restaurants were closed, but the food at the hotel was well prepared and quite good. The bar is roomy and quiet. It's a quick trip to the airport, but a little tricky finding the hotel depending on your way into town; as usual, signage in Italy can be misleading.", "title": "excellent overnight stay", "user": "2islandhoppers", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158615023}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed one night prior to our flight out in the morning, and this hotel was ideal. The shuttle service to and from the airport was excellent. The room was large, clean, and quiet, and English TV and free Wi-Fi most appreciated. The surrounding area is very walkable, and it was interesting to watch the fishing boats and see what the \"catch of the day\" was. Swimming pool looked inviting, and the bar and restaurant were very good. Breakfast was excellent. We would highly recommend this hotel if you need an overnight in Rome before or following your flight.", "title": "A great hotel to stay before your flight", "user": "happysanman", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158453102}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We had a harbour view room 410 with balcony, great views of the fishing boats. Room was very new and modern. Bathroom was bright and modern as well. Most comfortable bed and the newest hotel we stayed in Italy. We would definetley stay again, bonus free parking and close to airport, we did eat at the hotel dinner, however would recommend eating at one of the many restaurants close to the hotel for more of a local feel.", "title": "A great hotel near the airport.", "user": "ybml", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158279093}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Very good option when you need to stay near the airports . We spent a lot of time to find the hotel, in spit we used GPS .every thing just new,clean and comfterble. free . Nice view.good value for money.", "title": "Modern hotel", "user": "Eyal L", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154551103}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This hotel is in a very good location relative to Fiumicino Airport. The hotel shuttle from the airport to the hotel was right on time. I suspect that the shuttle only runs at the listed times on the transportation section of the hotel web site, so be prepared if you arrive at other times. The cost of a taxi should not be exhorbitant, especially with two or more passengers, in comparison to the 6 Euro shuttle charge. Plenty of great sea food and pizza places walking distance from the hotel. The hotel is clean and modern. The biggest negative was the totally indifferent front desk customer service in the late afternoon and evening. No real greeting upon check in and he was so busy playing with his computer that my impression was that he definately did not want to be bothered with questions like \"where might be a good place to eat?\" Would I stay at the Hotel Tiber again? Probably. Although their customer service is not the best, especially in the afternoon and evening. Morning front desk staff was better. The breakfast buffet was adequate but not any better than a breakfast at a chain medium priced hotel in the US. The one staff member was also pretty indifferent toward the people eating breakfast. The hotel had no ironing boards in the room and no ironing boards/irons available at the hotel. I guess they don't cater to business people.or people who might want to iron the wrinkles out of some travel clothes!", "title": "Indifferent Customer Service", "helpfulness": 4, "user": "JerryA320", "date": "March 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153617543}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We live in Florence and normally would just train down early in the a.m. before a flight, but with a baby we need to keep things a little less hectic these days. We stayed at this hotel the night before our flight and found it a great choice. Everything was new, modern and clean. Just what you need for a short stay before an international flight. Very close to the airport.", "title": "Perfect for an early flight", "helpfulness": 2, "user": "kcollora", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153520308}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "I had 30-hours in Fiumicino and stayed at the Hotel Tiber, which was a good choice. Very quiet, peaceful area away from the hustle and bustle of Rome. Good seafood restaurants, nice shops to browse in, and right next to the Med. The hotel is very modern, clean and efficient. Pretty good breakfast buffet. One day in the area is enough to see everything. The hotel airport shuttle and the driver were great.", "title": "Nice for one day", "helpfulness": 7, "user": "GatorNation", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153106753}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Rooms are spacious, the view on the canal and the sea is great from the rooms and from the breakfast room.", "title": "Very pleasant stay", "helpfulness": 9, "user": "N D", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 149571977}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at the Tiber one night and the hotel is clean, well priced, comfortable and generally very nice. The shuttle in the morning for our early flight worked wonderfully. The town of Fiumicino was a great place to spend an afternoon just experiencing Italy before going back to the real world. The only difficulty we had was actually getting to the hotel as we had no car and the shuttle from the airport starts running at 4 pm and we were there earlier. Taxis did not want to take us on the short trip. Finally after getting into and out of 2 vehicles the transport coordinator got some van driver to drop us off on his way to Rome for about double the price of the shuttle. I guess the whole airport hotel concept has not yet been fully understood in Italy.", "title": "Very Nice Hotel - trouble getting there", "user": "Humphryg", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 159818179}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed here after a flight which arrived in the evening before travelling to Rome the next day. We had read the reviews on tripadvisor but the photos did not give it as much credit as it deserves. It is where the River Tiber meets the sea and overlooks the fishing boats anchored at the quay. It has a seaside village feel and is very quiet. The breakfast is included in the reasonable tarrif and we were spoiled for choice. It was a buffet style with choices of fruits, cereals, breads, pastries and cooked items. The restaurant had a very fresh decor and was a conservatory style on the roof overlooking the harbour. Another plus is there is a swimming pool - great for relaxing after a long flight as well as a bath in the rooms. We are planning on staying again before our long flight back to New Zealand. There is a shuttle leaving half-hourly to the airport at 6 euro.", "title": "A hidden gem close to airport", "helpfulness": 1, "user": "Waiariki", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159758775}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "A great hotel to spend a few days after a long cruise, The hotel is modern and very comfortable! The staff is more than accomodating. The staff are continuously cleaning and the hotel is spotless, The included buffet breakfast is very good and the food is presented in such a nice way. The hotel is so conveniently located to the Rome airport, the Tiber River and a stone throw from the ocean. Restaurants, Bars and shops all around. Spent three nights before heading home after a long holiday and enjoyed every minute. Would not hesitate to refer friends to choose this hotel!!", "title": "Excellent hotel all round", "helpfulness": 1, "user": "Ed G", "date": "May 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159696445}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We knew there was a shuttle service to the hotel. This was hard to find. We eventually found it at the bus terminal at the airport, only to be told to wait 15 minutes. The same driver came back later with a passenger on board. He could’ve told us to hop on and put our bags in the shuttle, rather than wait for him to come back. No tip for him! The cost of the shuttle is 6 Euros per person, each way, which was good value, considering the airport is about 10-15 minutes away and a taxi driver wanted 35 Euros to take us there. His excuse was that the taxi was going to return empty to the airport…", "title": "Great view and very close to the airport!", "helpfulness": 1, "user": "MelbourneLola", "date": "May 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159668375}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The hotel is new and modern and internet is free. We stayed one night, waiting for our flight to London the next morning.", "title": "The excellent and the terrible", "user": "segredod", "date": "May 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159570740}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is an ideal hotel for a one or two day layover at FCO. We stayed on a recent Sunday and were treated to the parade of locals promenading along the Tiber riverfront walk in front of te hotel. It was great.....we joined them. The hotel is new - well appointed - clean - efficiently run. The breakfast was several times better than the usual cold cuts and cheese that are served at most European hotels. There is a rooftop pool which we did not use, but which appeared to be well maintained with ample privacy. There are a number of closeby restaurants - everything from the generic pizza place to formal dining (see my review for Bastianelli's). The hotel might be considered as a lower cost base for a Rome visit of a week or so. Train service to Rome Temini is frequent and low cost from FCO.", "title": "Well located - clean - efficiently run.", "user": "araho", "date": "April 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157402140}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "We recommend this hotel.", "title": "Very clean, comfortable modern hotel", "helpfulness": 1, "user": "MaltaTeresa", "date": "March 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 156037006}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed at the hotel Tiber for one night before catching an early flight from Fiumicino airport. The hotel is clean, comfortable and very modern. The rooms have all the facilities one would require and there is a free underground car park. I can't fault the hotel in the very least except for the fact that it felt cold and impersonal. I would however recommend it as it certainly is more than adequate for an overnight stay.", "title": "Great value - super clean and convenient", "helpfulness": 1, "user": "golflefty", "date": "March 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 155856980}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "We needed a room before catching our flight the next morning from Rome to London. We didn't want to deal with morning traffic so searched the TripAdvisor engine for something very close and chose this place. Well done fellow reviewers - this hotel is perfect for a pre-departure or early arrival hotel. It is VERY clean and comfortable. Free WiFi, good restaurant and shuttle service to your terminal made it all worth while. For you vacationers who want to have a low-stress arrival/departure hotel before/after exploring Italy - look no further. This is it.", "title": "Good airport hotel for night or two", "user": "me_not_likey", "date": "March 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 155693451}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This is a good airport hotel. I had to sleep there because it had been chosen for a business meeting, personally I wouldn't pick up this hotel. The building is modern, not used yet. The room was clean and spacious; I was lucky because I had a corner room with quite nice sea view. The bathroom was clean.", "title": "near the airport", "helpfulness": 2, "user": "997angie", "date": "March 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155617725}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe"}, "stars": 4, "variance": {"poor": 2, "average": 29, "very good": 128, "terrible": 3, "excellent": 163}, "aka": "Hotel Tiber Rome/Fiumicino", "slim_ranking": 0.05}