{"user_rating": 4.5, "review_count": 1444, "name": "Hotel El Convento", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I choose to spend 2 nights at this hotel to celebrate my sisters 50th wedding anniversary and pre cruise. I wanted something unique and memorable and that is exactly want I got.", "title": "El Convento Hotel in old San Juan was Incredible", "helpfulness": 3, "user": "bpharo", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18270261, "likes": {"liked": "— Court Yard, Food , Drinks, Hospitality, Free computer use w/internet"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We took a taxi from the airport which cost 23.00 for 4 people including all of our luggage. When we pulled up to El Convento Feliciano was there waiting for us as if he knew we were coming. He made us feel so special that we will never forget him. From the minute we arrived we were in awe of the hotel.", "title": "Great Location", "helpfulness": 2, "user": "Citychick_0274", "date": "July 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 17962260, "likes": {"liked": "— The beauty of the hotel itself", "disliked": "— dirty glasses"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "A few months prior to arriving I had requested rooms 216 and 218 because they have actual step out patios. I knew that there was no guarantee that I would get these rooms just because I requested them but much to my surprise I receved an email from the manager himself telling me he would try to accomadate my request and was looking forward to our arrival. This was totally unexpected and appreciated. I was so impressed that the manager would take time to send this email.", "title": "Perfect!", "helpfulness": 2, "user": "wmchica", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17653114, "likes": {"liked": "— Beautiful hotel, well-kept, clean, and good service", "disliked": "— They don't have any king size beds"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Melody checked us in, she was so sweet and helpful. Much to my surprise we did get rooms 216 and 218. We had arrived early about 1:30 pm and 1 room was ready and the other room was almost done so Feliciano took our luggage up to the room that was ready and told us about all the ammenities. We sat in the courtyard and had the best sangrias I have every had. What a peaceful feeling we had sitting in this beautiful courtyard, an unforgetable way to start our vacation.", "title": "Would visit again", "user": "cayci03", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 17420540, "likes": {"liked": "— Location", "disliked": "— Bugs"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The other room was ready within 45 minutes of our arrival. Check in was not until 3PM so we were very excited to get into our rooms early. Our rooms were just as I thought they would be very unique and I am sure with much history. I loved the fact that you could open the outer door for more light and there was an inner glass door to keep out any bugs from the outside. Our bed was comfortable and we had a beautiful patio that had 2 chairs and a table on it, very private. Complimentary bottles of water included daily and a nice flat screen TV. When you walked out of your room there were table and chairs to sit at that over looked the courtyard.", "title": "charming", "user": "Tink1234", "date": "June 30, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 17377766, "likes": {"liked": "— the charm and the location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We are two couples who celebrated our 25th wedding anniversaries with a four night stay in mid-October. Our high hopes about El Convento from other TripAdvisor gurus made us wonder if the hotel could be as great as described, and if we would enjoy it that much. We did! I won't repeat all that others have raved about (charm, cleanliness, high level of service, wine and cheese reception) but will add a couple of other thoughts. We have enjoyed tapas in Spain and can say with confidence that El Convento's El Picoteo rivals the best. The portion sizes are extremely generous and the dishes we tried were exceptional. We ate a second night at El Convento when our daytrip to El Yunque/Luquillo Beach/the Bio Bay at Fajardo (all fabulous and recommended) didn't get us back to the hotel until almost eleven at night. Too tired to go anywhere else, we enjoyed delicious thin-crust pizzas, tomato/mozzarella salads and hearty red wine in the outdoor plaza at Pizza e Birra -- perfect!", "title": "We had high expectations... and El Convento met them", "helpfulness": 3, "user": "boyzmom5", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119570029}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "On Sunday the staff proved why it is consistently complimented on its excellent service. Three of the four of us wanted spa treatments, (my husband wanted to chill by the hotel pool) but the spa within walking distance that they usually recommend was closed. Instead, after some searching, the front desk staff found La Marina, a new spa (open since September 2010) near the port where the cruise ships come in. We took a short taxi there, but hopped on the free city trolley to come back -- just three blocks walk from La Marina. Not only was La Marina clean, and the staff there wonderful, but the quality of our massages was high and they extended a 15% discount to us as El Convento guests! Sauna, cups of tea, ambient music, highly skilled massage therapists... and a break in the already reasonable price added up to a joyful experience. We couldn't have found La Marina on our own.", "title": "Charming", "user": "travelsaroundUSA", "date": "October 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119562023}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Another reviewer mentioned his unhappiness at the fact that we lost power for about twelve hours during our stay, from about midnight until about noon. The rooms remained relatively cool but a bit stuffy. I heard through the hotel grapevine that although El Convento has a small generator, enough to keep the kitchen and public spaces going with lights and fans, that they won't have a larger generator in place until 2012. We woke up that morning, still without power, and decided to take advantage of El Convento's sister resort: La Concha in Condado. Gorgeous! Four pools, a generous sandy beach with attentive cocktail service, more good food on the pool deck by Solero restaurant, clean changing facilities, fun staff -- we loved our day at La Concha and appreciated that we could access every amenity as if we were hotel guests there. All you need to do is ask El Convento for a letter introducing you as their guests to the La Concha concierge. Another sister resort option is the Marriott in Isla Verde (we didn't have a free day to try it).", "title": "Old world charm", "helpfulness": 2, "user": "Barrett S", "date": "October 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119535245}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Overall, we can confidently add our voices to the chorus praising El Convento for being a generous, elegant, unique place to stay. Those who value character and charm will find this hotel sparks a trip back in time in the middle of Old San Juan. Hope we can make it back one day!", "title": "Perfect, Perfect, Perfect", "helpfulness": 5, "user": "buffywell", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119326006}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Hotel El Convento is right in the middle of Old San Juan, a few blocks from El Morro. With no traffic, it took about 20 minutes in a taxi from the airport, but going back, it took nearly an hour, because of traffic. There are plenty of cabs waiting right outside.", "title": "Exceeded expectations", "helpfulness": 1, "user": "flguy2", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119292563}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Stayed with my fiance one night for a quick getaway.", "title": "Bottom line. FANTASTIC!", "user": "th3Dude", "date": "October 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118996553}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Hotel manager (Effrain) showed us around upon our arrival and gave us a brief history of this beautiful boutique hotel.", "title": "Best place to taste Old San Juan", "user": "david011608", "date": "October 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118975667}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "El Convento is steeped in 300+ year old Spanish/Puerto Rican history. And it shows.", "title": "Absolutley Mesmorizing, El Convento Is for the TRUE CONESUER!", "helpfulness": 2, "user": "World T", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118843752}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The check-in was effortless. The entire staff was friendly, helpful and made us feel as if we belonged there.", "title": "Perfect Place!", "user": "luvnabby", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118793495}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Dinning: Although there are limitless places to dine in Old San Juan, we found ourselves attracted to El Picoteo in the main garden area. The food was beyond ( try the Empanadillas) .service was great and the drinks were fun.", "title": "Nice Hotel, Great Location!", "helpfulness": 1, "user": "titibalou", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118732166}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "We stayed at the El Convento for our 10 year anniversary. I loved it! I love the atmosphere, the character of the building and the staff were very friendly and helpful. If you can make yourself relax and not expect bad things to happen on your trip, then all will be well! Far too many people who give reviews seem too uptight and overly picky. You are on vacation, chill out! Anyway, back to the hotel, there is a lovely little dipping pool on the rooftop. We enjoyed the honor bar as well, help yourself to beer and wine. Every evening they serve wine and cheese...wonderful before heading out for dinner. We also loved to relax in the hot tub and watch cruise ships go by in the late evenings. Old San Juan is a charming historical town with loads of fabulous restaurants and attractions. We will be back and hopefully stay at the El Convento again and again.", "title": "Wonderful Gem", "helpfulness": 2, "user": "joangszy", "date": "June 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17061160}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I forgot that our first night they gave us a twin bedroom! It wasn't our first choice of course, but we didn't freak out. They put us in the double room the next night. Again, we didn't let it ruin our vacation. Roll with the punches people. Nothing is perfect.....", "title": "Great place to stay in San Juan", "helpfulness": 1, "user": "fbusa", "date": "June 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17038606, "likes": {"liked": "— Terrace overlooking the square", "disliked": "— Staff sometimes elusive"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "If you like small hotels, in central locations, with bags of character and history, an outdoor dining terrace and bar area overlooking the old town square then you will probably like El Convento. If you like big, modern with a casino then this isnt for you.", "title": "Very nice with a story", "helpfulness": 1, "user": "Wyonative7", "date": "June 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16975388, "likes": {"liked": "— The historical feel and elegance", "disliked": "— Finding my wife trapped inside the bathroom"}}, {"rating": 2.0, "title": "Skip El Picoteo-go across the street to Buren's", "text": "Maybe the hotel overplays the rooms with views and some reviewers have been disappointed - all I can say is that San Juan has mainly flat-roofed buildings with satellite dishes etc. From our room you could technically see the sea but the foreground is the quirky, characteristic roofs - charming in a San Juan way.", "helpfulness": 1, "user": "bahstengirl", "date": "June 13, 2008", "id": 16902408}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I loved El Convento for its pretty courtyard, old architecture, the wine and cheese hour on the terrace, a quiet late night drink over-looking the old town square and floodlit church, easy stroll to the water..", "title": "Could have been better", "helpfulness": 1, "user": "mlc00", "date": "June 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 16735031, "likes": {"liked": "— The building and center patio", "disliked": "— Staff and housekeeping"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband and I spent my birthday weekend at the El Convento. We loved the hotel and Old San Juan. We spent the bulk of our time walking around Old San Juan and visiting the 2 forts (El Morro and San Cristobal). El Convento is truly charming and our room was lovely. Yes, it's an old building but that's part of the charm. The staff was really nice and the food was delicious (we had breakfast and lunch there). The rooftop pool is small but the setting is lovely and serene. The taxi cost to and from the airport is about $20 (tip not included), There's free wi-fi at the hotel. My husband who has an AT&T iPhone had no problems connecting. I, on the other hand, have a Verizon iPhone and the connection was not always great. It was a great weekend and we'd go back in a heartbeat.", "title": "A Wonderful Weekend", "helpfulness": 1, "user": "MrsTraveler", "date": "October 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119873644}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "One of my favorite things to do for a long weekend or so is to stay at Hotel El Convento, hang out on the sun deck with a Medalla beer and cigar hand-rolled by the guy down the street.", "title": "My favorite place to run to from NYC.", "helpfulness": 1, "user": "L_Americano", "date": "October 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119812266}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "El Convento is a converted convent that is beautifully restored and maintained.", "title": "Great hotel in a great location", "user": "newyorkpaulandliz", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119810074}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Staying there gives you access to some of Puerto Rico's best restaurants for local food and the bars on premises are as much as you could ask for.", "title": "Great location, beautiful hotel", "user": "FScottP", "date": "October 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119718079}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The reception area, courtyard and banquet room are stunning and private. The rooftop pool is small but welcoming in the hot afternoon sun.", "title": "Charming, good location", "helpfulness": 3, "user": "portiab", "date": "October 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119621998}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Great service from arrival to departure. Location is perfect! Far enough away from the tourist off the cruise ships and closer to El Morro. Make sure you cross the street to El batey!", "title": "Old world charm", "helpfulness": 1, "user": "jayson182", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16614930, "likes": {"liked": "— Location and setting"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed at Hotel El Convento for one night after a weekend in Culebra. We didn't have reservation so we thought we couldn't get a room.", "title": "Enchanted - Could be better informed", "helpfulness": 1, "user": "FullofPureLife", "date": "May 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 16538588, "likes": {"liked": "— Location", "disliked": "— Lack of Information. We like to eat go rest and bar hopping"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "A friend mentioned us about the hotel. We then did some research.", "title": "What a great hotel!", "helpfulness": 1, "user": "abigs_FL", "date": "May 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 16431962}, {"rating": 5.0, "stay_parameters": "Stayed July 2003, traveled as a couple", "text": "We first review the Hotel in Trip Advisor. My couple and I had a curiosity from the reviews in the web page and how the Hotel Manager always writes back to any comment. This is not normal, it was clear that service was important for the hotel.", "title": "Charming", "helpfulness": 1, "user": "SarahASeattle", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16326351, "likes": {"liked": "— So charming, peaceful, beautiful. A welcome haven after our long travel."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "The Rooms are small but we didn't expect anything big specially in a 300 old small luxury building-hotel and for the price we paid last minute.", "title": "Beautiful hotel, terrible houskeeping!", "user": "mjack1997", "date": "May 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 4.0, "location": 5.0}, "id": 16309148, "likes": {"liked": "— Beautiful hotel and great location", "disliked": "— Housekeeping service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed for a week and loved everything about the hotel. The old world charm and character really added to the experience. The service was phenomenal and the rooms very clean. The in-hotel restaurant balcony was amazing and gorgeous for a night out. Its walking distance to all the shops and historical areas in Old San Juan. We would go back in a second.", "title": "By far the best place to stay in Old San Juan", "user": "SpartanGirl3", "date": "October 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119274512}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The hotel is perfectly located in old town San Juan. It is architecturally gorgeous with a magnificent foyer and bar reception area. The location will allow you to walk everywhere and still be a stones throw away from your hotel.The staff were very courteous and professional. We didn't dine here except breakfast which was very pleasant. There re too many options locally that enticed us out of the hotel. The only area which I was not as happy with but still not upset were the standards of the room. I kept expecting a nun to come out of the next room with a stick and give me a good beating. I understand that they are holding on to the history of the convent, but they could have spruced up the rooms a bit more. In saying that, everything else about the hotel is marvelous and again you can't neat the location.", "title": "Beautiful hotel, but beware of the nuns rooms!", "helpfulness": 1, "user": "roscrea1972", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 119269948}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Friends celebrated our 50th here - and it was truly unforgettable. The entire staff was amazing. A wedding one night closed the open-air bar. We had hoped for a nightcap. Instead, the staff delivered a pitcher of amazing Sangria to us as we sat talking at a side table - completely unexpected and the type of service that is the standard for this hotel. We had a wonderful experience and enjoyed looking out over the square, watching wedding parties collect prior to the wedding and then come out afterwards - what fun!", "title": "Unforgettable!", "user": "CityTravelers999", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119203605}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The cocktail hour was wonderful - we enjoyed wine, cheese and drink with other guests and shared tips on tours and places to go. The ONLY Place to stay in San Juan!", "title": "Beautiful Property, and First Class Service", "user": "Allergytraveler", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119193146}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Just returned from a four day stay, and all the good reviews are absolutely correct. From the rooftop pool to the many sitting areas, and the website pictures are accurate. Our room was spotless, the view of the bay beautiful (so, what if it was over rooftops, it is a city!), and the old-fashioned turn-down service a surprise. Every question or request was met with a smile, and every staff member seemed to be proud of both Puerto Rico and El Convento. If you have ever been to a hotel where guests seem to be a nuisance to the staff, you will be delighted NOT to find that here - every person we encountered went out of their way to be helpful, and seemed to enjoy doing it. There were several functions in the evenings, and the double doors to our room were totally soundproof. Our congratulations to the manager, Mr. Effrain, who runs a tight ship.", "title": "The Best Experience for Vacation and Wedding", "user": "Alarys M", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119158192}, {"rating": 2.0, "stay_parameters": "Stayed April 2008", "text": "My brother and I stayed here for two nights at the start of spring vacation. We flew into San Juan, stayed at the Hotel El Convento, then drove to Rincon and spent a week there. The hotel is beautiful. It is very well maintained, and we were very comfortable. I use a wheelchair, so we stayed in Room 501, which is their accessible room. It worked very well for us-it was kind of crowded with the bed and the rollaway, but it was a beautiful room, there was a lovely view, and the bathroom was indeed accessible. Accessibility was iffy in the rest of the hotel-if you are traveling with someone, as I was, no problem. To get to the restaurant, we had to navigate a steep step. Coming into the hotel, there is a very steep ramp that I was unable to navigate on my own. But the staff seemed very kind and helpful (Jaime was very nice).", "title": "Beautiful hotel, horrible management", "helpfulness": 1, "user": "ISeaGreen", "date": "May 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 16073884, "likes": {"liked": "— The hotel", "disliked": "— The management"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "However, a really serious customer service issue arose. I had decided to rent a beach wheelchair to use during my trip and I found a rental company able to supply such a chair. They asked if the Hotel El Convento would be willing to serve as the drop-off/pick-up point for the chair-the company would drop the chair at the hotel, we would pick it up and take it with us to Rincon, then at the end of our trip we would leave it at the hotel for the rental company to pick-up. I sent email to the hotel, and Carlos J. Gomez replied: \"There will be no problem in receiving the wheelchair from the rental company. Our guest services staff has been alerted to its delivery on the 4th, and it will be safely stored until you need it. The same would apply on the 12th. After you drop it off, we shall keep it stored safely until it is picked up.\" When we checked out on Sunday, April 6, my brother asked at the front desk regarding the beach wheelchair. He was told that it had not been delivered. I thought there must have been some misunderstanding, so I went to the front desk to inquire. I was told with certainty that no beach wheelchair had been delivered to the hotel. When I seemed doubtful that she understood and tried to explain further, the woman at the desk stated \"There is nothing like that here, and I would be the one to know.\" I was hugely disappointed,but it was Sunday, and I didn't have the contact information of the rental company with me. So I decided to try to have the best time I could under the circumstances.", "title": "Fabulous 24 hours!", "helpfulness": 1, "user": "kevart", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15598640, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Absolutely charming!", "text": "When I returned to work Monday, April 14, I contacted the rental company, expressing my disappointment at the misunderstanding. The person who'd helped me with the rental told me that the beach wheelchair was indeed delivered to the hotel on April 4. She also said that it was a brand-new chair, but when it was picked up on April 12, there was sand on it-so someone had used it. Since I'd paid $395 for the rental, I forwarded her email to the hotel, attached my copy of the invoice, and very politely made it clear that I expected them to reimburse me. I sent that message first thing Tuesday morning. When I still had not received any response by Friday, I sent the same message again, adding that if I didn't hear back I would file a complaint with the Better Business Bureau of Puerto Rico; and whether the matter was resolved to my satisfaction or not, I would be posting my experience on TripAdvisor. Finally, Judith Gantenbein contacted me to apologize for the \"inconvenience of not having the beach wheel chair available.\" Her email said, \"My reason to call you via phone today was simply to tell you that we did receive your previous e-mail and that we are working on the solution to come to an agreement with you. Inquires to find out what had happened took a little longer then I anticipated. And I apologize for this delay as well. I will be contacting you via e-mail soon. Should you have any additional questions, please do not hesitate to contact us.\" I was amazed. I really am not the kind of person who always complains about customer service, I have worked in customer service and it's rough. But this was truly amazing to me. I waited two more days, then I sent them a note to say that they really needed to reimburse me immediately. Finally, a week after my initial request, Carlos Gomez responded, agreeing to reimburse me and apologizing for the delay, saying that they were really busy, but he knew it was no excuse. He also said that he would like to take me to lunch the next time I found myself in San Juan! I decided to let it go, because he did finally credit my card, but it really made me angry to be told that the delay was because they were busy doing their jobs-I am a customer, so dealing with my concerns is their job. I still have no idea what happened. I still don't understand why they said they didn't have the wheelchair when they did. Who used it??", "helpfulness": 1, "user": "debbie173nj", "date": "April 29, 2008", "id": 15466031}, {"rating": 5.0, "title": "Great Hotel!!", "text": "I made certain choices for my vacation with the idea in mind of having a beach wheelchair. In Rincon, we stayed at an inn on the ocean with a beautiful swimming pool. We could have stayed someplace less expensive, but we wanted to be by the water. The particular beach wheelchair I rented allows for access to the beach AND to swimming pools. So I was expecting to be able to swim every day. Instead, I was able to swim in the ocean only once, the day we visited the Mar sin Barreras facility at Boqueron (they have beach wheelchairs there for disabled visitors). The entire time I was in Puerto Rico, I was able to look at the ocean, but I was not able to go for walks on the beach with my brother, I was not able to swim in the ocean more than once, I was not able to swim in the pool. It was kind of like going to the mountains for a ski trip, and the hotel gives your skis to someone else, and there isn't a single pair available for rental. So you're in ski heaven, but YOU can't ski, you can only bundle up, enjoy the weather and watch everybody else. Thanks, Hotel El Convento. If you had answered my email, explained what happened, and refunded me promptly, I would have given you credit for caring about your customers--mistakes happen. As it is, I think you were trying to take advantage of me. I don't believe you had any intention of answering my email, and if I hadn't persisted, you would never have responded.", "helpfulness": 1, "user": "MonicaRiv", "date": "April 11, 2008", "id": 14954679}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We had a bad experience elsewhere in the City, called El Convento after a sleepless night. Could they book us a room for tonight? Could we check in early? Front deck clerk Christine asnwered yes to both questions and turned our Old San Juan nightmare into a wonderful 24 hours!", "title": "Great location, less than great customer service", "helpfulness": 1, "user": "iwannalilsunshine", "date": "April 2, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 14753332, "likes": {"liked": "— location", "disliked": "— check in front desk manager"}}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 4, "variance": {"poor": 49, "average": 70, "very good": 267, "terrible": 21, "excellent": 1037}, "aka": "El Convento San Juan", "slim_ranking": 0.0212765957447, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Located in the heart of historic Old San Juan, Hotel El Convento has set new standards of luxury, comfort and service while preserving the rich character of this former 16th century convent. This landmark treasure, a member of Historic Hotels of America and Small Luxury Hotels of the World, has earned four diamonds from AAA each year since its opening. This is the exclusive hotel experience to indulge the most discriminating of travelers, and is a hotel like no other."}