{"user_rating": 3.5, "review_count": 50, "name": "Hotel del Patio", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "I stayed there for five nights and the hotel is amazing. Having breakfast at the great roof terrace was outstanding. The staff was very nice and always helpful, the location is perfect for both going out for party and exploring the city.", "title": "great hotel, best santiago location", "user": "weltenbummlerin007", "date": "May 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16283405, "likes": {"liked": "— roof terrace", "disliked": "— stairs leading to the hotel"}}, {"rating": 4.0, "title": "Nice hotel, bring ear plugs.", "text": "We stayed here for 2 days upon arriving to Santaigo commencing a 5 week backpack trip through Chile and Argentina. It was a nice place to stay as we got oriented in Santiago. It is located in Barrio Bellavista, in an area that has many nightclubs in the area. Close access to metro.", "helpfulness": 1, "user": "rugged_rico", "date": "February 5, 2008", "id": 13303724}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The staff we dealt with were the highlight of the hotel. The staff working in the daytime spoke English and were very knowledgeable, helpful with suggestions on where to shop, buy bus tickets, how to take the metro and what sights to see. Offering advice on which areas they felt we should stay away from.", "title": "Very noisy and slightly comfortable", "user": "crazyblack", "date": "February 3, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 13242273, "likes": {"liked": "— The sight", "disliked": "— the noise"}}, {"rating": 5.0, "title": "Absolutely loved this one", "text": "The rooms are small, clean , with modern, simple decor. The hotel is built around \"Patio Bellavista\" which is one of the better areas to shop for souvenirs/ items made by local artisans. There are many very good restaurants, and coffee shops, ice cream. The hotel has an outdoor patio overlooking the shopping area. This was a great place to sit at night and enjoy a bottle of wine.", "helpfulness": 4, "user": "franco4phile9", "date": "December 8, 2007", "id": 11327745}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "I can't write enough good things about this hotel. Forget the corporate hotels in Providencia or Las Condes- if you're looking for character and a great location, this is your place. It's right in the heart of Bella Vista, so if you want to hit the bars then you're well located. It's in a historic old building, but completely renovated with modern furnishings. The furnishings themselves are showing a little wear and tear (and appear to be IKEA quality in the first place) but visually the place is great. The bed was comfortable and the bathroom was spacious. The shower was one of the highlights of my stay- the shower head is one of those where it kind of rains on your head. (one peculiar detail was the soap and shampoo that looked like they were purchased by my stodgy old aunt at a cracker barrel gift shop- completely out of place with the modern look of the hotel). My windows looked out onto Pio Nono, which I suppose could have been noisy if you're trying to slumber peacefully- but if you're out at the bars with the other noise-makers and come back late-ish, you shouldn't have a problem. The continental breakfast was really nothing to write home about, but the breakfast area is peaceful and well-designed. There's even a rooftop terrace with a view out over Patio Bellavista, a new plaza with restaurants and cafes. If you want a sound-proof room for a good night's sleep, perhaps you should keep looking. But if you're looking for a trendy, stylish place to rest your head after getting some drinks, this is your hotel.", "title": "LOVED this hotel", "user": "briguy2012", "date": "November 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21708002, "likes": {"liked": "— The visually appealing design. The location.", "disliked": "— That I could only stay for one night!"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "No joke, there was drum circle below my window that kept me awake for hours. This place is loud. If you like to go out and drink in Bellavista this place is for you. All bars are walking distance. If you want to get a good night sleep before you explore Santiago, forget about it. I also stayed here because they offer wireless Internet. Unfortunately, Internet access was down 50 percent of the time and slow when available. It is a good backpackers hotel but the cost keeps them away.", "title": "LOUD and Expensive", "user": "ParaguayGuy", "date": "November 8, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 21651531, "likes": {"liked": "— location", "disliked": "— noice"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The location of the hotel was very convenient for sightseeing in Santiago.", "title": "So-so accomodation", "user": "blueskydreamer", "date": "October 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 21207868, "likes": {"liked": "— Lively neighbourhood", "disliked": "— Poor value for money"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "We stayed on a Sunday and Monday night and there wasn't too much noise from the clubs and pubs outside but our friends from Santiago told us that the area gets v. noisy later in the week. I wouldn't stay here if you like to go to bed early.", "title": "Very very nice hotel!", "user": "Frezaque", "date": "September 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20012995, "likes": {"liked": "— The decoration", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "As other people noted there are lots of little shops, pubs, bars and cafes in the vicinity so there is a lot going on.", "title": "super-nice", "user": "beppovox", "date": "August 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 19182468, "likes": {"liked": "— the room", "disliked": "— construction work on the opposite side of the street"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Pros:", "title": "Decent Stay", "user": "CuriousWorldTraveler", "date": "December 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 22788610, "likes": {"liked": "— Location. Can'"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "- Hotel manager & some of staff were absolutely wonderful - very helpful and courteous.", "title": "Poor service", "user": "Aylesburytravellers", "date": "November 26, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 22205894, "likes": {"liked": "— Very beautiful", "disliked": "— Not being able to get in!"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "- Hotel location is great, right above Patio Bellavista (fun area for young people).", "title": "Good Hotel in the middle of Bellavista Barrio", "user": "Koxie", "date": "November 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 22077907}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "- Security is good with pass code at door, 24x7 receptionist, and video camera of front entrance.", "title": "Good location", "user": "nickbz", "date": "November 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 22072864, "likes": {"liked": "— location", "disliked": "— nosiy"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "- Hotel was run in a nice, professional manner.", "title": "Great Stay!", "user": "jax421", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21852822, "likes": {"liked": "— location", "disliked": "— There weren't enough windows in the room."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Hotel del Patio is the resident boutique style hotel in the Patio Bellavista development in the Providencia neighborhood of Santiago, Chile.", "title": "Great location for Santiago city break...", "user": "volvo99", "date": "June 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 32425051}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "First, Patio Bellavista is a redevelopement of older buildings that now hosts upscale jewellery stores, art galleries, bars and restaurants. The hotel is in the complex, and therefore is steps away from some of the best dining and entertainment both in the patio area and on the surrounding streets. In addition, the patio area is walking distance to the funicular for the Cerro San Cristobal (zoo, city park, and panoramic views over 800 meters up), Pablo Neruda's La Chascona house and museum, the metro, etc. The patio management has on site security, and enhances an already bustling area that nevertheless retains a bohemian atmosphere.", "title": "Couldn't get the service we expected and only one staff member who we saw once spoke English!", "user": "calisunkiss", "date": "March 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 26478276}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "As for the hotel, we stayed in room #3, with an outside view. Note, as a boutique hotel, expect old wood floors, crown moulding, and a retro-modernist aesthetic. Service was friendly and professional from a mostly younger staff. The room had a wall mounted flatscreen cable TV, and an amply sized bathroom. Free Wi-Fi and a free internet kiosk are available, along with a continental breakfast available every morning. An adjacent open air deck allows you to take in the view of the city and Andes from rooftop level.", "title": "Wonderful location, great service with some issues", "user": "wlfmn77", "date": "March 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 26152461}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "To address concerns about noise in earlier posts; bear in mind this hotel is in the middle of an entertainment and tourism complex. Expect live music and commotion from both in and outside the patio area. On the sidewalk, street vendors set up shop with their goods. On Friday- Saturday nights, expect throngs of people on the sidewalks. Also, across the street, a major tower construction project is underway. As such, if you are expecting a quiet hideaway, then likely this area is not for you. Otherwise, if you are in search of a smaller hotel adjacent to area attractions and fine dining with qualities and style not available in chain hotel towers, then this is the appropriate hotel for you.", "title": "It's no joke - this place is LOUD!", "helpfulness": 1, "user": "nlpete25", "date": "March 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 25411685}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "the food available to you is litterally a ham and cheese sandwhich, that's room service!", "title": "too expensive for the noise and bad service", "user": "upic", "date": "January 14, 2009", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 3.0}, "id": 23541649, "likes": {"liked": "— interior amenities", "disliked": "— noise, no A/C, bad staff"}}], "location": {"country": "Chile", "region": "Santiago Metropolitan Region", "continent": "South America", "city": "Santiago"}, "variance": {"poor": 5, "average": 11, "very good": 18, "terrible": 4, "excellent": 12}, "aka": "Del Patio Hotel", "slim_ranking": 0.658682634731, "description": "Hotel del Patio is very well located in the Providencia District, specifically within the important gastronomical and cultural center called Patio Bellavista. The hotel has a capacity of 10 comfortable, modern rooms with private bathrooms LCD screen TV, cable TV, closets, air conditioning and central heating. Breakfast and internet Wi-Fi are included in the price. Our services include an excellent Continental breakfast and free Wi-Fi Internet access. Our qualified and multilingual staff is pleased to provide guests with information."}