{"user_rating": 4.5, "review_count": 969, "name": "Hotel Monasterio by Orient-Express", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I think that everyone should spend at least one night in this hotel.", "title": "A must in Cusco", "user": "jbohun", "date": "March 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 14461293}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "It is one of the more unique hotels in the world. Yes the rooms are on the small side, but remember this was a cell for monks, what do you expect? The room was very nice with a comfortable bed and beautiful bathroom.", "title": "Try another hotel", "helpfulness": 1, "user": "terstep", "date": "March 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 14372397, "likes": {"liked": "— breakfst buffet", "disliked": "— rude staff"}}, {"rating": 5.0, "title": "Beautiful Hotel and City", "text": "The food was very good for dinner. Service was excellent.", "user": "annhannon", "date": "March 3, 2008", "id": 14023248}, {"rating": 5.0, "stay_parameters": "Stayed January 2008", "text": "The lunch menu had a \"21\" club burger and let me tell you the \"21\" should make them take it off the menu, not even close the the famous NYC restaurant burger.", "title": "Great atmosphere, location, food", "user": "toolworker", "date": "February 27, 2008", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "business": 2.0, "rooms": 4.0}, "id": 13893136, "likes": {"liked": "— Very atmospheric; great location", "disliked": "— Limited internet and TV; high laundry prices"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "We booked through American Express Platinum and were treated like royalty.", "title": "Nice place shame about the rooms", "helpfulness": 2, "user": "mikey47", "date": "February 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 13860057, "likes": {"liked": "— the location", "disliked": "— the bedrooms are dark and depressing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel stands out as a 5*. The staff all around were very helpful, the grounds and courtyards were outstanding. We stayed here 2 nights, one on each side of our trip to Machu Picchu. They offer oxygen in the beautiful hotel rooms, which was a must for us living at an altitude of 150ft. The restaurant was wonderful.", "title": "beautiful, tough altitude", "user": "sinusqueen", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12015126}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This is in fact one of the best hotels I've been, The room is of good size, bath room is big, bed is comfortable, the architecture and decor are lovely, and the staff is friendly. I would surely stay there again.", "title": "One of the best hotels", "user": "dkym", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12010250, "likes": {"liked": "— Everything", "disliked": "— Not staying there for a few more days"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "dkym", "title": "Absolutely Stunning", "helpfulness": 2, "user": "newyorkanya", "date": "December 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11960196, "likes": {"liked": "— the architecture and the location"}}, {"rating": 3.0, "title": "Restaurant over-rated?", "text": "We adored this hotel because the service was great and the setting was lovely. We have stayed in other hotels that had been monasteries but this was the nicest because our room had a window that faced out rather than on to a cloister. Also the decor and architecture is wonderful and the staff was very fast to check us in and bring our bags etc.", "helpfulness": 2, "user": "perufoodies", "date": "December 25, 2007", "id": 11945467}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We didn't eat here because our travel agent and Trip Advisor said it wasn't worth it. Instead we had a wonderful meal at Green's and a so-so meal at Papillon (both in the main square).", "title": "Incredible service", "user": "blamona", "date": "December 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11918574, "likes": {"liked": "— the service", "disliked": "— the decor is a little"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We spent three nights here in January 08. The hotel is one of the most beautiful I have ever seen and the conversion from a monastery to a hotel is done very well indeed. The background music played in the public areas of monks chanting adds to the atmosphere.", "title": "Beautiful hotel and very conveniently located", "helpfulness": 1, "user": "Hambagahle", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 2.0, "location": 5.0}, "id": 13637629, "likes": {"liked": "— The hotel is strikingly beautiful!", "disliked": "— Our room was minuscule"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I loved the courtyards and would have liked to eat out but it was cold in Cusco and since there was little sun (it rains in January) this was not possible. We ate several times in their main restaurant, and the food was quite good. (For the best food in town, though, cross the square to the MAP museum and eat in the MAP Café - it is superb!)", "title": "Beautiful Hotel", "helpfulness": 1, "user": "kis777", "date": "February 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 13234987, "likes": {"liked": "— Oxygen supply into the room to prevent altitude sickness", "disliked": "— Uncomfortable bed in our room"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The only negative comment I have is the size of the room we had. It was lots smaller than a cabin on a river boat! There was a step up to the bathroom and we both fell over this several times! And we had no view at all. However I know there are better rooms and I would book an upgraded one if we were to stay there again.", "title": "Beautiful, fabulous, great location - Staff needs lots of work!", "helpfulness": 2, "user": "Manateegirl", "date": "January 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 12483687, "likes": {"liked": "— Location", "disliked": "— The front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel could not be better located for exploring Cusco - two blocks behind the Plaza de Armas, right int he very centre of town. A great place to stay!", "title": "Excellent Ambiance and Service", "helpfulness": 1, "user": "gjtbackwards", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12412779, "likes": {"liked": "— Ambiance"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel is truly beautiful. The hallways and the rooms are decorated with tradional Cusco art. The hotel has a special system for supplying more oxygen into the room, which helps you with the altitude sickness. The main courtyard is very charming. The hotel also has its own private chapel. Monasterio is located right in the center of Cusco, which is very convenient. The dinner we had at the restaraunt at the hotel was very romantic with candles and beautiful views of the city. There is no spa at the hotel but you can have a massage either in your room or in their small massage room. The massage was OK, nothing special. The one thing that I didn't like about our room is that instead of double bed for me and my husband, we had two single beds next to each other. It was very uncomfortable at night to say the least. I kept falling into the small space between the two beds and by the end of the night my back and neck were totally sore. So make sure if you are traveling with your significant other to request a double bed. Other than that the hotel is really unique and charming. Highly recommended.", "title": "The best and only place to stay in Cusco", "helpfulness": 3, "user": "Traveling100", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12306054, "likes": {"liked": "— The property itself", "disliked": "— No food variety"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I decided to return to the pleasant tranquility of this hotel for a few days of reflection and rest. I was not disappointed as the hospitality traits had not suffered changes. The staff was courteous and professional as I remembered and the facilities equally met all expectations.", "title": "Another energizing stay at the Monasterio", "helpfulness": 1, "user": "nopassport", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11241944, "likes": {"liked": "— The serene tranquility in the midst of a historical site", "disliked": "— Internet access limited"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Of course we all wanted to stay at the Monasterio when booking our trips to Cuzco because of all the awards the property has received and at first site it has character, ambience and a certain refinement that lets you know that you have arrived in a unique spot. The last two reviewers have pretty much summed up the experience you will encounter there. You may think it borders on petty but when the cost of the room can be at the very least $385 US to over $500US a night the expectation gets higher. After 3 nights there, and several problems I was relieved to leave and the place started giving me the creeps. We also had problems with the overheated rooms that they could do nothing about except bring fans in and we are also charged $30 USD extra a night to have an oxygenated room although we quickly realized that in our room it was an impossibility. They were gracious enough to take the charge off the bill. We thought we were the only ones complaining and then ran into two other couples in the lobby that were having their rooms switched. This brings up the question that if every one is having similiar problems why don't they fix the heat? I would recommend to my frends and family that they stop in for lunch in the courtyard and enjoy the garden setting and stay at a less expensive property.", "title": "2nd my opinion of the last two reviews for the Monasterio", "helpfulness": 6, "user": "linda9319", "date": "November 13, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 10789867, "likes": {"liked": "— character", "disliked": "— very expensive for what you really get"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The physical environment of the hotel is excellent. It is a stunning converted monastery set around two cloistered courtyards. The chapel is a microcosm of the splendor of many of the churches that are abundant in Cusco. The hotel is situated a short walk from the main square, although the effects of altitude make a short walk seem like a small hike! With the exceptions below, service was very high, especially in moments of crisis, such as calling the local doctor to the hotel. In terms of the rooms, there are dangers in generalizing from the specific, nevertheless. The rooms are very small even by UK hotel standards and miniscule by US. A number of the rooms have oxygen enrichment systems, others air conditioning, some both and others neither. There are rooms with oxygen enrichment and no air conditioning. Avoid these in all circumstances. Ask to move rooms as the benefit of the oxygen enrichment can only be appreciated by the windows being closed. Our room temperature was in excess of 27 degrees at night and hotter during the day making any relaxation/rest time in the room impossible. Regrettably my partner suffered a serious bout of food poisoning while staying at the hotel which made the room a very uncomfortable experience. Fans were provided on request, but no mobile air conditioning units were available. Food quality, service and price are matters of personal expectations/experience and difficult to objectively compare. On a continuum from Michelin experience to good Mall type food the quality was poor and the service slow, dismissive and complacent. The price point for this hotel engenders high expectations which were not satisfied. E.g. $50 for consume, tomato and mozzarella salad, a beer and mint tea seemed a little expensive as was the two course, dull evening meal for $110 and the $45 cold club sandwich room service. Had my partner not been suffering sever illness we would have eaten elsewhere. I would strongly recommend that the quality and service of other local restaurants would be much higher.", "title": "Wonderful surroundings and location, poor quality and expensive food", "helpfulness": 1, "user": "Elvey", "date": "November 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 10697799, "likes": {"liked": "— location", "disliked": "— rooms/food/service"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Booked 2 rooms through Hip Hotels for promotional rates of approx. $450 per room per night, oxygenated rooms + breakfast for stay in early November 2007. Hotel is still the most elegant option in Cuzco, situated near the Plaza de Armas. The property is a beautifully restored monastery dating back to the late 1600's. Service is nearly excellent; staff is friendly; food is excellent. However, this is a very pricey hotel; decor is too solemn and for some it might feel severely religious; hotel is beautiful but lacks ambiance because the \"monastery\" aspect is over-emphasized; Gregorian chants play all day, making the place feel more like a church or museum than a \"Hip Hotel.\" BIGGEST DRAWBACKS: The beds are very \"springy\" (nothing resembling \"Westin Heavenly Beds\"); avoid duplex suites because the upper level (where the sleeping area is located) gets very warm at night and since there is no air conditioning, you cannot cool the room unless you open the tiny windows (allowing all the outside noise in). Consider that sleeping in Cuzco is already challenging due to the effects of high altitude -- a warm room does nothing to alleviate insomnia. BIGGEST PLUS: You can book and pay (for a 5% service fee) the Orient Express Hiram Bingham train to Machu Picchu at the reception - there is no better train service in the Americas than this train and this is the most memorable way to visit this wonder of the world. \\Worth every cent of the $550 per head train r/t/ fare. OPPORTUNITIES FOR IMPROVEMENT: Management could do a better job at \"ritualizing\" the coca tea served upon checking in; breakfast offerings should be less English and highlight more Peruvian fare; the hotel's personality could be less solemn; staff at the courtyard restaurant should be more proactive/anticipatory (they only serve you if called -- rarely take initiative to come over to offer any of the many expensive drinks or food) and most of all...need to find a solution to baggage storage -- piling up all luggage around the courtyard is a shame -- cheapens the whole experience; makes you think that you have arrived instead at a cheap group hotel in the Dominica Republic.", "title": "Still the best in Cuzco; but not perfect.", "helpfulness": 3, "user": "ClubWorldTraveller", "date": "November 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 10684313, "likes": {"liked": "— The service and the historical aspects of the architecture of the hotel.", "disliked": "— The solemnity of teh decor and the uncomfortable beds."}}, {"rating": 5.0, "title": "A special place to stay", "text": "You will love this hotel!!!!!Its the type of place that the minute you walk in, you feel \"good\". Its warm and cozy and has alot of history to it. The staff will do just about anything to ensure that your stay is happy. We ate in their resturant, which was very good. Our rate included a daily morning breakfast, which was served buffet style. It was also very good and they serve about any time of food you could imagine.", "helpfulness": 3, "user": "TAHOEAL", "date": "October 27, 2007", "id": 10373699}], "location": {"country": "Peru", "region": "Cusco Region", "continent": "South America", "city": "Cusco"}, "stars": 5, "variance": {"poor": 28, "average": 47, "very good": 137, "terrible": 7, "excellent": 750}, "aka": "Monasterio Hotel Cusco", "slim_ranking": 0.0441176470588, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "At the heart of Cusco is the 16th-century Hotel Monasterio, originally built as a monastery in 1592. Allow the charm and unique atmosphere of this ancient monastery to embrace you. This unique hotel museum is an architectural treasure built on Inca foundations with a beautiful chapel adorned with extraordinary gold ornaments. It combines the solemnity of a colonial monastery with the luxury, elegance, comfort and excellent quality of a modern five-star hotel. Enjoy a variety of tours around or outside Cusco city (upon request)."}