{"user_rating": 4.0, "review_count": 193, "name": "Hotel Ateneo Puerta del Sol", "reviews": [{"rating": 4.0, "title": "Great Location", "text": "If you are looking for a central hotel, you would do a lot worse than book the Ateneo. We stayed for two nights in late February and the hotel was excellent. The staff were very friendly and welcoming. The rooms whilst not the biggest were fine and very clean. But what wins it for this hotel is the location, it a about a 2 minute walk to Puerta Del Sol square and metro. If you are prepared to walk for around 5 mins the bars are numerous and there is something for everyone, there are tapas and irish bars dotted up all the streets leading of the square. All in all if you are on a bit of a budget I recommend this hotel highly.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "February 27, 2006", "id": 4523984}, {"rating": 3.0, "title": "Good value hotel in a \"hot\" street", "text": "We have stayed several times in the Ateneo . Its a totally renovated hotel in an old building 1 block away from Puerta del Sol with all the attractives of Madrid (theaters , museums , shops , nightlife ) accesible by foot . Rooms are modern ,simple and quite big (specially those in the top floor ) , with huge bathrooms . Buffet-Breakfast are excellent and the staff is correct . Problems? The location is unbeatablely central but ... Calle Montera is the equivalent of Rue St.Denis in Paris , with girls staying in the street every 5 meters . This not represent a security problem at all but can be a little bit disturbing , even if this street activity is really not noisy .", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 18, 2006", "id": 4468612}, {"rating": 5.0, "title": "Great Hotel, Great Staff, Great Location, great breakfast lounge", "text": "The best Hotel we have had stayed before, because its location, staff, level of cleaning in their rooms and turistic areas to be visited, practically speaking you do not spend money on cabs or public transportaion, because is so centered and so strategycally well located that you really save money", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 19, 2006", "id": 4363362}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "The hotel staff makes you feel at home, is so great and even greater is the all you can eat breakfast included with the room price, so, having this feeling in your first visit to spain is so good, they tell you everything, where the best tapas restaurants are located at (By The Way Picoteo's, is the best and the cheapest one, We were 2 adults, one 10 year old child, eating any kind of tapas only spend 20 euros in total including drinks (cañitas)), where buying cheap and good souvenirs, even they tell you where not to go after certain hours in terms of your personal security.", "title": "Great Hotel", "helpfulness": 5, "user": "zeketheportie", "date": "January 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4346932}, {"rating": 3.0, "title": "Wonderful breakfasts", "text": "I recomend this hotel over and over aagin, if you want to have and see everything around the corner and saving money like no mañana, this is the place", "helpfulness": 2, "user": "ErnestandPat", "date": "October 29, 2005", "id": 4070890}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Having made a hasty retreat from a previously booked hotel, we found the neighboring Ateneo Hotel a most welcome relief. With underground secure parking nearby, we were free to wander the streets of Madrid (too often under construction) to a great variety of places of all types to eat, the museums to the east and the palaces to the west. And insofar as shopping, everything was right outside the door...the city's major department store, excellent art dealers and the required tacky T-Shirt vendors.", "title": "Proximity to All", "helpfulness": 9, "user": "CalTexTraveler", "date": "December 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6509567, "likes": {"liked": "— location value", "disliked": "— inside room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Our room was spacious and overlooked an interior courtyard which made it incredibly quiet. An extensive breakfast was served and The Metro stope within a block or so of the hotel.", "title": "Centrally located and good value", "helpfulness": 6, "user": "Garyfinch", "date": "November 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6055433, "likes": {"liked": "— Great location", "disliked": "— The roadworks outside"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "On top of all, was a frendly and helpful staff, versant in English and knowledgable and having a sence of humor, a bonus after we'd walked all over this great city.", "title": "Terrible (luckily only for 1 night)", "helpfulness": 1, "user": "Irina&Kirill", "date": "October 30, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 6032123, "likes": {"liked": "— Only a walk away from all the attractions", "disliked": "— Very noisy, small rooms, not clean and terrible stuff."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "An excellent stay in late October 2006. The hotel is centrally located 2 minutes walk from Sol or Gran Via underground stations, and central for all Madrids attractions. Friendly efficient staff with smooth booking, check in and departure procedures. They all spoke excellent English. A very good and extensive breakfast with hot and cold dishes for everyone. Overall a very good experience at a reasonable price (110 e for room with breafast for 2 included).", "title": "Very pleasant stay", "helpfulness": 7, "user": "nabokovian", "date": "September 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5797073, "likes": {"liked": "— Cleanliness", "disliked": "— Immediate area"}}, {"rating": 5.0, "title": "Perfect location, modern rooms, friendly & helpful staff", "text": "Although we had a second floor room with a balcony onto the busy main street below which is being pedestrianised and is subject to heavy road works, the noise was quiet as can be expected in any city centre. The street is a mixture of retail and leisure and seems to be a hang out for street hookers at all times of day. This does not detract from the area and it is by no means a sleazy or dodgy location. Theres a good mixture of locals, shoppers, punters and tourists all milling about together.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 12, 2006", "id": 5333586}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The hotel is very nice with great comfortable and refurbished rooms and en-suite bathrooms. The staff in the reception is very nice and the location is great in the very centre and good for tourism. The only less nice thing about the hotel is the breakfast, buffet but with little selection and runs out very fast, also the staff in the breakfast area (just one lady) was less and helpful. Good value for money in the busy and historical centre of Madrid.", "title": "Confortable and great location", "helpfulness": 5, "user": "CSNunes", "date": "June 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 2.0}, "id": 5333306}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "This hotel was a great value in the heart of Puerta del Sol. Very clean and even has a computer in the lobby that allows you free internet access. Friendly staff. I would definitely stay here again.", "title": "Great hotel", "helpfulness": 6, "user": "MMCSanDiego", "date": "June 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5295290}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Stayed in this hotel start of March. Modern, quiet and well designed rooms; friendly staff; and good breakfasts. What more could you ask for? Well, turn left out of the hotel and in 60 seconds you're in one of the main squares in the city! This also avoids most of the 'colourful' street inhabitants. Rooms and hotel look exactly as advertised on the Internet. All in all, will definitely stay here if I come back to Madrid", "title": "Lovely hotel", "helpfulness": 8, "user": "ruai", "date": "April 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4940107}, {"rating": 5.0, "title": "Great Hotel!!", "text": "My girlfriend and I stayed in Hotel Ateneo for 6 days in March 2006.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "March 20, 2006", "id": 4715563}, {"rating": 5.0, "title": "Great Hotel at a Low Rate", "text": "It was one of the best hotels I've stayed in for the money I've paid. Even if it was more expensive, it would probably still be one of the better that I have stayed in. I highly reccomend this hotel.", "helpfulness": 10, "user": "kate0614", "date": "March 19, 2006", "id": 4691820}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "This is a very good hotel,reasonably priced, and in an excellent location.", "title": "Very good hotel", "helpfulness": 2, "user": "wawawa", "date": "September 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3938192}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The rooms and bathrooms are large and modern though simply furnished.They also have air conditioning. Breakfast is excellent.", "title": "Best hotel my whole trip", "helpfulness": 5, "user": "NY_Sam", "date": "September 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3930087}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The hotel is in a great position, 100m. from the Puerta del Sol and its transport links, and the same distance from the Gran Via which is one of the main streets. To get to the latter, however ,you pass through the area referred to by everybody who has stayed here. It is actually quite a sight to see so many prostitutes in such a small area, in the middle of the day, and in the heart of a city.", "title": "Madrid in July", "helpfulness": 6, "user": "Pinchy", "date": "July 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3703461}, {"rating": 4.0, "title": "Great Location", "text": "If you walk straight ahead when leaving the hotel you are in a different world, the street leading to the main shopping area and many restaurants and bars.", "helpfulness": 1, "user": "wbtraveler", "date": "July 17, 2005", "id": 3674142}, {"rating": 5.0, "title": "I'd definitely stay there again.", "text": "I have have stayed in this hotel twice and shall do so again.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 11, 2005", "id": 3266874}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "variance": {"poor": 11, "average": 24, "very good": 90, "terrible": 5, "excellent": 63}, "aka": "Ateneo Puerta Del Sol Hotel", "slim_ranking": 0.306345733042}