{"user_rating": 4.5, "review_count": 1034, "name": "Hotel Andra", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "I have had the priveledge of staying at the Hotel Andra in Seattle twice this year. Both times... absolutely amazing!! Hotel is beautiful, clean, has great restaurant, bar and lobby lounging areas. The staff is beyond compare when it comes to customer service and friendliness. They always go out of their way to accommodate even the oddest requests. If you want a great location and a stay you can rave about afterwards...don't miss out on staying. I will be back anytime I travel to Seattle.", "title": "Beyond Amazing at the Hotel Andra Seattle", "helpfulness": 1, "user": "mobileagt", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 21548448, "likes": {"liked": "— Amazing staff and large, clean room", "disliked": "— that I didn't get to stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "I have just returned home from another great stay at the Andra. Travelling as a single woman on business, I like that the Andra is in a great, safe location where you can easily walk to shopping, restaurants, and the business district. The staff were welcoming at check-in and acknowledged me when I returned at the end of my work day. The room was very comfortable and showed attention to detail. I would not hesitate to stay again.", "title": "Another great stay...will be back!", "user": "Karen090", "date": "October 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21433447}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Hip Ambiance, High-quality Accommodations, Handy Area", "title": "Hotel Andra ~ it’s got it all!", "user": "TakingTimeToTravel", "date": "October 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21432617, "likes": {"liked": "— The location - everything within walking distance."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We spent a “Girls’ Weekend” at the Andra and loved our stay there! The trendy ambiance immediately greets you as you enter the hotel – the inviting fireplace and then the comfy chairs where you can order from the adjacent bar. Our room was great – luxurious beds, a roomy sitting area, and those unique Swedish Voss water bottles! Best of all is the location – close to downtown and also right on the edge of Belltown with its great restaurants and jazz bars. The customer service was stellar – from the valet taking our car to the helpful front desk people to the welcome note that was waiting for us in the room. The “Girls” give it a 2-thumbs up!!", "title": "Absolutely perfect, professional, and decadent", "helpfulness": 1, "user": "ATPerry", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21372616, "likes": {"liked": "— Brand, design, ammenities, location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Just a little note of big thanks for such a wonderful wedding", "title": "Best Wedding Party!", "user": "margoseattle", "date": "October 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21361500, "likes": {"liked": "— Location and Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This is our second stay at Hotel Andra - we love everything about this boutique hotel. The staff is friendly and helpful. Andra is pet-friendly and welcomed our small dog with a gift bag of dog bones! We love spending the morning in the lobby by the fireplace with treats and coffee from the Dahlia Bakery (across the street). With all of the Tom Douglas restaurants nearby, you don't have to venture far for excellent food. We enjoyed meals at Lola, Serious Pie, Etta's and the Dahlia Bakery - all great food. Location is great for downtown, Belltown and the Pike Place Market. We enjoyed and appreciated a complimentary upgrade to a junior suite - the room was perfect! Seattle is my hometown, so I know it well - and think that Hotel Andra provides a wonderful base camp!", "title": "Our Favorite in Seattle", "helpfulness": 3, "user": "AmyDallas", "date": "January 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12539245}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I stayed at the Hotel Andra during a business trip in October 2007. Walking distance to the convention center and prime shopping in Seattle. This hotel is not directly serviced by the Downtown Airporter (shuttle between airport and downtown hotels) but the hotel immediately next door (the Warwick) is a stop so you can get off there and then walk the 1/2 block to the Andra. It's a lovely boutique hotel--appears recently remodeled. Very modern lobby with cozy fireplace. The front desk staff were very helpful and friendly. My room was spacious with 2 queen beds, sitting area, bar area. Decor is very modern---kind of Ikea-esque. View of neighboring construction site, unfortunately, but interestingly enough I never really heard the annoying sounds of construction. Pretty small bathroom compared to other hotels but nice nevertheless. Frette towels and Face Stockholm bath products---luxurious! They had a very small business center with 2 computers and printers--free of charge. I didn't use the gym so I can't comment. Had to pay a daily rate for in-room wireless. Lots of great eating options within walking distance. The restaurant in the lobby, Lola, is AMAZING! A Tom Douglas establishment that has a mediterranean theme and definitely lived up to the hype. There's also another Tom Douglas restaurant across the street, Dahlia Lounge, that had the most amazing donuts on the menu for dessert, served warm with marscarpone cheese and green apple butter. Again, amazing! Adjacent to that is the Dahlia bakery, which is great for that cup of morning coffee and a pastry. Overall, I would definitely stay here again when visiting Seattle.", "title": "Great boutique hotel", "helpfulness": 5, "user": "ChiTwnGirl", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11187395, "likes": {"liked": "— Very clean, modern, comfortable.", "disliked": "— Small bathrooms."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I'd had a very long and tiring journey from London, but the welcome from the Andra's reception staff almost made up for it. Very helpful, very friendly and very efficient - a real bonus when all you want to do is just check in and get to bed.", "title": "Andra is hard to fault...", "helpfulness": 4, "user": "the_trooper", "date": "November 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 11161623, "likes": {"liked": "— Front desk service and location", "disliked": "— Noise from building site next door"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled as a couple", "text": "All in all my short (2 night) stay was great. Very good location - just a few steps away from the main shops. Only a 10 minute walk to Pike Place market, and great restaurants very close by (Dahlia Lounge opposite was great) as well as in the hotel itself.", "title": "Pretty good - funky nice property", "helpfulness": 3, "user": "AliChris", "date": "November 23, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 11007727}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Room was large and tastefully decorated - subtle and relaxed. Very useful kitchen area with sink. Bathroom was a bit small though. Bed was absolutely fantastic - perhaps the best I have stayed in. Room was very clean.", "title": "Great place to stay", "helpfulness": 1, "user": "dlzim", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10598727, "likes": {"liked": "— The comfortable bed!", "disliked": "— Charge for internet access."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Hello, my wife and I stayed at the Hotel Andra for three nights in March. We found the hotel to be clean, quiet, and comfortable. The Lola restaurant was decent, with good service.", "title": "Decent, but not luxury", "user": "Michael79", "date": "April 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 15032004}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I wouldn't go so far as to call this a luxury hotel, it seemed somewhat basic, though comfortable. We didn't require much from the hotel staff, so we didn't have much interaction with them; they didn't really go out of their way to see how we were doing. The valet parking was a bit expensive ($35/night) and one night the valet left our car lights on, requiring a jump start the next morning. Otherwise, not a bad experience.", "title": "Great location!", "user": "Reese797", "date": "March 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14239657, "likes": {"liked": "— Location", "disliked": "— Small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Hotel Andra was the perfect hotel for our 4 day getaway in Seattle! We were upgraded to a junior suite, which had a king size bed and sofa/sitting area. The only downside about the room is the small bathroom, but that's the only thing I can somewhat complain about. The bedding and pillows were extremely comfortable for a hotel, and the location is perfect. We took the bus (only $1.50) downtown and only walked 5 minutes to the hotel. It was 5-10 minutes walking distance to everything we wanted...shopping, Pike Place Market, and good eats! I definitely recommend staying here for anyone who wants a moderately priced hotel in an ideal location!", "title": "What a delightful surprise!", "helpfulness": 1, "user": "TravelLib", "date": "February 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13808119, "likes": {"liked": "— Location", "disliked": "— Can't think of a thing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We stayed for one night this month since we were in the city for a concert and this hotel is in a perfect location. The ambiance of the lobby, low-key and professional desk staff, and the charming valet made us feel quite welcome. We were upgraded to a junior suite, which gave us a sofa and chair and it was good that it wasn't football season because my husband eyed that flat panel television with longing. Rooms are quiet, bed comfortable, and bathrooms well-laid out. Dinner at Lola (adjoining the hotel) is a fantastic experience, and so (unexpectedly) was breakfast. We'll definitely be back.", "title": "The most comfortable bed I've ever slept in!!", "helpfulness": 1, "user": "Aurore-L", "date": "February 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13305493}, {"rating": 5.0, "title": "Great Hotel", "text": "I agree with all the nice things that have already been said about Hotel Andra - its perfect location, its gorgeous lobby, its attention to details...Everything is close to perfection. Even the elevators are nice! You really feel in a comfortable place when you walk in, especially in winter. We had a free upgrade from our room to a junior suite - which was a very nice gesture and even though the suites are not huge, it's more than enough for two people. The furniture is modern with clean lines, the bathroom is more retro but has still all the amenities. They provide you with a lot of thick towels and bathrobes, a definite plus on my list!! And the lightning is amazing. But what I will definitely remember is the bedding. The sheets are soooooooooo comfortable, it was hard to leave the bed!!! I would definitely recommend Hotel Andra to anybody who would visit Seattle. I can't wait to go back!", "helpfulness": 2, "user": "OzDecatur", "date": "January 20, 2008", "id": 12828132}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My husband and I stayed in a luxe suite for three nights in late August. I got a good deal on hotels.com for a package that included a $40 per night coupon at one of the Tom Douglas restaurants and parking. The other reviews generally capture the pluses and minuses of the hotel. Pluses -- rooms are nicely designed, and the location is excellent. I wouldn't describe the decor as ultra-hip, but modern and comfortable. The minuses -- the bathroom is small and not luxurious at all (basically a minimally remodeled older style bath from the 1930s or 40s); the internet access is not good (I had assumed it was free since it didn't say there was a charge on the internet, and there is a $10 charge, which I find annoying); and the service was on the poor side. This isn't a rant, but we checked in at 3 pm, our room was not ready, the front desk said we couldn't leave the bags in the room, and no effort to try to compensate us in some way -- not a really big deal, just tiresome and not the kind of thing that makes you feel like the service was great. No coffee in the lobby in the morning, which would be a nice touch.", "title": "Hotel Andra -- Solid choice in Seattle", "user": "Buben", "date": "August 24, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19319165, "likes": {"liked": "— Location", "disliked": "— Front desk service"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Just spent a night at the Hotel Andra as a surprize night in Seattle for a romantic getaway with my wife.", "title": "Wonderful hotel, location Free Bus service", "user": "LLAHAVE", "date": "August 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19298099, "likes": {"liked": "— Room", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Before my review I want to mention that all the public busses are free in downtown Seattle all the time just hop on, no charge!!", "title": "Great hotel, but a few things...", "helpfulness": 5, "user": "JB24003", "date": "August 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18945463, "likes": {"liked": "— Loved the location and modern decor", "disliked": "— Front desk could have been a little more helpful with the internet access and morning paper"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We are kinda fussy travelers. We would not hesitate to recomend this hotel. Rooms are beautiful, roomy sort of a mini suite. Everything seems brand new. Robes are to die for. The bathroom maybe small but....they are clean and nothing to even mention as a negative,and there is sort of a dressing area outside the bathroom by the walk in closet.", "title": "Nice Boutique HOtel", "user": "Vegastravelr", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 18316716, "likes": {"liked": "— The beds were very comfortable", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The immediate area has several nice resturants, also a pizza place", "title": "Exceeded expectations", "user": "tomsriver60", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18112480, "likes": {"liked": "— location, cleanliness, helpfulness of staff"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Stayed here for a friend's wedding. I had high expectations going into this hotel, and I was not impressed at all after I checked in.", "title": "okay....not amazing...and they lost my bags.", "helpfulness": 1, "user": "nedo134", "date": "November 18, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 21981805, "likes": {"liked": "— it had a bar", "disliked": "— small cramped rooms; lost my bags; incompetent staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The rooms were very small and cramped. The bathrooms seemed small too.", "title": "Stayed at Hotel Andra for our wedding", "helpfulness": 1, "user": "lliang76", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 21951903}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I stayed at the Sheraton in Seattle the previous two nights and paid about the same price...and was far more impressed with the accommodations at the Sheraton....they had better accommodations, bigger rooms, bigger bathrooms, and everything seemed cleaner & more upscale.", "title": "My favorite hotel", "helpfulness": 2, "user": "Trup", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21720053, "likes": {"liked": "— location, staff, room comfort, excellent adjacent restaurants, daily delivery of NY Times", "disliked": "— like most hotels these days, the overnight parking costs are high"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed in a room facing the construction zone but with it being the weekend we had no issues with it. The hotel overall is very quiet. The bathrooms are small but we had no problem with that, however the tile on the floor could have been cleaner.", "title": "Excellent Seattle Hotel- Great staff, perfect location, lovely rooms", "user": "rbwriter", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18013523, "likes": {"liked": "— Location and atmosphere", "disliked": "— Mattress was a little soft, room lightly was a little too atmospheric, could have used a brighter light in the bathroom."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Overall I would recommend this hotel to stay, the only issue we had is that we only stayed one night.", "title": "Disappointing reservation mistake", "helpfulness": 3, "user": "citygirl118", "date": "July 13, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 17854748}, {"rating": 4.0, "title": "good hotel", "text": "I searched Seattle hotels online and checked reviews on tripadvisor.com before selecting Hotel Andra. It was terrific. We were there for 1 night, July 5, 2008 before boarding a cruise to Alaska. Our room wasn't ready when we arrived several hours before the posted check-in time, so they asked if we would like to a free upgrade to a suite! It was lovely and the people at the desk and the concierge were very helpful directing us wherever we wanted to go. The hotel is well located--an easy walk to the Space Needle and to Pike's Market. I would recommend this hotel highly.", "helpfulness": 1, "user": "felippa", "date": "July 5, 2008", "id": 17567015}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The lobby was attractive but the room so tiny the bathroom and closet too. The colors in the room so dark. Good location and good restaurants around.", "title": "Tiny rooms, bathrooms and closet", "helpfulness": 1, "user": "fournierSanJuan", "date": "October 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 1.0, "location": 5.0}, "id": 21108234, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "I stayed at this hotel in mid October for 5 nights. Initially I was put in a room on the Virginia Street side where there is a huge apartment building going up. The first night I was woken up at 6:45 AM due to extremely loud construction drilling, banging, trucks driving, & men at work. I asked to have my room changed immediately & the staff was accommodating. I was moved to the 4th Avenue side of the hotel & able to sleep undisturbed. The hotel location is great. The rooms were fine, but I would say that the lights were very dim. Brighter lighting would be helpful. I second some of the comments here about the mildew in bathrooms & small size of the bathrooms. However, the closets were quite large. The hotel gym was quite small & had only 1 treadmill, 1 elliptical machine & 1 stairmaster. The business center was also small-with only 2 computers, but free internet access & printing. The lobby is nice with the fireplace & Scandinavian decor. I would definitely stay here again.", "title": "Hotel is fine, construction noise is not acceptable at 6:45 AM", "helpfulness": 1, "user": "biztraveler211", "date": "October 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20992548, "likes": {"liked": "— Location & sheets", "disliked": "— Small bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The hotel is well situated, but very noisy because of e big construction site at the corner and the streets around. On the hotel website they don't say anyhing about this construction. Rooms are quite nice, well furnished (we were 2 aduts ans 3 kids and had a one bedroom suite with a roll away bed and double sofa bed in the siting room) . The bathroom is very tiny even for 2 persons and looked quite old for a 4 stars hotel. For the 5 of us it was a good price. Restaurant lola downstairs is very good but expensive in the evening. The staff is nice and helpful.", "title": "good hotel but not perfect", "helpfulness": 1, "user": "claire77Paris", "date": "October 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20714412, "likes": {"liked": "— situation down town", "disliked": "— bathroo too small and quite old"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The Hotel Andra was perfectly adequate. However, it was rated by Travel and Leisure as one of the top hotels under $200, and from the website I was expecting a posh experience and was underwhelmed.", "title": "OK if you like cramped", "helpfulness": 2, "user": "DandDNorwalk_CT", "date": "September 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "location": 3.0}, "id": 20017176, "likes": {"liked": "— Lola's", "disliked": "— Disappointing room"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The hotel lobby was attractive, however only one elevator worked for the entire time we were at the hotel. We had a standard room, it was so tiny that I bashed into the sharp corners of the bedframe as I walked past. Also tiny closet and bathroom. Hotel was old and only modestly refurbished.", "title": "Well above average but not excellent", "user": "SEGooner", "date": "September 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 19814193, "likes": {"liked": "— Clean modern convenient", "disliked": "— One consistently poor member of front desk staff"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "My husband just treated me to a weekend getaway at the Andra. He booked the Romantik Package which included a Lux corner suite, champagne, Theo Chocolates (one of Seattle's best hand-dipped chocolatiers). Dined at Lola (one of my favorite Tom Douglas restaurants located on the first floor of the hotel). As always, Lola was outstanding, relaxed.", "title": "Comfortable, Relaxed and Urban", "helpfulness": 1, "user": "IslandGrl", "date": "July 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17523705}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "We had a great in-city get away. The staff were most accommodating and friendly, but not snotty. Location very good for exploring Seattle on-foot.", "title": "Hotel Andra lives up to its name!", "helpfulness": 1, "user": "andrawatkins", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17105630, "likes": {"liked": "— The bathroom night light", "disliked": "— Can't think of a thing."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The suites are well designed and furnished, somewhat spacious, the bathrooms are well-appointed but smallish. Based on the size of the suite, I would find the basic room to be too small for my taste. I could see a speck of Lake Union from our room. I did appreciate that windows were operable (I like fresh air when sleeping).", "title": "Great Rooms & Service", "helpfulness": 1, "user": "TravellingBen", "date": "June 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16914375, "likes": {"liked": "— The Beds!", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Hotel Andra, is a small, comfortable boutique hotel in a restored building. Clearly the constraints of restoring an older building limited room size, but the suites are well-appointed and very comfortable. We would not hesitate to return.", "title": "Very pleasant and comfortable", "helpfulness": 2, "user": "iduj", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16803107}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Since this is the only place in the world that I've found that shares my strange name, I'm obviously going to be prejudiced. This hotel is hip, clean, efficient, moderately priced and very conveniently located in Seattle. It has a small neighborhood feel in the heart of downtown. The staff is courteous and helpful, and the facilities are awesome. The rooms are well laid out with comfy beds, and the bathroom night light is a thoughtful touch (especially in the middle of the night!) Several very good restaurants are right across the street, and the very touristy things are only a few blocks away. Lots of shopping is also steps away from the front door. I love this hotel.", "title": "Loved the Andra!", "helpfulness": 1, "user": "LittleEarl", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16545881, "likes": {"liked": "— Clean and friendly", "disliked": "— Restaurants very close by were expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "So, I grew up in Seattle and moved away for a few years and now I am back. I always have and always will recommend Andra to friends and family when they visit as the Andra is the hippest hotel in town with the best rooms.", "title": "I always recommed Andra.", "user": "localgod6911", "date": "December 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22599673, "likes": {"liked": "— The style. The style of this hotel is mid-centrury mod, which is totally speaking my language these days.", "disliked": "— It took a call to engineering for me to figure out how to turn on the TV. My fault, not the hotels."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "I most recently stayed here in March for my birthday/St. Patrick's day. We booked a one-bedroom corner suite at a screaming deal for spring in Seattle (369 a night, yes a suite for under 400 in Spring in Seattle). I LOVE THESE HOTEL ROOMS. Ample space, wonderful decor, comfy chenille blankie, two (TWO!) flat-panel televisions.", "title": "Disappointed: Andra only so-so", "helpfulness": 1, "user": "LauraLatte", "date": "December 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 22550683, "likes": {"liked": "— Location, Lola (the restaurant in the lobby)", "disliked": "— The rooms"}}, {"rating": 5.0, "title": "Luxury and Beauty, Meet Convenience", "text": "I have done similar suites at the Westin and the Fairmont, which for the price I paid there and the price of the Andra the Andra wins hands-down. Even with the bathrooms, which again, I think are totally awesome. Love the original tile on the bathroom floor, love the ample lighting in the bathroom (esp the nightlight!).", "user": "screaming-banana", "date": "December 1, 2008", "id": 22347727}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "And let's talk about the Front Desk. Anyone who compliments my outfit immediately wins brownie points.", "title": "Love the Andra. It's an updated trendy hotel in a perfect location!", "user": "kj44Michigan", "date": "December 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 22343271, "likes": {"liked": "— The updated rooms.", "disliked": "— The fitness area was too small but manageable"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Every December, a group of friends and I all stay together at a hotel in downtown Seattle. This year, we broke away from the larger chains and booked a great deal at Hotel Andra. I have to say, it didn't live up to the fabulous reviews. The lobby, front desk staff, and Lola restaurant were top-notch, but the rooms were more like a three star hotel.", "title": "Not Quite There", "helpfulness": 2, "user": "Lady_World_Traveller", "date": "November 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 22062459}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband & I stayed at the Andra for a week this spring. The first thing I noticed upon arrival was the construction of new condos across the street. I really didn't want to wake up to loud banging every morning on vacation. The receptionist said there hadn't been any complaints about noise. Okay it was the weekend (plus Mem.Day) so it wasn't too noisy but Tues. was a different story. We were offered another room but by then I didn't want to move all our stuff. I should have asked for another room from the beginning. If you're staying here anytime soon be sure you're on the inside of the hotel.", "title": "Nice but not luxury", "user": "Wheels48", "date": "May 31, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16537267, "likes": {"liked": "— Location", "disliked": "— Noisy construction site next door"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Someone should have checked the sheets they were putting on the bed because there were a couple of holes in the bottom sheet. We also had a coffee pot that was broken,they replaced it but left the broken one in the room. Maybe I'm being picky but I expect more from a \"luxury \" hotel.", "title": "Comfy and classy", "user": "sb444", "date": "May 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 15667370, "likes": {"liked": "— Modern decor", "disliked": "— Older, small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "We stayed in the lux suite which was large & decorated nicely. The bed was comfortable & the smaller bathroom wasn't a problem. The people were friendly enough but I just didn't consider this a luxury hotel.", "title": "ver nice botique hotel", "user": "beryl_greene", "date": "May 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15626406, "likes": {"liked": "— nice staff", "disliked": "— small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "It was tough choosing a boutique hotel in Seattle but the Andra was a good choice. Great decor, everything from the light fixtures to the retro clock radio on the night stand. Room was quite large and comfy, the beds were fantastic. Only complaint would be that the bathroom was a bit old and dingy. It appears to be an older hotel that was renovated - the rooms are great but the bathrooms have old tiles and flooring that looked like they could use replacing or a good scrubbing! Bathroom is also tiny but not terribly so, still quite usable. Service was great and location is also a bonus, would stay there again.", "title": "Satisfied and will be back.", "user": "majik247", "date": "April 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15355996, "likes": {"liked": "— The large bed and good service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband and I loved this hotel. We stayed 2 nights this past weekend. The room was very comfortable. We liked it that the windows open to the street noise below if you want to hear the sounds of the city. We like that. The location can't be beat. The bed was the highlight of beds in hotel rooms. I want to buy the sheets and 2 pillows from the website. They know they have something going on at this hotel. My compliments to the owner/Pres of the company. A stay at this hotel will make for a great Seattle experience. We loved drinking down in the lobby on Friday afternoon. It is quite a scene. Plus, you have options galore with the Tom Douglas restaurants all around you... plus the Dahlia Bakery for breakfast 10 steps in front of the hotel. I can't say enough great things about this hotel.", "title": "great hotel and super location", "helpfulness": 3, "user": "marla", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10211174, "likes": {"liked": "— location", "disliked": "— small shower"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Marla", "title": "Perfect for Romance!", "helpfulness": 2, "user": "owlmoongirl", "date": "October 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10023910, "likes": {"liked": "— The bed", "disliked": "— The parking"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "My husband and I booked a night's stay at Hotel Andra. It was a splurge, but worth it. Upon arrival, the gentleman at the front desk asked if we would mind a free upgrade from a room with 2 queen size beds to a suite with a king sized bed. Who would turn that down? The room was immaculate and very large. The robes, linens and towels were high quality and the bed was one of the most comfortable ever. The staff was helpful and friendly. We were given an umbrella for a walk around Belltown. Later, we enjoyed drinks by the fire in the lobby while we awaited a cab for a late dinner at Canlis. We had breakfast at the attached restaurant, Lola, the next morning...again, very friendly service and good food. Parking is pricey ($30 a night) so be warned, but this was a fun location, close to shopping and nightlife.", "title": "Chic factor is high; great value, to boot!", "helpfulness": 3, "user": "Have_fun_will_travel", "date": "September 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10015343, "likes": {"liked": "— Location, decor", "disliked": "— Airport pick-up snafu"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel's car service failed to show up at the airport, as I had scheduled, so I was a little miffed when I arrived. All was well, though, once I took one look at this chic, sleek lobby and was warmly welcomed by the staff. My room was stylish and offered ample space for my friend and me, who were in town for a girls' weekend. The walk-in closet AND separate dressing area w/ mirror made it easy to share this room.", "title": "Updated Review", "helpfulness": 1, "user": "mkb8", "date": "September 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 10010349}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The restaurant attached to the hotel is one of Seattle's best. In a three-day weekend, we ate at Lola three times.", "title": "Nice hotel, nice location", "helpfulness": 1, "user": "bcmom_7", "date": "August 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8467293, "likes": {"liked": "— service", "disliked": "— noisy airconditioning, small bathroom"}}], "location": {"country": "United States", "city": "Seattle"}, "stars": 4, "variance": {"poor": 31, "average": 51, "very good": 239, "terrible": 9, "excellent": 704}, "aka": "Andra Hotel Seattle", "slim_ranking": 0.0537634408602, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Located in downtown Seattle, Hotel Andra is a sophisticated boutique hotel ideally situated just 4 blocks from Pike Place Market and 2 blocks from the thriving downtown Seattle retail core. Scandinavian style is fused with Pacific Northwest elements to create a warm urban atmosphere throughout the hotel's 119 guest rooms and suites. Tom Douglas' Lola restaurant offers guests Mediterranean cuisine with local Pacific Northwest flavors; neighboring Assaggio Ristorante features authentic Northern Italian cuisine."}