{"user_rating": 4.0, "review_count": 227, "name": "Hotel Papageno", "reviews": [{"rating": 1.0, "title": "Hated the Papageno 2nd time around", "text": "My daughter and I stayed at the Hotel Papageno for 3 days, and then travelled to Germany for a week. We then returned to the Papageno, having been impressed the first time.", "helpfulness": 8, "user": "Clarendon", "date": "November 1, 2005", "id": 4078298}, {"rating": 4.0, "title": "Value for money", "text": "However, on our return they gave us a room with an internal bathroom that positively reeked! They claimed to be addressing the problem of the smell, but never did. We had also specifically requested non-smoking, and although this room was non-smoking, on opening the window to the courtyard (there was no alternative - no air conditioning) the room would fill with cigarette smoke from other windows. Not only did they refuse to find us another room, they then ripped us off on the price when we had to move out due to the bad smell and the smoke.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 4, 2005", "id": 3841329}, {"rating": 3.0, "title": "The Door", "text": "We are both asthmatic, and my daughter is an Opera Singer, here in Europe to audition for conductors and post-graduate schools etc. The hotel staff were well aware of both these facts.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 9, 2005", "id": 3749016}, {"rating": 3.0, "title": "Nice, but overbooked", "text": "It was either move out or be sick. Furthermore, the room was dark in the daytime and dark at night as well. We never could see properly. Room number was 453.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 2, 2005", "id": 3521939}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "My family stayed two nights at the Papageno in a quad room. The hotel is in a reasonbale position perhaps ten minutes walk from the centre. Public areas are well presented and the staff were very helpful in all respects. The room was plesently decorated although our room faced into an inner courtyard which made it a little dark. The quad rooms comprise a double bed and sofa bed that I would not choose again for my teenage family. Breakfast was a definite plus, served buffet style there was a good choice of hot and cold food. Free internet access available in the lobby is a useful service. All told a well managed and well presented hotel a little away form the centre.", "title": "Quality and Character", "helpfulness": 11, "user": "jstancamp", "date": "February 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3166914}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "The Papageno is a run of the mill, functional business type hotel in Vienna. The entrance is squeezed between a row of shops and is quite easy to miss. It is within reasonable walking distance of the historic part of the city and most of the sights. The hotel staff are very good - pleasant and helpful but despite their good efforts they cannot lift the place above its true, lacklustre status. We were given a particularly drab room, though some appeared to be nicer/brighter than ours (you could see in as you passed when the maid was cleaning up) Breakfast was basic with little choice of warm / savoury food, plenty of rolls, cakes etc.. on offer though. The hotel was adequate for our needs of a place to stay on a short city break, but was nothing special.", "title": "Run of the mill hotel", "user": "hesketh27", "date": "April 16, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4977553}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "As for Vienna, we were very impressed by the courtesy and friendliness of the locals. Service/attitude everywhere we went was good. One piece of advice is to avoid the 1 hour city bus tour. It is a total rip off at 13 euros per person and our tour only lasted 50 minutes (the bus also stops for ten minutes outside a church for people to get off and take pictures!) There is a poor commentary which gives absolutely no information about the sights etc... Get a good guide book, plan your route and walk around the city, the main sights are within a compact area, those that are further out e.g ferris wheel at the Praterstern are easily accessible by the U bahn. We enjoyed Vienna very much, it is a beautiful city and our weekend was not long enough to explore it fully.", "title": "Perfect stay!", "helpfulness": 4, "user": "Dan_Italy79", "date": "February 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4472171}, {"rating": 4.0, "title": "Papageno, great place to stay", "text": "We stayed in a double room for 2 nights. The room was clean and quiet. The breakfast is wonderful, there is plenty of food, every one's tastes can be satisfied. The staff was friendly and helpful. It's near the city centre: 2 tram stops and 1 metro stop. Anyway, you can walk to the city centre: late in the night, we came back to the hotel from Stephans Platz by feet, and we didn't see anybody \"dangerous\". Good location, good prices, good hotel.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 6, 2006", "id": 4417095}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "This hotel was exceptional value for us in January. We asked for a twin and were upgraded to an apartment. The breakfast was nice and the hotel was very convenient ot the city. The staff were exceptionally helpful. I would recomment the hotel to anyone.", "title": "Quiet clean hotle", "helpfulness": 4, "user": "Aoibh", "date": "January 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4347805}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "We stayed in a very large family room in Dec 2005 for 5 nights. Room was well equiped with 4 proper beds, tv, mini bar & telephone. Bathroom was cleaned / restocked each day.", "title": "Quaint, quiet and just the ticket!", "helpfulness": 4, "user": "lelanya23", "date": "January 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4322307}, {"rating": 4.0, "title": "Lovely Papageno", "text": "We found this hotel through a deal on Expedia plus trip advisor and were not disappointed.", "helpfulness": 8, "user": "phototripper", "date": "August 14, 2004", "id": 2449142}, {"rating": 4.0, "title": "expensive but good", "text": "The hotel was a 15 minute walk to the Vienna opera, including a walk under a tunnel leading to the subway. There were good restaurants, cafes, and grocery stores nearby, as well as lots of choice in the shops at the subway. The hotel staff were very friendly and gave us lots of maps, tourist info and suggestions the moment we checked in. They told us about the hotel breakfast but recommended we find a nearby cafe for better value. The nearby asian noodle house was her recommendation for a great dinner. Thanks.", "helpfulness": 3, "user": "Eirey", "date": "July 29, 2004", "id": 2329890}, {"rating": 5.0, "stay_parameters": "Stayed June 2004", "text": "The room was lovely, spacious and quiet, overlooking a small courtyard. The bathroom was modern and clean. Linens were very good. There was free internet in the lobby. The deal we got from expedia made it a great value, with 2 nights at 175 Cdn each (about 100 Euro) and the third night free. The sign for the hotel is hard to see, but the taxi from the train station (about 7 euro) hqad no problem.", "title": "Hotel Papageno was lovely!", "helpfulness": 2, "user": "tat2dhelen", "date": "July 6, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2269560}, {"rating": 4.0, "title": "Good location.", "text": "Two adults and one child, we stayed at this hotel in May 2004 for 2 nights. It was way out of our price range but we could not find anywhere to stay in Vienna last minute so we were trapped. DON'T arrive in Vienna with nowhere to stay at any time of the year if you are trying to keep costs down.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 18, 2004", "id": 2205209}, {"rating": 4.0, "title": "Very good budget accomodation near the city center", "text": "However at least we ended up here which was lovely. The room was light and airy, the bathroom excellent, and the bed was one of the best beds I have ever slept in ever, even in hotels with more stars.", "helpfulness": 8, "user": "GALEX_Moscow", "date": "February 10, 2004", "id": 1643696}], "location": {"country": "Austria", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 33, "very good": 105, "terrible": 10, "excellent": 69}, "aka": "Top Hotel Vienna", "slim_ranking": 0.256130790191}