{"user_rating": 4.5, "review_count": 67, "name": "Hotel Clodia", "reviews": [{"rating": 5.0, "title": "A gem of a hotel", "text": "We booked our 6 night stay at Hotel Clodia on the strength of the Trip Advisor reviews and were not disappointed. It was a very positive experience - our room was spacious and clean with a good bathroom and private patio. The breakfast buffet was extensive compared to most continental breakfasts and very good quality. Some reviewers have marked the hotel down on location as it is a 1.5km walk from the old town of Sirmione. We actually thought that this was a plus as the old town is very busy and can be noisy and the walk in was pleasant. Most evenings we actually walked in the opposite direction for 15 minutes to the centre of Colombare where there is a choice of good restaurants. All the staff are friendly but the hotel experience is enhanced by the extremely helpful Monika, who was full of good advice and always willing to look things up on her lap-top if she didn't know the answer. Our only slight complaint was that we thought from the hotel's website that all rooms had personal safes but ours didn't - this was immediately solved by Monika who placed our valuables in the hotel safe for our stay. A great little hotel.", "user": "mandcWestMidlands", "date": "October 7, 2009", "id": 46094241}, {"rating": 4.0, "title": "Great hotel", "text": "Hotel Clodia is a lovely small hotel about 20minute walk from the centre of Sirmione. Our room was very nice (90 EURO per night), light, spotlessly clean, modern with a great balcony. The breakfast was very good with a good selection to choose from and the staff friendly. Although the 1-2km walk into Sirmione centre was not a problem for us, it may not be suitable for the elderly or anyone who doesn't want to walk. The walk into Sirmione is flat and runs down the side of the lake so was actually quite a nice stroll. Highly recommended.", "user": "dsykes", "date": "September 23, 2009", "id": 43842995}, {"rating": 5.0, "title": "superb, little, friendly hotel !!! will return", "text": "we stayed 9 nights in this family run friendly hotel. our room (no.2) had the largest balcony in the hotel and was nearly as big as the room itself. bathroom rather small but still spotless and modern. Monica at reception was very helpful and spoke good english. a good varied breakfast and nice gardens to stroll around. located a 5min walk to the lake but a 20min walk to sirmione or colombare. we made use of the free hotel bikes and took them into sirmione most nights. no complaints, good value. no swimming pool but be sure to use the pool at the nearby villa pioppi - excellent .", "user": "paulowl1", "date": "August 13, 2009", "id": 37599346}, {"rating": 5.0, "title": "Charming hotel, very friendly & helpful staff", "text": "We stayed at the hotel for 2 nights during our recent holiday. Monica in particular is very friendly & helpful and made us feel very welcome. We had a lovely room with a patio so could enjoy the sunshine, along with a bottle of wine ordered from Monica. Only criticisms would be that the shower was a little snug and we were disappointed that the coffee at breakfast was self-service from a Nescafe machine. However, we would definitely stay at Hotel Cloida again and would recommend it to anyone looking for a good value hotel at Lake Garda. Even though the hotel is not right on the lake, it is only a couple of minutes walk and there are also a couple of excellent restaurants within walking distance. I'm not sure of the amenities that the hotel offers - I suspect they are fairly limited but this is what I would expect from a small family type hotel such as Hotel Clodia.", "user": "MrJonesDublin", "date": "July 25, 2009", "id": 35766888}, {"rating": 5.0, "title": "Brilliant stay,will return.", "text": "Second stay at this lovely family run hotel.We were warmly welcomed back by Monica and the rest of the staff and really enjoyed our 10 night stay did not want to leave! Despite being very busy the staff were always very helpful.Rooms have been updated with LCD t.v.which allowed us to keep up with the news at home.Great varied breakfast.", "user": "druss58", "date": "July 19, 2009", "id": 35173509}, {"rating": 4.0, "title": "Lovely hotel, excellent value", "text": "We stayed at Hotel Clodia for two nights, and thought that the hotel, the service and the room was excellent. The hotel is tucked away off the main road up to the old town of Sirmione, which took us about 15 minutes to walk to. It is easy to find. Our room was room 14, which had two bedrooms (one with bunks) and a shower room. The air conditioning was quiet and effective, all the rooms were kept immaculately clean. There are lots of places in the garden where you can sit out and relax. The breakfast was fresh and again, the service was lovely. This hotel was great value for money, the ladies on the reception desk and at breakfast were all genuinely happy to help, and there was plenty of parking. The room at night was extremely quiet, bar some noise from next doors bathroom. Highly recommended.", "user": "RLJUk", "date": "August 27, 2011", "id": 117331483}, {"rating": 5.0, "title": "Wonderful service, lovely boutique hotel, Monica is fantastic!", "text": "The hotel is lovely and it's clean, with ample parking, and lovely interior, it's a bit far from Sirmione on foot especially in the heat of July 2010!! But bikes are available and Monica at reception is fab. No request is too difficult and she speaks several languages. She makes your stay even more enjoyable. She even bakes fresh cakes for the generous breakfast you can have at the lovely veranda by the side of the house. Wonderful stay!! Would recommend it to anyone who likes a nice and clean hotel with a good breakfast and needs peace and quiet to sleep.", "user": "amedea", "date": "July 22, 2010", "id": 71887978}, {"rating": 5.0, "title": "Wonderful B&B", "text": "Our family stayed here on our first night in Italy after a flight from Melbourne to Milan with a 7 hour stop over in Singapore. After the drive from Milan to Sirmione we booked into Hotel Clodia and were very pleased with the room that we were allocated. Friendly service and a sensational breakfast, the best we had in Italy. The room was slighly cramped, but what else can we expect with 4 of us in one room. The hotel was well located off a main street, so very quiet, a 30 min. easy walk in to the old town or on a direct bus route.", "user": "Touring_Family", "date": "June 27, 2010", "id": 68795675}, {"rating": 5.0, "title": "Clean, quiet, friendly and comfortable oasis", "text": "My wife and I wanted to tour Lake Garda and selected the Hotel Clodia based upon other reviews. We were not disapointed. We were greeted by the owner, a lovely young lady named Barbara, who showed us to our room, which was spotless and very comfortable, overlooking a beautiful garden and only steps to the promenade walkway along the lake to the Old Town a few minute's walk away (20). A delightdul water taxi was also available for transportation to the Old Town, again less than a two minute walk from Hotel Clodia. Breakfast was delightful with fresh croissants, cereals, fruits, eggs, cheese, cold cuts, jiuces and coffee daily. The pace is very relaxed, and Barbara was extremely helpful in making suggestions for day trips and restaurants, especilly the one by the Tower, frequented by locals with first class food and wines. All of the staff is very friendly at Hotel Clodia. After lunch, Monica, Barbara's long time friend comes on duty and she too is very friendly and helpful. The hotel exudes the warmth and charm of a family establishment that is modern yet quaint and well maintained. We would recommend this hotel and return ourselves.", "user": "B945", "date": "June 14, 2010", "id": 67532508}, {"rating": 4.0, "title": "Lovely hotel in quiet location", "text": "Stayed for 3 nights.", "user": "RZB09", "date": "June 13, 2010", "id": 67405695}, {"rating": 4.0, "title": "Loved this place!", "text": "We stayed here just for a couple of nights, but knew straight away that I would be coming back one day! The staff are very friendly and helpful - we were slightly early for check-in and our room wasn't ready, but we were offered the use of their facilities to freshen up after our journey. The room we had was just delightful, with a huge balcony, and was beautifully furnished. There is a good choice for breakfast and a bar (although we didn't make use of it ourselves).", "user": "emken", "date": "September 11, 2008", "id": 19984803}, {"rating": 5.0, "title": "Great place to stay", "text": "The hotel is a bit of a walk from Sirmione (very pleasant walk), but we were grateful for this as the town was extremely busy the weekend we stayed as there was a festival on, and the hotel is set back off the road in a quiet location. We took advantage of the hotel bikes on our second day and rode into Sirmione which was very pleasant.", "user": "GeordieGirl4", "date": "August 31, 2008", "id": 19564183}, {"rating": 3.0, "title": "Pretty good, overall a good experience", "text": "Loved this place!", "user": "Mykel75", "date": "August 19, 2008", "id": 19116409}, {"rating": 4.0, "title": "charm place to stay", "text": "We stayed at the Clodia hotel for a week while we were in Sirmione and had a great time. It's a lovely family run business and a great base to explore Sirmione.", "user": "razer1", "date": "September 5, 2007", "id": 8659110}, {"rating": 4.0, "title": "Lovely quaint hotel", "text": "The rooms were excellent, very comfortable and clean. I liked the quaint and traditional style of the bedrooms! Also, there was a good selection of food at the breakfast buffet - toast, cereal, croissants and cakes. It's a nice quiet and peaceful location.", "user": "PersianUK", "date": "June 1, 2007", "id": 7729579}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Just arrived back from Lake Garda where we stayed 4 nights at the Hotel Clodia. What a wonderful Hotel - Giovanni and his wife were really friendly and helpful even loaning us the use of their bikes! The breaksfast was plentiful with lots of choice. The room was clean and well laid out and with only 14 rooms in total it meant there was a personal touch to each of them. Nice sun terrace where you can take coffee or have your breakfast.", "title": "Wonderful", "helpfulness": 2, "user": "Woerd", "date": "October 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5954592, "likes": {"liked": "— situation of hotel and the rooms", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I do feel you need a car to make the most of the lake. We travelled around the perimeter and it took a full day including stopping en route. We also had an evening at the Aquarius Thermal spa in old Sirmione. This is very relaxing and they do a special offer which is 5 hours for 35 euros and that included the hire of robe, hat and towel and also a drink. Go late in the evening (they are open until 10pm most nights and midnight on a Thursday) to get the full ambience of being in the hot water outside in the cool night! On our last day we went to Verona - a nice city, but like most of Italys cities very busy and hectic, so we were glad that we had spent such a lovely time at Lake Garda.", "title": "Hotel Clodia", "helpfulness": 2, "user": "lfentum", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 5834827, "likes": {"liked": "— Cleanliness", "disliked": "— Walk to Sirmione"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Nice hotel, bit basic and a bit far from Sirmione centre. But overall a nice hotel.", "title": "Lovely stay at Hotel Clodia", "helpfulness": 1, "user": "jonners", "date": "July 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 5518775, "likes": {"liked": "— informal atmosphere and cleanliness of hotel", "disliked": "— midges in season !!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We spent 8 days exploring and would say that a few days here would be enough.", "title": "Found our home in Italy", "helpfulness": 12, "user": "Jouby", "date": "August 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3759521}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "The walk is quite a hike after a few days. The rooms are very clean though and the staff exceptionally helpful. The down sides are - the bar closes at 10 and they did not have any outside lighting in the evening other than a few candles on the tables, we would have liked to have sat outside in the evening and play cards. We hada ground floor room and it was quite noisy in the morning so don'e expect to lay in past 8 am.", "title": "Quite nice", "helpfulness": 20, "user": "Stella", "date": "July 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3687740}], "location": {}, "stars": 3, "variance": {"poor": 1, "average": 8, "very good": 31, "terrible": 0, "excellent": 27}, "aka": "Clodia Hotel Sirmione", "slim_ranking": 0.537313432836, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}}