{"user_rating": 4.0, "review_count": 349, "name": "Hotel dei Borgognoni", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "Hotel Dei Borgognoni is right in the historic center of Rome, Perfect! Quite too!! They have a nice breakfast, very relaxing bar and aera, Wi-Fi Internet connection and they also offer limousine service and a guarded car parking. The staff was very very helpful! Also when you walk outside turn right and go 10 yards and on your right is a Eurospar market, where you can in the back have the meat counter put together a very fresh sandwitch with fresh bread, cheese and fabulous meats.(cheap!!) pick up some fruit and your good till dinner!!", "title": "Very nice hotel Great location", "helpfulness": 4, "user": "skylane9", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124910128}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband I stayed for 4 nights at the Hotel dei Borgognoni in October 2011. It's in a great location between the Spanish Steps and the Trevi Fountain, tucked away on a quiet street. Our stay there was less than great. Our first room was terrible (room # 404) - the bed was very uncomfortable, it sagged in the middle; the room was extremely small; and the shower was awful. The half glass door in the shower did not keep in the water and each time we took a shower, the entire bathroom got wet. There were puddles all over the floor. The front desk staff at the hotel is hit or miss (like I read on another review). We told the front desk about the issue and the man called maintenance and brushed us off. That same front desk clerk gave us very bad directions to the Borghese Gallery. The next day we complained about our room to a different front desk clerk, who was very nice and helpful. They moved us to room 307, which was much better - the bed was very comfortable, the room was spacious and we didn't have any trouble with the shower. If we would have had room 307 the entire stay, our review would be much different and more positive overall. The decor in the hallways is very dated and in desperate need of updating. The breakfast was okay. We would possibly stay at this hotel again based on location, but I'd want to ensure we'd receive a room like 307.", "title": "Great location, average hotel", "helpfulness": 3, "user": "Alicia D", "date": "January 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123939863}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My family and I had such an excellent stay at this hotel. The beds are clean, the floors are well kept, all appliances work, the bathrooms are in great shape and are beautiful! I definitely recommend this hotel to anyone who travels to Rome. The view is also beautiful.", "title": "SIMPLY INCREDIBLE!", "helpfulness": 3, "user": "veronicamorali", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121596124}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The location is great too, it is close by to many restaurants and is only a 4 minute back to the very heart of Rome. I had an awesome week staying in Hotel dei Borgognoni.", "title": "What a Hidden Gem!", "helpfulness": 7, "user": "jgentner", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120289953}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My wife and I recently took a 3-week trip to Italy. We stayed in Rome the first 3 nights and the last 2 nights of our trip. For our last two nights, our travel agent booked us at Hotel dei Borgognoni. What a wonderful hotel! Tucked away on a very quiet street but near everything (shopping,Trevi Fountain, Pantheon, Piazza Navona, Spanish Steps, good restaurants) we thoroughly enjoyed our brief stay there. The staff was very attentive and helpful, too. This is a smaller hotel (about 50 rooms) so you get more attention to detail. The room was not huge but quite adequate and the bathroom was very clean and a nice size. Lots of closet space, too. The morning breakfast was very nice and served in a quaint, quiet dining room, just off the main lobby. You could tell that the other people staying at this hotel also enjoyed the quiet atmosphere. WiFi was available in the very large and comfortable sitting area of the main lobby. We could walk to almost any of our destinations, which was an added bonus. On our next trip to Italy, we will insist on staying at Hotel dei Borgognoni.", "title": "Great Location but Not Fancy", "helpfulness": 2, "user": "VicRoc62", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 118850179}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My wife and I stayed here after a two week tour of Italy and the hotel didn’t disappoint. Very centrally located, we walked to all the sights we wanted to see again. The hotel staff was very friendly and the grocery/convenience store next door was great. The room was cozy with a very comfortable bed (rare in Europe from my experience) . The hotel is very close to the Spanish steps, but far enough around the corner to remain quiet. Can’t say enough good things about this hotel.", "title": "Great Location and Service!!", "user": "aspiringwrldtravller", "date": "June 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112509178}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We recently spent five days at Hotel dei Borgognoni and it was wonderful. Vincent and the staff at the hotel were fantastic and very helpful. The breakfast was good each morning and the location of the hotel was fantastic. The rooms were not very large but we expected this because Rome is a very old city ( which is what we love about it) The bathroom was large, the room was quiet and clean! We were able to walk everywhere!", "title": "We loved it and will be back", "user": "Nina1959", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111952046}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Grazie mille Vincent! Addio finché non ci incontreremo di nuovo!", "title": "Loved it! The perfect hotel in a perfect location!", "helpfulness": 4, "user": "JanineLP", "date": "May 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109220334}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We spent our last three nights of our european vacation at the Hotel dei Borgognoni and we couldn't have been happier. We loved this hotel!", "title": "Great Location, Good Hotel", "helpfulness": 2, "user": "Spiritflame", "date": "May 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 109101482}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The rooms are amazing, the location is perfect, and the staff are exceptionally friendly and helpful. I spent a lot of time researching hotels in Rome and this hotel exceeded our expectations. I would highly reccommend spending some time at this hotel on your next visit to Rome.", "title": "Great Hotel, Great Location...........", "helpfulness": 2, "user": "5POINT56", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108611201}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Great location. Nice breakfast with nice wait staff. Front desk is hit and miss, some polite and helpful, others not. Tacky wifi policy. You have to pay for wifi (which costs the hotel nothing) and it is only available in the lobby even though you are paying for it!. Tip: we had an inner room and if you open the window and place your device near the open window, you can catch the wifi.", "title": "great location but lacklustre hotel", "helpfulness": 2, "user": "ela127", "date": "August 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 3.0}, "id": 117032922}, {"rating": 5.0, "title": "So pleased with our choice", "text": "Having never been to Rome before, we did a lot of online research before choosing this hotel. Location: perfect. Ambiance: wonderful. Cleanliness: No complaints at all. We would absolutely recommend this hotel.", "helpfulness": 2, "user": "SallyEF", "date": "July 16, 2011", "id": 115419608}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Home last night from 5 nights at this hotel. My room, 101, had the dirtiest, nastiest carpet i have ever encountered in my life, let alone in a hotel room. An utter horror! The wallpaper is an expensive fabric type which too is old and dirty and should have been replaced several years ago. Room was very small but quiet (apart from about 30 phone calls one night from kids in another room-we tried to call reception, etc. but no one answered so we disconnected phone). Pay-per-view films stops on its own and e-mail service drops out but at 19 Euros for 24 hours (packaged) is good value if you watch a few films in the evening . Air-con is dirty as too are extractors in bathroom which have caked on dust. Water pressure in shower is very good. Location is very good indeed. Breakfast is good and staff efficient. The bathroom was very clean and tidy. No sure about pillows or mattress age. This is NOT a 4 star hotel by any shape of the imagination. Putting aside the disgraceful carpet it makes a 3 star, which for what i paid is an outrage. I would not go back as there of plenty of other hotels in the vicinity.", "title": "DIRTY CARPETS", "helpfulness": 2, "user": "SDMLondon_Bangkok", "date": "July 8, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 115143522}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The Hotel Dei Borgognoni, has a lot of things going for it: Clean, comfortable rooms, a fine selection at its continental breakfast, but the two best things about this hotel are: Number 2, it's fantastic location right in the city centre. 3 - 4 minutes walk from both the Spanish Steps and the Trevi Fountain, it is an ideal base to explore all of the major sites that Rome has to offer. However it's Number 1 feature is the Staff. We have never come across a collective group of people so polite, jovial, helpful and accommodating as the staff at this hotel. Nothing was too much trouble for each and every one of them, they made our 4 night stay there truly memorable.", "title": "I cannot heap enough praise on this hotel!", "helpfulness": 3, "user": "djkelly46", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114582959}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Stayed here for the first 3 nights of our honeymoon. We were lucky enough to be upgraded to a jacuzzi room. The hotel is in a great location. 5minutes from both the Trevi Fountain and the Spanish Steps. Our room was great, nice size, comfy beds and large bathroom.", "title": "Great hotel in a great location", "user": "yorkshire_pad", "date": "June 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114226259}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed at the Borgognoni from the 19th sept. to the 23rd ,We found the hotel very clean and comfortable,The staff are all very friendly,The breakfast is very good with lots of choice,The position of the hotel is exellent it is near the trevi fountain. We had a lovely holiday and would certainly stay there again.", "title": "A great place to stay", "helpfulness": 4, "user": "Susan E", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118601402}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We loved this little hotel on a quieter street than most near the Trevi. We booked the least expensive double and asked for the best air conditioning. The room was as cool as we wanted while outside Rome sizzled. The staff was very helpful trying to get our lost luggage, making phone calls and giving us free internet access. Although we never got our luggage we still had a fantastic time. Bed was comfortable and the bathroom was attractive and clean. Check out the Market next door! We enjoyed wine, cheese and prosciutto in the terrace off the 1st floor of the hotel. It's a secret little garden with a few chairs and lounges. Not fancy but peaceful. The breakfast was good and enough to carry us through the day. I would stay here again!", "title": "NICE HOTEL AND LOCATION", "helpfulness": 4, "user": "LORRIE P", "date": "September 18, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118252537}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Great location and hotel provides all the basic quality services-- room is good size, clean and bed was comfortable. While room is modern, hallway furniture and ambiance is very dated.Breakfast is basic but good. Staff pleasant and helpfull. Easy to get to all sites in Rome from the hotel by walking.", "title": "Good location and decent hotel ( not memorable)", "user": "BobbyNY", "date": "September 14, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 118128525}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "(+) an excellent location. most of city attractions are in the nearby. Breakfast seems to be poor at the first glance, but really they offer almost all what makes good one.", "title": "excellent location", "user": "44yrswithfamily", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 118013903}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "(-) rooms not spacy. limited free internet: no free internet in rooms, only 1 hr/day in lobby.", "title": "Perfect location, Perfect choice.", "helpfulness": 2, "user": "kenmac33", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117934853}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 18, "average": 37, "very good": 134, "terrible": 5, "excellent": 155}, "aka": "Dei Borgognoni Rome", "slim_ranking": 0.144435674822, "description": "Boutique hotel with 51 rooms ( 4 star superior) all renovated recently. Free WIFi in all public areas is available. Garage and two Meetings rooms are also available for all guests. Dei Borgognoni is located in the best area of Rome, just 4 minutes to the Spanish Steps and via Condotti, and 3 minutes from the Trevi Fountain."}