{"user_rating": 4.5, "review_count": 584, "name": "Hotel Catedral", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the Hotel Catedral for one night, prior to taking an early flight the next morning.", "title": "Hotel Catedral has what we needed", "user": "Don_Cuevas", "date": "October 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10110810, "likes": {"liked": "— Price, cleanliness, comfort, free wi-fi in rooms, professional staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "Although it was impossible at the time for our cab to approach the hotel any closer than the corner, due to the crowds of ambulant vendors (since removed, I read), it was only a short walk to the door. We were greeted by smiling bellhops, to whom we gladly gave our bags.", "title": "Great place", "helpfulness": 2, "user": "p1ggyw1g", "date": "October 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 10061779, "likes": {"liked": "— clean, efficient, attractive, location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Check in took a few minutes, with a 10% discount applicable if paying in \"efectivo\" —cash. Service was professional.", "title": "Great hotel Excellent value", "helpfulness": 2, "user": "artman", "date": "October 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10046392, "likes": {"liked": "— location, very clean", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We were escorted up to an attractive room on the 6th floor, in the center of the hotel, well away from the disco. The room had a window onto an airshft, which was fine with us, as we were there to sleep before our flight.", "title": "Great Hotel in great location", "helpfulness": 1, "user": "Curlisue", "date": "October 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10033225, "likes": {"liked": "— Service was very good", "disliked": "— Elevator was slow"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We went down to the bar to unwind, and had a beer and a Tequila a la bandera, at reasonable prices. We didn't try the restaurant.", "title": "Excelente ubicación en el DF", "user": "crislab4", "date": "September 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8719959}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We stayed at Hotel Catedral for 1 week in late November. The staff was friendly and very helpful. The rooftop patio was a nice place to wind down at the end of the day with litre bottles of sol from the 7 11 on the corner (16 pesos per liter). The bar behind the hotel was noisy thursday to saturday but we were not expecting peace and quiet in the center of Mexico City anyway so it wasnt a big deal. The beds were really hard but after a full day of walking around we fell asleep easily. All in all the hotel met and exceeded our expectations it is in a prime location and the price was right.", "title": "Great hotel. Brutal tour", "helpfulness": 3, "user": "Noroldan", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 11487192}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The tour on the other hand was a nightmare. We had taken the same tour from Roldan travel 2 years ago on a previous trip to the city. That one was great, very informative and interesting. Therefore we had high expectations for this one as well. We had friends travel with us and told them how great the pyramids would be and how much fun they would have. Wrong. We met our guide at the Cathedral of Guadalupe as we were joining a tour already in progress. We waited for 15 minutes for a inconsiderate lady who was more interested in shopping than going to the pyramids. She is a whole different story I wont get into that it is still too fresh lol. On the way to the pyramids we stopped at a obsidian art factory. Had a tour of the facility and were then rushed into the store to have the chance to spend thousands of dollars on masks and figurines. No thanks. Where are the pyramids? After the tourist trap we arrived finally at the pyramids. To truly appreciate where you are you need to spend at least 3 hours. We had 45 minutes (inconsiderate shopper strikes again at the mask factory).", "title": "Very Convenient, Clean and Quiet", "helpfulness": 3, "user": "GenieC", "date": "December 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11227685, "likes": {"liked": "— Location and price"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "After an uninformative tour compared to our last tour experience we were brought to the \"International restaurant\" for lunch. We were told the house specialty was great so we decided to try it. 150 pesos but good food. We were asked if we like guacamole to wich we answered yes. We were brought a little bowl of guacamole, 4 chips and 4 pork rinds. When we got the bill we found out they charged us 100 pesos for 1 peso worth of guacamole. So instead of spending 1 hour more at the pyramids we were brought to a tourist trap and hosed on guacamole. Not a happy tour van after that. So dont use Roldan tours. Try someone in the Zocalo and whatever you do dont order the guacamole. Made my wife ill at the end of the day.", "title": "Great Value for money!", "helpfulness": 2, "user": "jameshogg11", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 11055893, "likes": {"liked": "— price and location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Stayed for 6 days. Although one street behind the Zocalo, it was quiet, clean, felt very safe, convenient to the Metro, and walking distance to many important sites to see in Mexico City. Would stay there again!", "title": "Hotel Catedral – mostly fine but with some big caveats", "helpfulness": 5, "user": "Tara3056", "date": "November 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 10796992, "likes": {"liked": "— price and location", "disliked": "— The roach in my room, the beds/pillows, and the travel agency."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "My fiancee and I stayed at the Hotel Catedral for 5 nights in November 2006 (finally got round to writing this review a year later!) ...we chose this hotel purely by reading the reviews on Tripadvisor, and it was certainly a wise decision. The Hotel itself is situated behind the main 'Zocalo' square and the Cathedral (hence the name of the Hotel) - the hotel porters were very helpful and friendly, and almost all the staff spoke enough english, although I tried to communicate in Spanish with them most of the time, which was well received! The entire hotel is clean and tidy, there were always at least two or three members of staff on the reception if you needed anything. There is a restaurant in the hotel but we only used it once or twice for breakfast (until we discovered Sanbournes!) but the service and quality was fine. We decided to go for the Junior Suite which had a gigantic bed (possibly bigger than king-sized??) and a power shower and jacuzzi in the bathroom...I can't remember exactly how much it cost now but it was something like £25 per night which was fantastic value. The hotel staff were always happy to help if you wanted to know anything, and the bar staff were friendly and made us some great cocktails. Overall I would give the hotel 10 out of 10 considering the price we paid, and would definately stay there again if we ever return to Mexico City.", "title": "Great location!", "helpfulness": 1, "user": "TravelinPeach", "date": "November 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10786697, "likes": {"liked": "— The yummy breakfast!", "disliked": "— Having to pay for the internet."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Catedral Hotel is located in the Historic District of Mexico City and walking distance to many attractions. This hotel has a staff that is pleasant, and willing to help. Their meals were delicious and you can get a package with or without breakfast. I would get the package with, as many people from the street came to eat here. Rooms are fine, but not what you would call first class. The beds in the double rooms are harder than those in the King size rooms. There was street noise during one night of our stay that went until 2:30 am (excavation of site next door), but the hotel has no control over the noise other than to call the police, which they did. The other three nights there was no noise. I would stay here again in a heartbeat. I would call this place very quaint and worth the money.", "title": "Great price/Great location/and nice to boot", "helpfulness": 3, "user": "teach2nd", "date": "January 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 12453802, "likes": {"liked": "— Location and value", "disliked": "— firm beds"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "After reading a lot of excellent reviews, we chose this hotel for our trip in September, and it was not a disappointment. The location, right next to Zocalo is very suitable to take the subway and tourist buses. The old streets around are really charming.", "title": "Great location, great value", "helpfulness": 5, "user": "Labeep", "date": "January 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 12278708, "likes": {"liked": "— Location, roomy quarters, friendly staff", "disliked": "— View"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The room was clean, the staff was friendly and competent and as booked a suite, we had a big room, extremely comfortable. They have a nice restaurant and a bar, with fantastic margaritas!", "title": "Good Value, Great Location", "helpfulness": 4, "user": "Pococurante", "date": "December 29, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 12050932, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Definitely my choice for next time I go to Mexico, I am very happy with the hotel", "title": "Great Hotel for the Price", "user": "stickerj", "date": "December 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11874501, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "We just returned from 10 nights at Hotel Catedral. Overall our experience was pleasant. For 9 of 10 nights we had a room with a window over an atrium. The price included breakfast, the bathroom was clean and nicely laid out and the room, although somewhat plain, suited our needs. There was considerable noise from the hallway, which could have been addressed with a sign reminding people to keep quiet in the halls. The room did not have a reading light beside the bed or a clock radio. The carpets are a little dismal. The mattresses, although fairly old, were comfortable enough after a day of walking.", "title": "Would do it again", "helpfulness": 1, "user": "Native_Mexicana", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11611474, "likes": {"liked": "— Cleanliness and location", "disliked": "— Construction next door during the night hours"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "The visit was good to the hotel. We stayed there 5 nights. The rooms were fine, a little worn, but not bad at all. Most of the staff could speak and understand English. The restaurant onsite was ok, nothing great, but still good. We opted to include breakfast with the room price. This limits your choices on the menu in the morning. I would probably say just pay for the room and do breakfast on your own. The beds were very firm and there were no hand towels or washcloths in the bathrooms. My room didn't have a water-filter in the bathroom, so they put a couple bottles of water in the room.", "title": "It was good...", "user": "westashleyguy", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 10775558}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "On a side note, the travel agency in the hotel is convenient, but not the best choice. The tour of the pyramids we booked wasn't too expensive, but we kind of felt mislead. We were told we would have 4 hours at the site. Well, not really. When we got there, we had to spend almost an hour at this gift shop looking at overpriced souvenirs. We had less than 2 hours at the pyramids because we had to meet for lunch. So, then we have to go have lunch at this overpriced restaurant. I wonder how much in kick-backs they got from all that. We felt really rushed at the pyramids.", "title": "Excellent Value and Great Location", "user": "Persia69", "date": "November 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 10740693, "likes": {"liked": "— location and value for money", "disliked": "— on a main street so a little bit noisy."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We travelled from Sydney to Mexico City and were so happy we booked this hotel for 6 nights. From check in to check out nothing was too much trouble for the staff. We had no problem with the language, our room was clean, we had a balcony with great views and there is even a filtered water tap in each room. The hotel is in walking distance of the major sights in Centro Historico and there are great places to eat and shop nearby. The travel agent at the hotel booked trips to the pyramids/shrine and Taxco for us and we had the best time-very professional. We had breakfast included and the food was delicious and authentic. If you reserve your room using their website, pay when you leave you get a 10% discount by paying in pesos.", "title": "A Great Place to Stay in D.F.", "helpfulness": 1, "user": "DevelopmentGal", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 10448369, "likes": {"liked": "— The staff", "disliked": "— Street noise"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed here for 6 nights while visiting our daughter. The hotel is centrally located to many of the City's sights and the staff, as others have mentioned, were outstanding.", "title": "Cheap, nice hotel in excellent location", "helpfulness": 2, "user": "banika", "date": "October 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 2.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10410662, "likes": {"liked": "— location", "disliked": "— cleanliness...."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Unless you have the ability to sleep through all kinds of noise, I would strongly advise you to ask for an interior room. We spent the first couple of nights in a room that faced the street and it was really noisy. After switching to a room facing the large interior airshaft (that sounds icky but it really wasn't -- the \"view\" of the street is actually less attractive than the airshaft) we were rewarded with a truly quiet nights' sleep. The staff was very pleasant and efficient about making the change for us.", "title": "Glad We Chose This Hotel", "user": "blurkee", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 10242496, "likes": {"liked": "— Location, helpful staff", "disliked": "— Noise could be a problem"}}], "location": {"country": "Mexico", "region": "Central Mexico and Gulf Coast", "city": "Mexico City"}, "variance": {"poor": 14, "average": 45, "very good": 227, "terrible": 9, "excellent": 289}, "aka": "Catedral Hotel Mexico City", "slim_ranking": 0.148698884758}