{"user_rating": 4.0, "review_count": 62, "name": "Hotel International", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "We were on holiday in lindos but decided to have one night in Rhodes town to give us time to explore the old town. It is an hour and half on bus and last bus around 9pm, and thomson evening trip cost around £50 per person. it cost less than this for bus, b&b, dinner and we had more time to enjoy Rhodes town. Found this hotel on trip advisor. Very happy with our choice for a short stay. Clean and comfortable hotel in a good location in a quiet residential road. close to beach, harbour, new town bars and restaurants, and a short walk to the old town. Very helpful and friendly reception. Breakfast, better than suggested by other reviewers, can be taken on the small terrace.", "title": "B&b in Rhodes town cheaper than", "helpfulness": 2, "user": "eiluvtravel", "date": "October 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 182444676}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Visited in October. Was given last room not to my liking . Moved to 4th floor double bed ,no problems except shower in this room had to be hand held,absolutely useless as their was nowhere to hang shower in order to get proper wash without soaking entire bathroom floor,room 410. Manager said this would be fixed during closedown period. Room was fine,breakfast perfectly satisfactory and very helpful friendly staff. Manager let me have room untill I left early evening as end of season meant it would not be needed next day. Nice gesture Very convenient in new town with wide choice of eateries,shops, hire co's etc.", "title": "Good value hotel", "helpfulness": 2, "user": "mapmad_10", "date": "October 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 182281524}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had a wonderful welcome on our return visit to Hotel International - Prokopis and his friendly staff all welcomed us back. We stayed for two weeks and it was just as comfortable as we remembered. It is still great value for money and situated in such a good convenient position.", "title": "Warm welcome return", "helpfulness": 3, "user": "RandJSpalding", "date": "September 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177930176}, {"rating": 5.0, "title": "Clean, quiet and friendly", "text": "It was all we expected from a two star hotel. The room was clean, comfortable and quiet. The a/c was powerful, which is crucial in a place like Rhodes. The staff was very helpful and friendly, they let us use the room after checkout hours, thanks to that we could go to the beach one more time. Elli beach is like two minutes of walk and the old town is also close by.", "helpfulness": 4, "user": "Umur_133", "date": "August 10, 2013", "id": 171559368}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We were 3 groups of friends and the other two had problems with their hotels due to noises and a/c, but we were very happy with International. I'd stay there again.", "title": "THE TRUTH ABOUT THE INTERNATIONAL HOTEL", "helpfulness": 3, "user": "IthePerson", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171090672}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 2.5, "variance": {"poor": 3, "average": 8, "very good": 26, "terrible": 1, "excellent": 24}, "slim_ranking": 0.227790432802, "description": "International Hotel is situated in a quiet spot, in the center of Rhodes town. It has 42 tastefully furnished rooms, all with a private shower, toilet, spacious balcony and direct dial telephone as well as air-condition and TV. A large variety of drinks can be enjoyed in it’s bar. The Mandraki Marina, the Casino, the old town and the wonderful “Elli” beach (with all kinds of water sports and tennis court) make International Hotel, ideal for those who prefer the friendly, personal and relaxed atmosphere of a family-run establishment."}