{"user_rating": 4.5, "review_count": 775, "name": "Hotel Heritage - Relais & Chateaux", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We had a suite with a beautiful room and a smaller room (supposed to be a small office) for my son both equiped with big 16/9 flat screens PLASMA TV. close to my sons bed was a BOSE radio with cd with an amazing sound. you can hear it loud it will not disturb anyone, the walls are real... The bathroom is equiped both with bath with jaccuzi + a top shower. All the bathroom products are made by Hermes and are really amazingly good quality.", "title": "The best spot in Brugge", "user": "jeremy9835", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77289111}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The luxury was better than expected. They have a beautiful 13 century basement equiped with sport and training accessories, there is also the hammam and the sauna, all beautiful and extra clean. The hotel is not so big, but we felt better than at home...", "title": "Small but efficient, excellent location", "user": "MariaSteen", "date": "August 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 76404237}, {"rating": 1.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "the continental breakfast is more than enough unless you need 3 meals instead of one in the morning or if you REALLY need the english or dutch breakfast but as a european citizen the breakfast is more than enough : coffee, tea, warm chocolate for my son, different kind of breads, honey and jam, plus croissant s and chocolates croissants...", "title": "Looks chique but does NOT live up to any expectation", "helpfulness": 2, "user": "greet680682", "date": "August 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 75157193}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "we enjoyend our stay very much and will recommend this hotel for friends or will even come back by ourselves when we have the time again", "title": "Just Lovely", "user": "walkeraz", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74924797}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We stayed 3 nights. Beds are excellent. PC and free wifi makes life even more pleasant. Continental breakfast is so-so. Very pleasant service. Public parking very close by. Location is excellent. We really had a very relaxing stay in this hotel.", "title": "A perfect stay: beautiful hotel and incredibly helpful staff", "user": "andrewmac666", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73559554}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Only an overnight stop but as always it has been a pleasure. Isabelle and all the staff are so helpfull. Will be be back again in December for the wonderful Christmas Market.", "title": "Our Hotel of choice in Brugge", "user": "chris2307", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72978457}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Stayed here to celebrate our silver wedding anniversary and found the hotel to be exactly as the reviews say. Friendly, efficient and pleasant staff, beautiful furnishings and excellent breakfast. We will certainly return.", "title": "An excellent hotel, friendly service, beautiful furnishings.", "user": "JayBee50_10", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 72677408}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "This hotel was exactly what we had hoped for on our first visit to Bruges. A hotel full of character with an excellent central location.Excellent friendly staff at all levels all keen to help. Ther breakfasts were possibly the best we have encountered in many years of holidaying or indeed on business trips. Bruges is an expensive city but this hotel provided value for money. If we return to Bruges it will be our first choice.", "title": "If you wish an elegant hotel in the centre of Bruges you can do no better.", "user": "johninverurie", "date": "July 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70722281}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "Five star service in an affordable four star hotel. Admittedly the view out of our particular room was lousy, but the room, amenities, and service more than made up for it. We weren't there for the view anyway - the best view of Bruges is be out and in it! Locaton was perfect, buffet breakfast was generous, internet available throughout the hotel. Sorry we forgot to use the spa and fitness room - they were lovely. I would have to agree with the previous comment regarding the front entrance and the security of the hotel, but the rooms were solidly secure and I never really worried anywhere in Bruges. If I was a travel planner, this would be one of my first choices to book. In fact I would go back to Bruges specifically to stay there. Many thanks to the staff for the multiple ways they made our stay perfect, including their help with our departure to the next city.", "title": "Felt like a special guest in a family home", "user": "GoGirl45", "date": "July 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70655617}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Relying on reviews on tripadvisor, we chose the Hotel Heritage for a special weekend to celebrate my husband's birthday. The hotel did not disappoint. The staff at reception were friendly and helpful, giving us bus information, reserving a canal boat trip and recommending restaurants in the area. The room had a luxurious feel with very comfortable beds, lots of pillows, a large screen TV, a table and two chairs. The bathroom was clean and provided upscale amenities, big fluffy towels and shelves for our toiletries. The location of the hotel is ideal, close to the busy market square but on a fairly quiet side street, except for the construction opposite, which really didn't bother us at all. We left reluctantly, feeling pampered and vowing to return.", "title": "Rave review for the Hotel Heritage!", "user": "pelbro", "date": "July 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70111807}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We had a terrific stay at the Heritage in Brussels. The room was very comfortable and spacious as well as beautifully decorated. The best part of the hotel though is the Staff. Lin and An, as well as the Night Men, were so very helpful in promptly answering all our questions and handling any of our requests. They not only worked with smiles on their faces, but were eager to answer our many questions and make phone calls for us to help us out in any way possible. This was very much appreciated!", "title": "Wonderful hotel experience", "user": "larryoj", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70017888}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "When we return to Brugge, we will definitely stay at the Heritage.", "title": "A charming hotel with lovely staff in a great location", "user": "redpeter_10", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69414511}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "With the exception of the road works around the hotel( which, of course ,were completely beyond the control of the hotel) I could not fault the Heritage. From first stepping into the hotel where we were greeted by Mme Creytens we were made to feel very comfortable and welcome. All of the staff were charming and helpful. The room was pleasant, if a little compact. The restaurant food was excellent and the service first class. I would recommend the Heritage to anyone.", "title": "The Nicest Staff we've ever encountered", "user": "smreabold", "date": "July 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69387484}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "We were happily surprised with the charm and ambiance of this hotel in Bruges. I'm sure other travelers are like us and too worried to try a new place. We can confidently say it was very clean, the beds are heavenly and the nicest, most efficient staff we've ever encountered.", "title": "lovely hotel", "user": "reb1278", "date": "June 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69212893}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Carlsbad, Ca.", "title": "A Charming Hotel Surprise in Bruges, Belgium", "user": "TuscanyBridgewater", "date": "June 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69144414}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "Having traveled most of Europe and having stayed in multiple Relais & Chateaux properties, I'd be quick to say this property is OK, but I felt it lacked the magic and lustre I've come to expect of the typically high standards of Relais & Chateaux.", "title": "For A Relais & Chateaux Property I Found It Quite Average", "helpfulness": 3, "user": "TurtleCreekTraveller", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 78337853}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I agree with most reviewers that the location is extremely convenient and the service was spot-on, but the facility, room, and services were a bit below what I expected. Chairs in the room had large stains, the room computer needed updated software and wouldn't display websites properly, and the sauna was unavailable during advertised hours of operation because it needed to be cleaned.", "title": "Lovely Hotel", "user": "bythebaytoday", "date": "September 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78248375}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "In the city of Bruges, food is excellent and pastries amazing, but the 20 Euro breakfast was again very unremarkable, with limited hot offerings and a very dull bread and pastry selection.", "title": "Superb hotel, excellent location", "user": "RickG23", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78030594}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Compared to some of the canal-side properties, the room views aren't anything special, though the room itself was fine save for the stained chairs. The bath struck me as more of a 3-star standard dressed up with Hermes toiletries.", "title": "Charming Hotel in fantastic location with friendly staff.", "user": "CMC037", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 77636703}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Bruges is an atmospheric city and experience, and if I'm fortunate enough to go back, I'll try one of the canal-side deluxe properties for comparison's sake rather than automatically returning to the Heritage, and for that reason I'm reluctantly not recommending it simply because next time I'd be on a quest for something I would prefer compared to this acceptable but uninspired stay.", "title": "Very nice hotel in fabulous location", "user": "gajolondon", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77543670}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "stars": 4, "variance": {"poor": 10, "average": 27, "very good": 168, "terrible": 8, "excellent": 562}, "aka": "Hotel Heritage - Relais And Chateaux", "slim_ranking": 0.0485436893204, "description": "The Four Star Relais & Chateaux Hotel Heritage is perfectly situated in the heart of medieval Bruges, Belgium. Recently renovated, the hotel features 4 luxurious suites and 18 stately guest rooms, many with views of the beautiful historic city. The hotel offers unmatched personalized service and available amenities such as sun-deck, sauna and solarium, full concierge, valet parking, NESPRESSO coffee and tea making facilities, 'Durance' toiletries, iPad with FREE wi-fi, fitness, salon, choice of continental and full Champagne breakfast and much more."}