{"user_rating": 2.5, "review_count": 85, "name": "Hotel Albert II", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed for 6 nights as part of a tour package including evening meals. The room and general service were OK but the evening meals were a great disappointment. The food choice was limited to two items per course which had to be ordered 24 hours in advance. Meal times were rigidly fixed and the food quality and qualntity was mediocre. All was explained when we discovered that the hotel doesn't have a kitchen and the food was prepared off site and brought in containers! Albert II is well situated in the town centre and OK for bed and breakfast.", "title": "Friendly staff but poor food", "helpfulness": 1, "user": "Lenticular", "date": "July 9, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 34341187}, {"rating": 1.0, "stay_parameters": "Stayed June 2008", "text": "I stayed at this hotel from 19th until 23rd June as a member of a group of 30 battlefield tour enthusiasts.", "title": "change of name but still very poor", "user": "PapaKent_UK", "date": "June 27, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 17291206, "likes": {"liked": "— Location near to bars and restaurants", "disliked": "— Condition, cleanliness and insecurity."}}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "stars": 2.5, "variance": {"poor": 14, "average": 21, "very good": 26, "terrible": 21, "excellent": 3}, "slim_ranking": 0.375, "description": "Come and experience the authentic, traditional atmosphere of the Hotel Albert II and stay right in the centre of the wonderful seaside resort of Ostend. With its simple and elegant decor, this homely hotel boasts cosy, comfortable accommodation. Go for an early walk on the beach, 150 metres from the hotel, or wake up slowly with a good cup of coffee before exploring the neighbourhood. Right around the corner from the bustling main square and next to several shops, bars and restaurants, you will always have some form of entertainment close at hand. Stroll along the wonderful marina and watch the ships of various sizes come in. The emblematic St Peter and St Paul's church is also a sight not to be missed."}