{"user_rating": 4.0, "review_count": 138, "name": "Hotel Ferrara", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Located in an ancient house, it is articulated in different floors served by a narrow staircase and a small elevator.: not so easy to move with big luggage. very large room, well equipped with TV and air conditioning, king size (very) confortable bed. large bathroom, with an useless hair dryier. Poor amenities.", "title": "Confortable and central", "user": "donnainviaggio", "date": "September 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141254087}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The breakfast is served inside and outside, in a small veranda, but the choice is limited to industrial products.", "title": "good hotel very poor breakfast", "helpfulness": 2, "user": "UKITALIA", "date": "May 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130512165}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "No parking inside: possibility of private parking in a closed area 10 minutes by foot, at a very reasonable fare (7 euros for more than 24 hours) or vauchers for public parking outside the pedestrian area available at 3 euros/day.", "title": "Wonderful Place to Stay", "user": "Rodney B", "date": "April 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127253920}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "Right in front of the Estensi castle, it's the ideal location to walk in the city center. Courtesy bikes are available.", "title": "Ferrara", "user": "Jamesstu", "date": "February 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 124801468}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Gentle and helpful personnel.", "title": "Central", "helpfulness": 1, "user": "stuart d", "date": "January 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 123608057}, {"rating": 3.0, "title": "Great Hotel, if you like paying 120 Euros to hear the word \"no\" a lot", "text": "We had an alright time here and the staff was generally very nice with a couple of exceptions. This was a bit under what we would normally expect from a 4 Star hotel. No free internet or Wi-Fi in the rooms for example - so doing simple tasks like checking email was a chore. The television only had a few channels, and the rooms were generally pretty modest in both size and appointment.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 4, 2011", "id": 120153519}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The location is exceptional, but not the only hotel in the castle square. The Annunziata is literally just a stone's throw away - has huge rooms - free internet the works for the same price.", "title": "This is my home away from home", "helpfulness": 1, "user": "sooner_orchid", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117235269}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "That said, the hotel's associated restaurant next door called \"Big Night\" is run by Diego who is literally a culinary genius and an effete professional in every sense of the word.", "title": "Great hip hotel", "helpfulness": 1, "user": "SharonRoseFlorida", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116525491}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I come to Ferrara quite often for work, so Hotel Ferrara has become my home away from home.", "title": "Good location in centre of town", "user": "smituk", "date": "June 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 113835957}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Staff are super friendly, food is great (let Diego choose or make something for you), I love the bicicle service to go around the city, and location could not be better. Fantastic view of the castle in front, and all shops, restaurants, and supermarkets whitin waking distance.", "title": "Great Location", "user": "krisandjase", "date": "October 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 85340990}, {"rating": 4.0, "title": "Lovely, but don't drink there!", "text": "We stayed one night, and had one of the apartments. Apartment was really nice, it and the hotel being decorated in ultra-modern style, and the price was great. Hotel is situated right opposite the castle in the centre of Ferarra - ideal location. However, a word of caution - don't order drinks there unless you are very rich! Drink prices are utterly breathtaking!", "user": "eqcons", "date": "August 21, 2009", "id": 38325191}, {"rating": 5.0, "title": "Wonderful place", "text": "The hotel was located just in the center of town. They lend you free bikes anytime you want. Breakfast is good. Lovely and helpful staff. The rooms are big, modern, pretty furnishment. I would go back!", "user": "helenbarcellona", "date": "August 24, 2007", "id": 8492767}, {"rating": 3.0, "title": "Liked the Ferara, but ...", "text": "The Hotel Ferrara is well located, across from the Castello Estense, modern, clean, with good service and a good breakfast. Our room was quiet, though small,as is often the case in Italy. Except for minor glitches, such as one suitcase rack for a double room, and a picture over the bed of questionable taste, the hotel cannot be faulted.", "user": "travelenthusiast070", "date": "June 5, 2007", "id": 7779500}, {"rating": 5.0, "title": "A New Definition of Luxury Service", "text": "Despite all this, we spent two sleepless nights at the Hotel Ferrara. The weather was already warm in late April, the room was hot and stuffy, with no through ventilation or fan, yet the airconditioning was off and would not be turned on until mid-May. We learned later that the city does not permit any hotel or business to use its airconditioning before mid-May.", "user": "sarahandandrea", "date": "May 25, 2007", "id": 7697675}, {"rating": 4.0, "title": "Civilised and central", "text": "We concluded that anyone interested in visiting Ferrara should either go when the weather is cold, providing that the city allows hotels to turn on their heat, or wait until after mid-May when hotels can use their airconditioning and guests may get a decent night's sleep.", "user": "geoffrey.hollis", "date": "September 12, 2006", "id": 5794319}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Very central, but good double-glazing means the lively nightlife in the square opposite the castle doesn't interefere with sleep at all - I had a castle-facing room and slept deeply. It's 36 degrees outside right now, so the excellent air-conditioning makes the difference between life and death. Rooms - clean, well-appointed and reasonably spacious (large bathroom with bath and shower). Breakfast - not a huge range (three cold meats, two cheeses, lots of pastries) but very adequate. Definitely would choose again if coming to Ferrara (and Ferrara is well worth multiple visits).", "title": "Excellent location, clean comfortable rooms, good air-con.", "helpfulness": 1, "user": "Professor_Null", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71217582}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Having visited Ferrara before, I chose this hotel for the location and the apartment facility. A family of four adults, we stayed for 2 nights. It's a pleasant 20 mins walk from the Station and check in went smoothly. Double bed in kitchen area and separate room with twin beds and roomy bathroom. All rather stylish but it was not Apartment 10 (described previously), so, not the largest or best situated but pleasing enough. Breakfast - rather nice setting with variety and lots of tasty pastries. Oh, and lots of English breakfast tea! The town is very lovely and easy to explore. Watch the bikes though - lots and lots and you need to be aware of them - all the time!! We chose to walk and included a stroll along the walls.", "title": "Location - you won't beat it", "helpfulness": 1, "user": "LsaKingswinford", "date": "June 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 68272578}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The hotel price was reduced before we arrived so didn't feel we had the best deal. Two places to eat which will not break the bank are \"Pippo\" via Saraceno - excellent quantities, good atmosphere and the staff were wonderful. Also, \"Este\" bar via Science.", "title": "OK, but not great, good location", "helpfulness": 1, "user": "Anders E", "date": "May 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 64473285}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "If my husband and I stayed again, we would opt for a hotel room.", "title": "An excellent hotel in a lovely city", "helpfulness": 1, "user": "Ken D", "date": "February 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 57226526}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Great location in the heart of Ferrara.", "title": "Penthouse Apartment Number 10", "helpfulness": 4, "user": "JChua", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52078268}], "location": {"country": "Italy", "region": "Emilia-Romagna", "continent": "Europe"}, "stars": 4, "variance": {"poor": 4, "average": 18, "very good": 65, "terrible": 0, "excellent": 51}, "slim_ranking": 0.157894736842, "description": "Located within the enchanting framework of the 14th-century Estense Castle, Hotel Ferrara is one of the most prestigious establishments in the city. Each room features a full HD LED TV with international channels and free Wi-Fi.A public shuttle to and from Marconi Airport is provided. The service runs from 05:00 until 23:00.Rooms have a classic design with wood floors and elegant furnishings. Suites includes a private wellness area."}