{"user_rating": 4.5, "review_count": 73, "name": "Hotel Kipping", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We stayed just one night to break up the trip from the Frankfurt airport to Prague. The hotel is very convient to the main train station. You can easily walk there even with luggage. It is nice and functional and worth the price. The breakfast was also good. In the evening we walked back to the train station and then into the old town which begins right on the other side of the train station. We were pleasantly suprised by our short walk through Dresden. It is a very nice medium size German city which has been rebuilt. It would be worth a longer visit.", "title": "Functional and convient", "user": "Robbed_John", "date": "September 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 44556804}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "I stayed at the Hotel Kipping one night as part of a Rick Steve tour. It is located very close to the train station in Dresden, yet I did not hear any noise from the trains. We ate a group dinner that was excellent at the hotel. I had fried my hair straightener in Berlin and was fortunate that a large shopping area is located north of the train station. This district is very modern, full of shops and restaurants. I found my new German hair straightener in a LARGE department store in this area.", "title": "Nice hotel, located close to train station", "user": "JHROrange", "date": "August 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 36755088}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I traveled on a single supplement and was assigned a cute twin bed room at the hotel. The room was nice sized, clean, and the manager was very nice. He first tried to help me with the hair straightener and when that did not work, he directed me to the correct store in the nearby shopping area. Breakfast was included in our stay.", "title": "Comfortable room and AC!!", "user": "rjpmdpa", "date": "February 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 25350657}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The historic area of Dresden is FABULOUS. Make a reservation for the Historic Green Vault (well worth it) and don't miss the Old Masters Painting Gallery. It is fairly small in scale, but it is mighty in masterpieces. I thoroughly enjoyed my too short stay in Dresden. Enjoy your time in this wonderful city!", "title": "One of my favorite hotels", "helpfulness": 2, "user": "RogerNBill", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8380929, "likes": {"liked": "— Breakfast", "disliked": "— Language barrier at times ( I speak no German)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "It was hot during our visit to Germany and this was one of the few hotels we stayed at that had AC. It was glorious. Oh, and the hotel was well-located near the train station and the Innenstadt as well as the Strassenbahn stops. Our room was clean and comfortable. Breakfast was very good. Parking was free and the hotel was easy to get to from the Autobahn. The staff was friendly and helpful as we planned our sightseeing. Dresden is definitely worth a visit. Mostly German and East European tourists, not many Americans. You get a good perspective of what it was like before the war, after it was annihilated on 2/13/1945, how it was rebuiltas part of the DDR, and how it is regaining its former glory after the reunification. Don't miss the Historical Green Vault- what an opulent collection of treasures from Augustus der Starke and other Saxon kings. You must buy your tickets online many months in advance (go to www.dresden.de or do a Google search--we bought ours in Feb for June). You won't regret it.", "title": "Older Hotel Close to Train Station", "helpfulness": 1, "user": "TravelbugUtah", "date": "July 22, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8213515}], "location": {"country": "Germany", "continent": "Europe", "city": "Dresden"}, "stars": 3, "variance": {"poor": 1, "average": 7, "very good": 25, "terrible": 0, "excellent": 40}, "aka": "Kipping Hotel Dresden", "slim_ranking": 0.0873015873016, "description": "Direct in the center, not far from the old city of Dresden and the main train station is the family run Hotel Kipping located. Within a distance of not even 2 km from the famous Sights \"Zwinger\", Semper Opera, the Dresden Castle, the Church of our Lady and many more, it is a perfect starting point for sightseeing tours in Dresden.It is one of a few Hotels in Dresden, which is still ran by a family. Furthermore it is independent from huge hotel chains, which guarantees to you a unique atmosphere whilst spending time in Dresden."}