{"user_rating": 4.5, "review_count": 899, "name": "Hotel Mazarin", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed at the Hotel Mazarin Saturday Oct 5-Tuesday Oct 8. We were on the fourth floor, in a king room overlooking the courtyard. The hotel is only about a block off of Bourbon street, but we could not hear any of the partying during the night. On Sunday night, late, we heard a loud person enter the courtyard (presumable on their way to their room), but it was brief and our room was so comfortable going back to sleep quickly was not a problem. The beds are very comfortable, and the whole room was clean. The only thing I did not like was the more open shower, which made it kind of drafty when you are trying to take a nice hot shower. On our last day I noticed that there was a light in the shower that was apparently burnt out or not hooked up, and if that was a heat lamp that would have solved the problem. The entire hotel is obviously recently been updated, so you still get that old boutiquey feel with modern and clean furnishings.", "title": "Great Experience", "user": "ErikaRKH", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180488627}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "We chose to eat every breakfast here every morning, and was not disappointed. Pancakes and omelettes made to order were fantastic, and everything else was fresh and tasty. The staff working breakfast were very nice, friendly, and helpful. We ate in the courtyard every morning except the last morning, just because it was a bit too cold. The old brick setting with the fountain is very charming.", "title": "Very nice staff and perfect location", "helpfulness": 1, "user": "Carole04", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180267889}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The location of the hotel could not be beat. We were able to walk all over the French Quarter, and there are many many restaurants, bars, and shops in easy walking distance. The hotel is just off of Canal Street, so we also walked there and took the St. Charles streetcar to the Garden District.", "title": "Great Location!!", "user": "wormer82", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180200991}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Staff at the hotel were very helpful; Ronaldo recommended a City Tour with VIP which was fantastic, as well as a walking Garden District and cemetery tour which was extremely interesting too. The desk staff were helpful at recommending restaurants and bars as well.", "title": "Loved this place!", "user": "mkendlehart", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180093931}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I stayed there for 2 nights while on business- The place is lovely- Perfect location. The staff cannot do enough for the guests. Only drawback: the room had a very noisy fan and a flush that came on all the time. Bedding is comfortable- I would return but would change rooms instead of staying in a flawed one...", "title": "Very accomodating", "user": "Paul M", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179989537}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "This was a great boutique hotel in the heart of the French Quarter, located on Bienville between Bourbon and Royal Streets. Everyone there was very friendly and informative with any request we had. The room was wonderful with a balcony and great view looking out over Bienville. The furnishings were beautiful; the bed was comfortable and the bathroom was spa quality. Loved the beautiful courtyard and the free breakfast each morning was wonderful with an incredible selection. I would definitely recommend the Hotel Mazarin.", "title": "Great boutique hotel", "user": "Connie B", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179971048}, {"rating": 5.0, "title": "Beautiful little gem!", "text": "First time in new orleans. My boyfriend and i are on a road trip on the way to San Diego and had to make a stop in LA. I must say this hotel was a goreous little gem not directly located in the center of the madness but close enough. Def in the downtown congested area but parking is right across the street in a garage and valet is super accomidating. We were hitching a 5x8 uhaul in the back of our 4 door sedan and it was not an issue for parking at all ($38 valet for oversized cars)", "user": "Jessica D", "date": "October 6, 2013", "id": 179945161}, {"rating": 5.0, "title": "Great location, clean rooms", "text": "Overall this is the perfect hotel to stay in! Modern rooms!", "helpfulness": 1, "user": "StacyPH", "date": "October 6, 2013", "id": 179911809}, {"rating": 5.0, "title": "Nice place", "text": "Everything about this hotel and location was perfect. The actual room was historic but with modern finishinhs. Very french! Chandaller", "helpfulness": 1, "user": "Jwlocal", "date": "October 4, 2013", "id": 179698390}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This hotel is located about 1/2 block from Bourbon Street where the nightlife is yet it is quiet enough to rest and relax when you don't want to be around Bourbon Street. We chose a room with a window facing Bienville Street and our door faced the inner courtyard which I would recommend because it appears some of their rooms either only face the inner courtyard with no windows facing the street or are located in a back sideyard area with no real views. The room was immaculate with tasteful decor. The breakfast included several hot and cold choices and was very fresh. You can catch the streetcar about 3 blocks away (5 minute walk) on Canal Street which I would recommend to see the different areas of New Orleans.", "title": "A gem of a hotel", "user": "MotownMo", "date": "October 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179453475}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This little getaway is right between Bourbon and Royal in the middle of it all and yet when you walk into the green courtyard you are whisked away from the noise and craziness of the French Quarter. The room was plushly furnished with a very comfortable mattress and high quality linens. The bathroom had a spa quality. The front desk was friendly and informative, check in was a breeze. We also enjoyed the free breakfast provided and were able to enjoy it in the courtyard. I would definitely recommend this as a good hotel for a weekend getaway in the French Quarter.", "title": "Delightful hideaway in the heart of the French Quarter", "user": "NinaB66", "date": "September 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 179122312}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Not your luxury 'big-boy' - but wonderful. Great location; super clean, modern room with tile floors, good bathroom and water pressure (petit king - no desk, but who needs it?), super comfy beds, bottled water, coffee maker. Friendly, helpful staff - anxious to please. Breakfast is so good, ample and will do eggs to your liking if you don't want scrambled. Lovely courtyard (busy, though) - we stayed on 2nd floor - NO noise at all. Room not completely dark at night due to shutters - bring a mask if it bothers you. You can't go wrong here - excellent in comparable price point. Thanks to staff at the Mazarin for a lovely stay of 4 nights.", "title": "Great all the way around.", "user": "69rjo", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179072839}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "It is not often I rate everything as excellent, but Hotel Mazarin deserves this rank. Located on Bienville, just around the corner from Bourbon St. We had a courtview room and never heard noise from the streets! Breakfast is complimentary and the omelets were delicious. All staff were friendly and helpful. Highly recommend this place!!", "title": "Excellent", "helpfulness": 2, "user": "Nicolepb", "date": "September 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178933623}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Picked this hotel via reviews and pricing. Definitely got value for the money. Hotel rate includes a hot breakfast buffet AND they do requests. Bottled water and a non-bar refrigerator are in all rooms. The staff is exceedingly friendly and helpful. Come to think of it, I don't think we met a rude person in all of New Orleans. The bathrooms are elegant and come with what I consider to be the proper amount of towels. The only negative that I have with this hotel is that the pillows are all of one kind and very hard.", "title": "Central Location for a Quarter Vacation", "helpfulness": 2, "user": "gnarfle23", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 178751620}, {"rating": 5.0, "title": "Great location, New Orleans feel", "text": "I stayed at the Mazarin for five days during a busy weekend and was not disappointed in any way. I have stayed in twelve different hotels in the quarter during the past 15 years and this is only the second time that I would \"do a repeat\".", "helpfulness": 4, "user": "bcqajbk", "date": "September 26, 2013", "id": 178737129}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed six nights in October 2013. We liked the place overall but didn't find it exceptional.", "title": "Nice but not exceptional", "user": "JeffStranks", "date": "October 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 180841462}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Staff are generally very helpful, especially at breakfast, though I heard a woman checking out who, when asked 'Did you enjoy your stay?', replied 'I've had better', and the person on reception shrugged it off with not further comment or questions - this was the same person who granted our request for a room change with very little grace.", "title": "Outstanding!", "helpfulness": 1, "user": "Mark S", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180832526}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We ended up in 209, courtyard superior king. I'd booked a Premium king first off, but it was a room (218) with a balcony street-side, and one night was enough (noise from revelers, cars hooting, street cleaning, you name it). The superior king was cheaper, bigger, more comfortable and quieter - so don't book a Premium King is my advice.", "title": "Love this place", "user": "Mary Ann T", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180580550}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Breakfast - not sure why so many people rave about it, it was exactly the same options every morning, no real choice of fruit, only fairly bland scrambled eggs (people here mention options but we were never told of any, or offered any). It offered what Americans seem to like (no disrespect) but Europeans or South Americans won't be impressed. And sitting in the courtyard is nice but far from comfortable. But, I repeat, the breakfast staff were delightfully helpful.", "title": "Top Notch!", "user": "Erica F", "date": "October 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180527003}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The room we ended up in was large, very comfortable, quiet - in other words, excellent. Very comfortable bed, cleaning was generally good too.", "title": "Best staff ever!!!!", "user": "Tutti306", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180501139}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 3.5, "variance": {"poor": 27, "average": 43, "very good": 203, "terrible": 8, "excellent": 618}, "aka": "Saint Louis New Orleans", "slim_ranking": 0.00671140939597, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A luxurious boutique hotel in the heart of the quarter. Enjoy the following complimentary amenities: Wi-Fi, Breakfast, Fitness and Business Center access, In-room Bottled Water & Coffee, Local Calls."}