{"user_rating": 3.5, "review_count": 185, "name": "Hotel Globus", "reviews": [{"rating": 1.0, "title": "Completely bad hotel", "text": "My husband and I and our two children travelled to Prag for the weekend, arrived at the hotel only to discover how bad this hotel really is. The staff are so unfriendly that it is unbelievable you would think you were in a horror film. The lady at the reception was uncoperative and unfriendly, the baggage man was a horror, smoked in the lobby, spat in the lobby on the carpet were my two children were playing, wanted to fight when you didnt give him a tipp for being UNFRIENDLY, Its completely unbelievable.", "user": "Arnela G", "date": "November 14, 2011", "id": 120565323}, {"rating": 3.0, "title": "Functional, no-nonsense hotel", "text": "The bathroom in the room was so dirty there was green stuff on the walls the room stank completely, and the worst is yet to come. There is no way of sleeping in this hotel, there was door banging the whole night and banging of bins by staff on the floor me and my family could not sleep the entire night, we had such a bad experience with this hotel that we had to leave a day early and we were still charged for the remaining night and the parking in the garage.", "user": "BerengariaLondon", "date": "October 28, 2011", "id": 119829142}, {"rating": 3.0, "title": "Good", "text": "I wouldnt recommend this hotel to anyone, as it will only spoil your holiday, it is unbelivable how bad this hotel is and how unfriendly and incoperative the staff are. People pay there money only to leave frustrated and exhausted.", "user": "monns99", "date": "October 2, 2011", "id": 118838720}, {"rating": 5.0, "title": "Lovely time spent here...", "text": "With a friend I spent three days in Prague on a city break. We had an early morning flight so arrived at the hotel (which is very well away from the centre) at about 10.30 a.m. We couldn't check in to the room, and there was no coffee or any refreshment available as breakfast finishes at 10am and the restaurant doesn't open until 11 a.m. So we left our luggage in store and went out for the day. The hotel is not far from the Roztyly metro station and the metro service is convenient, easy to understand, fast and frequent; but the station is at the bottom of a hill from the hotel so the climb back up would be tiresome in rain or with heavy things to carry.", "user": "sully13", "date": "September 19, 2011", "id": 118336528}, {"rating": 3.0, "title": "Basic with free parking", "text": "The hotel is modern, businesslike, and clean. The buffet breakfast is good. We had an evening meal in the restaurant on two evenings; the food and the service were good (the waiter was exceptionally helpful in advising on the menu) but on the second evening the place was full of smokers. (Czech Republic laws on smoking are different from UK laws). There was generally only one receptionist on duty and on our first day we had to wait twenty minutes to check in as she was dealing with several other visitors. There were lots of young people staying there so maybe they were students on a college trip.", "user": "DM2011", "date": "September 13, 2011", "id": 118047030}, {"rating": 5.0, "title": "Very nice hotel, definitely we'll come back", "text": "We stayed here for a week, last week in August.", "user": "locash", "date": "September 8, 2011", "id": 117836801}, {"rating": 1.0, "title": "Hotel Ripoff", "text": "The rooms were very clean and all the personnel spoke English so we had no trouble. We especially like they had someone at the desk 24h/7, as we had to leave at 5am and it was no problem with the checkout.", "user": "679disgruntled", "date": "August 18, 2011", "id": 116894667}, {"rating": 5.0, "title": "Worth it! plus 2 great restaurants near!", "text": "Location is very nice on the top of the hill, nice view of Prague in the evening, very close to Roztyly metro station, 15 minutes to the center, very nice location.", "user": "Nadya_Polina", "date": "August 2, 2011", "id": 116161044}, {"rating": 1.0, "title": "Don´t go here if you have children with you.", "text": "Breakfast was very nice. Same breakfast every day, but we didn't mind as it was our favourite: 3 or 4 types of bacon, eggs, 3 types cheese, sausages, cereals, milk, coffee, orange juice, apple juice, water, bread, cakes, jams, cocoa. It was bassically all you can eat. There was always plenty of food an places to sit even with 40 people in the room every morning.", "user": "adam-travaller", "date": "July 1, 2011", "id": 114923691}, {"rating": 4.0, "title": "Good choice", "text": "Very quiet, has a small restaurant, mall like the pub type, bar with coctails, massage chairs.", "user": "Konstpaus", "date": "June 13, 2011", "id": 113098705}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "For 35$ US per night you have : free parking, free breakfast, a clean room with two beds. I think it's the best deal i've seen in my life the hotels are quite expensive in Prague and in addition we got a room on the fourth floor with a view of the whole city! It's around 20 minutes by subway from the heart of Prague.", "title": "THE deal", "helpfulness": 2, "user": "traveller65432107", "date": "January 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 123747691}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "The only thing you can complain about is that the hotel is on a hill and you have to climb around 200 meters when you go back from metro...", "title": "Good hotel", "helpfulness": 1, "user": "petrcze", "date": "January 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123270165}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "If you are looking to stay in luxury go to expensive hotels in Old Town. This hotel is not right for you. If you are looking for cheaper, clean and solid accommodation, book it! This hotel has very good position close to the metro Roztyly, you will be in the city center after few minutes metro ride.", "title": "Great value for money", "user": "Vlamar07", "date": "January 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 122508795}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Low fees.", "title": "Decent enough but probably wouldn't stay again", "user": "AdvoKitty", "date": "January 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 122357096}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Free internet.", "title": "Great Location for the true traveller .", "user": "Geoff M", "date": "November 21, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120854036}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I spent four nights here earlier this month as part of a small conference group.", "title": "Outstanding value, but may not suit everyone", "user": "John987654321", "date": "March 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 126532799}, {"rating": 2.0, "stay_parameters": "Stayed March 2012", "text": "All the points I would make have already been made by others, but I would regard some of the reviews as unnecessarily negative.", "title": "A really bad experience", "user": "Radisce", "date": "March 17, 2012", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 126241252}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The public areas are indeed a bit shabby, but staff were without exception friendly and helpful. The rooms that colleagues and I were allocated were in very good condition and spotlessly clean; my bed was reasonably comfortable. The WiFi worked well throughout the hotel. The meeting facilities were good and we had no problems. The food service was consistently satisfactory but not particularly outstanding (although the goulashes were quite good) and the choices at each meal were limited - three alternative main courses with no choice of starter or dessert. Prices in the two bars were very modest. If you are not on an inclusive tariff or wish to forgo the included meal, there is an independent restaurant in a nearby building and of course many elsewhere in the city.", "title": "Perfect Hotel!", "helpfulness": 1, "user": "kelly b", "date": "March 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125751063}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The situation is excellent, on the edge of a forest park yet only a short walk (unfortunately, uphill!) from the Roztyly metro station. You can be standing in Wenceslas Square well within 30 minutes. Transfer from and to the airport by bus and metro is easy and inexpensive, taking about an hour.", "title": "This is the perfect place for the group we were with!", "helpfulness": 4, "user": "PaulHartog", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124420146}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The biggest down-side of this hotel for many ordinary travellers is probably that it is targetted at large groups, and the low price means that it is popular with tours for young people, who can be boisterous, noisy and over-eager to take advantage of the cheap beer. Also, smoking is permitted in the lobby and bar areas, as is apparently normal in the Czech Republic.", "title": "Only if you have to!", "user": "ccckb", "date": "February 9, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 124345960}], "location": {}, "stars": 3, "variance": {"poor": 20, "average": 38, "very good": 73, "terrible": 21, "excellent": 33}, "aka": "Globus Hotel Prague", "slim_ranking": 0.595839524517, "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.5, "location": 3.5}}