{"user_rating": 4.5, "review_count": 272, "name": "Hotel Mario's", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Based on the very favorable reviews we saw at TripAdvisor, we booked two rooms at Marios several months prior to our visit in October 2006. Upon our arrival, we were told that they could only accomodate one of the couples in Mario's, but that they had a property across the street that was of equal quality and price where they had reserved a room. It was not even close. The couple that stayed at Mario's had a good experience, a nice lobby, friendly staff and a good breakfast. None of those were true at the Hotel Mia Cara although their rate was somewhat less. Fortunately, we were only staying one night, but travellers be aware that you might get shuttled to another hotel, so make it clear in your reservation you want Mario's, not an alternative.", "title": "They put us across the street", "user": "Jeff_in_Colorado", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6013995, "likes": {"liked": "— Charm", "disliked": "— They moved one of us to another hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Mario's is a good value and is in a great location with easy walking access to the station and the heart of Florence.", "title": "Warm Friendly Family Atmosphere", "user": "rnblue", "date": "October 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5948581, "likes": {"liked": "— Location & hospitality", "disliked": "— Same breakfast offering every day"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This small hotel was the hit of our recent Italy trip. We stayed in 5 different hotels during our Itlay adventure, all were rated 4 or 5 star except Mario's. We were therefore somewhat apprehensive before arriving at Mario's ... what a mistake. The Hotel and staff were WONDERFUL. The hotel is small with only 14 or so rooms and we understand each room is somewhat different from the others. Our room was small (as are most European hotels), but very neat, clean, and efficient.", "title": "Great place", "user": "Katlehn", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5795029, "likes": {"liked": "— Location and Staff", "disliked": "— No bar fridge"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "The hotel staff goes out of their way to make your visit memorable. Every request we had was handled quickly and in full detail.", "title": "Loved this hotel.", "user": "croesio", "date": "September 9, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5783481, "likes": {"liked": "— comfort of rooms, friendlt owner", "disliked": "— first impressions of location"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The hotel's location is very convenient to all the major attractions. It is close walking distance to the Duomo and Uffizi (The hotel staff got us tickets in advance saving a very long wait in line), as well as a reasonable walk to the Ponte Vecchio.", "title": "We liked Mario's", "user": "Pepepetrov", "date": "September 8, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5782167, "likes": {"liked": "— Location", "disliked": "— Room facing the street"}}, {"rating": 4.0, "title": "Great Place!", "text": "We enjoyed a three day stay at this charming little hotel. It is a family owned business. All of the family members are wonderful hosts. Our room was pleasant and comfortable. The hotel is convenient to all the major attraction in Florence as well as a short walk from the train station. We were given good recommendations for restaurants. We hope to return to the Hotel St. Mario in the future.", "user": "Clear213", "date": "June 14, 2006", "id": 5347354}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "Our school groups and faculty use this 3-star quality hotel when we visit Florence, Italy. The service is outstanding and very helpful. During the non-summer season the rates at this hotel can be fantastic, but are still a bargain anytime in this city and you get your money's worth here for sure.", "title": "Best You Can Get and a Great Deal!", "user": "LonestarTCU", "date": "June 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5288865}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "There are several places to eat and drink on the same street as the hotel, but if you want more options they are mostly no more than 5-10 minute walk away. The rooms are nice, very clean, and are a good size!", "title": "Charming, friendly hotel", "user": "Billybase", "date": "April 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 4975549}, {"rating": 5.0, "title": "Loved Mario and his staff", "text": "It is very close to the main train station, but can be hard to find if you get off the train without knowing where you are going! Make sure you get a map and orient yourself well before setting off.", "user": "avante2", "date": "April 4, 2006", "id": 4933228}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We arrived late and they were waiting for us. Leonardo couldn't have been more helpful. he gave us directions and tips. He also recommended a great restaurant around the corner. We found this place to be clean, friendly and charming. It was also very close to the train station. The reception was on the second floor. Leonardo offered to help with our bags but we were fine with one flight of stairs. No elevator.", "title": "A good base in Florence", "user": "Silvertiger", "date": "March 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4689974}, {"rating": 5.0, "title": "We adored Mario's", "text": "We stayed here Feb. 20-22, and we loved this hotel! We paid only 70 euros/night through www.venere.com. We were not expecting much - the budget hotels we usually stay in are pretty basic. But Mario's was in a charming old-fashioned building, with spacious rooms furnished nicely. The bathroom was small, but clean, and the room was nice and warm (although the rubber sheets were a bit uncomfortable). The location is extremely convenient to everything. The staff is friendly and helpful. Breakfast is decent - croissants, rolls, yogurt, fruit, melba toasts, ham and cheese - nothing fancy but you get enough to eat.", "user": "pepoling", "date": "February 24, 2007", "id": 6835679}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Mario's is a great deal - a 3 star hotel for 2 star price, nice atmosphere and good location. Highly recommended - we will return.", "title": "Great little hotel!!", "user": "padanielle", "date": "February 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6829331, "likes": {"liked": "— Friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Wonderful stay at this hotel (16 Feb-18 Feb). Conveniently located close to Santa Maria Novella train station on side street (across from hostel, so can get a little noisy if you have your windows open); central heat in room; staff extremely friendly and helpful...provided us with a map of the city upon check-in and made dinner suggestions (that only locals know about, and they were right! No other tourists at the dinner spots, and DELICIOUS food!) and sightseeing suggestions; generous bedroom and bathroom size for European accomodations; in-room combination safe; good breakfast (pastries, jams, breads, Nutella, yogurt, juices and coffee). Very convenient to the center of Florence! A great find!!!", "title": "fantastic", "user": "rtboats", "date": "January 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6564254, "likes": {"liked": "— feeling completely at ease because of the great staff and inviting decor", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Mario's is a great place to stay in Florence. The staff is comprised of affable young Italian men, who are always willing to call a restuarant for reservations, reserve tours and Uffizi tickets, or confirm other hotel bookings if you are continuing your travels in Italy. I stayed with my parents in a triple room, and it was great, if a little chilly at times, since, like most buildings in Europe, Mario's does not have central heating. I mention this only for older travellers with bad circulation who may put a high value on central heating. Otherwise, put on a sweater, and enjoy this lovely hotel with a great location and inviting decor. The room was really comfortable, but only had one armoire. Again, not really a problem, it's just for your information in case potential guests in the triple room absolutely need to unpack their suitcases. Breakfast is rolls, yogurt, croissiants, ham, cheese, lots of fruit, and the staff will make you whatever breakfast beverage you'd like, including excellent cappucinos. I loved Mario's, and it is priced very reasonably for Florence.", "title": "Mario's, the perfect hotel", "user": "swiftbl", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6090192, "likes": {"liked": "— location and rooms", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "If I return to Florence, there is no doubt I will stay at Mario's", "title": "Perfect Hotel in a Great Location", "user": "GregComo", "date": "November 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6056692, "likes": {"liked": "— Location and price", "disliked": "— No elevator"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "We were traveling through Italy with a group of friends, all twenty-something. We are used to staying in Hilton, Hyatts, etc. and found this to be a very nice European hotel, but more of an inn by American standards. When we walked in we were pleasantly surprised. It felt so \"Florentine\" on the inside (the outside is a narrow street with unattractive buildings) with nice tile, couches and wood. It was clean and the rooms were large with nice furnishings. The breakfast room was spacious and there was a nice breakfast with fresh croissants everyday. The staff was very nice and helpful.", "title": "An Oasis in Florence", "user": "PNFranks", "date": "August 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 5606781, "likes": {"liked": "— The rooms and lobby", "disliked": "— The location"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled with friends", "text": "The only downside to this hotel was the location, sort of off the beaten path and across from a hostel. Everything in Florence seems smaller/closer compared to Rome but this hotel is somewhat far from the downtown, Piazza della Signoria and market area. If you don't mind a walk than it's fine. Other than that it's a great place to stay in Florence.", "title": "Awesome!", "user": "goosteroo", "date": "August 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5579819}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Great small hotel with great value! Leonardo, who works the desk there late nights is a total charmer. I remember many nights staying up and talking to him with couple of glasses of wine.", "title": "Great Experience!", "user": "callcntr", "date": "July 28, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5521882, "likes": {"liked": "— Location", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Charming place, good location", "text": "Will definately return!", "user": "spartac", "date": "July 16, 2006", "id": 5470185}, {"rating": 5.0, "title": "Relaxed + friendly", "text": "Family of 5 with two rooms. 5 min. walk from train and two minute walk to buses for day trips to Pisa, Lucca and Sienna. Staff was very helpful, everything clean, great price, and super cool A/C. decent size rooms one flight walk up (no elevator). Very european feel and easy walk to everywhere. Would stay again.", "user": "A TripAdvisor user", "date": "July 4, 2006", "id": 5423166}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 23, "very good": 105, "terrible": 3, "excellent": 131}, "aka": "Marios Hotel Florence", "slim_ranking": 0.20652173913, "description": "Hotel Mario's is a small, charming and warm 3 stars hotel in the heart of the city, between the main railway station Santa Maria Novella, the Fortezza da Basso and the Palazzo dei Congressi. Only 5 minutes walking from the Market of San Lorenzo and the Duomo square (Piazza San Giovanni ). Enjoy a real and typical Florentine hospitality."}