{"user_rating": 5.0, "review_count": 531, "name": "Hotel Le Manoir les Minimes", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My wife and I stayed 3 nights at this wonderful small hotel and really enjoyed our experience. We booked on line directly with the hotel and all of our inquiries were handled promptly and professionally.", "title": "Great View Great Hotel", "helpfulness": 4, "user": "Phillyfans", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7301383, "likes": {"liked": "— The personal touch provided by the staff", "disliked": "— Hand-held showers"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The hotel is beautiful with private off-street parking. It sits at the base of the Chateau Amboise and across the street from the Loire River. The views from the rooms are spectacular. We stayed in a standard room on the top floor. It was spacious with a king bed and modern bath. It had a hand held shower and no curtain, which we found a minor drawback. If I had the do it over, I would reserve a room on the second floor. Our room was great but I just got tired walking the two flights of stairs (bad knees).", "title": "The finest small hotel I have stayed in...", "helpfulness": 3, "user": "SunDiver", "date": "December 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6496107}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "It was less than 2 minutes to walk into town. The staff was terrific. They were very attentive to our needs and concerned that we were comfortable. They made sightseeing suggestions, gave great directions, made dinner recommendations that were spot on and even made reservations for us. Breakfasts were very good. We opted for convenience and did not go into town to eat. Bar service is available in the hotel with cocktails either in the very comfortable public rooms or outside on the patio.", "title": "Everything is Absolutely Perfect !!!!!!!!", "helpfulness": 8, "user": "ScooterG", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6015360, "likes": {"liked": "— Room, view, hospitality.", "disliked": "— the town market on Sunday by the river is an experience you don't want to miss."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "It is a great hotel with the perfect blend of professionalism and \"the personal touch.\" Amboise is a good spot to base while visiting the Loire Valley and Hotel Le Manoir les Minimes is the ideal spot to stay in Amboise.", "title": "Great Historical Hotel", "helpfulness": 2, "user": "mjgirl74", "date": "October 11, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5938650, "likes": {"liked": "— Beautiful, historic hotel. Very well maintained."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This is absoultely the finest small hotel you can stay in. I have stayed at loads of really nice hotels such as the Four Seasons, The Taj and the Ritz Carlton, but they cannot match the small hotel charm coupled with the exceptional service of le Manoir les Minimes. Beautiful rooms, attentive staff, a lovely collection of books in the library and a nice continental breakfast. You can tell class when you see it!", "title": "This is a true gem", "helpfulness": 4, "user": "Leyland-wanderer", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5902444}, {"rating": 5.0, "title": "Such a perfect little manor!", "text": "My mother and I stayed here for 4 nights during a trip to France. We were so delighted with our choice. It is such a beautiful place with stunning surroundings. The hotel was charming and cozy. The staff, particularly Pierre and Giles, were fun and so kind and helpful. Thanks for making our trip even more special! I couldn't imagine staying any place else in the Loire Valley. Amboise is a busy little town and a nice place for a base to see the chateaux with some cute little shops. Our dinner at Pavillion de Lys was one of the best meals we have ever had.", "user": "alocuzzam", "date": "May 4, 2010", "id": 63236930}, {"rating": 5.0, "title": "Charming!!", "text": "We LOVED this charming hotel. The staff was delightful, offering excellent dinner and sightseeing suggestions. The room, a Tradition room on the top floor, was clean and comfortable. The common areas were simply gorgeous. I felt like we were staying in one of the chateaux we toured in the Loire Valley. We really enjoyed having breakfast in the elegant dining room each morning. We will definitely come back some day!!", "user": "Luv2TravelPNW", "date": "May 3, 2010", "id": 63069221}, {"rating": 5.0, "title": "You'll leave this place with a bit of your heart left behind", "text": "This hotel is by far the best hotel we stayed in on our road trip around France. We stayed here for two nights and chose it for it's location and parking.", "user": "its-all-about-travel", "date": "April 22, 2010", "id": 62152370}, {"rating": 5.0, "title": "well done trip advisor", "text": "The hotel was very easy to find and there was plenty of free secure on-site parking. The hotel is an 18th Century Manor house and over-looks the Loire River and Chateau Amboise, it really does look stunning as you drive in.", "user": "mingachimp", "date": "April 21, 2010", "id": 62059982}, {"rating": 5.0, "title": "Very Charming.", "text": "We were greeted by a very friendly chap on reception who spoke extremely good English which was very welcomed after days of our appauling French speaking attempts. I wished I had got his name but he recommended some great local restaurants for dinner, one of which was L'epicerie, a small, very quaint restaurant in the heart of the old town which served amazing food. He will even make reservations for you.", "user": "Travelgirl056", "date": "April 5, 2010", "id": 60440458}, {"rating": 5.0, "title": "A treat on the Loire at Amboise", "text": "Beautiful small hotel on a landscaped courtyard below the Chateau d'Amboise, and right on the Loire. Friendly and engaged service at the front desk and in the breakfast room. Quality finishes and furnishings throughout. We slept on the second floor under wood beams with our windows overlooking the river.", "user": "richardr38", "date": "May 31, 2010", "id": 65966627}, {"rating": 4.0, "title": "Cute house by the Loire River", "text": "This hotel is consistent with most reviews here- cute manor tucked in a cute little town of Amboise. The manor has a simple but quite elegant front yard with ample space to drive around and park. Gil, who received us, was very professional, helpful and nice. The manor has two sitting areas on both sides of the main staircase. Straightforward decor- not much to rave about here.", "user": "ebbtide123", "date": "May 23, 2010", "id": 65116994}, {"rating": 5.0, "title": "Lovely hotel!!!!!!!!", "text": "Our traditional room was clean and comfortable and larger than what you see in the photos. It has a decent bird's eyeview of the Chateau and the river below. Likewise, the bathroom is quite large and equipped with modern fixtures. The bed while king sized, is bowed and soft. I wished it was a little more firm. The floors are very squeaky and the walls, thin. I can hear the opening and closing of the wardrode cabinets in the adjacent rooms and the flushing of toilets. I would be very careful in making unnecessary noises in this hotel especially at night. Internet service while free is very slow.", "user": "moonlightgarden", "date": "May 20, 2010", "id": 64878949}, {"rating": 5.0, "title": "Lovely stay in suite Ten, great views of the river and chateaux amboise", "text": "Overall, nice place to stay for a pastoral type of vacation.", "user": "spurg", "date": "May 19, 2010", "id": 64743232}, {"rating": 5.0, "title": "Best Hotel in our Trip to France", "text": "This was such a delightful place to stay!!! The hotel was very beautiful itself and very elegant. The rooms were very comfortable and clean. And the staff were ESPECIALLY super nice. When we had trouble finding a gas station, the guy printed out directions and made sure we had no difficulty returning the car with a full tank. He could not have been more helpful. Amboise was such a fascinating town and we were very lucky to get a wonderful view of the chateau from our room. There were lots of wonderful places to walk and great lshops, cafes and restraunts. We hope to return return someday and I would highly reccamend this hotel to anybody!!!", "user": "litterbug", "date": "May 16, 2010", "id": 64278788}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "From the moment we drove into the lovely grounds of the Manoir we felt its charm.....And as we ascended the staircase to our bedrooms we fell in love with the hotel....What a lovely base for our Loire Valley trip...", "title": "Loved the Manoir", "helpfulness": 2, "user": "PVmomontherun", "date": "July 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8192585, "likes": {"liked": "— The ambience"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Our family of 6, 4 adults and 2 kids 11 and 13 stayed at the Manoir for 2 wonderful days from June 22 -24. We stayed in Rooms 11 and 12 which both had fantastic views of Chateau Amboise and the river. The rooms were beautifully appointed, each room had a king size bed and a small sitting area and felt very clean ( I am very particular about cleanliness)....", "title": "Awesome!", "helpfulness": 2, "user": "BCtraveler44", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8072875, "likes": {"liked": "— Location, comfort...everything", "disliked": "— I can't think of a thing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The staff were outstanding particularly Pierre who was always very pleasant and eager to please....He also gave excellent recommendations for dinner....our favorite was L'Alliance.... the food was excellent and very good value.", "title": "A truly memorable experience", "helpfulness": 4, "user": "sgd73", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8043527, "likes": {"liked": "— Everything", "disliked": "— The only minor thing was the hand-held shower, but it really didn't spoil anything"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Although the breakfast was a little bit pricey we splurged and enjoyed it as it completed the whole experience of staying at the Manoir...", "title": "Simply the best", "helpfulness": 12, "user": "tot2006", "date": "June 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7829239, "likes": {"liked": "— Sitting on the terrace admiring the view", "disliked": "— Having to leave - it's not fair!!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The hotel is only a 2 minute walk to the center of town.... and a 10 minute walk to Le Clos Luce where Leonardo da Vinci spent the last 3 years of his life. My kids loved LE Clos Luce as it housed many of Leonardo Da Vinci's \"inventions\".", "title": "Another great experience!", "helpfulness": 3, "user": "Travel3773", "date": "June 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7740445}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The hotel is perfectly situated a couple of blocks from the chateau. The gated parking area is ideal as was the room. We had a great little room on the 3rd floor - with views of the chateaux and Loire. Service in the form of dining recommendations and baggage assistance were great. Eat at the Amboisarrie for dinner (on the terrace!). Breakfast was ok at the hotel. We would recommend walking 5 min into town and eating at the Bigot Pâtisserie. Dont eat at the Chez Hippeau, unless you have 2 hours to kill. We will definelty stay at Hotel Le Manoir les Minimes again.", "title": "Superb location, accommodations & service make this hotel stand out", "helpfulness": 3, "user": "capturedplanet", "date": "August 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3761493}, {"rating": 5.0, "title": "Fabulous hotel and help from Pierre at HOTEL!!", "text": "Pierre of this fabulous boutique hotel was a great resource. He not only had great suggestions of where to eat (and made the reservations for us)--but also helped us with the convoluted, user-unfriendly system of buying gasoline/petrol in France. Many of the stations are unstaffed--but the stations do NOT accept either US credit or debit, or UK credit or debit cards. The only way we found to purchase this black gold, was at a manned station with cash. Not easy to find. Bravo to Pierre!!! He didn't invent the goofy system, but he did a lovely job explaining it.", "helpfulness": 2, "user": "Maggie_Oakshot", "date": "August 2, 2005", "id": 3730372}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "From the first moment, you can tell this is a special hotel.", "title": "Wonderful place...we will always remember this place!", "helpfulness": 6, "user": "timjstark", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3675777}, {"rating": 5.0, "title": "Look No Further", "text": "We were welcomed warmly, and the warmth continued our entire 5 night stay. The owners have paid attention to details which make the all the difference. The room was very comfortable, the views tremendous, cleanliness was the absolute rule, and the staff could not have been better. Any questions were answered with care. I never felt more at home at a hotel.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 13, 2005", "id": 3549797}, {"rating": 5.0, "title": "Exquisite Gem", "text": "The location of the hotel is ideal; a short walk through cobbled streets leads to the town center. The staff is very helpful with restaurant and touring options. Danny (Dani?) in particular helped us with a transportation issue.", "user": "Straighshooter", "date": "June 12, 2005", "id": 3544855}, {"rating": 5.0, "title": "scheduled 2 nites but stayed for 5!!", "text": "My husband and I just returned from a trip to the Loire Valley and wanted to rave about this hotel.From the minute we arrived and were greeted in the parking lot by the wonderfully warm Pierre (and Olga) to the day we checked out we felt like we had a home.The value was excellent,the rooms and location are perfect.They also had great recommendation for restaurants(pavilion de lys and auberge de launay).I can't recommend this place more highly (and I'm picky!).", "helpfulness": 4, "user": "codywhitney", "date": "April 13, 2005", "id": 3356267}, {"rating": 5.0, "title": "Absolute luxury even on lighter budget", "text": "We have just returned from a long weekend in the Loire Valley. This hotel was a wonderful base to explore some of the best chateaux- including Cheverney and Chambord. The staff are attentive, yet discreet and the hospitality is superb. We enjoyed our cottage room: so much space and tastefully decorated at a great price (low season). The breakfasts were long and luxurious. Amboise, itself is a charming town and l'epicirie was a great restaurant. Thank you for a wonderful stay!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 4, 2005", "id": 3329148}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "We stayed 3 nights at this hotel. From the moment you enter the parking you begin to feel the special atmosphere that this hotel creates, with its lovely grounds. Once inside we were greeted by a very courteous and professional staff. Their hospitality made us felt at home. Restaurant recommendations were accurate, specially the Le Pavilion des Lys. We got room 11, a beautifully and luxuriously decorated, and big, very big, room located in the 2nd floor. The bathroom amenities were plentiful. And what a view. From one window you had the spectacle of the Castle of Amboise, specially when lighted at night, and from the other you could see and hear the Loire River. Overall this is a magnificent hotel whose owner and management sincerely have the guest in mind.", "title": "WOW!", "helpfulness": 2, "user": "Mendonut", "date": "April 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3323133}, {"rating": 5.0, "title": "Superb, charming, perfect in every way", "text": "Our group of eight was enthralled with our stay at this hotel. With views of the Chateau du Amboise and the Loire River we felt like princesses. From the silk upholstered walls to the charming breakfast room complete with silver tea and coffee service served on no less than three table linens we were most certainly spoiled. The staff was exceptional, helping us in every way possible from providing transportation from the train station to arranging chateau and winery tours. The owner's eye for detail was appreciated by all and our stay at le Manoir de Minimes will be remembered forever. It could not have been more perfect.", "helpfulness": 4, "user": "susibrown", "date": "March 24, 2005", "id": 3298393}, {"rating": 5.0, "title": "A Classy Classy Hotel", "text": "This is a classy fine hotel managed by an extremely professional and detailed orientated staff. The location is perfect, walking distance to the center of town, in the shadow of the Castle and along the river. The gentlemen that run the hotel are first class. I highly recommend this manor, although I must say I was dissapointed in the Loire Valley countryside. The Chateaus were terrific but the valley was less then magical. Make sure you bring more then your American Express card though.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 10, 2004", "id": 2817092}, {"rating": 5.0, "title": "Everything that we expected", "text": "This is a gem among hotels. Luxurious rooms amid a beautiful setting in an ideal location of the Loire valley. Excellent value for the money. They also made a restaurant recommendation for what proved to be one of the finest meals ( and the greatest value) of our trip: Le Pavilion des Lys.", "helpfulness": 1, "user": "mszdoc", "date": "October 24, 2004", "id": 2783121}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The Manoir lived up well to expectations. We also stayed in Suite 10--and the rooms really looked like the pictures in the webpage. Whenever anyone asked us where we were staying, all the responses from hoteliers, shop owners, retaurateurs,etc. were +, \"Ooh la la\" and so even the locals are impressed with the Manoir. I will be redundant to say anything more but just keep up the superlatives.", "title": "Lovely Manoir", "helpfulness": 3, "user": "fpiesiec", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7682201, "likes": {"liked": "— The lovely Suite--very large and luxurious.", "disliked": "— Nohing."}}, {"rating": 5.0, "title": "Great little manoir in a nice cozy town", "text": "Stayed in Suite 10 at the Manoir. Beautiful views of the river. Very spacious room(s) and bathroom. The whole house is quite nice and I love the personal driveway. Staff is very friendly and the manoir is a close walk to the chateau in the center of town. Nice town to stay in to see the Loire Valley. If you want a big city feel - stay in Tours. We found it to be a great place to stay and would definitely return. Did not try the breakfast but there are many towns in the center that the hotel can book for you. We walked into one and they wouldn't let us eat inside without reservation though. I think was called L'Epicerie. We did eat at La Cave in nearby Vouvray and the food and ambience was excellent. Don't forget to try the wine while you are in this valley. I wish we had tried more!", "helpfulness": 4, "user": "Jayde88", "date": "May 9, 2007", "id": 7570666}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The only thing different that I can add about this beautiful small hotel, is that we had the guts to bring our 2 boys (ages 9 and 12) there. It is really more adult than I had imagined, but they were very patient and kind to us. Even when my 9 year old wrote \"You rocked, man!\" in their guest book, they were still kind :) . Great location with a 5 minute walk to the little Amboise village and castle. Two nice bonuses: 1) We had perfect weather during our trip, and the sunset behind the bridge over the Loire River was amazing, and 2) On our last night in our room, as we were ramping up to say goodbye to France, there was suddenly an explosion of fireworks outside our window. They were beautiful and lasted about a half hour. It was such a nice way to say goodbye....", "title": "Another happy customer", "helpfulness": 2, "user": "Bostonpie", "date": "April 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7477367, "likes": {"liked": "— Everything", "disliked": "— Expensive breakfasts, so we never got to eat there...."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We stayed in the cottage and our rooms were lovely. The location of the Manoir is wonderful for traveling to see many of the chateaux. The staff went out of their way to be helpful and were very friendly. I will stay here again!", "title": "special place", "helpfulness": 2, "user": "PMMFtLauderdale", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7441291, "likes": {"liked": "— the beauty and locatrion", "disliked": "— gravel parking lot, couldn't roll the luggage"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Can't stand airports any more so we have decided to spend more time in France. The Loire valley was on our tick list and we searched Tripadvisor for the best hotels. At one weeks notice top of the list could not accommodate us but Manoir les Minimes could.", "title": "SKIing (Spending the kids inheritance)", "helpfulness": 5, "user": "Critical", "date": "April 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7434679, "likes": {"liked": "— Quality of decor and furnishings.", "disliked": "— Nothing really."}}, {"rating": 4.0, "title": "Elegant", "text": "The positive reviews on Trip Advisor are well-deserved. The decor, setting and amenities are top-notch. The parking is great. The grounds are land-scaped with wonderful flowers. The location is secure with gate access from the \"clocker\" on the room key. Bed and linens are of a very high quality. Mini bar (which I rarely use) items were very fairly priced. We stayed in the Annex which was quiet and comfy. The only negatives were: WIFI didn't work in annex; baggage had to be carried up a very narrow stairway; toilet was in a very tiny room. I didn't interact with the staff (who seemed to me to be super formal) but another member of my party did and he found them to be helpful. Breakfast (additional 13 Euros) was average.", "user": "beekay458", "date": "June 15, 2010", "id": 67610847}, {"rating": 5.0, "title": "Our Favorite Hotel in France", "text": "We absolutely loved our stay in Amboise at Le Manoir Les Minimes. Everything was perfect--from the close proximity to the town to the delcious breakfast in the mornings to the resident dog, Olga.", "user": "idahoprincess8", "date": "June 9, 2010", "id": 67023839}, {"rating": 4.0, "title": "Glad we booked ahead - good choice", "text": "Our room was one of the \"attic\" rooms on the second floor. It was rather large and had beautiful wood beams crossing the ceiling. Our window looked out at the Chateau and the Loire River. We really appreciated having access to the free Wi-Fi for in-room use. We also opted for breakfast at the hotel in the mornings (an extra charge), and we are so glad we did. The croissants were easily the best we had in France on this trip.", "user": "Victoriadiner", "date": "June 5, 2010", "id": 66531048}, {"rating": 4.0, "title": "Perfect Location", "text": "The staff was wonderfully helpful and hospitable. They made our trip to Amboise our favorite stop on our tour of France, and we are looking forward to returning to Amboise and Le Manoir Les Minimes.", "user": "Rosebelle", "date": "June 5, 2010", "id": 66530072}, {"rating": 4.0, "title": "Great Hotel, Great Service", "text": "My wife and I stayed here on our trip through the Loire Valley and it was a great choice, thanks to the reviews. We booked late and were told that there were no rooms available in the main house but we were offered a deluxe room in the adjacent cottage. We were assured we would be very comfortable there. We had Room 51 on the upper floor of the cottage and they were absolutely right. The room was a delight. The only problem was a toilet room that was virtually impossible to stand up in!! They really do need to fix this. The main room was very spacious with a large sitting area. The bathroom was very modern and there was a very comfortable bed.", "user": "Irunchick", "date": "June 3, 2010", "id": 66294962}, {"rating": 5.0, "title": "Beautiful hotel right next to the Loire", "text": "Great hotel, great service. Hotel is right next to the River Loire and a few hundred metres from the centre of Amboise - easy to get to Tours and several of the Loire towns/villages.", "user": "David_Bole", "date": "March 31, 2010", "id": 60016773}, {"rating": 5.0, "title": "What a wonderful place to stay", "text": "Le Manoir Les Minimes was just the perfect place to stay for our 5 days visiting the Loire Valley. Amboise itself is central to all of the sights and Le Manoir is the icing on the cake. The staff could not be more helpful in taking our luggage to serving our breakfast and best of all they make wonderful suggestions for dinner. We stayed in the yellow suite which overlooks the Loire River and the Amboise Chateau, it was very relaxing with a seperate living area,cable tv, mini bar and free internet available. My only thoughts would be to incorporate the breakfast into the overall room rate rather than having a seperate charge with greater variety. The recommended restaurants that we ate at were Le Lion d'Or, L'Epirerie and also La Scala, all three restaurants had wonderful food and great service, all in walking distance of the property. In all of my travels, this would be the best service I have had at a hotel, outstanding. Thankyou to all at Le Manoir Les Minimes.", "user": "Jen2606", "date": "March 15, 2010", "id": 58640323}, {"rating": 5.0, "title": "Elegant, Charming and Delightful", "text": "My partner and I stayed at this hotel whilst visiting the Chateaux of the Loire valley.", "user": "mikehtaunton", "date": "March 9, 2010", "id": 58134586}, {"rating": 5.0, "title": "Wonderful, Wonderful!!!", "text": "We found it Charming and Elegant. The staff were attentive without being intrusive.", "user": "jeannie689", "date": "February 2, 2010", "id": 55009950}, {"rating": 5.0, "title": "Great Combination of Charm, Location and Value", "text": "It is the little touches that distinguish a good hotel form a great one, and Le Manoir les Minimes has them. The owners couldn't have been more helpful in advising where to eat and what to see. The decor is delightful,so very tasteful throughout.", "user": "KBLSF", "date": "February 2, 2010", "id": 54972324}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed in one of the traditional rooms for two nights, and absolutely loved it. We had an elegant, spacious bedroom in muted gold and brown with a king-sided bed, and one small window. The main bathroom was spotlessly white, with thick fluffy towels and lots of toiletries. There's a skylight over the tub (no shower), a candle, and bath crystals. Great for soaking. The toilet was in a separate room, probably due to the layout of the beams, since our room was at the end of the building; each room on the top floor is probably configured differently.", "title": "Luxurious and welcoming", "helpfulness": 3, "user": "travelerfromsj", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5835229, "likes": {"liked": "— Great staff, luxurious bathroom, location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "But what really sets this hotel apart is the staff, easily the most friendly and welcoming we encountered in France. They offered to help us choose restaurants and make reservations (they keep a set of menus available for browsing), and even called us on Saturday afternoon to make sure we had reservations for that night. They definitely made me want to come back here.", "title": "Not long enough!", "helpfulness": 2, "user": "Nannypurple", "date": "September 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5835153, "likes": {"liked": "— The attention to detail and luxurious bathroom facilities.", "disliked": "— That we couldn't stay and be pampered for a week!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We ate at L'Epicerie the first night (traditional French food- excellent) and L'Amboiserie the second night (patio seating and crepes), and I recommend both.", "title": "beautiful hotel, fantastic service", "helpfulness": 3, "user": "Claire1234", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5713881, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Beautiful Manoir, luxurious stay", "text": "One last warning: I made reservations 5 months before our stay here, and the larger rooms on the first floor were already completely taken! So be sure to book early if you want to stay here.", "helpfulness": 4, "user": "DesignatedPlanner", "date": "August 13, 2006", "id": 5604883}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Wow, we turned up here, looking a bit worse for wear, after a week of camping in our big Yellow camper.", "title": "Beautiful Small Hotel", "helpfulness": 1, "user": "NessW", "date": "August 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5597932, "likes": {"liked": "— Charm, Atmosphere, Luxery, Location", "disliked": "— Not allowed to picnic in rooms or outside - would have liked to have enjoyed my own wine & cheese in the afternoon outside"}}], "location": {"country": "France", "region": "Centre", "continent": "Europe"}, "variance": {"poor": 7, "average": 13, "very good": 75, "terrible": 0, "excellent": 436}, "aka": "Le Manoir Les Minimes Hotel", "slim_ranking": 0.0454545454545, "description": "This authentic 18th century Manor house was built on the foundations of the ancient medieval Monastery des Minimes and is situated in proximity of the old town.It is the ideal place from which to explore the chateaux and vineyards of Loire Valley. The selected stopping place offers its visitors comfort “a la française”, a harmonious blend of sophistication and intimacy, whilst affording glorious views of the Chateau Royal d’Amboise and the river Loire.Air-conditioned rooms. No restaurant. Private enclosed parking."}