{"user_rating": 4.0, "review_count": 31, "name": "Hotel Regency", "reviews": [{"rating": 4.0, "title": "Good value small, newly renovated hotel just outside Monaco with a great view", "text": "Despite its rather unprepossessing exterior on a busy road running east from Monte Carlo, this small 3 star hotel provided bright, clean comfortable but small rooms with french windows and a balcony overlooking the bay. Recently redecorated, refreshed and renovated by its new owners, it provided a comfortable base for exploring Monaco, Edze and Cap Martin. Our room had a small flat screen TV, fridge with beers and soft drinks, the bathroom was small but perfectly adequate and spotless.", "user": "Intrepidtoo", "date": "September 26, 2010", "id": 81092189}, {"rating": 5.0, "title": "Best value for money and most welcoming staff in 6 months of travel", "text": "Breakfast was served on a pleasant sunny terrace where the owners had put an effort into tidying the garden and was of reasonable standard, but not exceptional.", "user": "karenj33", "date": "August 12, 2010", "id": 74846044}, {"rating": 4.0, "title": "Excellent location and very friendly staff", "text": "The hotel has free on-street parking, although spaces are at a premium and after dinner in Cap Martin we had to park 500m away in a side street.", "user": "flookie", "date": "January 6, 2010", "id": 52717574}, {"rating": 4.0, "title": "Great Value and Location", "text": "The best little hotel we have come across in the whole of Europe..", "user": "Amber0001", "date": "October 12, 2009", "id": 46606510}, {"rating": 5.0, "title": "nice beach, quiet, not far from Monte Carlo", "text": "Friendly staff and after being away from Australia felt so welcome.", "user": "chattte", "date": "June 6, 2009", "id": 31691572}], "location": {}, "stars": 2, "variance": {"poor": 0, "average": 8, "very good": 10, "terrible": 2, "excellent": 11}, "slim_ranking": 0.636363636364, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Small Hotel of renewed and situated charme recently to the doors of Montecarlo. L' Hotel has twelve rooms eight of which you/they lean out on the sea. An adjacent road all Hotel allows the access the attractive beach of the Sweater Bleu in alone 10 minutes afoot. Stop of the bus for Montecarlo and for Mentone to 100 meters hotel."}