{"user_rating": 4.5, "review_count": 1351, "name": "Hotel Monaco Chicago - a Kimpton Hotel", "reviews": [{"rating": 5.0, "title": "Hotel Monaco a Hit", "text": "We stayed at the Hotel Monaco for three nights from August 11 through August 14. This was our first trip to Chicago and were pleased with our choice of both city and hotel.", "helpfulness": 1, "user": "brodiekid", "date": "August 15, 2009", "id": 37753707}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Location: We chose Hotel Monaco based on the many positive reports on Trip Advisor and other sites. We wanted to be close to the river and the trains and with the Lake station a few blocks away, the location for us was perfect. Wicker Park/Bucktown, Oak Park and of course O’Hare are easily accessed. In particular, the convenience of taking a train from a major international airport downtown as opposed to a taxi, bus, etc. was appreciated (Hello Toronto, get your act together). The Loop location (Wacker and Wabash) was great with many major attractions within easy walking distance (we are a couple in our early 50’s with a teenage daughter).", "title": "Hotel Monaco Has Flair", "user": "HotelGuestTraveler", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 37611095}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Hotel: This isa great hotel, very reasonably priced with excellent amenities, rooms and staff. We were given room 1208, overlooking the intersection of Wacker and Wabash with the river, the Trump Tower and a Mies Van der Rohe tower forming a backdrop. The room was very clean, large, cool and bright with two queen beds. Our only concern would be the lack of drawer space (maybe due to this being an adjoining room with 1207. The window seats are wonderful to lay on and gaze out on the view or for catching a short nap! The hotel was very quiet with no hall or room noise. On the 12th floor we could just hear the El down on Wacker which we really enjoyed (the El was a major interest of ours). We enjoyed the size of this hotel where front desk and lobby staff recognize you. Complimentary Starbucks coffee in the morning and wine late afternoon, offered in a double height room adjacent to the lobby, were very nice touches.", "title": "loved the window seats!", "user": "kroberts0525", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36849676}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Staff: The staff were very helpful and professional, offering interesting and important facts and advice. At 11.30 am arrival, our luggage was stored and front desk staff called our cell a few hours later to inform us that our room was ready. Bottled drinks were left for us be the housekeeping staff when they realized we liked orange juice. When a family emergency occurred on our day of departure, staff offered to help get our luggage to the Lake station for the trip to O’Hare.", "title": "great service and location", "user": "trlyons", "date": "July 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35958846}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Excursions:", "title": "Great Location, helpful staff", "helpfulness": 1, "user": "cotton_I_Jo", "date": "July 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35822150}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The location and decor couldn't be nicer! And the price was right, too, because we took advantage of a TravelZoo special. Nothing could beat the windowseat in our upper floor room which looked out onto the river over the North Wabash and State Street bridges and the newly finished Trump building (which is a lot more architecturally aesthetic than any of his NYC monstrosities).", "title": "Gorgeous w/fabulous location, but staff could use improvement", "user": "nyauthor", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 35598369}, {"rating": 5.0, "title": "Better than advertised", "text": "But the staff seemed as though they weren't thrilled to work there. They weren't unhelpful, per se, but appeared to prefer that they hadn't been bothered to answer a question, whether it was for a restaurant recommendation or for directions to a Southside location. We were assured by two concierges that mass transit from the hotel was unavailable. A bit of internet research on my part (as an NYC native I'm used to navigating a mass transit system) revealed that the closest El stop (State & Lake) to the Hotel Monaco would drop us at a station on the Southside and from there it was an easy bus ride (the connection was right outside the station) that would drop us right across the street from our destination. Because we'd bought a one day fun pass for the cta, the round trip bus and train was included in the flat fee for the card (which we used earlier in the day).", "user": "lefty713", "date": "July 23, 2009", "id": 35585716}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "So, the concierges could be a bit more knowledgeable and helpful to guests traveling outside the hotel's immediate neighborhoods. One of them also gave us incorrect directions to the Willis (formerly Sears) tower.", "title": "The Best", "user": "Catt20", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35470016}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "And when we checked out on a Saturday and discovered that there was an erronious restaurant charge added to our bill, the front desk clerk informed us that she could not reverse the charge herself. It would have to be done by the accounting dept., which doesn't work on weekends, so the problem wouldn't be taken care of until Monday. The promised follow-up from the accounting dept. didn't happen either.", "title": "Smart, comfortable hotel in the city centre", "user": "WTurville", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 35376802}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "BUT ... for atmosphere and location (it's also within walking distance to some superb and highly affordable restaurants, as well as its proximity to the State & Lake El, from which you can go just about anywhere in the city, the Monaco can't be beat. It is truly gorgeous.", "title": "Great Location and Service", "user": "Tink1Boston", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34998597}, {"rating": 3.0, "title": "Missed the Mark", "text": "I was disappointed during my recent stay for a conference. Given the favorable reviews, I was anticipating a much happier experience. Several things were just \"off\". Although check-in time is posted at three, our room wasn't ready until 4:30. The desk staff appeared either overwhelmed or disinterested. For instance, as I was leaving one day, the counter person asked \"Shall I call you a cab?\". I responded that I would be taking the 'L'. The response? \"I'll have X get you a cab.\" Also had a rather unpleasant experience with housekeeping. I returned (albeit early afternoon) to find that my room was being cleaned. I dropped off some material and said that I'd be back soon. I returned an hour later and while the room wasn't pristine (water glass still on the table) the beds were made, towels refreshed and I thought all was well enough. As I started to change clothes and relax, there was a knock on the door. It was housekeeping. A rather grumpy \"I'm not done cleaning the room yet\" came through the door. At that point I didn't want to be disturbed any longer, and said that everything was fine as it was.", "helpfulness": 1, "user": "214book", "date": "July 16, 2009", "id": 34940921}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Too, I realize that the rooms can't all face the river, but our alley facing window did give way to lots of noise (from the 'L' and trash removal). I visit Chicago every couple of years on business and thought I would give something besides the larger chains a try. I certainly will not be re-visiting this hotel, though.", "title": "Not Top 40 in the U.S.", "user": "Davunger", "date": "July 15, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 34866691}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "We stayed five nights at the Hotel Monaco, opting out of the better chains, primarily basing our decision to stay on the reputation of the Kimpton Hotel chain and the Travel Advisor ranking. Even though we stayed during a convention--understandably there's little choice in rooms--, we would have expected better. We arrived at 12:30 PM and were shown two rooms that we rejected. The first one was very dark and the second one though a bit less dark, had a funny smell (in fact the beds in all the rooms smelled funny--poor soap or old feather pillows). We were told that at 3 PM we would be offered a nicer room. At 3:20, we inquired and were told that our room was not ready. After discussing this (the manager said to me with veiled sarcasm: \"I'm sure you have stayed at better hotels\" when I said I was upset by this), we were finally given a room facing a wall on the 14th floor, which was otherwise fine. We did complain about the coldness in the room and were told to take off the fan and the temperature would be fine--it never went above 68. The hotel is in a good location, the rooms are tastefully decorated (though showing their age) the adjacent restaurant serves a great breakfast, but I will never come back here.", "title": "Whimsical in the best sense of the word", "user": "solotravelerToronto", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0}, "id": 34689621}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I had a wonderful time at the Hotel Monaco. Everything you would expect from a quality chain hotel with the feel of a small, boutique hotel. The rooms are richly decorated. Nothing bland. The window seats are fantastic. And check out their goldfish program. I've already recommended it to friends.", "title": "Location, location, location!", "user": "rawbacon", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34620311}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "Location is unbeatable! Staff was extremely helpful and friendly. Hotel is beautifully decorated inside. Our room was showing a little bit of wear (wallpaper peeling in one place, floorboard scuffed in several places, shower made some annoying noise)", "title": "Highly recommended", "user": "ScarlottaSavannah", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34401307}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Just spent a week at this hotel and felt it was an excellent place to stay. Perfect spot right by the river and a couple minute walk to the theaters, resturants, shopping, u name it was close by. They had wine every evening for an hour, free to their guests and we had that most nights and was even a good wine. The staff was EXCELLENT, a great big thank you to Rich our Concierge who we asked if he could possibly get us some Oprah tickets and he managed to get us some Stand-by tickets, was so impressed. The rooms were really nice the housekeeping noticed we ate some rice krispy squares (wrappers in our garbage) and she dropped those off as well as a yogart my husband had eaten with a little note telling us to enjoy. So would i recomend this hotel Yes yes yes...", "title": "Great hotel in a perfect spot...", "user": "tillwemeetagain", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80093671}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We spent eight nights in Chicago so it was important to pick the right hotel and, after considerable research, we selected the Hotel Monaco. The highlights for us were;", "title": "Loved it!", "user": "Cailin_og", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79428559}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Perfect north loop location;", "title": "A Hotel That Takes Care of YOU!", "user": "CEN2010", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79419576}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Fantastic rooms (photos do not do the quirky colourful decor justice, spacious with high ceilings, spotless and fab view of the river);", "title": "Comfortable, inviting, friendly hotel - but a tad tired and worn", "helpfulness": 1, "user": "witheachother", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79371143}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Reasonable cost (in comparison to other similar properties);", "title": "Highly recommended", "helpfulness": 1, "user": "nesbitevans", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79234322}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I am writing this review as I sit in one of our four window seats since I decided I can not wait to shout my love for this place. We decided to book this hotel for our anniversary for many reasons but mostly because they are pet friendly. We also have stayed at other Kimpton properties and have never been disappointed. We booked a river view Mediterranean suite. Wow. I simply can't put down in words the amazingness (even a word?) of this room. Amazing view! I would pay extra to get the river view. The room has four awesome window seats. Just to let you know, I rarely use the word awesome but in this case, it is definetely the proper word. The jacuzzi whirlpool is just what the doctor ordered. I brought my own bath bombs to use but the hotel has some to purchase at $7/piece. The bedding is simply divine. I seriously could spend the entire day sitting in bed or one of the window seats. The best part of this hotel are the employees. They make you feel at home the minute that you arrive. Each one has the amazing ability to make you feel totally welcome. We have stayed at other hotels that make you feel like a burden...totally not the case at Hotel Monaco. When we arrived, they delivered champagne to the room for our anniversary. Wow! It is the little things that this hotel has to offer that makes it the best place that we have stayed at...this was our first stay here at Hotel Monaco but it definitely will not be the last.", "title": "Wish we could live here", "helpfulness": 1, "user": "JanGirl", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83343964}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "This is the 2nd time we have stayed at this hotel and it has always lived upto our expectations. Great location and excellent staff,we will stay here everytime we are in Chicago!", "title": "Great again", "user": "Jim P", "date": "October 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82793939}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "Hotel Monaco is a great hotel. There's a vibrancy to the place that makes it feel very welcoming. Maybe its from seeing people with dogs, or the goldfish in the room, or that the lobby is always busy with morning coffee or an afternoon happy hour. Whatever it is, it's always fun to stay there. Rooms are super comfortable and clean. The bathroom is huge with L'Occitane toiletries. Once we got one of the cheaper rooms that had a view of a parking lot -- that was bad. You got to upgrade and get a room with a view of the city or the river. It makes a HUGE difference. This hotel is expensive, but join the Kimpton mailing list and keep an eye out for deals. They offer some great bargains at times.", "title": "Great, Fun Hotel -- but splurge on a room with a view", "user": "RiverMud", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82621008}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "This hotel was great. It was a boutique hotel so small enough to be intimate but not too small as to not have the features I wanted. I had a river view with a window seat to look over the river and the city. The front desk was very friendly and helpful and always willing to give advise or help in any way. There was a wine hour from 5 to 6pm which was very nice and hot cookies in the afternoon (I missed these as I was in my conference). The rooms were spacious enough and very clean. The hotel was located a few blocks off of Michigan avenue so I could easily walk to the areas I wanted to go.", "title": "This hotel was perfect", "user": "kwin080", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82583801}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Overall an excellent experience.", "title": "Unique Urban Boutique Hotel", "helpfulness": 1, "user": "KellyMai", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81837627}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Stayed at the Hotel Monaco September 24th-27th. Had a Queen-Queen Room on the 12th Floor and it was quiet and comfortable. The room was well laid out, large, clean and with a nice touch of luxury. Staff could not have been more helpful and attentive. Located at the river and across from Trupp Hotel always provided some beautiful scenery.The major shopping, located on the Magnificent Mile was fairly close, but required quite a few blocks of walking (bring your tennis shoes) or a $4.00 cab ride. The \"L\" (subway) at the Randolph/Wabash stop is just two blocks away and will give you access to most of the other lines covering most of the city. The hotel will have a major redo this December, but I have stayed in relatively new places that did not look as well kept as this property!", "title": "Great Weekend Getaway Hotel!", "helpfulness": 1, "user": "BigOrange56", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 81664503}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I ended up at this hotel by bidding $150 per night for a 4 star hotel in the loop area of Chicago on priceline.com. The average room in the area was $250, so I did pretty good. I enjoyed the location, right next to th \"L\" and plenty of restaraunts and theatre within walking distance.", "title": "Great downtown location - Don't bid on it though", "helpfulness": 2, "user": "osbornauto", "date": "September 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 81498442}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "We ended up with room 401, all the way in the back of the hotel with no view except the roof over their eeting rooms. I guess that's what I get for bidding on a room. As hindsight, I wish I had just booked a room at the hotel with a view and paid whatever their rate was. It was a clean hotel with very friendly and helpful staff. Parking was expensive, but probaly less than most downtown hotels.", "title": "Perfect In Every Way", "user": "marism", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81406201}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I would stay there again and pay full price, the only reason I marked the room down was because of the room I got, not their fault, mine for bidding!", "title": "Love love love!!", "helpfulness": 1, "user": "SabrinaMogle", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81379952}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Recommendation - It would have been nice to have in-room coffee maker.", "title": "Loving our room! we will be back", "user": "BrownEyedGal513", "date": "September 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80998983}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This hotel was recommended by a friend for my first trip to Chicago. Location is excellent, a half block south of the river and a block north of the Loop. Wonderful Gwen at the front desk gave us a room on the top floor (only 14 floors) with a window seat that, from an angle at least, has a river view. The first evening, a little goodie bag was left in the room in honor of my first visit to the city. Small gesture, but it scored big points.", "title": "Thoughtful staff, perfect location", "helpfulness": 1, "user": "wunderwoof", "date": "November 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 85847830}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Smallish king room (some are larger), with desk and chair, and a comfy, but worn, upholstered chair and ottoman. Bed linens are new and the mattress comfortable. Decent lighting for reading. Would have liked a heater or heat lamp in the basic hotel bath, but it does have a magnifying mirror and Aveda products. Bathrobes provided. Minibar fridge isn't locked, and there was room to store our own soda in it.", "title": "Very nice experience for a country boy going to town", "helpfulness": 3, "user": "Tucker124", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 84800976}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Some noise carries from hallway, but we were near elevator--the price we paid for a free upgrade. Worst noise came from \"El\" trains turning the corner a block away, but it was tolerable. Rooms facing the back probably don't get that noise, but those rooms don't have much of a view.", "title": "OMG! Check what's on the closet!", "helpfulness": 1, "user": "Gayletravels", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84689638}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "In the pretty lobby, comp coffee and tea in a.m., and comp wine hour every evening. Free newspaper and wi-fi in room with Kimpton \"in touch\" membership. Everyone we encountered on the staff, from doormen to housekeepers, were all efficient and pleasant.", "title": "Fun, clean worth staying here & I LIVE IN CHICAGO", "user": "ktee036", "date": "October 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 84018013}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The decent price we got on the room didn't include breakfast. We paid a lot of money for it one morning (yummy French toast, mediocre smoothie). The other days we got juice, yogurt and muffins from the 7-Eleven across the street or the Corner Bakery a block away. Didn't get to the restaurant for dinner, but did have a late dinner in the attached bar. Nice decor. Great pulled pork sandwich. We took the unfinished bottle of wine to the room.", "title": "Still Our Favorite Hotel in Chicago", "user": "DaylilyFan", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 83536182}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "My time at the Hotel Monaco was a wonderful experience. I had never traveled to Chicago and relied upon reviews and my previous stays at Kimpton hotels to choose my hotel. My experience far surpassed my expectations.", "title": "Rare Find", "helpfulness": 1, "user": "Muriel12", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39526784}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Monaco is in a perfect location. It's within blocks of all CTA locations, and the primary Metra location is also very close. It's one block from Michigan Avenue, and only a few blocks from Millenium Park. It's very easy walking distance from the wonderful restaurants and shops of the River North area.", "title": "perfect", "user": "papillonmarron", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 39413813}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I felt very safe, regardless of time of day/night that I was in transit. Hotel staff were always available--and with a smile and generous spirit. The lobby, unlike many Kimpton properties, is expansive with plenty of locations to mingle with colleagues and friends.", "title": "Great Hotel", "helpfulness": 1, "user": "altimase", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38250970}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My room was very large with tall ceilings and great windows. The bed was wonderfully comfortable, and only the loudest street noise (wailing sirens) could penetrate the room. I never heard neighbors, plumbing or normal street noise. I haven't slept so well in ages.", "title": "WOW!", "helpfulness": 1, "user": "Joebaba", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38204823}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Housekeeping was stellar. The room was meticulously cleaned every day. I left an average tip on my first day and was rewarded with bottled water that night, compliments of my housekeeper with a lovely note.", "title": "Great Location, Upscale hotel at a great rate!", "helpfulness": 1, "user": "jsgToronto", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38064125}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4, "variance": {"poor": 26, "average": 61, "very good": 303, "terrible": 6, "excellent": 955}, "aka": "Hotel Monaco Chicago Kimpton", "slim_ranking": 0.0542168674699, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Enjoy pure sensory indulgence at the Hotel Monaco Chicago. Nestled in the heart of downtown Chicago, this luxury hotel was named one of The Travel Channel's top 40 hotels in the country. Located on the Magnificent Mile, the hotel overlooks the Chicago River and is within steps of the city's favorite destinations. This dynamic location is matched by exceptional service, exquisite amenities, stylish décor and the adjacent South Water Kitchen, creating a luxuriously rewarding experience."}