{"user_rating": 4.5, "review_count": 427, "name": "Hotel de Crillon", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Where to begin. Suppose to stay Monday AM through Thursday AM. Was informed at check-in that my reservation ended on Wednesday morning and there was no availability for Wednesday night. Given it was fashion week in Paris availability elsewhere was limited. Great. This occurs despite corresponding on line and speaking twice to reservations on the phone. Received the obligatory \"sorry\" but no assistance in finding an alternative hotel. The final irony is Wednesday morning when I go to checkout (after spending over an hour on the phone Tuesday looking for an alternative hotel) the gentleman processing my bill says \"but, I see in the computer that you are not scheduled to depart until Thursday...\". With packed bags at my feet there was no way I was staying at the Crillon another night.", "title": "Biggest Disappointment", "helpfulness": 1, "user": "GravyMan1", "date": "September 14, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 140295550}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "My suite, Room 303, was large as it should have been for the price. However, it was drab, cold and tired. Looked nothing like the crisp yellow and white suite \"representative photo\" on the web. My wife found the room downright depressing. The bathroom was tiny by comparison to the sitting room and bedroom. Two adults could not maneuver in the bathroom at the same time. If my suite was representative of the rest of the rooms/suites, the hotel needs to renovate quickly as seasoned travelers will go elsewhere for fresher accommodations.", "title": "Sublime", "user": "Adrianalfp", "date": "September 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139182149}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The best I can say about the one meal I had at the hotel is that the breakfast salon is spectacular. A truly lovely room. As for the meal, I will let you decide - 2 coffees, 2 juices, 4 croissants and one bowl of oatmeal = 70 Euros. Oh, and the service was poor. A bowl of Cocoa Puffs (seriously!) was presented to me. I asked for oatmeal. It then took 25 minutes to make oatmeal.", "title": "Suite Tiny and Concierge Staff Rude and Aloof", "helpfulness": 1, "user": "Larry A", "date": "August 30, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 138896121}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "The hotel location is excellent. However, the hotel is trading on what I believe is an outdated reputation. I travel 40+ times a year and have stayed at first class hotels (including George V and Le Meurice in Paris) and dive motels. I was hoping to have a wonderful stay at Hotel de Crillon. I was disappointed by all aspects of the stay. For the type of money which the hotel is asking, you can do much better in Paris. I give the hotel 2 stars only because of the location.", "title": "olala!!!!", "user": "AGV67", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138754711}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "This is a hotel that I will never forget about. staying here is the only way you can understand how wonderful this hotel is. Right at Place de la Concorde, amazing service, beautiful rooms, delicious food... Everything here is near to perfection. This hotel is a jewel of the city.", "title": "A Special Reward", "user": "cmmorley", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138108241}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "How shocked were we to find Hotel De Crillon will close next year 2013 for a complete refurb. expected to take 2 years,", "title": "Closing next Year", "helpfulness": 1, "user": "ladygourmet", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144475927}, {"rating": 5.0, "title": "Wonderful, Grand Hotel!", "text": "We have been staying here for maybe 10 years and love it as our bolt hole in Paris.", "helpfulness": 2, "user": "VenturaDaddyo", "date": "October 16, 2012", "id": 142995744}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Our dilemma where shall we stay in the meantime? Why? because we love this hotel, yes its expensive I am sure that a great room can be found for half the price, but where would you find decor like this ? Rooms thats are spacious and bathrooms to die for, we can only hope the refurb doesn't over run and the new Crillon is as before. We hope that we shall find the marble still gleaming as usual and the same staff who are so fantastic waiting to greet us again.Nothing is too much trouble for them and our great friend Thioulf on the front desk always greats you with a smile.", "title": "Exceptional elegance, Parisian, central location, delightful decor", "helpfulness": 1, "user": "tobazblue", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142214202}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "If you can fit in a stay, then do before the hotel closes.", "title": "25th Wedding Anniversary", "helpfulness": 1, "user": "Chrissie B", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142170088}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Hotel de Crillon is wonderful and grand, and is situated at the perfect location - close to Tuileries, Louvre, Orsay, Orangerie, and of course shopping and wonderful dining! But the most impressive asset of the hotel is the staff! They are all personable, helpful, and friendly! I cannot explain how welcome the staff makes you feel from the first arrival to the sad day of departure! We stayed for 7 days (October 6-13) in room 415 (Deluxe room), and the room was large with a beautiful marble bathroom with double sinks and separate bath and shower (equipped with a rain shower head). The room overlooked the quiet side street (rue Boissy d'Anglas), and even though the room was next to the elevator, we never heard any sounds through the double doors. The Hotel de Crillon will close at the end of the year for a 2 year renovation. Fortunately, none of the historical areas will be preserved in their current grand style. My wife and I enjoyed our wonderful stay at the Hotel de Crillon, and we hope to return again some day. I thoroughly recommend the Hotel de Crillon if she's on your hotel list for your first/next visit to Paris!", "title": "Wow factor", "user": "NewFoestChicchick", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142083309}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This very beautiful, old-world, world-class, first-class, majestic, grand hotel is reason enough to sit on a fight for 8 hours to visit Paris. I stayed here with Mom and Sister 11 years ago, and was fortunate enough to stay again, this time for a long weekend with hubbie last month. It is a perfect hotel if you are seeking traditional charm and beauty, grand rooms, an ideal location, and likely the best help and service anywhere on the planet. I am disappointed the hotel wil be closing for a two year renovation-- less concerned about having to find an alternate address if I visit Paris soon, and more concerned that the magical character of the Crillon will be lost and another modern hotel property be created instead. Please keep the Crillon intact. It practically defines Paris.", "title": "EXCELLENT PLUS is my true rating", "helpfulness": 1, "user": "NomadicNina", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147025816}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Just back from our 20th Anniversary weekend in Paris. We stayed here based on location and recommendations, also on the fact it is still a 'traditional' paris hotel.", "title": "Good, expensive, but loved it !", "user": "elab247", "date": "December 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146862025}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The hotel informed us that they had upgraded our room for free due to our anniversary which was a very nice touch, they also left a cake and congratulations card in the room for us which we really appreciated.", "title": "position position position", "user": "KennedysGoldCoast", "date": "December 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 146802596}, {"rating": 5.0, "title": "Top class, old school", "text": "The hotel and room were fantastic, would happily stay there again, although it is due to close soon for a minimum of 2 years due to a major refurb. I hope they don't change its character too much !", "user": "Nicolas T", "date": "November 11, 2012", "id": 145185247}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "You do feel like you are running a gauntlet of bouncers on the front door occasionally, especially dressed in jeans, boots and a waterproof as I was !", "title": "Mice and mildew", "helpfulness": 5, "user": "Samdyredm1", "date": "November 8, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 144938830}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Every year we travel to Europe and stay at very high end hotels- this was the topper! The rooms were spotless, well appointed and beautiful old world. The service was at your beck and call. The location was terrific! Very expensive but you get what you pay for!", "title": "One of the nicest places we have ever stayed!", "helpfulness": 1, "user": "babbyNyc", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141403528}, {"rating": 5.0, "title": "Rating Before First Visit", "text": "The staff was always pleasant , always trying to help in any way. They also have a hotel car that can drive you to places within a certain mile radius free of charge. It was a great place.", "helpfulness": 3, "user": "John M J", "date": "September 22, 2012", "id": 140953441}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "After reading such varied ratings on the Hotel de Crillon, I became concerned with the swings in comments one to another. I have a perfect romantic trip scheduled in November with my wife and I want it to be just that...perfect in every way possibly. I personnaly contacted the hotel to discuss my concerns and received a reply from Mr. Wassim Mathlouthi, Guest Relations Manager, and, I was instantly put at ease. If the promptness and warmness of the staff shows five star quality even before the visit - this is the place for us. We are looking forward to a wonderful stay at this magnificent hotel. It often appears that sometimes doing unto others what you would have done until you is still the best option. Thank you Mr. Wassim Mathlouthi, you certainly showed exceptional professionalism and class and it is truly appreciated.", "title": "The Heart of Paris, Elegance, Exceptional Service...", "user": "Minnie12359", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140874648}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I stayed at Hotel De Crillon after a gap of several years. Its location is unparalleled - it is close to the Tuileries Gardens, right on La Place de la Concorde - walking back from Place de Vendome last night, the night was clear and the Eiffel Tower was glittering against the night sky. Each member of staff I dealt with was as helpful as it is possible to be - nothing was too much trouble.", "title": "What do you get for the money?", "helpfulness": 2, "user": "meansuitcase", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140825399}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The bed linen was of the highest quality, the shower great. My only gripe is the price of breakfast - I could feed myself for several days at that price. I would - probably shall - stay there again - it is an historic and beautiful building in an improbably romantic location. (The local shopping is, well, every big name you could want, so leave your credit cards behind.)", "title": "What an experience!", "user": "Thedineamo", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 140796286}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 5, "variance": {"poor": 9, "average": 38, "very good": 74, "terrible": 19, "excellent": 287}, "aka": "De Crillon Hotel", "description": "Hôtel de Crillon is an original 18th-century private residence with the most exceptional location in the heart of Paris, the Place de la Concorde. This elegant and opulent property offers 147 Rooms and Suites furnished in a Louis XV style and equipped with the latest techonologies, 5 finest restaurants and bar supervised by the talented Chef Christopher Hache, a gift boutique, a fitness and a business center, and 7 reception rooms with historical decoration"}