{"user_rating": 4.5, "review_count": 529, "name": "Hotel Elysees Regencia Paris", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Our second stay at this fantastic hotel which we would recommend to anyone without hesitation, perfect in every way. The rooms are superb, kept spotless clean and spacious. The staff are pleasant and helpful at all times.Excellent continental breakfast in a really attractive dining room. The hotel is only a few minutes walk from both the Champs -Elyses and the Seine so it is ideally situated.Best hotel we have ever stayed in.", "title": "Fantastic Hotel", "helpfulness": 3, "user": "robinrunaway", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6007839, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We celebrated our wedding anniversay at this great hotel. It is a traditional Parisain building that has been given a very classy modern refurb. The staff are a great asset to the hotel very friendly and helpful and if your French is not up to scratch, they ALL spoke ecellent English. Everything was very clean and effecient and also quiet. We had a wonderful relaxing time, we are used to walking everywhere so its location on the edge of the main area was not a problem. If I had one complaint with the hotel which for me was unexcusable it was trying to get a taxi. I have to say all weekend we had diffuculty getting taxis in Paris apart from when we went to two great restaurants that had cabs outside in 5 minutes of our request. Whilst I understand that there was some kind of convention on in town the weekend we visted, I have never experienced being told that there are no taxis even though we had asked the front desk to book us one a couple of hours in advance. The receptionist who was so apologetic ran out into the street and virtually comandered one, going beyond the call of duty. As I said earlier, the staff are a great asset to this great hotel. I would have no hesitation in recommending it (as long as they sort the taxis out!)", "title": "Very nice hotel", "helpfulness": 1, "user": "Moorrise", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5985909, "likes": {"liked": "— Very comfortable rooms and excellent staff", "disliked": "— Not being able to get a taxi!"}}, {"rating": 5.0, "title": "Loved the Hotel and its Staff.", "text": "This hotel is well located near the Arc de Triomphe and the Champs Elysees and gave us ready access to the city of Paris and its environs (e.g. VERSAILLES). The key here is its staff who take a personal interest in helping its guests, from booking sight seeing tours to local restaurants and answers to your many trivial travel related questions. With only 43 rooms you become more than a quest, you become their responsibility. We were wecolmed by all the staff, but were impressed with Townsend and Nichlas at the front desk and Saraht, who acted as Bartender, but also helped us figure out the room safe! The trip to this hotel could have been business or pleasure, but for us it was a 40th aniversary trip to A City we will always love and a trip made better with a stay at the Elysees Regencia.", "helpfulness": 1, "user": "D&LPiver", "date": "October 22, 2006", "id": 5984518}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Lee and Donna Piver", "title": "Romantic proposal", "helpfulness": 2, "user": "Neil.B.P", "date": "October 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5981135, "likes": {"liked": "— Romantic, good size, clean and quiet.", "disliked": "— Couldn't open a window for fresh air but it was ground floor so understandable."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Boston, MA", "title": "Very Professional & Nice Staff", "helpfulness": 1, "user": "Tony_Josette", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5974114, "likes": {"liked": "— Friendliness of the staff.", "disliked": "— Breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My wife and I wanted a small hotel located centrally in Paris for sightseeing and were delighted with this charming hotel. As said in other reviews, the staff spoke excellent English, were always polite and friendly and gave good advice on things to see and places to eat. The room was smallish but very well laid out and immaculately clean and the bed was really comfortable. I assume the hotel was refurbished not long ago. It is a few minutes walk from both the Seine, Metro stations and the Arc de Triomph, where we happened to see President Sarkozy on Remembrance Sunday. The satellite TV had some UK channels. Our room looked out onto a quiet street and the only noise came from church bells. We would certainly recommend this hotel to anyone planning to eat out a lot as we did - the only meals available are breakfast.", "title": "Long weekend", "helpfulness": 1, "user": "Quickie", "date": "November 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11039585, "likes": {"liked": "— Sensible modern layout and comfortable bed", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We also celebrated our 10th wedding aniversary in Paris at the Elysees Regencia. The hotel was very nice and ideal for a special / romantic weekend. The staff were always helpful and polite and the location is good, convenient and only a short walk from the Metro. We didn't eat there at all so can't comment on the food as there are just too many nice restaurants to explore in Paris. Would certainly recommend this hotel, you won't be disappointed . Although a little expensive we thought it was worth the money. You get what you pay for! Enjoy!", "title": "Tres Bonne Regencia!", "helpfulness": 1, "user": "JPBoyle", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10915106, "likes": {"liked": "— Comfortable clean rooms, good location, friendly helpful staff."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My husband and I stayed at this hotel for 3 nights for our 10 year anniversary. We enjoyed our stay everything was lovely about the hotel and the location. I did feel that it was a bit pricey.", "title": "Great location in Paris", "helpfulness": 2, "user": "lmcIreland", "date": "November 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10845742, "likes": {"liked": "— service", "disliked": "— pricey"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The staff were lovely and acted on every request. Our room had a balcony and we found the room cosy for the two of us. We had the anniversary package on arrival.", "title": "Perfect!", "helpfulness": 1, "user": "mazpaz", "date": "November 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10842743}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We have lovely memories from our stay at this hotel. We booked this hotel solely on advise from this site and we were happy.", "title": "Gorgeous and fabulous", "user": "Loopylu77", "date": "November 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10750920}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel is perfectly situated just off the Champs-Elysees. Ideal for the Seine, metro and RER (to Versaille). Location, location, location. On arrival we were greeted by friendly Englih speaking staff, who despite our early check-in, went out of their way to organise us a room that was ready. There is a small bar and elegant dark wood panelled sitting room reception area, with free internet access from a fixed PC.", "title": "Perfect", "helpfulness": 3, "user": "Nick_From_Manchester", "date": "April 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7480531, "likes": {"liked": "— Location and breakfast", "disliked": "— Limited wardrobe space"}}, {"rating": 5.0, "title": "Very freindly, convenient location, excellent modern room", "text": "The rooms are reasonably sized (this is central Paris remember, so tiny by US standards). Toiletries (L'Occitaine) and robes in the rooms with fresh fluffy towels, changed twice daily (if you wish). High quality plasma TV and well stocked mini-bar (pricey as always, but handy if you forget to visit the supermarket to quench your night time thirst). Tea and coffee making facilities were surprisingly available in the room, which is a great plus, especially if you have to pay Paris prices. Bedrooms were very clean and modern, with wooded floors, air-conditioned, crisply painted and decorated.", "user": "Alfarom", "date": "April 21, 2007", "id": 7406947}, {"rating": 5.0, "title": "Most Enjoyable Stay", "text": "Bed was comfortable with clean white Egyptian cotton sheets. One criticism is the shortage of wardrobe space, no full length wardrobe so you could not hang long dresses without folding over the bottoms (OK - why do we always have to find something to criticise!)", "user": "Paramount81", "date": "April 21, 2007", "id": 7406617}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Take a breakfast, 18 Euros each is not cheap but by comparison to Petit Dejeuner on the street cafes at 10 Euros, there is none. The breakfast room is in a trendy vaulted basement and has unlimited: juice, hot bacon and eggs, tea and coffee, cereals, meats and cheeses, pastries and rolls, yogourts etc. Well worth the money.", "title": "Would recommend it to anyone", "helpfulness": 3, "user": "Finer_things", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7379685, "likes": {"liked": "— Location and Style", "disliked": "— as with anywhere in Paris the rooms could be bigger"}}, {"rating": 5.0, "title": "Brilliant.", "text": "You can leave your luggage and as the location is so central, this is very handy.", "helpfulness": 13, "user": "vhuk", "date": "April 15, 2007", "id": 7364259}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed here in September and travelled from London on the Eurostar. A wonderful way to travel, such a relaxing way to arrive.", "title": "Very good", "user": "Paulo_Almeida", "date": "October 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10449120, "likes": {"liked": "— Location and the little things that make it different from every other hotel", "disliked": "— Size"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We were celebrating our wedding anniversary and the hotel had helped my husband arrange champers in the room, candles and beautiful rose petals everywhere. Very romantic.", "title": "Lovely hotel in a great location", "helpfulness": 3, "user": "dreamingofsun0607", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10175347, "likes": {"liked": "— The decor and elegance", "disliked": "— The view into a neighbouring apartment block."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We've just returned from Paris where my wife and I spent the weekend celebrating our first wedding anniversary and had the pleasure of staying at the Elysees Regencia Hotel. The staff were very friendly, helpful and efficient. The room was very nicely furnished and immaculate. I would thoroughly recommend this hotel.", "title": "Great hotel!", "helpfulness": 2, "user": "mr.miagi", "date": "June 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7789342, "likes": {"liked": "— Great location", "disliked": "— Small choice of breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Enjoyed a short holiday at the Elysees Regencia. Friendly staff, clean, spacious bed/washroom, super location. Wireless in room is rather slow, make use of the common use computer in the lobby if you are not on business. Breakfast not included and rather expensive - head to nearby Paul on Champs-Elysees or Bert's Cafe Contemporarian near the Seine.", "title": "Great Place to Stay", "helpfulness": 2, "user": "JuicyinLondon", "date": "June 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7762240}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We have just returned from a three day break in Paris at the Elysees Regencia. First thoughts....WOW! The hotel was exactly as it appears on its website, it's absolutely beautiful.", "title": "Love And Paris", "helpfulness": 3, "user": "botham2084", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7713991, "likes": {"liked": "— The bed", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "We made our own way to the hotel after flying into CDG. We got the RER at a cost of €32 return and found it very easy despite getting a little disorientated at Gare De Nord. We took the train from CDG to Gare De Nord then from Gare De Nord to Chatelet Les Halles on the 'D' Line where we changed on to the 'A' line to Charles De Galle Etoille. From here we encountered the Arc De Triomphe and found that our hotel was on the exact opposite side from the RER station, just a 5 minute walk from the Champs Elysees. The hotel was in the most perfect location. Literally one street from the Champs Elysees and at the bottom of the road and across the river was the Eiffel Tower. You could not ask for a better location to explore the city and to top it off, the weather was glorious.", "title": "Lovely hotel", "helpfulness": 3, "user": "oliversmum", "date": "May 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7713490, "likes": {"liked": "— Small and friendly", "disliked": "— Nothing to dislike!"}}, {"rating": 4.0, "title": "Good Value and Great Location", "text": "The room was clean and spacious and absolutely gorgeous. The bathroom was fantastic with huge white fluffy towels and bathrobes. The mini-bar was well stocked but expensive. The bed.....well, probably the comfiest bed we have ever slept in! What really made the hotel outstanding was the special touches such as the L'Occitane products on our bed on our last night with a handwritten note from the manager saying she hoped we enjoyed our stay. Each night we came back to the hotel to find our bed had been turned down and the curtain closed ready for us. We were given clean towels twice a day and the bins were emptied daily. This hotel is a real classic boutique hotel. If you are going to Paris, stay in this hotel, you will not be disappointed.", "helpfulness": 3, "user": "Philleas_Fogg_uette", "date": "May 29, 2007", "id": 7711313}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We stayed at the Elysees Regencia in a (green) deluxe room (47) from Jan 2 til Jan 5, based on TripAdvisor's reviews. To summarize our experience with the Elysees Regencia: it is a very fine hotel.", "title": "Good Hotel and a very pleasant stay at the Elysees Regencia", "helpfulness": 6, "user": "HML-KSG", "date": "January 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6562897, "likes": {"liked": "— The friendliness of the staff, the spacious room, it's location", "disliked": "— A bit of street noise"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Some pro's:", "title": "Great Hotel", "helpfulness": 6, "user": "dbocca", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6540856, "likes": {"liked": "— staff, cleanliness, service", "disliked": "— room too dark"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "* nice staff, that will help you with booking restaurants", "title": "Fabulous Staff", "helpfulness": 6, "user": "GME928", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6362775, "likes": {"liked": "— Staff", "disliked": "— Room too dark"}}, {"rating": 5.0, "title": "Very nice", "text": "* good location (close to the Champs Elysees, subway station nearby (George V))", "helpfulness": 2, "user": "GLaurent", "date": "December 6, 2006", "id": 6339744}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "* nice, clean and quite spacious (for Paris!) room. Nice touch: during the day the room is organized (with the green pillows)differently than in the evening (set up for bedtime, with a chocolate and refreshing towel on your pillow). Bathroom (marbled) is ok, with bathrobes & slippers and l'Occitane tolietry. The bath itself is a bit on the small side though (no problem for us, though)", "title": "Great Hotel", "helpfulness": 1, "user": "dbocca", "date": "November 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6270168, "likes": {"liked": "— staff, cleanliness, service", "disliked": "— room too dark"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Hotel Elysees Regencia is located 1 street off the busy Champs Elysees but feels like you could be on a quiet street in the suburbs. The hotel is modern and contempory, staff are very friendly and helpful. We had a Deluxe room (the green one!) overlooking the street. The room for Paris was very large, huge bed, excellent facilities (tea, coffee, toilettries) and good, clean bathroom.", "title": "Superb Boutique Hotel - Great Location", "helpfulness": 4, "user": "matkin", "date": "December 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11450187}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Would definitely recommend this hotel to anyone looking for a reasonably priced (not cheap!) 4-star, centrally located hotel just 5 mins walk from the Camps Elysees.", "title": "Wonderful Hotel in perfect location", "helpfulness": 3, "user": "DrNV", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11247579}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This hotel is what Tripadvisor is all about! We chose this place because of its high rating and the staff went out of their way to ensure they maintained it. The hotel is less than 5 mins walk from the Arc de Triomphe and the Seine. Its a small place but the rooms are beautifully appointed with modern decor and most importantly its very clean. The reception staff were so accomodating and made our stay very special. They even moved us to another room when my girlfriend requested a 'green' themed room that she'd seen on their website!!", "title": "Loved the Elysees", "helpfulness": 2, "user": "shelIreland", "date": "December 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11184218, "likes": {"liked": "— The design in the bedroom and around the hotel", "disliked": "— No restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We would highly recommend this hotel to anyone planning a trip to Paris. The location is excellent , within walking distance of the Arche de Triomphe, the Champs de Elysees and the Metro. Our room was immaculate - comfortable bed - large bathroom with a fabulous shower - oversized and top of the line towels and all the amenities.", "title": "Wonderful Experience", "helpfulness": 2, "user": "Winos", "date": "May 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7696820, "likes": {"liked": "— Rooms and staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The friendly and incredibly helpful staff was anxious to meet all our needs - they even anticipated many of them - made special arrangements for tours, taxis, restaurants, and answered all our questions. There is someone on duty at the front desk around the clock.", "title": "A very pleasant stay", "helpfulness": 4, "user": "Anne1957", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7671419, "likes": {"liked": "— The comfortable bed and the friendly staff", "disliked": "— Insufficient storage space for clothes, and the lift being out of order for two days!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Special thanks to Magali and Katherin at the front desk and Danielle in the breakfast buffet area. If you eat breakfast do the hotel buffet. You need to scour Paris to get a cup of coffee for 4 euros (about $5.20) and most are in the 6-10 euro range. The hotel buffet pays for itself just in coffee, and then there are the wonderful rolls/croissants and other items depending on what you choose. It's a bargain and the basement dining area has been upfitted as if it might be a wine cave. Feel comfortable in Paris with these people. They add significantly to your visit.", "title": "very nice indeed. Breakfast should be included in the price though", "helpfulness": 2, "user": "frootloops", "date": "May 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7641182, "likes": {"liked": "— location", "disliked": "— linen trolley always in the hallway"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at this hotel for three nights as part of my 50th birthday celebrations, based on the reviews on Trip Advisor, and we were not disappointed. We went for a deluxe room, which was quite large, with a huge and very comfortable bed. We had told the hotel about my 'special birthday' and there was a half bottle of champagne and fruit in the room when we arrrived, which was a nice touch. Lovely bathroom, with fluffly robes and up-market toiletries (Occitane).", "title": "THE BEST WEEK OF MY LIFE IN PARIS", "helpfulness": 4, "user": "DaimlerBenz", "date": "May 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7636724, "likes": {"liked": "— The Staff is SUPER FRIENDLY.", "disliked": "— No Clock in the Room."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Breakfast was served in the basement, which had a character all of its own! We had breakfast there on the first morning, I have to say it didn't seem very well organised. No-one told us what to do, it was unclear as which items were included in the continental breakfast, which was 12 euros, and which in the full breakfast, which was 18 euros; we were offered tea or coffee from a communal pot but no-one came to offer refills although I'm sure we could have had refills if we'd gone to find someone. We decided after that to have breakfast in the room for the other two days and that was lovely, particularly when we were given a complimentary glass of champagne and smoked salmon on the morning of my birthday! The full breakfast at 18 euros was very good value.", "title": "Hotel Elysees Regencia -- fine hotel!", "helpfulness": 2, "user": "WatersEurope", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7605267, "likes": {"liked": "— Cleanliness and efficiency (in Paris! :)", "disliked": "— Not a lot of storage space in the room -- a minor niggle..."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "we, as a family of 4, stayed at this hotel recently. It is a lovely hotel. we had a \"suite\",consisting of two rooms at the end of the hallway that we could close off from a door in the hallway. Each room was lovely and quite spacious. The L'occtitane products are a wonderful touch. Personally I prefer a larger hotel that has a workout faciltybut we were only here for three nights. The location was great...a short walk to the metro, Arc de Triumphe and Champs D'Ellysees. The staff was very accomodating also. Unfortunately for us it was very rainy while we were there so we did not wander the neighborhood much. There is a grocery store around the corner and a bakery that had fresh croissants and such daily. all in all I would recommend this hotel. It is true to the photos.", "title": "small boutique hotel", "helpfulness": 4, "user": "fredhilll", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8618012, "likes": {"liked": "— bath products", "disliked": "— lack of gym"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We selected this hotel based on other Trip Advisor reviews and were not disappointed. We stayed for four nights to celebrate our 25th wedding anniversary so chose a Double DeLuxe room. Paris hotel rooms are criticised for being small but this was not the case here, with a king sized bed, clearly two sizeable singles that had been joined, that was almost too big!", "title": "Excellent and well located", "helpfulness": 3, "user": "themorrisman", "date": "September 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8611621, "likes": {"liked": "— The room and the location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The room looked as though it had come directly out of the Hotel's own website and came with coffee making facilities, as well as the usual mini-bar, and it also boasted a good quality flat screen TV.", "title": "Great hotel, great location", "helpfulness": 1, "user": "LondonBonita", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8535356, "likes": {"liked": "— Location and staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The en-suite was excellent with small details that added to the experience, but a second bathrobe would have been nice.", "title": "Superb hotel, great location", "helpfulness": 3, "user": "-Bandy07", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8489160, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Although on the busy Ave. Marceau our room at the front on the 5th floor was quiet, and even the air-con, at minimum, was not noisy.", "title": "Great Place to Stay!", "helpfulness": 4, "user": "BC4323", "date": "August 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8467314}, {"rating": 5.0, "title": "wonderful hotel", "text": "The worst thing about our stay at this hotel was that it was only 3 nights, not long enough. This small botique hotel is in an excellent location. The staff are very good. Our room on the 6th floor (the junior suite) was fabulous. We have stayed at hundreds of hotels around the world and I cannot ever remember enjoying a room any more than this one. It was just about perfect. A building next door blocking much of the view of the eiffel tower was the only thing not perfect about the room. We would stay here again in a second. Highly recommended. Oh, one minor complaint. The wi-fi system throughout the hotel needs work, it never really worked correctly. I am told they are changing companies/upgrading wi fi connections. A minor detail.", "helpfulness": 1, "user": "tiggertime", "date": "September 23, 2007", "id": 8864300}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "we stayed here over the easter weekend and can honestly say this was the best easter ever! the hotel is in a great location, being right in between the arc de triomphe and eiffel tower, and only 5 mins walk to the champs elysees. when we arrived the room wasn't quite ready, so the staff gave us a seat in the lobby and brought us tea, which was lovely. we were taken to the room only 15 mins later, and wow what a room. it was a pretty big room, especially for central paris, and very well decorated and clean. the bathroom was also well done out and a decent size. the view from our french (of course!) window was of the street out the front, but we weren't at all bothered by any traffic noise. on our last night we came back to the room to find a lovely hand written note from the manager saying they hoped we enjoyed the stay and there was a little box of l'occitane goodies which was a very nice touch. the reception staff were all extremely helpful, and their english far better than my feeble attempts at french! on the same street there is a deli called noura, which sells some of the nicest chocolates i've ever had, and the metro station georges v is only 5 mins walk away. i honestly cant recommend the hotel highly enough, and would definitely saty there again", "title": "i love paris in the springtime!!", "helpfulness": 6, "user": "jayne777", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8822673, "likes": {"liked": "— location and comfort factor", "disliked": "— going home"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "My husband and I stayed for 4 nights to celebrate our 10th Wedding Anniversary. We had a double standard room - I requested a fushia room and when I arrived found they had given us a fushia room (much to my husbands delight of course!)", "title": "Lovely, very chic", "helpfulness": 3, "user": "Huts", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8749976, "likes": {"liked": "— It was very modern, clean and fresh", "disliked": "— Rooms were a tiny bit small"}}, {"rating": 4.0, "title": "Amazing!", "text": "We were on the 5th floor and had a tiny little balacony, which if we stood on tip toes could see the top of the Eiffel Tower. The rooms were immaculate, crisp, clean and tidy -not worn or dated. at all. Despite some reviews saying the hotel was noisy, we didn't find that at all. I was surprised at first when I saw how small it was, but it really was big on service, and quality. Ideally situated in the centre, close to Champs Elysees and Metro/Bus stops.The bar area was very intimate albeit the drinks a little on the expesive side, although no more than other places we found. We based our booking on all the good reviews we found this Hotel had, and trust me we spent many an evening trawling through reviews for all different hotesl and this was the best. The reception staff were very helpful and pleasent, always happy to help -which I didn't find in great quantities in Paris! Well worth a stay.", "user": "chris_underscore", "date": "September 15, 2007", "id": 8721113}, {"rating": 4.0, "title": "Loved the Elysees Regencia Paris", "text": "The Hotel was small but amazing, every little detail, I really like the French style. It had free internet, very nice front desk people, who spoke english very well, It was set in such a great area, a couple minutes walk to the Champs Elysee, So we had dinner there every night. The Architecture of the building was amazing, the rooms were very modern.", "helpfulness": 2, "user": "babydix", "date": "September 6, 2007", "id": 8666736}, {"rating": 5.0, "stay_parameters": "Stayed January 2008", "text": "They have different kind of offers in their booking engine especially the Romance package ! Believe me, we were not disappointed at all ! The room is prepared for a romantic stay ( rose petals, music, candle., champagne..). In this package, buffet breakast is included and we are allowed to stay in the room until 3pm !", "title": "this hotel is a treasure", "user": "Geri04", "date": "February 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13519298}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel is beautiful and the staff really does everything to please your every need.", "title": "The absolute best!", "helpfulness": 3, "user": "iilucky", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12902309}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "We would recommend to anyone and would never stay anywhere else", "title": "Fabulous, would definately recommend", "helpfulness": 1, "user": "whenever12", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12770409, "likes": {"liked": "— price and location", "disliked": "— no radio/cd player"}}, {"rating": 5.0, "title": "book it!", "text": "We spent the Christams break through New Years here in the top floor suite. What can I say. Everything was perfect. It was as if we had our own personal Parisian apartment just a hop off of the Champs Elysees. We were surprised by just how close we were to everything, from the subway stops to the main avenue and right between Lido two blocks away and Crazy Horse and Alma bridge in the other direction.", "helpfulness": 3, "user": "3fussytravellers", "date": "January 12, 2008", "id": 12545299}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The staff was friendly, polite, and bent over backwards to please. And if you are tempted splurge on the massage in the basement alcove, what a treat! Plus soft candlelight, rose petals, and a hot cup of tea to chase away the sore muscles from the many miles we must have walked enjoying our Parisian getaway.", "title": "The best place to stay in Paris!!!!!!!!!!!!!!", "helpfulness": 6, "user": "susanPerthAustralia", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12387247, "likes": {"liked": "— Location, style and atmosphere.", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Excellent Location, very close to the Champs Elysee. Easy access to the Metro (Underground) so you`re only minutes away from Paris's main attractions. The staff are very helpful and welcoming. The rooms are a good size, very clean, and are well equiped - safe, mini bar, bath robes, hair dryer, bath & shower, TV, comfortable beds. On our next visit to Paris we will definitely stay here again. Highly Recommended.", "title": "Great Hotel", "helpfulness": 3, "user": "clmswallow", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6181917}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "A great hotel in an excellent location. We stayed in the suite which was absolutely lovely very clean and extremely spacious. Staff were very helpful and friendly. Looking forward to planning our next stay.", "title": "Superb Hotel", "helpfulness": 5, "user": "budbing", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6160433, "likes": {"liked": "— The room", "disliked": "— Room service - food options between 2-6pm very limited & also no English TV Channels except news"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "The Elysees Regencia is a wonderful little boutique hotel, very well located two blocks down from the Arch de Triomphe and the Champs Elysees. The facility has recently been completely refurbished. We took a Deluxe room, which was not overly large but certainly adequate by Paris standards. The room was spotlessly clean and well maintained, with a large king bed, and an attractive modern bathroom with all new appliances. Separate toilet. Good WiFi connection (with cards purchased from reception). The lobby is compact, but there are three pleasant rooms for drinks and a light meal. The staff were exceptionally polite, efficient and helpful at all times. Breakfast choice was a little on the modest side, but quite sufficient. In a city where hotel tariffs generally range from exorbitant to plain outrageous, this little hotel is a real find. The location is excellent, the rooms are clean and attractive, the staff courteous, and the rates very reasonable. All in all, this is the best value for money I have yet to see in Paris. Highly Recommended.", "title": "Wonderful, great value for money", "helpfulness": 4, "user": "MAEL3010", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6121542, "likes": {"liked": "— location, rooms, staff", "disliked": "— breakfast room, narrow corridors"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We stayed at the hotel for 2 nights from the 9-11th Nov. We had such a fantastic time the hotel was perfect the staff were very helpful, pleasent and efficent.", "title": "fantastic hotel and time in paris", "helpfulness": 4, "user": "RumBabe", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6121074, "likes": {"liked": "— Make sure you keep hold of your purse whilst out and about in Paris!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "We will be going back next year!", "title": "Perfect", "helpfulness": 3, "user": "eclopvif", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6014422, "likes": {"liked": "— the rooms , the location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "very good. The standard room in which we stayed is a small but very nice room. The photos speak for the room. We chose the standard room because we were not planning to spend that much time in the room, since there is so much too see in Paris and always so little time (we", "title": "Absolutely Fantastic stay at the Regencia", "helpfulness": 6, "user": "JJJDublin_Ireland", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10058833, "likes": {"liked": "— Service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "reserved that part to the second stop of our honeymoon). The is well located, clean, friendly and a choice to be considered everytime.", "title": "Absolutely Fantastic", "helpfulness": 3, "user": "IMB-Cheshire", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 10036191, "likes": {"liked": "— The comfort and style", "disliked": "— Location and nearby restaurants"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We had a lovely two night stay at this delightful property.", "title": "Lovely Botique Hotel In Great Location", "helpfulness": 2, "user": "ginalds", "date": "October 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10032072, "likes": {"liked": "— Location, location, location!", "disliked": "— No alarm clock"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "A lovely little hotel with great interior design, first class service and wonderful location. I would recommend to family and friends. We stayed for only one night but the hotel was exceptionally friendly. Breakfast not bad too....", "title": "Excellence", "helpfulness": 1, "user": "Hundulator", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12291612, "likes": {"liked": "— Style, location and service", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "I would recommend for a romantic weekend away", "title": "Loved every minute!", "helpfulness": 2, "user": "beebopalu", "date": "January 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12285549, "likes": {"liked": "— Location, friendly staff, stylish decor...great shower!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at 'Hotel Elysees Regencia' in Paris for 4 nights just before Christmas, and we had a fantastic time.", "title": "Loved this hotel!", "helpfulness": 2, "user": "aj3252", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12217257, "likes": {"liked": "— Room size, cleanliness, and breakfest"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel location is perfect, just a 5 min walk from the Champs Elysees and there are plenty of trendy bars and restaurants nearby.", "title": "One of a kind", "helpfulness": 2, "user": "beemster", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11693061, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel decor was stylish and our room was beautifully decorated in shades of green and brown. Unlike some other reviews on TripAdvisor we found our room to be spacious (especially considering we were in Paris) The bathroom had a fantastic shower and girls: the lighting and mirrors are great for putting make-up on!", "title": "Wife's 40th Birthday Treat", "helpfulness": 2, "user": "WolverhamptonProv", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11607890, "likes": {"liked": "— Location and Style"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "We were initially checked into a 3-star hotel near to the Elysee's Regencia. But after one night of traumatic experience at that hotel, we were very certain that a better equipped and endowed hotel was needed for our last night in Paris before heading home. Fortunately, we didn't have to go very far... Elysee's Regencia was the perfect outfit for us to relive our honeymoon experience and ambience. We were especially impressed by the cordial and friendly front desk service. The room was beautifully decorated with 5-star standard bathroom. The location was perfect as it was conveniently tucked into a secluded area near to Champs Elysee... Our final night in Paris was our best in this trip to Europe and we are recommending to our friends who are interested in quality yet affordable travel experience in the not so affordable city of Paris. Cheers.", "title": "Our last but best night in Paris", "helpfulness": 1, "user": "Kevjac", "date": "May 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7568527, "likes": {"liked": "— Bathroom, Services and Location", "disliked": "— Room Size"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We spent 5 nights here in late April/early May - it was exactly as indicated in the TripAdvisor reviews - great location, wonderfully courteous and helpful staff, and a terrific room with windows opening out over the street. The room was spacious and immaculate - even nicer than I could have hoped. They thought of everything - from the chocolates on the bed at the evening turndown service to the going away present on our departure. I have nothing but positive things to say and we look forward to our next stay.", "title": "Absolutely wonderful experience", "user": "WisLaker", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7566097, "likes": {"liked": "— Fantastic staff"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Just returned from a 3 night stay at the Elysee Regencia, which we chose mainly based on the excellent reviews that this hotel has received via Trip Advisor.", "title": "Lovely but a litte dissapointed", "helpfulness": 7, "user": "DebbieandMark", "date": "May 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 7555274, "likes": {"liked": "— staff", "disliked": "— lack of view in suite"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "As this was a break to celebrate our anniversary, we decided to splash out on the Lavender Suite, which looks truly beautiful on the hotel website.", "title": "Recommend highly for excellent service and location", "helpfulness": 2, "user": "TiffanyandCorey", "date": "May 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7546229, "likes": {"liked": "— staff", "disliked": "— Room service. They should improve their selection and quality."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We arrived at the hotel and were welcomed by Aline who was extremely helpful and were very impressed with the reception area and bar, where we enjoyed a lovely glass of wine while our room was prepared.", "title": "Had been looking for a romantic hideaway", "helpfulness": 2, "user": "SurreySiggy", "date": "May 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7539569, "likes": {"liked": "— Staff and location", "disliked": "— poor view"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 12, "average": 21, "very good": 135, "terrible": 6, "excellent": 355}, "slim_ranking": 0.152816508645, "description": "4 star design boutique hotel, just renovated. 5 mns walking from the champs elysees."}