{"user_rating": 4.0, "review_count": 303, "name": "Hotel Le Pigonnet", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Hotel Le Pigonnet is located close to the city center in Aix in Provence and is a good location for day trips. It is about a 10 to 15 minute walk to the center, which makes the location extremely convenient if you are without a car. We had a car and parking was available free of charge. We arrived early on our first day and had to wait around the pool while our room was being cleaned. This was not a big deal because we did arrive before check in. The pool was very clean although very cold. There was plenty of seating. Also, they have a waiter walking around taking orders for lunch and drinks, which was nice but pricey. Our only complaint about the pool area is that they allow pets. After a 15 hour flight, all we wanted was some peace and quiet. However, the entire time out there a dog was barking while the owner sunbathed.", "title": "Good but not great", "helpfulness": 6, "user": "roallen", "date": "September 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3898780}, {"rating": 2.0, "stay_parameters": "Stayed September 2004", "text": "The room (Room 40) was spacious and comfortable. It had a separate shower which was a good size for European standards. The balcony in the room was nice and overlooked the pool. The only downside of the room was some road noise since it was situated at the end of the hotel closest to the road. The hotel gets high marks for the beautiful gardens, which is nice for an afternoon stroll. The main reason for the rating is the hotel staff. The staff would answer your questions with a smile, but you could tell they were not sincere. Also, anytime we would leave for the day they would always ask if we wanted reservations to their restaurant for that night which was never busy and extremely pricey. This was slightly annoying. All in all it is nice accommodations but the customer service was mediocre.", "title": "Repeat visit a bit disappointing, but still has charm", "helpfulness": 6, "user": "minniemouse", "date": "October 15, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 2704729}, {"rating": 2.0, "title": "not as advertised", "text": "They have wifi service and a business center, but you have to pay for it. I believe it was 6 euros for 30 minutes.", "helpfulness": 6, "user": "blubs99", "date": "September 1, 2004", "id": 2507749}, {"rating": 5.0, "title": "One our favorites", "text": "The weather was great except for 1 rainy day.", "helpfulness": 5, "user": "voyagerCO", "date": "August 12, 2004", "id": 2445032}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Nights: 4", "title": "Excellent service, great location", "helpfulness": 3, "user": "LindaandStan", "date": "July 11, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 2289324}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed at Le Pigonnet in late March, on a weekend break from Paris. We were very pleased with the hotel, but were glad to be paying out-of-season prices (120 euros a night, including breakfast). At that price, it was a good value. Our room (14) was not huge but it was large enough. Unlike some reviewers (who didn't like the old furniture), we thought the furniture was attractive and suited the space (except for the print depicting a whale fishery, which I thought was disturbing and took off the wall for the duration of our visit). The provençal printed fabric on the walls was a little busy for my taste, but suited the environment. The bathroom (a light grey stone) was gorgeous, and the bed was very comfortable. Breakfast was only adequate, but the service was good and the view over the terrace was pleasant. We were impressed with the professionalism of the staff with whom we dealt.", "title": "Good out-of-season value", "helpfulness": 8, "user": "frogoutofwater", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4720929}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "As others have mentioned, the hotel is about a 10-15 minute walk from the old city. Note that it is not a very scenic walk; you're walking along a couple of busy streets, past roundabouts and alongside strip mall-type shopping centres. The pavement is a bit uneven in places (due to some construction). But it is quiet and the grounds are spacious - we thought it was a good tradeoff.", "title": "Disappointing", "helpfulness": 10, "user": "Sencybil", "date": "December 22, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 4255973}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Note that, if you're arriving by train on the TGV, don't waste your money on an expensive cab ride (a little over 20 euros). There is a shuttle bus (about 3.80 euros) from the TGV station (about 10 km outside town) that runs every 15 minutes, and it stops at the Gare Routiere, which is very close to the Hotel Pigonnet (probably a 5-10 minute walk). The hotel is located on a street of the same name (avenue de Pigonnet) and the bus driver should be able to point you in the right direction. (The hotel website lacks a useful map.)", "title": "Le Pigonnet - what a tremendous hotel", "helpfulness": 4, "user": "tintina", "date": "November 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4111123}, {"rating": 5.0, "title": "A piece of paradise", "text": "We ate dinner at Le Ramus (a tiny restaurant consisting solely of an outside terrace; inventive cuisine and very friendly, young staff) and Le Bistrot Latin. The food at Le Bistrot Latin was a little better executed; in both restaurants the service was professional. We'd certainly recommend either.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 30, 2005", "id": 4073332}, {"rating": 4.0, "title": "Loved This Property", "text": "We stayed at the end of November for a romantic getaway. Overall I was a bit disappointed with the general feel of the hotel. The room looked nothing like the photographs, and although large felt very spartan, bare and unluxurious. The furniture was more just old battered things your granny would have rather than antique. The landing was gloomy and the carpets stained. The bathroom had black mold in some of the grouting. Having said that the room and bathroom were large, the robes and slippers appreciated, and the bed very comfortable. The location is good, a 10 - 15 min walk into town, but we were happy to have that inconvenience in exchange for easy driving and free parking. I'm sure in the summer the garden / pool and break from the crowds would be a real bonus. If we'd paid £50 I'd have been pretty content, but at £100+ without breakfast I felt it was a bit of a rip off. Don't bother paying extra for a garden view room if its going to be dark most of the time you're there - I did thinking it might be a higher grade of room, but the only difference is what you see from the window.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 4, 2005", "id": 3988068}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 5, "variance": {"poor": 17, "average": 43, "very good": 104, "terrible": 7, "excellent": 132}, "aka": "Le Pigonnet Hotel", "slim_ranking": 0.132352941176, "description": "Our Provencal Bastide from the 18th century combines tradition and modernity. This hotel with 44 rooms and suites is located at a stone’s throw of Aix-en-Provence city centre.With a gourmet restaurant and a bistrot, meeting and banquet rooms, heated outdoor swimming-pool from May to October, lounge club outside, fitness area, spa with hamman and sauna, the Hotel & Spa Le Pigonnet offers guests relaxing moments in a luxury and timeless atmosphere.We suggest a walk in our magnificient French garden, with an amazing glance to the Sainte Victoire mountain, painted jewel by Paul Cézanne from our hotel’s terraces.44 Bedrooms & Suites, in a haven of peace…"}