{"user_rating": 4.5, "review_count": 1364, "name": "Hotel Contessa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "Got this hotel through Hotwire for a great deal. Suites were wonderful. Only drawbacks are the long waits for the elevators. We waited over 45 minutes for our car one time. Little hard to be patient waiting that long with a three year old that just wants to go to the zoo.", "title": "Rooms nice, valet and elevators not so much", "user": "mrsagibson", "date": "March 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 126140305}, {"rating": 5.0, "stay_parameters": "Stayed March 2012", "text": "I just spent two wonderful nights at Hotel Contessa in San Antonio for Spring Break with my kids! The Hotel Staff was so attentive and courteous to all our needs. The services we received from everyone were fantastic. The Hotel sits right on The Riverwalk!!! We were able to enjoy the beautiful heated pool with an exceptional view of Downtown San Antonio as it sits on the top floor of the Hotel! Valet Parking was Excellent and the staff was quick, very friendly and helpful. I am looking forward to our next trip to San Antonio, Tx as I WILL be staying at Hotel Contessa next time! Great place for Great Family Fun!! =D", "title": "Wonderful Hotel with great Personnel, Services, Amenities & Decor!", "user": "KarlaColbath", "date": "March 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126133236}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at the Hotel Contessa for my wedding in October 2011. I probably should've thought ahead and gotten a block of rooms, since there were so many people staying here, but I'd never done it before, so it didn't occur to me at the time.", "title": "On the far end of the Riverwalk, but really a lovely stay.", "user": "Alissa C", "date": "March 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126061558}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Valet parking is really your best option when staying here, as there were some questionable characters roaming around the area, and I wouldn't feel safe leaving my vehicle in a normal open lot. We were very nicely helped with bags (and with a wedding, we had a lot of them) when we arrived and check-in was very easy. The lobby is really quite impressive, as it goes up the entire height of the hotel - all of the rooms surround the central atrium - and it has a nice bar on the bottom floor.", "title": "Business Trip", "user": "john s", "date": "March 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125845300}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We were sorely disappointed with our room position when we first arrived - in a corner, next to the maid's closet and the icemaker, overlooking a bus stop and VERY VERY noisy bridge. I went directly to the front desk and told them that this was our wedding, hence our wedding night, and would really require a better placement. They did quickly move us up to a much higher floor, but even so high, you could still hear the road noise below - it didn't ruin the beauty of the room, but wish they would've had some quieter windows!", "title": "Nice hotel, great location on riverwalk", "helpfulness": 1, "user": "sdg3", "date": "March 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125627034}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The Hotel Contessa is a wonderful hotel with well apportioned and spacious rooms and an excellent location on the Riverwalk. However, what makes Hotel Contessa exceptional is its courteous and attentive staff. Two staff members who stand-out during my stay are Eddie G. of the lobby/arrival team and Leo who handled the valet parking and offered great advice on local restaurants. Eddie G. is an extremely professional and service oriented member of the team. His energy is amazing and he seemed to predict what a customer needed. Leo not only took care of our vehicle he was interested in the care of the passengers. Leo provided a great tip for a lunch time restaurant that ranks as the top place we ate during our stay in San Antonio. Eddie and Leo--along with all the hotel staff--are the reasons we will return to the Hotel Contessa. Thank you! Regards, Robert Crispino", "title": "Excellent service", "user": "C2Traveler", "date": "March 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125596627}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "There was noise from the nearby street or the across the street gArage.the view of river walk was just ok.I expected an espresso maker machine than the regular coffee machines you can find In cheaper hotels.nice firmitire.one sink at the bathroom.", "title": "Expensive for the view", "user": "Betty L", "date": "March 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 125571475}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "All of our colleagues were at the conference hotel about three blocks away and they were very jealous of our accommodations here at Hotel Contessa! We had two large rooms that were quiet comfortable, and we enjoyed several meals in the hotel restaurant. Additionally, the roof top pool and hot tub are wonderful. I would definitely return here for pleasure because the service was superb and the hotel is beautiful, in a wonderful location, and the price is right. I don't see how anyone could go wrong booking a stay in this hotel.", "title": "You will love this hotel!", "user": "bruin09", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125564304}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This hotel is on a less developed portion of the River Walk but still very close to all of the attractions, restaurants and bars one would want to visit. The lobby area and bar are nicely appointed. It has a rustic Spanish feel to it which is what one expects in San Antonio. The bell hops, front desk staff and bar tenders were very courteous and professional. The room itself was nicely appointed. It carried the same rustic Spanish feel but wasn’t overdone. The furnishings were of good quality and in good condition. It’s a two room layout much like you’d find at an Embassy Suites, however, it doesn’t have a wet bar, the only sink is in the bathroom. The only drawback to the hotel, however, is a big one. This is an atrium style hotel which does a lot for the ambiance but little for ones ability to get a good night’s sleep. The soundproofing in the rooms is very poor. I was on the 8th floor and could hear everything going on downstairs in the lobby/bar area. I’ve stayed in other atrium style hotels and this is the first time I’ve experienced this problem. This is a shame as the hotel excels in all other areas.", "title": "Good service, nicely furnished but terrible soundproofing.", "user": "txlitigator", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 125503096}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "When I made reservations for a conference for whatever reason I forgot to book the hotel for our arrival day. So I scrambled to find a hotel on the river walk. Hotel Contessa was the winner with a 30% discount for same day booking through Expedia.", "title": "Not bad for one night", "user": "DrDivaG", "date": "March 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 125501387}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I really had a missed bag experience at this hotel. Please keep in mind that I was staying here for business, and so I was using my hotel for sleeping and for working -- not necessarily for relaxing or even location.", "title": "Lovely property, poor experience", "helpfulness": 1, "user": "Gemutlichkeit", "date": "March 31, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 127020757}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "My primary need for the hotel -- sleeping -- was not met. The hotel had a lot of noise starting at about 4 am. At first, I thought the sound was of vacuuming in the hallway, but as I walked about the room, I realized that the sound was coming from a power washer cleaning the building, located directly 2 floors below my room. They decided to maintain their property with a generator-powered device at four in the morning. And it lasted for about 40 minutes. It was very loud. My traveling companion, on a different floor, was also awoken and couldn't get back to sleep. She had stayed at this hotel previously and said that the last time she was here, she was awoken by trash collection noise.", "title": "Wonderful Location and Staff", "user": "joli28", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126799490}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Some of this, a hotel cannot control. They don't control when the city or when a private company picks up the dumpster. But power washing their own facility? Very disappointing.", "title": "Wonderful Staff", "user": "Ardmorite", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 126709625}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The other thing that went very wrong for me was the morning valet service. Their parking circle is quite small, and it dumps out onto a one-way street at a bus stop, making it difficult for the cars ahead of you to get out on time. Plus, they appear to pull cars even when the drivers aren't there, so the pull-through was clogged with idling cars that didn't appear to be going anywhere soon.", "title": "A truly great experience", "user": "Chur D", "date": "March 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126698744}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The hotel warned me that it might take up to 15 minutes to claim a car, and I planned accordingly. Still, we waited nearly 30 minutes, making us nearly late to our morning meeting. Plus, once we got the car, they couldn't remember where they had stored the GPS and we wasted another few minutes opening each cubby hole in the rental car. Very disappointing.", "title": "Wow - what an amazing place", "helpfulness": 1, "user": "Ann S", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126659569}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Hotel Contessa is located right on the Riverwalk. Absolutely huge room with separate bedroom/living areas. Awesome restaurant and bar in the hotel. Great location. Overall just a really classy hotel!", "title": "Wonderful Hotel - one of the best in San Antonio", "user": "dlobb", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126659322}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The staff at the hotel was AMAZING. From the time we arrived until we left, everyone was there to answer questions, offer advice, give directions or open a door. They were great. The Hotel was at a quieter end of the riverwalk which is nice if you don't like the noise, but you did have to walk a few blocks to get to some of the nightlife which wasn't a problem. The restraunt was a bit pricey, but tasted wonderful. The rooftop pool and workout facilities were also very adequate. I would definitely stay here again!", "title": "Overall Good Stay", "user": "Jason L", "date": "March 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 126572905}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "My husband an I recently stayed at the Hotel Contessa, from March 15-18, for a wedding that was in town. The hotel itself is beautiful. The lobby and bar area are decorated nicely, as are the guest suites. The suites are very comfortable and offer anything you would need during your stay. The restaurant served great food, the breakfast buffet was especially enjoyable. The Cork Bar offered great drinks and had some good happy hour specials. The elevators were a little slow since there were only 3 to service the entire hotel. That was fairly easily overlooked. The staff we encountered were very kind and willing to help with anything.", "title": "Wonderful hotel and staff; messy billing...", "user": "guest82583", "date": "March 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126456453}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The problem that I have with this hotel is the billing procedure. Upon check in, we were charged the total of the room, taxes, and fees, plus an additional amount, directly to our debit card. When I inquired about this, I was informed the extra was $75/night hold on funds for incidentals. This was ok, as they said they would release the funds at checkout, and we paid with a debit so they had to make sure they'd have their money. However, when we received our bill at check out, a charge to the room for dinner at the restaurant was on there for the day we checked in. We did not check in until almost midnight on March 15 and went straight to the room, so we obviously did not make the charge. First I was told they would have to review the account, but when I refused to sign anything authorizing the rest of the charges, they removed the charge in question. 3 days after check out, an additional debit was made to our account for items from the refreshment center that we did not purchase/consume. We were aware of the cost of these items and made great effort to not even move anything out of place. I have inquired about this second charge and am awaiting a response.", "title": "Nice Hotel, not staffed for spring break", "user": "RunGirl11", "date": "March 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126370834}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "This is a wonderful hotel and I would very much consider a return trip, but the billing needs to be clarified. I do have a problem with the fact that our account was debited after we checked out, especially since a $250 hold on additional funds was placed at check in. I did contact the hotel about the additional charges and my concern was promptly addressed and I was refunded the appropriate amount. Best advise would be to use a credit card when checking in and make sure to double check your itemized bill upon checkout.", "title": "Favorite Riverwalk Hotel", "user": "Redraiderfans", "date": "March 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126267802}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 4, "variance": {"poor": 60, "average": 80, "very good": 306, "terrible": 51, "excellent": 867}, "aka": "Contessa Hotel San Antonio", "slim_ranking": 0.00862068965517, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}