{"user_rating": 3.0, "review_count": 241, "name": "Hotel Peninsular", "reviews": [{"rating": 3.0, "title": "Great value!", "text": "I stayed at the Peninsular for 4 nights and found it very accomodating with a terrific location, close to everything. I traveled as a single and received a room with 2 twin beds for 50 Euro. I would definately recommend this hotel for the budget traveller who expects no frills. The staff was friendly, the rooms and hotel are kept clean and has a quaint feel to it. I agree that you can hear people come and go, so if you are a light sleeper earplugs would help. I had no problem though. Remember to bring a wash cloth if you use them, as they are not provided. Breakfast was standard fair, an assortment of 3 types of bread, coffee & orange juice. They do have a hair dryer you can use from the lobby, but you can find one for cheap if you don't have one with proper outlet. Definately a great bargain!", "user": "SantaMonice123", "date": "October 27, 2005", "id": 4066218}, {"rating": 2.0, "title": "Good position", "text": "The good point about this budget hotel is its proximity to Las Ramblas and from there to Calalunya square for the buses etc.,the waterfront, tourist information and gothic area. It is down a narrow, mostly traffic free, street off Las Ramblas, which connects to the Montjuic area so lots of people about. It is very clean, the rooms are small, very, very basic but the bathroom was fine. It did have air conditioning. Other Tripadvisors' recommendation of being out all day and just using the room to sleep in is about right but it does help to bring ear plugs, you will need them. The hotel has an atrium with small walkways all around on each of the four floors so the sound of anything carries up and around. The old doors have gaps under (it was a former convent) and on several nights it was very noisy as students use it and were coming back late at night when we were in bed. The breakfast was two fresh bread rolls, butter, jam and a little plain cake with tea/coffe and some orange squash (not fresh juice). The owners were friendly and kept things in the hotel safe for us. It is a good budget hotel for a short sightseeing break but I would not like to have it as a main holiday or for more than 5/6 days. A minus for us was that we had booked a twin room (for two girlfriends) and despite confirming this again by fax only got a small double bed which they couldnt change until the last night and then we couldnt be bothered to change. Just a word of warning: please be so careful with your bags, my friend's rucksack was tampered with on an escalator but nothing stolen at the Barcelonabus station which was full of unsavory types and the bus driver had to chase some off when we arrived. Do all the usual safety checks - there are now lots of police about all over the city (but not at this bus station at night) and everyone tells you to watch your bags. There is even a notice on the breakfast table telling you not to leave your bag - it does make even a seasoned traveller a little alarmed! Rucksacks are such an easy target especially those with easy opening zips at the front and do look so touristy.", "user": "TreesDorset", "date": "October 7, 2005", "id": 3998999}, {"rating": 5.0, "title": "Cosy place to stay and such a kind stuff", "text": "The Peninsular Hotel is a perfest place to stay - I am quite often in Barcelona and I always stay at the Peninsular - the stuff is gorgeous - always friendly, always good to chat with - like a big familiy. - Yes it´s a cheap hotel, and the hotel can not be blamed, when guests come home late at night, making noise !", "user": "A TripAdvisor user", "date": "August 21, 2005", "id": 3794619}, {"rating": 2.0, "title": "dont trust the staff here!", "text": "It not fair when guest grumble about the Peninsular - it is cheap, perfectly located, the rooms are clean and it is nonsens to expect luxury if you consider the low prices of the hotel! The hotel has got a special atmosphere, as it was a convent in former times - and you can trust the whole stuff perfectly - I have got a nice friendship with the whole stuff and everytime I arrive in my favourite hotel, I am given such a lovely wellcome - so the hotel is like a second home for me - I can really recommend it - if a guest wants so have luxury rooms, should go to another hotel, which is more expensive. I feel so cosy and good at the Peninsular and bad reviews concerning this hotel are simply not fair!!!", "user": "traveller123159", "date": "July 22, 2005", "id": 3693077}, {"rating": 2.0, "title": "Pretty basic, noisy, good location", "text": "I absolutely can recommend teh Peninsular - if you want an really nice stuff, clean and cheap rooms, located perfectly to teh center and to the marvellous LICEU Opera house - choose the Peninsular ! ! ! ! ! ! !", "user": "Jefferson G", "date": "June 13, 2005", "id": 3548657}, {"rating": 2.0, "title": "Disappointed", "text": "We saw the hotel featured in an article in a national newspaper and having read the reviews on this site, expected basic accommodation but with a great location which was important to us. When we arrived at the hotel there was building work underway and everything was very dusty. Our room certainly was very basic and monastic but clean. We were a little concerned at the lack of bedding as it was a cold weekend. When we requested more, we were told we could not have any until the next day. One of the great features of the hotel is its beautiful courtyard and atrium - shame it´s out of bounds to guests after 9pm. We decided to go and explore Las Ramblas - this really is a great central location although the street could be a little scary at night for women on their own. As we went to leave the room, we noticed that the window was open and when we tried to close it, we found that a large pane of glass was completely missing, giving direct access to our room from the roof! Having found what we felt was a nicer hotel just a short stroll away for only 10€ per night more, we decided not to stay at the Pensinsular.", "user": "Javea03730", "date": "February 3, 2007", "id": 6738266}, {"rating": 4.0, "title": "Great moderately priced hotel", "text": "We found the hotel by accident and it turned out to be a little gem.", "user": "sharon65", "date": "January 1, 2007", "id": 6532257}, {"rating": 2.0, "title": "Moderate hotel", "text": "Fabulous location a hundred meters or so from Las Ramblas, but away from the noise.", "user": "haiwaiyou", "date": "December 8, 2006", "id": 6347075}, {"rating": 5.0, "title": "Fantastic place", "text": "Hotel has a faded granduer feel and the central atrium was stunning. We had a room overlooking the atrium on our first stay and wouldn't recommend this any noise carries.", "user": "Rozie", "date": "July 26, 2006", "id": 5513264}, {"rating": 5.0, "title": "My kind of place!", "text": "Breakfast can only really be described as okay.", "user": "beech_bunnie", "date": "July 22, 2006", "id": 5496554}, {"rating": 4.0, "title": "Really OK!", "text": "We went to Barcelona to celebrate New Year 2005! Even in this season it's very nice to visit this city! At first we were a bit anxious because I read some less pleasant reviews, but none of them are true! You can expect all the comfort you need. The beds are fine and the bathroom has a good shower. It's basic but much better than some other **- hotels I've seen. Breakfast in the morning is more than enough and you'll only be hungry at lunchtime ... to have some tapas!", "user": "A TripAdvisor user", "date": "January 7, 2005", "id": 2986756}, {"rating": 4.0, "title": "Dont be put off by the bad reviews!", "text": "Enjoy your stay at Peninsular!", "user": "Barcababe", "date": "June 28, 2004", "id": 2227216}, {"rating": 5.0, "title": "Top-notch Hotel", "text": "I booked two nights at the Hotel Peninsular through STA travel, then looked on the web to see if I could find out anything more about the hotel. I was really upset when I found this site and read the reports about bedbugs!! I wished I'd checked it out before I booked! But it was too late to change it so I went along anyway, and ended up being pleasantly surprised.", "user": "IanWappat", "date": "May 17, 2004", "id": 2070928}, {"rating": 1.0, "title": "Awful hotel: mold, noise, cockroaches & no hot water after 8am", "text": "There was no sign of any bedbugs (we checked matresses and sheets, and we have no bites a week on). Both the room and shared washroom facilities were clean. The staff were friendly, and breakfast was perfectly adequate (bread, a muffin and tea/coffee/oj). The air conditioning worked a treat so we had a lovely cool nights sleep, and noise was never a problem, though we did invest in some earplugs after reading advice on this site. I think this is something worth doing no matter where you plan to stay, as the movements of the other guests are pretty much beyond a hotel's control!", "user": "A TripAdvisor user", "date": "May 11, 2004", "id": 1927634}, {"rating": 4.0, "title": "Hotel with Charactor", "text": "There was not much natural light in our room as the window faced into the building, but this also meant that there was no external noise from the street - a big plus in noisey Barcelona! The furniture was worn out (e.g. drawers wouldn't open fully, bedside table was on a slant etc.), but the beds were comfy. The large plant-draped foyer area is lovely to come back to. The hotel definately has character and we felt comfortble and totally at home there. The atmosphere is relaxed, and this makes it an oasis amongst the bustling busy streets.", "user": "A TripAdvisor user", "date": "April 28, 2004", "id": 1844275}, {"rating": 4.0, "title": "Good Hotel For A Good Price", "text": "I stayed at Hotel Peninsular with friends when we came to stay for 4 days for an Art trip. The hotel rooms were average with a cupboard, bedside cabinet and beds. We were lucky enough to have a balcony which, we loved and spent most our nights looking out into the street. The breakfast was good with no limits to tea, coffee and juice and the spread cheese we were given was amazing and always finished. Its a great hotel for the price and the location is superb with a pub just down the road and clubs 10 minutes away.", "user": "A TripAdvisor user", "date": "April 7, 2006", "id": 4949882}, {"rating": 3.0, "title": "Take this hotel if you re looking for...", "text": "... a clean and safe place in the heart of Barcelona.", "user": "NYlover83", "date": "March 11, 2006", "id": 4599676}, {"rating": 4.0, "title": "OK for price", "text": "We stayed 5 nights in a room with private bath.", "user": "A TripAdvisor user", "date": "January 1, 2006", "id": 4314627}, {"rating": 4.0, "title": "Beautiful budget hotel", "text": "Though we travelled in a group of 3 we got a 4 bed room with a small balcony.", "user": "Scuba-in-Cuba", "date": "December 17, 2005", "id": 4247505}, {"rating": 3.0, "title": "Excellent Hotel, friendly staff.", "text": "Don't expect much!!!", "user": "Andrew347", "date": "December 13, 2005", "id": 4237977}], "location": {}, "stars": 1, "variance": {"poor": 36, "average": 56, "very good": 76, "terrible": 46, "excellent": 27}, "aka": "Peninsular Hotel Barcelona", "slim_ranking": 0.81106870229, "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.5, "location": 4.5}}