{"user_rating": 4.0, "review_count": 75, "name": "Hotel du Cygne", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is a small privately owned B&B type hotel in an excellent location near Les Halles and the Louvre. There is a public underground car park nearby which is reasonably priced.", "title": "Great location for the price", "user": "MatthewGreen", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 168624831}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The decor of the public areas of the hotel is lovely. The rooms are simple but be warned that they are exceptionally small. This is fine for a one or two night stay if you're out all day exploring the city but I'm not sure a couple would want to share a room for any longer than that. Also be aware that there is no lift and the staircase is very steep and narrow. I'd really not recommend this hotel with any difficulties in getting up and down stairs.", "title": "Great location and good price", "user": "sightsandsounds28", "date": "July 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 168402778}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Otherwise the staff were friendly and helpful and so generally I would recommend this hotel to others.", "title": "in this location hard to beat", "helpfulness": 1, "user": "Klaus99", "date": "July 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 165904507}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This hotel is located in a convenient central location, close to excellent transport links, and within walking distance of the main tourist attractions if you are visiting for a holiday. Staff are pleasant and helpful. The hotel has a quaint character, which some people might find a little twee or outdated, but I was quite happy with the small but clean room. The en-suite in my single room was small but very modern and clean. My only issue was with the noise from the street. The nights were very warm when I staying, and with no AC in the rooms the only option was to leave the window wide open. My room faced onto a busy street below. I am a deep sleeper and was just too tired in the evenings during my stay to be distracted by this. However lighter sleepers may wish to check in advance which direction the window of their room is facing. I thought the price I paid was very reasonable given the good location and the time of year I visited (mid-July). I did however book in advance.", "title": "Very good location but very very very small room!", "user": "MariaPortland_Oregon", "date": "June 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 165712847}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "In this location for that price I believe the hotel is hard to beat.", "title": "Gonzalo's review", "user": "gonzaloromani", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162552736}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "variance": {"poor": 2, "average": 13, "very good": 45, "terrible": 2, "excellent": 13}, "aka": "Du Cygne Hotel", "slim_ranking": 0.504740658115, "description": "The Hotel du Cygne welcomes you in a traditional and friendly atmosphere. This charming hotel is a part of a restored genuine 17 th -century building that is located in the heart of the city, the old and historical section of Paris.Our hotel is just a few metres away from the busy metro area of Chatelet/ Les Halles with its direct connections to both Parisian airports – Orly and Roissy – and it is also very close to the Marais."}