{"user_rating": 4.0, "review_count": 266, "name": "Hotel Agneshof", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "Our experience at the Agneshof was not as good as the other reviewers. We were there in July and it was very hot so we had to keep the windows open because the heat in the room was unbereable. The room faced the street so we could hear all of the noise from traffic and passers by. It was a quiet street but there were still some people making noise out there. Very early in the morning some trash trucks passed by at least twice and woke us up. To add to things the room was next to the elevator so we could hear it moving and the doors opening and closing. We also realised that the shower drain was clogged and informed the reception about this, the girl there did not understand what we were talking about and made no effort to try to help us. We had to shower with the water almost over flowing because of the clogg. When we complained again at the reception the girl seemed to understand our complains about the noise when my husband explained our problems in German. We were then assigned another room (this was our second day there) but the did not help us to carry our luggage to our new room and were left to do it alone. The new room was not as noisy but the bathroom was not clean, it had hairs from the previous guests and the wall behind the toilet was splashed with drops of urine. We also asked for a fan because the weather was so warm for us but they said they could not provide us with any even though we saw they had one at the reception. The reception area itself was welcoming and clean and the garden very nice. The breakfast was generous and the lady who served it was very nice. The hotel does have a computer with internet access for the guests to use for free so that was a plus. It's also located very near the Haputmarkt. Most of the male reception employees were very accomodating. We would not stay at this location again.", "title": "Not such a good experience", "helpfulness": 3, "user": "TjLaura", "date": "July 20, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 5490608, "likes": {"liked": "— Free Internet access", "disliked": "— Room was not clean"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Stayed at the Agneshof for four nights over Easter.The hotel is attractively furnished in a modern style and the staff charming and extremely helpful.Having seen one of the superior rooms I wouldn't say that it was worth the extra money. We had a standard room overlooking appartments at the back of the hotel - although this wasn't a problem I would have preferred to look over Agnestrasse (the street)apparently still standard rooms.", "title": "Agneshof - lovely hotel", "helpfulness": 6, "user": "highbank", "date": "April 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4987840}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The rooms were spotlessly clean with a good size bathroom. Took a long time for the hot water to come through in the morning but plenty of hot water when it did.The shower over bath was right in front of a window so you had to make sure that the curtains were drawn - they were also showing signs of wear from continually being wet.", "title": "Thoroughly recommend the Agneshof", "helpfulness": 9, "user": "EllenT", "date": "December 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4251133}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Nice touches were chocolate eggs etc in the room because it was Easter. The breakfast included hams, cheese, fish, cereals, fruit, croissants, eggs etc - very good. The location of the hotel is perfect, in the old city and a couple of minutes from the castle and good restaurants.I would certainly return to the Agneshof- do beware of price drops though as the price became cheaper nearer the time and Nuremberg does not seem to be buzzing with too many tourists.", "title": "Loved this hotel!", "helpfulness": 10, "user": "Sudzy", "date": "December 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4241233}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "We stayed here for two nights, visiting the Christkindlesmarkt and the city. Arrived very late - almost 1am - following travel delays to find we were still expected and our reservation details ready to sign. Comfortable, clean, well-designed and quiet room overlooking the picturesque Agnesgasse, which is pedestrianised. The room wasn't huge, but the clean lines of the layout meant that this wasn't an issue. Excellent and varied breakfast. In the heart of the old town, very close to the markets, churches, castle, the Durer house and a collection of assorted and very good restaurants and bars. The rate was €140 booked through the Sorat hotels website - this is a very busy period, so no bargains to be had.", "title": "Great little palce", "helpfulness": 9, "user": "Maggot", "date": "October 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3994326}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "This hotel is ideally located in the altstadt. The rooms (with private bath) are spotless. We were surprised by the excellent breakfast buffet each morning. Most impressive was the friendliness of the staff and their real desire to help us have the best vacation possible in Nuremberg. Our room 101 had a great view over the garden. There is also a computer in the lobby with free inernet access for guests. This hotel is a real bargain.", "title": "A gem of a hotel", "helpfulness": 5, "user": "sheilaCO", "date": "September 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3915163}, {"rating": 4.0, "title": "Christmas Market 2004", "text": "We came to stay with our 4 children - 8 months, 2 and a half years, 9 years and 11 years -between 15 and 18th december, and although our rooms were not adjoining and we took our own travel cot, the standard of the accomodation was very good. The service was friendly and polite, and sandwiches in the room were even supplied at no notice one night when the babies meant we couldn't get out to eat.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "December 31, 2004", "id": 2966831}, {"rating": 5.0, "title": "Loved this Hotel", "text": "Breakfast was excellent - we thoroughly recommend this hotel.", "helpfulness": 6, "user": "RoseFallsChurchVA", "date": "December 15, 2004", "id": 2883967}, {"rating": 5.0, "title": "We love this Hotel", "text": "this hotel was a special find - we stayed there in December 2004. The room is modern and spotless. The hotel was in a great location in the old city and we walked to the Christmas market in 3 minutes! Most exceptional was its staff who were so helpful and nice. The breakfast buffet was exceptional and included hot/cold dishes, even smoked fish! We look forward to our next stay there.", "helpfulness": 11, "user": "Zabelle", "date": "January 9, 2004", "id": 1544057}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 7, "average": 24, "very good": 137, "terrible": 1, "excellent": 97}, "aka": "Agneshof Hotel Nuremberg", "slim_ranking": 0.133858267717, "description": "Chic, charm and comfort. The Agneshof is the pearl midst the artistic old town of Nürnberg. The hotel is located quietly and hidden between the Sebaldkirche church and Kaiserburg in the historic center. With an own hotel garden and a jaccuzzi to relax. Simply perfect for your business trip, a short trip or city trip."}