{"user_rating": 3.5, "review_count": 1645, "name": "Hotel Riu Naiboa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We just returned from our first trip to Punta Cana. We have nothing to compare the Taino to but we have nothing but good things to say about it.", "title": "Great STay", "helpfulness": 8, "user": "cmpOttawa_ON", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14307300, "likes": {"liked": "— The beach/pool and the cleanliness", "disliked": "— Not one complaint"}}, {"rating": 3.0, "title": "Naiboa Getaway...", "text": "We arrived at 4 a.m. Check in took all of five minutes and within another five minutes of arrving in our room, our baggage was delivered. We were very pleased with the room. This hotel is older and not as fancy as the Macao and the Palace but it is absolutely fine! It was just as good as our hotel in Paris last summer. We found the quality of the housekeeping to be excellent. I agree, however, with other reviews about the sheets being a little small and there were no mattress covers so each morning, the bed was quite a mess. I found the beds comfortable and, yes, the pillows were small but in the scheme of things, that is not an issue. the only issue we had with the room was regarding the air conditioning which did not work one day (we had left a window open and it will not work until it is closed) and within 5 minutes of calling, someone arrived. We were impressed!", "helpfulness": 3, "user": "CaribbeanChill", "date": "March 11, 2008", "id": 14222221}, {"rating": 3.0, "stay_parameters": "Stayed April 2007", "text": "We had some built in concern about the buffet, based on reviews we had read, however, we were most impressed. Yes, you see much the same thing each day, but there is so much variety that it is impossible to get bored.Staff was friendly and attentive.", "title": "This hotel was average!", "user": "FOB_freak101", "date": "March 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 14224270}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "We spent most of our time by the pool. It is incredibly close to the beach so we would move back and forth. Yes, you need to get down quickly in the morning to reserve you chair, but we found we wanted to be down there early anyway. That is when it is most quiet. By mid-morning, the beach gets quite congested and we enjoyed the peacefulness the early morning provided. There was always lots of activity around the pool and although we were rather lazy, we enjoyed watching the water fitness, dance classes, etc.", "title": "Loved it!", "helpfulness": 2, "user": "ajo1", "date": "March 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14197243, "likes": {"liked": "— The friendly, wonderful staff, the food, the drinks, the pool, the beach ...", "disliked": "— Time went by too fast!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "It was a great holiday. There seems to be a great deal of disagreement on this resort. I think there are newer and older rooms. If you get a room in the newer sector, it seems to be fine. We talked to another couple who were not pleased, and they were moved immediately. They were pleased with the reception they received to their request.", "title": "Amazing Time Had", "helpfulness": 13, "user": "Cutter9", "date": "March 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14166996, "likes": {"liked": "— The staff and the beach", "disliked": "— Nothing"}}, {"rating": 2.0, "title": "Was great till ripped off", "text": "Was a good side trip to the Dominican until my last night I was ripped off(on the resort) by the waitress at the Disco Pacha .I was given 3.00 instead of 30.00 in Peso's.", "helpfulness": 6, "user": "CanTravel77", "date": "February 2, 2008", "id": 13214964}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "There is a difference in being ripped off OFF the resort but on the resort ?", "title": "Our wonderful honeymoon at the Taino", "helpfulness": 10, "user": "oct13bride", "date": "January 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13145641, "likes": {"liked": "— Beach, food & service"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I paid everything in U.S. bills and really only bought some small gifts and left tips. Some thanks I got. I complained the next day to the Manager of this hotel who claimed the Disco was part of another Riu property.I told him, it is all Riu properties so something could/should be done about. I have not heard from this hotel or Riu at this point. Unfortunately I left that day and had no chance to confront the Disco management or staff.", "title": "Perfect holiday", "helpfulness": 8, "user": "justhutchinson", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12913458, "likes": {"liked": "— Food", "disliked": "— Rude european tourists"}}, {"rating": 4.0, "title": "Good place, great beach, food not so good", "text": "The place itself has beautiful beaches, the resort old and stale. Getting ripped off on the resort put a huge damper on the place and my opinion of the Dominican.I had been there before and also to the Mayan Riviera and Puerto Vallarta.", "helpfulness": 7, "user": "travelcouple-0", "date": "January 21, 2008", "id": 12854138}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Skip this country, go to Mexico on the eastside, the Mayan is far better. Had my money exchanging experience been better I'm sure I would give this place a better review but who goes on vacation to get ripped off ?", "title": "Maybe a 3.5 star resort, definitely not 5 star.", "helpfulness": 2, "user": "Audmod", "date": "January 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 12831202}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Jan 4-10/08", "title": "terrible room", "helpfulness": 2, "user": "BJRSask", "date": "March 9, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 14159477, "likes": {"liked": "— beach", "disliked": "— hotel room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "When we arrived at our room, our door was open which we found a little odd. BUT when you got in you knew why! It was so musty and moldy smelling it was hard to breathe. The beds were terrible, they sagged in the middle, the sheets were like sand paper, they smelled of mold, B.O. and urine. We took pictures of the mold on the beds. There was also mold on the backs of the curtains and in the shower. The drain in the sink was rusty. The shower head sprayed water every where. Taps dripped water all the time.", "title": "A piece of Heaven", "helpfulness": 4, "user": "Bludawg", "date": "March 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14145586, "likes": {"liked": "— The 5 star package for a 3 star price", "disliked": "— The vendors at the flea market 15 minutes down from the resort"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "When we arrived they should of had someone there to welcome you and show you the which restaurants you could eat at. There was hostess all dressed up in Domincan attire and she said we needed reservations to eat in the main restaurant. Went to main desk and asked they said we could eat there anytime with out reservations. The food was good that night ate and drank lots. We arrived there on Jan 4 there didn't seem to be too many vacationers there so the service was great. By Saturday night the food was all starting to taste the same, could not stomach anymore of it.", "title": "Definetely Not A 5 Star Resort!!!!!", "helpfulness": 3, "user": "Got2GoTravel", "date": "March 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 14089386, "likes": {"liked": "— Beautiful country and could use sister resort chain", "disliked": "— Food, rooms and pool"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "It seemed all the restaurants served the same food even the ones you had to make reservations for all buffet style. Some of the drinks had liquor in them and then the next drink came with no liquor it seemed you had to tip every drink.", "title": "Second Trip to Punta Cana -Riu Taino not the best!!!", "helpfulness": 8, "user": "davedr", "date": "March 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 14079700, "likes": {"liked": "— beach", "disliked": "— rooms, food selection"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "We did not appreciate the peddlars that came to the hotel to sell their goods, very pushy and snobby when you were not interested. Coming from Saskatchewan the beach was beautiful, the heat, the sun and the climate was great. It was our first beach holiday,we booked through Sunquest and complained to them about the terrible room and they were not receptive to it at all. We enjoyed our time away from home but will never stay there again. The room ruined our entire holiday.", "title": "definitely a 3 star at 5 star prices", "helpfulness": 5, "user": "OntarioJuanita", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 14011233, "likes": {"liked": "— that we could go to sister resort", "disliked": "— beds are terrible"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Ola!", "title": "From the Maritimes to Punta Cana!!", "helpfulness": 2, "user": "KevPEI", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14608116, "likes": {"liked": "— Clean, cosy, nice balcony over looking pool through trees.", "disliked": "— Distance from the Bambu beach! Sometimes activities close by made nap time hard. I like naps."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "My wife and I stayed here Mar 16-23, 2008. We loved it. The food was great. Restaurant reservations were not always easy to get, get up early to have a good chance, like 6:00am. Italian was okay but Steakhouse was awesome! In the end the buffet had more than enough to choose from, so don't worry if you miss the a la cartes. Was very windy for most of our stay, likely to do with the full moon, still warm even though, waves were great to play in, some undertoe as well, be careful, watch your kids please. I never needed long sleeves, so there you go, it's nice.", "title": "I still like the property but it needs work", "helpfulness": 1, "user": "travelcatArlington", "date": "March 28, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 14602904, "likes": {"liked": "— The Riu is a pretty property", "disliked": "— No kids program"}}, {"rating": 5.0, "title": "The Naiboa was excellent!!", "text": "As you know you have access to RIU Taino and Bambu as well, just have to go to your own buffet at night. You can also walk around the others not included, no one kicked us out. We ended up living at the Bambu a lot, but slept at Naiboa of course. Bambu is just a little more compact and things are closer together. The beach there had more shade, smaller palm trees to sit under, etc. The rest of the beach had taller palms, nice, just not as shady, and not as much of a beach stretch to the water, near Bambu you have a treed beach area, the open beach, then the water, that's ideal, perfect and nice!", "helpfulness": 1, "user": "JulesKingston_ON", "date": "March 25, 2008", "id": 14528011}, {"rating": 5.0, "title": "Our Trip Too Riu", "text": "We wished we had of booked the Bambu in the first place, but the walk each day to and from was good, though we didn't want to (our own laziness), helped with all the food we ate!! You'll be sure to put on about 5 lbs at this place in one week. Kid you not!", "helpfulness": 1, "user": "susananddale", "date": "March 22, 2008", "id": 14446943}, {"rating": 3.0, "title": "Riu Naiboa Punta Cana", "text": "All in all, our room was fine, had a problem with the shower, but they fixed it quickly, and gave us some rum for the trouble and a souvenier. So they really tried to go the extra mile here we thought. Also, if your water jug runs out in the fridge, just get more at the front desk, we did. No probs, or they will be by with it later. If you ever meet the guy in the hall filling the fridges, he'll hand over as much stuff as you want!! No probs.", "helpfulness": 1, "user": "blahblahblahcanada", "date": "March 16, 2008", "id": 14316659}, {"rating": 3.0, "stay_parameters": "Stayed July 2008", "text": "Booked through orbitz. After 1 day prices dropped 100 dollars then went up to 1200 dollars then back down....It is like the stock market.", "title": "Just Ok", "helpfulness": 5, "user": "jgsgroups", "date": "August 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 18527393}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Pre-arranged ground transportation round-trip but don't count on the trip back, it is near impossible to arrange the trip back but Ok. Since I was all the time at the beach/eating/pool/disco who has time to arrange the trip back to the airport. The area this hotel is in is great, with the right amount of people, always loungers available at the beach. The pool was for early birds but there were other two pools that always had loungers but were almost empty and boring without swim-up bars. The beer at the Riu-Taino swimup bar was very decent and extremely cold.", "title": "Si Si SI!", "helpfulness": 5, "user": "mistydawn67801", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 18347580, "likes": {"liked": "— The staff", "disliked": "— The food"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Food: Was Ok, nothing spectacular. Avoided everything that was not sizzling hot due to previous DR all inclusive illnesses. This time as I read in some websites to eat yogurts weeks before which is suppose to increase the stomach flora and increase your immunity and didn't get sick. So this is my first time I didn't get diarrhea. I don't know if it was the yogurts I eat before the trip(its supposed to be 2 weeks before) I just did it the week before or was due to the fact that only eat sizzling hot items. The pizza was very good. The rest average. Nice service at the Taino Restaurant.", "title": "Great for a Relaxing Beach Getaway", "helpfulness": 8, "user": "patrickfoster18", "date": "July 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 18206641, "likes": {"liked": "— The beachfront location", "disliked": "— Bed wasnt very comfortable"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Drinks: I had very few with Ice , so I guess the Ice is really from purified water. Didn't had the fruity stuff , just beer during the day. It is too hot to drink something else and maybe a few whiskey sodas at night. They were not watered down and never waited more than 1 minute to get a drink.", "title": "Stay Away", "helpfulness": 2, "user": "BonnieSantan", "date": "July 20, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 18080647, "likes": {"liked": "— nothing", "disliked": "— rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Disco: It is Ok and was free for the whole stay.", "title": "Just loved it.", "helpfulness": 1, "user": "vandalay1", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18070110, "likes": {"liked": "— Pretty much everything", "disliked": "— The pool, although we didn't care about it"}}, {"rating": 4.0, "title": "Another quality vacation", "text": "Just got back from a week at the Riu's in Punta Cana D.R. June 4th - 11th. My wife and I were married at the Riu Merengie in Puerto Plata a few years back and were really impressed with the resort(s) and service. We recently had an opportunity to get a great deal on a Riu in Punta Cana so we took it based on our last experience. Being to Punta Cana a few years back we knew what to expect as far as beaches and the locals were concerned. Both by the way are EXCELLENT. After reading the reviews on this and other review websites I was a little apprehensive! But the TRUTH is that these resorts are STILL a great value for the money. We have been to \"other\" name resorts and found these ones to be at least equal than or better.", "helpfulness": 13, "user": "frankp42", "date": "June 12, 2006", "id": 5335810}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I'll keep this short by saying my wife and I had an AWESOME week at the Naiboa with priviledges at the sister Taino and Bambo (with lesser ones at the Palace). Everything was as expected. They either met or exceeded expectations.", "title": "Naiboa", "helpfulness": 10, "user": "lsgw", "date": "June 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5326063}, {"rating": 4.0, "title": "Great deal for the money", "text": "I believe if you look long and hard enough you will find faults but they really are minor. Chill out and enjoy your holiday. Some people aren't happy unless they're miserable. Life is not perfect and neither are resorts. Go there with that in mind. It sure beats being at home or at work. I would go back in heart beat.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5315827}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "This is the perfect hotel if you are on a budget and don’t seem to mind staying in a simple room but with the same excellent service you would get at Taino and Bambu. If you expect a luxurious room then this is not the hotel for you. The food, service and entertainment is the same (excellent) as the other hotels but with the only disadvantage that the rooms are simpler and smaller, but cute. We literally paid $ 95 a day and you can not go wrong with that price. Where in NYC would you pay $ 95.00 a day for a hotel room including breakfast, lunch and dinner? No where in NYC . So, for the price Naiboa is a an excellent choice. And if you are not on a budget and could afford to spend extra go with Bambu or The Palace you won’t regret it. All in all the service in Naiboa was excellent, the grounds were beautiful and the people were lovely. By the way the beach is gorgeous and it is a 2 - 5 minute walk from Naiboa. Not far at all especially if you have a drink in your hand.", "title": "Details", "helpfulness": 19, "user": "ladyasya", "date": "May 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5186556}, {"rating": 4.0, "title": "Laid Back", "text": "My husband and I (both in our 30s) went to this hotel after finding a great deal online ($99/room, all inclusive). We stayed for 5 days. We found it to be clean (a little smelly from the cleaning detergents though) and the hotel was very responsive to our needs. The first room they gave us had an air conditioner that wasn't working properly so they gave us a new room a few minutes later, which was wonderful. We had an awesome view. Also, they gave us a little present for the inconvenience. What I was most impressed with was the cleanliness of every area of the hotel. The beach was also very lovely. Everyday while we were there, we were able to swim with some fish who were close to shore. So definitely bring your googles and snorkels!! I also liked that there was a snack bar within walking distance to the beach. You could get a drink and food and bring it right back to the beach! The people at the resort were very friendly...from the tourists (whom we met alot of!) to the workers. The animation team/entertainers...while, sometimes it felt a bit like spring break...made the trip really quite fun. They worked really hard and really tried to involve all of the guests (my husband got picked 3 times to go do something on stage). The food was excellent...different food every night. Didn't get sick. I would definitely recommend this place for fun and relaxation. The only thing to remember though is...do not use the phone. Unless you buy a phone card from the front desk for $20. They charged us $40 for about 8 minutes worth.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 19, 2006", "id": 5182120}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My boyfriend and I stayed at the Riu Taino in June 2007 for 2 weeks, and it was amazing!! I am 20 and my boyfriend 19. We booked our holiday through Thomson's. The flight went smoothly and the 8 and a half hours flew by thanks to all the entertainment we had on board. There was plenty of leg room and there was a good selection of films, games, and tv programmes to watch.", "title": "Book the Riu Taino NOW!!", "helpfulness": 7, "user": "Buckinghamshire777", "date": "February 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13615889, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Airport:", "title": "Loved the Taino - AGAIN", "helpfulness": 9, "user": "LoveTheTaino", "date": "February 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13510748, "likes": {"liked": "— Fabulous beach, friendly staff", "disliked": "— Small beds!"}}, {"rating": 1.0, "title": "hated the riu", "text": "Pretty much as soon as the plane had touched down, we knew we were going to have a great holiday. You are greeted at the airport with 2 women dressed up in tradditional clothing and your group get a photo taken with them which you then get a chance to buy at the airport when you are leaving to go home (Not many people brought them though as after a 9 hour flight, people dont look their best) It was scorching hot! I would recommend to take a bottle of sun lotion in your hand luggage because just from the walk over to our coach from the airport, i got sunburnt, and it was only a 100metre walk, if that, and i am someone with olive skin who dosent burn that much!! Not complaining about it though, we came for the sun and it didnt let us down. Dont give in to the people that take your luggage, they do just go for your suitcase without asking, and you think that its for free to take them over to your coach but its not, they wouldnt let go of them until you gave them some money.", "helpfulness": 2, "user": "riuhater", "date": "February 11, 2008", "id": 13461922}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Check In:", "title": "loved the riu taino", "helpfulness": 8, "user": "sippi215", "date": "February 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 13365231, "likes": {"liked": "— fun and friendly staff", "disliked": "— twin beds"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I cant understand why anyone can moan about this hotel???? They must be very fussy people. Me and my boyfriend went on holiday open minded and wanting to have a great time...and we were not let down! As soon as we arrived at the hotel we were wisked to the check in at reception, and it took literally 2mins to get our room key and then a member of staff took our luggage and showed us to our room. It was all done so quickly and efficiently that we had a good few hours of sunshine left and just chucked our suitcases in, grabbed our beach ware and was straight to the beach!", "title": "you get what you pay for!", "helpfulness": 4, "user": "beachbumsAncaster", "date": "February 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 13237020, "likes": {"liked": "— Beach, Food", "disliked": "— Rooms"}}, {"rating": 2.0, "title": "Beautiful beach, great location, food & service disappointing big time", "text": "From a CT couple, mid 50's--The air service fr philadelphia & connections to & from hotel were excellent. The room was ready at 10:30 am even tho we were warned that rooms might not be available until 3:00pm.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 4, 2006", "id": 5033816}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "This was our second visit to DR, (first to La Romana) two years ago.", "title": "Very Relaxing Week", "helpfulness": 7, "user": "Griffin2", "date": "May 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 5032046}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "The setting for the Riu complex is well-planned and very scenic.", "title": "Disapointed with Riu", "helpfulness": 8, "user": "gknepp", "date": "May 2, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 5027578}, {"rating": 4.0, "title": "Good times at the Riu!", "text": "Here are the difficulties we encountered.", "helpfulness": 11, "user": "hotnest", "date": "May 1, 2006", "id": 5025493}, {"rating": 4.0, "title": "Had a very relaxing holiday", "text": "We were told by our travel agent that we would have full use of two other Riu hotels, for facilities and all meals, the Bambu & Taino. The Apple rep on the bus on the way fr the airport to the hotel told us we could use all hotels except the Palace Macao.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "April 29, 2006", "id": 5017994}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "We have just returned from 2 weeks at the Riu Naiboa, we had a great time. All the staff were friendly polite and very helpful especialy Fabio Mota (Cohiba) and Alexander (Bolero), entertainment team fab special mention for Salami,La Foca and Mandela. As week as eating in our hotel we also ate at the italian twice and the Macao steak house (just book at breakfast for the same evening). We really enjoyed our stay and will definatley use the Rui Naiboa again.", "title": "Fab Time At The Rui Naiboa", "helpfulness": 5, "user": "jamesclan", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 10084517, "likes": {"liked": "— Clean tidy", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Thankyou to everyone who helped to make our holiday one to remember.", "title": "Hot, Hot , Hot!!!", "helpfulness": 18, "user": "Angela_Aaron", "date": "October 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10078879, "likes": {"liked": "— Beach, sun."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "XXXX", "title": "Good Value", "helpfulness": 4, "user": "mmcmill924", "date": "September 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 10018459, "likes": {"liked": "— pool/beach activities", "disliked": "— Room"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "My boyfriend and I stayed at the Riu Taino in February. Punta cana is very hot and beautiful this time of year. We arrived at the Punta Cana airport and were impressed with how beautiful the airport was. They take your picture when you walk into the airport and you can purchase them when your plane departs at the end of your vacation.", "title": "Great Time at the Taino", "helpfulness": 13, "user": "firstimer69", "date": "September 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 8840352, "likes": {"liked": "— Close walk to the Dining area and pool.", "disliked": "— Weak A/C"}}, {"rating": 2.0, "title": "OK hotel, not 5 stars", "text": "There is not much to see on the way to the hotel and you can't walk off the resort like on other islands but the Riu complex is so large that you don't need too. The 5 Riu hotels are all beside each other so it very large but nicely spaced out, and there is a street that you can buy things from. I thought that the Taino had the best location to the shops, beach, and was very treed. It was so hot while we were there and there was barely a breeze on the beach and absolutly no breeze walking around the grounds because the growth and trees blocked it all. We love the heat so we didn't mind it. The rooms have excellent airconditioning and the shower pressure is great.", "helpfulness": 4, "user": "CharlizeMontreal", "date": "September 13, 2007", "id": 8707340}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "i loved it there, i cried becasue i didnt want to come home the animation team were amazing especialy Mandela , eric and eddie murphy (miss u all so much!!!). but i ma only 16 so but it was brilliant for me!!! best time of my life!!", "title": "the best time of my life", "user": "mcflybabe91", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8524928, "likes": {"liked": "— mandela", "disliked": "— leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Just returned from 3 nights at the Riu Taino. We were down for a small family wedding. As a result we saw different kinds of rooms. All were clean and had hot water. In some rooms plumbing screamed. Other rooms were close to the \"Caribbean street\" and had to deal with loud music and crowd noise in the evenings until around 11:30PM. Our room was closer to the beach and quiet. Maid service was excellent. We were on the 2nd floor of a building and our AC was not super effective in the hot and humid summer weather but we had a ceiling fan and that helped.", "title": "Nice enough....... just not my thing", "helpfulness": 6, "user": "Lina", "date": "August 13, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8407676, "likes": {"liked": "— The geographic location", "disliked": "— The crowds"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Most of the other guests were European and we heard French, German and Spanish principally.", "title": "Never again", "helpfulness": 1, "user": "CatPortugal", "date": "August 13, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 8406571, "likes": {"liked": "— Beach", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The property is well maintained and has an abundance of palms, tended flowers and grassy patches. We saw some peacocks wandering around. The beach is exquisite, very fine white sand, The sea warm and benign. Every morning I walked from 6:30 - 8AM and witnessed super efficient \"beach cleaners\" raking up seaweed from the tide and putting it in huge black plastic garbage bags. It was a very beautiful and peaceful time of day. The major pool scared me. People stayed in there longer than bladder control might extend. Heavy chlorine clouded it every night but I didn't feel like jumping in the next day and drinking at the in-pool bar!", "title": "Total Relaxation and Fun", "helpfulness": 6, "user": "sunloverNyc", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8395430, "likes": {"liked": "— The resort was very clean", "disliked": "— Restaurants were very warm"}}, {"rating": 2.0, "title": "Punta Cana Riu Not What you think", "text": "The food is fine if not particularly good. Breakfast was my favourite meal. Lots of fresh fruit, many varieties of eggs, deli meats, croissants, breads and freshly squeezed juices. Lunch and dinner served burgers, pasta, fries, rice, beans, chicken in various guises and always, a few kinds of pizza. Not inspiring but okay. Beer was cold and satisfying. Wine in casks was essentially not potable. Very inferior. Other booze not my thing when generic and served with sweet who knows what! Others seemed to be enjoying it plenty and plentifully!", "helpfulness": 3, "user": "lizzyswker", "date": "July 31, 2007", "id": 8268604}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My husband and I went November 22-26, 2007 for our anniversary. It was a great experience. As others have said, you get what you pay for. But hey, where else can you go that allows you to use the other ammenities and is all inclusive for $93.00/night? You have 2 other hotels that you can access. The Bambu was the best. The food was great there, the people were extremey nice there. The Tainu was great too. We had dinner at all three hotels. The Bambu has open seating from 6:30-10. You just cannot sit at the tables with the wine (they are reserved). They have a great show at night. If you play games during the day and you win, they have a show at night where they give you a certificate and a prize of some sort. The Naiboa had lots of activities throughout the day. My only problem was the language barrier. They claim they speak english, but very little. The other hotels have better english skills. It was a great hotel. Yes, I had to borrow a blow dryer and iron, but if you have a 2 prong 110 volt item, it will work there. The moldy smell that other people were talking about is the water! It has a distinctive smell which one would think it was mold. The rooms were quaint. But like I said, you get what you pay for. Bedding could be improved, but it was just a place to rest my eyes for the night! They have a nice street fair kinda...there are lots of shops up and down that take you to the beach and then onto the other hotels. They are very friendly and overall it was a great experience!", "title": "Had a great time!", "helpfulness": 13, "user": "JNPK", "date": "November 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 11167318, "likes": {"liked": "— The ease and use of all the other hotels"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "My boyfriend and I stayed at the Riu Naiboa for 7 nights/8 days last December (I know I'm not exactly prompt in my review). My best advice for anyone traveling to this resort is to realize that you are getting what you paid for. We spent around $700 each for our entire vacation (flight, transportation to and from the airport, and the hotel stay which is all-inclusive). You really CANNOT beat that price! It seems that most people who complain about this resort are expecting WAY too much for a small amount of money. If you want a 5-star resort, you have to pay 5-star prices.", "title": "Great value", "helpfulness": 18, "user": "DrARF9", "date": "November 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11110983, "likes": {"liked": "— Beach, pool, weather, atmosphere, just about everything!", "disliked": "— Leaving"}}, {"rating": 2.0, "title": "beach was great", "text": "Personally, I didn't mind the bus ride to the resort from the airport at all, even though it took about an hour. We were put into a van with 2 other couples on the way to the resort and it was interesting to see the towns and people of the Dominican Republic on our way to the resort. On our way back to the airport, we were put in a small bus. It wasn't a big deal and I would rather stay an hour away from the airport than see planes flying in while I'm laying out on the beach. I can deal with an hour-long ride if it means a little solitude.", "helpfulness": 4, "user": "bobdobalina9999", "date": "November 24, 2007", "id": 11033053}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "That being said, our initial room was a standard hotel room with 2 full (or queen?) sized beds and a working bathroom. It wasn't the most gorgeous room I've ever stayed in, but it certainly wasn't uninhabitable. Our refrigerator was stocked daily, our room was cleaned daily, and fresh towels were given to us daily. On our third (or so) day there, our air conditioner broke. We went up to the front desk and requested a new room and they put us in a new room with no questions asked. We went up to the second room and didn't like it, so we went down to the front desk again and AGAIN they put us in a new room with no questions asked. The people at the front desk were extremely nice and accommodating and we didn't encounter one problem the entire time we were there. The third room we were put in had a king-sized bed and fantastic air-conditioning. Again, the refrigerator was stocked every day, the room was cleaned every day, and the towels were replaced every day. If we did happen to need extra towels for one reason or another, a simple phone call to the front desk did the trick.", "title": "4 star Debatable", "helpfulness": 7, "user": "Debra M", "date": "November 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 1.0, "location": 1.0}, "id": 10576540, "likes": {"liked": "— closeness to beach", "disliked": "— tatty"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I know that a lot of people tend to complain about the food. While this was not the best food I've ever had, we never went hungry. In fact, I think we ate 6 to 7 times PER DAY EVERY DAY. That makes me feel guilty just thinking about it. The main buffet had a large selection of food to choose from and although the food was a little more bland than I like, I always found something to eat. My boyfriend absolutely loved the smoked salmon (grav lox-type salmon) they have for the breakfast buffet every day. I think he ate about 20 pounds of that stuff during the week we were there. He cleaned them out every morning. Other than that, they always had a wide variety of foods for all of the buffets in the main hall. There is a smaller buffet by the main pool and another smaller buffet near the beach as well. Those buffets did not offer as great of a selection as the main buffet, but they were great for a snack while swimming at the pool or while on the beach. There are also a few \"specialty\" restaurants on the grounds. They were both good, but not extremely memorable (meaning no great memories and no horrible memories). I guess I like buffets for the selection!", "title": "Great Resort poor hotel", "helpfulness": 3, "user": "Smokers", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 10310553, "likes": {"liked": "— night life", "disliked": "— tired hotel needs refit"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My wife and i just returned from 7 days at the Riu Taino and had a Great time! We dont have any complaints and will defiently go back again!!", "title": "Cant Wait to go back to TAINO!!", "helpfulness": 3, "user": "Adanac00", "date": "February 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 13783849, "likes": {"liked": "— Bugalow Style rooms are nice not like a hotel"}}, {"rating": 5.0, "title": "Loved the Taino", "text": "We arived at aprox 20:30 so it was dark and there was a Street party that they have every thrusday going on out side our hotel so we had to be droped off at the Riu Naiboa. We were then walked to the Taino with Hotel employees bringing our bags. Check in was Fast only 2 mins and we were taken to our Bungalow!", "helpfulness": 2, "user": "charlie071", "date": "February 22, 2008", "id": 13763298}, {"rating": 4.0, "title": "Just returned from Dominican republic", "text": "One point the rooms at the Taino have a Main power Switch as soon as you come in the door it is on the Right side it turns off all power to the room lights, tv, clock everything. (caught us off gaurd walked back and was told how to turn it on) Room was decent not amazing but suits the purpose. Tv worked and even had a few English Channels!", "helpfulness": 2, "user": "Mistyontario", "date": "February 20, 2008", "id": 13701601}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Beach was Amazing nice blue water! warm and very enjoyable! Always found 2 chairs to sit on even after an excursion getting back at 13:00 there were still chairs! Pool was Nice and pool bar was good! A little harder to get chairs at the pool usaly by 8:30 they were all reserved (good old towel game)", "title": "A Great Vacation!", "helpfulness": 6, "user": "sunl0ver16", "date": "February 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 13663427, "likes": {"liked": "— friendly staff", "disliked": "— only 1 room key (obviously very minor detail!)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Staff were Fantasitc and very very friendly Wilken in the main buffet was great and always helpfull! Buffet were good never had a problem finding somthing to eat we are not pickey eaters but there should never be a problem finding food!! We ate at 2 of the dinners we ate at the Mexican wich was GREAT, food was fresh tastey and HOT! the second one we tried was the Steak house.. Out of my 7 days there this was my only complaint with the hole trip!! the prepared dinner here was just plain BAD all of it the steaks were really bad i had chicken that wasnt cooked the vegies were either WAY passed cooked or just bad!! i would not let this ruin my night so we just went to the buffet and filled up on Great food!", "title": "Fabulous Vacation", "helpfulness": 6, "user": "wandaIowa", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 13652043, "likes": {"liked": "— OUR FABULOUS OCEAN VIEW ROOM which we got switched to per our request one day after we arrived.", "disliked": "— I liked the entertainment at the Bambu much better"}}, {"rating": 2.0, "title": "Horrible service", "text": "We stayed at Riu Naiboa April 2006, four of us went. All in all the trip was just okay. The service of the Hotel wasn't at all anything special; there were no towels in the rooms, the wake up calls were off by an hour each time, the plug in the bathroom didn't work so I couldn't blow dry my hair, there were no clocks in the room so if you didn't bring a watch you didn't know what time it was. 3 out of four of us were sick on a couple of the days.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 28, 2006", "id": 5015493}, {"rating": 2.0, "title": "Not a five star", "text": "Not to mention we were given the total run around trying to book the steakhouse resturant at night which we never got into . The food, very average. The shows were good but not long enough, not much to do after that. The only good about the resort was the beach", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 27, 2006", "id": 5014698}, {"rating": 2.0, "title": "not so great", "text": "First off, I want to say I enjoyed a week in paradise, regardless of the hotel I stayed at.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 26, 2006", "id": 5010972}, {"rating": 5.0, "title": "The Riu Naiboa is fantastic ignore those bad reviews!!", "text": "Upon arival in D.R. we were greeted with smiles and \"Hola\" from everyone there. What a change from home, where often you can bearly get a grunt out of people.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 4999015}, {"rating": 2.0, "title": "Not For Younger Crowds", "text": "When we arrived at the Riu Taino, we were greeted by a very friendly \"ROSIE\" who spoke very good Eng.( and probably one of the only ones to speak Eng.) We were briefed on the \"schedules\" at Riu....yes schedules. I thought I left my appointment book at home, but I guess I should have brought it. Since our arrival was around 7pm we were informed that our supper reservations would be the late sitting each night(btwn 8:30-10:00), and if we wanted to change to the earlier sitting we would have to speak to the matrede in the morning, to SEE if he could accomodate us. . Breakfast was very good, staff were always happy and singing, that was nice to see. Our rooms were very clean, but nothing fancy. The fridge in the room was supposed to be restocked every 2 days, but that didn't happen. It was empty for most of the week. One evening we called the front desk to ask for some pop, and we were told we had to go to the desk and ask for a particular person. When I'm in my p.j.'s I don't want to start traipsing around the resort.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 4998711}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Just returned from our stay at the RIU TIANO May 8-12. A quick rundown the food is OK tends to be the same stuff for lunch Hamburg, Chicken, Hot Dogs and Fish with a salad bar. Dinner had a little more variety and some theme nights we had a Mexican and Barbeque nights. A couple of problems I had with dinner was the men had to wear long pants and a sleeved shirt while the women did not have a dress code and the first night you are there you pick a time either 6:30 or 8:30 and that was your set time for dinner the whole trip. Breakfast was good you usual stuff they do make fresh omletes while you wait.", "title": "OK Place ", "helpfulness": 12, "user": "takerstcld", "date": "May 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5066502}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The staff is very friendly though it would be helpful if more of them spoke English. I realize that we were in another country but you would figure the staff would be able to speak more then just Spanish. They seemed to speek better Spanish, French, German and other European languages then English. They do try to keep things going with plenty of activites during the day Volleyball, Water Polo, Areobics in and out of the water and other things.", "title": "Great vacation for the price", "helpfulness": 9, "user": "Rubyjuly", "date": "May 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5061125}, {"rating": 2.0, "title": "Keep your balcony door locked", "text": "The Shows are not that impressive not really worth going to see you are better off just sitting at the outdoor bar and relaxing having drinks.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "May 9, 2006", "id": 5044700}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The rooms as have been stated in other reviews are outdated but if you don't spend your day in them how cares. They beds and pillows leave a lot to be desired not comfortable at all made for some rough sleeping not what you want on a vacation. On one day the hot water did not work for a few hours and then the cold water did not work for a few hours which made it interesting since you need cold water to flush a toilet. A good part of the room is there is a hard alcohol dispenser in the room with Gin, Rum, Vodka and Brandy the AC work fine for us kept the room nice and cozy.", "title": "Awesome", "helpfulness": 15, "user": "Barbara B", "date": "May 9, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5044038}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Be carefull of what you eat we both ended up getting sick from something for a better part of a day.", "title": "This is the place to relax...", "helpfulness": 17, "user": "mrowe702003", "date": "May 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5036556}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "As an experienced Riu Resorts guest (I have stayed at ALL of the Riu's in Mexico), I can give you an unbiased fair review of this property. First, you should note that this property is part of a true \"Riu complex\" (ALL of the 5 properties are conected and even \"common area/", "title": "The good, bad, ugly...GREAT RIU COMPLEX...but this hotel is poor...", "helpfulness": 12, "user": "MexResorts", "date": "September 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 19604679, "likes": {"liked": "— The price and location.", "disliked": "— Staff, service, complete lack of professionalism."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "streets\" belong to Riu). The \"complex\" is wonderful/awesume!!! Now back to Naiboa, I booked this hotel (out of the 5 choices) for one reason...to save some $$$. It is the least expensive and you get what you pay for...no beach...boring pool...worst bars, worst staff, etc. The front desk personnel are without a doubt the worst at any Riu property that I have ever stayed at, ditto for restaurant and bar personnel. So did I have a horrible stay? NO! Actually, I had the BEST Riu vacation EVER!!! How? I used the greatest beach that I have ever seen and the best RIU bars at the RIU BAMBU, the best pool at RIU TIANO and the overall great ambiance of the Riu Macao and Riu Punta Cana. Now my recommendation, I would book the Riu Tiano, only a few $$", "title": "Nice holiday but wouldn'y hurry back", "helpfulness": 1, "user": "Reedy08", "date": "August 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19336390, "likes": {"liked": "— cleanliness", "disliked": "— entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "$ more than Naiboa, and spend most of the day at the Riu Bambu for the beach and bars or the Riu Tiano for the pool.", "title": "Awsome Beach!!", "helpfulness": 1, "user": "Nateich", "date": "August 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 19253982, "likes": {"liked": "— beach", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Again, best Riu vacation ever, unreal beaches, palm trees, ocean, etc., just avoid Naiboa.", "title": "Great Time!!", "helpfulness": 2, "user": "niki74", "date": "August 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 18894741, "likes": {"liked": "— Great view, powerful shower.", "disliked": "— The bed, single bed too small and hard."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Riu Naiboa is a clean hotel with friendly staff.", "title": "It's not what they make it out to be.", "helpfulness": 3, "user": "Hot_scorpio", "date": "August 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 18617943, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 5.0, "title": "RIU TAINO IS THE BEST", "text": "I just don't get it , people go on vacation, but don't know how to relax. they go to a different country that has different culture, food,language and senery, and they think everything should be the same as back home. my advice, stay at home. this is our forth time to the Riu Taino, an love every minute of it. the food is excellent, rooms are nice, they do smell a little musty, but not bad. this is due to the hot climate outside and the air conditioners running at full tilt inside. the staff that work there is second to none. the nicest people in the world. i don't know how they do it, but they remember us every time we go there. the shows at night are great also. i also heard they are planning to redo it, i hope they don't turn it into a place like the palaces, where all the snooty people go. that would be a real shame.", "helpfulness": 13, "user": "lcgreen3", "date": "December 19, 2007", "id": 11678549}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Ola...", "title": "Great Place, Great Food, Great People", "helpfulness": 13, "user": "Jt_money", "date": "December 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11641388, "likes": {"liked": "— The Staff and the Beach"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We just got back a week ago and we still can't stop talking about it. Riu Naiboa Staff was amazing; they were always there to help. When we checked in, we were not too happy with our view, the next day we got Pool Side view.", "title": "Not a five star", "helpfulness": 8, "user": "stewKingston_Ontario", "date": "December 17, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 1.0}, "id": 11631677, "likes": {"liked": "— the beach", "disliked": "— the people who worked there"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The food was pretty good, the Mexican night was really well done. Our waiter was off the hook. Every night at dinner he would bring us 4 beers and at the end of the meal bring us 4 espressos and we only asked him the first night to do this, but he made sure we had them every night.", "title": "Claims to be a 5 Star Hotel--False Advertising", "helpfulness": 8, "user": "Lillabet54", "date": "December 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 11511958, "likes": {"liked": "— not a thing", "disliked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "Entertainment...all I have to say La Roca is the man. Make sure to check out the Michael Jackson show...", "title": "Dont stall just book it............", "helpfulness": 12, "user": "Naiboa", "date": "December 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 11405526, "likes": {"liked": "— The staff", "disliked": "— Having to go home"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "There are five hotels on the Riu property in Punta Cana: Riu Bambu, Riu Naiboa, Riu Tiano, Riu Palace Macao, and Riu Palace Punta Cana. When staying at Naiboa--the least expensive of the bunch--guests have access to the pools and lunchtime bars of Naiboa, Tiano, and Bambu.", "title": "Great for the easy-to-please, thrifty traveler", "helpfulness": 3, "user": "Cheers826", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 16970711}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Naiboa is the only hotel of the five without beachfront property. I suppose this is why it's more affordable, but don't let the lack of beachfront scare you away--Naiboa is located just behind Tiano so it's only about a five minute walk to the beach down \"Caribbean Street,\" a resort-run strip with local-looking shops and services. The Tiano/Naiboa fitness center is on Caribbean Street as are gift shops, a men's clothing store, a cigar kiosk, a spa, and an arcade. Truth be told, some of Tiano's bungalows were so far back on the Tiano property that they were the same distance from the beach as the Naiboa, so if you're trying to choose between the two based solely on beach access, take that into account.", "title": "A Moldy Musky Mess", "helpfulness": 1, "user": "summerbreeze08", "date": "June 13, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 16897308, "likes": {"liked": "— I like Punta Cana because it is a beautiful place and the people who worked for the resort were wonderful", "disliked": "— The first hotel I stayed in (RIU Naiboa)"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Our room was fine, but we definitely got what we paid for. If anything, the accommodations seemed a little dated (though we heard from an employee that renovations are scheduled for the next year or so) but no so much so that we felt uncomfortable. In any case, we were hardly ever in our room and when we were, the Riu's in-room liquor dispensers made it seem like the best place I'd ever been.", "title": "The worst experience in a hotel", "helpfulness": 1, "user": "NewJerseyItravelalot", "date": "June 11, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 16855380, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Food was fantastic--there was a pretty wide spread nightly and at lunch we could choose between our main dining room, any of the pool bars at Naiboa, Tiano, or Bambu, and a beach front pizzeria on Caribbean Street. Service at every meal was great, too, and everyone was so pleasant. Men: be sure to pack pants for dinner. We were a bit taken aback/annoyed that jeans and even mesh exercise pants were acceptable but that my boyfriend was asked to change out of his nice khaki shorts and into pants the first night.", "title": "Great Time at Riu Taino", "helpfulness": 8, "user": "rdc6060", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16654917, "likes": {"liked": "— Nothing", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Poolside entertainment at the Naiboa was great--our four-person crew kept us busy all day with horseshoes, water polo, bocce, dance lessons, \"crazy games,\" water aerobics, etc. At night, the shows were less impressive and pretty amateur but were amusing nonetheless.", "title": "Lovley Trip", "helpfulness": 1, "user": "Treasure30", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 16642662, "likes": {"liked": "— The staff and service", "disliked": "— The food"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband & I just got back from a wonderful vacation in Punta Cana. We stayed at the Riu Naiboa, but honestly spent most of our time at the Riu Taino or Riu Bambu pool and grounds. The Naiboa is a great place to stay for the price, but it's a little further away from all of the festivities...which isn't necessarily a bad thing if you want to get away from it all.", "title": "Just as GREAT the second time around!", "helpfulness": 1, "user": "ItsMillerTime24_7", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "location": 3.0}, "id": 15013722, "likes": {"liked": "— The beautiful beaches and privacy", "disliked": "— The rooms -- need to be repaired & updated"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Rooms: Rooms are average at best. Very small, and the bathrooms need some serious work. We spoke to the reception person and asked to be moved to a comparable room. Surprisingly, we were offered an upgraded room (suite) which was VERY nice. The service and staff at the Riu Naiboa couldn't be any better. They absolutely bend over backwards to make sure you enjoy your stay and have everything you need.", "title": "great time", "helpfulness": 9, "user": "laryco", "date": "April 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14924537, "likes": {"liked": "— the beach", "disliked": "— the ride to and from the airport"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The absolute best part about the RIU hotels are their beaches...they are perfect! Soft white sand, crystal blue water, and not too crowded, with plenty of lounge chairs to go around. A word of caution to the prudish: the majority of vacationers in Punta Cana are European, so expect to see many topless women. It's not a big deal. Get over it, Americans! Relax and enjoy yourself!!", "title": "Riu Taino good value", "helpfulness": 7, "user": "PT_King", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 14638210, "likes": {"liked": "— Friendly staff and relaxed atmosphere", "disliked": "— Uncomfortable, old beds"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Food is average...we had plenty to eat, but don't expect spectacular flavor...the food tended to get over-cooked sitting under the heat lamps on the buffet. Veggies & fruit are exceptionally fresh and delicious. Drinks were OK...the only complaint here is that the beer was often served a little too warm for my taste, and the ice in the dacquiries was non-existent at times so it was like drinking syrup. I'd recommend sticking to rum & cokes or other mixed drinks with ice. Oh yeah...and the Mama Juana...stay away! It will send you over the edge in a heartbeat!", "title": "Great Trip!", "helpfulness": 2, "user": "catbluehockey", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 14618840, "likes": {"liked": "— Food", "disliked": "— Distance from beach"}}, {"rating": 4.0, "title": "I hate snow..", "text": "This was our second trip to the Riu Naiboa in PC, and we were actually a little nervous going back...we had such a great experience the first time, we were scared that we were going to get 'let down' the second time around. Absolutely did not happen!", "helpfulness": 1, "user": "micojoia", "date": "March 28, 2008", "id": 14617137}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "We were thoroughly empressed with the Riu Taino! We went for a 2 week stay and were not disappointed! The airport was a bit confusing as far as not really knowing how to find our bus to take us to the resort. We sort of had to wander around with all of our luggage in a maze full of buses of various sizes in the airport parking lot. This was a bit frustrating but we finally managed to find the right one to take us to the hotel. The Riu was a 30 minute bus ride away. Once there the check in went very smoothly and we were even able to move to a room closer to our friends without a problem. The rooms were clean and more than sufficient. I'm not sure how much time people spend in rooms, but having a balcony a clean bathroom, a comfortable bed and airconditioning made this room wonderful. We enjoyed 2 weeks of sunshine and hot weather. The beach is breathtaking with soft white sand and extraordinary blue clear water. We spent most of our days laying on the beach chairs by the water and it was never a problem to get chairs. There were reefs close by that made for fun snorkeling--all kinds of neat fish that would come eat banana right out of your hand. The water is very clear so even if you don't have a mask (which you can also borrow from your resort) you can see the fish come up to the surface of the water for food. We took a catamaran out a few times and that was alot of fun. They are very easy to sail and don't take much skill. If you're nervous you can take a lesson for $25 but it was very easy to get the hang of so save your money and just give it a shot. You can use the catamarans, snorkeling equipment, windsurfers, paddle boats and kayakes for free. You just have to go up and book them (1 hour time slots) with the people at one of the booths. There were a bunch of beach vendors that were set up down the beach from our resort and we took many trips down the beach to do some shopping. Of course they insist they are giving you the very best price while all along quoting a price that is often 4 times higher than what you actually should pay. Haggling is the name of the game! There are lots of paintings, jewellery, sarongs, t-shirts, and wood carvings. We only did one excersion and that was the catamaran trip to Saona Island. This trip took us on an hour and a half bus ride to and from the pick up location. That part was exhausting. I didn't like spending 3 hours on a bus--even though it was air conditioned. The catamaran trip out to the island was really fun with music, dancing and lots of rum. Once we got to the island, it was rather disappointing. Although it is beautiful, it was no more beautiful than our own beach at the resort. It was apparently a little windy that day so it wasn't calm which is its claim to fame. Then we stopped at a \"natural pool\" on the way back in the motor boats, but really it was just an area of the ocean that didn't have waves. Boring! We did find one star fish there though. The a la carte restaurants were good and there was no limit as to how many times we ate at them which was probably 10 out of 13 nights. Our favourite was the Mexican restaurant where they made you fresh quesadillas. The steak house was good too and a bit of a surprise to have good steak while in the Dominican. The food at the buffets were more than adequate with lots of selection. I personally loved the fresh fruit smoothies blended every morning! I worked out in the gym and they had free weights as well as treadmills, steppers, and bikes. No airconditioning there only a few slow moving fans. But hey, it made me feel like I was really working hard with all the sweat pouring off of me! There is a street right next to the hotel called Caribe Street where there are all kinds of shops including clothing stores,painting store, a drug store, a confectionary (chips $5, chocolate bars $3), bathing suit store, stores with blow kids toys and air mattresses. Many of the tourists came from Europe with very few from the States and about 20% from Canada. Many of the staff could speak some english or at least enough to communicate with one another. The bartenders at the La Bamba bar were exceptional and we made some good friends! The Domincans really love their sugar and the majority of their drinks were quite sweet which got a bit much after a few days there. Also, they only had Pepsi and being Coke fans, that was a little disappointing. We booked through Sunquest and they had a Sunquest rep there to help us with anything we needed. When it was time to go the airport to leave, we were supposed to check the Sunquest binder to see if our plane was on time and when we did, it said that the plane was on time so we went to the airport. We ended up waiting there an extra 3 hours for our plane which was really frustrating because those were 3 hours we could have hung on the beach instead of at an airport. All in all we would definitely go back to this resort and to this country. We would also book with Riu again in other countries as this resort met all of our expectations! If you are looking for a clean, safe, fun, beautiful resort that isn't stuffy or too upscale this is definitely the place for you. Regular people enjoying a great vacation!!", "title": "Enjoyed the Riu Taino", "helpfulness": 5, "user": "ESCAPEWINTER2008", "date": "February 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13918636, "likes": {"liked": "— THE BEACH", "disliked": "— PEPSI NOT COKE"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My boyfriend and I just came back from Riu Naiboa a couple of days ago. First off both of us are not huge on resorts in general and i've never stayed in one where you have to stay on site because there's nothing else really outside of it and it's discouraged by most. So 3 days is all I can handle of just lying in a beach or pool and eating at the same places. That being said the beaches are gorgeous and clean, and the weather was beautiful. The rooms are a bit dated but very clean and comfortable enough for us. Were really easy to please and don't spend much time in them anyway.", "title": "Not going back...", "helpfulness": 1, "user": "pitatravel", "date": "February 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 13907982, "likes": {"liked": "— The beach", "disliked": "— The food, some rude staff members"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Beach-I thought the walk to the beach was fine I know that it seemed like a problem to some but coming from nyc where you walk everywhere a nice leisurely 5 minutes stroll to the beach didn't bother us a bit. I was a little disappointed with the gym, there was no air conditioning and not much equipment so we decided to just walk the beach every morning and afternoon for an hour or more-my favorite part by far its so relaxing and the beach was never that crowded, and always teeming with activities for everyone, so if you're into watersports it's worth it because it's all included. We even saw a whale one afternoon coming up for air (just saw the huge fin) so that was really cool, it was about a 30 minute walk from the resort. One thing that stood out was all the Europeans in their [--](speedos), also many topless women. I'm not a prude so I got used to it very quickly and i'm sure my boyfriend didn't mind some of the women but consider this if you have young children I guess. I saw some American families and they seemed uncomfortable-I felt bad for them. The pool had just as many topless women as the beach so I don't know if they have an area that doesn't have any of this.", "title": "Very Nice", "helpfulness": 3, "user": "mailroom2008", "date": "February 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 13835220}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Food-Very disappointed in the food selection. They tend to cater more to the European crowd and barely had any latin food which you would expect being in a Latin country! Just rice and beans and everything else was very blah. You don't necessarily have to dress up for dinner but no shorts for men or tank tops for either men & women. They did turn away many men for wearing shorts. I disagree with this, it's a regular buffet & they need to get over it and let people be comfortable. I understand for the \"nicer\" restaurants but not for this. Breakfast was no better, the smoothies were delicious though.", "title": "Nice Trip", "helpfulness": 1, "user": "davrule4", "date": "February 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 13805151}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The selection of food was a bit better during lunch hours. That's where we really filled up. I can't talk much about drinks because we barely drink. I had a couple of pina coladas which were good, the mojito was crap and was the rum and coke my boyfriend barely drank.", "title": "Great family vacation!", "helpfulness": 2, "user": "naturewoman", "date": "February 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13786661}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I have just come back from this hotel i went 30th june for 2 weeks with my mum and my dad the hotel was not one of the best out of the 5 hotels but it was still good, the reception staff were nice and the entertainment staff were really good too.", "title": "it was great!", "helpfulness": 3, "user": "gemmacauser14", "date": "July 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 17940651, "likes": {"liked": "— the beach and pool!", "disliked": "— the rooms"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "the air conditioning in our room didnt work but they reception staff helped and let us move to a room where it did work.", "title": "Spend the money on another resort", "helpfulness": 1, "user": "ciacovelli", "date": "July 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 17819343, "likes": {"liked": "— leaving", "disliked": "— the fleas in the room and the maids stealing everything"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "breakfast dinner and lunch was really good there was a wide selection of foods for everyones appitite.", "title": "Loved it!!!!", "user": "blndgxrgirl", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17675717, "likes": {"liked": "— The views", "disliked": "— No complaints here"}}, {"rating": 5.0, "title": "paradise", "text": "The beach was amazing white sand and clear sea, and the pool was also one of the best out of the hotels as it was bigger.", "user": "Tisof", "date": "June 29, 2008", "id": 17349815}, {"rating": 4.0, "title": "Would go back in a heartbeat", "text": "we flew with thomson from manchester and the flight was very good especially with the t.vs infront of you.", "helpfulness": 7, "user": "maboscel", "date": "June 29, 2008", "id": 17347813}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 218, "average": 315, "very good": 496, "terrible": 229, "excellent": 387}, "aka": "Riu Naiboa", "slim_ranking": 0.722772277228, "description": "* Located in Punta Cana * Inside the Riu Resort, along with the Riu Palace Punta Cana, Riu Palace Macao, Riu Taino hotels and the ClubHotel Riu Bambu * Separated from the beach by just the Riu Taino hotel * Complimentary sun loungers on the beach * 4-story building * Surrounded by 20,000 m2 / 24,000 sq. yards of tropical gardens * 50 km / 31 miles from Hig'ey * 150 m / 495 ft. from Caribbean Street * 30 km / 19 miles from Punta Cana Int'l. Airport * Credit cards accepted: Visa, MasterCard, Amex, Diners"}