{"user_rating": 4.0, "review_count": 432, "name": "Hotel Moderno", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I just spent 18 great days in Madrid. My primary goals were to see the Bull fight Festival of San Isidro; visit Madrid's great Museums and experience the great food of Spain. Hotel Moderno provided the perfect location- 50 meters to the Metro at Puerta del Sol; a 5 minute walk to Plaza Mayor and walking distance to the Prado. The hotel rooms are small but quiet and comfortable with modern bathrooms and comfortable beds. The staff is focused on customer satisfaction. They were great help in getting tickets for the bullfights and in providing guidance and recommendations during my 18 day tour of Madrid. I would not miss the opportunity for a repeat visit. A great small European Hotel.", "title": "Great Small Hotel in the Heart of Madrid", "helpfulness": 4, "user": "HiBob", "date": "June 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5318290}, {"rating": 5.0, "title": "In the heart of magic Madrid!", "text": "I booked this hotel for my partner and I as a surprise for his birthday. I chose the hotel after reading of it's location as it was important that we were in the middle of things. We certainly were! We got the metro from the airport to Metro Sol. This was amazing value! Took around 1hr 15 ish with a couple of changes and cost a mere 1 euro!!! We were astounded and very glad we didn't get a taxi, which most tour operators offer at £40 each way! Don't do it unless you have walking difficulties ( there are steps at the metro stations like the London Underground but there are escalators for the deeper climbs!) We had concerns over metro safety but I felt completely safe! As long as you don't flash your cash and just be a bit aware of pick pockets (as with any city!) you will be fine.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 25, 2006", "id": 5225667}, {"rating": 2.0, "title": "Noisy Moderno", "text": "We had our map ready to try and find the hotel but as we came out of the Metro Sol, a few feet away was the Moderno! We checked into our room which was small clean and comfortable. The bathroom had excellent facilities (including a hairdryer). We had a veranda which looked out onto errr... a department store! But you didn't expect to see the sea did you? The windows had fantastic sound proofing! With the windows open it was very noisy, but shut you wouldn't know you were in the centre of this vibrant city! There is air conditiong so if you go in summer don't worry about having noise because you can keep your windows shut and turn the a/c on!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 23, 2005", "id": 4138802}, {"rating": 3.0, "title": "Great Location", "text": "The staff were friendly and you can leave your (bulky) hotel key with them when you are going out for the night. There is a safety deposit box which works by popping a euro coin in each time you wish to secure it so your belongings are perfectly safe.", "helpfulness": 5, "user": "enjoytravel", "date": "April 9, 2005", "id": 3345755}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "I would go on and tell you how wonderful Madrid is but it would take up a web page! Believe me, if you appreciate good food, culture, friendly people and long party nights...get on a flight now!", "title": "Perfect for my purposes", "helpfulness": 4, "user": "PHNorthLondon", "date": "March 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3266960}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "We steyed at the Hotel Moderno one weekend in Febrauary 2005. It really is a clean, quiet and safe hotel right in the center of Madrid. The location is the best you can have with a walking distance from Plaza Major, Palacio Real and the shopping streets etc. The bathroom was roomy with a good standard. Also the breakfast is was fresh and tasty. The staff was really friendly. All did not speak english very well but why are we travelling: to meet new local people. In all we are very satisfied with this hotel. It gives good value for you money. For the next time in Madrid my hotel is Hotel Moderno.", "title": "Hotel Moderno is OK!", "helpfulness": 6, "user": "Pentti_I", "date": "February 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3199966}, {"rating": 4.0, "title": "great location", "text": "This is a very clean and comfortable hotel right in the center of Madrid. The bathroom was very nice for European standards. Most Spanish hotels I've stayed in do not offer double beds, this is no exception. The breakfast is nice, but not a bargain. I would definitely stay here again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 3, 2005", "id": 3120775}, {"rating": 4.0, "title": "Nice Place", "text": "I stayed at Hotel Moderno in March (2004) with my family. I think it was a very nice place. Staff was friendly and it was in a good location. The rooms were a little small. In our room there were four single beds in one room, a short hallway, and then a nice bathroom. There was also a breakfast included which was nice because we did not have to go out and buy it. Overall i would say it was a good experience and a nice hotel.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 29, 2004", "id": 2963709}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 3, "variance": {"poor": 20, "average": 60, "very good": 195, "terrible": 3, "excellent": 154}, "aka": "Moderno Hotel Madrid", "slim_ranking": 0.247807017544}