{"user_rating": 4.5, "review_count": 846, "name": "Hotel de Varenne", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I stayed here for two nights last year and found the hotel to be very attractive, clean and comfortable. A small breakfast was available, though not included in the price, and, weather permitting, was served in a lovely little outside courtyard area. The hotel was situated in a very good, quiet area near to the Invalides museum area, and conveniently near to metro stations.", "title": "Comfortable small hotel", "user": "AnnaOxford", "date": "September 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 176233843}, {"rating": 4.0, "title": "My \"I love Paris\" Hotel Revisited", "text": "This June 2013 my husband & I stayed at the Varenne for the 3rd time. We enjoy staying there because of the convenient neighborhood. It's located on a quiet residential street between the French senate, the Rodin Museum & Invalides, not far from some embassies. There are all the conveniences nearby--bakeries, grocery stores, a fruit stand (Do not touch the fruit or the owner will scold you. He also got angry because I spoke French--go figure.), small restaurants, hair salons & a post office. There are 2 Metro stops & a step-on step-off tour bus route about 2-3 blocks away. Also the Rue de Bac, a street with up-scale boutiques & a department store is about a mile away & you will pass by the prime minister's residence on the way.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 4, 2013", "id": 175656842}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The hotel has a small lobby that looks like a gentleman's club with a hunt theme & the desk staff all speak English. The elevator is incredibly small. There is a small breakfast room, or you can eat in the courtyard outside. Breakfast is not usually included in the room rate, but you can order a cooked breakfast, or just the perfect chocolate croissant with coffee. Guests are mostly couples from Europe & No. America & some business people.", "title": "Great location and comfortable stay", "user": "vaitiekiene", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175455264}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The rooms are decorated in Neo-Classical style. The hotel was redecorated around 2005, so I think it's time for an update. The bathrooms are roomy with up-to-date fixtures & stone vanities. The rooms have minibars & TVs. Bed & pillows are OK. Some of their rooms are small, but they have some bigger 2-bed rooms facing the street.", "title": "Total Satisfaction", "user": "steven d", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175432817}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Nice hotel and great location. You can easy find it as it is near the river and Dome church in Invalides quarter. Very quiet and safe place. You can easy walk to Eiffel Tower and come back to the hotel late in the evening. Highly recommended.", "title": "Alright, but misled by TripAdvisor Reviews", "user": "Pat R", "date": "September 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 175358559}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "If you don't need or want the expense of fancy lobbies, huge chandeliers, etc., then this is perfect. I stayed there with my four kids (ages 10 - 17) for a week. It's a small hotel; the lobby is about the size of a bedroom and the dining room is even smaller. But it's right around the corner from the terrific Musee Rodin (sculptor of \"The Thinker\", \"The Kiss\", etc.), and within walking distance of Les Invalides, the Eiffel Tower, and the Rue Cler. My kids and I also walked from the hotel to places like St. Germain des Pres, St Michel (Notre Dame area), Place de la Concorde, Champs-Elysees...pretty much all the main tourist attractions are within a half-hour of walking, which is not much by Parisian standards.", "title": "Inexpensive, quiet, perfect", "helpfulness": 19, "user": "dmmbmom", "date": "August 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5618475, "likes": {"liked": "— convenience, location, price, cleanliness, updatedness", "disliked": "— only one Internet computer, which cost 4 euros/hour and was closed after midnight"}}, {"rating": 5.0, "title": "Spotless, Comfortable & Friendly Boutique Hotel in Paris.", "text": "Comfort-wise the main things are that it has good air-conditioning in the bedrooms, the bathrooms are clean and updated and have great smooth Corian sinks (I wanted to take one home!). Like most European hotel rooms, the ones at the Hotel de Varenne are small by American standards, but the 5 of us were perfectly comfortable in two rooms. The staff is helpful and pleasant. A woman named Beatrix was particularly nice to me and my kids and gave us suggestions on where to go. The morning breakfast is included in the room rate and is the typical delicious hotel continental breakfast fare. I got very used to hot chocolate and croissants being served to me on pretty yellow and blue-flowered china.", "helpfulness": 16, "user": "Maribri", "date": "August 3, 2006", "id": 5542718}, {"rating": 5.0, "title": "Perfect Gem of a Hotel", "text": "I would definitely recommend this place.", "helpfulness": 13, "user": "rottmom", "date": "August 1, 2006", "id": 5536320}, {"rating": 5.0, "title": "Perfection", "text": "We had 5 nights at Hotel de Varenne and we loved it. We booked a basic double room with shower and it was more than adequate. The bed was very comfortable and the bathroom excellent. The staff are helpful and speak excellent English and breakfast is very good. The weather was beautiful and the staff were happy to arrange glasses and ice for us to have a drink in the garden. They lent us a corkscrew and generally co-operated with all our requests. Our Paris stay was at the end of a long holiday and after splashing out on dinner at the Moulin Rouge (absolutely fantastic and worth every cent) we were on a budget. The restaurants right by the hotel looked excellent but were quite expensive when converted to Australian dollars. However, a supermarket is across the road and we had delightful picnic dinners which suited us better. We have already recommended this hotel to friends visiting Paris and we will stay there again. It is very close to a Metro and we were able to access everything easily. A good, solid choice.", "helpfulness": 14, "user": "Giulius", "date": "July 28, 2006", "id": 5524132}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled as a couple", "text": "We chose this hotel based on other tripadvisor reports. Stayed there July 24-30. We paid only 109 euros/night including breakfast (summer special rate). A small hotel but huge on comfort, cleanliness, and gracious hospitality. This is the 6th hotel I've stayed at in Paris and it's far and away the best 3-star value in all of Paris -- and we each stayed in the cheapest room available (single/shower only-no tub). It's also in a quiet 7e location (almost all rooms face in to courtyard, ensuring a peaceful night's sleep. Very recently completely refurbished top to bottom. Has a/c!", "title": "Loved our whole experience", "helpfulness": 12, "user": "Aussietraveller5", "date": "July 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5516195, "likes": {"liked": "— The Cosy rooms and the lovely courtyard", "disliked": "— Book well in advance"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We spent 4 nights there with my husband at the beginning of july and we keep a great souvenir of our holidays.", "title": "Perfect stay", "helpfulness": 2, "user": "tania p", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169913565}, {"rating": 4.0, "title": "Comfortable getaway from the crowds.", "text": "We had a superior room, very comfortable and freshly renovated. This was located on the garden side and we could sleep with the window opened at night ! Pretty rare for Paris.", "helpfulness": 1, "user": "excitablesmKc", "date": "July 18, 2013", "id": 168122658}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We breakfast, taken in the garden was delicious and cheap at 11 euro per person.", "title": "Great location!", "helpfulness": 4, "user": "ch1225", "date": "July 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168111224}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The entire staff speaks god english and is very polite and helpful.", "title": "Fabulous!!", "helpfulness": 4, "user": "JoeC22", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167671345}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This is a place to remember and to go back.", "title": "Totally lived up to its good reputation!", "helpfulness": 3, "user": "Quirindi28", "date": "July 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 167281780}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I agree with the others that the hotel could be so much better if the staff were at least friendly! Not helpful at all, rooms are small and location is ok but not as good as the rave reviews. The only helpful staff was the late night attendant but otherwise they did not do anything to make our stay pleasant where really simple things like offering plates and glasses to share our wine and cheese on their lovely patio. Disappointed but not terrible. Expensive for how miniature the rooms were.", "title": "Hotel staff is the main drawback", "helpfulness": 1, "user": "cttravelgal", "date": "September 16, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 177399498}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We had a short stay at le Varenne, only 3 nights last week.", "title": "Comfortable and pleasant", "helpfulness": 1, "user": "paul s", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177115163}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Unfortunately the weather in Paris wasn't good enough to enjoy the charming little garden of the hotel.", "title": "very nice hotel", "helpfulness": 1, "user": "jcp01", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 177106865}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "But all the rest was perfect and we keep a very good souvenir of our Paris vacations.", "title": "Pleasant and prefectly located", "helpfulness": 2, "user": "laura l", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177003397}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We booked a room at Hotel de Varenne based on prior trip advisor reviews. We were not disappointed. Hotel is in a great location and is very comfortable. Within waking distance of museums, restaurants, public transportation and shopping. Staff was very helpful in securing reservations at Paris restaurants and providing directions for sights. With the unseasonably hot weather during our stay, the room AC was appreciated. Also had English language newspapers in lobby. We would definitely stay here again on our next trip to Paris.", "title": "Very pleasant hotel", "helpfulness": 1, "user": "CMYKZena", "date": "September 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 176898550}, {"rating": 3.0, "title": "ideal location, with room for improvement", "text": "We stayed here for 5 nights for our honeymoon. While I agree that this facility is in a quiet and central location and that the facility is nice and remodeled, the reception and staff at the hotel left me unimpressed and little irked. If it weren't for the lingering feeling I have from my interactions with the front desk, I would have given this property 4 stars.", "helpfulness": 1, "user": "RedPhoenx", "date": "August 30, 2013", "id": 174882221}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Don't get me wrong. I liked the hotel, which was clean, newly remodeled and comfortable. It was nicely decorated and tucked away on a quiet street, but an easy walk from the metro and to sights. The location is great.", "title": "Hidden gem!", "user": "Carinmaine", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 174587433}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The reception wasn't particularly helpful or always pleasant. The were definitely not personable. Another reviewer said reserved. They seemed preoccupied with whatever was on their computer screen and too exhausted by other things going on to care about anything we asked for . I asked one gentleman where I could go for take out coffee. He looked irritated that I asked the question and then told me to take 2 rights after I left the hotel and then started talking to someone else. The Wifi was down, pretty much for our entire stay, which I understand is not a necessity, however, it was advertised and we wanted to research stuff for our stay, which could not do. Our room was not made up the first day after an entire day of sightseeing. The pillow cases and towels were removed, but the bed had not been made. When asked why, we were asked why we did not hang the sign outside our door to tell them to make up the room. Sorry, but in other hotels, we never had to do this and we have done a lot of traveling.", "title": "Perfect get away", "user": "n0me", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174514552}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I will consider this hotel among other ones, the next time I return to Paris.", "title": "Fantastic stay", "user": "frances t", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172503410}, {"rating": 5.0, "title": "Perfect for the weekend", "text": "My friend and I recently had 5 excellent nights at Hotel de Varenne. We had a Superior twin room overlooking the courtyard. The beds were comfortable, bathroom was spacious and modern, room was equipped with a small fridge and a safe. The location was perfect for us. There's a Hop On, Hop Off Open Tour bus stop nearby as well as a metro stop. We never paid more than 11 Euro for a cab back to the hotel from most locations in the city. The hotel is on a quiet street but there's a nice grocery/wine store, pharmacy and bakery within a block of the Hotel. We had a fantastic dinner at the Brasserie du Bourbon (delicious crepes!), which is a few blocks away. If you're there on a Wednesday, the Musee Rodin - which is less than a 10 minute walk from the Hotel - stays open late. We were very impressed with the staff, especially the Concierge, Beatrix!!", "user": "Jonathan H", "date": "August 9, 2013", "id": 171525022}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This is a great place to stay in Paris. The courtyard rooms are wonderfully quiet, and a good size. The airconditioning was very good. It was 35 outside, but we were fine.", "title": "Believe the good things about this hotel", "helpfulness": 9, "user": "RedPuffin", "date": "September 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5763971}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "This hotel was GREAT! We stayed four nights in the “double with bath”. It was a little small, but typical for Paris.", "title": "Nice and classy", "helpfulness": 19, "user": "jclayton9", "date": "August 31, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5731407, "likes": {"liked": "— Location, Price"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The Good:", "title": "Excellent Hotel", "helpfulness": 14, "user": "DeniseH", "date": "August 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5727006, "likes": {"liked": "— Location & Value", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "a) Fridge in Room: There is a little store across the street where you can get all sorts of things, and the fridge was great for keeping them in. You can get 9E Chatauneuf De Papes!!!", "title": "Can't beat it!", "helpfulness": 12, "user": "travelingnan", "date": "August 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5725517, "likes": {"liked": "— Location, room comfort and staff", "disliked": "— No restaurant on site"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "b) Internet is cheap (1 hour for 4E). You get a little card that you log in with and it keeps track of your time throughout your stay.", "title": "Nice hotel, a few glitches...", "helpfulness": 17, "user": "generaltravel", "date": "August 26, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5712141, "likes": {"liked": "— room size", "disliked": "— interacting with hotel staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006", "text": "My wife and I stayed a couple of nights at Hotel de Varenne beginning of october and were very pleased. I can't say enough good things about this hotel. Our room was very elegant. A little small but this is probably french standard. We loved the ambience, the garden and the location in the peaceful 7th arrondisement. The staff of this hotel deserves every compliment. We shall never look for another hotel in Paris! This is the place to be when we return.", "title": "a perfect small hotel", "helpfulness": 9, "user": "qwedfr", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5963368}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed at the Hotel de Varenne beginning of october for 3 nights. We did a lot of research on Paris hotels prior to our trip and found that the Varenne is an excellent value compared to other hotels in Paris. Perfect location, away from the crowds, in a residential neighborhood, but close to St. Germain, the Orsay, Louvre and Rodin. The standard of the room was excellent, relaxing, very clean and the bed extremelly comfortable. The service was very good. Friendly helpful staff, assisted us on numerous occasions with reservations and other matters.", "title": "Excellent hotel and location", "helpfulness": 11, "user": "nfsns", "date": "October 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5945263}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We warmly recommend this place to anybody. The value is probably one of the best you can find in Paris, you really feel at home at Le Varenne. I would certainly want to stay there again!!", "title": "Mediocre", "helpfulness": 12, "user": "FM", "date": "October 9, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 5930329}, {"rating": 4.0, "title": "hotel de varenne review", "text": "We stayed here for 3 nights at the end of september - Hotel was ok in that location is fine, though very quiet, and you need to walk a fair bit to find a bar / restaurant open in the evening.", "helpfulness": 6, "user": "pzxkys", "date": "September 30, 2006", "id": 5894984}, {"rating": 5.0, "title": "Just loved paris", "text": "Main issues with the hotel were that the rooms are dark and lighting very poor - Bedside lights were just about enough to be able to read by.", "helpfulness": 12, "user": "thymat", "date": "September 24, 2006", "id": 5832548}, {"rating": 4.0, "stay_parameters": "Stayed October 2006", "text": "This was the first stop for my mother and I on our European adventure and we were pleasantly surprised by Hotel de Varenne. It is well appointed with all of the amenities that we needed. We had a lovely view of the pretty courtyard below, which was a real treat. The hotel was within walking distance to the main attractions and close to the Metro. There were some nice little restaurants right outside the door....and the breakfast was not so bad. If you order the breakfast for two, you get a lot of coffee, warm milk and loads of pastries to get you going for the day.", "title": "A really wonderful place to stay....", "helpfulness": 10, "user": "regnigc", "date": "December 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6358372}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The best part of this hotel was the courteous and very gracious staff. They were very knowledgable and gave us very good tips and directions.", "title": "Paris perfect!", "helpfulness": 10, "user": "dancermissa", "date": "December 5, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6335658, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I would recommend this hotel for almost anyone....:)", "title": "Quality at a bargain price.", "helpfulness": 16, "user": "dmcall", "date": "November 19, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 6153304, "likes": {"liked": "— Price and location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My daughter and I stayed in the Varenne for 4 nights in Sept 06.We had a wonderful stay.The hotel is in a quiet neighbourhood with plenty of daytime activity because parisiens actually live there.The hotel was a sanctuary after a hectic days activities.Open top bus(fantastic and our main means of transport) stop close by as is the beautiful Rodin Museum.Lovely little shops close by and everyone so friendly (which is a first for me in the 12 or so times I have been there).I think this is because it is not a tourist area.The staff are fairly cool but I think this is the french way of not intruding ,so I had no problem with it.Every request was politely met.The room was quaint ,clean,fridge a bonus, big bathroom with bath!!!!!!! and lovely big windows opening onto greenery .We slept with the windows open every night.We loved it and finally after all these years\"I love Paris\" too!", "title": "Best value for your Euro", "helpfulness": 16, "user": "themoos", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6083307, "likes": {"liked": "— clean, comfortable, helpful staff, location", "disliked": "— no negatives"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The Varenne is a real find. A clean, safe and really very pleasant hotel in central Paris, for a fraction of the price you'd expect.", "title": "Excellent hotel!", "helpfulness": 11, "user": "KMiles", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6063031, "likes": {"liked": "— Location"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 7, "average": 46, "very good": 210, "terrible": 2, "excellent": 581}, "aka": "De Varenne Hotel", "slim_ranking": 0.0223089793642, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Welcome at the hôtel de Varenne... Ideally located, the Hotel de Varenne is a historic treasure dating from the 19th century, decorated with refinement in a Louis XVI and Empire style. Lying in the centre of Paris, the quiet and safe Rue de Bourgogne opens out on one end to the Rodin Museum and, on the other end, to the building of the National Assembly and lies near the Embassies and Ministries. This recently renovated townhouse distinguishes itself by its personalised reception."}