{"user_rating": 4.5, "review_count": 597, "name": "Hotel Las Arenas Balnerario Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My wife, 16 year old daughter and I spent 2 nights here with the aim of relaxing, but also seeing a bit of Valencia. We chose the hotel for its location and we weren't disappointed. Across a pedestrian walkway is the beautiful sandy beach - although we found it hard to leave the hotel. We booked a junior suite so the 3 of us could share and although we had a side view, this wasn't a big problem as we didn't spend much time in the room. We were shown a sea view room and we decided it wasn't worth the extra cost. The hotel is big (253 rooms?) and hosts its fair share of corporate events and weddings. However, we never felt that such events dominated the hotel and we could always find space by the pool. The room was very comfortable and clean, with a good bathroom. My wife and daughter both enjoyed treatments at the spa. There is a kids' pool quite separate from the adults' pool where we spent most of the time reading and swimming in the enormous pool. Sadly the diving boards are no longer in use. The pool attendant was very efficient moving beds, bringing towels and setting up an umbrella. It did get quite windy by the pool, but this was very pleasant since the temperature rose beyond 30 degrees. Breakfast in the hotel wasn't cheap at 23 euros per person, but the buffet was very generous. For lunch, we went down to the variety of beachside restaurants to the right of the hotel and enjoyed delicious seafood and paella. As a base for visiting Valencia, it's not ideal as the journey in takes about 20-30 minutes. However it's well worth it as Valencia is charming with some good restaurants and shops, not to mention the ultra modern Palace of Arts and Sciences. We'd definitely go back to this hotel and the city, which is like a smaller, calmer version of Barcelona.", "title": "Stylish resort hotel on the beach", "user": "Donk-Argyle", "date": "June 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164803773}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We were in the hotel for one week. It is a good hotel close to the big public beach. The hotel has a very nice swimming pool with comfortable beds. The hotel gardens and fountains are beautiful. The rooms are clean and have a nice sea view. The food and drinks in the hotel are quite pricey compared to the quality that is offered. Also the service by the hotel staff is quite average, below the standards you would expect from a five star hotel.", "title": "Good hotel, nicely located at the beach", "user": "Martijn_1978", "date": "June 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164714152}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Be proud of your hotel. It is a world class hotel. Everything from start to finish is absolutely first class… I have stayed at some of the best hotels around the country and world and the I Hotel is right up there with them.”", "title": "perfect stay", "user": "Drika A", "date": "June 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164503219}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I was there for business, and as understood, it is the most luxury hotel in Valencia. First idea - how far it is from Turkish luxury resorts... The good thing, that it is on the first line of the beach, and there is a good pool.", "title": "Difficult to stay after Turkey resorts", "helpfulness": 1, "user": "Alexdomin", "date": "June 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 163842814}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "QWuite a lot of negatives:", "title": "Beautiful view!", "user": "Blondealice", "date": "June 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 163794610}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This five star hotel deserves the rating. The service and the quality of the room lived up to our expectations. The hotel is not near the center of town, but right on the seaside. The restaurant was also exceptional. The delicious iberico jamon is a lasting memory! Thre were two pool areas with one perfect for doing laps.", "title": "Beautiful view from room!", "helpfulness": 2, "user": "go2fun", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 162226223}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Fabulous hotel by the beach. The staff couldn't have been more helpful. Although booked for five days we were thrilled when they were able to accommodate us for two more days . A short taxi or team ride to the centre. Highly recommend.", "title": "Valencian Heaven!", "helpfulness": 1, "user": "Carole200", "date": "May 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161993256}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "A bit away from the city center but directly on the beach...grounds are quite beautiful. Upon arrival one has the feeling of a 5-star until reaching the rooms, which are just average. The walls are thin so one can hear ones neighbors or even the housekeepers early in the morning. Good if you want to get away from the bustle of downtown but recognize all the attractions are not within walking distance and that conferences/big events seem to be one of the draws here too.", "title": "Overall Property is Great, Rooms fail to meet 5-star", "helpfulness": 4, "user": "Kona2005", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 161842995}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "A nice and large hotel, next to the large beach. Good but not great rooms (take the one with sea views because facing the other side would have been terrible), very nice breakfasts and good spa. The hotel area is far from city center and next to a large port; so, the neighborhood is rather scary and not too suitable for walks around, unless to the sea. Two options: either take a taxi to the city (15-20 minute drive to city center) or just hang out at the beach or in the hotel. There are several good bars and restaurants lining up at the seafront. Also, there is some fun activity at the beach in the evenings, with a fun local band and local capoeira amateurs. Beware of some noise (rooms are not fully soundproof and in the evenings it may get noisy at the beach or from the parties in the hotel restaurant), but nothing critical. Overall, a pleasant relaxed hotel in the great city of Valencia, a bit far from the center but right at the sea and a nice sandy beach", "title": "Good hotel for reasonable price; 15-20 minutes from city center but right a nice sandy beach", "helpfulness": 1, "user": "Anatoly_Kairo", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 161172495}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The gardens with the fountain are really nice but the área of the swimming pools has not charm to be consider a GL hotel. The good think is the location in from of the sea.", "title": "Nice location but rooms are not grand lux", "helpfulness": 4, "user": "MStravelle", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 161131189}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This is a big hotel right smack bang on the beach in the port area of Valencia so it has a great 'holiday' feel to it but is within 10 mins drive to the city centre. It has all the amenities you would expect to find at a 5 star resort and overall is very impressive, but the rooms do need a little updating and are on the small side.The pool is huge with plenty of sun loungers but we could have done without having to walk around trying to find the lifeguard every time you need a towel and the same issue when you want to return your towel, which you do because they threaten to charge €50 for any non-returned (not exactly guest friendly!) Overall I would recommend and I will return but some helpful tips are make sure you eat in one of the many restaurants all lined up alongside it instead of the hotel because not only are they a helluva lot cheaper, but food is far tastier and they all have bucket loads more atmosphere than the hotel. And spend at least one day on the loungers at the beach, its beautiful, the water is gorgeous and the €2 beers go down a treat!", "title": "Great location", "helpfulness": 1, "user": "TaylorPeat", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 160725859}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Nice for professional seminars on work days, nice for family fiestas on week-end.", "title": "Not a place to relax", "helpfulness": 1, "user": "tripper_advice", "date": "May 14, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 3.0}, "id": 160720486}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "But do not expect to relax there.", "title": "Fantasitc View, wonderful pool and spa", "helpfulness": 1, "user": "Cathleen_SA", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160648242}, {"rating": 3.0, "title": "It was acceptable at the time...", "text": "Room offers a nice sea view, but it is not soundproof (you hear everything from corridor or other rooms, at any time).", "helpfulness": 2, "user": "Mark L", "date": "May 1, 2013", "id": 159390319}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Sofas at the bar are comfortable, but it is so crowdy and noisy with all those seminarists.", "title": "Beachside haven", "helpfulness": 2, "user": "taniellel", "date": "April 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 159075425}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Enjoyed an evening stay for a business convention we organized at the hotel. You immediately notice the friendly and helpful service and top notch quality upon arrival. The location is perfect for a walk along the beach or run and the hotel is very well equiped for a business convention in a relaxed professional environment.", "title": "Great location and top notch service", "user": "Hadzi", "date": "April 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158744248}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Ask for a room facing the beach!", "title": "Perfect!", "helpfulness": 2, "user": "ollib02", "date": "April 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 158559523}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We thoroughly enjoyed our stay at the Las Arenas Valencia. The room was fabulous, the view is beautiful, the whole hotel is very well looked after and maintained, restaurants are very good (breakfast is very opulent and dinner was great) but the best is the staff - very friendly! The Spa and pool areas are excellent as well - all in all a wonderful experience. and we were really surprised how lovely Valencia is - a place that one would not immediately choose for a trip to Spain but really worth seeing. We will be back!", "title": "A great place to stay", "helpfulness": 2, "user": "Dave T", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158045379}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We had a room on the third floor with a balcony over looking the beach and Mediterranean sea.", "title": "Best hotel in Valencia, incredibly clean!", "helpfulness": 1, "user": "edithTheHagueHolland", "date": "April 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158011062}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "What a great place to stay. The bathroom had double sinks, bath and a massage shower. Loads of toiletries were provided including razor, shaving cream, toothbrush, toothpaste, shampoo, shower gel and body lotion. In addition, there was also bath robes and slippers. The breakfast was excellent and included unlimited cava. The spa and swimming pools were also great. The staff were very friendly and helpful, most spoke English and could not do enough for you. The food and drinks were a bit expensive but this is a five star hotel. I would recommend staying in this hotel and we will return again in the future. Enjoy.", "title": "Top class....luxurious.....", "user": "Niall", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157860704}], "location": {"country": "Spain", "region": "Valencian Country", "continent": "Europe"}, "stars": 5, "variance": {"poor": 16, "average": 43, "very good": 143, "terrible": 7, "excellent": 388}, "aka": "Hotel Las Arenas Balnerario", "slim_ranking": 0.00990099009901, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "At the Las Arenas Spa Resort Hotel, the first 5 star Deluxe hotel in the Valencia region, design has consciously been taken into account so that it opens out onto the sea in the city of Valencia. This hotel, only a few minutes walk from the city centre, enjoys a privileged location on Las Arenas beachfront, looking out over the sea.Most of the 253 rooms and suites have bathrooms with hydromassage cabins and baths, plasma TV and satellite, WiFi Internet access and CD player. Most rooms also feature large terraces overlooking the Mediterranean Sea."}