{"user_rating": 4.5, "review_count": 265, "name": "Hotel du Lac", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "At every turn we were amazed by the gracious service of this wonderful hotel. Family-run, you can see the pride they take in making guests feel welcomed and comfortable. The view from the terrace or the rooms is fantastic and we had a very hard time leaving. We will go back to enjoy their accommodations, breakfast and service at some point again. They are the only hotel this is literally on the water so a visit to their bar is a must if you are staying elsewhere. Varenna is a wonderful town, much less crowded than the larger cities on Lake Como and worth a visit at the very least.", "title": "A Must-Stay, Can't Wait to Return", "helpfulness": 1, "user": "happyhappyjoyjoy1024", "date": "May 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29659949}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Nice and pleasant personnel, perfect spot on the lake. Varenna is the best place of all around. If you are travelling by car - you found yourselves a safe private parking!", "title": "Nice hotel, perfect village, safe parking", "helpfulness": 1, "user": "73etraveler", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28861666}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "A luxurious hotel overhanging Lake Como in one of the prettiest villages in Italy.", "title": "Perfection", "helpfulness": 1, "user": "jtkrd", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 28827991}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "It's heaven.", "title": "Easter by the Lake", "user": "Another_Australian", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28105140}, {"rating": 5.0, "stay_parameters": "Stayed June 2004, traveled solo", "text": "Rick K.", "title": "Breathtaking view with my breakfast!", "user": "lorelaigilmore", "date": "October 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21424586, "likes": {"liked": "— The view and location", "disliked": "— The window in my room is too small."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I just came ack from the lovely Hotel Du Lac! After escaping a totally awful stay at the Hotel Olivedo we had booked the first awailable hotel we could find - luckyly the Du Lac. Nice nd clean Room, wonderful terrace with a fantastic view, a nice platform for bathing in the lake, great bathroom, the sweetest and most helpfull staff, nice terasse bar, and an incredible breakfast! I really hope to come back next year! This hotel is simply perfect!", "title": "This Hotel is simply fantastic!", "user": "sarahhjelholt", "date": "July 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 36074904}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "This hotel was a perfect combination of great accommdations in a beautiful setting, with friendly, helpful staff. We stayed here at the tail end of our 17 day trip to Italy, and as soon as we arrived wondered why we hadn't planned to stay longer. We were traveling with our son & daughter in law, and 2 teenage sons, and had 3 rooms on the 2nd floor - all with full lake views and small balconies. The beds were super comfortable, rooms were very clean and spacious and the breakfasts were great, served on the terrace overlooking the lake! They served the best cheeses, brie, gorgonzola, pecorino, etc. with ham and salumi and also had cakes and chocolate croissants! We would not hesitate to recommend this hotel and the town of Varenna on Lake Como.", "title": "We loved Varenna and the Hotel Du Lac", "user": "psgmartino", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33773302}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I moved to this hotel after checking out prematurely from hotel Eremo Gaudio in the same town. What a contrast. Hotel Du Lac has well decorated, comfy, clean rooms. The girl on the front desk at night is english and couldn't be more helpful. Recommended.", "title": "Impressive", "user": "Nick44London", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31627693}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I loved this hotel. My husband and I were on our honeymoon and it was absolutely perfect. Location was great, Varenna is great! The view from our room was amazing. The breakfast was better than others I had in the other 4 places we visited. We definitely felt it was one of the best hotels we have ever stayed in in Europe. I highly recommend a sailing trip, and the walk to fuimelatte. We only wished we stayed more than 3 nights because it was so incredibly pretty and relaxing.", "title": "One of the nicest Italian hotels I have ever stayed in!", "user": "jentuna", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 31412024}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "A very friendly and welcoming hotel. The staff could not have been more helpful. Room and facilities were perfect. Fantastic views of the lake from the terrace for evening drinks and breakfast. Would highly recomment this hotel for anybody looking for accommodation on the shores of Lake Como.", "title": "Perfect family run hotel to celebrate 25th wedding anniversary", "helpfulness": 1, "user": "wild-weird-witters", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31155854}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Truly deserves the top rating. The views are splendid, the rooms are clean and large. There is a great walkway along the waterfront to stroll in the evening, past bars with music and gelatterias. The staff was very accomodating. I would definitely stay here again.", "title": "Great Location, Great View.", "helpfulness": 1, "user": "SantaCruzSteve", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46292079}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "This hotel was absolutely wonderful! Not sure why it is classified as a 2-star hotel on Tripadvisor's website--I would rate it higher.", "title": "Gorgeous View, Great Hotel, Extremely Relaxing!!", "helpfulness": 2, "user": "ADBTraveler", "date": "October 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45671331}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Definitely spend the extra money if you can for a room with a view of the lake and with a balcony. Our twin bed room was nice and clean, with lots of natural light that came in from the bay windows and balcony door. The views were absolutely fantastic! You can sit on the balcony or hotel terrace with a glass of vino and listen to the sounds of the lake, very relaxing.", "title": "Du Lac is a wonderful hotel - excellent accomodations, the best location, top staff and great value.", "helpfulness": 1, "user": "supergirl50000", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41147321}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Varenna is a great town from which to explore Lake Como. It is not nearly as touristy as some of the other towns, such as nearby Bellagio, which was a pleasant surprise. Therefore, it's much more quiet and quaint without all of the tourist shops. However, you're just a 15-minute ferry boat ride away from Bellagio. I thought this was the perfect arrangement. We also had our best food of our trip in Varenna--in talking to other travelers they echoed the same sentiments. This is certainly not a town to be missed! It's also very convenient to Milan--just an hour train-ride away.", "title": "Fantastic, Beautiful, Gorgeous, Loved it!", "helpfulness": 2, "user": "tonight33", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38902101}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel had a very nice buffet breakfast and had access to a computer/internet on site, however they did charge for its use. (Just a few Euros depending on how much time you purchased.) The staff was exceptional--very friendly--and they made great suggestions for dinner and activities.", "title": "Fresh white peach bellinis overlooking the lake - bliss!", "user": "Jencnotindc", "date": "August 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37602172}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This is the second time we’ve stayed at this hotel. It is one of three Hotel du Lacs on Lake Como, one each in all three of the towns in the middle of the lake—Varenna, Bellagio and Menaggio. So if you decide you’d like to stay at the Hotel du Lac, be certain you know which one you’re booking. This one in Varenna is a taxi drive (or a long, uphill walk with luggage) from the ferry dock to the main square or a somewhat shorter but still hefty walk from the train station. After you reach the main square where the church stands, you go to the opposite end of the square and then downhill for about a half block until you reach the garage of the hotel It can be a bit hard to find but they do have parking (for 15 euros per day in their garage) so you can leave your car and get around by ferry, steamer or walking all/most of the time you are there.", "title": "Hotel du Lac, Varenna not to be confused with the other du Lacs in the area", "helpfulness": 2, "user": "FloridaTravelmum", "date": "December 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51358441}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The place feels like a nice house with a lovely terrace/garden and rooftop patio where you can have drinks, snacks and breakfast as you watch the lake and best of all see the sunset over Lake Como and the hills/mountains that surround it. We think the view from the terrace is quite one of the loveliest places on earth, bar none. It’s relaxing and beautiful beyond words. Even if you don’t stay at the hotel, you can stop by the terrace for drinks. I recommend it highly.", "title": "divine views", "user": "raglan55", "date": "November 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49230906}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Rooms are nicely appointed, some with narrow balconies able to hold a single chair (others with nice wide balconies but in a higher price category) for 187 euros a double. Ours had a bed, desk, and sofa. Everything is very clean and well cared for. Our bathroom had a shower with a seat where you could sit but not an actual tub. The one drawback if you have knee replacements like I do, is that there is no elevator and rooms on two or maybe even three levels, so be sure to check ahead if climbing stairs is a problem for you.", "title": "Loved, loved, LOVED Hotel Du Lac!!!", "helpfulness": 2, "user": "Mobile_Mirandas", "date": "November 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49221401}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "Breakfast is included in the room rate and includes all of the standard offerings, plus nice cheeses and cold cuts, and usually a homebaked sweet treat. Service is truly caring and friendly.", "title": "Great breakfast, Nice staff", "user": "Nuttman", "date": "November 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 48927152}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "We’ve stayed at the Grand Hotel Menaggio and the Grand Hotel Victoria in Menaggio (never in Bellagio) and find the du Lac in Varenna superior as a hotel. Unfortunately, we find Menaggio as a town superior to Varenna, so it’s tough to decide where to stay next time we’re on the Lake but I’m guessing that we won’t be able to resist the tug of the wonderful view at the Hotel du Lac in Varenna once again.", "title": "Well located, friendly staff, impeccably clean", "user": "C5Cye", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47039759}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe"}, "variance": {"poor": 11, "average": 18, "very good": 54, "terrible": 0, "excellent": 182}, "aka": "Du Lac Varenna", "slim_ranking": 0.142857142857}