{"user_rating": 4.0, "review_count": 428, "name": "Hotel Valencia - Santana Row", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Had not been to this property in many years, since it originally opened, and it looks like no one has taken care of the rooms since. Although Santana Row makes for a lovely setting for a business or pleasure trip to the San Jose area, this hotel lacks proper upkeep. My room actually had chewed stuck gum on a wall, assorted stray hairs around, and even trash left behind the furniture. Moreover, the walls, wood trim, and furnishings are all beat up. There is no concierge service at all, no one at the front desk had the ability to suggest hikes or even help with dinner reservations. The courtyard however is lovely, the bowl of oranges a nice touch, and the free (very standard fare) breakfast a plus. Overall, I suggest that someone focus on making the rooms clean and fresh. It feels very neglected.", "title": "VERY MIXED BAG: LOVELY LOCATION AND SETTING BUT OVERTIRED ROOMS AND LACK OF SERVICE", "user": "NomadicNina", "date": "June 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 163832086}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I agree with previous posters this is a very noisy hotel . I was there last week of May for a business trip and was keep awake quite a few nights due to loud music- when I complained next day at reception they blamed the Irish bar around the corner!!", "title": "Not for Business trips", "user": "toni253", "date": "June 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 163805540}, {"rating": 1.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Rooms were nice and breakfast was good .", "title": "Not really a relaxing hotel....", "helpfulness": 1, "user": "FefeVolpi", "date": "June 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 163621858}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "In summary if you plan to be out partying most of the time this is the hotel for you .", "title": "Business Trip Great Location!", "user": "Barry O", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163595268}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "If you are a business traveller or value your sleep this note is not for you .", "title": "Trip Down Hwy One", "user": "Al B", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163511515}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "One of my favorite hotels in the Bay Area. The rooms are fresh and designed with a chic, modern touch. Everything is super clean and the staff is great: knowledgable and friendly. Located in the great location of Santa Row with tons of things to do. Beds are comfortable, rooms smell great, and bathrooms large and clean. Just cant say enough about this hotel.", "title": "Great Experience", "user": "Don D", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160134246}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Stayed here for a wedding weekend and enjoyed the hotel's services ( Lovely breakfast) and surrounding \"village\" of Santana Row's shops and restaurants.", "title": "A great high-end getaway local weekend", "user": "lapwing66", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159857200}, {"rating": 5.0, "title": "Just great", "text": "As it is centrally located to many other Bay Area destinations, one area for management focus is the hotel's ability to make relationships with taxi's and provide an entrance and exit to service hotel and restaurant customers. On two occasions, we had to leave the hotel's taxi stand after waiting 20-30 minutes to hail a cab - the last time, to make it to the wedding before the \"I do's!\"", "helpfulness": 1, "user": "Beat B", "date": "May 4, 2013", "id": 159616111}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Hotel room was spacious, modern and clean with comfortable beds.", "title": "Always a great stay at Hotel Valencia", "user": "merrinio", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159347992}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Beside that the hotel is located on a great place ( Santana Row ) with a lot of restaurants an shops,", "title": "Nice hotel in great location", "user": "lggirl40", "date": "April 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158986407}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed here for 3 nights in early June, 2013, and it's really a shame that management finds it necessary to be so ridiculously petty in its fine print, as this creates a negative vibe, when the hotel itself is terrific and the front desk and other staff are so nice. You aren't allowed to bring \"outside alcohol\" into your room. Are we in high school? Is management big brother? My husband and I (empty-nesting, frequent travelers) cannot have a glass of our own wine while we watch the news at night in our room? Really? Also, please note that they add 19% to the $7 bottle of water, and anything else you eat from the snack tray in your room, and if you happen to prefer to not be tempted by it during your stay, they charge $25 to remove it from your room. Do they happen to be sympathetic at all to guests with allergies to Snickers and peanut M&M's, or guests who struggle with weight issues? Bed was comfy, room was quiet, complimentary breakfast was very nice, and while they define it as \"continental,\" it included hot eggs, a meat, potatoes the days we stayed, in addition to traditional continental fare. Staff was wonderful. Santana Row was great fun. Eat at Lark Creek Blue and The Left Bank.", "title": "Why all the negative fine print?", "user": "OneLuckyGalC", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163135406}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed in Valencia for 3 nights on a business trip. The room was quite comfortable and had a great view. Breakfast was modest, but tasty. I had no time to check out the gym, but the surroundings were great.", "title": "Great stay, nice atmosphere", "helpfulness": 1, "user": "Alina_Austin", "date": "May 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162187552}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Santana Row has a lot to offer, bars, restaurants and shopping. It was really nice to be able to come back to the hotel, take a short break, and spend the evening hours in one of the locations nearby. Will definitely stay again!", "title": "Beautiful Hotel on Santana Row. Good for Business, but wouldn't take the kids.", "helpfulness": 1, "user": "Eric D", "date": "May 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160891047}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "On the cons side, the staff could have been a lot bit friendlier..", "title": "Nice stay", "helpfulness": 1, "user": "Lindsey S", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160736348}, {"rating": 4.0, "title": "Pleasant stay in Silicon Valley", "text": "I recently stayed at the Hotel Valencia on Business for the second time. It has beautiful rooms, a lovely atmosphere, and a great location with easy access to restaurants, shopping, and nightlife. The rooms include free wifi rate-limited to 1.5 mbps or you can pay $10 a night for 5 mbps, both are limited to 5 devices per room. I'd never seen tiered internet in a hotel before and while 1.5 mbps is painfully slow I did reliably get that speed—unlike in many hotels with internet that is unresponsive and prone to connection loss.", "user": "MPLS-MN_Traveler", "date": "May 12, 2013", "id": 160474230}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I frequently stay at Hotel Valencia Santana Row when traveling to San Jose for business. The rooms are nicely furnished and set up for business travelers (desk, wireless internet, plenty of outlets.) Internet and a very nice breakfast are included in the room rate. There is a small but adequate fitness center. Parking is easy and free if you self park - a recent upgrade is the ability to print out your parking pass before you arrive. I like being in Santana Row with plenty of restaurants and shopping within walking distance - including Valley Fair Mall. For me, the only downside of this hotel is that it is a very popular night spot and it can be noisy late at night.", "title": "Nice but noisy", "user": "jnj182", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 158487207}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "It is a great hotel with good rooms - especially the weekend rate is rather low for the region and the services. The design of rooms and hotel is nice. The rooms are in general very good - bits and pieces might be missed by the service.", "title": "Great and Busy Hotel", "user": "AxelWinter952", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158291916}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Still I like the hotel, breakfast, and the location - good for exploring the bay area.", "title": "Uh Oh.", "user": "harvman", "date": "April 14, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157709560}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "Bear in mind this is a business hotel and area. If you go to places in Santana Row you will find a lot of vendors taking their guest from abroad out ...", "title": "Great location", "user": "mingachimp", "date": "April 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157538573}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "After staying at the Hotel Valencia while on business in February of 2012 and being very impressed, I was certainly looking forward to a return visit in April of 2013 - with 7 others while on business. Unfortunately a lot changed in a year - and not for the better.", "title": "Great Customer Service!", "user": "Cassia90", "date": "April 10, 2013", "detail_rating": {"location": 5.0, "service": 5.0}, "id": 157327341}], "location": {"country": "United States", "city": "San Jose"}, "stars": 4, "variance": {"poor": 21, "average": 54, "very good": 131, "terrible": 31, "excellent": 191}, "aka": "Hotel Valencia Santana Row", "slim_ranking": 0.138888888889, "description": "Hotel Valencia Santana Row is the only hotel located on Santana Row! Our boutique hotel in San Jose, CA is at the center of all the excitement, entertainment, shopping and dining on Santana Row and near the Silicon Valley and Cupertino. Hotel Valencia is ideal for a romantic or weekend getaway, a business trip or corporate group or convention. See and be seen at our hip and swanky Vbar or dine in the acclaimed Citrus Restaurant with menus by Executive Chef Robert Sapirman. Hotel Valencia Santana Row invites guest to experience luxury with our 212 rooms and suites and experience exceptional service and surroundings during your stay."}