{"user_rating": 4.5, "review_count": 817, "name": "Hotel Amigo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "I stayed 2 nights at hotel amigo. Staff were fantastic. Helped me find the place when the gps had tried to go up streets that were closed off. Great spead on for breakfast. Staff knowledgable about local area and how to get to places. Would definitely stay here again if I was in Brussels.", "title": "Great place to stay!", "helpfulness": 1, "user": "Senoc", "date": "August 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 138841587}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The Amigo is a Rocco Forte Hotel. We had become big fans of their hotels - having stayed at the Charles in Munich and the Augustine in Prague. Both magnificent properties in all ways.", "title": "SO DISAPPOINTED", "helpfulness": 1, "user": "SFTravelers124", "date": "August 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 138425786}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We were very excited to learn that there was a Rocco Forte hotel in Brussels, and booked our stay there at the Hotel Amigo.", "title": "Fab place to stay", "user": "SaudiArabia1002", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138335718}, {"rating": 4.0, "title": "Oasis at Grand place (tourist central)", "text": "It is very disappointing, and not at all consistent with the brand. I truly hope that a senior person at RF sees this review because I want them to know that the quality of this hotel dilutes their brand in a very serious way.", "user": "treetica", "date": "August 24, 2012", "id": 138238176}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Before staying at this hotel, I would have stayed at a Rocco Forte Hotel without question. Now I will have to question whether it is a \"good\" RF Hotel or a \"bad\" one.", "title": "Top marks for a top hotel!", "user": "NYCBabeRomford", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138225720}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The Amigo is a spectacular hotel located one-half block from the Grand Place, the historic heart of Brussels, and usually the first site visited by tourists. Staff are polite and eager to be of service; the rooms are very large and elegant, with unbelievably comfortable beds and Belgium-specific artworks. (Magritte and Tintin abound.) Bathrooms feature a separate foot bath. Even though we were on the first floor (which most Americans would call the second floor), we had a quiet room with a charming view of cobblestone streets. My only complaint is that Wi-Fi was not free; in fact, it was 30 Euros a day, which I found quite steep; however, we got a daily 30-minute pass for the Business Centre, which features two computers with lightning-fast internet.", "title": "Spectacular Hotel in the Heart of Brussels", "helpfulness": 1, "user": "Dragonminder", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143085505}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Hotel Amigo is a beautiful and charming Hotel in Brussels. Their location is ideal -- very close to the Grand Place -- the heart of Brussels. The staff, including concierge< were helpful and courteous. We bought a \"chocolate\" package that included a tour of the nearby \"Museum of Cocoa and Chocolate\" which was great fun. Only sad that our stay was not longer!", "title": "Great Hotel in Brusssels", "helpfulness": 1, "user": "Chris K", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142667615}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "For my review of the \"Museum of Cocoa and Chocolate\" see my post here...http://americanconservativeinlondon.blogspot.co.uk/", "title": "Great Stay", "user": "Hellemc", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142631147}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed for a romantic get away to celebrate our aniversary. The room was small but very nicely done - plenty of wardrobe space and and very nice bathroom - bed was very big and comfortable. The staff was fantastic - so attentive and professional. Would love to come back.", "title": "Great Hotel, Noisy Location", "user": "Pat G", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 142556572}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband stayed at the Amigo Hotel years ago and was anxious to stay again since it's undergone a major renovation. The hotel, and room, were fabulous! Pricey, but worth it. Spacious room, king bed, great bathroom, nice amenities. The good news, and the bad news, is that the hotel is very near Brussels' Grand-Place and is also located on a street with 6 (we actually counted them) all-night Discos! Even with our windows closed tight and the drapes drawn, we were awoken nightly (we were there 3 nights, over the weekend) by revelers when they exited the discos in the wee hours of the morning (the discos are open 8 p.m. to 6 a.m.) who insisted on yelling at the top of their lungs. Perhaps a room on the back side of the hotel wouldn't be so bad--we thought the street view was going to be nice before we heard the late night noise. If only sound-proof windows had been used during the renovation!", "title": "Excellent hotel in perfect location", "helpfulness": 1, "user": "Jules4467", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141863805}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "This is a great hotel in a very good location for site seeing in Brussels. Very convenient to the Grand Place and to Central Station. Hotel staff was very friendly and helpful. The room was comfortable and quiet. I highly recommend.", "title": "Great hotel - great location", "user": "TRVLALOT_9", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139475183}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "A charming hotel, with great facilities for business use. By centrally located and good for sightseeing too. Rooms are tastefully decorated as with the other Rocce Forte hotels I have stayed at, in various other cities/countries. Staff are attentive, food is of a very high standard at their Italian restaurant.", "title": "Centrally located smart hotel", "helpfulness": 3, "user": "Valerie D", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139230003}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I have stayed a few times at this hotel and enjoyed it thoroughly. Stylish, comfortable rooms with pleasant staff. I think it is primarily suited to people on business with it's good central location & facilities in the rooms to use a laptop. Overall good, my only complaint would be the price as i think is a little expensive for what you get.", "title": "Great location", "helpfulness": 1, "user": "wanderluster6", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139166297}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We visited Brussels for the Flower Carpet. The hotel was the perfect location just off the Grand Place. The staff was helpful and friendly and the rooms were large, comfortable and clean. Staying at this lovely hotel really enhanced our trip. I would definitely stay there again.", "title": "Lovely Hotel", "helpfulness": 1, "user": "Cristina204", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138963304}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I've been to this hotel with my family, had a great time at the hotel it was comfortable, clean place and in great location. i received great help from one of the employees called Mark he was so kind and offered us a lot of help even out of his working hour. overly I liked the hotel but I will not book it again because the rooms where very noisy I could hear every single sound and as a family I couldn't be comfortable myself because I received warning telling me that the children are making noises so I was on my nerve and stressed out through all my 6 days in this hotel. I had to keep my children out in the street tell late midnight. I was also annoyed by the house keeping service they barge in my room many times a day. They were rude and annoying. Breakfast was very disappointing it was rather boring the same thing every day no variety of bread or fruits. One thing I forgot to say is I found blood in my pillow and in my sister as well.", "title": "DISAPPOINTED", "helpfulness": 1, "user": "Mini Mini M", "date": "August 30, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0}, "id": 138858889}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "All what one would expect from a European 5* and in a great location. Was surprised that the rooms didn't have tea/coffee making facilities but everything else was spot on. The front of house staff were particularly welcoming.", "title": "Super hotel", "helpfulness": 1, "user": "UKDavidN", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141279522}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Luxury, smart though casual hotel with extremely friendly, helpful and efficient staff. It is in the centre of Brussels right next to the Grand Place. Close too other tourist spots ie Mannekinpis and lots of restaurants. Best value for money.", "title": "Great hotel, staff and location", "user": "ChrisOosthuizen", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140360096}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We are big fans of the Rocco Forte hotels, and this hotel does not disappoint. Like other Rocco Forte properties, the concierge here was the best. We received excellent restaurant recommendations and touring recommendations and would not hesitate to use the staff for just about anything. Our room was spacious, elegant and clean, with a great view of the buildings around the Gran Place and up the hill towards the Royal Palace. The breakfast was a real treat - we especially enjoyed the local cheeses and meats on offer - and with so many great restaurants within walking distance we did not eat our other meals in the hotel. Brussels may strike many as more of a business location than a tourist location, but we found it to be a real treat. We would certainly come back, and would definitely stay in this hotel again.", "title": "First Choice in Brussels", "user": "Jim B", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140346685}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This hotel is not only in a great location, but the staff was so accommodating. The concierge managed to arrange transportation needs, make excellent recommendations for dining and shopping. When our air conditioner was not working, we were immediately moved into a room which was upgraded and cool. I can't thank them enough for their prompt attention to every detail of our visit.", "title": "Wonderful experience", "user": "Amy S", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140254598}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Had fantastic stay at the Amigo, lovely rooms, staff all attentive and helpful (more than helpful!!), location perfect, its literally opposite Grand Place (where there was a rowdy but good natured beer festival on)...look around on internet for best deals as prices can vary alot....as i say believe the good reviews....just Fab!!!!", "title": "believe all the good reviews!!", "user": "TEAMBAD", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139477055}], "location": {"country": "Belgium", "continent": "Europe"}, "stars": 5, "variance": {"poor": 25, "average": 49, "very good": 238, "terrible": 18, "excellent": 487}, "aka": "Rocco Forte Amigo", "slim_ranking": 0.020725388601, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Rocco Forte Hotels is delighted to introduce the Hotel Amigo, superbly located in the very heart of Brussels, adjacent to one of the most beautiful squares in Europe, Grand Place, close to Brussels' financial district and within easy walking distance of the antiques district of Le Sablon, Hotel Amigo provides a stylish and central base from which to explore the city."}