{"user_rating": 4.5, "review_count": 981, "name": "Hotel Nelligan", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We loved our time at the Hotel Nelligan. It's in a great location - walking distance to many of the things you'd want to see, restaurants you'd want to try, the cathedral, etc., and close to public transportation, too (we take the subway everywhere we travel, in addition to cabs, and both were very accessible from this spot). Our room was fantastic - we got an upgrade with a lovely fireplace/sitting area and hot tub - and given it was about -9 outside this was a VERY welcome surprise! The staff was incredibly helpful and the room was CLEAN (my big thing), including the very comfy bed. We also took advantage of the spa at their sister hotel down the street, which was great. I highly recommend!!", "title": "Fantastic place!", "helpfulness": 1, "user": "LJWNYC2008", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150408142}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "I first stayed at the Nelligan many years ago with my husband. I have since stayed at the Nelligan numerous for business. This hotel never dissapoints. It's in the perfect location for the hussle and bussle of Montreal in the summer, and it's cosy and romantic in the winter. The staff is always top notch and no request goes unanswered. I have recommended it to many people and have always gotten possitive feedback on my recommendation. The decor is very pretty, the breakfast is always fresh and good and the complentary drink is the icing on the cake. If you are going to Montreal, check it out. You will not feel let down.", "title": "A hotel to fall in love with...", "user": "4TravelingMartinis", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150349421}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I stayed two nights in 2006 at this boutique hotel in the heart of Old Motreal. We parked the car when we got there and left it all weekend. Everything was within walking distance. The rooms were spacious, clean , large bathroom, and the comfiest beds ever! They had at the time a wine and chese hour in the lobby each day which was fun as you can sit near the front windows and people watch.", "title": "Dream weekend", "user": "Kim C", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150348431}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We ate at the hotel resto Verses, it was good, a little pricey but presented well.", "title": "A place you wont forget", "user": "Peter A", "date": "January 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 150285130}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "I always recommend this place when people come into town and hjopefully can get a room at great deal !", "title": "Elegance and comfort in a one of a kind hotel.", "user": "Porkiechop", "date": "January 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150030908}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Wonderful welcome from the staff. We had a room on the 4th floor which was very charming (exposed brick walls, fireplace, comfortable bed, jet tub). Not a good view but we did not spend time looking out the windows anyway. Just one block from Notre Dame and very convenient to all of Old Town. Good restaurant on site and terrace bar which is also serve lunch and dinner.", "title": "Charming hotel in Old Town, Montreal", "helpfulness": 2, "user": "FillyP", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 171809941}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Hotel Nelligan was wonderful. It is very well located by the port, and the amazing old town is easy walking distance. It is definitely authentic to the culture, and you feel like you are in Europe. The only reason I didn't give it 5 stars is because my room felt a little dark because the window looked out on to a brick wall (underneath the rooftop terrace) so I didn't have a view of the city from my room. Great amenities in the bathroom and very good service. There is no parking out front so you have to have your car valet parked. The breakfast at the hotel is incredible and the surrounding restaurants are open late and also have incredible food. Absolutely perfect location and a very authentic experience.", "title": "Well located authentic boutique high-class hotel", "user": "Jana F", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171666176}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Found this great hotel in a perfect location on TripAdvisor. Lovely property, great linens in old Montreal. The staff were friendly and very accommodating. I would highly recommend this property. Loved the brick walls in the rooms and outdoor terrace garden and grill on the roof has great views of the city.", "title": "A real find", "helpfulness": 1, "user": "Bobbi L", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171341473}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "It had been a long time since my wife and I had an opportunity to go on a trip without the kids. We both love Montreal and thought that was a great location to visit. We had seen the Hotel Nelligan on past visits so decided to stay there. From start to finish it was a great experience. It's a lovely hotel in a perfect location (in the old town, but not the touristy section and a block from the waterfront). The staff were all superb and extremely helpful. The rooms were spacious and nicely decorated. Beautiful bathroom with jacuzzi bathtub and separate shower.", "title": "An outstanding experience!", "helpfulness": 2, "user": "Brad H", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171309167}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The hotel has a number of dining options. A great French restaurant, a lively bar, and a rooftop terrace with great views of Old Montreal. Can't say enough about how much we enjoyed our stay. Merci beaucoup to the staf and management of the hotel.", "title": "Well located boutique hotel", "helpfulness": 1, "user": "Linda M", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 171232496}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Be demanding with your room. We reserved a junior suite for $600 a night, and got the bait and switch! Our room was small, room 319, and faced a back alley. No sofa or sitting area, per the hotel floor plan, one of the smallest rooms. the idea was to see if we would notice. Yes they did put us in a proper room upon discussion. The hotel is really nothing special, exposed brick with contemporary furnishings. If you want to beclose to the t shirt shops in Old Montreal, it is perfect though. Admittedly, the concierges were terrific. Stay if you can get a junior suite for less than $300. Oh, and frozen bagels for the continental breakfast? In Montreal, home fo the Montreal Bagel? Really?", "title": "Beware", "helpfulness": 1, "user": "traveltoomuchToronto", "date": "August 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 172344918}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed 3 nights at Hotel Nelligan on our first visit to Montreal. Our petit suite was quiet as I had requested in the reservation. The lighting was a little confusing and we could have used more storage, but this still was a wonderful property. The bed and linens were topnotch. The location is terrific, but the most important feature is the outstanding staff. Every single person, whether in the restaurant, housekeeping, concierge, front desk,etc was wonderful and dedicated to making sure we had a great stay. They succeeded -- our stay was memorable!", "title": "We didn't want to leave!", "helpfulness": 1, "user": "janefromtexas", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172261368}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Peace of mind with parking was taken care of. The valets and concierge were extremely helpful with suggestions of activities, tour registration and suggestions of restaurants. Our room was cozy but so comfortable, great bath amenities. Very walkable to most things in Old Montreal and transit was super efficient and clean. Quiet rooms music playing in our room as we checked in. Would definitely spend the money to stay at this hotel again!!!", "title": "Fab!", "helpfulness": 1, "user": "Caroline G", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172138770}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Super wonderful spot, great location, wonderful staff, really comfortable rooms and an awesome rooftop terrace. Would definitely stay here the next time we visit. One of my favorite hotels that we have stayed in in old montreal.", "title": "Great Old Port Boutique Hotel", "user": "bznbetsy", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172095557}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This was the perfect stay in Montreal. All of the staff are exceptionally friendly and helpful. It was probably the fastest check-in I've ever experienced, but also warm and welcoming. The room was fantastic, we had a great view of the river, the jacuzzi tub was essential after a long day of walking, the bed was supremely comfortable, and the fireplace and brick walls add to a luxurious and romantic feel.", "title": "Fantastic stay!", "helpfulness": 1, "user": "JTCnSC", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171874369}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My husband and I stayed here for a weekend in March. The hotel and rooms were very tastefully decorated - modern without feeling cold. I loved our room, it looked and felt much more expensive than it was (we went during the off-season though so we got a great deal). The room, including the bathroom, was very spacious. My only slight complaint is that we got one of the inner rooms facing the hotel's inner courtyard - so we really didn't have a view, but that was fine.", "title": "Beautiful rooms, excellent concierge services", "user": "mnguyen612", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171172142}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff was great! Very attentive and pleasant to chat with. The concierge even managed to get us a very last minute reservation at the ultra trendy and very popular Au Pied de Cochon. This is what put this hotel over the top for us! We planned the trip at the last minute and so we had been calling and calling the restaurant for a reservation when we got in for the weekend but we never heard back. We asked the Concierge in the late afternoon and by the time we came back from a walk around the city, she had gotten us a reservation for that night! It was a Saturday even! I was really impressed. My husband loves records and the front desk staff made some great recommendations for us.", "title": "Great jumping off-point for Old Montreal", "user": "Tony F", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 171108347}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The location is right in the middle of the Old Town section, surrounded by great dining and some cute boutiques. If you're looking for a younger crowd/more nightlife, you should maybe look into the Mile End neighborhood but we really enjoyed staying in this area.", "title": "Great location, friendly staff", "helpfulness": 3, "user": "phay1971", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170636845}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed for a long weekend (arrived Friday, departed Monday).", "title": "Nice room and location but...", "user": "Anne G", "date": "August 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 170570939}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Our room (4th floor, overlooking Rue de St. Paul) was spacious and clean, with lots of natural light. The hotel has a very boutique, local feel - not at all like the business hotel chains so many of us have spent time in.", "title": "The Perfect Hotel", "helpfulness": 1, "user": "Frances17033", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170440284}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This beautiful boutique hotel is in the heart of the Old City of Montreal. From the first greeting to final farewell over an 8 night stay, the staff were friendly, charming and professional.", "title": "The Nelligan over Christmas", "user": "Penny_O514", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148371857}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The common areas were thoughtfully appointed, old leather couches and fireplace sitting area - lots of scope for out-of-room relaxation.", "title": "Charming Hotel in Old Montreal", "user": "Al C", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148357027}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "The rooms were spacious, very clean and thoughtfully appointed: exposed brick and dark wood decor, offset with bright white linens... fresh and cozy at the same time. Much bigger than expected. Airy & bright. Nice urban view out the large window.", "title": "Cozy, charming in old Montreal", "user": "Max F", "date": "December 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 148325823}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Great advice from the concierge about how to handle travel plan delays due to bad weather - we ended up staying an extra nite and missing an uncomfortable wait at the airport (...and we got a credit from Porter Air!!!)", "title": "Most comfortable bed in the world?!!", "user": "arundec77", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148291788}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The xmas stocking found hanging on our doorknob Christmas morning was a thoughtful and whimsical touch.", "title": "Holy Nellie", "user": "margaret k", "date": "December 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148007375}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "We stayed two nights in a nearby, and much more expensive hotel, that we found disappointing. We switched to the Nelligan for our last two nights and had a wonderful time.", "title": "Wonderful hotel. Saved our Montreal trip", "user": "michael_a_marks", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148934213}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The overall feel of the Petite Suite is significantly nicer than a nearby room costing 2x more. Between the bellman, reception, bar, restaurant, and room service, we interacted with at least eight or nine people. Everyone was wonderful.", "title": "Great hotel, pity about the restaurant(s)", "user": "Jill143", "date": "January 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148489879}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I highly recommend this hotel.", "title": "superior elegant feel", "helpfulness": 1, "user": "Rachel D", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148458317}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed here for 10 days (split into two halves) in October, and loved it. We had a petite suite because I had recently had a hip replacement, and wanted a walk-in shower. The shower was the best we have ever had--the controls at one end, the showerhead at the other, so you did not get doused in cold water while adjusting it. A large grab handle, somewhere to put the soap, and a *non-slip floor*!--small details, but how rare to find them attended to. This attention to detail was characteristic--the hotel has been beautifully designed and is a pleasure to live in. The bedroom was huge, well furnished, and well lit (though another light by the armchairs would have been welcome to those of us who read rather than watch TV). Bed was supremely comfy. The downstairs lounge, with huge leather sofas and open fire, was a great place to read after breakfast. The staff were extraordinarily helpful and welcoming (especially Dan).", "title": "One of My Favorite Hotels Anywhere", "user": "broadcast9", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148427252}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The downside was the restaurants--we asked the first night to be booked into the 'brasserie', and if that was not available, into the main restaurant. When we came down at 7.30, the young female receptionist told us, with some fluster, that the brasserie was full, but for some unexplained reason she had *not* booked us into the restaurant, which was full as well, and the result was we had to pile out on to a rainy street looking for dinner at a time when most of the local restaurants were already full. When we did eventually eat in the hotel, we found the main restaurant pretentious and, frankly, not very good--too many 'dishes for two' on the menu (and could you eat a whole roast duck between two people?), which limits choice, too much foie gras (which we don't eat, on animal welfare grounds--and who could eat foie gras with poutine?). As for the 'brasserie', it was more like a disco: the music was absolutely deafening, whether it was recorded rock or live country and western. We saw four (young) people arrive and leave withitn three minutes, apparently because of the noise. Food was adequate but not special. Never again.", "title": "Pretty little hotel in Old Montreal", "user": "Daisy095", "date": "December 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 148385377}, {"rating": 5.0, "title": "You will love this hotel!", "text": "This charming hotel is ideally located in old Montreal. The staff are very friendly, efficient and professional. They clearly work hard to ensure guests have a consistently pleasant experience no matter what you are doing during your stay. As I entered my room, they had the lighting and room temperature just so, with classical music playing. The room itself was lovely with lots of character, including a brick wall and window that opened. Their restaurant is excellent and they have a surprising well equipped gym for the size of hotel.", "user": "Wanderlust A", "date": "January 16, 2013", "id": 149799631}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Wow! This place is great! Super close to the airport and all of the important attractions in montreal. The restaurants, which were recommended to us by the front desk supervisor Mathieu, were excellent! They were also all close by, which was great considering the cold weather...The service was incredible and the whole staff was super helpful. Plus, on Christmas day, we woke to a small christmas stocking on our door knob. Can you say \"all out\"?", "title": "Best Christmas Ever!", "user": "sunset_chick101", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149129556}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We fled a more expensive and worse hotel into Nelligan thanks to a local referral and we are so grateful we moved. It is 1 block from the Basilica, 5 star location!This hotel has that warm inviting feeling as you walk in. There is always a friendly staff to greet you and they \"really\" try everything to make you feel comfortable. The room ( suite with fireplace) is the most elegant, warm, sexy room I've been in. Brick wall, wood blinds, great decor, wonderful bathroom with Jacuzzi for 2, walk in shower, great flow of hot water, very comfortable pillows and bed. Two well lit elevators and the lobby is very cozy. We sat on the leather sofas every morning to plan our day and in the evening for a drink. The bar is good, the breakfast could improve a little. I cannot finish before re-praising the friendly staff. You guys are awesome! We will be back. Montreal would not have been the same if had stayed somewhere else.", "title": "Fenomenal! I have to go back!", "user": "Cris H", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149024876}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our family of three stayed here over Christmas and loved everything about the hotel, from the spacious room, to the courteous and helpful staff, to the fact that it's named after Montreal poet Emile Nelligan. The hotel atrium was a comfortable place to relax by the fireplace with drinks and a cheese plate. (Best after a 2 hour walking tour in 16 degree weather.) We stayed in room 306, not having read the warnings in time about the street noise. It did get a little noisy around midnight or so but the revelry didn't last long and we all got a good night's sleep. We highly recommend the hotel.", "title": "Great location, helpful staff", "user": "dsm3", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149021617}, {"rating": 2.0, "stay_parameters": "Stayed December 2012", "text": "This was my second visit to the Nelligan and it will be the last. When I booked the room for my December holiday , I spoke to the front desk about wanting a quieter room than the last visit, away from the street as Montreal is certainly a city that never sleeps( which is great, but I wanted some shut eye). I opted out of a suite because the only available suite was on the street side , so I reserved a smaller room, but I knew it would be quieter. Two days prior to my arrival, I received an email from the manager saying that I had been \" upgraded\" to a suite as their had been an \"incident\" in my reserved room and I would not be able to stay there. I assumed that because I had given the hotel specific instructions regarding not wanting to be street side that this would not be an issue. The room that they assigned us was precisely the very one that the reservations person and I had spoken of when I was making my initial reservation and I had opted out of this room (corner suite, street side).", "title": "Trying to get a good nights sleep at the Nelligan is like trying to get a good night's sleep as a patient in a hospital!", "helpfulness": 1, "user": "penelope1961", "date": "January 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 148963358}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "A friend recommended this hotel to me, but I found it dismal and uninviting.", "title": "Noisy and disappointed!", "user": "citygirlcountryheart", "date": "July 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 170226587}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "As I recall, it's decor was mostly black with touches of red, and it was dark and depressing. I would not stay here again. As a matter of fact, I started having a bad feeling about the entire Old Montreal area as a result of staying here. There was nothing memorable about this hotel. It was small, but did not have an intimate feeling that you find in other small hotels. And the decor made me feel rather ill, as if I was about to have a headache at any minute. I did not feel relaxed.", "title": "Best hotel experience I've had!!!", "user": "SRlovestotravel", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170064162}, {"rating": 5.0, "title": "Perfect", "text": "But a problem even worse than the decor, was the noise coming from the street and bar which was directly below my room. I recall it was a Friday night when I checked in, and the bar was jammed packed, with people partying and spilling out onto the street. My room was on the 2nd floor! The partying went on until about 2 or 3 a.m., and I could not sleep at all.", "user": "KansasSandi", "date": "July 30, 2013", "id": 170057425}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The only plus were the two free computers on the main floor with internet service.", "title": "A real treat!", "user": "Maine1234", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170029844}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The entire hotel-experience left me with an unhappy feeling.", "title": "Perfect hotel for Old Montreal", "user": "LocoSunDial", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169975496}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 4, "variance": {"poor": 28, "average": 40, "very good": 188, "terrible": 12, "excellent": 713}, "aka": "Nelligan Hotel Montreal", "slim_ranking": 0.00588235294118, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Europe at your doorstep. A building that’s over a hundred years old, traditional brick walls, French cuisine, Hôtel Nelligan exudes European elegance. 105 luxurious rooms, incomparable charm and a unique experience await you."}