{"user_rating": 4.5, "review_count": 157, "name": "Hotel Posada de Don Rodrigo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Lovely place they included breakfast for us....just ask! Fabiola at the front desk works all the time she is very friendly and speaks great English. The grounds are beautiful the rooms are bigger the farther back the quieter although we were in the front and it was kinda fun to be in on the action in the street. The room keys are big old and fun. I would stay again!", "title": "Beautiful!", "user": "Hopesallthings", "date": "January 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 150025832}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel was in a great location - easy walking to many places in Antigua (a fabulous town). The staff was very friendly and helpful - BUT - before you check into your room, you might want to check it out, because there is a corridor of rooms that has windows onto the street and it is like staying at a truck stop. VERY noisy. Our party had two rooms -the other room didn't have street noise,but people stayed up late and talked LOUDLY at the charming seating areas that were all over.", "title": "Delicious fresh tortillas for breakfast!", "user": "SFOglobetrotter", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149838973}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Other than that, beds were comfy enough - hot running water - worth a stay.", "title": "A friendly, unique hotel in a beautiful city", "user": "Claire B", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149007696}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed at Posada de Don Rodrigo for a weekend. It was our first time in Antigua and the hotel was ideally located in the centre, near bars and restaurants and a very short and easy walk from the main square, catherdral and convent. The hotel was spotlessly clean and the staff very friendly and helpful, we had breakfast in the hotel and it was excellent, served on a lovely veranda and with plenty of choice. The rooms are set round internal coutryards, ours was decorated in a traditional colonial style, it was a good size with solid wood furniture and a modern bathroom. The hotel itself was a calm oasis with lovely courtyards brimming with flowers and fountains. Our room backed on to the main street, which was pedestrianised for the weekend. We didn't mind the street marimba player who set up outside our window, but if you did want a quiet siesta I can see the marimba and drums that played from midday to about 5-6pm might be an issue! Overall I would thoroughly recommend the Posada de Don Rodrigo, it was the nicest, friendliest and most characterful hotel we stayed in during our visit in Guatemala.", "title": "Perfect!", "helpfulness": 1, "user": "Ephilipdoolan", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148462213}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "I can honestly say that I do a lot of travelling, but I do not frequent a lot of high end hotels. Location, location, location! The hotel is right next to the famed arch and about a 45 second walk to the central park. The breakfast included with the room was incredible and had many options. The colonial atmosphere is perfect and so it the service! Our favorite part of the hotel was the gardens and drinking cocktails on the roof patio at sunset. You can drink and enjoy the garden and restaurant even if you are not staying there so make sure to at least stop by!", "title": "Excellent Location, Lovely ambience", "user": "Naveen342", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 148439010}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This hotel has a great location right in the middle of Antigua. It is very pretty with courtyards that are beautiful and well maintained. The staff was very friendly helpful when needed. The problem we had was our bed was not very comfortable, the mattress was old and we kind of sunk into the middle of it. Also, our room was above the restaurant so we heard the clanging of silverware and china relatively early in the mornings as they set up. On the flip side, our room had a great view of Volcan Agua, but when I am on vacation I don't spend a lot of time in the room. Overall a very nice hotel but our specific room was not the best.", "title": "Charming hotel, great location, but noisy room, uncomfortable bed", "user": "EasyGoingMidwestGuy", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 157262358}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "This is the hotel to choose while in Antigua! The music, the gardens, the light, the atmosphere, the little touches, the friendly service from the staff.... the rooms, the security, nice bathrooms... just everything as you would dream for the magical Antigua!", "title": "Lovely Hotel, Great Location, Friendly Staff, Nice Bar & Restaurant!", "user": "ColibriSMA", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154689402}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Breakfasts were very good. We enjoyed the bar on the second level terrace one evening, the vistas of the volcanos were one highlight of our trip. We had dinner at the hotel one night and had traditional dishes! Tasty and different. A group of folk dancers came at the end of our dinner. Colorful and fun, not intrusive, but welcoming!", "title": "An old gem renewed", "helpfulness": 1, "user": "GrammyBonnie", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154518102}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "There was marimba music in the first courtyard of the hotel. The musicians were a treat to hear!", "title": "Very pleasant stay", "user": "otroviaje", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153352578}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "Overriding all this ambiance was the super service and friendliness of the entire staff. Everyone was knowledgeable and willing to share their information.", "title": "Superb old spanish colonial style", "user": "Alfrx", "date": "February 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 153187415}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Wonder assistance to non Spanish speakers. Rooms on the street side can be noisy due to the tires of vehicles on the cobble stone streets. Breakfast on terrace a delightful experience. All staff was exceptionally helpful. Dinner in restaurant was good if you don't feel like exploring when you 1st arrive in Antigua.", "title": "Great Experience", "user": "Mayantour", "date": "February 16, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152285710}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The location and service of this hotel cannot be beat in Antigua. Centrally located, you can walk just about anywhere in the city from here. The staff was very attentive and helpful, with walking maps and good directions. Definitely eat in the restaurant for wonderful local food and great service. I would stay here again!", "title": "Bueno posada", "user": "Guatraveler33", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151561527}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "This is a lovely, expansive, old world hotel with various areas and types of rooms. Avoid the courtyard where the musicians play or you may not get the sleep you wish. Also, some upper floor rooms overlook the kitchen. The rooms on the inner courtyard - 204 for example and lovely. The hotel is filled with old timbers and authentic hardware. The staff is welcoming and helpful.", "title": "Central Hacienda", "user": "e5000e", "date": "January 23, 2013", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0}, "id": 150445840}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "I have stayed at the Don Rodrigo on numerous occasions and am always impressed by the beauty of the place. This visit I and my buddy (who travel to Antigua after fishing in Puerto San Jose) were given room 102 which turned out to be on the side street next to the hotel. The noise was disturbing and we were gladly and expeditiously moved first thing the next morning. (If you are a light sleeper avoid the exterior rooms to the right side of the court yard.)", "title": "Beautiful Place", "user": "ULKYDOG", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150332847}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "As I am a frequent visitor I also negotiated a discount and the comp breakfast. ( try the macadamia pancakes and the fruit plate both are magnificant!)", "title": "Request Room 116, You'll Love It", "user": "SrLister", "date": "January 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150225062}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We have family in Guatemala, but we love to stay at the Posada as a way to take some time off for ouselves. The ambiance is marvelous. All of the plantings and gardens are very well maintained. The location couldn't be better. The central plaza is 2 blocks one way and a great artisans market is 3 blocks another way. The staff and service are excellent. We have come to know some of them by name because they are so friendly. The furnishing in the rooms appear to be antique, but could be really good knock-offs. Either way they have maintained the colonial charm of the place. I often like to just sit outside my room day-dreaming about what it must have been like to live in such a place during it's heyday as a family home. Sometimes I'm a family member and others I'm one of the servants. Frequently we go for lunch or afternoon tea just to hear the marimba group play. The back gardens are a wonderful setting off the dining room. And the roof terrace is a lovely place to relax and watch the volcanos, which sometimes give off little puffs of smoke. The prices of the rooms and food is high, but worthy of being a treat to yourself.", "title": "A lovely return to a colonial past.", "user": "Anne R", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148117066}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed here at the recommendation of friends, and were absolutely delighted. We had a marvelous room, decorated tastefully, off of the courtyard. We were initially concerned that it was too close to the restaurant, but that turned out not to be a problem, in spite of other reviews to the contrary. Terrific value, marvelous breakfast, good value, we thought. The restaurant food is not like fine dining in New York, but is better than average for the town, although rather pricey; we found better food and deals elsewhere within a few blocks. This place reeks of charm, and is a hotel we will never forget.", "title": "fabulous place, in the center of everything, great food and ambiance.", "user": "jdennisg", "date": "December 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 147212520}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed at this hotel as part of a tour with Friendly Planet. Nice hotel that was apparently a former residence and certainly one of the historic buildings in the area. Actually had room keys (kind of a skeleton key) to lock the room door. Big bathroom with a nice shower. Rooms weren't very quiet but that wasn't really an issue. Near the town square and plenty of good restaurants. Breakfast at the hotel was quite good, with local fare and fresh tortillas being made right there in front of you.", "title": "Unique Getaway in the middle of town", "user": "Curtis S", "date": "December 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 146814962}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The hotel is conveniently located within a few blocks of the town center. It Is built around a courtyard, which, when not filled with people, is quite pleasant. The rooms are modest sized, but extremely dark. The restaurant offers both indoor and outdoor dining. The food is good, but not outstanding. The issue that concerned us most was the hubbub of activity, particularly noticeable on weekends. The active street life (which we very much enjoyed) spilled into the hotel courtyard, which also serves as a favored locale for weddings and celebrations. Marimbas play from noon until five-ish, precluding the possibility of a siesta or reading in the courtyard. Our stay would have been far more enjoyable were it possible to find quiet and solitude.", "title": "Great location, a few issues", "helpfulness": 1, "user": "Steve_Strom", "date": "November 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 145559688}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Absolutely loved this hotel- the rooms are full of character, as are the grounds.The bathrooms are of a good standard and the rooms are clean,although there's not a lot of wardrobe space as the TV shares the cupboard (as seems to be the norm in Antigua!) The breakfast was fabulous,the restaurant looks out onto a pretty garden and the French toast was the best I've ever had. The staff are pleasant and helpful and most speak at least a little English. Thoroughly enjoyed our stay!", "title": "Charming and comfortable", "user": "Karen W", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 145476210}], "location": {"country": "Guatemala", "region": "Sacatepequez Department", "continent": "Central America", "city": "Antigua"}, "stars": 3.5, "variance": {"poor": 3, "average": 16, "very good": 52, "terrible": 1, "excellent": 85}, "aka": "Posada De Don Rodrigo Hotel Antigua", "slim_ranking": 0.225352112676, "description": "La Casa De Los Leones, today Hotel Posada de Don Rodrigo conserves its ambiance that characterizes a colonial and antique home in Guatemala. Restored between 1968 and 1971 Hotel Posada de Don Rodrigo is located just 2 blocks from the Central Park and in the heart of La Antigua. Its colonial design and ambiance will take you back in time. The hotel has 41 rooms each one of them wit their own history and uniqueness, will allow you to experience a stay that will be like no other."}