{"user_rating": 4.0, "review_count": 58, "name": "Hotel Mac Rae", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I have stayed at this hotel several times. I always go in winter to avoid high prices and crowds. They usually have a special for Monday through Thursday for winter months, but you have to ask about it - it is not published. This year the special was any room, including ocean from rooms, just $59.", "title": "My Favorite Hotel in Avalon", "user": "Tomcod", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 25210557}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "I always stay in one of the four ocean front rooms. Over the years, I have done every kind tour imaginable in Avalon, so now I just go to relax. I usually just sit at the window with a good book and watch the world go by.", "title": "Hotel Mac Rae...Great Getaway!", "helpfulness": 2, "user": "San_Pedro_Lady", "date": "April 24, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 15294260, "likes": {"liked": "— Ambiance of ocean view room", "disliked": "— Steep stairs to access hotel, both front and back entrances"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The windows are right over the main town walkway, so it is a little noisy sometimes. But this town goes to bed early, so you will be able to sleep well. Most likely you will be woken in the morning by the sound of those little plastic luggage wheels being dragged over the cobblestone street, when people are rushing to catch the morning boat back to the mainland.", "title": "Not bad if you can get past the noise", "helpfulness": 2, "user": "morhartsincali", "date": "April 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 14868452}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "But the views are the best Avalon has to offer, and makes putting up with the noise worthwhile.", "title": "Small, older rooms - great deal", "helpfulness": 1, "user": "AL-the-squid", "date": "November 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 10784638}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Also, you can run down the stairs and pick up a pizza at Antonio's or burritos at Erics and take the food to your room and have the best ocean view table on the island for a few dollars.", "title": "Aye It's A Good Scottish Name", "helpfulness": 1, "user": "Balmacara", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 8419876, "likes": {"liked": "— Near beach", "disliked": "— Room too small and noisy"}}, {"rating": 4.0, "title": "Good Job - Hotel Mac Rae", "text": "This year we decided to go to Catalina for a couple of days.", "helpfulness": 3, "user": "macrae", "date": "September 2, 2006", "id": 5763330}, {"rating": 4.0, "title": "Memorable TIme!", "text": "Opon review Hotel Mac Rae seemed like the best choice as far as rates & location. We booked reservations and every thing was good to go. Then things started falling apart & it started to look like we would not be able to go to Catatlina at all :(", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 30, 2006", "id": 5413314}, {"rating": 5.0, "title": "Great place close to everything", "text": "I do not know how many times I had called to change different dates,rooms, availablity, etc. Hotel Mac Rae & staff were able to make everything work out - Good Job.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 25, 2006", "id": 5382592}, {"rating": 5.0, "title": "Convenient loaction and great value", "text": "This is the first time me and my wife have been to this hotel and Catalina Island. I have heard both positive and negative comments about all the hotels on Catalina and was in a fix as to which hotel to book. This is the only hotel that had a higher number of positive comments and is right by the beach..So I booked the room there for the memorial day long weekend.", "helpfulness": 18, "user": "nimchop", "date": "May 2, 2006", "id": 5026526}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "We had a warm welcome by one of the lady at the front desk who checked us in. The room was a lil small and even the bathroom was not so spacious. No telephone (who needs them when u r on a vacation! :) ). We could rent free videos, free beach towels, and even after we checked out, we could use one of the guest showers. They had free continental breakfast also!", "title": "In The Middle Of Everything....", "helpfulness": 4, "user": "SanDiego", "date": "April 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 4956246}, {"rating": 4.0, "title": "Pleasantly Surprised", "text": "Me and my friend stayed at this hotel during the off-season and had no opinions about it. We were very pleasantly surprised to see that it was right on the main street, steps from the water. The room wasn't fancy but clean and actually quite charming with tropical decor, and old-fashion tiles and a skylight in the bathroom. The front desk people were very nice and helpful. There is a bar downstairs but the music wasn't bothersome at all. Overall, very good experience and great value for the money. This is a definite go-again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 23, 2006", "id": 4498887}, {"rating": 1.0, "title": "Fogetaboutit", "text": "BECAUSE of it's central location, DO NOT book a room overlooking the harbor, at least on a Saturday night when the karaoke singers and drunks feel like they're in the room with you. We were up all night. When we complained the next morning, we were told that the reservation agent warned us about the noise...which she didn't.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4013770}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Do yourself a favor, find a place even one street off the main drag.", "title": "Excellent Hotel", "helpfulness": 10, "user": "tod124", "date": "August 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3768033}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Looking at all these recommendations, I suspect most are plants. The hotel is shabby, run-down and over-priced.", "title": "Nice Hotel", "helpfulness": 6, "user": "xriariceex", "date": "June 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3610021}, {"rating": 5.0, "title": "Fantastic", "text": "My wife and I went to Avalon on Catalina Island as we've always wanted to visit the island. I must say, it's paradise on earth and if you haven't been I'd make some plans. We checked various websites and decided to stay at the Hotel Mac Rae, which is right on the harbor. The reviews we read were not wrong...the place was immaculate and the staff was more than courteous. This hotel is a bit older and has apparently been in the Mac Rae family the entire time. The room was cozy and spotless though, with an incredible view of the harbor and the small beach right there in Avalon. They have a continental breakfast, ice is available and there is a secure storage area for your luggage if you're staying in town a while after you check out. In a nutshell...we'll definitely be back and we highly recommend the Hotel Mac Rae.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 5, 2005", "id": 3334937}, {"rating": 1.0, "title": "Be Careful", "text": "Please be careful when booking accommodations at this hotel. They did not honor the pricing and pricing dates (high season/low season prices and dates) listed on their website. They charged high season prices for my entire stay even though part of my stay was, according to their website, during their stated low season dates. Further, when I cancelled the reservation well in advance (10 days in advance) of their 72 hour notice, I was still charged a $25 fee which was applicable only if I'd cancelled 72 hours of my arrival date. Needless to say, I will not book a reservation there again.", "helpfulness": 1, "user": "GTurner", "date": "June 14, 2007", "id": 7848922}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed midweek and asked for a room in back beacause we wanted quiet. Our rate was only $55 a night for a double. It is still off season in begining of May. We stayed day before fire. It was very hot when we were there close to 97 degrees. We had a/c and ceiling fan going so it was much nicer in room than outside. We arrived at 11am and room was ready so we did not have to leave luggage with desk just went to room. The staff were all very nice. I brought muffins with me beacause for $55 on Catalina I was not expecting much for cont breakfast. It looked like they had small muffin and bagals and coffee and orange juice but it looked like people were going back for seconds .We took our cell phone so I did not notice there was not a phone. There were about 50 channels on our tv There was also a pleasant courtyard but courtyard has no view. I was really happy with room for what I paid for it. I met a woman who was staying at another hotel on same block and was paying $175 for a single with no view, This is not the Ritz but I didn't feel I paid too much for room.", "title": "Had a good time", "helpfulness": 3, "user": "sandy12", "date": "May 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 3.0}, "id": 7597605, "likes": {"liked": "— price", "disliked": "— stairs"}}, {"rating": 1.0, "title": "Didn't expect much, got less", "text": "We had been warned to be prepared for scarce amenities during our visit to Catalina. We travel worldwide and so expected something European in nature.", "helpfulness": 3, "user": "smeeks2000", "date": "May 11, 2007", "id": 7588704}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "I understand limited space. I understand limited frills (no phones, bathtubs, internet connection, expanded cable). I even understand staff that is not trained by mainland standards.", "title": "Great place to Stay!", "helpfulness": 4, "user": "Lalevens", "date": "September 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5893992, "likes": {"liked": "— Everything", "disliked": "— Cna't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "What I didn't understand was cheap threadbare towels, sheets that were uncomfortable to sleep on, stale breakfast pastries and watered down juice.", "title": "Great value", "helpfulness": 5, "user": "Beachgirl82", "date": "September 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5892723, "likes": {"liked": "— Clean room, friendly staff, good value", "disliked": "— nothing!"}}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 8, "very good": 19, "terrible": 6, "excellent": 22}, "aka": "Mac Rae Hotel", "slim_ranking": 0.714285714286, "description": "The 4th generation Mac Rae family invites you to our centrally located beachfront hotel. Our hotel features panoramic ocean view rooms, continental breakfast, an open-air courtyard, complimentary beach towels and DVDs, after check-out shower facilities and luggage storage. All rooms are non-smoking and offer air conditioning, wireless internet, cable TV/DVD, and hair dryers. Come and enjoy our relaxing, quaint Mediterranean atmosphere right on the beach, in the very heart of Avalon."}