{"user_rating": 5.0, "review_count": 931, "name": "Hotel Drisco", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "My wife and I just returned from our trip to Wine Country and San Francisco. We stayed at the Hotel Drisco the first night we got into San Francisco and then for 2 nights after coming back from Sonoma and Napa. We can't say enough good things about the staff (who were extremely helpfull, knowledgable and friendly), the hotel (clean, classy and great location) or the area the hotel is in (quiet, beautifull views and safe area).", "title": "An A+!!", "user": "ChattaGuy", "date": "July 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5446272}, {"rating": 5.0, "title": "Can't wait to return!", "text": "We will stay there again the next time we go back to San Francisco, without hesitation!", "user": "A TripAdvisor user", "date": "June 30, 2006", "id": 5413442}, {"rating": 5.0, "title": "My First Impression", "text": "-Brad S.", "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5351119}, {"rating": 3.0, "title": "Nice, but you can hear the other guests", "text": "We spent 3 wonderful nights at this hotel and could not fault it. It is a beautiful hotel in a wonderful part of town. This hotel is in a residential area in the Pacific heights area so its location may not appeal to everyone but we loved it.", "user": "A TripAdvisor user", "date": "June 12, 2006", "id": 5335811}, {"rating": 5.0, "title": "{ar Excellence!", "text": "We were travelling with a 2 year old and this is the first hotel where we have ordered a crib to have it waiting for us nicely made up in the room.", "user": "Isaac555", "date": "June 6, 2006", "id": 5316730}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed in a great downtown hotel on our only visit to San Francisco 10 years ago but had enjoyed a walk through the Paciifc Heights neighbourhood and decided to search there for hotels for this trip.", "title": "A real home from home", "helpfulness": 6, "user": "Spikey99", "date": "October 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5921449, "likes": {"liked": "— location", "disliked": "— room view"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The Drisco best suited our requirements and we weren't disappointed. Very comfortable and friendly with good breakfast. Real coffee, including decaf, and a large variety of tea bags/hot water always available in cozy lounge with portable cups/lids also available if you want to take to your room. We also enjoyed the early evening wine/canapes but, unfortunately, could not always make it back in time as we had lots to pack in to each day. We had a deluxe room which was spacious and well appointed, as was the bathroom. We did originally request a city view (if possible) but got a courtyard view which was fine as we were on the top floor so it was quite light and we weren't planning to spend any time in there anyway (we didn't bother to enquire whether it could be changed). The hotel also provided some very useful information sheets on sightseeing, activities etc.", "title": "Wonderful Find", "helpfulness": 3, "user": "ESPN", "date": "October 4, 2006", "detail_rating": {"business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5908563}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "We had no problems staying away from the main activity. We obtained a 3-day Muni pass and found the area well served by buses, either one or two blocks away and it was nice to retire to the peace and quite of such a lovely neighbourhood at the end of the day. We also found nice restaraunts and bars locally and enjoyed strolling past the elegant houses.", "title": "Quiet and restful upscale hotel removed from city noise", "helpfulness": 4, "user": "Marseus", "date": "October 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5907209, "likes": {"liked": "— location", "disliked": "— the simple bathtub"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2002, traveled with family", "text": "The Drisco/Pacific Heights was a real home from home, albeit rather more elegant than our own home and neighbourhood!", "title": "Wonderful family reunion", "helpfulness": 2, "user": "pisces143", "date": "October 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5895799, "likes": {"liked": "— Nothing stands out - it was very attractive and low keyed", "disliked": "— n/a"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The hotel is found among the residences of Pacific Heights", "title": "Like Sleeping in Grandma's Attic", "helpfulness": 4, "user": "LAC1", "date": "September 27, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 5883764}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My wife, daughter and I stayed at the Hotel Drisco last week. We had never been to San Fancisco. Being from Indiana we wanted to take our daughter somewhere we had never been, before she went off to college in a few weeks. San Francisco was the right chose and the Hotel Drisco was the perfect place to stay. The staff is the friendlies we have ever had. They gave us great advise on the sights, booked our reservations for dinner every night and even help with moving our car when the streets had to be cleaned. After the first day I was always addressed by my name. I don't know how they remembered, but they did. Pacific Heights is a great area of town and we always felt safe in the neighborhood. I would highly recommend this hotel for any occasion. Families, Business travel or a romantic getaway.", "title": "Nicest staff on earth!!", "helpfulness": 9, "user": "Lintontraveler", "date": "August 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5603831, "likes": {"liked": "— Friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My wife and I have visited SanFrancisco many times and have stayed at many differant locations and hotels. The Hotel Drisco was heads above the rest. Beautiful room, spacious bathroom, and a beautiful view. Very relaxing atmosphere. Beautiful location in a very safe upscale residential neighborhood. Outstanding service. Very friendly and accomodationg staff. Easy parking on the street just steps outside the door. We will always be staying here when visiting San Francisco.", "title": "Hotel Drisco is the Best", "helpfulness": 8, "user": "steveh1", "date": "August 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5562622, "likes": {"liked": "— cleanliness, relaxing, safe", "disliked": "— beds were a bit hard"}}, {"rating": 5.0, "title": "My personal pied a terre in SF", "text": "My experience at Drisco started 3 years ago and since then every year I go back I feel at home, located in a beautiful residential area, gves the proper surrounds to relax after a sightseeing day or working day, It´s style and touch of class make it special , The attention of all the team make me feel a queen and the privacy gave me the space to feel on my own but pampered, its one of the jewels I expect to find when I travel and that make me come back to the same place like a small part of home at Drisco... I am always looking to go back and enjoy the wondeful attention I get there and warmth,,,, that make me feel so good 1!!!!!,, Evangeline..", "helpfulness": 4, "user": "Eulalia", "date": "August 5, 2006", "id": 5560715}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Loved eveything about the place except that there were no earplugs supplied for those of us staying on the lower floor. SF Marathon was the next morning and we heard the couple above us preparing to go and watch it at 4:45 am-complete with toilet use, talking, dressing, shoe droppings, walking around and finally leaving the room.", "title": "Bring your earplugs...", "helpfulness": 6, "user": "foofpoofkazzam", "date": "August 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5535230}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "Would definitely stay there again but will bring earplugs...", "title": "Favorite place in San Francisco", "helpfulness": 94, "user": "WillyJ", "date": "July 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5528453, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 1.0, "title": "Terrible", "text": "We booked this hotel based on reviews here but were very disappointed.", "user": "A TripAdvisor user", "date": "June 1, 2006", "id": 5289847}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "This is not a hotel but really a guest house, B+B style place. If you like to feel looked after and comfortable then this is not the place for you. It is an old house so everything creaks, this may appear charming but at 4am in the monring if anyone moves it will be heard and wake you up. also the hotel has no air conditioning. Alot of houses in San Fran don't have air conditioning due to the cool weather but most hotels do. Even average hotels here in the UK will have air conditioning and its colder here than San Fran. So if you want some air you have to open the window which ensures you will be woken by the street noise, cars etc. The rooms are very small so they do get stuffy easily so you have to open the window.", "title": "Two Thumbs Up", "user": "Tackle", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5264885}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The location is also not great. Pacific Heights is a very nice suburb but it is not within walking distance to Union Sq or Fishermans wharf so you have to taxi everywhere. There is no taxi stop nearby so you have to ask the front desk to ring you a taxi every time you want to go somewhere.", "title": "Excellent hotel in an off the path location", "user": "Russellicious", "date": "May 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 5231785}, {"rating": 5.0, "title": "Very Nice! Great staff! Bargain!", "text": "For a B+B guesthouse it would be of a good standard and the breakfast is very impressive in a lovely room, but it has hotel prices so is totally not worth it.", "user": "A TripAdvisor user", "date": "May 18, 2006", "id": 5148977}, {"rating": 1.0, "title": "Extremely Disappointed with El Drisco", "text": "We didn't see it until too late but the Lonely Planet calls it a \"drastically overpriced option\".", "user": "GPC", "date": "May 17, 2006", "id": 5147243}, {"rating": 5.0, "title": "Frisco Drisco", "text": "The Hotel Drisco was super-accomedating, they upgraded my hotel room free of charge. There was an excellent breakfast spread in the morning with the N.Y. Times.", "helpfulness": 7, "user": "edubbles", "date": "November 7, 2006", "id": 6081419}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I just returned from a 3 night stay with my husband and my parents. There are only great things to say about this hotel. The rooms were charming, clean and very comfortable. The common spaces invited you to relax while reading the morning paper or over mid-afternoon tea. The staff was welcoming and very helpful. I can't say enough about the location. It is the perfect spot for seeing some of the the most breathtaking views of the city. Being so close to Union and Fillmore Streets made it easy to find a variety of great restaurants nearby. I would highly recommend this hotel.", "title": "Simply Wonderful", "helpfulness": 12, "user": "jroman", "date": "November 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6056909, "likes": {"liked": "— Location, casual/welcoming decor, free on-street parking in the neighborhood", "disliked": "— could use some more updated fitness equipment"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Hotel Drisco was all that we expected and more. We had been told of its ambience and charm - and it certainly had both of those. We were meeting friends for the weekend and exploring San Francisco for the first time.The staff was extremely helpful with directions and recommendations for restaurants. The evening wine and cheese were an elegant touch. Our friend enjoyed the nightly cookies that were part of the turn down service. And the freshly squeezed orange juice with the morning breakfast was as good as we have here in Florida. Thanks to Hotel Drisco, our stay in San Francisco was memorable.", "title": "Fabulous Stay!", "helpfulness": 6, "user": "Matuz", "date": "November 2, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6049464, "likes": {"liked": "— elegance, charm of hotel, location", "disliked": "— having to park on a steep hill"}}, {"rating": 4.0, "title": "Great place for wedding families to stay", "text": "My wife and I used Hotel Drisco three years ago for our families during our wedding weekend. Everybody loved the smaller, more intimate setting and, of course, the location at the top of Pacific Heights. Walk one block to Broadway and you can see the entire Bay... Golden Gate, Marin headlands, Treasure Island, and Alcatraz. We have since moved from the Bay Area but usually stay at Hotel Drisco when we visit.", "helpfulness": 3, "user": "phiderson", "date": "October 29, 2006", "id": 6027423}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Brilliant hotel with staff to match. This is a great location and close to all you want to see in SF. The only issue is the parking but this appears to be a SF thing. The room was excellent and the front desk very helpful and knowledgeable - try the restaurants they advise it's worth it. The 4 nights we were there were the best out of a 3wk tour of California which included 3 nights in the Venitian in LV. The hotel has a drinks reception 5.30-6.30 which was great to meet fellow guests informally. A great place to relax and unwind with 5 star service to match.", "title": "Excellent!!!!!!", "helpfulness": 7, "user": "kenthewizard", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6015203}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We stayed at the Hotel Drisco in celebration of our daughter's law school graduation. Having visited San Francisco numerous times over the last thirty years, we have finally found a home away from home. Located in a quiet, safe neighborhood perfect for strolls and views of the bay, the Hotel Drisco has an extremely friendly, helpful staff and a European atmosphere. We stayed with our adult son in an airy two-room suite much larger than most. We were not prepared for the cool weather and requested heat for the room. In no time, a portable heater was delivered which took care of the problem beautifully. We recommend the Hotel Drisco without reservation.", "title": "Thank you Trip Advisor", "user": "AIB1", "date": "July 29, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5524276}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "When I booked my holiday, the Drisco was your top rated San Francisco hotel. I am sad to see it has fallen to 6th position since. It deserves to be back at the top. We had an awful 24 hour flight thanks to American Airlines and its bungled booking system. We were so relieved that we had booked the Drisco. Their driver was wonderful and sorted out all our arrangements with regard to delays while we hung around in Dallas and Chicago. He picked us up from the airport at 12 midnight when we were past caring if we arrived in San Francisco or not. And then when we arrived at our destination, we had the most beautiful room which was ready and waiting with sheets turned back ready for us to fall into a deep sleep. I am so glad we chose such a wonderful hotel. It was like home from home and the attention to detail and helpfullness of the staff (particularly Roberto the driver) were very much appreciated. I have mentioned this hotel to all of my friends who live in California, but most of them already know the Hotel and hold it in high regard. What more can I say ??", "title": "Perfect location", "user": "Jane&Bob", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5509759, "likes": {"liked": "— Location", "disliked": "— Not having an ensuite bathroom"}}, {"rating": 5.0, "title": "Superb stay at the Drisco", "text": "We chose this hotel for its convenient location in Pacific Heights. We got so much more than we bargained for with a lovely breakfast, fun happy hour and terrific staff who bent over backwards to help us. This is a wonderful place that we will most certainly visit again.", "user": "Bubbles5678", "date": "July 13, 2006", "id": 5462596}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "When we travel to San Francisco, we usually stay in Union Square. This past time we thought we would stay away from the crowded streets and find more of a neighborhood hotel. The Hotel Drisco is what we found and are so happy that we did. Our stay was very pleasant from the time we arrived till we left. It was a record breaking heat wave when we arrived and the front desk greeted us with wet towels to refresh ourselves. We were early, but they were very nice in accommodating us. The breakfast was more than ample and the wine in the afternoon such a nice treat. The front desk was very helpful and always friendly as was all the staff. The neighborhood is very hilly but we love to walk and found it to be a good workout as well as a beautiful area to explore. You are walking distance from Fillmore and Union Streets with their restaurants and boutiques. The hotel is also walking distance to The Presidio where you can walk down to Crissy Field. My concern was the fact that they had no parking garage, but the staff assured me there would be plenty of parking and I never had trouble finding a space next to the hotel. We will definitely stay there again.", "title": "Great Location", "helpfulness": 1, "user": "Butcher.T", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16880172, "likes": {"liked": "— the location"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This one is not to be missed! Everything about this hotel is wonderful. The decor, the bedding, the staff, all amazing.", "title": "Wonderful!", "helpfulness": 3, "user": "sjmacdee", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16697233, "likes": {"liked": "— The style", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "It's in one of the nicest neighborhoods in SFO, and is just a ten minute bus ride from everything. I know, I don't usually ride buses either, but in SFO they're great.", "title": "Loved the Hotel Drisco", "helpfulness": 3, "user": "OzTraveller20", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16547487, "likes": {"liked": "— Lovely staff, posh Pacific Heights location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The restaurant recommendations were perfect, and within walking distance of the hotel.", "title": "Fabulous European Style Hotel in San Francisco", "helpfulness": 1, "user": "Redmango43", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16467244, "likes": {"liked": "— The look and feel of hotel and the friendly staff", "disliked": "— A slightly noisy heater"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "If you're going to be in SFO, you owe it to yourself to try the Drisco.", "title": "Bring on the heat wave - Hotel Drisco does not disappoint!", "user": "mouseRD", "date": "May 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16368355, "likes": {"liked": "— The spacious room & the neighborhood of Pacific Heights", "disliked": "— Sleep compromised by having upstairs neighbors."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband and I stayed at the Hotel Drisco Apr 18 - 21, 2008. Before booking over the phone, we reviewed local hotels extensively. Priorities to us were value, tranquility, and personalized service. The hotel excelled in all.", "title": "Service Plus!", "user": "BastyCalgary", "date": "April 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15239293, "likes": {"liked": "— size, history, elegance", "disliked": "— charge for bath amenities"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "From the moment we arrived, hospitality plus was extended. We were able to check in early, and were given advice where to eat in the neighbourhood. Marti, concierge extraordinaire, suggested that we shop in the Union Street area after lunch. We did, had an extraordinary time with retailers who went the extra mile, and fell in love with Pacific Heights.", "title": "Wonderful Pacific Heights Gem", "user": "tammigop", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15013332, "likes": {"liked": "— Neighborhood", "disliked": "— Thin Walls"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "While our room did not have an ocean or street view, we had two large sets of windows, one of which opened onto an inner courtyard filled with tropical plants. Our room was very quiet and large with a sitting area. Our suite was conveniently located down the hall from the dining room. We visited it two times daily for the wine tasting and incredible breakfasts.", "title": "Quiet and Comfy B & B", "helpfulness": 2, "user": "jodimaca", "date": "April 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 14799533, "likes": {"liked": "— Quiet and safety"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "Julio and Omar, serving staff, went out of their ways to welcome us and make us feel like family. For example, after our a.m. arrival, Omar stopped me in the hall to ask if I would like some pastries with my coffee which I had been invited to take from the salon area on the main floor. Now that's service!", "title": "Absolutely Loved Hotel Drisco!", "user": "Blaisy", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14744370}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Marti, the Concierge who took our phone reservation, remembered that our trip was in honour of my husband's birthday. After returning to our suite the first day, we found a 1/2 bottle of sparkling California wine chilling in a cooler of ice and a gracious note wishing my husband many happy returns from the Staff. How is that for attention to detail!", "title": "A great hotel", "helpfulness": 2, "user": "GEdwardsUk", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14597617, "likes": {"liked": "— The extras", "disliked": "— The hills"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Set in the beautiful Pacific Heights area, this hotel is quiet, clean, lovely, and the customer service is over the top. Hot towels on arrival, doormen that will help with ANYTHING, dinner reservations, you name it. Our room had a flat screen TV and free wireless Internet. The bedding and towels were luscious and the bathroom was large. Breakfast is cold but they do have boiled eggs and oatmeal, and it's complimentary. I thought the price was very fair for the location, service, and additions, like breakfast and Internet. Parking is on the street but its not bad. I will definitely stay here again.", "title": "Lovely Hotel", "user": "FatherMckenzie", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14556963}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My wife and I are currently staying at the Drisco and thoroughly enjoying it. The hotel is early 1900s elegant, and is located in one of the poshest areas in SF high up in the desirable hill section. The mansion built by the Folgers of coffee fame is next store. President Hoover's home is a block or so away. There is a bit of a B&B feel to the hotel, with an attentive staff, a wine gathering in the early evening, and a very good continental breakfast (European style: meats, cheeses, fresh and dried fruits, cereal, yogurt, fresh squeezed orange juice, rolls, etc.). Assorted celebrities ranging from President Eisenhower to Ashley Judd have stayed here. The location is a bit far from downtown (10 to 15 minutes by taxi), but the hotel has a free car service downtown each morning. Moreover, the residential local makes for a quiet and relaxed feeling. We even slept with our windows open last night. The view from those windows is the skyline of downtown SF. There is no dedicated parking, but parking nearby on the street has not proven to be an issue so far. There is also no restaurant or bar, so apart from the breakfast, the only food available on site are grilled sandwiches. The room is reasonably sized and very nicely appointed. There is no A/C, but that is seldom an issue in SF. The heat also cannot be controlled (other than on/off in individual rooms), and it did seem a bit warm (solved by opening the window). Everything is exceptionally clean. If what you want is a glitzy edifice and lobby downtown in the middle of everything with every service possible available 24/7, then the Drisco might not be for you. But for a quiet and accommodating island in a busy metropolis, the Drisco can't be beat, and, especially for a several day stay, it is way less expensive than its glitzy, impersonal competitors.", "title": "First rate", "helpfulness": 1, "user": "nearandfar2", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14540779}, {"rating": 5.0, "title": "Real San Francisco Experience", "text": "This was our second visit to San Francisco within a year having enjoyed it so much first time around. Rather than the conventional chain hotels we decided to try something a little different and the Hotel Drisco couldn't have been better. Located away from the City Centre but in a lovely neighbourhood , Pacific Heights, you couldn't get more San Francisco. Yes it is a little hilly but that really is part of the charm of it all. It is only two blocks from a bus service downtown which is a fun ride in itself. Lovely room, warm welcomes all round and very nice extra little touches. A very good free breakfast and free glass of wine early evening served by Julio who was most charming. Normally we like to change things every time but next visit we will go back to the Hotel Drisco.", "user": "TravellerGloucs", "date": "March 21, 2008", "id": 14422935}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I arrived midday during a business trip and needed to get some work done and found myself in a beautiful room with all the amenities to make my \"office time\" great. Sunny, spacious, and supremely comfortable. Fantastic, gracious staff...very personal...almost felt like I was staying in a private inn or B&B. Wonderful neighborhood. This hotel entirely changed my view (literally and figuratively) of SF, as I'd only stayed in downtown hotels on past visits.", "title": "Superb Experience!", "user": "texasgman", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14298978, "likes": {"liked": "— Beautiful hotel, great staff, location"}}, {"rating": 5.0, "title": "The Hotel Drisco..An Elegant Experience", "text": "I'd recommend to colleagues, family or friends (and already have!). I will definitely visit again when returning to SF.", "user": "charley-tahoe", "date": "March 13, 2008", "id": 14272624}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Quite lovely B&B Style hotel. We booked a room and got a corner suite with separate living room. Bed was very comfortable, service was excellent, complementary internet service was the fastest we've experienced. Unfortunately, the weather was not very good (not the hotel's fault), the hotel has no restaurant or bar, and there were no restaurants, bars or shops within easy walking distance. If you don't mind taking a cab or driving (free on-street parking was easy to find within steps of the door - there was a three-hour daytime parking limit but the bellman offered to move our car for us if we left him the keys) it is a quite comfortable and elegant - if a little pricey - place to stay in the city.", "title": "Very nice Inn - Location could be better", "helpfulness": 4, "user": "JohnAndTheresa", "date": "February 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 6762557, "likes": {"liked": "— The room", "disliked": "— The location"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "This is our third stay at this lovely boutique hotel. It is an elegant experience. The location is wonderful, the rooms are beautiful. But the best part by far is THE STAFF. They can't do enough for you and are so friendly. We won't go anywhere else in San Francisco, the Drisco is truly wonderful.", "title": "We love the Drisco", "helpfulness": 3, "user": "longislandgirl-7", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6714402, "likes": {"liked": "— the staff and the service", "disliked": "— I liked everything"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The Hotel Drisco is a warm, comfortable neighborhood hotel with small, but well-planned rooms. It’s neither plush nor high-end luxury, but it is cozy, quiet and charming. The rooms are well-thought out and everything you might need is considered (the bedside radio has pre-set stations, the bathroom has Aveda products and a thoughtful basket of bath supplies for purchase, etc.).", "title": "Peace and quiet in Pacific Heights", "helpfulness": 7, "user": "MJPBAF", "date": "January 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6711891, "likes": {"liked": "— Comfortable and quiet", "disliked": "— Location"}}, {"rating": 5.0, "title": "Great location and loads of class", "text": "The free breakfast is enjoyable, and the dining room is light-filled and relaxing. Overall, the effect is like being in a B&B in a quiet neighborhood. And what a neighborhood it is: Pacific Heights is one of the priciest, and loveliest neighborhoods in San Francisco and it was a real delight to live among the splendor of the million-dollar homes in this area, if only for one night.", "helpfulness": 11, "user": "NapaLocal", "date": "January 12, 2007", "id": 6582175}, {"rating": 3.0, "title": "Drisco Mania", "text": "This is by no means a high-design business hotel for a fast-paced visit to the City by the Bay. This is a relaxed, welcoming residential retreat for people who want to be away from the usual hustle and bustle of San Francisco. If you’re looking for peace, quiet and comfort, this hotel is a good choice.", "helpfulness": 5, "user": "bubba2323232", "date": "January 2, 2007", "id": 6540769}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I searched high and low for just the perfect hotel for our ONE and ONLY Night in San Francisco. We had traveled to San Francisco all the way from Virginia, and I was so looking forward to Staying at the Drisco. Whe we walked in, it was just like I had imagined, lovely, just like the pictures. I could not wait to get checked in and see the beautifully decorated early 1900's king size room, that hopefully had a city view like I had requested. Upon checking in I was told that they had given our room away to a guest that had wanted to stay another night. There was only one room left, but they would give it to us complimentry. They showed us the room, it was down a hall across from the front desk, it was very, very small, had a view of a window of another room, AND we did not have a bathroom in the room. We would use a bathroom down the hall. The bathroom was just for our own use, but it WAS DOWN THE HALL!!! I was sooo disappointed. It was later in the day, and we had been seeing the cites all day, we were tired and just were looking forward to relaxing and enjoying a beautiful room. I was speechless, as I was just so disappointed in our accomidations.", "title": "Could not wait to stay here....Was really let down", "user": "Amers37", "date": "August 16, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "value": 3.0, "location": 4.0, "service": 1.0}, "id": 5618511}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The service was very nice, the breakfast very nice too, but I just could not get over my disappointment of the room, the view that did not exist, and the bathroom being down the hall. It just was very disappointing for our ONE and Only night in SF. I could of stayed anywhere in San francisco, but I chose the Drisco because of the reviews, location, and quaintness of the rooms that I had read about. I just feel like the Hotel should of offered us a room somewhere else in SF, (and there are many) in another one of the hotels the Joie de Vivre Hospitality boutique hotel's, that company own.", "title": "hard to find fault with this hotel", "user": "travellchein", "date": "August 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5607081}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "This is the second year that I've stayed at the Drisco and have come to think of it as my home away from home when in SF. I was in town working for 10 days, with 7 colleagues who stayed there too, and welcomed the extra-comfy beds and quiet location after long, 14-plus-hour days.", "title": "My home way from home", "helpfulness": 1, "user": "DPaxworldwide", "date": "October 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5982111}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "This was my third visit to the Drisco, and my third room/minisuite. This time I had a courtyard view, but did not find the room dark at all, as suggested by reviews below. As always, the bedding was luxe and comfy, as were all the added touches--fresh fruit in the room, slippers in the armoire. It is true that the Drisco is located in a (very ritzy) residential neighborhood--which makes for quiet nights, a real plus--so you do need to ask the staff at the desk to ring for a taxi, which they cheerfully do. Just be sure to give some advance notice. One of my favorite things about the Drisco is its tiny, hidden workout room--one treadmill, one stairstepper, one sta. bike, some weights and that's it. Another favorite is that you can arrange in advance to be picked up in a town car at the airport for only a very few dollars more than what a van service would cost--worth it, worth it, worth it! The staff here are to a person outstanding including and especially the driver of said town car. This really is a fine hotel.", "title": "Charming, welcoming, spotless luxury", "helpfulness": 5, "user": "amherst_reader", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5964823}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We stayed here as our first stop on honeymoon in June and it was a real treat! The area of Pacific Heights is just beautiful and the hotel itself was peaceful, refined and atmospheric. If you want a quiet, intimate setting, a real feeling of old-style glamour then this is the place to stay. Breakfasts were perfect and we really appreciated the glass of wine in the lounge after a busy day in the city. Warning - its quite a walk into the main areas of the city and mostly uphill on the way back, but for get away from it all honeymoon bliss it was perfect!", "title": "Perfect honeymoon hotel", "helpfulness": 7, "user": "MrsBarno", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 5.0}, "id": 5932980, "likes": {"liked": "— The atmosphere!", "disliked": "— The walk uphill!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "We just returned from a wonderful four-night stay at the Drisco in Pacific Heights. Having previously lived in SF for years, we'd never checked into a local hotel before (but had seen plenty through work and friends). The Drisco was a rate treat -- an affordable property with superior service.", "title": "Near-perfect stay", "helpfulness": 4, "user": "3Schwestern", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5927924}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "PROS:", "title": "The Best", "helpfulness": 4, "user": "dribbler", "date": "October 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5922511, "likes": {"liked": "— Neighborhood and views", "disliked": "— beds"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Parking around the area is not as bad as I had read. Perhaps that is because we are used to the NYC parking problems and this was not even close.", "title": "Classy Hotel!", "helpfulness": 7, "user": "hampy9907", "date": "April 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4953857}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "What a nice, clean, well decorated hotel. The Hotel is off beaten path a little but is in a wonderful part of town. You are still very close to everything. Quick cab ride. We stayed in a suite which was very nice. Great views. The breakfast was very nice plenty to eat and great choices. The staff is great. We had no problems.", "title": "Super Nice!", "helpfulness": 9, "user": "tracker1312", "date": "April 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4943604}, {"rating": 5.0, "title": "Drisco has unbeatable service", "text": "I found almost everything about the Hotel Drisco excellent. It will become my hotel-of-choice in San Francisco. (I usually stay at the Mandarin Oriental.) I was wary about the lack of parking but had no trouble finding a spot on the street whenever I needed it. I'm writing this review (my first ever) to let people know about the wonderful service I received: When I got home, I realized I had forgotten my travel alarm clock on the bedside table. I immediately called, the clock was located, and two days later it arrived by priority mail. Little things and big things---the Hotel Drisco has it all.", "helpfulness": 1, "user": "Barjo10", "date": "May 22, 2008", "id": 16321443}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The hotel is as described on this site. I got a less expensive room at a good rate so the room size and location reflected that. I don't think it's the best hotel in San Francisco, but it did meet my needs for location and price. My daughter and I noticed there were several mother/daughters at breakfast so it is a comfortable hotel for women traveling alone. My only complaint would be that I forgot to print directions and when I called the hotel for directions the person answering the phone couldn't help me because the route from Los Angeles wasn't familiar to her. Most hotels have printed directions from various routes for the people answering the phone to read aloud to drivers.", "title": "as described", "user": "nsmHouston", "date": "May 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16059244, "likes": {"liked": "— free parking", "disliked": "— thin walls"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Stayed here last weekend for my husband's birthday. I was eager to check this place out given the very high ratings on TripAdvisor. Overall, Hotel Drisco did not disappoint. It has old world elegance minus the stuffiness found in some old world hotels. The staff was extremely accomodating and pleasant without seeming overbearing. The location is lovely...on a very quiet, upscale street in Pacific Heights. Our bed was very comfy, sheets soft. Like other previous reviewers, we were stunned at the fact that we were not once awoken by street noise. Honestly, it felt as if we were staying at a hotel in the countryside rather than in the middle of SF. It was that quiet!", "title": "Charming and Peaceful SF Retreat", "user": "jenme", "date": "April 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15471430, "likes": {"liked": "— Very quiet, very elegant, lovely location", "disliked": "— no room service"}}, {"rating": 5.0, "title": "Wonderful hotel", "text": "While this was a lovely hotel...I wouldn't rank it as one of the top places I've ever stayed.", "user": "stella99", "date": "April 26, 2008", "id": 15382968}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "* I tend to prefer more modern decor and a slightly more casual environment.", "title": "Drisco, Comfort, Quiet and Warmth", "user": "madjt", "date": "April 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15249864, "likes": {"liked": "— Location", "disliked": "— Internal noise"}}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 13, "average": 23, "very good": 116, "terrible": 6, "excellent": 773}, "aka": "Drisco Hotel San Francisco", "slim_ranking": 0.00425531914894, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Hotel Drisco, constructed in 1903, blends traditional elegance with the convenience, comfort, and amenities of a world-class modern hotel. Our warm hospitality, inviting atmosphere, and impeccable service are designed to please business and leisure travelers alike. Our complimentary services include a gourmet continental breakfast, evening wine reception, chauffeured sedan service to several popular San Francisco locations and complimentary high-speed Internet access."}