{"user_rating": 3.5, "review_count": 20, "name": "Hotel Du Lac", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "This is a small hotel with the specific charms you do not find in large hotel chains. The location is unique, not only near (about 15 minutes by car) to the centre of Geneva, but also directly on the shore of the lake of Geneva, midst in the medieval town (or rather village) of Coppet. The building itself has some history. The staff is very courteous, and we received an upgrade to best suite, such treat of course can only be off-season. The beautiful room was an unique apartment with two bathrooms, with classical French furniture as well as modern comfort, spectacular view of the lake, and a nice terrace, and much more. What was missing was a coffee maker, an ironing board, slippers, and the bathroom amenities (soap, shampoo, towels, etc.) were a bit stingy for the price of the room. Anyhow, the bed was comfortable and we slept very well. It is a pity that the main traffic runs through the very centre of Coppet on the grand-rue in front of the hotel, but our lakeside room heard nothing of that. We had dinner at the Rotisserie, the service was absolutely friendly and attentive and the food was delicious. the fireplace provides a comfortable atmosphere and makes you feel back in old ages. The hotel is quite expensive. Breakfast (additional CHF 25) was really average if not less. What should be pointed out that there is no parking space in front of the hotel, as the main street which is quite narrow and right in front of the hotel, and public parking lots are about 100 meters (blue zone for 90 minutes) or 300 m away (direction Lausanne).", "title": "Lakeside location with historical atmoshpere", "helpfulness": 1, "user": "Frequentvoyager", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 22036488, "likes": {"liked": "— total appearance of room", "disliked": "— abesence of car parking, breakfast food/service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Our experience of Hotel du Lac was very good. We found the place clean and without any visible spiders. Being next to lake there had to be the odd flying insect. The view east along the water made up for them.", "title": "Worth It", "helpfulness": 2, "user": "Davidicus", "date": "October 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20784093, "likes": {"liked": "— Clean and well kept.", "disliked": "— Public rooms are a little Spartan and very public."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The room (#103) was clean and well kept. A room safe which could be lifted out of the wardrobe and tucked under the arm added to to charm of the place.", "title": "For Geneve pass this one ...", "helpfulness": 4, "user": "scoobyUk", "date": "September 15, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8718632, "likes": {"liked": "— Location", "disliked": "— Spiders crawling in the rooms."}}], "location": {"country": "Switzerland", "region": "Vaud", "continent": "Europe", "city": "Coppet"}, "variance": {"poor": 1, "average": 2, "very good": 9, "terrible": 4, "excellent": 4}, "slim_ranking": 1.0}