{"user_rating": 4.5, "review_count": 1247, "name": "Hotel Campo De' Fiori", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My family and I had the pleasure of staying at the Hotel Campo De'Fiori recently during our Family Reunion Tour of Italy. The hotel location is excellent, right around the corner from the busy Campo De'Fiori which is full of shops and restaurants.", "title": "Very Nice Hotel, Great Location", "helpfulness": 1, "user": "Simmrouter", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151019102}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The hotel itself is very quaint, although the rooms are on the small side. The front desk staff are all extremely friendly and helpful with restaurant recommendations and walking directions.There is no bar at the hotel, but the breakfast buffet in the basement is very good. I would recommend this hotel to leisure travelers who want a reasonably priced hotel centrally located in Rome.", "title": "great place to stay", "user": "kw82_13", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150935595}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Stayed here just before Christmas in the apartments and loved them! The apartment buildings are across the square from the hotel, they are old as would be expected but it all adds to the charm, was nervous as read some reviews on here about the apartments being loud but stayed on the first floor and was never bothered by noise. The staff are very friendly and the ambiance of the entire square itself is just lovely. Its in a great location as you're just a stones throw away from everything. Would definitely go back and maybe try out the main hotel as it looked beautiful. Definitely suitable for a couple!", "title": "girls weekend away", "user": "gail n", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150882688}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "we stayed as a group of 4 friends in one of the hotels apartments on the campo di fiore square . Clean, spacious and lovely and warm much appreciated in january. Reception staff were most helpful and informative and really added to our trip suggesting nice restaurants and just generally being accommodating( they allowed a late check out on our departure date). We loved the area and generally had a fabulous trip to rome. Added bonus that as we were in Rome last Sunday of month entrance to Vatican museums was free !", "title": "long long time ago but still good hotel", "helpfulness": 2, "user": "voovoomel", "date": "January 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150491299}, {"rating": 4.0, "title": "Well located", "text": "Only downside was wakened by the market setting up on Saturday morning but the market was great and definitely only a minor problem. Will be recommending to all my friends", "helpfulness": 1, "user": "ChristianeNSW", "date": "January 23, 2013", "id": 150323433}, {"rating": 4.0, "title": "Great location", "text": "We booked into the hotel for our 4 night stay in Rome after being picked up from the airport in a private car organised by the hotel. The location to the Colosseun and The Vatican was within walking distances and the staff couldn't have been more helpful throughout our stay. The markets which were held in the square daily were great if you wanted to pick up any nick knacks or fruit. We stayed on the sixth floor in a top floor room but as the roof garden was directly above us if you wanted to sleep in it was a bit hard if there were people already up there. We would definately recommend this hotel to our friends and would stay here again", "helpfulness": 1, "user": "Margi H", "date": "January 19, 2013", "id": 150029930}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We have spent 3 nights, at an appartment managed by Hotel Campo De Fiori. The apartment was located around the corner from the hotel. It was very spacious and well equipped for our family of 5. The location was superb. The hotel staff were extremly helpfull. Highly recommended!", "title": "Great Stay at Hotel Campo De Fiori appartment", "helpfulness": 1, "user": "Dror R", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149501151}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Very nice rooms, perfect place to stay and walk everywhere. No excuse to take cabs to St. Peters, the Trevi Fountain, or the Pantheon.", "title": "Perfect Location, Pricey but it it the center of Rome", "helpfulness": 1, "user": "Galway1", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149371716}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The desk staff is very helpful.", "title": "Lovely apartment in Roma", "user": "That Thursday D", "date": "January 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 149359617}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "It is not the Ritz, but the Ritz isn't on Campo de' Fiori. People watching at every hour of the day and night Good breakfast.", "title": "The Piazza is right there", "helpfulness": 2, "user": "Deborah H", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149345448}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "great location, great staff, great hotel. would absolutely stay here again....they gave great advice and booked us transportation to the airport. They helped book tours, etc...the location makes it close to all the main key sites.", "title": "Awesome, loved it", "helpfulness": 2, "user": "jeffrobe", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150228014}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Just got home from another long weekend in Roma (the third in recent years).", "title": "Excellent!", "helpfulness": 1, "user": "Harvey2k6", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150215364}, {"rating": 5.0, "title": "Just me and my husband trip.", "text": "We and another couple had an apartment each. Both were very clean, reasonably spacious, with a comfy bed, functional kitchen and bathroom, and in a central location to all the main attractions of Rome. One apartment was more dated than the other, but the comfort and amenities were equally good. We were serviced each day by a cleaner, with fresh towels etc.", "helpfulness": 1, "user": "TrinaOrkney_Scotland", "date": "January 21, 2013", "id": 150210598}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We took apartments this time so we could make our breakfasts and sandwiches at our own pace before venturing out.......... a good choice if you want to spend your Euros on good food and drink after you’ve got back from spending the day visiting the Vatican, Coliseum, Trevi Fountain etc, all within walking distance.", "title": "wife`s birthday treat", "helpfulness": 1, "user": "dc100", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150167103}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "It was busy and noisy, particularly later at night, but the authentic Roman life of the Campo de' Fiori Square on your doorstep, with a Mon-Sat open market, encircled with lively bars and restaurants was just what we wanted. Don’t make it an issue, make it an opportunity and do what we did........ Join in! :)", "title": "Romantic weekend in Rome", "helpfulness": 3, "user": "DmitryOK", "date": "January 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150126119}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The location of this hotel is perfect. A great place for exploring all of the wonders of Rome. We found the hotel to be very nice and would stay there again. The only complaint we have is that the front desk seemed a bit aloof and did not reach out to embrace us and make us feel welcome. Even when coming and going there were few interactions. At one point we brought lunch back and were invited to eat in their downstairs dining room by one of the workers. One of the front desk ladies came in while we were eating and gave us a look of disdain and did not even acknowledge our greeting (we wanted to share with her that we were invited to sit there as she made us feel we were doing something wrong). The lovely woman who serves breakfast as well as the housekeeping staff were very kind and welcoming. The rooftop sitting area is beautiful and a true asset when wanting to rest and look out over the beautiful city. The marketplace is right outside the door and lends to a true flavor of the area. We spent 4 nights (we willingly paid for 5 nights so that we could get into the room early on our arrival day). All in all, if the front desk improved it's helpfulness we would rate a this hotel 5.", "title": "Location, Location, Location", "user": "jmnra5", "date": "November 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 21474772}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Hotel Campo de Fiori is the perfect choice in Rome if you are looking for an intimate hotel in a superb location with all the details that create a charming ambience. Walking in the front door right around the corner from the bustling campo de fiori market place, I knew I had found the perfect little hotel. The arched wooden bookcase behind the front desk, the silver room keys in velvet boxes, the cozy sitting area furnished with traditional Italian furniture. There is a tiny lift to take your bags up to your room where you will find a heavy wooden door leading into small room with shuttered windows draped in silk, a dark wood beamed ceiling with a small crystal chandelier hanging from the center. The room is furnished with Venetian style furniture but has a very modern bathroom. You put your clothes away in a polished wooden cabinet. Every detail adds to the charm of the small room. One marvelous feature of the hotel is its beautiful roof terrace with wicker chairs and tables and comfortable lounge chairs. When it's time for siesta - grab a pizza from any of the local shops and head up to the terrace to realax, eat ,and enjoy the sunshine overlooking the city. The hotel is located within walking distance of any of the important sites you want to see in Rome. We walked everywhere. The campo de fiori itself can be very noisy at night as it is a popular gathering place for young people. But the good windows in the Hotel shut out most of the noise except for a background hum and the occasional burst of song which is just Rome by night. The breakfast room is exquisite with its Venetian painted barrel vaulted ceiling, a beautul wood Venetian bookcase across the back of the room and traditonal small tables and chairs set with linen and china. Bread, cheese, cereal, yogurt, fruit cocktail juices and coffee are offered. The front desk is helpful with directions, transfers etc. Prices are competitive with other small hotels in the 3 star category - but after peeking inside a few of the others, there is no comparison.", "title": "charming small hotel", "helpfulness": 2, "user": "jannycam", "date": "October 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21171401, "likes": {"liked": "— charm and location", "disliked": "— a little bit of noise at night"}}, {"rating": 4.0, "title": "Campo De Fiori's apartments- great value for the money", "text": "If you are looking for the charm of a traditional Italian hotel which provides an intimate oasis in a bustling city, this is the place for you. I was totally enchanted with Hotel Campo de Fiori.", "user": "yourusername", "date": "October 21, 2008", "id": 21080578}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My husband and I stayed in the apartments of Hotel Campo De Fiori in October 2008. The apartment was basic, but clean and well kept. If you stay in the apartments you don't get all the bells and whistles of the fancy hotel, but you do get a kitchen, which was a bonus for us. Another bonus of staying in the apartments was being able to take advantage of the beautiful rooftop and helpful staff of the hotel. Emmanuel and other staff members were hugely helpful to us. (Thank you!)", "title": "Hidden Treasure", "helpfulness": 2, "user": "connecticutraveler", "date": "September 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20194988, "likes": {"liked": "— Friendly knowledgable staff, clean, quiet room, good location, breakfast included, roomtop terrace,", "disliked": "— not one complaint"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "So to sum it up, the apartments aren't as nice as the hotel, but they're clean and in a great location of the city. Grab a bottle of wine and head up to the rooftop- the view is beautiful!", "title": "Great Hotel", "helpfulness": 1, "user": "GeorgiaCalifornia", "date": "September 18, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 20176372, "likes": {"liked": "— Location and staff"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The location of this hotel is great so close to everything. Eateries and shops at your door step. Lots of sights within easy walking distance. We used two different guides organised by the hotel and they were fantastic and reasonably priced. Our accom was in their apartments just around the corner and they were lovely as well so if you need some extra room they are a great idea but no lift. Helps walk off all the great food though", "title": "Best spot in Rome and their tour guides are great", "helpfulness": 1, "user": "Viv H", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149318447}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Stayed at this hotel for three nights. Absolutely wonderful. Walking distance of around 20mins to the colosseum, 20mins to the Vatican, 10mins to the pantheon, 5 mins to piazza navona. We walked it to all attractions at a leisurely pace.", "title": "Fantastic short stay", "helpfulness": 1, "user": "Sid786_12", "date": "January 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149288636}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The staff are the friendliest people we met in Italy. The hotel is a beautiful little place.", "title": "Great Hotel and great staff", "helpfulness": 2, "user": "SWM777", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149132440}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Just remember that as stated on their website they have no tea/coffee making facilities in the rooms.", "title": "Highly recommend this Hotel~~!!", "helpfulness": 1, "user": "nurseparker", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149126715}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The tv is all in Italian and to watch a film you have to pay €8 per film which was disappointing.", "title": "A gem in the heart of Rome", "helpfulness": 2, "user": "Clemente B", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149118194}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "This is my ninth stay in Rome as a tourist and over the last 10 years, each time we stayed in different accommodation. Based on the central location and the friendliness of the staff this was my best stay ever. Yes our superior room was pretty small but had all modern amenities and was very well isolated what is key for this neighbourhood. And the cherry on the cake is of course the roof terrace overlooking Saint Peters to the Pantheon. Dear Olga, Angelo and Matteo, we come back ! Lien and Jan", "title": "most friendly staff", "helpfulness": 1, "user": "jantie001", "date": "September 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19695102, "likes": {"liked": "— friendly staff - cleanliness - location - roof terrace", "disliked": "— pretty small room for superior though great price"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The hotel is located next to the Campo Di Fiori square which is great for eaitng out or going for a quiet drink.", "title": "Nice hotel, great location", "helpfulness": 1, "user": "Earsby", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 19567782, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Its also slap bang in the middle of the city, all major attractions are within walking distance.", "title": "The One for Rome", "user": "Angelkrew", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19339345, "likes": {"liked": "— the room", "disliked": "— no iron"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The staff were very good, and the roof terrace is great for watching the sun go down over picturesque Rome.", "title": "Thank You Hotel Campo de' Fiori !!!", "helpfulness": 1, "user": "rajiv_mitra", "date": "August 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19077879, "likes": {"liked": "— The hotel was prectically new since it has been totally renovated 2 years ago.", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The breakfast was basic, but very edible. Great hotel if you're visiting Rome for a couple of days and want to be close to the stuff you want to see.", "title": "Camp glamour", "helpfulness": 1, "user": "lifeissublime", "date": "August 2, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 18547553, "likes": {"liked": "— Bathroom was very glam", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "My husband and I stayed at this hotel during our first trip to Rome. We loved it. The price was higher than we initially wanted to pay but we agreed upon getting there that it was well worth it.", "title": "Excellent Hotel!", "user": "TravelingSage", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17906370}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "It was super comfortable with beautiful decor, helpful and pleasant staff, a nice breakfast buffet, amazing roof deck views, and a fantastic location. It was surprisingly quiet in the room, despite the central locale. They did a great job insulating the rooms from any noise. You could open your windows and hear milling crowds and vespas, but once you closed the windows it was dead silent.", "title": "Beautiful facility and great location, but....", "helpfulness": 1, "user": "BJXW", "date": "June 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16922522}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "We would not hesitate to recommend this place to anyone. You can't beat the location, and it was a great place to unwind at the end of each day.", "title": "Fantastic", "helpfulness": 1, "user": "tcumatt2005", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16882397, "likes": {"liked": "— The rooftop terrace and room design.", "disliked": "— Was hard to find at first so we had to take a cab."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I just spent two days at the Hotel Camp De' Fiori in Rome, which enjoys an absolutely ideal location around the corner from Campo de' Fiori, providing easy access to Rome's many delights. The hotel itself is beautiful in a cozy way, and the room I had was a nice mixture of modern conveniences (flat screen TV) and elegant furnishings. My only quibble is my check-in experience. Having booked a room in advance, I was told when I arrived that only an apartment was available. The apartment I was taken to was on the other side of the square, on the third floor of the building with no elevator, and lacking a telephone-- far inferior to the hotel rooms. I was able to wangle my way back into the hotel, but only after repeated insistence. If you go, try to deal with Tommy, who not only engineered my room in the hotel, but helped me with restaurant reservations and gave great advice on where and when to go to different places, all with good humor.", "title": "Final Fun", "helpfulness": 1, "user": "loveaffair", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16804995, "likes": {"liked": "— Location", "disliked": "— Small room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This hotel was fantastic among the best I have stayed in, especially for Europe. Very friendly staff, comfortable beds, \"lift,\" contemporary decor and a rooftop terrace with unbeatable views of Rome. I would definitely recommend this hotel.", "title": "Super hotel!", "helpfulness": 1, "user": "BrentwoodVictoria", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16802079}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The hotel is a lovely gem of a building, recently renovated I believe. The decor shows so much attention to detail as well as creating a superb atmosphere in general. We stayed in room 603, which requires you to climb one flight of stairs after you get off the elevator on the 5th floor. But even this stairwell is lovely and contributes to the feeling that you are staying in a building with history, not a commercial hotel. Our room was small, not uncommon in Europe, but beautifully decorated...a jewel box. The bed was comfy, the drapes allow total darkness for a sleep in or a late afternoon snooze. The elegant bathroom is worth requesting this room ..the roomy shower includes a terrific \"rain\" overhead as well as a handheld spray. A particularly nice touch is the flat screen TV mounted on the wall in a heavy gilt frame!!", "title": "A real Gem!!", "helpfulness": 1, "user": "theatredesigner", "date": "August 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18544967, "likes": {"liked": "— Location was great and the roof terrace is just unbeatable!", "disliked": "— The ONLY thing would be that ice be made available to guests. It's hot out there!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The highlight, shared by all, is the fabulous roof terrace, with it's 360 degree view of Rome. (the Vatican is visible) It has 3 levels, 2 of which are smaller and feel quite private. Morning coffee, 5 o'clock wine, evening to watch the lights of Rome....this spectacular feature alone sets the hotel apart. You can peer down into the Campo and be serenaded by a haunting solo saxophonist who is joined regularly by the pealing of church bells chiming in from all sides.", "title": "Perfect hotel in a perfect lcoation", "helpfulness": 1, "user": "CDKOntario", "date": "August 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18513035, "likes": {"liked": "— nicely decorated and clean hotel", "disliked": "— everything was satisfactory"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Even the breakfast room is beautifully done and is staffed by a friendly efficient lady who is prompt with a great pot of coffee as soon as you arrive. The fare is definitely Continental, but has a nice variety including freshly baked goods.", "title": "Loved it", "helpfulness": 1, "user": "Getgerald", "date": "August 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18504044, "likes": {"liked": "— Great location and good value for the price"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The location is central and a perfect starting point to head off for a walk in any direction. The hotel is just OFF the Campo so there is no noise problem, but close enough to all of the great wine bars and restaurants to make it feel like it's your own neighborhood.", "title": "Great hotel", "helpfulness": 1, "user": "mersea_girl", "date": "July 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18143579}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The staff are terrific...friendly, helpful, efficient. From the time we started our online booking inquiries to the moment we checked out things were handled smoothly and pleasantly. They helped us with booking tickets for a gallery, locating shops I wanted to visit, recommending a great restaurant and finally arranging transport to the airport (the service they use is one of the best I've had...try it!)", "title": "Perfect choice in Rome", "helpfulness": 2, "user": "reneevero", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17916408, "likes": {"liked": "— Roof Deck!!!", "disliked": "— Small room."}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 24, "average": 56, "very good": 221, "terrible": 19, "excellent": 927}, "aka": "Hotel Campo De Fiori", "slim_ranking": 0.0149606299213, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Hotel Campo de' Fiori is located in a unique position in the heart of the lively and pituresc area of Rome known as Campo de' Fiori. The hotel is a fabulous “BOUTIQUE HOTEL”, romantic, cozy and sought after, that know’s how to offer to it’s guests a suggestive atmosphere to make unforgettable there stay in the Eternal City.The hotel is situated since 1937 in an antique structure of the Roma Baroque period."}