{"user_rating": 4.0, "review_count": 113, "name": "Hotel Les Arcades", "reviews": [{"rating": 3.0, "title": "short break in geneva", "text": "stay overninght in this hotel,which was choosen due to its perfect location-oposite side of Cornavin train station and close to the city centre.Hotel staff was very friendly and helpful,room was extremely cleanwith adequate breakfast for this type of hotel.For my purpose it was also close to the Sixt office(4 blocks away).Free wi-fi is available in this hotel.free ticket for the public transport was given.", "user": "admirerItaly", "date": "May 3, 2012", "id": 129279767}, {"rating": 5.0, "title": "A very good choice!", "text": "We are regular clients to this hotel, and all the time was a good experience: good service, clean rooms, good breakfast. Very good location near the railway station and city center.", "user": "Carmenciuta", "date": "April 29, 2012", "id": 129054703}, {"rating": 5.0, "title": "Excellent.", "text": "I stayed here for 2 nights with friens on Feb late and realize that it is no bad choice in The center of Geneva. This is a 2 star hotel but budget is not expensive. We have free buffet breakfast with various energy, free Internet, free transport ticket to visit Geneva, free store room.", "user": "zunney", "date": "April 6, 2012", "id": 127375865}, {"rating": 4.0, "title": "Good for the price", "text": "The staff are very young, helpful, friendly, they are seem from hotel school students.", "user": "Shanbles", "date": "March 27, 2012", "id": 126753904}, {"rating": 3.0, "title": "Clean, but noisy", "text": "The room is not enough big, simple, and clean every day but have enough item to use as small fridge, working table, TV, telephone, safetybox. Yet, you will be disturb if your window is opened. This is not easy for sleeping, right?", "user": "okaree", "date": "February 13, 2012", "id": 124507367}, {"rating": 5.0, "title": "Geneva's hidden gem", "text": "Simply the friendliest and most efficient check in I've ever had (and I've had quite a few) including free transport travelcard valid for your full stay. (Think free travelcard might be a universal thing but non the less explained well to us)", "user": "millso42", "date": "July 20, 2012", "id": 134939129}, {"rating": 5.0, "title": "Best value for a single traveller / couple traveller", "text": "Geneva is expensive in general but this hotel is superb value for money (for Geneva). Considering a standard zero personality Ibis hotel was 20% more expensive this hotel has to be described as a bargain.", "user": "WilfredThesiger", "date": "June 3, 2012", "id": 131171623}, {"rating": 4.0, "title": "very convenient", "text": "Room (number 225) was huge with nice ensuite bathroom. The complimentary continental buffet breakfast was also excellent (one of the best I've had), nespresso machine and wide selection of coffee, fresh fruit, cold cuts, cereal, yoghurt, croissant, jams etc.", "user": "taronger1", "date": "May 17, 2012", "id": 130099365}, {"rating": 5.0, "title": "Surprisingly good", "text": "Interacted with 3 different reception staff and all were excellent, friendly and efficient.", "user": "gbb_NJ", "date": "May 16, 2012", "id": 130035988}, {"rating": 4.0, "title": "Excellent location and warm staff....", "text": "Location is right next to a major transport hub so ideal for getting around and only 15 minutes by bus to the airport (bus number 5).", "user": "pg_wanderlust_12", "date": "May 15, 2012", "id": 129996945}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "This is an excellent hotel across the road from the main railway station in Geneva. The rooms are a good size and setup adequately for a comfortable stay in Geneva. The breakfast was very good and the staff sensational. The wifi worked satisfactorily but you needed an adapter for Switzerland that is different from France and Germany for your electrical gear. The staff had one which you put down a deposit on and could use while there. What was a bonus was the free travel pass provided by the Hotel Association and Tourism Board for people staying in accommodation in Geneva. You could ride all public city transport (trams, trains, buses, boats) for free for the duration of your stay. The hotel is in a zone where I as a solo traveller felt safe, there were all kinds of shopping nearby. A fridge in the room meant you could keep foodstuffs for other meals if you wanted too. The staff will do washing for you. It is a little noisy as you are above a very busy road. There is elevator access.", "title": "Another Handy Place to Stay", "helpfulness": 1, "user": "Ellen D", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119651520}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My wife and I stayed in this hotel for a weekend in late September 2011. After reading the reviews, I thought saving money and staying at a 2 star hotel with good reviews made a lot more sense than spending quite a lot more on a 3 star with questionable ones. It was a risk, but one that definitely paid off.", "title": "A very good find in a very expensive city", "helpfulness": 2, "user": "1girlintheworld", "date": "October 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118876636}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I heeded the advice about getting to the hotel because the signage is small and a bit unassuming. Since I knew what we were looking for, we found it with no problem (right across from the train station, next door to the H&M, just go into the lobby and up to the 5th floor via the left elevator) and were warmly greeted by the staff. I understand people’s frustration if they had a hard time finding it. If you do your research you will have no issue with location. It couldn’t be more convenient coming from the airport via the train.", "title": "Splendid experience!", "user": "10bluedot", "date": "September 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118509953}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The hotel is not conventional. It is indeed a floor of an office building converted to a small hotel. I was worried the layout was going to be too strange to work, but we had absolutely nothing to complain about. I put a request on my reservation via booking.com to have a room in the rear, instead of out by the breakfast area and they obliged (Room 212). Although we heard a lot of street noise when the window was open, we didn’t hear anything from inside the hotel. Earplugs are a must for us just about anywhere so our sleep was not hindered. Our room was a good size considering we’re in Europe. The furnishings were basic, but very comfortable and everything was extremely clean.", "title": "Excellent Location", "user": "Bhawna_c", "date": "September 14, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 118094883}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Breakfast was included and was the general fare you find in smaller hotels in Europe- cheese, cold cuts, boiled eggs, bread, juice, a bit of fresh fruit, cereal and yogurt. With the addition of more fresh fruit, this same breakfast costs 15 GBP ($23 USD) at a Sheraton in central London we recently stayed in.", "title": "Well located but unusual", "helpfulness": 1, "user": "Osseja_01", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 118055214}, {"rating": 2.0, "title": "Mixed experience: nice place but noisy", "text": "Geneva is extremely expensive so a budget hotel like this one opposite Cornavin Station is worth considering. The staff are fairly pleasant and the breakfast was reasonable. The room was clean and comfortable and the decor was nice. The only problem is that most of the rooms are arranged around the breakfast area and reception desk. Having stayed there before, I specifically asked for a quiet room not around the breakfast area but was given one 2 meters from the reception desk. It just meant that I could here lots of conversations throughout the night and therefore did not sleep well. If you're a deep sleeper or happy to wear earplugs then I would recommend this hotel wholeheartedly but I will not stay there again.", "user": "funkylittlefrog", "date": "January 30, 2012", "id": 123860078}, {"rating": 4.0, "title": "I'm a frequent host there", "text": "I'm always satisfied when I stay at Les Arcades. The service is very good, the hotel is well located for someone who travels for business, in front of the Cornavin station. I like very much the breakfast served there and the rooms are very clean and comfortable.", "user": "GBaroni", "date": "January 15, 2012", "id": 123127424}, {"rating": 4.0, "title": "Économique et comfortable. Bon choix.", "text": "Pour notre voyage de fin d'année, nous avons opté pour cette hôtel pour notre escapade a Genève. Bien que l'hôtel est juste en face de la gare, il est parfaitement insonorisé. Nous avons énormément apprécié l'accueil et la disponibilité des employés. Merci", "user": "valerie_puchon", "date": "January 4, 2012", "id": 122522937}, {"rating": 4.0, "title": "Compare with other hotels at same rates in Geneva,Hotel Les Arcades", "text": "Je confirme,donc que l'emplacement de l'hôtel est énorme atout. Pour les voyageurs qui cherchent un hotel familiale, celui-ci vous conviendra.", "user": "interlakenBangkok", "date": "December 22, 2011", "id": 121970047}, {"rating": 3.0, "title": "A good 2-star hotel", "text": "Nice location near train station,clean rooms,nice hotel staffs also breakfast is nice.", "user": "Italia_1978", "date": "November 6, 2011", "id": 120246238}], "location": {}, "variance": {"poor": 2, "average": 18, "very good": 65, "terrible": 5, "excellent": 23}, "aka": "Les Arcades Hotel", "slim_ranking": 0.365384615385, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "Our hotel is located opposite the Cornavin train station and central to all public transportation. It has a warm and friendly atmosphere and offers a qualitative breakfast to begin your day full of vigour. You are always welcome to stay with us."}