{"user_rating": 3.5, "review_count": 328, "name": "Hotel Palladium Palace", "reviews": [{"rating": 4.0, "title": "More than a 2 star hotel", "text": "My 19 year old son and I just returned from a 6 night stay here. The hotel is much better than the 2 star rating that Trip Advisor gives it. The hotel was very clean and well maintained. The staff was extremely friendly and helpful. I would suggest a room away from the street, on the back side of the hotel. There wasn't much of a view (apartment buildings) but it was very quiet. The location was ideal. Walking distance to most of the sites, or a short walk to the terminal to catch a bus for 1 eur most all of the sites. I would stay at this hotel again if I every get back to Rome.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 10, 2006", "id": 5048418}, {"rating": 1.0, "title": "Vibrating beds and lots of noise", "text": "I feel like I am in the twilight zone. Or maybe I'm the only guest that was given a room, where every 1/2 hour to an hour the room shook, and my bed vibrated. You could also hear every car, train, and footstep from our floor. This was my first time to Rome, so we tried to pack in as much in a day as we possibly could. I was very disappointed with this hotel. Yes, the location is very close to the station. Yes the hotel had decent rooms and breakfast.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4741037}, {"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "However, for me it was all overshadowed because at the end of a twelve hour day, when you just want to have a good restful sleep, it's unacceptable that I paid the rate I did for this room. When we notified the front desk, they said, \"Oh we can move you to a back room, tomorrow\". Where they surprised, not at all.", "title": "adequate", "helpfulness": 4, "user": "TravelPebble", "date": "March 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4737721}, {"rating": 4.0, "title": "Excellent location to walk to some areas but also for jumping on the metro and f", "text": "I would not stay at this hotel again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 21, 2006", "id": 4721780}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Stayed here during honeymoon last year. Probably would opt to stay in a less noisy part of the city next time. Room was noisy, both in terms of outside and inside noise. There were about a million people staying in the room next to us, and everytime someone came or went, our door and windows rattled.", "title": "Almost Great", "helpfulness": 7, "user": "TravelsWithMonkey", "date": "March 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4578760}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "About the location:", "title": "good price-quality relation", "helpfulness": 6, "user": "Ulick", "date": "December 16, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6448014, "likes": {"liked": "— good communication, clean, large room", "disliked": "— noise, neighborhood"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "To be honest, the hotel is not located in the glamurous Via Venetto. It is not situated in a romantic square near Navona either. It is in Esquilino, in a boisterous street, full of low category shops and shabby restaurants . But certanly, the location has its advantages. In first place, the hotel is very close to TERMINI train station, which means that it is well communicated with the airport and with other cities. It is also close to the METRO, and there are many BUSES to any part of the city. On the other hand, in the Esquilino there are some interesting places, and you can get to many attractions in a quarter of hour walking. Nevertheless, it must be clear that the hotel is not located right in the middle of the historical centre.", "title": "Excellent hotel at a reasonable price", "helpfulness": 2, "user": "LumpSum", "date": "December 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6334749}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Rooms and services:", "title": "Clean and cozy near the train station", "helpfulness": 5, "user": "RangeviewRay", "date": "October 14, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 5956148}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Let s be honest again: This is not in the Intercontinental (some of the reviews could lead you to belive it). But I must say that the room we got was completly renovated and immaculately CLEAN. It was SPACIOUS as well. And so was the bath. The breakfast buffet was good enough. Must be noted that, although the windows were good quality, there was some NOISE at night from the street (buses and trams), so if you prefer a quiet room you would better ask for an interior one. The sauna and the gym are not included in the price. The internet facility in the room is expensive (but there are many “internet points” in the surroundings).", "title": "Perfect location", "helpfulness": 6, "user": "GPTS", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5938540, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "In conclusion, I would say that it is an acceptable good hotel regarding its category and price.", "title": "Super Staff at Palladium Palace", "helpfulness": 3, "user": "piba", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5931925, "likes": {"liked": "— Location", "disliked": "— Tiny elevator"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "This hotel is a great deal!!! It's two blocks away from Termini Station (the main subway station in Rome) and the hotel rooms and large and very clean. The only bad thing I have to say is that we asked to use the sauna and they didn't tell us that there was a 10 Euro charge per person to use it. When we were checking out they tried to charge us, but we complained due to their non-disclosure so they waived the fee. All in all, the rooms are great and I would definitely recommend this hotel.", "title": "Amazing Hotel In Great Location!!!", "helpfulness": 6, "user": "rocks9", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5794404}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My wife and I returned just yesterday from our stay in Rome. We booked 3 nights at the Palladium as the reviews for it seemed very good and we were not at all disappointed. The hotel is ideally placed just a 3 minute walk from the Termini. First impressions always count for a lot and the friendly and welcoming hotel receptionist and the 'Bell boy' to take luggage and escort you to the room was the perfect start. The room was a very good size and was very clean and tidy as was the rest of the hotel. Breakfast was more than adequate and a good variety of fruit, pastries, meat, cheese, fruit juices and hot drinks was always on offer.", "title": "A perfect place to stay", "helpfulness": 7, "user": "EssexLibertian", "date": "September 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5777366, "likes": {"liked": "— Excellent value for money", "disliked": "— no tea making facilities in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The photos of the roof garden on the website are a little misleading as it suggests that there is a terrace with sun loungers where you might relax. The roof garden is now a covered conservatory which doubles as a bar in the evening and where breakfast is served every morning. There are a handful of seats outside but in a very confined area.", "title": "Will stay again and again", "helpfulness": 7, "user": "traveldrp", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5773836, "likes": {"liked": "— Convenience and helpful staff"}}, {"rating": 4.0, "title": "wonderful stay for family of 5 from NJ, USA Aug 10-14,2006", "text": "It's not the cheapest in the world but paying the extra few pounds was well worth it. This is a very good hotel and is much better than the 2 star rating that it is given We would not hesitate to go back to it or recommend it to other visitors to this very beautiful City.", "helpfulness": 8, "user": "B531", "date": "August 29, 2006", "id": 5725528}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We have stayed at the Palladium Palace four times. We have always been pleased by the accomodations. The breakfast is varied enough and available at convenient times. The front desk staff have always been very accomodating. If you can request it, the fifth floor rooms have balconies!The location is great and we have walked to all locations for visitng, including the Vatican.", "title": "Small hotel, close to Termini", "helpfulness": 15, "user": "ahs4y", "date": "August 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5580344, "likes": {"liked": "— Location (very close to the Termini)", "disliked": "— Too small & feels cramped at times"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We were re-directed here after arriving at Hotel Hiberia to find out they lost power. We were upset at first (since we had reservations and planned our trips to start from that original location), but once we arrived at the Palladium Palace, their understanding and quick service was refreshing. We were upgraded to a better room free of charge and it was very large and romantic. Our window faced the back of another room, but was OK since there was excellent AC and it kept the noise level down to almost non-existent. The bathroom was an odd long shape, hard to maneuver but very nice. Breakfast was way better than expected. Staff was very helpful with giving maps/directions and recommendations for restaurants. In the end, the location was not that bad. 10-15 minutes walk to Colosseo and Forum de Roma.", "title": "Glad to be detoured here!!!", "helpfulness": 7, "user": "WhatMickyEats", "date": "August 7, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5564810, "likes": {"liked": "— Breakfast, cleanliness, service", "disliked": "— location...most convenient to Termini station though."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Ah! Roma! The Palladium Palace was our home base for five nights--we were glad we chose to stay here since it was very near the train station (we rolled our luggage there) but far enough away to allow us a sense of peace and quiet. We had rooms (2) on the first floor, which of course in Europe is the second floor. Ours did not have a view, it looked on to a courtyard but we thought that a plus since the street in front of the hotel is very busy. We had quiet for sleeping, and delicious air conditioning in this very hot summer of 2006. The hotel is in comfortable walking distance of the Coliseum, a walk which we made on several of our days, and then from there it is not hard to wander in the direction of the Forum and the Capitaline Hill. The rooms were decorated in stylish shades of ivory with deep red accents--the tile work was signed by Armani--I meant to ask if he designed the rooms' decor but did not remember to do that. Our room had a pulsating shower that was a hoot--really powerful and a bit startling. After I turned it on, I was laughing so hard my wife couldn’t believe it. The staff at the desk were very helpful--and there as in every other locale in Rome everyone spoke English and seemed very glad to have Americans visiting their lovely city. The top floor breakfast room has views of the campanile and domes of Santa Maria Maggiore. You do want to visit it while you are there. Also, the staff recommended the green line hop on and off bus for getting our bearings and we did that the first day. Taxis in Rome are very reasonably priced, so if you go to the Vatican or some other far away location, do not fret, have the desk call you a cab and you will have an enjoyable ride through Rome's fabled traffic. If you are looking for a nice restaurant with good food at good prices, try walking directly away from the big Corinthian column with your back toward the front of Santa Maria Maggiore, on the left side of the street, almost to the park. There you will find some of the best food and one of the nicest waiters in all of Rome. We ate there three times and by the second night, we were treated like family. There are several self serve laundries near by, if you are on an extended trip. All in all it was just the right place for us. Can’t wait to go back!", "title": "Five days in July...", "helpfulness": 15, "user": "Impressions", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5511279}, {"rating": 4.0, "title": "A Fine Hotel in central location", "text": "A very nice hotel that is reasonably priced for Rome, within easy walking distance to Termini station, has a pleasant staff, and a very good breakfast. The hotel is only about 2 blocks from the main railroad, bus, and subway station, making it easy to get to any part of Rome served by mass transit, which includes most of the major tourist sites.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 7, 2006", "id": 5322907}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The neighborhood is not the best, but I’ve seen worse. If you’re only used to middle or upper income areas then I can see why you would be put off by the area and the noise level. I walked safely around outside at night and had no problems with level of noise inside the hotel or out, but my room was not facing the street either. The hotel itself seemed safe and secure with someone always at the front desk. The staff was courteous and very helpful.", "title": "Nice and close to Termini Station", "helpfulness": 10, "user": "orbops", "date": "May 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5181011}, {"rating": 4.0, "title": "Pleasantly surprised", "text": "They serve an excellent breakfast buffet with scrambled eggs and toast in a very nice terrace room on the top floor, that is also used as a bar in the warmer months.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 11, 2006", "id": 5056371}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 33, "average": 68, "very good": 142, "terrible": 19, "excellent": 66}, "aka": "Palladium Palace Hotel", "slim_ranking": 0.572217837411}