{"user_rating": 4.5, "review_count": 138, "name": "Hotel Rey Don Felipe", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We booked through the hotel website directly and got the room for a very good rate. We were here only for one night (basically to sleep before we head out the next day to Torres Del Paine). LAN had misplaced our luggage since we had a connecting flight but delivered our luggage to the hotel that same evening (perhaps after midnight). We phoned the front desk the next morning and had the luggage delivered to our room. Our room was very spacious and clean. We visited the gym briefly which had adequate equipment even though it was a tad bit small. The breakfast in the morning was good, there was a good selection.", "title": "Very Good Value", "helpfulness": 1, "user": "wlslb", "date": "December 13, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 89751753}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Stayed for 10 days in Aug 2010. Found the hotel to be clean and comfortable. Staff were friendly and helpful; being understood in English was not a major issue. It is located a couple of blocks from the Main Square and is conveniently located to permit walking to more restaurants along the Main streets. Bedding and bathroom were fine.", "title": "Clean, comfortable, good location", "helpfulness": 2, "user": "travel_123499", "date": "August 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76371606}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My stay was very comfortable and i did not get disturbed by noise from adjacent rooms.", "title": "Nice Location to Downtown", "helpfulness": 1, "user": "happy2travelnow", "date": "July 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 69495208}], "location": {"country": "Chile", "region": "Magallanes Region", "continent": "South America", "city": "Punta Arenas"}, "stars": 4, "variance": {"poor": 3, "average": 17, "very good": 46, "terrible": 3, "excellent": 69}, "slim_ranking": 0.12, "description": "A first class hotel located in Punta Arenas, the capital of the province of magellean´s. At just two blocks of the city´s main square, we provide you 45 warmly, large and comfortable rooms and a la carte dinning service, including exquisite local recipes and products. Attended by a courteous and bilingual staff."}