{"user_rating": 4.5, "review_count": 185, "name": "Hotel Les Mouettes", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "When researching a hotel to choose in Ajaccio, we didn't know whether it would be best to have a hotel in the center of the city or a little ways out. We decided on the latter at Les Mouettes and we're glad we did. This hotel is right on the water a little ways out of town, near very good restaurants.", "title": "Very nice hotel, exceptional service!", "helpfulness": 23, "user": "Ramatash", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118467080}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "The rooms are adequate - the furnishings are nice, not luxurious. But the views are great. The breakfast on the patio is very nice.", "title": "What a charming hotel!", "helpfulness": 6, "user": "Sophie Xi T", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 118283982}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "What really made this hotel for us was the exceptional service we received. When we were just regular tourists, the staff went out of their way to help. Then we had a medical issue, and they could not have been more helpful. The entire staff go way out of their way.", "title": "Beautiful hotel, Friendly Staff, Nice Location.", "helpfulness": 3, "user": "Renothethief", "date": "September 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117572761}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "I spent 3 days in this beautiful place a couple months ago. The location is great (right in front of the beach) and the service is excellent. I stayed there on my own. I had a room facing the see with a lovely terasse. This place is perfect to relax and to enjoy the beauty of the island. I will definitely go back to Les Mouettes!!", "title": "Top hotel in Ajaccio", "helpfulness": 6, "user": "karel_ouendag", "date": "July 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115177283}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Arriving at Les Mouettes was really great after a bad hotel in Porto Vecchio.", "title": "Magnificent Hotel by the Sea", "helpfulness": 5, "user": "jcbm", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115021258}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Considering Ajaccio has no quality hotels, our experience in Les Mouettes was excellent. The room is not very big but we liked the decoration, bathroom OK. Take into account that rooms in ground floor may be facing the pool or in front of the ocean. Ask for this ones. Rooms in ground floors has no windows, just the entrance door, after the private terrace. We had no problem with this fact since there was one using the pool during the 4 days we stayed there.", "title": "Nice experience", "helpfulness": 2, "user": "Lydia r", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 141019688}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The lobby is very nicely decorated, personnel is excellent and helpfull.", "title": "Stunning location", "helpfulness": 2, "user": "Paul M", "date": "September 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141005249}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Wonderful hotel in a stunning location but you do need to upgrade to a 'sea view' room. Rooms that overlook the garden are on the roadside and not nearly as nice. Breakfast on the terrace was the best location ever! Private beach and sea water pool are brilliant. Only downside is poor service, especially in the evening if you decide to eat the limited menu the hotel offers - we waited nearly an hour to be served, even for drinks when there were only 5-6 other tables in use! At breakfast tables were not cleared after use which is not good for a 4* hotel. Apart from that we would stay there again.", "title": "Bad experience", "helpfulness": 5, "user": "LondonLinx", "date": "September 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 139334289}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Sorry but unless you book a room on a higher floor - beware of ground floor so called \"superior\" rooms - we had room 6.  There are no windows to let in natural light or enjoy the view. Just a small square window in the adjoining shower room which overlooked the pool. Thankfully it misted up as anyone could see in otherwise. The doors to the outside patio were  covered by a curtain.   The inner doors had to be attached by a hook to the heavy black outer doors to enable you to lock the doors.  Once shut all natural light was blocked out and you were effectively entombed in your white \"cell\". Air con was freezing cold and did not adjust sufficiently. If off the room was muggy and hot and airless. One room key was used for the door and hotel gates if you got back late ... 10pm!  On enquiring if this meant the key also fitted everyone else's rooms the receptionist became extremely irritable and lectured us about their \"system\".  At least there was a safe in the room! If the doors were opened to let in the light then anyone walking past from the ground floor rooms, the pool area and the breakfast patio area could all look straight inside -so no privacy at all! No dining room at the hotel and it's a 30-45 min walk to the centre of town for the best restaurants unless you want a beach bar.  Good points are a nice pool area and good wifi and the room was clean  The hotel is situated on a main road right next door to a Total petrol station. The car park is a dent in your car waiting to happen as it is small, on a hill and difficult to manoeuvre. Also beware the nasty departing surprise of the city tax charge. In our case 7.20 euros for 3 nights at the insistence of the frosty receptionist.  On checking later our holiday rep said we should not have been charged for this!  We were very glad to leave this hotel.", "title": "The perfect combination of French and Italian hospitality.", "helpfulness": 4, "user": "toni a", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138929985}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The final long stay, 3 nights, of a 5 week trip to Italy islands and Corsica. The hotel was the perfect last stop. Beautiful bay views, wonderful staff, and nice, clean rooms and grounds. Location walking distance to a market and room with refrigerator which made it nice to have handy some drinks and snacks for sitting out in our private, bay view terrace. Owner often onsite and there to make sure all was perfect with the stay. Easy to walk to the main part of town along the waterfront, and hotel had bicycles available to rent. Pool nice, and little beach had comfy lounges directly on the sand, which made it easy to nap in the Corsican sun. Staff all speak English, and they were willing to assist in suggestions for outings. A great place to stay in Ajaccio.", "title": "Nice location in Ajaccio", "helpfulness": 3, "user": "natetjl", "date": "August 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 138068110}, {"rating": 1.0, "title": "Rip off!!", "text": "After reading so many positive review on trip advisor we booked a room that was left. A garden room with a rear view. According to the picture that the hotel shows on the websites one thinks that is far away from the city, and that a garden room would be green with some flowers. They posted only one side. When we approached the hotel we could not believe that, first of all the hotel was directly next to a major GAS STATION which made us nervous and on a major street. Second, when they took us to our room after they opened the door it was a great disappointment. Basically the room was very,very small with a tiny terrace surrounded by a wall facing the major street. What a rip off!!. We had to leave immediately although we had already payed. We went 10min by car further down from their hotel and found a Fantastic hotel Dolce Vita, High End Best Western. Room were much spacious, modern, clean, very quite and with a fantastic view. Happy ending!!", "helpfulness": 10, "user": "Rahel L", "date": "July 25, 2012", "id": 135366676}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "Absolutely charming. Our room 20 was overloking the pool and the golf of ajaccio. The staff was very dedicated and professionel. They can procure you all your needs even a hairdresser on july 14, at 19,00!! The houseekeeping was so discret. A wonderfull place not to miss. Ps the owner of the hotel got married last saturday july 21, i do want to wish him and his beautiful wife all the best", "title": "The place not to miss", "helpfulness": 1, "user": "Caroll K", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135115900}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "There is a warm welcome in this hotel which has the highest standards of comfort in the bedrooms. We stay here at least once a year for a few days. There are a variety of room standards: charme, superiere, prestige and suite, I think. They all have the same standards of comfort but with the greater cost the sea views are better and there is more balcony space. Breakfast is good value if included in the room rate and a great choice of meat, fruit, bread, cakes and cereal. The pool and terrace are great spaces to watch the big cruise liners coming into port and the sun rise over the hills opposite.", "title": "Perfect for visiting Ajaccio", "helpfulness": 2, "user": "202Elizabeth", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134277157}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The hotel has parking which is a real plus in Ajaccio. The hotel is on the edge of this small but bustling city. It is a 20 minute walk into the city centre but the walk is flat and very pleasant along the sea promenade. We would not think of staying anywhere else in this part of Corsica.", "title": "Excellent hotel, exceptional service", "helpfulness": 2, "user": "700Paul", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133857248}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Thank you Trip Advisor for guiding us to this hotel. The bedroom, ours was no.20 with a sea view, was spacious and extremely clean. The food superb and service outstanding.", "title": "Holiday at Les Mouettes", "helpfulness": 4, "user": "Leigh L", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130663961}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "pros....location, great views, hot tub in which you can have a cocktail, good service, nice enough room.", "title": "V nice hotel but a smallish room", "user": "CPThomas", "date": "May 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160265535}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Cons... Small room even for a class up, no minibar/fridge, v low shower.", "title": "Hotel with confined spaces", "helpfulness": 5, "user": "HansKnenny", "date": "November 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 146281313}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "overall, recommended, especially for couples.", "title": "Attractive Hotel, Pool and Grounds", "helpfulness": 1, "user": "RingoGilkey", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 144245899}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I chose this hotel in Ajaccio, my experience was good but I expected more.", "title": "Relaxing Stay", "helpfulness": 2, "user": "Kit023", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142350523}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The pool area is wellkept and nice although a bit small.", "title": "Superb location, great pool", "helpfulness": 2, "user": "TonymLondon", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142054101}], "location": {"country": "France", "continent": "Europe"}, "stars": 4, "variance": {"poor": 9, "average": 15, "very good": 55, "terrible": 3, "excellent": 103}, "aka": "Les Mouettes Hotel", "slim_ranking": 0.0625, "description": "This distinctive hotel, a 19th-century villa, stands on a spectacular seafront, overlooking a delightful private sandy beach. The garden, shaded by ancient pine and palm trees, provides a Mediterranean décor at breakfast. The high-quality customer service goes hand in hand with the feeling of discrete luxury that fills this mansion. Large rooms with terraces providing superb views of the Gulf of Ajaccio. Guests cannot resist heading for the swimming pool and the beach."}