{"user_rating": 3.5, "review_count": 15, "name": "Hotel Restaurant du Lauragais", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "My wife and I stayed here during a cycling trip along the Canal du Midi. As others have said, the key characteristics of the rooms are size (small but ok), cleanliness (excellent), and age (brand new). Although the room was on the small size, the bathroom was roomy, particulary the shower. Overall the renovation has been carried out well. Also, it was nice to see an ascenseur when we were allocated a 2nd floor room!", "title": "Good place to stay if you're cycling the Canal du Midi", "user": "dg74", "date": "June 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 163179047}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "As we were taking a \"rest day\" we ate both lunch and dinner at the hotel's restaurant. Had a first class omelette for lunch. This was offered on the menu only as an entrée, but my request for a \"plat\"-sized version was accepted cheerfully. Indeed, service was both friendly and efficient. At dinner I had cuisses de canard, another local specialty, while my wife had fish (can't remember which kind). Both were cooked perfectly and were full of flavour. Definitely above average quality all around.", "title": "Try the casserolle!", "user": "Rolf S", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 159950988}], "location": {"country": "France", "region": "Midi-Pyrenees", "continent": "Europe"}, "variance": {"poor": 2, "average": 2, "very good": 10, "terrible": 0, "excellent": 1}, "slim_ranking": 1.0, "description": "Serge and Laurent Ruggeri welcome you every day from 8 am till 10 pm in a friendly and warm frame(executive).The hotel with restaurant was completely renewed and is very easily accessible: In 2 km of the highway A 61, taken(brought) out n°20, In 45 mns of the airport Toulouse Blagnac, In 10 mns of the village of marks(brands) Nailloux Fashion Village In 15 mns of Montgiscard A61 In 2 km of the lock of Renneville of the Canal du Midi."}