{"user_rating": 5.0, "review_count": 611, "name": "Hotel Seraglio", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My girlfriend and I stayed at the Hotel Seraglio for a few days in late August and have nothing but great things to say about it. The hotel is small and cozy with a great location only a 3 minute walk away from the some of the tourist favorites. Kenan at the front desk was very friendly and was able to give us tons of suggestions on what to do. I would definitely recommend staying here when in Istanbul.", "title": "Fantastic boutique hotel in the heart of Sultanahmet", "helpfulness": 2, "user": "adam761", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141136560}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Situated close to Sultanahmet Square, Agia Sofia and the Blue Mosque as well as the tram line to the Galata Bridge and beyond this well-run hotel is an ideal place to recover after an exhausting day's sightseeing. Our room was comfortable and spacious with a king-size bed and facilities - shower, air conditioning - which worked well - and all was spotlessly clean. Staff, especially Kenan at the front desk, were welcoming and ready with help and information whenever needed but never overwhelming.", "title": "Hopes and expectations fulfilled", "user": "Peony42", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140933686}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Breakfast was a feast that could set you up for the day, with sweet melon and plump fresh figs, yogurt, cheese and olives, mini crepes and choice of freshly made omelettes - or just toast if you wanted. We also appreciated the complimentary tea /coffee/lemonade, fruit and cake served daily to hotel guests in the bistro at tea time.", "title": "great location and room", "user": "Sue L", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140912994}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We just couldn't think of any negative points and, of course, would happily stay there again !", "title": "Great choice - excellent facilities", "helpfulness": 1, "user": "mytimenow", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140668824}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We found Hotel Seraglio on TripAdvisor and were very pleased. After touring around Turkey for nearly 3 weeks, we really appreciated the huge shower and comfy bed, something other hotels often lacked. The location is great and the neighborhood has lots of restaurants and a convenience shore. The room has a minirefrigerator to keep your Efes (beer) cold and a kettle to make tea or boil water to refill your water bottles. Complimentary tea/coffee, cake and fruit were served at the hotel's bistro in the afternoon. The staff were friendly and helpful. You won't be disappointed if you stay here.", "title": "This will be as good as you hope it will be!", "user": "LaylaTW11", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140639536}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We stayed in this excellent little hotel for three nights and would thoroughly recommend it to any traveller. Fantastic location, clean and comfortable rooms with excellent showers and a good breakfast. This place has all the essentials covered. The front desk is welcoming and very helpful with plenty of advice if you need it. There is no 'hard sell' on tours and there is a free computer in the foyer and the hotel will print off boarding passes etc for free.", "title": "A Wonderful Hotel: Stay There!", "helpfulness": 1, "user": "BillParis", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144535502}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotels in this area are quite pricey but the convenient and safe location is worth it. There are so many excellent restaurants in the area you will have some difficulty choosing!", "title": "Great hotel, wonderful service - will come back again", "helpfulness": 1, "user": "zhelezo", "date": "November 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144347718}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The hotel deserves the many fine reviews and there is little more that I can add or contradict. Due to its size, there is no pool or roof top terrace. I did find the lack of anything other than Turkish TV a bit disappointing though the excellent free wifi did make up for this. Perhaps a wider selection of juices at breakfast would have been good - I didn't realise that you could ask for freshly squeezed juice so we made do with the sweet watery squash instead. I rarely give a 5 in my reviews , but this hotel comes pretty close. Stay there - you won't regret it.", "title": "Great central location", "helpfulness": 1, "user": "AnitaB2008", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143995691}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We stayed at Hotel Seraglio for four nights in early October. We were happy to find a reasonably priced and conveniently located hotel in the old town /Sultanahmet. Our room was a good size for two adults and was very clean and pleasant. There were many tasty choices for breakfast at the hotel. The most pleasant aspect of our stay was professional service and helpfulness of the hotel's staff. It was especially nice to get advice and tips on sightseeing in Istanbul, as well as get help with transportation, etc from Kenan, who was especially cordial. Thank you Hotel Seraglio for the wonderful stay!", "title": "Good value, great service in Istanbul", "helpfulness": 3, "user": "Ted24", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 143761177}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Spent 4 nights here last week with my son (aged 11). We were absolutely delighted with the hotel and if you want somewhere central in Istanbul then look no further.", "title": "Fantastic stay in Istanbul", "helpfulness": 2, "user": "MarilynELocksHeath", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143469624}, {"rating": 5.0, "title": "Above and beyond the best customer service ", "text": "We stayed at the seraglio in November of 2011. The following year my parents decided to visit Istanbul, but unfortunately the hotel was fully booked. I asked them to stop by and visit with Kanan at the front desk and extend our greetings to him. Kanan went above And beyond to extend hospitality and help them arrange their tours and stay in Istanbul , even though they were not staying there. I can't thank you enough for the outstanding service that you extended to them. I will make sure that we contact you in ample time prior to our our next visit.", "helpfulness": 1, "user": "RanawashingtonDC", "date": "October 21, 2012", "id": 143375179}, {"rating": 5.0, "title": "Look no further! Could not fault it", "text": "I only stayed 2 nights but wished it could have been longer!", "helpfulness": 1, "user": "CliveH_UK", "date": "October 21, 2012", "id": 143327846}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The hotel is located in a quiet and very nice part of the old town, within walking distance of most of the major sights.", "title": "Small and friendly hotel in the heart of Istanbul", "helpfulness": 1, "user": "MichaelB186330", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143052306}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Hotel staff are friendly, helpful, and very attentive.", "title": "Excellent hotel - close to main sights", "helpfulness": 1, "user": "AlanDB56", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142982724}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "My room was very nicely decorated and equipped, clean and had everything I needed.", "title": "Kind staff, only one of them spoke fluent english", "helpfulness": 1, "user": "bellfort", "date": "October 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142772633}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Great location, large room nice bathroom, friendly and English speaking staff and great breakfast. This hotel, like a ton of other very similar hotels, is newly created from run-down houses turned into cute hotels--", "title": "Not a five", "helpfulness": 1, "user": "Kathleen G", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142602702}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The negatives? Stairs! Three flights, and the breakfast is in the basement. No terrace in sight. If you can find a hotel with a rooftop terrace, do it. Honestly we had three groups in different hotels within a block from here and they are really very similar. Go for best price or pay extra for rooftop terrace.", "title": "Amazing hotel with great offer and lovely staff", "user": "bergliot42", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142274445}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This is so close to the blue mosque and its call to prayer that you will be awakened at five AM and it goes on for at least ten minutes. But that would be true of all the hotels in this cute neighborhood. And there are hundreds.", "title": "Perfect for a City Break", "helpfulness": 1, "user": "CatherineRS", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141812020}, {"rating": 5.0, "title": "Fantastic hotel in beautiful Istanbul", "text": "We chose to stay at Hotel Seraglio in Istanbul for a week because of its good ratings and its close location near the great historic sites - and our expectations were even surpassed: it is a small 14 room-family-run-hotel, and the friendly receptionist Celal cheered us upon arrival with a drink of our choice whilst giving a first basic introduction into the highlights of Istanbul...", "helpfulness": 1, "user": "Debbie355", "date": "September 29, 2012", "id": 141556824}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Our room was absolutely fab, well furnished, a great bathroom, sufficient space for things, a working safe and a nice view and very quiet even though in the heart of Sultanahmet. The breakfast contained all you could ask for: fresh fruits, a variety of vegetables, bakery, jams, cheese, coffee, tea, juices and fresh omelet which the cook was happy to prepare.", "title": "Hotel with heart and soul", "user": "Three S", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141296047}], "location": {"country": "Turkey", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 3, "average": 6, "very good": 125, "terrible": 0, "excellent": 477}, "slim_ranking": 0.0220417633411, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "In the heart of the old town of the magnificent Istanbul, you will find the charming boutique Hotel Seraglio. The hotel has 14 tastefully and comfortably decorated rooms in different categories. Hotel Seraglio is located in the heart of world famous heritages in the historical Sultanahmet district of Istanbul. All the major touristic places are within walking distance. You can also go to Taksim/ Beyoglu in 15 minutes by streetcar."}