{"user_rating": 4.5, "review_count": 482, "name": "Hotel Nuevo Boston", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "This is a beautiful 4 star hotel with stylish reception area n lobby.the dining area was also v spacious n modern.the wifi was v strong everywhere incl.rooms.the decor in the galleries leading to the rooms was unique.room was big n beautiful,v nice.the bathroom was equally big,neat n clean with many complimentry toiletries n hair drier.the breakfast was also good but with same things daily.v had lil choice coz of being vegetarians.the staff was helping n English speaking.the best thing--they were runing a shuttle for n from airport every hour which saved lot of money.though the hotel was v far from the city centre where v had to go daily but the shuttle was the only solace.", "title": "A good experience to stay in...", "helpfulness": 1, "user": "dprakash533", "date": "March 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 154435265}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "I stayed in this hotel for one night on a layover between Barcelona and Miami. Really nice people who work there and nice atmosphere.", "title": "Excellent Hotel - Great Buffet", "helpfulness": 1, "user": "Robert_R_Cali", "date": "March 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154347053}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "The dinner buffet was really nice with a wide selection and tasted great. The cost was reasonable at like 20 Euros.", "title": "Excellent hotel near airport", "helpfulness": 2, "user": "Love_to_Travel59", "date": "March 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154254902}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "The room was huge all amenities, the only suggestion would be instructions on how to use the damned phone and TV.", "title": "Great value for money near airport", "helpfulness": 1, "user": "MisterBrot", "date": "March 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 153784165}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "I will be in Europa again in May and this will be my hotel of choice for my layovers.", "title": "Good experience", "helpfulness": 3, "user": "Nithesh E", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 152315918}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I was very impressed with this hotel. They were absolutely wonderful about letting me check in early from my overnight flight. I found the rooms to be extremely spacious, the beds comfortable, wonderful shower and plentiful amenities (loved the shoe cleaner!)", "title": "GREAT Airport Hotel", "helpfulness": 1, "user": "Backstreets1250", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158449910}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I had some issues finding the hotel shuttle when I arrived until I realized that you needed to call either in advance or when you land at Barajas. The departure using the shuttle was fantastic as I had an early morning departure (shuttle leaves on the hour - note for any of your travel plans.) So if you do not arrive on the hour, be prepared to wait.", "title": "Never again", "user": "pixie0427", "date": "April 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 157718473}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "They have a nice airport restaurant, but for my needs, it was too much. Instead, if you walk out of the hotel to the left, in about 15 minutes you come to a huge mall. There is plenty of shopping and a tremendous amount of variety and assortment of restaurants which will meet anyone's preferences and budget.", "title": "Convenient Airport Hotel", "user": "liseuc", "date": "April 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157468198}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "My only issues - and it seems to be a common complaint on TA - is the wifi. While it was free, it is really not very stable. I continually had to re-boot my computer in order to stay connected. I was able to accomplish what I needed, but in the end, I found out where the hotel had their complimentary business computers and made use of them. Even when the area was closed, the staff was gracious enough to let me in so I could print out my boarding passes. The only other issue is the climate control. One of the other TA contributors also mentioned that it is confusing. As it is a centralized system, you can only control the fan speed and not the temperature...but not a big issue as they have huge windows that open to let in fresh air.", "title": "Good hotel with great service", "helpfulness": 1, "user": "iPacifica", "date": "March 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 156003240}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I usually don't expect much at an airport hotel. The Neuvo Boston was a pleasant exception. Our room was large and comfortable. The bathroom was roomy as well. The parking garage was quite useful for getting our rental car ready to be returned the morning of our departure from Madrid. Breakfast was one of the best we had in our three week trip across Spain and Portugal. The hotel is only a few minutes drive to Barajas Airport. The only issue was getting to the hotel from the tangle of roads that surround it. Our GPS did not help us as it did not contain the hotel in it's data base. So, if you want to stay here, make sure you study your map in advance and figure out how to get off the A2 and on to the access road servicing this hotel. It's really a nice property and comes at an affordable rate.", "title": "Pretty Good Airport Hotel", "user": "highdesertbadger", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159995940}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Excellent hotel very good attention from arrival very good new rooms spacious bathrooms with everything you need for a pleasant stay in Madrid near the airport with own transportation to downtown and the airport, free internet in all areas of the hotel as well as a nice pool also , parking loose comfortable but breakfast very clean", "title": "Excelent", "user": "MadridCamilo", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159903445}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "close to major highways", "title": "Fantastic", "user": "Julia D", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159519956}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Only stayed here for one night after arriving on an evening flight and having to leave early next day. Fantastic clean rooms, great bathroom, excellent and efficient staff. Price of the room was incredible and pne would usually pay much more for a hotel of this callibre. Would highly recommend.", "title": "Good choice - but long wait for the shuttle", "helpfulness": 1, "user": "TheSuitcase", "date": "April 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159219003}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I stayed one night at Nuevo Boston Hotel in April 2013, after arriving with a late flight. I had written the hotel several times to confirm/get information on the free airport shuttle, but did not hear back until the day of departure. The hotel just want you to call them when you have collected your luggage (0034 – 917481613). I was told to wait outside the arrival hall at T1 (cross the taxi lane, and you will find the pick-up point for hotel shuttles), and they would be there in 15 minutes. I waited 45 minutes in the cold before they showed up. I called the hotel after about 30 minutes and was told that it would be “only 5 minutes more to wait”.", "title": "Joke experience at Hotel Nuevo Boston Madrid", "user": "Said E", "date": "April 26, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 158859804}, {"rating": 5.0, "title": "Good travel stop ...", "text": "Stayed here one night on a business trip with one day in Madrid. Everything was just fine ... clean facility, comfortable rooms, and absolutely no problems. Short 10 minute walk to an indoor shopping mall where the top floor is filled with a variety of restaurants and styles. If you are going to Madrid for more than a few days and want to see the main sites, I would choose a hotel closer to downtown or with better connections to the metro. This hotel is best for stopovers or to be near the airport.", "user": "Mark H", "date": "February 3, 2013", "id": 151352421}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Highly recommended if you need a hotel near Barajas airport. If you don't have a car don't stay at this hotel because it's far away from Madrid's centre and taxies are very expensive. Rooms were spacious and very clean. Free wifi and shuttle to airport. Very friendly staff. Nice swimming pool for the summer.", "title": "Great hotel near Barajas airport", "helpfulness": 1, "user": "Pelazi", "date": "February 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151310416}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "Hotel Nuevo Boston was a great Barajas airport stopover. There was an hourly free shuttle from and to the airport. The hotel itself was really clean and comfortable. I booked partially because of the gym facilities which are open 9am-9pm and has a well-working treadmill, elliptical cross trainer and exercise bike in addition to weights. Excellent. The hotel is a 20-minute walk from Alameda de Osuna metro station across a motorway and along some busy roads - for me this was fine. Highly recommended.", "title": "Great airport stopover", "helpfulness": 2, "user": "funkylittlefrog", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 151245390}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed 2 nights at the Nuevo Boston before getting our flight back home. This hotel had it all, free wifi, free shuttle to and from the airport, stocked mini bar, great quality overall. The shuttle is great because Madrid taxis used to make more miles to get more money. We paid about 60 Euros per night and no regret. There is a mall 10-15 minutes walking where we spend 2-3 hours during the full day we had there. We were tired and didn't want to go downtown. I highly recommend this hotel when you need a night in Madrid close to the airport. The only negative point was maybe the fact that our door was by the breakfast area and I was was awake by the dishes/glasses/cups noises when the staff was preparing the table around 6:00am. Great and very helpful staff, from the shuttle's driver, to the reception and bar people. There is a pool but it is outside and closed in winter.", "title": "Great stay before coming back home", "user": "AnneandCody", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150700477}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed at the Nuevo Boston 5th January 2013 for one night before traveling from Madrid to Mexico, and would highly recommend it.", "title": "Great one night stay", "helpfulness": 1, "user": "AndyTD", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150509049}], "location": {"country": "Spain", "region": "Community of Madrid", "continent": "Europe", "city": "Madrid"}, "stars": 4, "variance": {"poor": 10, "average": 39, "very good": 195, "terrible": 11, "excellent": 227}, "aka": "Husa Nuevo Boston Madrid", "slim_ranking": 0.0964912280702, "description": "Hotel Nuevo Boston is a 4 star business hotel in Madrid, located in a privileged situation, just a few minutes away from Madrid Barajas International Airport and from IFEMA exhibition centre, with excellent communications and public transportation.Hotel Nuevo Boston**** has been designed to offer original accommodation in Madrid and singular decoration that will surprise you from the first moment.Personalized service blends with the most modern facilities and with a wide range of services, making your stay a perfect and unforgettable experience, whether you are visiting for business or pleasure in Madrid.Among all Nuevo Boston**** services & facilities, stand out:- FREE TRANSFER (shuttle to the Airport) to/from Madrid Barajas airport 24 H daily. - FREE TRANSFER TO/FROM IFEMA EXHIBITION CENTRE on fairs. - FREE TRANSFER TO/FROM DOWNTOWN at weekends and bank days.- FREE Wi-Fi in all the rooms and common areas..- SUMMER POOL WITH SUN LOUNGERS AND CHILL-OUT AREA.- PRIVATE 24H MONITORED PARKING."}