{"user_rating": 4.5, "review_count": 130, "name": "Hotel le Croiseur", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "", "title": "Great location and great service", "user": "ptitekatia", "date": "August 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136811096}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Charming little hotel superbly well-located in st malo. It is true that the rooms are small and that you can hear your next door neighbours when they are in the hallway. But since there are only 3 rooms per floor this is really not a disturbance. The owners were extremely friendly, the room was spotless and continental breakfast was great. The only flaws are the lift that is extremely small and that must be reached by a flight of stairs and the big step to enter the shower. I would definitely come back to this hotel but would not recommend it to elderly people.", "title": "Exactly as described.", "user": "Ambrosia10", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135716652}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The hotel staff on our arrival (after 12 hours of travel from Poole via Jersey and Guernsey) were very friendly and accommodating, they spoke good English and were relaxed and helpful. We made use of the private car park which is a winding drive through the town and then underground (a bit of a faff) but once found it was very convenient. The room was small but very clean and modern with a very comfortable mattress. We didn't take breakfast as we always prefer to find a local boulangerie. Overall I would highly recommend this hotel for its friendly staff, reasonable price and central location.", "title": "Great position, Great service", "user": "Tashell", "date": "May 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130198894}, {"rating": 5.0, "title": "Friendly staff, clean comfortable rooms, great location", "text": "We arrived early and left our bags while we went wandering the old town.", "user": "vkborooah", "date": "May 6, 2012", "id": 129447212}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Our room was on the first floor clean and comfortable with french doors leading to a deck with chairs and table.The staff were extremely helpful with any of our requests and the breakfast was good value for a continental style.Overall a great little place to stay.", "title": "Perfect", "helpfulness": 2, "user": "Patrick P", "date": "March 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126833707}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My partner and I decided to pop over the france for a couple of days to have a short break. Having not visited the area before we were unsure of where about to stay. After looking online we found this hotel and thought it looked clean and modern and best of all good value. We were certainly not disappointed upon arrival. The hotel was perfect, just what we were after. Great location, clean & comfortable and friendly staff. You would pay double if it were in England. We will definately be beck to this lovely town and be staying at the Hotel le Croiseur!!", "title": "Great little find, we will definately be back!", "user": "Gina W", "date": "July 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69626975}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "I summarised above my feelings about the place. It is family owned, they are nice discrete people. The decor is modern, very sleek lines. Each room is minimalist, small but comfortable; the shower room is very clean and modern although a bit cramped. But you are in an old building inside the \"fortress\" so all rooms anywhere are likely to be a bit small. But it is very very clean and pleasant. Free wi-fi and satellite TV in all rooms. Breakfast is nothing special but not bad. Don't expect fresh fruits, eggs or anything cooked/hot but brioche, baguette and croissant with a big pot of tea or coffee. During my internet search for a room, most well located hotel with good reviews on tripadvisor like this one were either fully booked or a bit expensive (above 100 EUR per night). We paid 70 EUR and even had a private balcony overlooking the square below. Finally, it is very quiet, no traffic there! If I was to go back to St Malo, I'd book there again. Just maybe not have their breakfast but go to a creperie (there are like 20 of them nearby!) for a nice ham, cheese and egg crepe.", "title": "Modern, clean and friendly place at a good price!", "user": "ClemFR", "date": "June 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67970613}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed at this hotel for 3 nights whilst travelling from Roscoff to Caen. The location was brilliant, everything was on your doorstep, there is parking available at a cost of 10E per night which is in an underground private garage about 5 minutes away - well worth the money as parking is impossible in the citadelle of St Malo. The staff were very friendly and the room was very comfortable and modern. We had the luxury of being in room 15 which has french doors opening onto a large roof terrace with a table and chairs on - perfect if you want to spend the morning soaking up the sun.", "title": "Great hotel, perfect for our stay", "user": "LauraGreenhalgh", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 66860630}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "Modern, clean, attractive and in the perfect location, this hotel has everything you need. The owners are friendly and make you feel welcome and are always smiling. I truly enjoyed my stay on the 4th floor with balcony overlooking the fish market (Wednesdays only, I believe). Excellent free wi-fi included in the room rate. Owner made available a special rate at nearby parking just outside the city walls for 5 euro per day (in public lot that is regularly 1 euro per hour.) I would stay there again, and recommend it. Friends stayed at the Best Western Central and Le Chataeaubriand and I found both of those hotels dated and stuffy. Hotel les Croiseur is a gem.", "title": "Wonderful small hotel with excellent and caring staff.", "user": "allthenamesaretaken", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 40545542}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Lovely hotel for those travelling on a budget. Reception/bar area is very chic. Rooms are small but adequate and furnished to a good standard with flat screen tvs. The staff were very friendly and helpful. We stayed in two hotels in Saint Malo, this and the Ajoncs D'or and definitely preferred this hotel for its atmosphere and friendly staff.", "title": "Great little hotel", "helpfulness": 1, "user": "Desertsaffron", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33081520}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This is a small, clean and recently renovated hotel in a perfect spot in the atmospheric old town, It is a short (10 minute) walk to the ferry terminal and 20 minutes or so to the railway station - both walks flat and manageable wih luggage. The family that run the hotel are very nice, the price is great value and we thought it was perfect for a visit to St Malo. Look no further unless you want a beachfront place outside the old town for a holiday - not really the reason most go to St Malo as you could really be anywhere!", "title": "Location, warmth and value", "user": "Geewiz1948", "date": "November 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 120044924}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Our visit to St Malo was a list minute decision. A friend highly recommended staying in the Inta Muros area (inside the walls) and we decided to stay at Hotel le Croiseur based on Tripadvisor recommendations. As stated, The hotel owners and staff are incredibly helpful and we didnt want to leave either. Highlights included:", "title": "J'adore Hotel Le Croiseur!", "helpfulness": 1, "user": "JenY_Travels", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118012231}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "- walk around the bastides - really helps you get your bearings on Intra Muros", "title": "Great, friendly spot.", "helpfulness": 1, "user": "CMJTO", "date": "April 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103471512}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "- swim in the sea pool just outside the walls - take the Saint Pierre gateway for quick access", "title": "Highly recommended", "helpfulness": 4, "user": "LondonerinFrance", "date": "October 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83685166}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "- also near St Pierre gateway - try the galettes (pancakes) and cider at Corps De Garde (also only restaurant on the wall)", "title": "Great location, great price, wish we could have stayed longer", "user": "ChicagoBopper", "date": "October 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 83618629}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We had a 1 night stay whilst visiting St Malo -", "title": "A great little hotel", "helpfulness": 2, "user": "Caroline M", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146320702}, {"rating": 3.0, "title": "Nice,clean,central", "text": "The hotel is well placed in the old town near the bottom and secure underground parking is available nearby if you reserve it.", "helpfulness": 1, "user": "Michael O", "date": "November 21, 2012", "id": 145922040}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The hotel is clean and is modern and is not too big so not so many guests coming and going. The stair well could be a bit noisy but as with all hotels it is about loud guests rather than something a hotel can change.", "title": "loved this small and professionally run family hotel", "helpfulness": 1, "user": "kob", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142654494}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "I requested a quiet room and got one at the back so there was no street noise.", "title": "Very friendly, very central, good value", "helpfulness": 1, "user": "BtnJane", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141555814}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The room was small but manageble with some hanging space but you could move around and there is a small TV with a range of channels including the usual UK channels.", "title": "Good Hotel for a short stay", "helpfulness": 2, "user": "HarrowDoug", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140272413}], "location": {"country": "France", "region": "Brittany", "continent": "Europe"}, "stars": 2, "variance": {"poor": 3, "average": 8, "very good": 45, "terrible": 1, "excellent": 73}, "aka": "Le Croiseur Hotel", "slim_ranking": 0.111111111111}