{"user_rating": 3.5, "review_count": 124, "name": "Hotel President", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We stayed in this hotel the first week of December for three nights. The Hotel is clean and safe. Good resting place. The rooms and bathrooms are small, but they are ok compared to what the other Italian hotels offer in the area. The elevator (lift) is the smallest one I have seen in my life. We had a baby stroller that we had to fold everytime we had to use the elevator. Just a few negatives, but overall, it was a great stay. Good price for the stay, we paid 89 US Dollars per night. Found parking at the Hotel and did not move our car for the three nights we were there as we used the Bus to get to Venice every day - Bus can be taken from a stop that is about three blocks from the hotel - short walk. Recommend you buy the 24hr bus and vaporetto ticket at the Hotel's front desk - its about 12 Euro per person, but well worth the investment. The Bus you should take to Venice is Number 4 or 4/. The hotel offers a small cold breakfast (ham/salami/cheese/cereals/bread). We did not leave hungry in the mornings, though. The front desk staff was very helpful, especially Giovanni who gave us information about Venice, provided us with a map, and told us all about the bus system (24hour pass), and vaporettos. Overall great experience. Venice is beautiful. We departed Venice after three days and made our way down to Florence and Pisa. Have a great trip, enjoy yourselves! And if you havent already, visit Mexico - beautiful land with great people, sights, and plenty of good food.", "title": "Great Hotel - Good Experience", "helpfulness": 2, "user": "Oscarito", "date": "December 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6451892, "likes": {"liked": "— Clean, good staff, great location, close to public transportation", "disliked": "— size of rooms and elevator (lift)"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Ciao!", "title": "My family and I were very pleased with this hotel.", "helpfulness": 4, "user": "Hili", "date": "September 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 5881641, "likes": {"liked": "— Comfortable beds", "disliked": "— At the end of an exausting day of sightseeing in Venice the walk back to the hotel from the bus stop seemed longer than in the morning!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "My family stayed 4 nights in this hotel in August 2006 and were very pleased with it. The rooms were well appointed, the staff friendly and very helpful, and the breakfasts excellent. It was just a 5 minute or so walk to the bus stop that took us on the 15-20 minute journey in to Venice each day. It was definately good value for money and we would think of staying there again if visiting Venice.", "title": "Great Hotel, Great Service, No Internet, reasonable price", "helpfulness": 4, "user": "Rogoflap", "date": "May 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "service": 5.0}, "id": 5227263}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Really liked this hotel. Rooms were very nice, shower was small. Hotel is about 10 minute walk from 4 4/ busses that run to Venice about every 10 minutes. Also 10 minute walk to nearby mall and grocery store and open market.", "title": "Hotel in Mestre", "helpfulness": 3, "user": "winnie66", "date": "May 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5023919}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Desk help was wonderful. They gave us a lot of helpful information. Breakfast was great for a cold breakfast.", "title": "Great little hotel", "helpfulness": 2, "user": "oriyo", "date": "October 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4005089}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "I was surpsied by this hotel - from the outside, it doesn't look like much, but the lobby is beautiful and has the best bathrooms Ive sen in Italy. The elevator is a joke - only 2 people can fit if they each have a suitcase, but that's pretty typical.", "title": "Good, but not great", "helpfulness": 1, "user": "Lecia J", "date": "August 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 8515419, "likes": {"liked": "— Up to date", "disliked": "— Lack of dining options"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "My roommate and I had trouble, because our room smelt like something had died in it. We got our tour guide to get us another room, but it had the same smell. The third and final room was on a different floor and was huge! Very satisfied with how they handled it. The gentleman at the front desk also spoke English very well and joked around with us (especially when we had telephone messages from our significant others).", "title": "Great hotel", "helpfulness": 2, "user": "sells", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8472226, "likes": {"liked": "— the helpful staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Breakfast was lacking, but edible. There was only one place nearby to eat dinner at a little hotel up the road (about a 3 min walk), which had great pizza.", "title": "Great rooms!", "helpfulness": 3, "user": "lagorgonzola", "date": "August 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 8458395, "likes": {"liked": "— The rooms and bathrooms", "disliked": "— The busy breakfast room"}}, {"rating": 3.0, "title": "Mestre is not Venice", "text": "Overall, this was a good hotel and I would stay there again.", "user": "annaha", "date": "July 17, 2007", "id": 8139034}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I stayed at this hotel in May, and it was perfect. The staff was very very accommodating. The location was good, took a bus right to departing water taxis. I recommend this hotel esp for the price.", "title": "Good choice for visit to Venice", "helpfulness": 2, "user": "SAGlobetrotters", "date": "January 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6571404, "likes": {"liked": "— Friendly staff and quality of rooms", "disliked": "— Not much"}}, {"rating": 5.0, "title": "Very Satisfied", "text": "I arrived to Milano one morning at around 10:00am, rented a car and headed towards Venezia. I made several stops. By the time I arrived to Mestre it was 4:00pm and not really wanting to shop around. So I followed some signs and found Hotel President. I stopped, inquired and found their prices very reasonable considering the situation. I was surprised with the quality of the rooms. Breakfast was excellent. There is a promenade with plenty of shops, restaurants and cafes within walking distance (Galleria Barcella). The bus stop is about two blocks away (you can take a bus to Venezia and other surrounding areas). The bus ride is about 30 mins to Venezia depending of the time of the day and the day of the week. It is also near all the exits to all the freeways, the airport is about 20 mins away. The parking lot accomodates vehicles in a first come service mode. Thanks Stefano and Giovanni.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 16, 2005", "id": 3559055}, {"rating": 4.0, "title": "Hotel President", "text": "We stayed here in March and found it a great base for Venice with the bus stop a short walk from the hotel. The room was clean and modern with a nice plentiful breakfast in the morning. The staff were very especially helpful and friendly. We would certainly stop here again.", "helpfulness": 15, "user": "airlincs", "date": "April 1, 2005", "id": 3317832}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 12, "average": 37, "very good": 54, "terrible": 3, "excellent": 18}, "aka": "President Hotel Mestre", "slim_ranking": 0.59375}