{"user_rating": 4.0, "review_count": 243, "name": "Hotel Anabel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011", "text": "We have just come back from our nostalgic trip back to Lloret", "title": "Perfect Hotel for our stay in Lloret de Mar", "helpfulness": 5, "user": "Hirdy280", "date": "May 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106943724}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I went with my brother and sister,it was our first time back in nearly 30 years as we went there for family holidays back in the day !! also worked there .", "title": "quiet place in rave city", "helpfulness": 8, "user": "smkd1980", "date": "January 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 94742033}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "We were very impressed from the minute we arrived ,lovely reception area,Room 617 was a large room with 2 double beds and extremely comfortable beds and walk in shower", "title": "A great hotel !", "helpfulness": 3, "user": "misstt07", "date": "October 24, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 84611261}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Cleaned thoroughly every morning and fresh sheets !", "title": "very nice hotel", "user": "Rosalba82", "date": "July 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 72413794}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The pool area again very clean and great little outdoor lounge with sofa !", "title": "Simply PERFECT", "helpfulness": 1, "user": "LloretdemarSongoku", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71863707}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "There were four of us travelling on a short break from 17th - 21st October and booked this hotel online. We were all delighted with the hotel.. Starting with reception staff who couldn't have been more helpul to the bedrooms which were spotless with lovely decor throughout. We stayed in rooms 623 & 624 which gave us pool views and also the sun was in the verandah the whole day - lovely. Poolside bar food and drinks were great and good prices too and the staff were brilliant. We were half board and found the food to be plentiful and very tasty. The standard of cleanliness throughout the hotel was fabulous. Indoor pool and jacuzzi were great also. We were also very lucky with the weather which was warm and sunny.", "title": "Fantastic", "user": "AnneS1958", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119655204}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Only thing we would have liked the outdoor pool to be heated but this did not stop us from going in and enjoying a swim (although very cold).", "title": "hidden gem", "user": "bigG41", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119443512}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "All in all I would recommend this hotel to anyone.", "title": "a little oasis in the center of a busy town!", "helpfulness": 3, "user": "Helenfe77", "date": "September 18, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118266306}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Please go - you will not be disappointed.", "title": "Very unobtrusive and comfortable place to spend time", "helpfulness": 1, "user": "Proteuss", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117509238}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "on arrival at the hotel Anabel i was expecting problems because on the morning of my departure", "title": "Good for Loret", "helpfulness": 1, "user": "nathalievb", "date": "June 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114650525}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "Hotel located not far from the beach but away from the most noisy area. Nice big pool, although hard to find a sunbed most of the time. Food correct but not stunning - I was a bit surprised when in the morning I had to prepare my breakfast table by myself. Location of the forks/knives/spoons was pretty weird and first day I was completely lost. No real coffee - just the instant machine one.", "title": "Not bad", "user": "Marguerite-Anne", "date": "August 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136302903}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Staff was nice and helpful even with carrying the bags to the car (I had booked a parking but it was not in the hotel but nearby, no way to park anywhere nearby in the extremely narrow streets)", "title": "Mixed Opinions..", "helpfulness": 8, "user": "A164338", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 1.0}, "id": 127716098}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Rooms small and darkish but clean, a bit noisy in the evening if you have window facing pool/bar area. In general not bad for holidays hotel, but not sure if it deserves 4 stars.", "title": "Lovely", "helpfulness": 1, "user": "spot2203", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120108270}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "It was our first trip to Lloret De Mar for a short break of 3 days. After reading many a review on Hotel Anabel it seemed the perfect venue to stay, however I would never go back. After landing in Barcelona, it took over 2 hours on the Coach to get to the town itself. When we finally arrived, it was obvious that this wasnt a tourist friendly location. The hotel is in a built up area, surrounded by flats and local residents, with very few (if any) shops or restaurants nearby. We seemed to be in the middle of nowehere, away from the beach and in essence, felt confined to the hotel. However, we cannot take anything away from the hotel itself or the staff that worked there. It is clear to see why the hotel is 4 star, it is very clean, has a variety of offerings, and the staff are great. The only fault I could pick is that the variety of food per buffet isnt great, but this does alternate on a daily basis. It is one of the best hotels I have ever stayed in, and if it was located elsehwere, I would go as far to say it is perfect. IF you are looking for a short break and happy to spend all your time in the hotel around the pool, you will enjoy this holiday but it wasn't for me. One bit of advice I would give is to NOT book this through travel republic - it's that cheap for a reason!", "title": "It was good enough for me!", "helpfulness": 1, "user": "tonia81", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119937331}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I booked this hotel for a short break of 4 nights and was extremely pleasantly surprised.", "title": "Great Family Hotel", "helpfulness": 1, "user": "Gabriela S", "date": "October 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119784910}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Just returned from 4 nights at this hotel and had a great time. Quite expensive for full board and was shocked that no drinks were included not even water, we had to pay 1 euro for water and what ever drinks were ordered had to be paid for there and then. The hotel is lovely, spotlessly clean and the rooms comfortable except for the beds which as mentioned by other travellers were rock hard. Reception staff very helpful, pool lovely and plenty of sunbeds. Food was fine with plenty of choice although very sameish. Brits are outnumbered and this reflects in the choice of food. Only reason we would never return is the queueing for the restaurant ......... totally ridiculous especially evening meal. The breakfast is missable, lunch ok and the evening meal is chaotic. One evening no one showed us to a table so we found one and sat down. A few minutes later the head waiter approached me and asked how many of us were going to be sat at this table? I said 2. With that he informed me that this table was meant for 4 people and instructed the waitress to remove the two extra place settings including the one directly in front of me leaving me with nothing - how rude. About 10 mins later a couple arrived, was greeted by the head waiter at the door, they handed him something and he showed them to a table set for 4 people........... well make of that what you will... Our only complaint is in relation to the restaurant really, the breakfast tables are not laid and no one tells you where to get the cutlery etc. It is a free for all at the buffet with people jostling for food, pushing in and reaching over you to get things. The lunch is ok not so hectic but the evening meal is the worst we have ever seen. It opens at 7pm and the queue starts to form from 6.30 pm onwards. We went out and came back at 7.15 pm, the queue was all out in the reception, we went to our room, had a relax and shower and came down at 8.30 pm and the queue was the same!! We celebrated my birthday whilst there and decided we were not going to queue for food again and went to The Orient Express on the sea front - absolutely brilliant and well worth a visit. We intend to return to Lloret de Mar as we loved the area but unfortunately not the Hotel Anabel as we could not see any way the queues would change. The weather was fantastic and we loved the location of the hotel where everything is in walking distance, little streets, loads of shops and a lovely beach full of life with a fantastic beach bar.", "title": "Great hotel, almost perfect but not quite...............", "helpfulness": 5, "user": "tokar", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 140173419}, {"rating": 3.0, "stay_parameters": "Stayed August 2012", "text": "Firstly, I've never been motivated enough to write a review on trip advisor before, but regularly use the reviews on here as a guide on which hotels to book- much as I did with hotel Annabel which was No.1 in Lloret when I was looking. I won't put so much reliance on these reviews in the future.", "title": "Reviews misrepresent this hotel- not a relaxing stay", "helpfulness": 3, "user": "Nrichardson1", "date": "August 27, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 138504068}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "When we arrived (after a 2hr transfer) we were dropped on the main rd and loosely pointed in the direction of the hotel which was down a number of dark alleys/roads. It literally is right in the middle of a cluster of grubby looking residential flats- no view from any direction.", "title": "Nice place to stay", "helpfulness": 2, "user": "Paetmi", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 137160145}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The lobby of the hotel is nice, clean and spacious- reception were polite and helpful.", "title": "Nice, clean, welcoming, great location...", "helpfulness": 2, "user": "Tammytams10", "date": "August 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137150163}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Rooms are smallish, basic but kept very clean.", "title": "excellent hotel", "helpfulness": 1, "user": "Omer G", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 136463411}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 23, "very good": 100, "terrible": 3, "excellent": 109}, "aka": "Anabel Hotel Lloret De Mar", "slim_ranking": 0.0230769230769}