{"user_rating": 4.0, "review_count": 655, "name": "Hotel Acta Atrium Palace", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "The Atrium Palace was a great find in Barcelona! The hotel is in an excellent location in the Eixample area, within easy walking distance to Las Ramblas, two metro stations and the Placa Catalunya. The rooms are tiny but well appointed with great showers and nice toiletries. We had a room with a balcony overlooking the Gran Via, and it was quite nice to sit outside and read a book for a while after walking around all day. The traffic on the Gran Via is quite noisy, but the room must have extra thick glass, as you could barely hear any outside noise once you closed the sliding door. The staff was superb, and every restaurant they recommended was excellent. We booked our rooms online and were able to take advantage of the $7.50E breakfast price. The buffet is very nice with both hot and cold items as well as cappuccino's etc. on request. There is also free water and juice in the room minibars which are refilled daily.", "title": "Atrium Palace is an excellent choice", "helpfulness": 2, "user": "AKMCT", "date": "May 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3438485}, {"rating": 4.0, "title": "Very pleasant stay in Barcelona!", "text": "We would definitely stay here again, should we return to Barcelone.", "helpfulness": 3, "user": "Nancy M", "date": "April 26, 2005", "id": 3416973}, {"rating": 4.0, "title": "impressive atrium palace", "text": "We traveled to Spain for a company trade show. All our reservations were handled online. The hotel was very prompt in getting back to us by email if we had a question about our upcoming reservations. There were 18 in our party and we had 9 rooms. It was very clean and quiet. The service at the front desk was very helpful in setting up dinner arrangements and entertainment for our large group. The language barrier was not a problem. There was at least one person at the desk that spoke English every time we needed assistance with something. We were in Barcelona for 3 nights, we spent about 180 euro's a night but this included an excellent breakfast each morning. The rooms varied quite a bit in size and in view. Everything in Barcelona is tight packed. Our particular room was small but adaquite. The bathrooms were very nice and the showers excellent with plentiful hot water and water pressure. Some on the rooms had views of the street and were bigger in size, some looked at the brick wall of the building next door, some overlooked a school yard. We didn't go to Barcelona to spend time in our room so the size and view really wasn't an issue. The air conditioning worked great, for some reason the hall ways and elevators were very warm. The elevators everywhere we went were tiny. This hotel was no exception. We tight packed it into the elevator with just my husband and I and 5 pieces of luggage. These elevators were not built for wide bodied Americans!! The location was excellent for many of the sights. I'd reccommend this hotel for a pleasant but not extravagant stay in Barcelona. The use of the computers in the business center was free, everyone in our group enjoyed that feature. I never made it down to the spa or exercise area's so can't make a comment on them.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 25, 2005", "id": 3414716}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We have just returned from a 4 night stay (April 21-25) this hotel is lovely, ultra-modern and very clean. It has a fantastic location just inside the nicer area of \"Eixample\". The breakfast was a great offer at 50% and had absolutely everything and was well worth the full price it should have been!", "title": "atrium palace perfect little holiday hotel", "helpfulness": 4, "user": "katybStaffordshire", "date": "April 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3393687}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "The only disappointment was that we didn't receive our Cava. The \"Bus Touristic\" is a great facility and the visit to the Nou Camp was the highlight of our trip. After visiting and seeing some of the dicey hotels on \"Las Ramblas\" i am so pleased i stayed at this hotel. A great city with great food!", "title": "Lovely, comfortable hotel. Not so good Spa/Gym.", "helpfulness": 2, "user": "JayAd", "date": "April 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3369616}, {"rating": 5.0, "title": "i have found a home from home", "text": "I have found a home from home, ibis leeds centre is one of the friendliest hotels i have ever stayed in, you are always greeted with a smile, i have stayed here 4 times now and the team already recognise my face and always say hello mr......", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 16, 2005", "id": 3010740}, {"rating": 4.0, "title": "Awsome!!!!", "text": "The rooms are great, the hotel has been open since august 2004, and the quality is still the same, brand new! queen size bed with an ensuite power shower........no request is too much here the team are 24 hours and always help no matter what......", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 16, 2005", "id": 3010736}, {"rating": 4.0, "title": "Very Good", "text": "Breakfast is great i stay in ibis regularly, but this one is great they do cooked breakfast too!", "helpfulness": 3, "user": "Ender99", "date": "January 13, 2005", "id": 3005226}, {"rating": 5.0, "title": "great central hotel", "text": "The bar is open with a lovely atmosphere, if im in a quiet mood i can just sit and have my excellent meal bought to my table, or if its a sports night sit and watch my favourite team.........", "helpfulness": 2, "user": "helen", "date": "January 12, 2005", "id": 3002407}, {"rating": 3.0, "stay_parameters": "Stayed March 2004", "text": "This hotel is a nice boutique-style hotel in a great location in the city. Only a few minutes walk from La Rambla, the hotel offers good modern accomodation and pleasant staff.", "title": "Great apart from the noise", "helpfulness": 5, "user": "fekker", "date": "April 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3329512}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "However, don't be fooled by the Spa offering. This is NOT a spa hotel. The Spa features are tiny and, although, good quality, you'll feel that you're in a damp basement rather than a serene tranquil relaxation zone.", "title": "Great hotel in best location", "helpfulness": 5, "user": "Jonnyboyok", "date": "March 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3304453}, {"rating": 4.0, "title": "Comfort lovers this is for you.", "text": "Our stay was totally ruined by the location of our room which over-looked a square in the centre of the group of buildings - the square was a school playground. The air-conditioning didn't work in our room we had to sleep with the windows open. By 8am it was impossible to sleep and the noise continued all day until around 8pm (the school became a sports pitch at night). The sound of 200 kids screeming really drills into your skull after 2 days.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3280116}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "If you do stay at this hotel, don't accept a room adjacent to the playground from hell!", "title": "Very good value for money", "helpfulness": 4, "user": "SixtyDays", "date": "March 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3268812}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "This is an excellent hotel that is clean, quiet and comfortable. The rooms are well equipped and the sound proofing first class. The buffet breakfast is top value for money and relatively cheap if booked at the time via the hotel website (half price ) The free juice and bottled water is a nice touch as is the chocolates in the evening. The 24 hour free internet access helped add to that \"nice touch\". Overall the hotel is terrific value for money and ideally suited for those seeking somewhere quiet in a quiet area that is close to all the local ammenities. The only downside, though not everyone will agree, is that the bar and lounge area is very quiet in the evenings and closes at 12 midnight but the bar prices are amongst the cheapest in the whole of Barcelona. Excellent value for money and well worth a visit!!", "title": "Spa under renovatoin at the Atrium Palace", "helpfulness": 3, "user": "cardigan24", "date": "March 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3256970}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "We stayed here for 2 nights at the beginning of December for my husband's 30th. We booked direct with the hotel, requested a double room at the front on one of the upper floors, and got all of our requests. The room was clean, big enough, with free juice and water, and the hotel is in a fantastic location - it's only 10 minutes walk from where the Ryanair bus from Girona drops you, and a few blocks from the Ramblas. Good tapas bars nearby, which the hotel staff recommended.", "title": "Great hotel - recommended", "helpfulness": 5, "user": "Smokey-Smudge", "date": "February 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3232877}, {"rating": 5.0, "title": "Loved the Atrium Palace", "text": "We had to ask a couple of times for the complimentary Cava for my husband's birthday, but staff were very apologetic and brought it up. We didn't get a chance to use the pool - so much to do in Barcelona in a weekend! I thought the hotel was great value in such a good location and would definitely go back.", "helpfulness": 6, "user": "Algarvebird", "date": "February 20, 2005", "id": 3212286}, {"rating": 4.0, "title": "Lovely central hotel", "text": "We have just returned from a 4 night stay at the Apsis Atrium Palace and felt that we had to share our views so that everyone can have a great time in Barcelona.", "helpfulness": 5, "user": "MPL", "date": "February 2, 2005", "id": 3111171}, {"rating": 4.0, "title": "Great stay", "text": "The situation of the hotel is perfect and we walked everywhere - Las Ramblas, Latin Quarter, Gaudi Buildings and even the beach.", "helpfulness": 4, "user": "vossvol", "date": "January 30, 2005", "id": 3099222}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "We had asked for a nice room for our wedding anniversary and we were very pleased to be given a room on the 5th floor with views over the Gran Via. The room was very modern and clean, there was no road noise when the windows were closed so we enjoyed a good nights sleep.", "title": "great hotel!", "helpfulness": 7, "user": "cyndtan", "date": "January 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3090754}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "One of the most excellent hotels I have ever stayed. Spacious room, very well equipped, polite staff, nice bar, close to Rambla.", "title": "Excellent Hotel", "user": "klean", "date": "July 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8032978}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "After a long haul, we we're dying to get some rest late in the afternoon. Unfortunately our bed, as stated in previous postings, was \"rock hard\".", "title": "More Hard Beds", "user": "grant_lina", "date": "June 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 7998448, "likes": {"liked": "— Location, courteous staff", "disliked": "— Rock hard beds, external noise"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We eventually asked for extra blankets and placed them between the matress and the sheet. This seemed to work OK. The next challenge was the noise emanating from the evening soccer/basketball games in the school grounds behind the hotel.", "title": "Great location, great price", "helpfulness": 2, "user": "YorkshireMinsterman", "date": "June 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7938665, "likes": {"liked": "— Location/Price", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "As the hotel was fully booked, we couldn't change rooms.", "title": "nice hotel, price good", "user": "mrspaper", "date": "June 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7854207, "likes": {"liked": "— the location", "disliked": "— the mattresses"}}, {"rating": 5.0, "title": "Perfect!", "text": "That said, the hotel is in a great location, the staff courteous and the other amenities such as the basement pool and spa were great after a day exploring this wonderful city.", "user": "MCPO-USN-2011", "date": "June 8, 2007", "id": 7808540}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Location: Great location in the center of the city, one block from Passaig de la Gracia.", "title": "Great location, bad beds", "user": "limxela", "date": "May 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 7703783, "likes": {"liked": "— Location", "disliked": "— Uncomfortable beds"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Staff: Friendly staff, pleased to serve you. Shaving kits, extra towels, anything else you need will be in your room immediately. Very clean and thorough room cleaning.", "title": "Very nice indeed !", "helpfulness": 2, "user": "Gordy2", "date": "May 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7655822, "likes": {"liked": "— Very clean, modern, and in a good location", "disliked": "— Breakfast orange juice"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Breakfast: Very decent breakfast with great expresso. Great service.", "title": "Excellent stay", "helpfulness": 1, "user": "GeoffL", "date": "May 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7625102, "likes": {"liked": "— Cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Beds: Terrible beds - most (if not all) rooms have two double beds that slide apart on hardwood floor. To be close to my wife, I had to tie the beds together with towels. Very hard mattr essess. Only sheets for cover - no blankets. Pillows synthetic and hard.", "title": "A Super hotel. Enjoy.", "helpfulness": 1, "user": "incaman", "date": "May 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7570165, "likes": {"liked": "— location", "disliked": "— room could be noisy"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Booked this Hotel after reading reviews on Trip Advisor. We stayed for a night pre-cruise, and arrived about midday. Our room was ready and we were allowed into it right away.", "title": "Great hotel in a great location", "helpfulness": 3, "user": "Audie79", "date": "April 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7480799, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Excellent hotel for a short stay, room was a bit on the small side ( road side ) BUT you dont go to Barca to stay in the room.......The beds are very hard but thats what i like.Excellent location ( 2 blocks to Passeig de gracia and Las Ramblas ).........Air con was spot on, after spending all day walking in temps of 36 + it was a pleasure to walk into a cold room", "title": "Excellent hotel for a short stay", "helpfulness": 1, "user": "kaipbarrett", "date": "August 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8379408, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled with friends", "text": "FREE bottled water and FREE in room safe", "title": "Fantastic", "helpfulness": 2, "user": "BettyJScotland", "date": "August 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8283995, "likes": {"liked": "— Location, breakfast and friendly atmosphere", "disliked": "— Some noisy families in neighbouring rooms!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Central location. Clean modern rooms with good bathrooms and balcony. Twin rooms not vast - but ok. Great breakfast.", "title": "Cheap finishing - poor insulation", "helpfulness": 3, "user": "MarcLeuven_Belgium", "date": "July 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 8120787, "likes": {"liked": "— Trendy decoration", "disliked": "— very cheap finishing"}}, {"rating": 2.0, "title": "Bring your ear plugs", "text": "We stayed in this hotel from 27th December 2007 till 4th January 2008. We were given a spatious room at the front of the building overlooking the Gran Via. The rooms look great at first glance. At closer inspection you wil find that they are very cheaply finished. Sound insulation is below par especially between rooms. We were able to hear and understand the neighbours very clearly. The piping is done in such a bad way that every time a toilet is flushed or a bath tub emptied on one of the upper floors it generates an extremely loud roar which even wakes you up at night. The noise from the street side was acceptable. Our last night the poor plumbing finally gave way and the ceiling came down after the constantly battered piping had given way to yet another flushed toiled and emptied bath tub. We were appropriately moved to another room without further discussion. All in all : cheaply finished hotel, bad insulation, noisy, good location, over-priced. Maybe rather 3 than 4 star. Would not stay there again.", "helpfulness": 2, "user": "TetonCLT", "date": "July 14, 2007", "id": 8117056}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Nice room decor, clean, OK except for the noise!!! Our room # 307 was in the back area and just above an enclosed SCHOOL PLAYGROUND, which gave us no hope to sleep late. Additionally, this room had bizarre plumbing - every time the upstairs guest flushed or turned on the water, it would drian down through our pipes and toilet making very loud water running noises at any hour! The flooring also let us be aware of every step upstairs or in the hallway. Also the Housekeeping closet was next to the room, adding to the symphony of noise. When I asked to change rooms, I was informed there were none available.... This was by far the noisest hotel I have ever expereienced. The desk staff was polite upon arrival, those that knew English, but the wait staff in the bar and restaurant were chilly and very indifferent. Barcelona is a lovely city and we will choose to stay eleswhere on our next visit.", "title": "A very enjoyable stay", "user": "fwr", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8092335}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I recently stayed in the hotel for 7 nights and I want to share my experience with you:", "title": "Excellent location, friendly staff, great value for your $$$", "helpfulness": 31, "user": "traveller0808", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10091015, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Pros:", "title": "Good Value, Great Location", "helpfulness": 2, "user": "The4wardz", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10080707}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "-Convenient location – 25-35 minutes from the Airport (cost about 35-40 Euros), 2 minutes walk to the Passeig de Garcia and the Placa Catalunya Metro Station, 5-10 minute walk to Casa Batllo and 10-15 minute walk to Casa Mila, walking distance to the Gothic Quarter, Las", "title": "Wonderful hotel and location", "helpfulness": 5, "user": "Wood76", "date": "August 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8548398}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Ramblas, Waterfront, Zara is just around the corner, and walking distance to the numerous great shops on Passeig de Gracia (Gucci, Zegna, Montblanc, LV, Bally, Cartier, Burberry, etc.) and the department store (El Cortes Ingles) in Placa Catalunya", "title": "Great room, location, staff", "helpfulness": 2, "user": "Jannazg", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8538582, "likes": {"liked": "— Room, indoor pool", "disliked": "— spotty housekeeping"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "-The hotel is on a side street on Passeig de Gracia so it’s pretty quiet at night", "title": "loved this hotel", "helpfulness": 3, "user": "bonvoyage14", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8454837, "likes": {"liked": "— location", "disliked": "— room faced alley"}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 24, "average": 62, "very good": 267, "terrible": 17, "excellent": 285}, "aka": "Acta Atrium Palace Barcelona", "slim_ranking": 0.137404580153, "description": "Acta Atrium Palace is a 4 stars hotel located in the Gran Via de les Corts Catalanes, one of the main roads of the city of Barcelona and just few minutes walk from Paseo de Gracia and Plaza Catalunya.Acta Atrium Palace has 67 rooms decorated in a modern and subtle style and feature parquet flooring and Venetian stucco, with a cream and brown colour scheme."}