{"user_rating": 4.0, "review_count": 370, "name": "Hotel Kazimierz", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Just back from a great stay at this hotel, very characterful. Perfect location for sightseeing, the hotel itself is clean and tidy with friendly, helpful staff. Breakfast, included in the price, was plentiful and filling. Overall, an excellent choice.", "title": "Central location, great value!", "user": "sugarush62", "date": "September 6, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 176069903}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Absolutely charming place and location - near trams and shopping and decent places to eat. The Staff was fantastic - the breakfasts were also very good. Hosekeeping is impecable I was here for 5 days and hated leaving", "title": "EXCELLENT", "user": "Arla A", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175557243}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed here on the recommendation of friends and were very glad we did. It is in an ideal spot in the old Jewish Quarter so we could explore the area on foot. It is an easy journey by tram from the train station and, having arrived early in the morning, we were pleased we could leave our bags in a locked room and check in on our return. Our room was very spacious, being a triple, and the tea and coffee making facilities were very welcome. The bed was comfortable and the room was clean. The bathroom was fine, although it would have been useful to have some sort of shelf on which to store toiletries. There was a good choice, including hot food, for breakfast, although it would have been nice to have been offered fresh tea and coffee, rather than having to make your own (Nescafe Gold Blend) especially as the water was not particularly hot. The staff on reception were always very friendly and welcoming. On the last day, we asked if we could leave our bags as we were not leaving until late and this was no problem at all. Each bag had a tag on it and we had a card with the corresponding number to claim it on our return. There were some great restaurants close by for evening meals.", "title": "Great value, great location!", "user": "DebsB14", "date": "August 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 174815441}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Rooms clean and tidy. Great location for the cost. Great pubs and places to eat and an alcohol shop opposite and hotel staff were helpful with bucket of ice. Breakfast ok six of us staying and we all managed to eat a filling breakfast. The old town was in walking distance and close to many other must see museums and areas of interest.", "title": "Weekend in Krakow", "helpfulness": 2, "user": "Lisa C", "date": "August 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 174372722}, {"rating": 4.0, "title": "Great location, great stay", "text": "We were on our first visit to Krakow and were booked in to this hotel by our travel agent. Although we arrived at 10am and check-in wasn't till 2.00pm they took our bags and locked them away so we could get on with our visit. We returned at 1.30pm and were checked-in straight away. The room was nice with an extra bed and was clean and tidy. Bottled water was supplied every day and we got still instead of fizzy simply by asking. The room was cleaned and made up every day as well. Tea/coffee was replenished as well. There are no safes in the rooms, but we were given a security box in the locked luggage room FREE OF CHARGE with 24 hour access!!!", "user": "georgeStAndrews", "date": "August 25, 2013", "id": 173973515}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Friendly hotel very popular, we liked the buffet breakfast which had a good selection of cheeses and hams through to scrambled eggs. Our room very clean but could do with the furnishings being revamped. Had an occasional odour coming from the toilet/shower room. The surrounding area was in the throws of a facelift which is needed.", "title": "handy hotel", "user": "pocketsmc2", "date": "November 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 184712373}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The area is alive with bars and restaurants but not to noisey at night, and the bars we went to the people were very friendly.", "title": "\"Good place to stay\"", "helpfulness": 1, "user": "search4paradice", "date": "November 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184061745}, {"rating": 5.0, "title": "Great Hotel in Central Location.", "text": "The hotel is in walking distance to the most common sights, Schindlers museum, the castle and old town with its square with more shops and restaurants.", "helpfulness": 1, "user": "Maureen B", "date": "October 26, 2013", "id": 182433021}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "All in all worth every penny.", "title": "Excellent Location", "helpfulness": 2, "user": "Jim L", "date": "October 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 181711817}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "We arrived very late, after our flight was delayed and were still greeted with a smile by a man on reception.He welcomed us to the hotel and booked us in quickly and without fuss.We were very tired, went straight to our room and after a bit of a fiddle with the door lock,we were in.The room was warm,very clean and there was a sweet placed on our pillow.We stayed in room 8 and the view from the window wasn't very nice but we didn't look out that often!", "title": "Wonderful", "helpfulness": 1, "user": "Mhairi P", "date": "October 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 181404289}, {"rating": 2.0, "title": "Dated hotel", "text": "Good location near Old Town. Hotel has a lived in look; rooms are large with updated bathrooms. Breakfast buffet adequate. Major problem encountered with a light bulb over the bed exploding, sending flames and glass shards onto the bed. Hotel did move us to another room.", "user": "sherpa-charlie", "date": "October 14, 2013", "id": 180920547}, {"rating": 5.0, "title": "Good location", "text": "The hotel is located in a great spot to the city centre , lots of pubs and restaurants around . Close to wawel castle and others attractions in krakow . Staff were friendly and very helpful at all time .", "user": "Suka04", "date": "October 11, 2013", "id": 180599379}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We are just back from a 4 day break in Krakow and stayed in the Hotel Kazimierz, an immaculate hotel only a 10/15 minute stroll to the main square. Located in the Jewish quarter there many bars and restaurants in close location to the hotel without disturbing sleep. We would highly recommend Krakow for a city break and particularly this hotel which is immaculate and has everything you could possibly need.", "title": "Hotel Kazimierz", "user": "Brian A", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180093308}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We travelled to Krakow at the end of September with a group of friends. The hotel was in the Jewish quarter. The hotel staff were extremely friendly and helpful to all guests. It was ideal for a short weekend break. It is 15 mins from the main square but 2 mins from the square by the Jewish Quarter. The rooms are functional and I had no complaints for the price we all paid.", "title": "This hotel fit the bill", "user": "mick1518979", "date": "October 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179489123}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Just returned from 4 day break in Krakow stayed at this brilliant hotel. The room large and clean, breakfast to suit everyone's taste with plenty of choice. staff very pleasant and helpful. The hotel is close to the city centre, and there are a good selection of good restaurants nearby. Will definitely stay there again.", "title": "Brilliant", "helpfulness": 2, "user": "casmaw", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 176888060}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "so close to everything: synegogues,museums, the old city, bars and restaurants.best value for money, freindly and helpfull staff, food is ok, rooms are nit and clean. allwhat a tourist need in affordable price.", "title": "the best choice in kazimiers", "helpfulness": 1, "user": "bestsZagreb", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173481247}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "We had a great experience staying at the Hotel Kazimierz. The location is perfect, with lots of great pubs, cafes and restaurants nearby. The old part of the city (Stare Miasto) is only a short walk away. The staff was friendly and helpful, and the value was impeccable. The hotel had a charming atmosphere, and the breakfast-buffet had a great selection of dishes. Next time i go to Krakow I will definitely stay at Hotel Kazimierz again, and I recommend everyone else to do the same.", "title": "Great place!", "helpfulness": 1, "user": "raggafink", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173057336}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We love this hotel because is just only two steps from Kazimierz district, it is clean and quiet, the staff is very helpful and breakfasts are fantastic.Every time we go to Cracow, we stay in this one. Much better than Kazimierz 2 hotel.", "title": "Excellent", "helpfulness": 1, "user": "jedrus7", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171675348}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "I stayed here with a friend this month and had a very pleasant stay. On arrival the hotel looked lovely, much better than we thought it would be considering we got such a good deal on the price. The staff were brilliant and very helpful. The rooms were clean, the beds were comfy and there was more than enough room for the two of us. The breakfast was basic but more than enough variety for what we paid, there were cereals, yoghurt, fruit as well as cooked foods varying each day from scrambled eggs, bacon and sausages, as well as tea/coffee and toast. The location was great, the street was very close to bars and restaurants and just a 15 minute walk from the main square. I would definitely return to this hotel if I was ever to return to Krakow.", "title": "Great Hotel & Excellent Value for Money", "helpfulness": 3, "user": "Kelseashai", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171635819}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed at this lovely hotel in May this year, liked it so much we are going back this week to celebrate our anniversary. The staff were very friendly, polite and helpful. Our room was large spotlessly clean and very comfortable. Breakfast was a nice start to the day and there was something for everyones taste. We have been to Krakow a few times previously and always stay in this area, this hotel is our first choice now. Thank you to all staff.", "title": "Kazimierz Hotel", "helpfulness": 1, "user": "JacquiMcCarthy", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170486950}], "location": {"country": "Poland", "region": "Southern Poland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 42, "very good": 189, "terrible": 3, "excellent": 123}, "aka": "Kazimierz Hotel Krakow", "slim_ranking": 0.237288135593, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Hotel Kazimierz is located in a very center of Cracow - in the heart of Kazimierz district. Wawel Hill with castle and cathedral as well as the Old Town with Main Market Square, Floriańska Gate, Barbican, numerous museums, churches with colorful polychromies, gorgeous stained glass windows, astonishing altars, sculptures, paintings - are just within walking distance. Bernadka pedestrian bridge will guide you to nearby Podgórze district where each place has its unique history. Apart from convenient location we offer 38 comfortable air-conditioned rooms with private bathrooms. Excellent buffet breakfast is included in price. Wi-Fi, safe deposit, luggage room – all this amenities we provide free of charge for our hotel Guests. Hotel Reception Desk is open 24 hours and advice important information about local places of interest – sightseeing, tours, concerts and other arrangements can be made directly at the spot. Hotel also has a car park located nearby – prices are very competitive .The unique atmosphere of Kazimierz attracts with its mystery and originality."}