{"user_rating": 4.0, "review_count": 90, "name": "Hotel San Sebastian", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "I would have to say that generally I was very satisfied with the hotel itself. The location is good, close to Ondarreta beach (which is nicer for me than La Concha), in very nice neighborhood, with cafes, restaurants and supermarkets around, well connected with the city center by buses and within 20-30 minutes walk to the old part, along the beautiful Paseo La Concha. The room was good-sized, with comfortable beds, although the chairs were the worst I have ever tried. Bathroom was large, with a bathtub and good water pressure. A lot of space in the closet for clothes, LCD TV, etc. All in all, very nice and clean.", "title": "Good hotel, terrible service", "helpfulness": 2, "user": "Shule", "date": "September 3, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 19717268, "likes": {"liked": "— location, rooms, breakfast", "disliked": "— terrible service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Breakfast is not inluded in the price and it costs around 14 EUR and is well worth the price. Good selection of different foods, coffee, juices and everything delicious. Breakfast service was great.", "title": "nice hotel but", "helpfulness": 1, "user": "loughlin", "date": "August 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 19190843, "likes": {"liked": "— very high standard", "disliked": "— parking fees and charge for breakfast for 5 (wasnt expecting it)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "With all the positive impressions about the hotel itself, I was very dissappointed with the service in a 4-star hotel. Reception staff was rather cold and uninterested - they would not even look at you when saying \"good morning\" - although the check-in and check-out was smooth. The maid service was ridiculous - the rooms were well maintained and cleaned, but you could expect them to enter your room any time between 9AM and 5PM without even knocking. Even if your room had been cleaned up, they would just bump into your room again for no obvious reasons. It was actually funny to see on almost all doors along the hallway the signs \"do not disturb\" or \"please make up my room\" since it was the only was to \"communicate\" with the maids and prevent them from entering your room when they wished. Furthermore, the noise they were making was sometimes unbelievable - shouting between themselves, throwing beds in room above yours, vacuum-cleaning the hallways early in the morning etc. The service in hotel caffeteria was even worse. The staff was completely uninterested, you could sit for 20-30 minutes before they ask you would like something to drink. One time I was persistent to see how long they would look at me and ignore my presence - it took them 25 minutes to take my order (it was not crowded). The price for the same order was different every single time - I do not have a clue why.", "title": "A bit out of the way", "helpfulness": 1, "user": "christinehen", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7868239, "likes": {"liked": "— Cleanliness and spaciousness of room", "disliked": "— Location a bit far out of town"}}], "location": {"country": "Spain", "region": "Basque Country", "continent": "Europe"}, "stars": 4, "variance": {"poor": 4, "average": 19, "very good": 54, "terrible": 2, "excellent": 11}, "slim_ranking": 0.313725490196, "description": "The Hotel San Sebastián stands in the privileged district of Ondarreta just a few minutes from the beach. It has recently been renovated and offers its guests a host of modern facilities.The hotel has a total of 90 attractively decorated rooms equipped with every amenity for your comfort.The Ondarreta Café-Restarant offers you a range of gastronomic options, from sandwiches and mixed dishes to a delicious à la carte menu."}