{"user_rating": 3.5, "review_count": 589, "name": "Hotel Pineta Palace", "reviews": [{"rating": 2.0, "title": "OK facilities but the location is bad.", "text": "Like most Italian hotels, they made us rent 2 rooms for our family of 5. When we arrived, the rooms were not near each other and one of them smelled terribly of cigarette smoke. We begged for a change of rooms and got one closer to our other room.", "helpfulness": 11, "user": "St._Simons_Dad", "date": "July 9, 2005", "id": 3651469}, {"rating": 4.0, "title": "Very nice hotel", "text": "The front desk clerks seemed a bit unpleasant. Our kids affectionately named them \"Helga and the Burgermeister.\" The lobby was a little more spacious than most European hotels.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3638977}, {"rating": 3.0, "title": "Nice Time in Pineta Palace", "text": "The hotel was extremely hard to find. We kept our car parked in the convenient parking garage under the hotel. We used taxis and the shuttle to get us into town. We once walked to the little pizza restaurant roughly a quarter mile away, which was the only eatery within walking distance. The hotel had an OK restaurant though.", "helpfulness": 9, "user": "Sophiann1", "date": "June 23, 2005", "id": 3607488}, {"rating": 1.0, "title": "The People in Roach Motels in America are 100% Better", "text": "The view was of the old apartment buildings nearby and the entire surroundings were generally distasteful.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 21, 2005", "id": 3588996}, {"rating": 4.0, "title": "enjoyed our stay at the pineta palace", "text": "The typical European breakfast fare was not liked by the others in my family, but I liked it.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 18, 2005", "id": 3483498}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "I just came back from a 7 day vacation from Rome and stayed exclusively at the Hotel Pineta Palace. I read all the reviews and came away scared at what people were saying. Yet when I arrived it was nothing of the sort. The staff were courteous, bilingual, and easy to access. Sure it is not a luxury hotel but well worth the price I paid for my wife and I. The positives include a nice air conditioned room with a balcony, pleasant room service and breakfast, nice staff, and a superb shuttle service from the hotel into the city. The so called paper thin walls were mostly overexaggerated in my opinion. Sure at times you could hear the neighbors television on but not to the point that I could tell you what channel and what was showing. I slept perfectly and my wife is a light sleeper and she never missed one minute of her sleep.", "title": "Great Price, Nice Place to Stay", "helpfulness": 10, "user": "KenRuth", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 5489385, "likes": {"liked": "— The rooms, air conditioned, clean, and great room service.", "disliked": "— The location is far off from the city but the hotel shuttle more than makes up for it."}}, {"rating": 3.0, "title": "Average room for an average price", "text": "Not many negatives to report other than I got tired of eating the same breakfast every day, the eggs were more like soup. The distance to the city was a ways but the shuttle (4 euros) was well worth it and always available. The bathroom sink was a bit oversized but that's getting too picky in my opinion. The cleaning room service was excellent and always polite. If I had to go to Rome again I would definately book there again. It left a good taste in my mouth. When I left the desk service called a taxi for me and I was off. Check out was easy and painless.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5351392}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "I recommend taking the shuttle every day rather than going to public transportation to get into the city. Rome is a beautiful place but hot in the summer. Try to take what Rome gives you. Good luck and happy travels.", "title": "Basic but reasonable", "helpfulness": 3, "user": "LondonNeel", "date": "June 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 5333282}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "I booked this hotel based on the reviews from other trip advisor members. I too would agree this is an average hotel, priced fairly, quite a distance into rome area but easily acceptable by transportation. Hotel staff was courteous. Walls were paper thin, so thin we could communicate to my inlaws through the walls. Breakfast was fair. Clean dining area and rooms. Overall, this hotel was everything I expected and I would recommend it to someone who is looking for a budget vacation.", "title": "Replace the word Contemporary in describing this hotel with the word Basic!", "helpfulness": 2, "user": "KADNorthYorks", "date": "May 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5205678}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "We booked this hotel as it was cheap and rated as 4 star. While there was nothing to really like about this place, there was nothing not to like. I advise booking the delux room and paying that little extra as the bedrooms are very basic and lack soundproofing. You can hear everything going on next door. I advise requesting a room far away from the lift when making resrvation. Also request room with bath tub if you are planning on having a soak, as most of their rooms have showers only. Given how much we paid, the hotel was very reasonable, though I would struggle to call it 4 star.", "title": "Too far", "helpfulness": 2, "user": "Italy_06", "date": "April 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 5012015}, {"rating": 3.0, "stay_parameters": "Stayed August 2004", "text": "The rooms are very basic, but clean.", "title": "OK, but better to be closer", "helpfulness": 5, "user": "Nixsy", "date": "April 17, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4981623}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "On our next trip, we will be staying somewhere closer. We accesed city center/hotel by shuttle sometimes. Cost was 4 Euros per person. Same price roundtrip/one way. We only really needed it going back to hotel after shopping, and having too many things to carry. Otherwise we took bus to metro. Small amusement park nearby w/ bumper cars, arcade, swings, and bouncy gym for kids. My daughter really enjoyed that. Breakfast was okay, not great. Scrambled eggs were very watery. It was the same breakfast everyday. Would have liked some variety through week. Ate dinner there once, and that was very good, and reasonably priced. Beds were uncomfortable and hard. Shower is stand up, no tub and extremely small. Size of a small closet. Trying to give my 5 yr. old a shower was difficult, and almost impossible to keep the water in the shower. Sometimes it looked as though I had the shower instead of her. Walls are thin. Some front desk staff were a bit snobby. Would definitely recommend somewhere closer.", "title": "Excellent if you're resourceful", "helpfulness": 17, "user": "EasternPA", "date": "November 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4102302}, {"rating": 2.0, "stay_parameters": "Stayed October 2005", "text": "We selected this hotel because it was reasonably priced for a week and had a shuttle bus to the centre of Rome. This you had to pay for and only ran a couple of times a day. Taxi's cost us about 15 Euro to the Vatican - so an expensive week!", "title": "No way 4 star", "helpfulness": 4, "user": "CMink", "date": "October 26, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 1.0}, "id": 4053430}, {"rating": 2.0, "title": "4 star? I dont think so...", "text": "We ate dinner there once, was OK, but breakfasts were much better and plenty to eat.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 22, 2005", "id": 4043585}, {"rating": 3.0, "title": "Far but friendly", "text": "I think I would invest in somewhere closer next time - save yourself the taxi fares!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 16, 2005", "id": 4027242}, {"rating": 3.0, "title": "Pineta Palace hotel was very good value for money.", "text": "The Pineta Palace was really good value for money. I had booked this hotel before reading other reviews. I was pleasantly surprised with everything about the hotel. The breakfast had plenty of variety to choose from. The small bar does lovely club sandwiches(too much for me to eat). Our rooms were clean and spacious. The bathroom was also clean with plenty of room. The hotel itself was modern and stylish. The location was a long way out of Rome (about half an hour by road on the curtesy bus). We found this service invaluable. For only 4 euros return this was good value and time saving.", "helpfulness": 6, "user": "Jacs58", "date": "October 15, 2005", "id": 4024642}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We have just come back from spending 4 days in Rome having stayed at the Pineta Palace Hotel, having read the reviews on this website before going.", "title": "Excellent Hotel near the Heart of Rome in Quiet Location", "helpfulness": 15, "user": "Lambrias", "date": "September 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3892806}, {"rating": 3.0, "title": "not bad at all", "text": "Having only just returned we consider the previous negative feedback to be very harsh.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "July 24, 2005", "id": 3697338}, {"rating": 2.0, "title": "Ugh!", "text": "We stayed in a standard room on the 4th floor and our balcony had a magnificent view of St.Peters Dome at the Vatican. Having a balcony overlooking Rome truly was a bonus for us.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 18, 2005", "id": 3678893}, {"rating": 2.0, "title": "A great hotel if you don't plan on sleeping.", "text": "Furthermore, the Hotel has a very secure car park with cctv video link to security to open and close the elctric gates every time you take your car in and out of the Hotel. Furthermore, with parking in Rome being somewhat difficult the car park is a real bonus.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "July 15, 2005", "id": 3668885}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Just returned from a 5 day trip with friends all celebrating a milestone birthday!! The hotel staff were great, impeccable English , very accommodating to any information requests. Their local knowledge was excellent.", "title": "10 Northern lasses were impressed by the Palace", "helpfulness": 3, "user": "ChiantiSister", "date": "May 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7587467, "likes": {"liked": "— Welcoming atmoshpere of the Hotel staff and surroundings", "disliked": "— Nothing to dislike"}}, {"rating": 2.0, "title": "Pineta Palace", "text": "The little hopper bus service was super..if sometimes running later than expected.", "helpfulness": 1, "user": "cleowc", "date": "April 29, 2007", "id": 7480699}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel location was a good way out of the hustle of the centre of Rome.This suited our party really well.", "title": "OK hotel, inconvenient location", "helpfulness": 2, "user": "TorontoCart", "date": "April 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 7418620}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We had all read the previous reviews and were confused by the mix, however it does deserve to be a 4 star hotel the rooms were lovely well appointed and furnished fine.", "title": "Great Desk Staff", "helpfulness": 1, "user": "LadyDar", "date": "March 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 5.0}, "id": 6906825, "likes": {"liked": "— View of St peters from Room", "disliked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006", "text": "The breakfast room was fantastic with a huge choice of foods, fruits, juices, pastries etc.", "title": "Not totally thrilled with this hotel", "helpfulness": 7, "user": "Mattie291", "date": "November 13, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 6122039, "likes": {"liked": "— Proximity to Rome downtown-ease of getting there (shuttle, Metro within reach, potential to walk to town)", "disliked": "— leaking toilet that should have been repaired before we got room; really basic accommodation"}}, {"rating": 1.0, "title": "Ermm..", "text": "What on earth have we got ourselves in to here? I know, I know I should have paid more attention to the reviews on here, but for some reason my sensible head was having a day off. Right, we booked to stay at the Pina Colada Palace for one night before our return from Italy via Fiumicino airport. Here is a tip for all reading this, DONT DO THE SAME! Upon first entering the hotel it takes a while for the full horror of the situation to hit you, but you soon realise what the place reminds you of. If any of you were unlucky enough to be caught up in the great Costa Del Rubbish package tour boom of the 80s you will start to get a feeling of familiarity as the surroundings of the Pint Of Vomit Palace begin to assault your senses. If I am being completley honest the lobby and bar area of the hotel that you are first met with could be very nice if some money was spent on updating the decor and facilities. It is a nice size and is quite nice to sit in to relax, just close your eyes! Now I think about it, we should have stayed in the reception area, (with our eyes closed of course), and not ventured up to \"The Room\". I write it like that because it felt like we were in an 80s horror movie. And a note to make here is, who had the idea to put a strip of carpet halfway up the walls?? We entered the room and were met with worn out furniture, which looked like it was probably never nice in the first place. The walls were a lovely shade of peach, the bedding was white and blue and thinner than my hair and the bathroom was trying to burst out from its surroundings, not dirty, (which is a pet hate of mine), but not clean, especially the shower curtain. A nice touch in the bathroom was the way you had to slide yourself underneath the oversized sink to sit on the toilet which was actually underneath the sink.....madness! The wall behind the desk (or whatever it was supposed to be) had been dented and scraped with the desk like object but not repaired. The television looked it was also trying to escape but via a different method, it was trying to fly away, perhaps being near the airport had given it ideas. The balcony was smashing, at least as far as it was outside, although I cant help thinking that it was originally a feature of the bathroom that had actually managed to escape. I wish I had taken some pictures of the room so I could relay the full horror to you but I didnt want to damage the camera. Anyway, we managed to get back in to the centre of Rome that evening for dinner and decided to have too much to drink so we wouldnt notice the room when we got home. Breakfast at the Please Release Me Palace was at least in the morning, and that's the best thing I can say about it. The juice tasted of Tarmac, the other flavour of juice was actually orange squash, the croissants were once cardboard boxes and the cooked breakfast was cooked three weeks ago last Tuesday. Oh, I forgot about the lunch that we had the previous day from the bar. Breeze blocks with some (virtually tasteless) ham and cheese in the middle, delicious! But, even though the staff are at best, unsmiling and a bit grumpy (well wouldn't you be, working there?!) at least one receptionist was fluent in three languages at least so she should have no problems understanding your complaints.", "helpfulness": 10, "user": "The_Penguins", "date": "August 23, 2006", "id": 5701010}, {"rating": 4.0, "title": "Far away from everything", "text": "Anyway, to sum up, this place is a waste of space, it needs to be demolished, it is beyond help, it is a blot on the landscape of one of the most beautiful cities in the world, it has no redeeming features, other than you can at least leave if you do find yourself there by mistake.", "helpfulness": 6, "user": "HEATHROWHONEY", "date": "July 21, 2006", "id": 5494998}, {"rating": 3.0, "stay_parameters": "Stayed May 2007", "text": "I stayed here in May 2007, with a tour. The hotel is out of the way and difficult to find. It is however, quiet. The hotel itself is a bit outdated; the rooms are average European size with thin walls and hard beds. Breakfast was plentiful and in a very large room.", "title": "Alright hotel and location", "helpfulness": 3, "user": "Lecia J", "date": "August 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 8515316}, {"rating": 3.0, "stay_parameters": "Stayed August 2007", "text": "I would have prefered to stay more in town, but this place was fine.", "title": "pineta palce not bad at all", "helpfulness": 2, "user": "getaboutalotwales", "date": "August 20, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8458655, "likes": {"liked": "— friendliness of staff", "disliked": "— food was not good on the night i dined"}}, {"rating": 2.0, "title": "Not Bad...", "text": "stayed as part of cosmos italian masterpiece tour.pineta palace situated in a smart residential part of rome.plenty of little restaurants nearby.Staff very friendly rooms clean and modern.nice under used outside dining area.bar prices a steep even for rome.Dinner disappointing.Not a bad hotel overall.", "helpfulness": 2, "user": "Pennden", "date": "July 2, 2007", "id": 8042348}, {"rating": 2.0, "stay_parameters": "Stayed May 2007", "text": "I'd give this 2.5 stars actually. I was part of a large group tour - which this hotel caters to quite well (bus parking, large dining room, etc). The location is outside the city center of course but not by too much. The immediate area is walkable and seemed pleasant. We had 3 nights here, and all were fairly comfortable.", "title": "don't sweat the small stuff", "helpfulness": 5, "user": "initaly", "date": "June 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 7769329, "likes": {"liked": "— the shuttle service and the deck", "disliked": "— The rude staff. Some were great, most were not. The waitress at the bar was a vicious."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The rooms are decent sized and all have balconies which was a nice bonus from earlier hotels on the tour. The walls are DEFINITELY thin so be prepared... and our room at times smelled like a public restroom, although judging from the sounds we heard through the walls next door perhaps that was the source of the smell (ewww). In general the halls and doors seem tired - a bit like a college dorm.", "title": "Fine Hotel if you just need somewhere to sleep", "helpfulness": 5, "user": "lrjg1725", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 2.0}, "id": 7707506}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 88, "average": 162, "very good": 212, "terrible": 42, "excellent": 85}, "aka": "Pineta Palace Hotel Rome", "slim_ranking": 0.462992125984, "description": "Pineta Palace Hotel is a modern building located in a residential area nearby a beautiful pinewood, and only 5 kms from Vatican and downtown (30 minutes by bus). Easily connected by our shuttle bus and nearby public transportation (bus stop at 150 mt). It is only 28 kms from Fiumicino Airport and 10 kms from Termini Railway Station. The Hotel has 210 rooms (190 standard and 19 Executive) and provides to guests all services: typical Italian and Roman Restaurant, Lounge bar with outdoor terrace, internet point and Wi-Fi access in the whole hotel, private garage for cars, shuttle bus from/to downtown, fitness room, solarium terrace, and a modern congress centre."}