{"user_rating": 4.0, "review_count": 100, "name": "Hotel Ambient", "reviews": [{"rating": 5.0, "title": "great little hotel", "text": "Excellent three star hotel, had a duplex room with two TV's and a jacuzzi for 143 euro's a night, top floor rooms have a wonderful views across the city.", "helpfulness": 2, "user": "delar", "date": "August 22, 2006", "id": 5693838}, {"rating": 4.0, "title": "Good hotel", "text": "Ambient is certainly a good standard hotel for Romania. The rooms were very modern and spacious and the hotel itself would not have looked out of place in London or any European city.", "helpfulness": 1, "user": "mcg77uk", "date": "August 20, 2006", "id": 5628703}, {"rating": 4.0, "title": "Exceeded expectations", "text": "It's more of a business hotel than a tourist one however, and is expensive for the area. Breakfast was poor but other than that it was every inch a good three star hotel", "helpfulness": 3, "user": "johnnypiffle", "date": "May 3, 2006", "id": 5031665}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "We stayed at the Hotel Ambient based on the reviews here (reservation via email/website) and it certainly lived up to expectations. We had a 'matrimonial' double room, which came with a large modern bathroom and living space, a balcony, as well as a full length mirror on the ceiling above the bed! The hotel has secure underground parking & is only a five-minute walk to the square. The staff were friendly and helpful and recommended a great place, Bella Muzica (just off the square) for dinner. The food was great and very reasonably priced (3-course meal for 2 with two bottles of wine came to 30GBP!). It seemed quite popular and we were lucky to get a table, so book ahead! All in all, highly recommended.", "title": "Simply excellent!", "helpfulness": 4, "user": "archae01", "date": "April 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5019968}, {"rating": 2.0, "title": "Family run small hotel", "text": "We stayed in the Ambient one year ago. However, at that time, it wasn't listed with Tripadvisor at that time, and that's why our review is somewhat late.", "helpfulness": 5, "user": "selfcatering", "date": "January 10, 2006", "id": 4335651}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We just stayed here for three nights on a 10 day trip of Romania. I tried to check out some of the other hotels while we were there. Advantages of the Ambient - it is quite new - the 4* part is - the 3* part is older. I would definitely recommend staying in the 4* - especially if you are there in the summer as it has air conditioning. We took a business delux room with jacuzzi and it was very spacious and had a large bathroom. The weather turned very cold while we were there and we had to call down both nights and ask for the heat to be turned on - they had to call the \"owner\" to see if it was OK and then they turned it on for several hours - which worked fine. Also, this property has elevators - which if stairs is an issue - then this is the place for you. It is also very clean. The morning breakfast was OK - lots of local food - vegetables, etc. but filling. Our laptop worked great in the room.", "title": "Probably the best hotel in Brasov", "user": "Colleen_travelqu", "date": "October 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 84229531}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "Disadvantages would be that there is a ton of cigarette smoke in this town. We requested a non-smoking room - which we got and it did not smell like smoke - but the hallways smelled of smoke and if we opened our windows we could smell people smoking on their decks. Lots of smoke in the lobby.", "title": "Excellent hotel", "user": "Krogen", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78681554}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "It is located very close to the heart of downtown - 5-7 minute walking distance. Laundry service was very good. We had dinner with another couple that were staying at the Casa Wagner - they liked it but they were in their late 60's and were on the third floor - no elevator - and the room was small. Also - it is located right on the town square and on the weekends a very loud band plays in the square until quite late at night which I think might be distracting.", "title": "Well located. Generous, comfortable room", "user": "lemaCheT", "date": "August 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76513586}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Parking is secure. I would stay here again because I think it is the best option - but 4* in Brasov is not 4* in Budapest. It is a totally different world.", "title": "Mirrors on the ceiling!", "user": "JenLUK", "date": "August 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 76183866}, {"rating": 5.0, "title": "Great Hotel", "text": "14 friends travelled to Brasov, and lodged at the Ambient. Great, clean and perfect hotel. Especially the staff at the reception were not only as truly helpful as can be, they also spoke very good English, and all that with a warm sense of humour. Nice big rooms, beds a bit hard, but acceptable. Excellent breakfast. Location fine for walking into old Brasov - 5 minutes walk. Guarded parking right on the doorstep. Would stay there again anytime.", "user": "Laurina072000", "date": "July 22, 2010", "id": 71905232}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Better directions would have been helpful, although when you find the Ambient, you know it! Well located on a corner, my sister and I also found it confusing to enter the hotel property. Our room was in the same area described by bumbling traveler (below) and was also confusing--many stairs and hallways, but was clean and nice and the bathroom was fantastic. We were just passing through Brasov and were tired so ate at the hotel restaurant. It was one of the best meals of the trip! We were pleased that a non-smoking section was available and our waiter, Madalin, was a really friendly and helpful guy. The food was plentiful and delicious. The breakfast buffet was also very good.", "title": "Confusing stay (in an okay way)", "user": "alliswell252", "date": "January 1, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 23159379, "likes": {"liked": "— The restaurant--food was great, service was even better", "disliked": "— Geography of the hotel layout"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Good location relative to the historic town center, a bit too long to walk from train station. we were given a room in the top floor of an adjacent annex building -- no lift and one exit stair (fire trap!). I suspect this building was for staff housing, and the normal guestrooms were fully booked. Great breakfast buffet though! OK for a few days if you're passing through. There was a multi-lingual American guy working behind the front desk who was absolutely phenomenal and helpful -- he should be working at a 5-star hotel! Hotel is ok for a couple of days.", "title": "good location", "user": "bumbling_traveller", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 17978318}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I needed a hotel to stay for just 1 night in Brasov and booked directly with the hotel by phone.", "title": "A nice surpise!", "user": "rod020", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17917129, "likes": {"liked": "— geat value for money and very good service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Neither myself or my partnerI had ever been to Brasov before and was pleasantly surprised. The hotel was well situated on the edge of the old center, within very easy walking distance of the black church and main square.", "title": "Great Stay at the Pension Ambient", "helpfulness": 1, "user": "kcassidy", "date": "February 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13808441}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel was brand new (part of it was still under construction at the time of my visit and was very reasonably priced. The modern design, including the glass elevator in reception was pleasing and clean. The room was enormous and the beds very comfortable. The reception staff were extremely friendly and helpful. They found a guide for me who took me to Bran Castle and we ended up buying him and his fiancé dinner in a authentic (meaning used by the locals) restaurant.", "title": "Good choice", "user": "FerranC", "date": "November 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10708343}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Went there with my wife and a friendly couple for 2 nights.", "title": "very good choice", "user": "john_lewis77", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114617811}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The receptionist gave good rooms after we gave a tip and after that we were all happy.", "title": "A Modern find.", "helpfulness": 1, "user": "SJ13", "date": "June 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114308810}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Big nice rooms with cable fast internet. Underground parking, good breakfast and only a few minutes walk from the very city center.", "title": "Business hotel close to the old city area", "helpfulness": 1, "user": "CarpatBike", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 113261409}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Modern Hotel squeezed inbetween old rustic buildings. Secure parking, a must in this place but thats another story. Clean, tidy place with helpful staff that all speak excellent english. Breakfast better than most and a 10 minute walk or £2 taxi ride gets you to where you need to be. These modern hotels all built within the last few years are the way to go in Romania, especially if your from the west. I would recommend this place. One negative and to be fair its not just this hotel it seems that all of them over here let people smoke in and all over the hotel. So the smoking ban has not reached Romania yet! This hotel seems aimed at western business so maybe it would get it all if it put in a fag ban?", "title": "A very good choice not exactly in the historic centre", "user": "appenaorte", "date": "January 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 91934022}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel is new and clean, in the old area of Brasov.", "title": "Wonderful hotel with helpful and friendly staff", "user": "martysgirl", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84599349}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Hotel under construction, so be prepare to wake up at 6 30 am when people start to move and then workers are making lots of noise at 7 30 am", "title": "Nice room, but not 4*, lots of noise construction starting at 7 30 am", "user": "expertiz", "date": "August 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 8447776, "likes": {"liked": "— nothing", "disliked": "— the noise"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "It is not a 4 stars", "title": "Quaint quality", "helpfulness": 3, "user": "tcook052", "date": "August 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8402455, "likes": {"liked": "— Location, price, free internet", "disliked": "— hard beds"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "I spent four nights at this hotel in early August and would highly recommend it to anyone wanting a good, solid if unspectacular hotel to use as a base for sightseeing this region. It is a short 10 minute walk to the pedestrian only section of Brasov which offers many outdoor restaurants and cafes and is busy with locals and tourists alike.", "title": "Nice hotel with friendly staff", "helpfulness": 4, "user": "so3003", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6561493, "likes": {"liked": "— Friendly staff, good restaurant, good location", "disliked": "— The baker on the next street does a delicious pain au chocolat!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "The Ambient seems to have been built in stages as there are different sections visible from the street and I wound up in the newer section in a larger but spartan room on the fourth floor, room #403, which was a double bed with a view of a hill the hotel backs on to and offers mini-bar, large closet and bathroom with shower stall only. I often skipped the slow, small elevator to the fouth floor getting some exercise on the stairs again though anyone with mobility issues or who suffers from a touch of vertigo might want to wait for the elevator. The room itself was large but plain with a rock-hard bed and retro bedspread but the very pleasant surprise was the multitude of choices on the TV as there must have been 40+ channels with more than half being English-language choices such as Discovery Channel or BBC. While I don't usually spend lots of time watching TV while overseas, I did have a tougher time this trip with jet lag and so was usually awake for several hours each nite and having something on of interest was a nice thing for me. The mini-bar was only about twice the street price, which is a price I'm okay with paying for the convenience every now and then. I did stick to bottled water except for bushing my teeth but it is luckily quite cheap and plentiful both at the hotel and in Brasov shops as well.", "title": "Excellent stay", "helpfulness": 4, "user": "alzee", "date": "September 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5890691, "likes": {"liked": "— comfortable, clean, quiet", "disliked": "— the view from teh lift is not as advertsied"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The front-desk staff all spoke excellent English as do quite a lots of people in Brasov itself and Romania in general. I would recommend deciding soon after arrival what sights you want to see and how you want to see them as I left my decisions until about halfway through the stay and almost wound up with nothing tour-wise to take me to the nearby castles such as Bran or Peles Castles or Rasnov Fortress. Luckily, the staff acted on my behalf calling a local tour guides who made room for me for the next day tour of all three of these sights, which would've been much harder to see & do on my own. Bran Castle is the touristy, busy \"Dracula\" sight that really has next to nothing to do with the real Dracula and much more to do with separating tourists from their tourist dollars, but seeing it once as part of a full day tour was worth it to me. Rasnov Fortress and Peles Castle were both more interesting as almost all of Bran Castle has been rebuilt in the last 150 years and is far from the medieval sight lots of people expect. If you have limited time in Romania, I would highly recommend investing in a good guide book prior to leaving from your home and reading and studying the sights to get the most out of your stay.", "title": "Nice buidling, rude staff", "helpfulness": 5, "user": "Graham2109", "date": "August 30, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 5728600, "likes": {"liked": "— The staff, particularly the manager"}}, {"rating": 4.0, "title": "nice one", "text": "Stayed 2 nights 16th/17th sept. 2011.great check in,loved the \"on the wall\" lift with a view.Our room was large facing the front of the hotel good 4 star room with all you would expect.Excellent food and drinks served in the bar (thanks Hanjay).We enjoyed the restaurant,fillet steak as good as anywhere in the world!!Reception recommended a days tour in a private car for 90 euros which covered the area eg. Bran,Rasov,Sinaii etc. Great day out sad to leave. Good hotel !!!!!!", "user": "davidcarol", "date": "October 9, 2011", "id": 119111442}, {"rating": 3.0, "title": "Average at best", "text": "I stayed two nights at the Hotel Ambient on a tour of Romania. We were shown to our room. It had twin beds pushed together against a wall. The small window was a few feet away from the next building, with no view at all. I asked for a room where the beds were separated. I was shown the exact room one floor above. I asked, again, for a room where the beds were separated. At last, a room with the beds still together but in the center of a larger room, with a large window facing an old tiled roof. The shower was very small and leaked all over the floor.", "user": "ilex1", "date": "October 7, 2011", "id": 119041747}, {"rating": 4.0, "title": "Huge room, modern amenities, nice staff and breakfast", "text": "The buffet breakfast was very good. The buffet dinner had several entrees, none of them very good. The salads were very good.", "user": "ewickham", "date": "September 21, 2011", "id": 118423446}, {"rating": 4.0, "title": "Stylish hotel in Brasov", "text": "The location was good.", "user": "BlackXJ6", "date": "August 30, 2011", "id": 117467747}, {"rating": 5.0, "title": "Very Nice Hotel would use again & reccommend to others.", "text": "We really enjoyed staying here - our room was very spacious and comfortable. We stayed here for two nights while touring around Transylvania. It was not right in the city center, but was convenient enough. They had a nice breakfast included each morning and the staff was friendly and accommodating.", "user": "vanessatolson", "date": "June 22, 2011", "id": 114651092}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Ideally located between the old and new town. It is impossible not to notice the road. To the Old Town 5 minutes on foot.The room is comfortable and elegant and have been designed for relaxing. There are car parking (free for guests) and garage. There are very good restaurant. The breakfast are included in price. In our room (junior suite) were 2 gowns and slippers. There was double bed (very big), two armchairs and table, also there were TV, internet LAN (free), minibar (but not reasonable prices). In the bathroom with shower also in the bathroom was big and it has a window . Our room was cleaned every day. The staff is very friendly and complaisant.", "title": "Stop on the trip", "user": "IrVD", "date": "July 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33857308}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "Very elegant hotel well situated in the center of the city.", "title": "Very elegant hotel", "user": "bmc555", "date": "May 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29473388}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The room been great, with a wonderful view.", "title": "The best hotel I ever stayed", "user": "vall3ry", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29366010}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "The staff very polite and helpful.", "title": "Good staff, alright rooms", "user": "azjeans", "date": "May 4, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 29346167}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "It’s not my first stay in Ambient Hotel and each time I find this hotel the best choice in Brasov", "title": "False advertising re tariff.", "user": "Aussi2", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 4.0}, "id": 24901498}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Enjoyed our stay at the Hotel Ambient, room was suprisingly spacious with lounge area, and a further 'dressing room' area. Bed was about as comfortable as all the beds we slept on in Romania, very hard and felt the springs, but despite it's location in the centre of Brasov, had no noise problems etc.", "title": "Friendly staff in a central location", "helpfulness": 1, "user": "Tom083", "date": "June 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 66405230}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Staff were very helpful at all times, particularly on the main desk, when asking about restaurants, sights, etc. Free internet in the bar area also.", "title": "payed for deluxe room but got a regular...", "user": "talsterRomania", "date": "April 1, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 60098791}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "It was a great base for exploring Transylvania with a car. I wouldn't recommend if you are arriving by train, it would take a long time to walk from the train station.", "title": "The best hotel in Brasov!", "helpfulness": 1, "user": "ANA V", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52061064}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "My only 'niggle' would be that the hotel is divided into a 3 star and a 4 star part - I can see why they are going down that road in terms of attracting different clients, however, when checking in, the member of staff on reception directed us to our room \"you are in the 3 star part, I'm afraid there are lots of stairs to your room\" and other things, which could have made others feel a little inadequate! Good options at breakfast, couldn't complain with that aspect of the hotel.", "title": "Nice rooms, very noisy", "user": "neitsytmaria", "date": "December 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51898033}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "We were 5 person so we reserved 2 rooms for 2 nights, each one a 'deluxe' (4 star). When we arrived late and tired, we got a very basic room and I was very surprised. In the morning the receptionist (Sorin) - who was very nice and polite - changed our room to a one that was much better (a really 4 star room), but no refund was even given ...", "title": "What's 4 star about the Ambient?", "user": "travelalot99020", "date": "December 13, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 51166118}], "location": {"country": "Romania", "region": "Transylvania", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 18, "very good": 47, "terrible": 3, "excellent": 25}, "aka": "Ambient Hotel Brasov", "slim_ranking": 0.18, "description": "Ideally located in the centre of Brasov, a few minutes away from the historic monuments, elegant bars and glamorous shops, this hotel is a reference point for luxury accommodation. Enjoy superb views of the city, perfect service and culinary delights in the hotel's restaurant. Utmost attention is paid to every single detail, ensuring that you spend an unforgettable stay at the Ambient hotel. Don't miss to explore the picturesque Old Town of Brasov with its mansions of the late Middle Ages and elegant 19th-century buildings."}