{"user_rating": 4.0, "review_count": 2066, "name": "Hotel Paradise Park Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2009", "text": "I do think some of the reviews about Paradise Park are a little harsh! I read them before I went away and was slightly worried about what to find on arrival......worry not!", "title": "Relaxing Break", "user": "sld11", "date": "April 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27401902}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I've stayed in quite a few hotels in the past - Canaries, Spain, Greece, Mauritius, America and I found Paradise Park to be of a good standard. Admittedly it is looking a little tired in places but then it is 20 years old.", "title": "**** Thumbs up =] !", "user": "Jessica-1337", "date": "April 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 27371596}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "Our accommodation consisted of a lounge, bedroom, bathroom and two balconies. It was cleaned daily with a change of towels too. The restaurant had a wide range of food for breakfast and evening meal and even the fussiest person would be able to find a meal to suit. The staff were all very helpful, polite and friendly. Unfortunately the weather wasn't very good when we were there:( The roof top pool area is lovely with a view towards the harbour and sea. There is a bar area for drinks and snacks, which were reasonably priced. The main pool area is lovely and not too crowded with plenty of sunbeds.", "title": "Good place for a break", "user": "Matt10000", "date": "March 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 26994920}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We ventured to the main beach which is a 10 minute walk. The uphill return walk is not that bad if you are mobile and like exercise. We went to Raffles bar nearby which was by far the nicest bar in the area. There are plenty of shops nearby for snacks, suncream etc.", "title": "Never Again Paradise Park", "user": "Michele64Surrey", "date": "March 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 26654690}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I had a nice relaxing break at this hotel and would recommend.", "title": "Great Hotel", "user": "maxGlasgow", "date": "March 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 26563859}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Look I'll be honest, my husband and I are snobs and hate being around people when we're away chilling out! We hate chavs and noise and anyone who doesn't know how to behave properly! We are excrutiating to cater for and please! and we like luxury without having to pay over the odds for it! But we wanted a quick week away in guaranteed sunshine of Tenerife and not to have to trawl endlessly through t'internet to find somewhere half decent at a reasonable price. I'd looked at Paradise Park reviews on TripAdvisor and was a little worried but to be honest for what we paid (£630 for the week in a junior suite for half board) we were satisfied.", "title": "Great value for money", "helpfulness": 16, "user": "mrjohnsondog", "date": "November 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 10837841, "likes": {"liked": "— decent sized rooms with thoughtful decoration", "disliked": "— as usual, terrible pillows that make your head boil"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The rooms were large with a good size seating area and nice furniture; not that white MFI stuff!", "title": "Absolute Heaven", "helpfulness": 4, "user": "Boo31", "date": "November 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 10732418, "likes": {"liked": "— Beautiful accommodation and facilities", "disliked": "— Fair distance to beach"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Bathrooms fine, large, separate loo, separate shower and nice big corner bath with another shower!", "title": "excellent hotel and facilities", "helpfulness": 4, "user": "dagonlives", "date": "October 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10383812, "likes": {"liked": "— plenty to do, you could almost quite happily spend an entire holiday just in the hotel", "disliked": "— cant think of anything"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007", "text": "Two TV's, one large one in the lounge and one for bed viewing! It didn't go on much...only for morning news!", "title": "No way 4 star", "helpfulness": 2, "user": "AberdeenHappy", "date": "October 27, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 10377814, "likes": {"liked": "— going home", "disliked": "— everything"}}, {"rating": 4.0, "title": "Lovely Resort, great facilities", "text": "Nice balcony with sun all morning overlooking the pool and mountains.", "helpfulness": 2, "user": "bex0766", "date": "October 27, 2007", "id": 10377232}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The hotel is excellent and the amenities are first class.", "title": "Good hotel and amenities, just too far away !!!", "user": "scot5", "date": "May 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 1.0, "service": 3.0, "rooms": 2.0}, "id": 30698667}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Food: the buffet breakfast and Dinner is very good, although sometimes colder than should be, I spoke to fellow guest and they regularly used the microwave to heat it up a tad. otherwise great choices are available.", "title": "Just what the doctor ordered!", "user": "SEXYSHOES", "date": "May 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 30355163}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The restaurant staff were always on hand and very cheery.", "title": "Good service - Good rooms - Poor location", "user": "bimlico", "date": "May 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 29576456}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Room: ours on the 4th floor was tired and could be ready for refurbishment, although it was cleaned daily. The walls however are paper thin , but was bearable unless you are unlucky and get energetic couples living next door!!!!", "title": "Would defintely go back! Fantastic!", "user": "Mazz_9", "date": "May 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29439263}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Location: the hotel would be ideal if it could be moved a mile or so nearer the resort. it was about a 15 min walk to the beach, but a 30 min return with regular stops to get your breath back. There is a courtesy bus which runs to Los Cristianos port during the day Mon-Frid, but not in the evenings.", "title": "Just what we needed - great break", "user": "JoandJohn", "date": "April 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 28731158}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We booked this hotel before reading the reviews on this site and I have to say having read them after we booked - I was more than a little worried! - However - we found the Hotel to be - very clean ( yes it's supposed to be a 4 star but by Tenereife standards not UK) - the staff were pleasant and helpful- the 'Animacion' Staff were great (Thank you Fabrizio, James, Maria and Anna), - the food by the way was fantastic and CHILDREN ARE VERY WELCOME! - my only miniscule complaints were - the gym didn't have clamps for the bars! (OK so - I'm an exercise freak!), the pool bar/cafe closed at 5.30 p.m.! and a lady patrolled/cleaned the poolside in the early evening and made sure everyone was out of the pool and off the sunbeds by 7p.m.! Yes it's on a huge hill but the taxis rank is truthfully just around the corner and buses are frequent except for a Sunday. We have been to the island many times now and if we were to go back again - then I would check out availability here first.", "title": "What a relief!- and a Fab Holiday!", "helpfulness": 4, "user": "christiecrew", "date": "August 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8536710, "likes": {"liked": "— The Cleanliness, The Staff and the Food", "disliked": "— The time limits! - around the pool!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Great hotel! Great location for girls holiday - spa and treatment rooms were A-class and the rooms we booked (standard rooms) more than met our needs. We'd definately go back.", "title": "Fab hotel!", "helpfulness": 3, "user": "Maydeep", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8448944, "likes": {"liked": "— Rooms, service, extras (spa, treatments, numerous different pools)", "disliked": "— not in playa - we wanted to be in the thick of nightlife a bit more."}}, {"rating": 5.0, "title": "Great Hotel - can't wait to go back next year!", "text": "We have recently come back from the aptly named 'Hotel Paradise Park' and are still reeling from not being in Paradise anymore!", "helpfulness": 2, "user": "JaggieLondon", "date": "August 18, 2007", "id": 8446247}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Staff were friendly and attentive- we were on first name terms with many of them by the time we left - and the food was excellent. We planned to spend very little time at the hotel but ended up pottering around in the hotel for the whole week we were there as there was so much to do.", "title": "Hotel, Mwah, lovely, lovely", "helpfulness": 1, "user": "Bettyboopie", "date": "August 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 8428236, "likes": {"liked": "— The friendliness of the staff, the breakfasts and the Spa pool", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We treated ourselves to a couple of treatments at the spa and treatment rooms (I had a facial and manicure and my husband had a massage), which were a lovely addition to the week, and we rented a car from reception for one of the days and went to visit Mount Teide (also reccommended)", "title": "Fantastic", "helpfulness": 4, "user": "ScotlandRene", "date": "August 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8273746, "likes": {"liked": "— Room"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We booked this hotel for 1 night only, as we had spent a wonderful week on the island of La Gomera and needed an overnight stay in Tenerife ready for our early flight the next morning to the UK. Thank goodness it was for 1 night! We had a one bedroomed apartment; the first thing to hit us as we walked in was the terrible stale, foisty smell. The room was in desperate need of a complete overhaul - marked bath, rusty bathroom fittings, everything chipped and tatty, looked like the cooker had not been pulled out for years (food all down the side on the floor). Also, no air conditioning. Had our reservation been for more than one night, we would have complained. We chose instead to stay out in Los Cristianos as long as we could before returning to this dire room. My partner refused to sleep in the bed and stayed up to watch TV until our taxi arrived at 4 am. The only positive part of our very short stay was the very helpful young man on reception. Needless to say, we will not be returning.", "title": "Nightmare", "helpfulness": 2, "user": "AnnaNorthYorkshire", "date": "September 23, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 4.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 8863368, "likes": {"liked": "— Very helpful young man on arrival at reception, plus attractive reception area.", "disliked": "— The room."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We first saw this holiday on the website but then had to ring a travel company to book it. We were told all rooms were 4 star and had a/c. We booked an apartment as we didn't want to be limited to eat at the hotel. On arrival to the hotel we were impressed with the reception area but this was to be short lived as we were shown to our apartment. It was of average size but very dated. It was in need of refurbishment. There was no a/c. Foy my husband and I this is a definite requirement when booking accomodation - especially in July. We went back to reception to voice our concerns and ask for another apartment/room. We were told that none of the apartments have a/c. After some persuasion the duty manager said we could change to a hotel room (which had a/c) but there would be a supplement of 6 euros per night per person. We discussed this with him as we didn't think it was fair but he said to take it up with the travel agent. We paid the 84 euros but managed to get breakfast included in this price. On arrival to the second room we were a little disappointed as we thought this would be more like a 4 star room. It wasn't. I would class this hotel as a 2 star. Please bear this in mind when booking your holiday. The balcony was terrible. It had a \"roof\" and there was a barrier, probably for safety reasons, but this meant you couldn't see anything other than sky!! It also had bird excrement on the floor which was to remain for the duration of our holiday (1 week). The dining room was very big and breakfast was good. Lots to choose from and not too busy. The evening entertainment was a bit cheesy but what else do you expect?!! The pool area was nice and we didn't have any difficulties in getting any sunbeds. The location of the hotel was good if you don't mind walking. It took us around 20 minutes to walk to the centre of Los Cristianos which isn't too long but on the way back it was uphill. There is a free mini bus but we often walked past the queue and it seemed that not all of the people in the queue got on the bus. We would definitely not return to this hotel but would return to Los Cristianos as we really like it.", "title": "Not a 4 star", "helpfulness": 2, "user": "LindsayM", "date": "September 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 8755613}, {"rating": 4.0, "title": "Fab, good value hotel", "text": "Paradise Park resort in Los Cristianos is a really really nice resort. It has been given a 4 star rating which I think it deserves although the accommodation is probably a 3 star. I stayed in a self catering apartment which was a really really good size. We had a little balcony which didn’t look out over much as we were ground floor but it was very private.", "helpfulness": 3, "user": "sarahlew", "date": "September 18, 2007", "id": 8752908}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The maid service, which was every day, was really really good – couldn’t fault it.", "title": "Mixed views", "helpfulness": 1, "user": "MistyLady55", "date": "September 18, 2007", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 8751640, "likes": {"liked": "— Chambermaid came daily early, so room was clean and tidy all day", "disliked": "— Twin beds"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I ate in the hotel restaurant once and the food was pretty good and there was a huge selection in the buffet, a lot of which was cooked fresh there and then which was nice. The room service offerings were not vast but hit the spot for a weary traveller!", "title": "Can't wait to return", "helpfulness": 5, "user": "emmie_sc0t", "date": "September 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8687281, "likes": {"liked": "— Very clean & fresh", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "Great Hotel", "text": "We stayed that this hotel in the 1st week of October. We had a junior", "helpfulness": 3, "user": "np8by", "date": "October 19, 2007", "id": 10136562}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "suit, which was lovely and clean. The bathroom was really big with a massive bathtub. The hotel staff were friendly and very helpful. 3 day into our holiday we came back to find our bathroom ceiling was leaking from the lights. We called reception and someone came along to take a look, we were moved straight away to another suit we was very very nice. The bedroom was located upstairs and a living and dining room downstairs. It had it own private lounge where you could lie in the sun and no could see. The bathtub in the new room was amazing, very relaxing. I think this room was intended for 4 people but we were very lucky to have it. The hotel is in a good location and has a shuttle bus to town. All in all a lovely experience.", "title": "Good Facilities, Tired & Old Rooms", "helpfulness": 2, "user": "mat_n038", "date": "October 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 1.0, "location": 2.0}, "id": 10080408, "likes": {"liked": "— Sea View", "disliked": "— Old furniture & decor"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Liked the Breakfast Buffet, as long as you miss the 9am scrum, loved the spa pool, grounds & pool bar at the Atlantida complex.", "title": "Had a Fab holiday", "helpfulness": 3, "user": "MillymooYorkshire", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 10066085, "likes": {"liked": "— The space in the room and cleanliness", "disliked": "— No air con"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Disliked the old decor & very tired bathrooms, some surly staff & messages left with reception that we didn't get.", "title": "Great Hotel and Holiday", "helpfulness": 2, "user": "HolidayVicky", "date": "October 8, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10053786, "likes": {"liked": "— Food", "disliked": "— Drink prices"}}, {"rating": 5.0, "title": "excellent hotel", "text": "First room we were allocated was 6th floor overlooking the road, we changed the next day & a sea view made all the difference, although the rooms were almost identical.", "helpfulness": 3, "user": "bazookabilly", "date": "October 5, 2007", "id": 10042939}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had an excellent holiday at the Paradise Park, which is a beautiful hotel.", "title": "Excellent hotel and beautiful room", "user": "EHL123", "date": "March 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 26204462}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Unfortunately we don’t quite feel able to give it a 5 star review, because we were very disappointed to find that the Atlantida complex next door was closed for the entire week we were there, with no explanation. It had been crossed off the information leaflet in marker pen, but nobody gave a reason why it was closed, or when it would reopen. This was one of the main reasons for us choosing the hotel above others in Los Cristianos, because everyone raved about it, so it was quite annoying to get there and find it closed! It was such a shame, as you can see the complex from the rooftop and it looks amazing. They offered no recompense considering such a large portion of the facilities had been closed without warning (we were half board so they could have given us some vouchers for lunch, for example). The pools were drained and everywhere was locked up, sunbeds away etc, so it was obviously not a last-minute thing. Even the Atlante restaurant was closed (the nice a la carte located at the complex). If it hadn’t been for this, we would have given the hotel 5 stars, as we had a great time.", "title": "Good choice for couples", "user": "SVick11", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 26097758}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We were very worried after reading some of the reviews, but it seems that your overall impression of the hotel depends heavily on the type of room you book. Most of the bad reviews seem to come from those who booked a standard room, which are definitely in need of modernisation and fall short of the standards offered throughout the rest of the hotel. However we had a Modern Executive Suite on the top floor, and it was fabulous. It was huge, very modern, extremely clean and a beautiful view towards the sea. Easily the best hotel room we have ever stayed in, both here and abroad. There were two large single / small double beds, fitted wardrobes, a lounge area with a three-seater sofa and LCD TV (although only two English channels - Sky News and Zone Horror!), a bar area with a fridge and tea-making facilities, and a balcony that ran the whole length of the room, with two sets of the French doors from the bedroom and lounge. It made a change to see a proper table and chair set, instead of the usual white plastic! And it was great to sit and watch the ferries and boats come into the harbour. The bathroom was huge – a large sink unit, big corner bath, huge walk-in shower behind a frosted glass door (showerhead the size of a dinner plate!) and another frosted glass door leading to the toilet area. The floor and walls were marble and everywhere was spotless, with lots of fluffy towels and bathrobes. We’d taken toiletries, but next time we won’t bother - there is a huge Spa shop next door which stocks everything you need, and the hotel provide lots of things to tide you over when you first arrive – shampoo, shower gel, toothbrushes, shaving kit etc.", "title": "Liked the outdoor jacuzzis, adults only areas and indoor spa facilities", "user": "CCMBarnsley", "date": "March 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 25643437}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The hotel is beautiful and has a tropical feel, with lots of plants, flowers and water features throughout the hotel. The centre of the building is open to the air, but I didn’t see one insect the whole time, and the place is absolutely spotless. The decoration has a ‘Tuscan’ feel, with lots of terracotta and wrought iron. An interesting feature is the yellow house built into the wall – apparently this is the original farmhouse from the banana plantation that stood on the land before the hotel was built, so they kept it intact and built the hotel around it (it now houses the lift to the rooftop). There is a mosaic nearby showing the plantation as it was. We didn’t spend much time around the pools downstairs, but they looked very clean and never too crowded. In particular, the ‘natural’ pool looked lovely, I wish we’d spent some time in there. The hotel grounds were very nice, again very clean, with lots of flowers and places to sit. The best part for us was the adults-only rooftop terrace. We spent every day up there; it was so peaceful and got the sun all day. You had to go up before breakfast to ‘reserve’ (e.g. put towels on) your loungers. Not something we like doing but it is rife among some of the other nationalities, so if you can’t beat them, join them! Luckily our room was very close to the stairs up to the roof, so we went on our way to breakfast. We always got two loungers that were in their own little corner, surrounded on three sides by the glass panels (don’t look down!). Pool towels are available from the hotel, just ask at reception when you check in and they’ll tell you where to get them. The rooftop terrace has a snack bar which serves the usual burgers, chips, toasties etc. It’s not the cheapest place to eat (a small pizza, portion of chips and a soft drink cost 12 euro), but it was the easy option, and the views are lovely (and the pizza is nice!). On the other side of the snack bar, there are more sun loungers in private wooden gazebos with curtains, and steps up to the deck with a small plunge pool and two small Jacuzzis – the views from here are amazing.", "title": "Nice one", "user": "tebciak", "date": "February 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24844773}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "As with any buffet restaurant, the dining room gets very busy and crowded. But there are two smaller rooms just off the main one, where we sat for every meal (much nicer than the main room, only a few tables with nobody squeezing past you). Actually getting your food is a bit frustrating due to some guests being rude and pushy, and not waiting their turn. Breakfast is excellent. They have the usual fry-up items - bacon, sausages, eggs, omelettes, beans etc. There is also a stand with fresh fruit, tinned fruit and a variety of yoghurts. Lots of different cereals, dried fruit and nuts, different types of bread, gorgeous pancakes freshly made (had these every morning – lemon wedges available next to the teabags!) and dozens of types of fresh pastries. There are also various items on the main buffet stand – meats, cheeses, and other hot items (including, bizarrely, peas – which some people were eating!). Hot drinks and fruit juices are from a machine, and the queues can be long. But they are plentiful and free, so no complaints. We didn’t try the open-air lunch buffet, but it looked nice – you pick your meat or fish from the fridge and they cook it in front of you, and there are the usual salads, pasta, pizza etc on the buffet. It would have been very good value if we were on full board, but it would have cost us 9 euro each to eat in there, and after a big breakfast, we didn’t feel we would eat enough to justify that cost, so we just shared something from the snack bar. There is also a room service menu available from 8am to 10pm, and it is surprisingly reasonable. Dinner is very good with lots of choice. There are soups and salads, meat and fish cooked fresh (we had steaks one night and fresh tuna another night), vegetables, potatoes, chips, pasta, rice, stews, cheese, crackers, pate, breads, nachos – you can easily have something different every night (although things could be better described, it is a bit off-putting not knowing what something contains). Desserts are also good – dozens of tiny cakes and chocolates, gateaux’s and pastries, plus the usual angel delight / jelly / tinned fruit for the kids, fresh fruit, yoghurts, eight different flavours of ice cream, plus a hot option such as crepes or baked bananas. Let’s be honest, buffet food is never going to win any awards. But the food here was the best variety and quality of anywhere we’ve stayed. Admittedly, the drinks set-up is a bit strange. When you arrive at the dining room, you go to the welcome desk and are given an empty bill slip, which you take to your table. The waitress comes and takes your drink order, and then writes it on the bill. At the end of your meal, you take it up to the welcome desk and pay. The first night, we didn’t know what to do, so we sat for ten minutes before the waitress came to take the drinks order. After that, we went to get our food straight away, and she would normally come for the order when we were mid-way through our starters. The waitresses are so busy clearing tables, it is difficult to get their attention for a second drink. It would be much easier if they had a bar area, so you could go and get your own drinks. This would leave the waitresses free to clear tables, and would mean no waiting for guests. There were no free drinks with dinner, even coffee and water were charged, and the drinks prices were quite high – we stuck to soft drinks all week, but a tiny bottle of coke (mini-bar sized) was 2.40 euro, and you had to drink it out of the wine glass on the table. A bottle four times the size was 0.95 euro in the shop next door, so it is difficult to understand why they charge so much – especially as the drink prices at the snack bar are quite reasonable. Dress code for dinner is ‘formal’ but this just means no shorts, and no sleeveless tops or flip flops (for men – women can wear vest tops and sandals). Smart t-shirts are fine for the men, or a casual shirt. Anything goes for breakfast, although no swimwear.", "title": "We had a wicked time", "user": "lisahazel", "date": "February 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 2.0}, "id": 24726543}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My partner and I stayed at Paradise park betwen 6th - 13th Feb 2009. It is true the hotel is lovely and the area it is in, the food is excellent and the staff brilliant however we stayed in an apartment and whilst it was ok they are in need of a good re-decoration definately has not been since the late 80s, early 90s. The maids came everyday and delivered fresh towels and emptied the rubbish.", "title": "Lovely food and hotel", "user": "Jennie1981", "date": "February 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 24665171}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "However we had a great time as only small minded people would let deco ruin their holiday. We felt rested and tanned when we returned really enjoying our trip.", "title": "A nice but tired hotel", "user": "Glad2behome", "date": "February 15, 2009", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 24579855, "likes": {"liked": "— The very friendly and helpful bar staff and waiters", "disliked": "— The tatty bedrooms"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We thought we were staying in a 4 star hotel. When we arrived we found the male receptionist was extremely efficient and helpful. The reception area looked very nice as did the lounge area so we we very hopeful.", "title": "paradise?well almost", "user": "james23Glasgow", "date": "February 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 24538357, "likes": {"liked": "— the rooftop sunbathing terrace", "disliked": "— room decor"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "What a disappointment our bedrooms were. They were so TATTY! There were scratches everywhere on the fitments, cigarette burns and our toilet had seen much better days (it was clean but had turned a horrible shade of yellow.", "title": "Hotel nice, apartments poor.", "user": "bigsunfan", "date": "February 11, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 24466225, "likes": {"liked": "— pool area's are lovely", "disliked": "— apartment disapointing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "We went down to reception to report the poor condition of our rooms and the rude female receptionist told us that all Thomson rooms were tatty!!! and if we wanted a better room we would have to pay £25pppn. There were 4 of us staying for 14 nights that is a lot of extra money to find. The Thomson rep was horrified when we told her. Fortunately she was able to get us moved after 3 nights so we had 11 in a slightly better room. Our first room was 2 star and the second room 2 star plus!", "title": "Great for Shuffleboard fans", "user": "hunkahairybear", "date": "January 24, 2009", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 23852423, "likes": {"liked": "— The Staff were fantastic, everyone friendly, helpfull and pleasant", "disliked": "— Food- Dire is the word."}}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 4, "variance": {"poor": 106, "average": 306, "very good": 724, "terrible": 72, "excellent": 858}, "aka": "Hotel Paradise Park Los Cristianos", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Hotel Paradise Park Resort & Spa. Your hotel in Tenerife. Restaurante a la carte, spa, near to the beach and to the Reina Sofia Airport."}