{"user_rating": 3.5, "review_count": 927, "name": "Hotel Les Jardins du Marais", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "When booking this hotel online it looked like a very modern and up to date hotel. I had heard that the marais district was a nice place to stay, but i didn't realise that this hotel was actually located just off a main road in a really horrible area (not really marais at all)! The rooms were ok, but were small and not in keeping with the modern theme of the rest of the hotel. The kitchenette was bizarre too and made the room feel like a 2 star room. One of the buildings is being renovated and we too got woken up at 8 in the morning, which is not what you expect in a hotel. All in all I'd say that there are far nicer hotels in Paris for the same price and I would not stay here again. I suggest the latin quarter is one of the best areas to stay in, as it is close to all the sites and is a fun and safe area!", "title": "Not four star, better hotels for the same price in nicer locations", "helpfulness": 1, "user": "claire015", "date": "December 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 50430376}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed in the Renoir building,the room was spacious.Great location,close to subwaystation.only flaw was beakfast,bread wasn't fresh and terrible coffee!", "title": "Great hotel,good service", "helpfulness": 1, "user": "diva34_2008", "date": "November 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49875693}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Would defenitly recommend this hotel.", "title": "Abominable - Avoid, Avoid, Avoid", "helpfulness": 3, "user": "beefdripin", "date": "November 18, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 49488043}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Stayed for two nights, having booked as a \"top secret\" hotel through Lastminute.com. Never again will I choose a hotel anonymously. Paid £224 for two nights which is good value for a four start hotel in Paris. The only problem is, this is a two star hotel at best with the \"tick box facilities\" of a four star. Room was shabby. The room had no drawer space - with two small half-single closets next to the entry door. These doors also had the only mirrors attached. A 20 foot narrow passage ran to the bed which was crammed into a tiny space - no room for the bedside cabinet.", "title": "Big disappointment", "helpfulness": 2, "user": "kitztah", "date": "November 16, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 49314498}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The room was red hot and the air condition did not work. We had to sleep with the window open and blackout curtains were riddled with holes. There were two single beds pushed together - not a double as requested. All complaints were not dealt with.", "title": "Disappointing", "helpfulness": 1, "user": "SissaDublin", "date": "November 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 49108532}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Think that \"for Paris\" the hotel is ok.(I've had others). Room was nice, with a kitchenette, fridge, which helped to avoid the overpriced drinks at the restaurant. For two people travelling, it would have been small. One Chair, one desk, no rack to put luggage on. Also the room was outside the regular hallway, off the outside stairs. On the positive said very windows facing in two directions, on the negative was that the room was never really warm. (outside temp was 32' F / 0' C). Internet access expensive at 20 Euro/day.", "title": "Great Location", "helpfulness": 1, "user": "920dm66", "date": "March 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 58135586}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Best feature is probably the location, sort of residential with bakeries and little supermarkets, yet very easy access to public transportation, two metro lines and the bus.", "title": "Split personality", "user": "Rossysnob", "date": "March 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 58072691}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I booked this with lastminute.com but was aware through Trip Advisor that rooms were \"pot luck\". Am letting lastminute know separately what I think!", "title": "Didn't meet expectations but ok", "user": "Tinkgen", "date": "March 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 57790597}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Negatives:We could not get rid of a horrible bad drain smell in our room.", "title": "Ideal location - couldn't have asked for anything more from a hotel.", "helpfulness": 1, "user": "Tinkerbell2213", "date": "February 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56771084}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Why advertise that an item is provided e.g. bathrobe when it isn't?", "title": "Not worth it", "helpfulness": 1, "user": "iamaglobaltraveller", "date": "February 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 56753185}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I booked this hotel in Le Marais because I really love this magnificent neighborhood of Paris. I am used to go to the most beautiful hotel (i.e Meurice, Hilton Arc de Triomphe, Bristol, Plaza Athene...) and tried this one for the first time. It is really much more intimate than the major luxury hotels of Paris. It has been renovated (what motivated my choice at first). The rooms look fabulous, the staff very nice and helpful. They answered all my demands, from the special plate that the room service served me very late into the night even if it was not on the menu to the adapter that I needed to use my US devices. The welcome tray was nice and the atmosphere great.", "title": "Very pleasantly surprised! A real 4 stars hotel in Le Marais...", "helpfulness": 1, "user": "ruben5b", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56434852}, {"rating": 2.0, "title": "Average, very noisy and extortionately priced breakfast!", "text": "Diner at the restaurant (I invited some of my business meetings to eat in and they were all very satisfied) was great also. Next time will probably be with my fiance for a romantic trip in Paris in this wonderful hotel!", "helpfulness": 1, "user": "Prehistoric", "date": "February 17, 2010", "id": 56242853}, {"rating": 3.0, "stay_parameters": "Stayed December 2009", "text": "Just come back from a few days with an 8 year old and a 12 year old. The Hotel is very conveniently placed near a metro station a mere minute away. Also we had two rooms behind their own door - so it was effectively a suite. One room tiny - one an OK size and one with a kitchenette - useful. Minibar was a joke. Coffee/tea etc in one - but nothing to make it with - no kettle/coffee machine! Rooms comfortable if a little dingy and very poorly lit. Definitely a 3* level. Staff on reception very pleasant and helpful. Decor a bit odd (but that's what counts for style in Paris as France is not known for its interior design!) - lift worked (despite signs to the contrary) but it is very small. There are stairs....! The hotel is probably nicer in summer. BUT - and this is a huge BUT - our rooms faced the front street, opposite a bar that raves until 2am from Tues to Sat. It was unbearable - if you are given a room facing Rue Amelot don't accept it - it is unbelievably noisy even after an exhausting day of sight-seeing.", "title": "Hotel nice, staff nice but expensive", "user": "Banterbabe", "date": "February 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 56225924}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Also, we had a 'secret' deal which did not include breakfast - and the charge in the Hotel restaurant was E20 per person for breakfast - yes that is about £80 per day for breakfast!!! This is absolutely extortionate - a cynical exploitation. We would recommend the Italian cafe just outside the door of the hotel that serves a great breakfast for E6.50 per person, with a friendly bar owner. It is justly popular in the neighbourhood and you can drink in coffee and ambiance in equal measures. Even at the most touristy spots,(Eiffel Tower, Notre Dame) you can get breakfast for E10 per head. Quite honestly, if you have a family you would be better in a Best Western or something less 'chic' with better facilities.", "title": "Delightful base in busy city", "helpfulness": 1, "user": "DebsGYorkshire", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56144453}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "I took my Mum to Paris for her first trip to this hotel. We stayed for a long weekend. Managed to find the hotel OK and got taken through the lovely courtyard to our room. The room was smaller than the ones in the pictures and did not come with the tea making macilities, robes, slippers etc that were advertised. We popped to the reception and got a kettle but were not bothered about the rest. headed acros sthe road to corner bar/restaurant where I had the most lovely meal. Arrived back at our room to find that there was a club or something on the street behind our window. the noise was still on at 4am and the reception could not move us that day but said they'd arranged for us to move the next day. We headed down early as we wanted to move and still have the full day. By lunch time we'd been moved into a suite, which apparently should have been £600 a night - It was slightly bigger than the previous room and in a different building but still close to the noisy street. luckily the noise was only on the Friday night so we enjoyed the rest of the stay. if you can get the hotel on a deal then go for it as it's a good point for making your way about Paris - I wouldn't pay full price. It seems to have more of a conference and business centre focus than visitor. I think the courtyard would be beautiful in the summer though.", "title": "Excellent base for a Paris trip.", "user": "Dad185", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56049694}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We actually had a very good at the hotel \"les jardins des marais\". First of all, we were upgraded to a junior suite with no extra cost. We have booked through last minute as well. The room was spacey and clean in general. Also , the decoration was very nice and the bed big and comfortable. It is true, though that there was only one pair of slippers and I was not fascinated by the cleaning services as the room was not more tidy or cleaner than when we left. Moreover, the maid kept knocking the door and even entering (twice) in the morning of departure and I got really annoyed to be honest (although we left the room in time.", "title": "Good Service!! Great Hotel!!", "helpfulness": 1, "user": "Xanthi_10", "date": "February 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 55509689}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Apart from that, everyone was very helpful and friendly and the space, the \"gardens\", outside were amazing!! I wish it was summer to spend more time there. The hotel is well located and easy to get to central London. Wifi and restaurant were a pricey so we haven't used any of that. I actually liked the kitchenette as they provide you with some coffee and you can use them to have something if you want to.", "title": "Confusing mix!", "helpfulness": 1, "user": "AlexOLondon", "date": "February 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 55407674}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Overall, for central Paris I think it is a very nice place to stay and it will make you staying much more enjoyable!!", "title": "Don't bother. Complained to lastminute.com", "helpfulness": 1, "user": "Lovelylass38", "date": "February 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 54981459}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Recently stayed for three nights through a 'secret location' booking with last minute. Found the hotel to be a really confusing mix of good and not so good. The location is good - it's not actually in the Marais district but it's an easy 10 minute walk into the heart of the district and is close to the metro station thats well connected and easy to get to sights in Paris. Hotel looks a bit small and run down from the outside, but once inside the reception area, bar and restuarant are well decorated and appealing, if not a little obscure (clear plastic chairs and purple velvet!). Hotel rooms are in several buildings surrounding an inner courtyard that is pretty, with good outside seating and cobbled rustic feel. Our room was in the 'Ravel' building and this is where it gets confusing. One the whole the room was OK - it was clean, OK size, comfy bed, good bathroom (clean, well serviced and good shower and bath), fridge and quiet room. Decor a bit dated (but not terrible), strange kitchenette with 2 stove hob complete with sink, plates, pans and cutlery, which was useful in the end as no kettle, but felt very strange and out of place! Corridors were wierd - dark purple and black mosaic tiling, very narrow and smelt a bit strange, and lifts out of order while we were there (although reception did offer porter services if required). We had dinner in the restuarant first night, where service was very good and food very good too, but was very expensive! Staff on the whole were friendly. Just felt this hotel was trying to be several different things - the public spaces feel boutique, the rooms a bit old and tatty, and the outside space different again. Think the hotel has an identity crisis. Would recommend to those who want a room as a base to see the city thats comfortable and clean, would not recommend to those who want their hotel to be part of the experience of Paris or those looking for boutique chic. Felt our 110euro a night was a fair price but would not pay much more than this (certainly not the 300euro a night they advertise directly!) Think 3 star and you won't be dissapointed.", "title": "great location and public areas lovely!", "helpfulness": 1, "user": "jlo44", "date": "January 30, 2010", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 54771970}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Oh dear, what a place!", "title": "Brilliant positive surprise", "helpfulness": 2, "user": "UkSingleDad", "date": "December 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51278359}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 117, "average": 168, "very good": 358, "terrible": 61, "excellent": 223}, "aka": "Les Jardins Du Marais Hotel", "slim_ranking": 0.348020078081, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Composed of nine 19th-century buildings, one of which was the workshop of Gustave Eiffel, set around a spacious courtyard, the hotel is in Paris’ vibrant Marais district, just 400 meters from the Place des Vosges, the Picasso Museum and the Opera Bastille. Just 50 meters from Saint Sebastien Froissart metro station. Reception and Restaurant, renovated in 2004 are decorated in a contemporary style with black granite floors, velvet banquettes, and Philippe Starck furniture."}