{"user_rating": 3.0, "review_count": 60, "name": "Hotel Fuego del Sol", "reviews": [{"rating": 4.0, "title": "Great Little Hotel - Be Careful in Jaco", "text": "We had used Trip Advisor in researching hotels in the Jaco area and we were not disappointed. Great hotel, on the beach and with a surf break right in front of it. Apt#2 (2 bedroom suite - $115/nt) was all they had available and I was just looking for a standard room but for the few dollars extra it was worth it. Huge covered porch on the 2nd floor (nice breeze) overlooking the pool with a kitchen. The only negative about the room was no hot water. The \"Gang Surf Shop\" there is great. If you want to learn how to surf ask for Gilbert. If he can't teach you to surf nobody can. They also hooked us up with Chicklets Canopy Tour, again those guys were great and 5 minutes from the hotel. Manual Antonio Park, I've never seen a park where you had to cross a stream in a leaky boat to get to the entrance, no maps, no guided tours, no food, but beautiful white sand beaches and lots of monkeys. Take lunch and water with you. Jaco, restaurants, grocery stores, and more working girls at night than Las Vegas (no joke). I would have been real uncomfortable if I'd had the family with me on this trip. At least they take \"no\" pretty easily.", "helpfulness": 4, "user": "Krellijo", "date": "June 12, 2006", "id": 5335175}, {"rating": 4.0, "title": "Perfect getaway", "text": "My boyfiend and I stayed at Fuego last year and had a wonderful time. It was the perfect place to stay in Playa Hermosa for our surfing vacation. Clean professional..great views and breakfast we would not stay anywhere else. It is close enough to Jaco and far enough away from Jaco", "user": "A TripAdvisor user", "date": "May 27, 2006", "id": 5227932}, {"rating": 4.0, "title": "A Real Find", "text": "We travel to CR often for surf and the laid back way of life and are willing to sacrifice certain comforts of home in exchange. Feugo offers just enough comfort for us to relax while reminding us why we love vacationing in CR in the first place. We are returning to Fuego for our 3rd visit in December and highly recomend this hotel.", "user": "A TripAdvisor user", "date": "April 6, 2006", "id": 4942197}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "Clean, well maintained, excellent value and a great beach location. The staff are very friendly. A sun, sand and beach place to sit and relax for a few days.", "title": "Glad we didn't stay in Jaco", "user": "SoCalMark", "date": "November 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4094188}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "I just returned from Fuego Del Sol at the End of October and found it to be a nice place to stay. The staff was quite helpful with all of my requests. Granted this is not the Los Suenos Marriott, but it was much better than 90% of the places my girlfriend and I visited in Jaco. Very quiet and laid back atmosphere right on the beach, also much cleaner than the beach at Jaco. The only small issues was that our mattress could have been better, it was worn.", "title": "Love this little hotel!", "helpfulness": 2, "user": "Anita40", "date": "August 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3761264}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "I give the maid much credit, she did a great job cleaning the room. However, the bathroom, i never wanted to go into. some rooms had a stench coming from them because the bathroom septic tank must have been backed up. People had to switch rooms beacuse of this.", "title": "Would not stay again", "helpfulness": 1, "user": "SurfAddict", "date": "May 15, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3474057}, {"rating": 4.0, "stay_parameters": "Stayed June 2004", "text": "Food was o.k. to good. But the bathrooms will prevent me from staying there again", "title": "the best at Hermosa", "helpfulness": 6, "user": "eltomas", "date": "April 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3374988}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "It's been more than 18 months since we stayed at Fuego del Sol, but I had to post a response to the negative remarks I saw one of the other reviews. We've stayed at Fuego del Sol at least half a dozen times in the last three years. The staff has always been extremely polite and helpful. Some of the downstairs rooms might be a bit dank because of the low ceilings, but we always stay upstairs because the rooms have high ceilings and better ventilation. As far as the restaurant goes, you have to remember this is Central America, not Chicago. Schedules simply aren't as clockwork regular in this part of the world as in America, and when you only see two people in the restaurant, it means nothing is being served at the moment. The evening meal is usually the main meal here, and the restaurant at Fuego del Sol is better than most in Hermosa. Hermosa itself is mainly a surf ghetto, not a tour stop. Most of the rooms in the area have no air conditioning and are filled with kids who each pay ten or fifteen bucks a night to crash there. Jaco is ten minutes away and is packed with restaurants. Most of the people who stay at Playa Hermosa are there because the surf is better than Jaco, and most of the small hotels and cabinas here are dives suitable for backpacking kids. My opinion is that Fuego del Sol offers the best accomodations in Playa Hermosa, and it sounds like the other people just happened to catch it at a bad time. The Backyard also has nice rooms, but it also has the main bar in Hermosa and can be loud until late at night. It's also adjacent to the cutoff road that leads from the highway to the beach area, and we've heard of cars parked there being burglarized and trashed. If you're going to stay in Playa Hermosa, my vote is for Fuego del Sol, by far.", "title": "Quiet and friendly", "helpfulness": 5, "user": "traveller131", "date": "April 7, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3342403}, {"rating": 1.0, "title": "Awful", "text": "I don't normally add my comments on hotels onto websites, but I thought that the only other review of this hotel is so bad I had to add my positive experience.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 30, 2005", "id": 3311648}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Playa Hermosa"}, "stars": 3, "variance": {"poor": 11, "average": 13, "very good": 17, "terrible": 13, "excellent": 6}, "aka": "Fuego Del Sol Hotel", "slim_ranking": 1.0, "description": "There are 17 standard rooms available each with one full bed, a single bed, air conditioning, telephone, shower with hot water and a terrace with pool view. All rooms have Cable TV. Additionally, there are 2 Junior Suites. One is equipped with one Queen sized bed, a fold-out couch, living room area, furnished kitchen, private bathroom with hot water shower, air conditioning, telephone, Cable TV, and terrace with garden view. The other is equipped with one Queen sized bed, microwave oven, refrigerator, private bathroom with hot water shower, air conditioning, telephone, Cable TV and terrace with Ocean view."}