{"user_rating": 4.5, "review_count": 522, "name": "Hotel Dei Consoli", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Great hotel. We would stay there again. The rooms are a bit small but extremely well kept. Nothing, absolutely nothing was broke - it looked like we were the first guests. Breakfast is excellent. Aircondition is quiet and effective. The rooms are quiet, except if you open the windows. The location is good, close to the Vatican, and about 20 minutes from the old center. A taxi from the Termini Station costs about 30 EUR at night. Bring a good map from the booking website - Via Varone, the street where the hotel lies, is so short that most taxi drivers don't know it.", "title": "Great hotel", "helpfulness": 7, "user": "Danishtraveller1", "date": "September 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5825162, "likes": {"liked": "— Cleanliness, well kept", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "I was actually booked at another hotel, and was bumped at the last minute to this one. I'm glad I was, because this hotel was quite nice. My room was small (average size for an older hotel in a city), but very nicely appointed - wood paneling, fantastic crown moulding, beautiful wallpaper, and soft sheets. Even though my room faced a busy street, it was very quiet, probably due to triple pane windows. The cable was good - several channels in English. Also, the breakfast was spectacular - I wish I hadn't been in such a hurry to leave and could have enjoyed it more. The only problem was that the front desk attendant on duty for most of my stay was very cranky. He spoke English, and I'm sure would have helped me if I'd asked for anything, but would just be sort of surly about it. I'd still definitely recommend the hotel as a nice, luxuriously appointed small hotel near the Vatican.", "title": "A nice little hotel near the Vatican", "helpfulness": 2, "user": "Emmers00", "date": "September 16, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5806259, "likes": {"liked": "— Very luxurious for the price, with great location.", "disliked": "— Surly front desk attendant."}}, {"rating": 4.0, "title": "Great", "text": "Booked this hotel after fleeing from an unacceptable booking. The location was perfect, staff accomidating, great clean room, and breakfast was great. Near public transport, or the desk can arrange taxi. 4 blocks from St peter's A bit pricey but worth it.", "helpfulness": 6, "user": "kengun", "date": "August 18, 2006", "id": 5622315}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "We loved this hotel. We were on the 3rd floor and the view of the Via Cola di Rienzo (one of the main shopping streets) was entertaining but adequately silenced when we shut the window. The decoration is of a high standard, nothing distasteful, all very pleasing to the eye, very relaxing.", "title": "my 50th birthday treat", "helpfulness": 11, "user": "Bill&Gill", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5506366, "likes": {"liked": "— Air Con, comfort, Staff and breakfast.", "disliked": "— It was hot in the lift"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled solo", "text": "It's 5 minutes from St Peters Square which is simply stunning at night. After visiting the wonders of Rome during the day, the Hotel room is heaven to relax in and cool off. (it had been 40 degrees, to Hot!!). The air con is a blessing. The room was very clean and comfortable, the bathroom had all the facilities you require.", "title": "Great Hotel", "helpfulness": 3, "user": "aprilrays", "date": "July 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 5491764, "likes": {"liked": "— Staff was very attentive", "disliked": "— not close to nightlife"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Stayed in hotel mid-february. Had read tripadvisor reviews, have to agree with them. Bedroom small but adequate. Bathroom gorgeous. Very well maintained. Breakfast lovely. Quiet despite being beside a busy street. Staff helpful. Lots of shops nearby. Went to local restaurants, liked Lingua lunga? very reasonable for pasta and pizza. Short walk to metro Ottaviano. Buses a few minutes from hotel. Hotel arranged taxi from airport 40 euro. A very pleasant and safe location.", "title": "half-term break", "user": "catherine5", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6850355, "likes": {"liked": "— bathroom, breakfast", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Good base from which to explore a fantastic city", "text": "Booked a three night break in Rome for my girlfriend and I in Jan 07 to celebrate her birthday. As usual, used TripAdvisor to help me decide on somewhere to stay.", "helpfulness": 4, "user": "PeeSee", "date": "January 29, 2007", "id": 6712778}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The hotel is extremely clean and well kept, the buffet breakfast is more than adequate and all the staff are courteous and very helpful. Only real grumble (and it came as no surprise after reading reviews on this site) was the small room size; absolutely tiny! So much so that we couldn't even open our wardrobe doors fully due to their extremely close proximity to the bed. I'd have been hacked off if I was going to be spending much time in my room or if I was having an extended stay, however Rome is such a fantastic city that for a sightseeing break all you really need is a good location, a comfortable bed to crash in, and a decent bathroom The Dei Consoli fulfills these requirements spendidly.", "title": "A little gem!", "helpfulness": 7, "user": "poppy888", "date": "January 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6533044, "likes": {"liked": "— Location, beautiful rooms, friendly staff"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Rome is obviously packed full of sight-seeing opportunties - If you're particularly keen on the Vatican, then the hotel is within easy walking distance. In fact, most of Rome can be covered on foot if you're reasonably fit and healthy. (Having said that, public transport is reliable and cheap when the cobbled streets finally do take their toll, taxis aren't too expensive either). One important point about travelling around the city - the hotel is on a tiny street; make sure you pick up one of their business cards every time you go out because on more than one occasion we got into a taxi to return to the hotel and the driver didn't have a clue where to go!", "title": "Amazing City", "helpfulness": 6, "user": "Michele2", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 6330293, "likes": {"liked": "— The Location", "disliked": "— Very small room!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The hotel is also just round the corner from a stop off point of the 'Green Line' open-top bus tour, which you can hop on, hop off as and when you like. Highly recommend doing this.", "title": "The perfect choice in Rome!", "helpfulness": 8, "user": "HotelAdele", "date": "December 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6317269, "likes": {"liked": "— Super friendly sevice and pretty European flair", "disliked": "— No computer station in the morning, other than that, perfect."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2003, traveled solo", "text": "If you've never been to Rome and worry about getting lost as you tour around the city, this is the hotel you want to stay in. It's literally across the street from St. Peters (which can be seen from just about anywhere). The rooms, at least the one I had, are small (NYC style), but the customer service is superior. No problem with communication since most everyone was bi-lingual. Highly recommend Hotel Dei Consoli", "title": "Small Rooms but Great big service", "helpfulness": 2, "user": "pkelly8", "date": "December 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 6316826, "likes": {"liked": "— LOCATION, LOCATION, LOCATION", "disliked": "— Small room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We decided to book this hotel after reading trip advisor reports. The hotel lived up to the excellent reports in every way from helpful staff to quality of rooms and breakfast. The hotel is in a select area of Rome in a street full of quality shops and very close to The Vatican. A good way of getting from and to the airport is by Terrivision Bus to the main station Termini then by Metro to Ottivano which is only a 5min walk away.", "title": "A GEM", "helpfulness": 4, "user": "coolsailor", "date": "November 30, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 6308812, "likes": {"liked": "— POSITON", "disliked": "— NOTHING"}}, {"rating": 5.0, "title": "Best location in Rome", "text": "This perfect little hotel nestles in a side-street just a stones throw from the Vatican and excellent shopping. We were even in walking distance of the Coloseum, although the italian underground was very easy to use and cost next to nothing.", "helpfulness": 9, "user": "stormrx8", "date": "November 7, 2006", "id": 6083158}, {"rating": 5.0, "title": "A perfect oasis.", "text": "The Hotel really lived up to its four star rating , with polite helpfull staff, excellent decor and clean well equipt rooms.", "helpfulness": 18, "user": "fergusonni", "date": "October 13, 2006", "id": 5948242}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We would definately choose this hotel again.", "title": "Loved this hotel", "helpfulness": 9, "user": "misshr", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5930814, "likes": {"liked": "— location, breakfast, staff, air conditioning", "disliked": "— Visit St. Peter's at 7 a.m., and also get in line early at the Vatican Museum."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "After reading the reviews about this hotel at this site, my husband and I stayed here for 6 days in March. A small hotel, with elegant decor and a fabulous breakfast. We were lucky enough to be greeted by the nicest clerk, Mario. He was so welcoming that he set the tone for the rest of our stay (we did see the cold young lady who was mentioned in the other reviews and we were glad she did not greet us!) The hotel is small and is on the other side of the Tiber away from the hustle and bustle. If you are looking for grand lobbies, this is not the place for you. The Vatican is an easy stroll, and we walked to St. Peter's Square after dinner each night. We walked and used buses and the metro. We even took the metro from the airport.", "title": "Excellent small hotel near the Vatican", "helpfulness": 16, "user": "CentralNYTraveler", "date": "April 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3348900}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My fiance and I have just returned from a three day stay at the Dei Consoli. The hotel is cute and quaint and has wonderful service. It was so difficult to return home after our stay here, since the Dei Consoli is located just minutes away from the Vatican, but located on a bussling street with great shopping and eateries.", "title": "Quaint and romantic Dei Consoli", "helpfulness": 2, "user": "CALove2travel23", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7278565, "likes": {"liked": "— Service, the room and breakfast", "disliked": "— none"}}, {"rating": 4.0, "title": "Really lovely and peaceful hotel", "text": "We stayed on the third floor and our room had a view of the main street down below. The bed was quite comfortable with a wonderful bathroom and a bidet. The room was very clean. We also booked on sidestep.com and our rate included breakfast, which was quite luxurious. Every morning we would head down to the 1st floor for some fresh eggs, bacon, tomatoes and mozzerella, a number of pastries and great cappuccinos. I was quite impressed with the service and selection and freshness of the food. Quite a value and a must before getting in the local sites.", "helpfulness": 2, "user": "JC78", "date": "March 24, 2007", "id": 7214742}, {"rating": 4.0, "title": "very clean modern hotel", "text": "Overall we were highly impressed and I wish we could have extended our stay. I would definitely recommend this hotel to others and hope to return soon.", "helpfulness": 1, "user": "SurreyJj", "date": "March 23, 2007", "id": 7207949}, {"rating": 5.0, "title": "Thoroughly enjoyed our short stay", "text": "We stayed here in February 2006 for four nights and would be hard pressed to find fault with this hotel. Whilst the rooms are small, this is fairly typical of italian hotels in general and what they lacked in size thay made up for in comfort. Whilst situated off a busy road in the heart of vatican city, the rooms were so peaceful and relaxing and the beds incredibly comfortable. Breakfast was the usual continental affair, but beautifully presented and the waiters were consistently helpful and pleasant. Whilst it is possilble to walk to all the major attractions Rome has to offer, it will take you a good half an hour by foot to reach the trevi fountain area of the city. On the other hand, castel s'ant angelo and the vatican museum, st peters etc are 5 mins away so it is a great base if you are wanting to spend a lot of time exploring this part of the city. Would definately return and in fact wish we had as when we returned to Rome in december '06 we booked hotel stendhal (piazza barberini area)purely for its more central location only to be almost ripped off by unscrupulous staff. Should've stuck with Hotel dei Consoli!", "user": "Giovanni-7", "date": "March 5, 2007", "id": 6917838}, {"rating": 5.0, "title": "Quietly luxurious", "text": "Just spent 3 nights in rome staying in dei consoli hotel in ciampino not to be confused with hotel of same name in centre of rome. Very convienient for airport and bus stop outside straight to metro into centre of rome within 15 minutes and all for 2 euros! Beware buses can be very crowded. Hotel was very clean and modern breakfast was continental and staff helpful. All in all would recommend this hotel as it was very reasonably priced.", "user": "Colombiana-Ingles", "date": "February 28, 2007", "id": 6892061}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 23, "average": 51, "very good": 171, "terrible": 7, "excellent": 270}, "aka": "Dei Consoli Rome", "slim_ranking": 0.149606299213, "description": "Just a short walk from the Vatican and the Sistine Chapel, Hotel dei Consoli opened in 2000 is a luxury hotel in rome, and offers guests excellent hospitality in an atmosphere of elegance and imperial splendor.Hotel dei Consoli is located in via Varrone, near the Vatican with its majestic piazza and church, in a sumptuous building fully refurbished in the Empire style. The interior stucco work is by the Neopolitan master craftsmen who were responsible for the decoration of the famous Reggia di Caserta near Naples. The Hotel occupies three storeys, respectively designated the storeys of the Mappamondi (maps of the world), Fiori (flowers) and Battaglie (battles). On the roof garden and terrace you can enjoy breakfast while admiring the famous dome of St Peter's. The peaceful atmosphere is especially welcomed by single guests looking for rest and comfort in total seclusion. Furnishings in warm colours and careful soundproofing make the hotel an oasis of refinement and peace right in the heart of the Eternal City. With its elegant atmosphere, fully-qualified staff and all the very latest technology, Hotel dei Consoli is sure to make your visit to Rome an unforgettable experience.\"Since 2006 the Hotel dei Consoli has the best customer reviews on Trip Advisor: friendliest and best staff, great location, very clean, home away from home\""}