{"user_rating": 4.5, "review_count": 408, "name": "Hotel Julien Dubuque", "reviews": [{"rating": 4.0, "title": "Historic place, great location, modern touches.", "text": "I travel a lot and stay in many hotels, mostly chains. So when I get to stay in a nice, non-chain hotel, it's a rarity. This hotel is recently renovated, all the modern touches with all the charm still intact at this nearly 100 year old establishment.", "user": "frompitpa", "date": "May 17, 2012", "id": 130101822}, {"rating": 4.0, "title": "Lovely, Historic Hotel on the Mississippi River", "text": "Located at the end of Main Street in Dubuque, this hotel is conveniently located to the Diamond Jo casino (10 minute walk if the weather is nice.) and many bars, restaurants, and shops. It has it's own restaurant, though I didn't go there.", "user": "LoveTravelckg", "date": "May 14, 2012", "id": 129897254}, {"rating": 5.0, "title": "Wonderful Stay", "text": "Rooms are nicely appointed, the only downfall in my room was the lack of a real closet, so there was very little hang-up storage. My colleague said his room wasn't like that, so it was probably due to the location of my room in the hotel. Bed was very comfortable, room fairly quiet.", "user": "kstravlr_25", "date": "May 12, 2012", "id": 129817250}, {"rating": 4.0, "title": "Excellent Property", "text": "Only a few small issues. A lack of water pressure was a let down in the shower. The mini-fridge was stocked, but no prices were listed, the same with the basket of snacks. I don't mind being gouged if I decide to use these items, just let me know how much!", "user": "holymoses55", "date": "May 9, 2012", "id": 129669954}, {"rating": 5.0, "title": "A Real Gem!", "text": "Other than that, a very nice hotel, with a great location", "user": "Harith R", "date": "May 8, 2012", "id": 129600498}, {"rating": 5.0, "title": "Classy hotel", "text": "The hotel was classy and the staff was friendly! Located close to nightlife and restuarants to enjoy!", "user": "jmmcclo", "date": "May 29, 2012", "id": 130831770}, {"rating": 5.0, "title": "Great Place", "text": "This hotel has been beautifully restored and is lovely. It has modern conveniences but still has the old world charm of Dubuque. It is great location downtown. The rooms were very clean and nicely decorated. The pool is great for swimming and/or exercise and had nice long hours. It has a nice exercise room too. The restaurant downstairs, Caroline's, is very good for a hotel restaurant and their prices were very reasonable.", "user": "dorothyhydepark", "date": "May 28, 2012", "id": 130811568}, {"rating": 5.0, "title": "Very Nice Rooms!", "text": "We checked in at a very busy time on Saturday when there was a huge wedding. Check in was very slow and the front desk seemed overwhelmed.", "user": "Dimadden52", "date": "May 28, 2012", "id": 130765860}, {"rating": 4.0, "title": "Quite a Nice Place", "text": "Also, our room did not get made up the following day and we had to call to have it done at 4:00 pm. The same thing happened to our friends who were on another floor. When we called the front desk about it, they acted like \"Why would we want our room made up or why would we think it would have been done by now?\" It was a Sunday and they did have lots of people checking out....But it was very slow there that evening so you would have though they would have done the people's rooms who were still staying there and let the other ones go till later in the day.", "user": "BusinessTraveler052", "date": "May 24, 2012", "id": 130552005}, {"rating": 4.0, "title": "Capone Suite is Awesome!!!", "text": "Also, recommend unloading at the back of the building not in front on the street as the back door was much more convenient. The front door has no parking and the sidewalk is at at angle. When you arrive at the back door there are no signs saying to take the elevator to the second floor for check in or main lobby. You are just kind of left to figure this all out for yourself and it is not very obvious to first time visitors.", "user": "Indycoltsguy", "date": "May 21, 2012", "id": 130342676}, {"rating": 5.0, "title": "Luxury for a great price", "text": "We paid much less for our room than listed. Great towels and robes. A beautiful hotel. Great pool and gym. We walked to the river museum. Take the elevator for the view, there isn't anything to do at the top. Odd number rooms have a river view.", "user": "DKMommy", "date": "June 17, 2012", "id": 132184400}, {"rating": 3.0, "title": "Lovely rooms - Plan on a poor night's sleep", "text": "We are currently guests at this hotel. Our room is beautifully decorated.", "user": "Tammera L", "date": "June 8, 2012", "id": 131538222}, {"rating": 5.0, "title": "One of our favorties!!", "text": "Do NOT stay here is you want to have a good night's sleep. The beds are less than comfortable and the pillows are a nightmare. There are two kinds of pillows on the bed: flatter rectangular rocks, or super-thick lumpy ones. We tossed and turned all night. In the morning, I called the front desk to ask if there were any alternative pillows (down/feather) that could be delivered to our room and was told the ones on the bed are all they have.", "user": "Dawn H", "date": "June 3, 2012", "id": 131222063}, {"rating": 5.0, "title": "Best hotel in Iowa", "text": "The view from our room, while facing the river, is mostly obstructed by a large metal looking shed that is at the same level as our windows. I'm sure the view of the river is lovely, but I wouldn't know.", "user": "mcboat209", "date": "May 30, 2012", "id": 130978210}, {"rating": 5.0, "title": "Hotel Julien", "text": "Our experience is definitely not worth the $200 per night that we are paying.", "user": "donnasup", "date": "May 30, 2012", "id": 130974166}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stayed at the Hotel Julien for 5 nights while on business. It is a historic hotel full of elegance, history, and charm which has been completely renovated recently.", "title": "Very nice historic hotel (if you get the right room)", "helpfulness": 2, "user": "MIRay", "date": "June 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132990015}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Pros: Nice downtown location, big walk-in shower with plenty of water pressure, large soft towels, very comfortable bed with a variety of pillow types to choose from, Kuerig coffee maker, large desks with accessible plugs, refrigerator, dresser drawers to unpack into, and a large flat screen TV. The Julien also solved one of my very common hotel complaints by having lamps on the night stands with electric plugs in the base. I could actually plug in my phone and laptop near the bed without having to use an extension cord or moving furniture!", "title": "Nice Finishes but noisy", "helpfulness": 3, "user": "Clair J", "date": "June 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 132845751}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Cons: I could hear way too much from the room next door. It may have been because the adjoining room was connected by a private door…and it seemed that all the noise was coming through the door.", "title": "I had high expectations...", "helpfulness": 3, "user": "Aurrora12", "date": "June 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132823926}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Advise when booking a room: Get a room without a connecting room if you value your quiet time and if you like easy access to ice, get a room on floors 3, 5, or 8 as those are the only floors with ice machines. These two issues are the only reason I did not give the hotel a 5 star rating. Everything else was terrific.", "title": "Great find!", "user": "Karen W", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132386738}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The rooms and facility are amazing! Very beautiful finishes! Helpful staff and nice location. The main problem we had was that there was a ballroom bar directly below our room and we called not once but twice to complain about the noise and both times they indicated that the music would stop at 2 am. It was so loud, in fact, that I was unable to hear the tv in my room over the loud music. They did offer to move us the 2nd time we call but it was already almost midnight and we figured why bother. We informed the front desk that they should be letting guests know that room 325 was going to be a rap party. We were cool with the no window thing but the noise was crazy and I wouldn't have bothered commenting except that the price point on this place was higher than most and I expected more out of a top tier type of hotel. Ask for something other than the 3rd floor and I believe you will be happy. Like I said, it is a beautiful place.", "title": "Really nice place but lousy deal...", "user": "notbeenthere_11", "date": "June 18, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132281028}], "location": {}, "stars": 3.5, "variance": {"poor": 13, "average": 26, "very good": 93, "terrible": 11, "excellent": 265}, "aka": "Julien Hotel Dubuque", "slim_ranking": 0.117647058824, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Experience this remarkable full service boutique hotel, offering the area's most elegant accommodations, cuisine and impeccable service. After a $30+ million complete renovation, the Hotel Julien Dubuque is now a true landmark of luxury and sophistication. The hotel's contemporary elegance and sumptuous comfort complement the grandeur of the historic Old Main District, which is home to many of the incredible sights and cultural experiences the region has to offer.Whatever journey brings you to the Hotel Julien Dubuque, we invite you to set aside a little time to take good care of yourself.Potosa Spa & fitness facility, located on the lower level of the Hotel Julien Dubuque, is the definition of an exceptional boutique hotel spa: Steeped in service, designed with tranquility in mind, true to the culture and history of the area, and restorative for mind and body."}