{"user_rating": 4.0, "review_count": 727, "name": "Hotel Kapok", "reviews": [{"rating": 3.0, "title": "Okey hotel to stay", "text": "I chose this hotel, cause I was very interested in #10 ranking hotel among over 500 hotels in BJ at the rather economical", "user": "TripFromTokyo", "date": "April 4, 2008", "id": 14784820}, {"rating": 5.0, "title": "Excellent hotel in great location", "text": "price.", "user": "TravelSnob1", "date": "March 28, 2008", "id": 14591792}, {"rating": 5.0, "title": "Amazing Hotel in perfect location", "text": "Pls dont expect something like Penninsula or Regent", "user": "carlshafen", "date": "March 17, 2008", "id": 14348802}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "We had two nights here on our own after a three night paid-for stay at the plush Beijing Shangrila. This was just what we wanted. In the heart of the historic centre, with the Forbidden City a 5-minute walk away and Tiananmen Square not much more. Also minutes away was the upmarket shopping area of Wanfujing with excellent malls and great food- including the", "title": "Unbeatable!", "user": "mani8kgm", "date": "June 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17069785, "likes": {"liked": "— The staff and the location", "disliked": "— No free tea and coffee in the room!!"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "not-to-be-missed Quanjude Roast Duck restaurant. The famous Snack Street is just around the corner with snake, dragon-fly, scorpion, silk-worm, and run-of-the-mill fish and fowl, fruit and vegetables on the menu!", "title": "Pleasant Hotel in Amazing, Amazing Location", "user": "LittleGrasshopper", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16997518, "likes": {"liked": "— Location, location, location!", "disliked": "— Concierge"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The hotel is shiny, clean and modern. Our twin-room was spacious with lots and lots of cupboard space, large bathroom, robes, slippers, electronic safe...all the mod cons. Only minusno free tea and coffee in the room. The facilities were there, from kettle to the sachets of milk and sugar, but all chargeable. Luckily we knew this rom previous Tripadvisor reviews so we carried our own! Oh yes! While the bathrooms and cupboards lit up very brightly, the light in the room was a little dim- not good enough to read comfortably. But no matter. We weren't in Beijing to read.", "title": "Mysterious but Elegant", "user": "pepper00", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16853598, "likes": {"liked": "— Cleanliness, interior design, location", "disliked": "— Lack of coffee shop"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "The staff was excellent. With passable English, always attentive and smiling and helpful with directions. Previous reviews suggest they aren't too forthcoming with nearby-restaurant recommendations. No wonder. We found the Chinese eateries across the hotel rip-offs. Definitely charging more than double for the English-language menus.The exception being Grandma's Kitchen for a European menu with free delivery for a minimum order of 50 yuan. Try them for breakfast. The hotel's rate is 80 yuan for middling fare.", "title": "Shhh, don't tell anyone about this place...", "user": "Digital_Goldfish", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16668956}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel seems older compared to the new hotels around, but for price and location, it simply can't be beat. Do note that many of the taxi drivers did not seem to know where it is located (because so many are new to the city), so be sure to bring a visual map around for them when out and about or when coming from the airport. Or simply have them drop you off at the corresponding gate at the Forbidden city and walk the block or so back.", "title": "Great Location, Great Style", "user": "nwest_mail", "date": "May 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16395292, "likes": {"liked": "— Location, Style", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We stayed in the Fashion Suite and it was perfect for us. A very large room with large bed and two modern sofas (for my teenage boys to sleep on) - the room was very comfortable for FOUR of us - even though I think the official max is 3 people. They were happy to make up the sofas with quilts and pillows! The bathroom was fabulous with a round tub the size of a hottub! We arrived to a fruit plate water and juices - very nice!", "title": "Perfect for Us!", "user": "KimTO", "date": "July 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17583084, "likes": {"liked": "— Location; boutique feel", "disliked": "— Breakfast a bit on the expensive side"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The location was perfect - walkable to Tiananmen, Forbidden City, evening food market and lots of shopping. Staff was very friendly, but Engish lacking (no biggie for us). I would definitely stay here again!", "title": "Great location, simple hotel", "user": "tomwex", "date": "July 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17481683, "likes": {"liked": "— The location", "disliked": "— No view"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Breakfast buffet was very good.", "title": "Good hotel; great location", "user": "jamesbond_ppk", "date": "June 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17188663, "likes": {"liked": "— The room design.", "disliked": "— Can be noisy towards the street."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Stayed in the hotel Kapok for three days in June 08, and found it to be a great location, with friendly staff, simple, clean rooms and well managed. My room was not that large, and had no view to speak of, but had small patio doors that opened onto a small courtyard garden area (shared with the room next door). Free internet access was a bonus, but the breakfasts were really expensive - not a problem as I ate at street food stalls, and if you want it there are lots of places to eat at the malls on Wangfujing St. a few hundered metres away. The location is brilliant for eating, with a great array of street food available at the night market 200m to the East, and top-notch (and expensive) dining at the Courtyard restaurant 200m to the west.", "title": "Great Hotel", "user": "kittyphobia", "date": "June 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17129148, "likes": {"liked": "— Price and location"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Ideal location for walking around the city. Modern hotel not sure about the glass bathroom!! We didn't spend any time in the bar as is basically just reception but clean and a good price.", "title": "Great Location", "user": "travel12Uk", "date": "July 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17914084, "likes": {"liked": "— Location", "disliked": "— Moden Style"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "which are ranking below this hotel at Tripadvisor.com", "title": "Winner!", "user": "brendastarr22", "date": "March 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14332967, "likes": {"liked": "— location, and the all-glass concept", "disliked": "— nothing"}}], "location": {}, "stars": 4, "variance": {"poor": 13, "average": 92, "very good": 332, "terrible": 14, "excellent": 276}, "aka": "Kapok Hotel Beijing", "slim_ranking": 0.017199017199, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Hotel Kapok in Beijing is a uniquely designed boutique hotel located in the heart of this ancient Chinese city. A modern looking boutique hotel crafted with a touch of Chinese influence, next to the Forbidden City in Beijing. The lantern, a traditional icon in China, is used as a concept of exterior design, which breaks the boundaries between inner space and outdoor environment. An unconventional layout presents a spacious area; the ample use of glass enhances the natural light and the bamboo courtyard in the lobby slows the pac e of urban life. Hotel Kapok consists of 89 guestrooms and 16 suites, appointed with small gardens on the balcony. The interior design focuses on simplicity and pureness: white is all-pervading in the room, wooden floors and glass built bathrooms liberates the traveler's body and soul. The \"Staircase Library\" certainly increases the joy of reading. Hotel Kapok delivers personalized services while providing conveniences such as restaurants, bars, meeting rooms, business and fitness center.Hotel Kapok is located in the heart of Beijing , on the east side of the Forbidden City, minutes away from the famous shopping district Wangfujing. Tiananmen Square, Temple of Heaven, Beijing Train Station is also close by."}