{"user_rating": 4.5, "review_count": 187, "name": "Hotel Dar-Es-Salam", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I stayed 2 nights at this hotel and they were quite a delight. The property is beautifully located and well-maintained. The lawn overlooks the lovely Nigeen Lake and there is even a little jetty for shikaras to pick up guests from straight off the lawns. The rooms were comfortable, though a little warm (thankfully, ACs were installed), and we slept well. There is running hot water, though it takes at least 5-10 minutes for the boilers to deliver hot water to the taps. Food was excellent and the staff are eager to help, even if they are a little inexperienced. The owner, Khurram, is pretty accessible and very helpful. I'd definitely stay again and be sure to book a long, lazy early morning shikara ride onto the lakes.", "title": "Beautiful property in Srinagar", "helpfulness": 2, "user": "Smallgoat", "date": "September 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139974829}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Stayed at Dar-Es-Salam for 3 nights and must say, was thoroughly impressed by their hospitality. The location is excellent with the Nagin lake kissing its lawns and an excellent view of the hills around. The hotel is actually a boutique property and takes you back to the by-gone era. The food was excellent and was served with a 'nawabi' service. Overall, an unforgettable stay.", "title": "Truly deserves the no.1 status", "user": "aayushrivastava", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139387596}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The rooms are a little worn out and could see some improvement. Same goes to the collection of books in their reading room.", "title": "Old style colonial hospitality on the lake", "user": "Jude2410", "date": "September 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139118657}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Fantastoc stay. We were in a large group but the hotel works as well for families or honeymooners. Well manicured lawns open on the Nagin lake with potential of shikara rides day or night. Good food and good service.", "title": "A boutique property...A scenic view", "user": "varunrgoel", "date": "September 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 139035789}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We checked in this boutique property situated on the Nageen lake ( old part) on 20th of august until 23rd. First of all, one must know that this hotel is situated on the outskirts of srinagar. Although it takes about 20 minutes to reach dal lake area, it's very difficult to reach the hotel after 8pm in autorickshaw or public transport as the same is located in the outer area.", "title": "So beautiful that u forget ur wife & office pains for some time :P", "helpfulness": 1, "user": "rahulrastogi83", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 138774339}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We have stayed there for few nights. It was in good location. Our room was lake view. The room was fine, I would not say wonderful, but possibly it can be good standard in Kashmir. Ashtray all over the hotel and guests are smoking which I did not like. Food was wonderful first time, but I could not eat every night. If you are indian,maybe you can enjoy. However, it is too heavy for foreigner and similar dishes every night. But the quality was good. Location was in good area. But some room is quite close to road side. I took a boat from main center of city and took me about 2 hours, but I really enjoyed the journey. The hotel garden was really beautiful.", "title": "nice hotel", "helpfulness": 1, "user": "churachura", "date": "October 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143389091}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The hotel is as beautiful located as It overlooks the Nigeen Lake.The food was very good but lacked variety in menu.The rooms are clean and quiet spacious but lack basic facilities like Tea/coffee maker in the room .Would suggest only the lake view rooms . But finally very happy with the place and staff who have maintained this boutique property it so beautifully.", "title": "Ye kashmir Hai !!", "user": "wildSudhir", "date": "October 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143266710}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "The hotel is as beautiful as it looks in the pictures. It overlooks the Nigeen Lake, which is much cleaner than the Dal lake. The garden is beautifully manicured but does not look artificial. The hotel has very few rooms but they are spacious. The bathrooms, though spacious, could do with exhaust (the only negative in the place). The food, surprisingly, was the best we got in Srinagar. To top it all, the service was prompt and excellent. Highly recommended - only problem is that you may not feel like stepping out of the hotel !", "title": "Perfect place to stay in Srinagar", "helpfulness": 2, "user": "ChandramaM", "date": "October 5, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 142077704}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "As a gateway to our first family vacation in Kashmir, we could not have possibly made a better choice. Just beyond the main city with its narrow lanes, dust and crowds, set against the gently lapping waters of Nagin Lake and within a couple of miles of the exquisite Hazratbal mosque, this lovely little boutique hotel makes for a perfect retreat. the garden is beautifully maintained, yet just wild enough to be a magnet for all the birds of the region. Shikaras - the local rowboats - dock just beyond the hedge and can take you all the way across the city at a dreamily gentle pace past the everyday lives of the local populace. The staff are knowledgeable, friendly and prompt. The food - compared with every other place we ate at in Kashmir- was simply outstanding.", "title": "Lake of Tranquility", "helpfulness": 1, "user": "pixie0427", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 141884620}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "we considered this trip as an adventure and rewinding of our honeymoon memories since we are now in our sixties. Although we do not possess good health, but with the help and support of the owner, Mr. Hussain and his staff, this trip became a grand success for us and now we have committed to ourselves to visit Srinagar every year and stay in this hotel \"only\" for as long as we can. The moment you enter the hotel, you can see the tastefully groomed garden with awesome background of serene Nageen Lake. During our stay, we were very pleased with the courtesy and etiquette of the staff and attention to our specific needs for food. Individualized service was a bonus and room was just superb. They all went out of way to to help us. with best wishes", "title": "beautiful location,with pleasing owner and courteous staff", "user": "vinodsogani", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141729195}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Visted this Hotel in September though I stayed at the Comrade in and wanted to check out this hotel as it was rated No 1 on tripadvisor . I was shown around by the father of the owner of this property. Compared to the Taj or the Lalit which are the two 5 star Hotels, this is a small bungalow, furnished in period furniture, spotlessly clean, lovely rooms and they even have a/c. The bed are comfortable, toilets spacious and spotless and the restaurant tastefully done. They even have a lounge on the first floor that overlooks the lake. The highlight is the lovely lawn and garden overlooking the serene nigeen lake. All in all, a lovely heritage property and would love to stay here some day ! There is something about this place that is so warm and welcoming, so british..... so pristine and neat...keep it up Dar Es Salam !", "title": "A lovely small hotel on the banks of Nigeen Lake", "helpfulness": 2, "user": "vinn_2k", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 3.0, "value": 5.0, "rooms": 5.0}, "id": 141076638}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This property was the highlight of our holiday in Kashmir. Fabulous location, on the lake shores. Hospitable staff and a very warm owner (Khurram). The food was simply divine. Rooms are well furnished and comfortable and most of all very clean. Since it has limited rooms it allows you to mingle with other house guests. Almost feels like home. The hotel is tastefully done with artifacts adorning its walls.", "title": "A wonderful surprise in Srinagar", "user": "Neil R", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140890458}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "One point I would suggest is that the rooms should have additional plug points for charging devices", "title": "Great find; idyllic lakeside hotel in Srinagar", "user": "Neha0706", "date": "September 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 140665858}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Visited in August'12 for two nights and loved it. It's right on the Nigeen lake, quiet and peaceful, very well maintained and the owner Khurram seems to be quite hands-on with everything. The rooms are comfortable (some have aircon). Bathrooms are very neat and clean though the boiler system means you have to wait for a while to get hot water and also waste some water in the process. Food is a fixed menu, well prepared and served - our request for some Kashmiri dishes to be added for one dinner was happily accommodated. Coffee comes from a proper coffee machine instead of the usual \"instant\" varieties. The staff seem a little inexperienced but are eager to please and with some more training I'm sure the rough edges can be sorted. Overall a great choice to stay. Do try the early morning shikara ride and try to take the longer 3-4 hour cruise if you can. They arrange for the boat to pick you up from the tiny jetty at the end of the lawns. Perfect!", "title": "It's far better then taj ,lalit and houseboats", "helpfulness": 4, "user": "Jainender", "date": "September 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 140480644}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "It's one of the best managed and beautifully kept gem on the bank of Nageen lake , reasonably priced and good food ,well maintained lush garden overlooking the lotus farm in lake ,the only bad thing about this one is traffic honking day and night because it's also located near the main road .........rest is all fine", "title": "Place to stay when you want tranquility and quality time", "user": "Archit_Shrivastava", "date": "September 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140379643}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "we stayed here for three nights from july 16th to 18th and its one of the most beautiful place to stay in srinagar. Mr Hussain and is entire team was always ready to help us in which ever way possible. Though they had limit choice of food but what ever they serve its mouth watering. They got beautiful garden and excellent sit out areas.", "title": "best in srinagar", "user": "Vikas77", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138641191}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "we stayed for 3 nights in Aug'12. Although the weather of srinagar is not very pleasant unlike Pahalgam and Gulmarg the staff of this hotel will make your stay very pleasant. They make sure that ur stay is comfortable by fulfilling all your needs. Had the best kashmiri food, veg and non veg (goshtaba, rista, tabak maaz, haaq, kashmiri pulao, lauki yakhni ......). Many thanks to Senior and junior Mr. Hussain.", "title": "great hotel", "helpfulness": 2, "user": "anashabib", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137978419}, {"rating": 5.0, "title": "Just out of a fairy tale", "text": "Stumbled upon this place while I was in my shikara on Nagin lake. It felt like a castle amidst the light mist and after I realized that I wasn’t hallucinating, I stopped over to grab some tea. It was a great place, good restaurant, marvelously maintained and a stunning garden. It had an enchanting ambience and pleasant and courteous staff. I wish I had stayed here during my visit, but the advance in my own hotel was non-refundable so could not afford to move here.", "helpfulness": 3, "user": "Marie Y", "date": "August 18, 2012", "id": 137529575}, {"rating": 4.0, "title": "Beautiful,quiet,well maintained bungalow turned into boutique hotel!", "text": "Since it was our first trip to Kashmir and I wanted it be a memorable one , I selected hotel Dar re Salam after a long research on trip advisor . I was looking for quiet holiday in the lap of nature with some garden where my two years daughter can play , me and my wife can lounge around ,so we gave a miss to crowded dal lake and chosen this hotel. But when my taxi driver missed the hotel entrance , I was thinking inside that this holiday may turn into a nightmare . Any way he took a u turn and asked few people for directions. The moment you enter the hotel gate everything what I have read on TA came as reality . I would like to sum my experience below:", "user": "Rana V", "date": "August 16, 2012", "id": 137344013}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Pros:", "title": "Great place and owners", "user": "RRohatgi", "date": "August 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137077965}], "location": {"country": "India", "continent": "Asia"}, "variance": {"poor": 2, "average": 11, "very good": 49, "terrible": 1, "excellent": 124}, "aka": "Hotel Dar Es Salam", "slim_ranking": 0.025}