{"user_rating": 4.0, "review_count": 394, "name": "Hotel Cram", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2006", "text": "Yes, the Cram Hotel is a very well designed hotel, obvious effort was done as far as the look of the lounge, the corridors are concerned, and really looks like a 4 start hotel. Unfortunately the receptionists are ice cold, they seem they could not care less and you get the impressions you may be bothering them. When you finally get to go up to your room, you arrive into an incredible heat in the corridors. It is like the subway in Paris. The room surprisingly small, although we had reserved a superior room with balcony and view over the city. Upon inquiry, the receptionst coldly explained that they took the liberty to downgrade our reservation, for we opted for a double room. And they do not have double superior rooms, or so he says. The room itself was not to tidy, cracks on the walls, dirt stains, etc. The thing advertised as swimming pool on the roof is hardlw one. It is rather a bath for birds. The expensive breakfast has nothing to do with the quality expected from a 4 star establishment, very boring, but at least the staff here is very friendly.", "title": "could be a lot better", "user": "lacika34", "date": "November 20, 2006", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 6157736}, {"rating": 5.0, "title": "Great hotel!", "text": "The pros: the location: not in the immediate center, so it is rather calm. The coffee on the roof was rather nice. Also, the multimedia plasma screen with internet acces in the room is a good idea.", "helpfulness": 1, "user": "travel-326", "date": "November 12, 2006", "id": 6110370}, {"rating": 4.0, "title": "class hotel in a safe very safe area", "text": "If ever you decide to go to this hotel, search for a promotional offer, for the real price is not worth it.", "helpfulness": 2, "user": "roundtower", "date": "October 26, 2006", "id": 6014865}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Just stayed at Hotel Cram for five nights and it was superb. The hotel is very contemporary, well designed and very clean. The rooms are compact, larger if facing the \"diagonal\", but have clever storage which makes it very comfortable. The AC, shower, lighting, etc all work very well. The glass french doors make the rooms virtually soundproof and the room-darkening window treatments make sleeping a joy. The breakfasts are fresh, ample and offered until 11:00 am each morning. The beds are very comfortable and the location is very convenient to all the sites in Barcelona, particularly Gaudi.", "title": "Designer Hotel with NO customer service", "helpfulness": 2, "user": "karenodk", "date": "October 22, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 5982428, "likes": {"liked": "— The strawberry soap", "disliked": "— The staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Barcelona is a very clean and easily negotiated city. We found it safe with people of all ages walking late into the evening hours. It's a great place to visit.", "title": "Great weekend - Hotel Cram - from Dublin couple", "helpfulness": 1, "user": "blushingbride", "date": "October 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5968104, "likes": {"liked": "— modern and clean", "disliked": "— not much"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I stayed at the Hotel Cram for 5 nights in April '07 in a standard room. It wasn't my first choice of hotel but it was almost half the cost of the other hotels that I was looking at and that in the end was the deciding factor.", "title": "Nice hotel, hit and miss service", "helpfulness": 1, "user": "AllanBLondon", "date": "April 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7432253, "likes": {"liked": "— Design", "disliked": "— Service"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel itself is very nice. The bar / lobby area is actually quite beautiful and well designed. I was also impressed with the room which was nowhere near as small as I expected. It was well designed and there was a large bathroom with an amazing overhead shower.", "title": "Little rooms but quite nice..", "user": "Arturas", "date": "April 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7367328}, {"rating": 2.0, "title": "hotel cram review", "text": "The hotel provides free wireless and broadband and free movies etc which was a good bonus.", "user": "josh19", "date": "March 30, 2007", "id": 7251517}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Despite all that I would hesitate to recommend this hotel. Although some of the staff members were really helpful and nice, others were the exact opposite and my overall impression of the service is negative. For example, it was my birthday while there and my partner got me a birthday cake and surprised me with it in the room. To our amazement however, room service and then reception refused to bring us some plates and forks to eat it unless we ordered some food. We were told it was against 'hotel policy' to provide plates!!! Breakfast was nothing less than chaotic and frankly a nightmare. The staff were completely disinterested and we felt like we were disturbing them. One morning there was no coffee / juice / milk until 20 minutes after we arrived.", "title": "Great Room, Excellent Staff, Good Location in Eixample", "helpfulness": 3, "user": "rrgg", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7190812, "likes": {"liked": "— Location, Cleanliness, Pool", "disliked": "— Pool closes at 8pm"}}, {"rating": 4.0, "title": "Good hotel, good location", "text": "Although the area the hotel is in is good, just outside the main tourist areas but with a local feel, the hotel is located on the junction of 2 main roads. Although there was no noise in the room when the windows were shut, it was completely impossible to leave your window open at all.", "helpfulness": 2, "user": "jjm79", "date": "March 6, 2007", "id": 6920950}, {"rating": 3.0, "title": "A lil' \"CRAM\" as the name suggest", "text": "Positives:", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 6, 2007", "id": 6919568}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "1. Bargain at Euro 125 per night for a standard double.", "title": "So comfortable, so stylish, so don't want to see/be seen on the toilet....", "user": "DVG1", "date": "February 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6765931, "likes": {"liked": "— trip advisor !", "disliked": "— the view of the toilet from the bed"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "2. Modern with plasma screen with a mac mini attached... but wait...", "title": "Very disappointing", "user": "Leer", "date": "January 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 6613128, "likes": {"liked": "— Nothing particularly", "disliked": "— No character - noisy neighbours"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "Negatives:", "title": "wonderful hotel", "user": "thomas-TRIP", "date": "January 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6532260}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "1. The nice plasma TV did not actually work - we asked the front desk to repair it but they did not even bother to send anyone to fix it, which takes me to this hotel's biggest flaw...", "title": "nicely designed hotel", "helpfulness": 1, "user": "absf", "date": "December 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6480101, "likes": {"liked": "— modern decor, free internet access on large hi-def screen"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This Hotel according to U.S standards would not be rated 4 Stars..it's Clean..it's Average, but there is a lot of Less costly hotels that are Clean and Average in a 3 Star. The Hotel personnel lacked that Friendly Approach towards the Guest nor were they helpful. Would I recommend this Hotel? NO...not for the Money. On the other hand if the Room Rates were much less...then I wouldn't expect much, therefore I'd say Yes.", "title": "Over rated", "user": "ssssh", "date": "December 6, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 6336144, "likes": {"liked": "— Don't go by a Photo or Star Rating, especially if you are traveling outside of the U.S"}}, {"rating": 4.0, "title": "Thumbs Up For The Cram", "text": "My wife and I decided to return to Barcelona after a great trip last year, but rather than rent an apartment again (which had it's pitfalls), we elected to try a hotel for a change. After reading various reviews, my wife seemed set on the Cram although were disappointed to find many online booking companies said the hotel was full. She contacted the hotel directly on the off-chance and to our delight they confirmed they did indeed have a room free and charged roughly the same rate as was being suggested through third-party companies...this might be worth remembering.", "helpfulness": 6, "user": "OhYes!", "date": "October 14, 2006", "id": 5951411}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We took the AeroBus from the airport to Placa Catalunya, firstly based on cost (4 Euros each) and also that our hotel seemed close to this area on the map. We obviously got our map-reading wrong as it was a good 15 minute walk (mostly uphill it seemed!) to the Cram from the bus drop-off point and it seemed worse in 25 degrees heat carrying bags and suitcases. In hindsight, we would now have got a cab. But, albeit a little sweaty, we made it to the Cram and were delighted with the cheerful welcome and helpful staff. The hotel looks and feels very high quality as soon as you step inside.", "title": "Great City Stay at the Cram", "helpfulness": 5, "user": "drop_the_zero", "date": "October 3, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5902477, "likes": {"liked": "— Modern design, high quality interiors and materials, great linens and robes, towels", "disliked": "— No major complaints, would stay here again"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The rooms have recently been upgraded technology wise and now feature a PC-based communication and entertainment system that is clearly impressive. Via the 32\" wall mounted LCD TV, you have movies on-demand, full internet access via a wireless keyboard, about 30 Spanish tv-channels (plus CNN/BBC), Barcelona guides and history all on-screen and even some music choices to set the scene for you. Better still, all of this was included in our room rate with no additional charges for any aspect, even the movies.", "title": "Great Experience but Couple of Small Flaws", "helpfulness": 2, "user": "Cleargal", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5902029, "likes": {"liked": "— The modern design and good location", "disliked": "— The view from my room"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "However, a warning. The system is new and is experiencing teething problems presently. In room 209, the wireless keyboard didn't work (no internet), the TV kept freezing up and when it did work, half the screen was fuzzy. We pointed this out and the staff were so helpful, finding us another room to move to where everything worked adequately, but we still experienced a few issues. Also, there are several hard-core XXX movies available in the movie-list to watch and although we eventually saw a parental lock-out facility, it wasn't apparent initially and could easily be overlooked....if you take children, be very careful. We're not prudes, but couldn't resist a quick look at these movies and even we were mildly shocked!! :-)", "title": "Name says it all, you are crammed", "user": "jsnellis", "date": "October 1, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 5896631, "likes": {"liked": "— Lighting options", "disliked": "— Tiny accomodations, very crammed"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Despite the teething problems, this is clearly a superb facility and I personally found it a godsend to keep up to date with my UK football news!", "title": "GREAT HOTEL HAD A WONDERFUL TIME!!", "user": "mercedes50", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 5879745, "likes": {"liked": "— Very Clean.", "disliked": "— Rooms are small."}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 21, "average": 50, "very good": 178, "terrible": 13, "excellent": 132}, "aka": "Cram Hotel Barcelona", "slim_ranking": 0.235181644359, "description": "Hotel Cram is situated in the middle of the Example district of Barcelona very close to the Paseo de Gracia, Rambla de Cataluña, Plaza de Cataluña and the Ramblas.Surrounded by the cities most emblematic architecture, the hotel fits perfectly into this rich legacy. The modernist style façade dates back to 1892, and has a definite majestic elegance.The 67 rooms are planned to offer maximum comfort, they stand out warm, elegant, avant-garde aesthetic, their highly functional design and their high-tech equipment.The restaurant Angle Barcelona, 1* Michelin, is moving to Hotel Cram and will be opening its doors on June 2013, with the same philosophy and willingness to bring customers a dining experience which is sure to tantalise each one of their senses.If ABaC is the ultimate expression of Jordi Cruz' cuisine, l'Angle seeks to liven up tradition with innovative touches, high quality products and dishes altogether different from those created in the kitchens of ABaC.Attentive, warm and friendly service with common goals: to clearly convey the messages hidden in the actual recipes and define our understanding of gastronomy every day, based on memory, creativity and the best ingredients.The redesign of event and meeting rooms, whose capacities ranges from 2-70 people, placed special emphasis on enhancing light through integrated stained glass windows.The Ànemos Terrace Bar, located on the 7th floor with panoramic views of Barcelona, offers a breakfast buffet from 07:00 to 11:00. It later reopens from 12.00 am until 12.00 pm, serving drinks, appetizers, tapas and 'informal cuisine' uninterruptedly throughout the day. The new menu offers little snapshots of the creative style of Chef Jordi Cruz."}