{"user_rating": 4.5, "review_count": 738, "name": "Hotel Abri", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "We just returned from a week in San Francisco. We chose the Monticello based primarily on Kimpton's pet friendly policies and the hotel's proximity to the Moscone Convention Center. We were graciously welcomed and our little dog developed a huge fan club. The front desk staff consistently went above and beyond the normal 3 star call of duty by providing us with directions - calling cabs - giving us restaurant recommendations and helping with reservations. They were also great about keeping our cell phone number on hand just in case our little dog got distressed and started barking or something during the few occassions we left him alone in the room. The room was average - nothing special though. We booked a Jefferson suite, so it was nice to have the extra space. The bathroom was a little worn and could use some updating, but it was clean and well kept during the course of our visit. I can't say I'm a big fan of the dispensers for soap and shampoo and whatnot, but I'm sure that the environment is (at least that's what the little sign said.) The only problem (and I can't say that it was an insignificant one) that we had with our room was street noise. We were on the second floor (the only pet friendly floor) and the noise was pretty bad. Being near an intersection, we heard a lot of sirens and brakes squealing. Every morning around 3 a.m., the street sweepers and trash trucks came through. The staff was apologetic and we realized, of course, that it was out of their control. They could not move us to another floor because of the dog and all of the inside rooms were already booked, so we made the best of it. Thankfully, we always travel with a white noise machine and that helped somewhat. We would definitely consider staying at the hotel again, but next time we would specify that we wanted a room as far away from the street as possible.", "title": "Excellent Service -Average Accommodations", "helpfulness": 3, "user": "nrh", "date": "August 31, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 3834424}, {"rating": 4.0, "title": "Great location & friendly staff", "text": "I stayed at the Monticello based on reviews from Trip Advisor. I was a bit concerned that the reviews varied but I couldn't beat the price of $109US per night.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 25, 2005", "id": 3609810}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3.5, "variance": {"poor": 14, "average": 62, "very good": 305, "terrible": 16, "excellent": 341}, "aka": "Larkspur Collection San Francisco", "slim_ranking": 0.148936170213, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Stay Vibrant. Urban style at the center of it all in San Francisco’s Union Square. Ideal for both the leisure and business traveler, the newly transformed Hotel Abri is a modern day urban oasis featuring a sleek décor complemented by contemporary art and upscale amenities. The hotel’s energetic vibe is delightfully balanced with a comfortable ease, offering guests a unique sensorial experience and the highest levels of hospitality and service. Hotel Abri offers personalized experiences tailored to guest’s individual needs and interests, from complimentary wireless high speed Internet, DVD players and movie libraries, to a full service business center and a knowledgeable concierge program. Additionally, as part of the Larkspur Collection, the hotel offers signature brand elements, including the FeatherBorne® Bed package, L’Occitane bath and body products, high-tech efficiencies and a warm, welcoming atmosphere."}