{"user_rating": 4.5, "review_count": 90, "name": "Hotel Roma Vaticano", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I was apprehensive about booking a room in a b&b with only 7 rooms in a commercial building but I couldn't be more pleased. The room we had was about 11 x 11 not including the bath area. So definitely on the smaller side but I think they have some bigger rooms. Everything looked new. I am a clean bathroom freak and was so happy with the cleanliness of the whole place. I can't get a room this nice with breakfast in bed included everyday for this price (about $110/night) in the states. The staff even offered to give us box breakfasts to take with us when we had early morning tours. They had hair dryers, irons, whatever. Very accommodating. I will always stay here when I come. The metro is a 5 minute walk, 10 minute walk to Vatican, great shopping one street over. FABULOUS !!!! Restaurant next door is great and no service fee. Beds were very comfortable and big. Once I learned how to use the a/c system (about 3 days in I realized I had it on fan and not on cooling ) it would. All but freeze you out if you wanted it to.", "title": "Great location and very clean", "helpfulness": 2, "user": "lovorn", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163999473}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed in the Roma Vaticano for 3 nights and thought it was fantastic. The rooms were clean, practical and comfy. Our experience was made extra special by Lily who was an Angel. She went the extra mile to make us feel special. We would definitely stay at this hotel again. Thank you Lily, from Sophie & Michael", "title": "Fantastic!!", "helpfulness": 1, "user": "Sophie C", "date": "June 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163461426}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We were very pleased with our choice of the Hotel Roma Vaticano. Although I was concerned that it might be a little far from everything. It was a great location. It was in a quite and nice neighborhood. And it was very easy to get to the other areas of Rome we wanted to see. There was a metro station very close to the hotel as well as all the amenities you need (banks, shopping, restaurants, bars).", "title": "Nice hotel with friendly hospitality", "user": "Jamie C", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161915901}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The service was excellent. Lilly and Barbara were so friendly and made our stay quite pleasant. They were always helpful, spoke perfect English, and made us feel at home. Lily brought breakfast to our room every morning and kept the room very clean and well stocked. You got to fill out an order form telling them what you wanted for breakfast and at what time you wanted it. The pastries were good and the coffee was freshly brewed. My only complaint is the noise of the espresso machine every morning which is in the reception area so you can hear it going all morning as breakfast was prepared for each room. However, we weren't there to sleep in so it was not a big bother.", "title": "Wonderful", "user": "Arif K", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161583399}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "There are only 7 rooms so there isn't the bustle and hustle of big hotels. The reception area and rooms were nicely renovated and clean. It was so nice to come back to a clean and quite room after sightseeing all day.", "title": "55th wedding anniversary", "helpfulness": 1, "user": "eddie o", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161280065}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We had booked a room for two adults and a teenager for 14 nights (March/April 2013) and cannot rate this accommodation less than five stars!", "title": "Five stars - no less!", "helpfulness": 1, "user": "KHF112", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156862549}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "If you come to visit Rome you will likely be en route most of the day and therefore appreciate a rather central and safe location like this one. Most of the points of interest were reachable in a walking distance, on rainy days of for too remote spots (e.g. Ostia Antica) we took the metro (nearest station Lepanto, about 6 minutes from Hotel Roma Vaticano).", "title": "Quality and price", "user": "Cicalco", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156844984}, {"rating": 4.0, "title": "Small \"hotel\" in an office building", "text": "Staff is outstandingly helpful and supportive, breakfast can be chosen from a list at arrival and is being served to your room at the time you wish from 7:30. Even when we left the hotel much earlier a few days, we were provided juice, croissants, butter and jam the evening before, just fantastic.", "user": "A TripAdvisor user", "date": "March 31, 2013", "id": 156206743}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The room we had (Colosseo) was very clean and was definitely sufficient for three people and had everything you need (air-condition, safe - and free WiFi). The bathroom was also in a perfect condition, equipped with hairdryer, daily refilled shower gel, fresh towels and even a bidet).", "title": "Excellent!", "user": "fudge121", "date": "March 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155136317}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The windows are very well insulated which made a big difference as the room was situated to the street. Since we had booked the hotel as a combo offer through Expedia, the price for accommodation was very reasonable.", "title": "Our time in hotel Romavaticano", "user": "Sylul", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154453684}, {"rating": 4.0, "title": "Good value for money", "text": "Room though a bit small, it is functional and has all the essentials you may need. There is no restaurant inside the hotel, hence breakfast needs to be consumed inside your room. The staffs (Lily and Barbara) are extremely helpful. Overall, it was a good stay.", "user": "Kenrick L", "date": "May 5, 2013", "id": 159664875}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "My girlfriend & I stayed here on our first weekend away for 2 nights from 19/04/13 - 21/04/13 & first time in Rome and we were pleasantly surprised by Hotel Roma Vaticano! From the outside you would not know it was a hotel/B&B and we had some reservations concerning us as it is very small with only 7/8 rooms, but once we arrived in the hotel reception on the 3rd floor (there is a elevator) we were immediately impressed and all our reservations had gone. The staff were friendly and spoke fluent English which was handy as my Italian is very limited, the rooms were immaculate & modern, the breakfast was lovely & the location was perfect! Even the minibar was reasonably priced, all rooms have air con as well which was welcome when it was quite warm. I do not have a bad word to say about it and wouldn't hesitate to stay there should I ever visit Rome again (which I intend to do). Thank you for making our stay and trip extremely pleasant!", "title": "Perfect!!", "helpfulness": 1, "user": "danespencer", "date": "April 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158617198}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My girlfriend and have just come back from Rome and this hotel was one of the many many high points.", "title": "Incredible hotel, if your going to Rome stay here", "user": "Richard F", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158225720}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed here from the 16th-19th of April. I booked it following a review on trip advisor and booked it through Expedia and the hotel were brilliant from the beginning to the end.", "title": "Great base for exploring Rome! Perfect!", "helpfulness": 1, "user": "Munnybunny", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157953470}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Once I'd booked it I emailed in to check the booking had been received and got an almost immediate response with confirmation and a welcome. I corresponded with Barbara a few times more and she helped to organise for my girlfriend to have fresh lemon water for breakfast and even Prosecco and fresh flowers in the room as a surprise for her.", "title": "Oh what a lovely stay", "user": "safari98", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 157804062}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel staff is the best I have experienced. They went out of their way. The rooms are clean and a decent size. The photos show a little more upscale room than they really are. Bottom line however, is that the hotel offers a fantastic staff, a great location, a safe area (try the restaurant next door it is amazing), and a clean comfortable room at a very decent price. You can not go wrong staying at the hotel.", "title": "Enjoyed our stay", "helpfulness": 3, "user": "texasnice", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 166589600}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I stayed here for 6 nights with a friend in June and couldn't have asked for better. The room was clean, comfortable, and secure. It is only a 10 minute walk to St. Peter's and a 5 minute walk to the metro. Best of all, the staff was extremely friendly and helpful when we had questions. Breakfast is delivered to your room every morning when you choose (you are able to choose from a selection of pastries and coffee/juice). The walls are a little thin, so if you are in a room near the reception area you can hear breakfast being prepared in the morning. I would absolutely stay here again and would recommend it to anyone traveling to Rome.", "title": "Wonderful place to stay while in Rome", "helpfulness": 2, "user": "Jennniferrb", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 165861950}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "We stayed here for 4 nights in June. The hotel is on the third floor of a block. Within 5 minutes walk of the Vatican and piazza del popolo. It's also about 5 minutes from the lepanto metro station. The hotel is newly opened in January 2013 and the room was very modern, with air con and a great bathroom. Breakfast is served on a tray in your room, at a time of your choosing. Reception staff are very friendly and helpful. Wouldn't hesitate to recommend to friends, if they were looking for a great value sightseeing base, rather than a luxury hotel.", "title": "Lovely place to be close to the sights", "helpfulness": 1, "user": "UkEcl", "date": "June 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165521954}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed here for one night and were really impressed. We had a lovely room that was spotlessly clean, comfortable and nicely decorated. The staff were extremely friendly and helpful, breakfast was simple but delicious. Highly recommended.", "title": "Great hotel!", "helpfulness": 1, "user": "Emily C", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165183103}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We stayed here for 5 nights and the room was perfect, I think it was the biggest room and it was completely modern, especially the bathroom which was great!", "title": "Amazing hotel", "helpfulness": 1, "user": "Sophie W", "date": "June 25, 2013", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 165157746}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 1, "average": 4, "very good": 17, "terrible": 0, "excellent": 68}, "slim_ranking": 0.0275590551181, "description": "Hotel Roma Vaticano is an elegant boutique Hotel located in the centre of Rome, a few steps from the Vatican, from St. Peter’s Square and Piazza del Popolo. Hosted in an historical building in the heart of Prati district, the Hotel Roma Vaticano has just been renovated and is the ideal place for those looking for a comfortable and relaxing stay. Our location will allow you to reach in few minutes all the major monuments and the most beautiful plazas in Rome: St. Peter’s Square and the Vatican, St. Angel’s Castle, Piazza del Popolo, the Spanish Steps, Trevi Fountain and Navona Square."}