{"user_rating": 4.0, "review_count": 608, "name": "Hotel Pendini", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "This hotel was a great choice for my family of four. We had a two room suite both had flat screen tv's and the bathroom was recently redone. Breakfast was great ad so was the front desk.", "title": "Awesome", "helpfulness": 1, "user": "thefreddys", "date": "March 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14460799, "likes": {"liked": "— Location", "disliked": "— The bathroom smelled like smoke"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "We spent 2 nights at Pendini and were pleased with our stay. It is located right on a main square and within easy walking distance of everything there is to see in central Florence. There is no parking on site, but they have a valet service that will pick up your car and store it until you are ready to leave, then they will deliver it back to the front door of the hotel. The cost was about 20 Euro's per day. If you arrive by car, as we did, you will definately want to use this service.", "title": "Old, but Good", "helpfulness": 1, "user": "RMSTexas", "date": "February 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13841372}, {"rating": 4.0, "title": "Awesome location!", "text": "Our room was very large with two beds in it, one king and one twin. It was on the top floor and over-looked the square out front. We even could see the top of the Dome. The bathroom was adequate, especially by Italian standards.", "helpfulness": 1, "user": "MarkaPolo", "date": "January 17, 2008", "id": 12730006}, {"rating": 4.0, "title": "Great experience", "text": "The hotel is located on the 4th floor of the building. When we were there the small elevator worked ok, but we've heard that it does go out from time to time which would be terribly inconvenient for checking in/out and after a long day of walking around town.", "helpfulness": 1, "user": "des_joe", "date": "November 9, 2007", "id": 10711878}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I have also seen complaints about the noise from the square at night. We didn't find that to be a problem. The first night there was a large gathering of young people in the square that turned into a street party with dancing and music. Florence is very much a \"college\" town with students everywhere so you are going to have some issues like that, especially in the city center. It ended by about 1 am though. We are younger people (early 30's) so we usually didn't get back to our room until after 10 anyway and didn't mind the music. The second night there was no real noise at all. We slept very well both nights.", "title": "Unfortunate experience!", "helpfulness": 2, "user": "salemtraveler_2", "date": "November 5, 2007", "detail_rating": {"cleanliness": 1.0, "front_desk": 4.0, "location": 4.0, "value": 2.0, "rooms": 1.0}, "id": 10610285, "likes": {"liked": "— location", "disliked": "— smell"}}, {"rating": 5.0, "title": "Great Florence Hotel", "text": "Florence - Hotel Pendini", "helpfulness": 1, "user": "sainthelenawineaux", "date": "May 19, 2007", "id": 7645647}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "19 May, 2007", "title": "Worth the money!", "helpfulness": 2, "user": "TexasBConTour", "date": "May 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7590084}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We've just arrived home from a week in Florence. Our stay at the Hotel Pendini was fabulous. On the fourth floor of the arch in the Piazza Republica, the hotel is centrally located, walking distance to all the sites that the city has to offer. The rooms are reasonably priced, clean and comfortable, and the staff of the Pendini is fantastic. We were served by Barbara, Pamela, and a crew of helpful folks whose names we didn't learn. Their restaurant recommendations and reservations were first class. We've enjoyed the Pendini's hospitality in the past and will certainly stay with them on future visits to Firenze.", "title": "Can't beat the location.", "helpfulness": 5, "user": "SunFreak", "date": "April 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 7280615}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Bernard & Bette Goldstein", "title": "Don't let them fool you", "helpfulness": 9, "user": "ChicagoAb", "date": "January 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 6562317, "likes": {"liked": "— everything", "disliked": "— dont stay here"}}, {"rating": 2.0, "title": "Run down hotel.", "text": "Saint Helena, CA", "helpfulness": 6, "user": "ursula13", "date": "November 28, 2006", "id": 6231354}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This centrally located hotel was perfect for our needs. We had a wonderful window view overlooking the Piazza Nationale. Could not find a better location. All the main points of interest are a 10-15 minute easy walk. The room was large, the bathroom large and most important to my wife a bathtub. Even though located on the 4th floor, the hotel had its own lift. We felt very safe. Breakfast was a typical European spread with plenty to offer, clean, and window views of Florence. The staff was helpful in suggesting places to eat. Was able to leave my luggage at the hotel after checking out. Everyone was very accomodating.", "title": "Great find in central Florence", "helpfulness": 2, "user": "JRcruiser", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10086652, "likes": {"liked": "— The location", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "This is my second review and while my first review was based on a visit back in 2002, this one is current. Many of the bad reviews for this hotel are based on the fact that the rooms can be so different (for the same price range). This time instead of having a large room overlooking the Piazza Republica, we had a smaller room with the smallest bathroom you could imagine (some of the other writers described them in their reviews)...imagine a small bathroom with a shower head in the middle and an drain in the floor...guess what...they weren't kidding. The second thing that was different this time was that the staff was not helpful in getting reservations at the Uffizzi or at the Academia....(on our first stary they took care of everything). The final negative experience was that they demanded payment in advance (I'm convinced that they do this to avoid having people check out early or cancel entirely once they see some of the worst rooms). The hotel occupies the 3rd and fourth floors of a great old building...the rooms on the square are large with great views and large bathrooms (odd numbered rooms 205 through 211) and I think odd numbers 111 or 113 through 121 on the thirdd floor (but you need to confirm this with the management). I would not recommend any rooom except these and be aware that the 3rd floor does have a strong odor (could be mold...or worse)", "title": "My second review (downgrade)", "helpfulness": 4, "user": "byoung3rd", "date": "October 1, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10027994, "likes": {"liked": "— Central location and price (approximately 150 Euros at the height of the September crush)", "disliked": "— everything else"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Our stay at the Pendini ruined what has otherwise been a womderful trip to Italy. The room can only be described as dismal and depressing, and felt like a room in the local dungeon. The 'paper thin' walls gave us privvy to the bedroom habits of those above us and the early morning chorus of the local builders. The bedroom in question was room 101 and we can only presume that Mr Orwell had spent some time in the summer of 1947 looking for inspiration for his apocolyptic vision of the future!!", "title": "One to avoid", "helpfulness": 2, "user": "poshbird120", "date": "September 15, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8719834, "likes": {"liked": "— Nothing", "disliked": "— Accomodation"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The hotel Pendini greatly surpassed our expectations for one of the cheaper Roman hotels. It was a perfect location and very central to all of the sites. The staff was very friendly and helpful, and everyone spoke great English. Breakfast was included, and it was very good. The rooms were very cute and very quiet!! The bathtub was TINY, but otherwise was sufficient.. The elevator was the tiniest thing I have ever seen in my life. That was the worst part. Otherwise, I highly recommend this hotel and I'd stay there again.", "title": "Great!", "helpfulness": 1, "user": "meganln", "date": "September 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8608750}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The Pendini is an older hotel right in the heart of old Florence. Our room was reasonably priced, comfortable and nicely decorated; the bathroom was a standard small European bathroom. The room air conditioning kept the room cool, and it was hot when we were in Florence in July. The breakfast was a very good buffet breakfast with fruit, yogurt, juice, pastries, cheese, etc. The staff was helpful; we would definitely stay there again.", "title": "We Loved the Pendini", "helpfulness": 2, "user": "Georgann", "date": "August 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8494029, "likes": {"liked": "— Nothing", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "What can I say? It's okay-ish.", "text": "Well, this would be a good place for young people, I think, say if you wanted your college age kids in a good location in a safe area near the major sites. You can walk from the train station, though it is quite a walk, so only with a carryon or rollalong bag and once you find it, a bit tricky as the huge sign faces the main square, but the entrance is off on a side street to left (if you are facing the sign.) Then it is up to the 4th floor in the world's smallest elevator. I just kept hoping there wouldn't be a power failure while I was in there! The management is friendly and the rooms are good sized, but I found both of mine (long story about a missing bathroom) dark and kinda grim. The bathroom was very clean. TV worked. I was in an inside room with less than no view (one bothered why there was a window at all.) AC worked. Long complicated walk to the breakfast room on another floor, but the breakfast was good. What can I say? For those who want a bit of glamour with their Italian holiday, this is not the place. For those who want a bed, a good location, and some funky Italian \"charm\"... it's fine; and very reasonable in price, as it should be.", "helpfulness": 7, "user": "WhiteTara", "date": "November 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6171445, "likes": {"liked": "— location", "disliked": "— dark rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "A great family hotel right in the heart of Florence: a stone's throw from the Piazza Repubblica. It's a great rambling place occupying the fourth floor of what seems to have been a Florentine palace. We booked a suite and it was huge: must have been 800+ square ft. elegantly furnished, and clean. We were on the side away from the Paizza which meant peace and quiet.", "title": "A real family hotel", "helpfulness": 3, "user": "JohnandHelen", "date": "November 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6087891, "likes": {"liked": "— space", "disliked": "— limited Internet"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "The service is great, a real family hotel. Reservations for the Accademia and Uffizi no problem and no charge. The breakfast was great. One drawback was the limited Internet availability (one terminal in the lobby) but the hotel was up front about it before we booked.", "title": "Wonderful Italian City Hotel", "helpfulness": 6, "user": "casual-travels", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5913052}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Wonderful location and cheerful and extremely helpful staff. This was our first trip to Florence and the Pendini staff was more than happy to share information about directions, restaurants, best gelato places as well as answer any \"American\" questions we might have. The room was quite spacious for a European hotel and the breakfast more than adequate. Though some might have found our room over-looking the street a bit noisy, we loved going to sleep listening to Puccini being sung below. A real Italian experience! We'll definitely be back on our next Florence trip. Thanks to everyone connected to the Hotel Pendini.", "title": "Beware", "helpfulness": 6, "user": "momwithteenagers", "date": "September 7, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 5778010}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I selected Pendini based on a Rick Steve's recommendation and photos posted on the Pendini website. We stayed at a quadruple-bed room which was spacious but run-down. I have attached pictures of the room furnishings - I do not believe a thrift store would even sell these. Every item had a hole, a crack or was worn out. It looks like these are furnishings that were passed down from the refurbished rooms. My guess is there is a refurbished part of the hotel (the part that Rick Steve's saw and which are pictured on the Pendini website) and the unrefurbished part of the hotel (where we slept). One of the photos is blurry but shows the good hallway and the start of our hallway. Upon arrival, I was so surprised at the room that I actually went on the internet to check the website photos again just in case I made a mistake. I asked the front desk lady if I can have a room in the refurbished part of the hotel, she tells me all their rooms are the same. I asked again in the morning to change rooms since the room next to us (in the refurbished hall) was checking out, and she said I can't select which room to stay in and I probably won't like the room she would put us in. The refurbished rooms might have problems too, but they at least don't look like a flophouse. On the upside, it has a great location, good common rooms, good breakfast and great service from the room and breakfast staff (except of course the front desk lady with the rather loud hard-edged voice).", "title": "YMMV, (your mileage may vary)", "helpfulness": 22, "user": "Pumpkinmaster", "date": "August 18, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 5624843, "likes": {"liked": "— Location", "disliked": "— Moldy, smelly bathrooms"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 33, "average": 76, "very good": 245, "terrible": 22, "excellent": 232}, "aka": "Pendini Hotel Florence", "slim_ranking": 0.219565217391, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}