{"user_rating": 4.5, "review_count": 14, "name": "Hotel du Roussillon", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Loved the quaint location, in a beautiful section of Paris. Convenient location to metro at major Plaza d'Italia station. All food & dining needs (great bakery, small grocery store and a large selection of restaurants) are a short pleasant stroll away. The manager Geno is most gracious and very, very helpful (even though I woke him up early on many mornings, for my daily questions). The room was basic, but most importantly it was spotless, with a private bathroom with shower. Room, location, decor, manager Geno all combine to make for a great stay in Paris.", "title": "Highly recommend", "user": "tony838", "date": "November 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 183915880}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "As hotel rooms go in Paris, this is probably one of the best I have stayed in. Its very central and convenient to the Metro. We stayed in another Hotel close by but checked out because the carpet was filthy. We spotted this hotel close by. We walked in and asked for a room. The guys running this place were so welcoming and could not do enough. It was spotless and not a lot of noise. I can highly recommend this place. There are many lovely restaurants to chose from close by. Thanks for a lovely stay guys and for the mercedes taxi to the airport. I felt like royalty.", "title": "Very central and convenient", "user": "Bridmoni", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179797055}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We found this little hotel at the last minute after a long search for an affordable room in Paris (under 100euro). It's a great find. The rooms are simple but super clean and the owners are extremely welcoming. It's a great neighborhood, close to restaurants and the metro. Thanks for a great stay!", "title": "Great budget accommodations", "helpfulness": 2, "user": "mbirarariro", "date": "June 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 163659994}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "variance": {"poor": 0, "average": 1, "very good": 8, "terrible": 0, "excellent": 5}, "slim_ranking": 0.262295081967, "description": "Little family hotel in a quiet pedestrian street of a paris typycal neighborood \"la Buttes aux cailles\", 100 meters from metro station."}