{"user_rating": 4.0, "review_count": 438, "name": "Hotel Beaubourg", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Having booked well in advance, we were informed upon arrival that they had an IT problem and lost a few reservations - including ours. Funny enough, we have seen our confirmation eMail in the receptionist's documents, so we are absolutely sure that this was just a daft attempt to distract from the fact that the hotel was simply overbooked.", "title": "Overbooked and impertinent staff", "helpfulness": 7, "user": "Urmel66", "date": "September 3, 2007", "detail_rating": {"front_desk": 1.0}, "id": 8612856}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "They offered accomodation in another hotel, \"very nice and just around the corner\". As we had never heard or read anything about this other hotel (\"Hotel Vieux Marais\"), we insisted on inspecting it and its rooms, at first.", "title": "Great hotel, everything we needed", "helpfulness": 2, "user": "alsur", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8517081, "likes": {"liked": "— Location and price", "disliked": "— Small as should be expected in Paris"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The receptionist told us that we would have to pay the first night at Hotel Beaubourg by signing the credit card receipt issued as security deposit (Hotel Beaubourg will clear with the other hotel) and that we will only have to pay the second night in the alternative hotel.", "title": "Excellent Location", "helpfulness": 1, "user": "Sapphire22", "date": "August 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8470731, "likes": {"liked": "— Free internet access for guests"}}, {"rating": 5.0, "title": "LOVE IT, Fabulous hotel, just great!!", "text": "When we refused to sign the credit card receipt before having seen the hotel, the receptionist was extremely impertinant, using swearwords and tried to intimidate us. After a rough discussion, we left our luggage in Hotel Beaubourg and went off to see \"Hotel Vieux Marais\".", "helpfulness": 2, "user": "mrsjlo", "date": "August 11, 2007", "id": 8392985}, {"rating": 3.0, "stay_parameters": "Stayed July 2007", "text": "What the receptionist described as \"nice and clean\" was a 2-star-hotel (Hotel Beaubourg has 3 stars!) with an ugly reception, run-down lift and awful rooms - all in all not worth half of the money we were asked to pay!", "title": "Safe bet", "helpfulness": 1, "user": "holiday_lover79", "date": "July 29, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8252632}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This hotel was below average - was disappointed with the size of the room (the phrase \"swing a cat\" springs to mind) and the bed was tiny compared to the photos on the website. It was also a very uncomfortable bed and my boyfriend came back with a bad back. They seemed to have some sort of plastic sheeting on the bed which made me wake up in the night in a cold sweat - it was just a bit of an unpleasant experience, and given that I was on holiday, not ideal from the point of view of relaxing. On the plus side, it was a quiet room behind the courtyard (spoiled slightly by other guests shouting and screaming in the middle of the night which the hotel staff either didn't know or care about) but I think that generally, the hotel does not live up to expectations. Would not go back.", "title": "sweaty beds - eek!", "helpfulness": 2, "user": "banana98", "date": "November 6, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 10637707, "likes": {"liked": "— Location", "disliked": "— The bed"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Great location, reasonable price, and nicely furnished w/modern bathroom, tv. Free internet access. It was a small room, but that's expected in Paris. Nothing bad to say. Did not have breakfast there, since there's a bakery around the corner.", "title": "great find--will return", "helpfulness": 1, "user": "polyglot", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10492444, "likes": {"liked": "— location and quality of the room", "disliked": "— small size of room but to be expected in Paris"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The staff were very friendly and helpful. The location could not have been better. We will definitely stay here on our next visit to Paris.", "title": "Great stay at the Hotel Beaubourg", "user": "NancyJE", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10294183, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Stayed 9/29-10/2/07: All staff were outgoing, friendly & helpful (except 1 weekday counter lady who had the normal Parisian reserve). Being on the edge of the Marais was different and we found it to be a great location, very handy to all the main sights of Paris. We got to more places on foot with less Metro than when staying on the Right Bank. The room was nice but we did have a hard time figuring out the AC remote control so we opened the windows at night to cool off and that was fine if a tiny bit noisy in the AM (we should have asked the staff for help w/ the AC but we didn't; if we'd stayed longer we would have).", "title": "6th time in Paris was a HIT !", "helpfulness": 4, "user": "SnakeCityGirl", "date": "October 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10066035, "likes": {"liked": "— Decor", "disliked": "— Need more uniform lighting options"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "HINTS: After 6 visits spread over 25 years we heartily recommend you get an RER/Metro/Bus pass for the duration of your stay as soon as you arrive at CDG or Orly and it will save you lots of money & stress getting around. Also we traditionally take the Bateau Mouches each visti but this time we got a 2 day pass for the BatoBus and we found it to be almost as useful as the Metro pass and lots more fun going up & down the Sienne to shop & visit the sights.", "title": "good value for money", "helpfulness": 2, "user": "UkCarver", "date": "September 19, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8820745}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "As someone who has had his fare share of small Paris hotels, I wasn't expecting this hotel to be as clean, well situated and comfortable as it was. My bathroom was very spacious and clean, the room had flat screen tv, a full length mirror and A/C that actually worked. All these are things most Paris hotels at this rate lack. The street is also very quiet, so I could open my windows at night and sleep.", "title": "Ideal place, I will go back", "helpfulness": 2, "user": "OnurWashingtonDC", "date": "July 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8238585, "likes": {"liked": "— Location+Cleanliness", "disliked": "— Nothing in particular"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The location is great, its a simple walk to Notre Dame, The Louvre, and Le Marais. There are cute breakfast places around and you can take bus # 38 right across the street to go to St Michel or St Germain des Pres. Le Marais is gay central of Paris, so this is particularly advantageous for gay travellers, though not exclusively for them (majority of guests at the hotel when I was there were straight couples).", "title": "A lot to recommend", "helpfulness": 3, "user": "WollongongSheila", "date": "July 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8218771, "likes": {"liked": "— good location; clean & cute", "disliked": "— it is small"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "This is a great hotel. Fantastic location 5 min walk to Notre Dame, on the edge of the Marais. It is only a 5 min walk from the RER at Les Halles so connecting from CDG is no problem.", "title": "Great Hotel, Perfect Location", "helpfulness": 3, "user": "Jetboy787", "date": "January 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12630890, "likes": {"liked": "— Great value for money"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008", "text": "It is just near the Georges Pomidiou Centre and very handy for great shops bars and restaurants in the Marais.", "title": "Perfect for the price range", "helpfulness": 3, "user": "Hgsr", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12376848, "likes": {"liked": "— Location", "disliked": "— no complaints at all"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Rooms were reasonable size for Paris, nicley decorated and the bathrooms were recently removated and very clean.", "title": "Nice little hotel.", "helpfulness": 3, "user": "ST", "date": "January 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12267849, "likes": {"liked": "— Location", "disliked": "— Plastic sheets!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Staff were plesant and helpful. We will stay again at Hotel Beaubourg!", "title": "Great Location at a Reasonable Price", "helpfulness": 4, "user": "CdnTravellerNS", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10918160}, {"rating": 2.0, "stay_parameters": "Stayed November 2007", "text": "Just returned from a 7 night stay at Hotel Beaubourg. I booked the hotel based on the cost I could afford (130 euro night) and both of us were more than pleased with the choice. Even though our room was on the first floor overlooking the street there was no noise because the windows are so well insulated. The room was on the small side by U.S. standards but perfectly comfortable. The bath was recently renovated. Everything was clean, the beds very comfortable. The location is great for walking just about anyplace. Would not hesitate to stay there again and would highly recommend to all.", "title": "Paris must have better than this!", "helpfulness": 1, "user": "Neil G", "date": "November 15, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 10845464}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 11, "average": 60, "very good": 232, "terrible": 8, "excellent": 127}, "aka": "Beaubourg Hotel Paris", "slim_ranking": 0.232013385388, "description": "Come to us for a romantic weekend, a family holiday, or for the three days of the Fashion Week, you will be charmed by the quiet and refined luxury of the Hotel Beaubourg which combines tradition and modernity. We offer impeccable service and a personal welcome, absolute peace at the heart of a lively area. Unique rooms with old beams, a cosy decor, and WiFi, provide a welcoming atmosphere and modern facilities. This is a chic hotel open to everyone… With swinging Paris at your doorstep!In a listed building, cosy rooms and lively streets make this a charming three-star hotel in the heart of the Marais… Stroll around the cobbled streets of historic Paris, visit Notre Dame, the Louvre and the Pompidou Centre, drop into a trendy bar for a drink, grab a bargain at the BHV and in the designer boutiques, dine until late in a traditional brasserie… then pop straight back into the cosy world of the Hotel Beaubourg.Old beams and traditional wall-hangings, china ornaments and brand new facilities... Like a cottage with a traditional French touch, the 28 renovated rooms are tastefully styled and have bathrooms with all modern conveniences. Every single one a gem! This is a world outside time with state-of-the-art services where you can retreat from the bustle of Paris in a beautiful environment...Pastel pink, almond green and royal blue, poppy red set off by chic grey beige: the whole palette is there! Pop culture and luxury revamp toile de Jouy, fleur-de-lis and Japanese prints. Antique or painted wooden furniture contrast with modern facilities to keep you connected… Retro fabrics and flat-screen TVs, bright colours and WiFi, damask curtains hiding soundproofed windows... A harmonious balance which comforts and restores."}