{"user_rating": 4.5, "review_count": 390, "name": "Hotel Fouquet's Barriere", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Just spent two short days at the terrific hotel less than a block off the Champs Elysees. Our butler Nicholas was terrific, helping us settle in, bringing a chilled bottled of Champagne after a long day of walking. The spa is terrific as well. Perfection.", "title": "Absolutely wonderful", "helpfulness": 2, "user": "LazyPoint", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108231658}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I've stayed at plenty of hotels and I wish that I could provide 6 or 7 stars instead of 5 for this hotel because the 5 that TA allows just isn't adequate.", "title": "Simply Amazing - words can't properly describe", "helpfulness": 4, "user": "jamesclau", "date": "May 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107939442}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The staff are incredible - the butler staff headed by Olivier, specifically Laura and Angelique, were unbelievable during our stay at the property and catered way above and beyond. The rooms were beautiful - everything was complementary (standard) from the internet to the mini-bar to the champagne and fruits and on and on, even a rental of a private terrace for a special occasion. The spa was also beautiful and treatment was great, the restaurant La Diane inside is amazing and highly recommended for a quiet brunch.", "title": "awesome hotel", "helpfulness": 2, "user": "stevecNewYork", "date": "May 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107426345}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This location is amazing, the rooms are unbelievable - truly one of the best hotels in the world in terms of property but also service. I can say this having visited numerous leading hotels in the world. Would highly recommend.", "title": "Absolutely Breathtaking", "helpfulness": 5, "user": "joelbess", "date": "March 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101218650}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "I must say that this is one of the best hotel's I've ever been to. When we travel we always stay at 5 star hotels. The Fouquet Barriere was a cut above the rest. The service was excellent and the staff was very friendly and knowledgable. The hotel is simply beautiful. Contemporary while preserving a real flavor for Paris. The room was excellent. The furnishings were beautiful, the bed extremely comfortable and the air conditioning was great. I love the fact that the mini bar was on the house. I hate spending a lot of money on a room and paying obscene amounts of money every time I open the mini bar to grab a cold water. I would highly recommend this hotel It's not cheap but worth every penny. I will absolutely stay here on my next visit to paris.", "title": "WOW", "helpfulness": 3, "user": "danpb", "date": "March 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100690686}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "A hotel of this caliber always has great amenities and fantastic suits but this hotel goes above the usual with it's attention to detail and customer service. The staff could not be more attentive... the personal butler was always available and no request was too small or too large for them to handle and always with a smile! We were instantly upgraded to a suite which had a fantastic balcony stretching the entire length of the room. The included mini bar (all complimentary and refilled daily with beverages of your choice) and the included breakfast were extremely nice touches! I would not hesitate coming back here agin and again! Location was fantastic for shopping and sight seeing and it was located right on the Georges V metro stop... very convenient! Fantastic stay!!", "title": "What can one say?", "helpfulness": 2, "user": "materialboi", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115972268}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel is at the intersection of the Champs Elysee and Avenue George V. It is new, modern, luxurious and restful. The spa is in the basement and is fabulous. It has a big swimming pool that is el-shaped and has a thalassotherapy center on the short part of the el. Free fruit in the spa. We had dinner at the hotel one night and it was wonderful.", "title": "Nicest place I've ever stayed in my life", "helpfulness": 1, "user": "cubbies07", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115920462}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "It has perhaps the finest concierge service I have ever experienced. When the machine at the train station would not dispense out tickets because of the pin&chip issue, the concierge actually went to the station and stood in the ticket window line to get them for us.", "title": "Best kept secret in Paris !!!!", "helpfulness": 1, "user": "triptartine", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115770316}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We had a wonderful time at the Fouquet's", "title": "Outstanding, a real jewel in the heart of bustling Paris", "helpfulness": 1, "user": "Ritoune", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115423310}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Location - Location - Location !!!", "title": "Love it", "helpfulness": 1, "user": "YildizChoi", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115420158}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Sophisticated, stylish, warm and inviting luxury hotel in Paris! The hotel and everyhting it brings is excellent. We stayed in the hotel for two times and were never disappointed. The staff is really very attentive and the service is beyond five star - personal butler, welcome gourmet chocolates on arrival and even our little daughter received a small gift (toy phone). We are frequent travellers and this hotel is our favorite in Paris. And for sure we would stay here again and again when travelling to Paris.", "title": "The best hotel in Paris!", "helpfulness": 2, "user": "NathalieMoscow", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94357741}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "as i expected the room and the food were great what makes stand apart from the rest of the best are the people, my wife and i were made to feel very special by everybody specially the front desk staff, my congratulations to the managment you have something to be proud of!", "title": "special ambiance", "helpfulness": 1, "user": "fernando165000", "date": "January 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94283171}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "also the fragance they use in the lobby is very special please send me some i would love to share it with my friends!", "title": "Excellent location, service, room, food-Outstanding Hotel", "user": "bigpain", "date": "December 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89682461}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Before our trip we did quite a bit of research about where to stay. Fortunately, a friend of a friend recommended this hotel and that turned out to be the the best advice of our trip. We arrived in paris after a week in Dubai so our expectations were already high. The hotel really delivered in every way, from the transportation arrrangements from the airport to the hotel, all the way through our entire stay to the check-out. The location could not be better. The hotel and the rooms are perfect-modern and elegant with all of the amenities one would expect in a hotel of this caliber but yet warm and comforting. The service from everyone we encountered was top-notch and the dining and sightseeing advice and recommendations from the concierge were spot-on every time. We are frequent travellers and this hotel is on our top-5 list for sure. There is no question that we would stay here again when travelling to Paris.", "title": "Special", "user": "GoldenSpencer", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89555926}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Make no mistake, this hotel is not cheap, so we arrived with high expectations & we were very happy with what we received. Our suite was everything we'd hoped it would be and more. The service was top-drawer, and we felt like a prince & princess the whole time we were there. The staff are so well trained, & they have mastered the art of treating their guests with the utmost respect & attention. When they found out it was our 20th wedding anniversary, they sent champagne to our suite & gave us gifts from their beautiful spa. The general manager came to meet us when we left & thanked us for staying in the hotel. Besides the hotel & the staff, the POSITION of the hotel is absolutely perfect. We felt we were at the centre of everything & had easy access to other parts of Paris. We will definitely go back to Fouquet's, perhaps in Spring when it's not as cold.", "title": "Great Hotel and deals really well with complaints", "user": "eddala2004", "date": "December 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 89474787}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Worth the splurge! Loved the modern boutique hotel. Good location. Impeccable service and accommodating to Americans. Loved our personal butler and concierge did a great job on restaurant recommendations. Highly recommend this hotel.", "title": "Excellent hotel!", "user": "ellen1895", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 115019695}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Enjoyed my stay very much at this hotel. This was my first trip to Paris & I am very glad I chose HFB. Upon arrival, everything was perfect. Quick in-room check-in, along with all the personal touches to make my stay as comfortable as possible. The WHOLE staff were super friendly, courteous, and inviting. I was greeted by every member of the front desk every time I walked by them! Breakfast at Le Diane is excellent, Miguel is a great server, very personable and really goes out of his way to make sure you have the best start to your day. The spa is also one of the best i've been to. Overall this is an excellent hotel.", "title": "Excellent from Start to Finish", "helpfulness": 1, "user": "DA2311", "date": "June 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114625932}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Certainly a place I'd love to keep secret but would that be fair to all my fellow Paris lovers. This hotel is the best we've stayed in within Paris. Great location and with rooms soundproofed to ensure a peaceful sleep, providing the space you need to thoroughly enjoy your stay.. The staff, attention to detail & service are all exception and we are most grateful for the care & consideration taken to look after us. Without doubt the place to enjoy yourself and worth every penny.", "title": "Secrets", "helpfulness": 2, "user": "LMc070", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114536238}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The hotel is located in a very convenient location with easy access to the metro and taxi as well as restaurants and shops in george v area and on champs elysees. The room is spacious and well planned out. All staff are very friendly and helpful and we really love the balcony at the nighttime and the little desserts found in our room after a long day of shopping and walking around.", "title": "wonderful and memorable experience", "helpfulness": 2, "user": "Wilma880", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111033999}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I love the quality of breakfast and the food at le fouquet's is exceptionally good, especially the dessert trolley and the steak tartare.", "title": "Great Hotel Although Car Service prices too High", "helpfulness": 1, "user": "eddielouie9892", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110626187}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 5, "variance": {"poor": 6, "average": 12, "very good": 47, "terrible": 6, "excellent": 319}, "aka": "Fouquets Barriere Hotel", "slim_ranking": 0.00334634690463, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "The Hôtel Fouquet’s Barrière is in a prime location, right on the corner of the Champs-Élysées and the George V Avenue, making it just a stone’s throw from practically anywhere you want to go, be it museum, cabaret, or concert hall, etc. The hotel boasts elegant and refined contemporary decor by Jacques Garcia, and the extremely spacious rooms 37 sq.m. (400 sq. ft.) to 45 sq.m. (480 sq.ft.) all have luxury bathrooms, where mosaics and mahogany promise pleasure,peace and relaxation! This exceptional Paris hotel also offers suites up to 250 sq.m. (2700 square ft.) in size, perfect for discerning guests in search of elegantsurroundings."}