{"user_rating": 4.5, "review_count": 1165, "name": "Hotel Monaco San Francisco - a Kimpton Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "I had a very pleasant stay here, highly recommended.", "title": "Very nice hotel", "user": "34isit", "date": "May 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7637120, "likes": {"liked": "— central location", "disliked": "— canopy beds"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The rooms & hotel are exceptionally clean. The hotel is maintained in like-new condition. The hotel stay are the most pleasant I've encountered, always a smile and a pleasant word. The rooms are small compared to the typical 4-star hotel, but are big enough.", "title": "Loved The Hotel Monaco", "user": "VancouverKiwi", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7616948, "likes": {"liked": "— everything", "disliked": "— We had to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My room faced into an small interior courtyard. Because of that, the room was very quiet. However, the windows in the room faced directly into other nearby rooms.", "title": "Fantastic location.", "user": "jcpm", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7312080, "likes": {"liked": "— Location", "disliked": "— Cost"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The New York Times is delivered to your door early each morning except Sunday. There are copies of the S.F. Chronicle, Wall Street Journal & Financial Times available in the the lobby.", "title": "Wonderful...again!", "helpfulness": 1, "user": "howe7032", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7301941, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The cheaper rooms do not have coffee pots in the room, probably because of lack of space. The rooms have a CD player/ stereo and a DVD player. My room had a Sony tube-type TV.", "title": "The Monaco is a neat hotel", "helpfulness": 1, "user": "Kansastravelers4", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 3.0}, "id": 7216580, "likes": {"liked": "— Beautiful rooms", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I stayed here on our wedding night after a terrible fiasco at the Inn Above Tide in Sausalito (awful place) which forced us to find another hotel ASAP. We chose the Hotel Monaco and were so happy with our choice!", "title": "Excellent Honeymoon Stay!", "helpfulness": 8, "user": "pgtwo", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5794825, "likes": {"liked": "— The great staff, perfectly clean rooms, very nice sauna room with large jacuzzi.", "disliked": "— It was all great, cant think of a thing to complain about!"}}, {"rating": 5.0, "title": "A very thoughtful Hotel", "text": "We stayed in a Monte Carlo Suite, which looked EXACTLY, if not better, than it did online. Our suite was #323, and was two rooms, with large floor to ceiling windows, fabulous and fun decor, enourmous bed with down comforter, huge plasma TV, free wireless and a large bathroom with elegant fixtures and a two-person whirlpool tub. Not to mention plentiful Aveda bath products, which were refilled daily.", "helpfulness": 12, "user": "Sandy-n-Ron", "date": "August 27, 2006", "id": 5714896}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Everything about our stay was top-notch. Excellent customer service from valets, front desk staff, room service staff, housekeeping. They have a great wine hour from where they offer free chair massages and tarrot card readings. We took advantage of both and had a great time. Also, they offered a large selection of fine wines and were very generous with the amount they poured.", "title": "A little disappointed...okay, a lot disappointed", "helpfulness": 25, "user": "supremecourt25", "date": "July 25, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 5510637, "likes": {"liked": "— THe room and lobby were beautiful and the man out front was the most helpful.", "disliked": "— the snotty attitude from a few members of the staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "We oreded a room service dinner and it was wonderful. It is served from the Grand Cafe located in the hotel and we were very pleased. They also offered a nightly turn-down service which was a nice touch.", "title": "Awesome Hotel!!", "helpfulness": 8, "user": "CAsqueaky", "date": "July 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5461017}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We cant wait to come back for our 1 year anniversary. Keep up the excellent work, Hotel Monaco!!!", "title": "Great Location, Fun Decor", "helpfulness": 10, "user": "JourneyOC", "date": "July 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5448862}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We arrived at the hotel directly from our London-SF flight and stayed there for one night. The welcome was warm, quick and hassle free. The suite we had booked was comfortable, large, well furnished and equipped and the bathroom spacious. The reception area is excitingly but elegantly decorated and the daily wine reception pleasant. Overall an excellent hotel that did all the basics extremely well but provided a little flair and something different. Great location too. Strongly recommended.", "title": "Excellent hotel", "helpfulness": 7, "user": "UKTraveller366", "date": "October 26, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6014098}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We have stayed here before, in fact, it is where we were engaged. The canopy beds and cute decor are always a welcome departure from the traditional hotel fare in big cities everywhere. This stay was just as pleasant as our others but I had to share a newfound secret: If you don't book a parking/hotel combo package with the hotel, try the street parking on the hotel's cross street, Taylor, just before 6pm. It's metered until 6pm but after that it's free! And if you don't catch one of those spots, there is a parking garage open 24hrs on Taylor one block from Geary (the corner where the hotel is) that is cheaper than giving the car to valet at the hotel, especially on weekdays ($18/day + tax). This is the garage the hotel uses anyway and they are much faster bringing your car to you than to the hotel.", "title": "Once Again! A great romantic stay! And some parking tips.", "helpfulness": 9, "user": "Photoguide", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5962358, "likes": {"liked": "— Location, service, fun, quirky side activities in the lobby (tarot reader)", "disliked": "— Try the parking garage on Taylor for cheaper rates and faster service"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled as a couple", "text": "We booked the Hotel Monaco for a four night stay and chose it over other hotels in San Francisco for the location and the little extras that the hotel seemed to offer. When we arrived at the hotel, the check in was prompt and it was nice to be offered a glass of wine. However, there was a snobbish atomsphere in the hotel and we felt a bit uncomfortable by this as we felt a bit under-dressed (but we had just arrived off a flight and comfort was our priority).", "title": "good in parts", "helpfulness": 10, "user": "Laobhise", "date": "October 16, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 5959785, "likes": {"liked": "— Near to Union Square", "disliked": "— Pretentious atmosphere"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The room was very small but I guess this is to be expected in an older city hotel.", "title": "Bedbugs!", "helpfulness": 27, "user": "Traveller0505", "date": "October 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 5920762, "likes": {"liked": "— Leaving", "disliked": "— Being mauled by bedbugs"}}, {"rating": 5.0, "title": "Great hotel, convenient location!", "text": "We got room service once and the food wasnt very good. We didnt eat in the hotel again. In addition to this we never got another glass of wine. We arrived back at the hotel one of the days at the time of the wine reception but all the wine was gone.", "helpfulness": 10, "user": "miss_marie2", "date": "September 30, 2006", "id": 5895082}, {"rating": 5.0, "title": "A wonderful honeymoon hotel", "text": "We stayed at the Hotel Monaco for 4 nights in October on the first leg of our Honeymoon. It was a perfect choice - excellent location, really friendly staff, lovely gym and spa and quirky, well decorated rooms with gorgeous toiletries. We stayed in a junior suite and it was lovely and spacious.", "user": "CLM78", "date": "January 4, 2008", "id": 12326149}, {"rating": 5.0, "title": "Wonderful Place!", "text": "The staff deserve a special mention - they couldn't do enough for us, from making meal recommendations to printing out directions for us for the next leg of our journey to save us using the business centre. The free coffee on a morning and wine and cheese evenings were special touches. We would certainly stay here again - it was a perfect base from which to explore this wonderful city.", "user": "white4208", "date": "December 29, 2007", "id": 12026912}, {"rating": 5.0, "title": "perfect", "text": "We spent two nights at the Monaco in San Francisco. We had a mini suite and it was money well spent. The rooms were very nice, clean, and quiet. The bathroom was surprisingly large. I will definitely stay at the Monaco again.", "user": "lilysdads", "date": "December 27, 2007", "id": 12001287}, {"rating": 3.0, "title": "Quirky extras - dont turn the wrong way out of the hotel though!", "text": "My partner and I wanted a quick get away for some holiday shopping, exploring and of course eating in SF. Hotel Monaco was perfect in every way. Reception was warm and room was romantic, small but very well appointed (we had a queen canopy room). They offer a wine and cheese reception in the eve with Taro card readings - fun. Would certainly return.", "user": "Bingley2", "date": "December 9, 2007", "id": 11376433}, {"rating": 5.0, "title": "Some info for first time San Francisco visitors.", "text": "Part of a range of hotels that have a certain uniqueness to them. The location of the hotel is only a couple of blocks away from Union Squre, has some nice touches and is clean and tidy with a cute little gym and sauna.", "user": "zzjosephzz", "date": "December 8, 2007", "id": 11328847}, {"rating": 5.0, "title": "absolutely beautiful!", "text": "Want a beautiful hotel with very pleasant people to be around with? You have to stay at the Hotel Monaco! Not only are the employees great to be be with but also the guests. People tend to be more happier at this hotel than any other hotels ive stayed at. The hotel includes complimentary high speed internet in all guestrooms and lobby; complimentary wine and cheese reception with taro card reader and quick massages; and the restaurant, Grand Cafe, is to die for. There really isnt more to ask for! If the services is great; the decor beautiful; the stay pleasant and the helpful staff are all top notch, there really isnt any other place to stay at.", "user": "beemail", "date": "November 12, 2007", "id": 10762987}, {"rating": 4.0, "title": "Quite a good hotel", "text": "First to address an issue that seems to crop up in other reviews of this hotel, namely the area. My wife and I both were a little concerned about staying so near what was reputed to be a bad area. I think the concern was partly justified in that the area nearby (Tenderloin) does not look safe and you would best avoid walking it (even the guide on the tour coach said it was dangerous). However the hotel doesnt closely border the area and guests who dont walk much further past the Monaco coming from Union Square direction should be perfectly safe. But as always in any major city keep your wits about you and keep wallets etc., secure. The hotel is located close to the AC Theatre and major shopping centres and there is a taxi rank just down the road.", "user": "pjmsimmons", "date": "November 6, 2007", "id": 10647243}, {"rating": 1.0, "title": "Rooms were so Small!", "text": "There are homeless all over San Francisco and not specifically in the hotels area. You can choose to ignore them and they wont bother you however we tried to give something whenever we had the change.", "user": "pkimmi", "date": "November 5, 2007", "id": 10617965}, {"rating": 4.0, "title": "Make Sure You Get A King Sized Room", "text": "We booked in June and got a good rate of $299 for a Queen canopy room. When we got there we found it wasnt the requested smoking room. After one night we were moved to a smoking suite on the top floor which was an immensely better room with the same rate (thanks Kirby!). The room facilities were excellent with one exception. We complained about a non working coffee maker three times in person to the front desk and each time they said it was fixed but it wasn't. This however was a very minor thing when balanced against the professional, friendly and courteous staff we found from the doorman through concierge, front desk staff and bell hop. The room was cleaned thoroughly each day and towels etc changed. The L'Occitane freebies were nice and the decor tastefully designed.", "user": "jeckel13", "date": "October 28, 2007", "id": 10409839}, {"rating": 4.0, "title": "Not bad, actually!", "text": "The restaurant/bar is pricey but then so is every other decent hotel and the price list is displayed clearly. With plenty of alternatives close by you dont have to eat there.", "user": "SanDiegan78", "date": "October 19, 2007", "id": 10130262}, {"rating": 5.0, "title": "very cute and romantic!", "text": "Booked the best suite in this hotel for a special occasion, it is an amazing hotel. We got the suite with the jacuzzi in the bathroom, it's nicely decorated, she loved the windows which you could site next to and just people watch, it's located near the theater district so it's perfect for a night out at the theaters and a special surprise... ;)", "user": "ayn", "date": "October 8, 2007", "id": 10056255}, {"rating": 4.0, "title": "A unique place in a unique city", "text": "Going to San Francisco, I thought part of the fun of the trip would be to stay in a non-traditional hotel. Thanks to this website and its reviews, we found it! We were there in mid-August, and the weather was actually fall-like, a nice break from 90-degree humid Ohio.", "user": "SteelerBengal", "date": "September 19, 2007", "id": 8824228}, {"rating": 3.0, "title": "Okay.........", "text": "NOTES: 1)The staff was very friendly -- it seemed everyone who worked there took pride in the place. We were able to check in early with no problem (couldn't say the same about the Bellagio in Vegas, where our room cost twice as much and service was lousy).", "user": "cmcbabe", "date": "September 17, 2007", "id": 8736874}, {"rating": 4.0, "title": "Wonderful", "text": "2) Freebies: Wine & Cheese Hour was fun, although the Tarot Card reader made it rather clear that although it was a free reading, a suggested gratuity of $20 would be appreciated -- the reading took about 3 minutes, so not a real good return on my investment there. In the morning, a New York Times is delivered to your door. They also have free Chronicles downstairs in the lobby. It was fun to sit in the living room in front of the fireplace and read the papers while getting geeked on free Starbucks.", "user": "What_a_view", "date": "September 11, 2007", "id": 8690998}, {"rating": 2.0, "title": "Kimpton disappointment", "text": "3) There are a ton of great places to go to eat or have a drink within walking distance, including a cool bar \"Swig\" and an Irish bar a few blocks over toward the shopping area. The Olympic Cafe on the next block over doesn't look like much, but it has a good breakfast, and The Daily News Cafe (?) nearby was the best meal we had. Skip the hotel restaurant -- overpriced and we sat there 10 minutes waiting for a server to acknowledge us once we were seated. We ducked out of there and went to King of Thai Noodle, where we got great service for probably 1/6th of the price of a dinner back at the hotel.", "user": "abalone_sc", "date": "September 9, 2007", "id": 8682472}, {"rating": 3.0, "title": "It's Fine", "text": "We chose the Monaco for three reasons: it has received pretty good reviews on this site; its location (close to Union Square); and its friendliness toward pets (we brought our dachshund). To be sure, the area around the hotel is very mixed (quite a few upscale restaurants, some of SF's best theaters and galleries, and sundry homeless people begging for quarters). But the hotel itself is welcoming, clean, and efficiently run. The desk staff were couteous, and we found the somewhat cramped room adequate for our needs. The only drawback to the room was the poor lighting, which made it difficult for two people to read their books in bed at the same time. There is nothing particularly inspiring or offensive about the Monaco. For three nights, it served its purpose, and we'll probably return there in the future.", "user": "SilverLakeTraveler", "date": "September 5, 2007", "id": 8662351}, {"rating": 5.0, "title": "Magic Monaco", "text": "This is a very fine hotel. My wife and two daughters stayed for four days in August 2007. We noted the complaint others had made of small rooms and booked two deluxe rooms. We got what we paid for. The rooms were comfortable and spacious enough.", "user": "BobMc", "date": "September 4, 2007", "id": 8619317}, {"rating": 4.0, "title": "Secret hideaway", "text": "We have stayed at all kinds of hotels and what you must do especially if this is for pleasure is to keep an open mind. We were intrigued by the thought of the wine and cheese reception and the Tarot card readings. Both were fun eccentric and a great way for we forefingers to be able to instantly meet others. The location was superb for the Theater, one block away, the shops, the cable car small and interesting eateries, and frankly having a great time. I have said more than I usually would about a hotel to try in some way compensate for the shortsighted criticisms which plague this hotel. OK it is far form perfect but it is great fun and in that sense value for money.", "user": "canyonlady", "date": "August 30, 2007", "id": 8579826}, {"rating": 4.0, "title": "Very strange, but largely pleasant", "text": "This is the best hotel in SF. Perfect location, just enough 'fuss', great bar next door for late night repast and drink.", "user": "PGHPAtraveler", "date": "August 30, 2007", "id": 8576325}, {"rating": 4.0, "title": "loved the Monaco", "text": "Remember those vintage travel posters (you know, those beautiful old railway, steam liner, and flight posters done by various artists?) Now imagine that they come to life. You walk into rooms with furniture that harkens back to the \"Golden Age of Travel.\" There are leather steamer trunks and stylized furnishings and art that suggest that era. . . . . . .but not exclusively. Ay, there's the rub. Now imagine that workers from a local brothel and circus became shareholders in the place and inserted their own flare every once in awhile throughout the joint. Put it all together and NOW you can envision the Hotel Monaco San Francisco. The bellmen look like pimps in purple velvet suits and hats. (I honestly thought I was being propositioned when one of them startled me from behind as I got out of the cab.) The bedrooms have two terry cloth bathrobes, one in zebra print the other leopard. The lamps in the rooms will remind you of the circus with their big block letters, and for some strange reason if you have a room with a canopy, the material and position of it will make it seem as though you are sleeping in a puppet theater. In the evenings you can head downstairs for a very strange happy hour that includes free wine, chair massages, and tarot card readings......I repeat tarot card readings! The place is zany, it's odd, it has some weird vintage travel/ brothel/circus interior design fusion going on, and frankly, it isn’t bad at all if you are in the market for something unique.", "user": "flyingdutchie", "date": "August 14, 2007", "id": 8419373}, {"rating": 5.0, "title": "Loved it", "text": "Stayed one night because of a sudden change in travel arrangements. Got a deal for around 220. Wonderful, quiet room w/ queen bed. Extremely clean. Staff friendly but not intrusive. Located not far from Union square (3 or 4 blocks). Starbucks coffee in the morning available in what was called 'the living room'. Decor somewhat whimisical but not overly so. Cheery experience.", "user": "georgieasnick1", "date": "March 24, 2007", "id": 7216250}, {"rating": 4.0, "title": "Fun place to stay", "text": "Would defn stay here again.", "user": "ehbnyc", "date": "March 8, 2007", "id": 6935331}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "This wasn't the most luxurious hotel I've ever stayed in and the rooms (at least at the lower price points) were pretty small, but this was more than made up for by the great staff, thoughtful and fun events like the happy hour, and fantastic location.", "user": "B1-64", "date": "March 5, 2007", "id": 6918231}, {"rating": 4.0, "title": "As perfect as last time", "text": "Did I mention that I really liked the happy hour? Free wine and snacks and a very social, fun atmosphere. The fire was burning, I got a massage and came back every night while I stayed there. It's nice to actually meet people when you're traveling in a new city, and this facilitates that happening.", "user": "Pradagal", "date": "January 2, 2007", "id": 6542210}, {"rating": 5.0, "title": "Great Location, Unique Hotel", "text": "Also, the spa downstairs was nice and the hot tub was very relaxing and in a beautiful space. This was a great place home base in SF.", "user": "judi521", "date": "December 27, 2006", "id": 6505476}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 22, "average": 83, "very good": 375, "terrible": 20, "excellent": 665}, "aka": "Kimpton San Francisco", "slim_ranking": 0.0808510638298, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The award-winning Hotel Monaco San Francisco provides old-world hospitality in an eclectic, luxurious environment. The lobby's dramatic spaciousness, whimsical frescoed ceiling and delightful \"Tree of Life\" sculpture are instantly engaging. Situated next to the celebrated Grand Cafe Brasserie and Bar, and within easy walking distance of Union Square, San Francisco's famed Chinatown, the Financial District, Moscone Convention Center and many top-notch theaters, restaurants and shops, Hotel Monaco offers an unparalleled experience for a memorable stay."}