{"user_rating": 4.5, "review_count": 106, "name": "Hotel Gradlon", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Well-run hotel with helpful front desk. Location is good. . .short pleasant walk to old town. Rooms are small, of course, but we had a large bathroom. Recommend in Quimper.", "title": "Good Hotel in Quimper", "helpfulness": 4, "user": "fbc34", "date": "October 30, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4073636}, {"rating": 4.0, "title": "Nice place to stay", "text": "Stayed here two nights in May, 2004. Easy walking distance to the sights. It has just changed management and is totally refurbished. I would stay here again. Very friendly, helpful staff.", "helpfulness": 10, "user": "tonymsrad", "date": "May 20, 2004", "id": 2082043}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Stayed for three nights in September 2008.", "title": "Great hotel and first-rate staff - Highly recommended", "helpfulness": 2, "user": "mel_the_traveller", "date": "September 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20054732, "likes": {"liked": "— Location near town, Staff", "disliked": "— Lack of a restaurant could be a problem during bad weather"}}, {"rating": 5.0, "title": "THE choice in Quimper", "text": "First rate hotel in just off centre location, but with very easy walk to main shops, restaurants and the Cathedral. Don't be put off by the exterior photos or nearby railway line on Google Maps - neither cause any intrusion into the quietness of the hotel.", "helpfulness": 2, "user": "Thelonelytraveler11", "date": "August 28, 2008", "id": 19466154}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Excellent staff - totally fluent in English for those who need it !", "title": "Charming hotel", "user": "phoenikia", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18864204, "likes": {"liked": "— charming hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Recommend nearby restaurant 'Villa F' in rue de Frout - classic dishes well prepared and presented - again host is totally fluent in English for those who need it !", "title": "Great comfortable hotel", "helpfulness": 2, "user": "mclachlan4321", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 16849060}, {"rating": 5.0, "title": "Great Gradlon", "text": "Since there are no four star hotels in Quimper, Hotel Gradlon is you best bet. The immediate neighborhoud is rather shabby but it's very close to the old city of Quimper. Once you're inside the hôtel, you'll feel at home with very friendly service. Rooms are newly renovated, the bathrooms are very clean. What makes the difference is the professionnalism of the personnal, you can even plan with them your stay in Quimper and the region. Breakfast (11 euros, not cheap) was excellent with amazing croissants and great ingredients in general for the food (don't hesitate to ask for an omelette; is not on the menu but is available and very good!!!). Make your stay short in Quimper because there's not much to do but make sure to get a room at Hotel Gradon.", "helpfulness": 1, "user": "Harry_Melbourne_Aus", "date": "May 3, 2008", "id": 15618702}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "What a find! This is a wonderful hotel, fabulously located - one block off the main street so it is peaceful at night, but right around the corner from the Cathedral. The room was brand new -- wallpaper, curtains, windows, bedding, renovated bath. It was fabulous. The front desk staff was so helpful and welcoming - offering excellent suggestions for local restaurants (not tourist traps) and seeing the town. We felt like we were at a \"home away from home\". Breakfast was delicious and served alongside their garden courtyard, brimming with plants. We traveled across France on this trip and stayed in many wonderful hotels -- this was one of our favorites.", "title": "Loved the Gradlon", "helpfulness": 1, "user": "Celeste80", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14083199, "likes": {"liked": "— The room and helpful staff.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We just returned from a trip to France including 2 nights at the Gradlon. The hotel is located near the cathedral and the old part of town and is just a short walk to the H B Henriot factory...our motivation for coming there since I collect Quimperware pottery. The hotel is very nicely decorated and has a pretty garden. The staff is definitely the best we encountered on our trip. We received 5 star service at a 3 star hotel. Everyone seems to speak fluent English. Be sure to reserve the garage if you have a car, as parking is expensive in the public lots. We parked the car upon arrival and then walked the rest of our stay. What can I say? Beautiful town, nice hotel, helpful staff...I want to go back!", "title": "Five star staff", "helpfulness": 4, "user": "PVDGA", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8097906, "likes": {"liked": "— Location and staff"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "This is a small hotel with an attractive courtyard. The room itself was clean, light and had a flat screen television and cordless phone. Most attractively, the room looked onto the courtyard. Although the room was not particularly large, I think this hotel represents reasonable to good value for money.", "title": "Quality Hotel", "helpfulness": 3, "user": "olisonic", "date": "June 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7940043}, {"rating": 4.0, "title": "Great Staff", "text": "We drove directly to this hotel which was recommended in two guide books. The young woman at the front desk was very nice and while I helped her change the room configuration she told me her interesting life history, having moved recently back to France from Bali and before that Africa. The hotel has a pretty garden and lounge and is very close to everything in Quimper. The room was small but the bathroom was nice and it was quiet. The next morning the teenage boy working the front desk gave us an excellent recommendation as to where to spend our next night (Vannes) and called ahead for us. This kind of service means a lot.", "helpfulness": 1, "user": "Orindaguy", "date": "June 17, 2007", "id": 7867963}, {"rating": 2.0, "title": "Cheeky Prices!", "text": "The room wasn't cheap for a 3*, the a meagre breakast is over £10 which they even charged my 3 year old! So if you want a pleasant place to stay at vastly inflated prices book now!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 11, 2006", "id": 5455989}], "location": {"country": "France", "region": "Brittany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 2, "average": 9, "very good": 41, "terrible": 1, "excellent": 53}, "aka": "Gradlon Hotel Quimper", "slim_ranking": 0.0416666666667}