{"user_rating": 5.0, "review_count": 886, "name": "Hotel Villa Carlotta", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This stylish hotel is oozing with contemporary Sicilian charm. We did not have the good fortune to sleep here but visited the property and enjoyed both a dinner and lunch on their roof terrace. The views are breathtaking and often distract you from the equally impressive cuisine and service. But what is impeccable about this place is the stylish elegance which the owners have managed to attribute to this jewel of a property. In true Sicilian fashion, they have been able to create a feast for the eyes, palate and scent, as well as, for the heart and soul. Just even relaxing in their sitting room in the tower, prior to dinner, I could sense the warmth and beauty that is so peculiar to Sicily. This address should be highlighted on your “MUST NOT MISS” list when visiting Sicily.", "title": "An emblem of Sicilian hospitality", "helpfulness": 6, "user": "Alessandra W", "date": "October 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 180487797}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We had a great Honeymoon at Villa Carlotta. Location of the hotel is perfect, the views are magnificent and our bedroom/suite was beatifully decorated and very clean. The breakfast buffet is one of the best we ever had. And the most positive of his lovely hotel is the friendliness of the hotel staff, they are very service minded and helpful.", "title": "Beautiul and charming hotel", "helpfulness": 3, "user": "Jeannette2809", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179968617}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Once again we were able to return to Villa Carlotta in Taormina Sicily, We have been looking forward to it since we were last there. As if it was not nice enough there all kinds of upgrades and improvements inside and out. But some things never change like the views of Giardini-Naxos, Mount Etna spewing her trail of smoke and the calmness of the Ionian Sea. The staff was once again very helpful in planning our day and what to do at night. The breakfasts are soooo good, from the beautifully prepared pastries, to the wide selection of meats, nuts, cheeses, eggs, breads, and of course complimentary Prosecco. Now what really made a difference was the dinners, they were as if they had come from the finest restaurants in Italy. The selection and the preparation was the best. We had only three nights but we will remember each one as a culinary delight. You can tell that Andrea and Rosaria the owners really care about you and your stay at Villa Carlotta. It is a great value considering the ambiance, the rooms and the friends you will make while you are there. For those of you who have not been, you must go and for those of you that have been you must return. Ciao", "title": "The gem of the Ionian Sea, Sicily and Italy", "helpfulness": 4, "user": "Larry W", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179944866}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We have just returned from the Villa Carlotta having spent 6 days in the hotel with a terrace to die for (Rm 14) and 4 days in Apt 3 where the views of Etna and the bay were absolutely stunning!", "title": "Amazing!!", "helpfulness": 4, "user": "Deans22", "date": "October 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179941600}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Both the hotel and apartment were decorated to the highest standard,we couldn't have asked for more.We were also near everything in Taormina-just a short walk.", "title": "Great place to kick back", "helpfulness": 4, "user": "Vito F", "date": "October 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 179633575}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "I was very happy with our four night stay at Hotel Villa Carlotta. Of all the hotels I have stayed in around the world I think the customer service here was the best. It felt like the stay were genuinely interested in you and they went out of their way to assist. The location is great - about a 10 min walk to town very safe and the views are terrific. Water and tea and coffee facilities were provided. The only suggestion I can make is to improve the quality of coffee at breakfast, it wasnt nice and UHT milk was used. Overall this hotel is a great choice.", "title": "Outstanding customer service - a great choice", "helpfulness": 8, "user": "tripellen", "date": "October 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 182301187}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "It would be easy to assess a hotel against the crowd if it was lined up on the same street. Going to Europe and comparing hotels around a city center requires some real needs assessment. This hotel is in the city, actually near the Teatro and not to far from the walk way to the shore. The street is a simple walk of about a kilometer to the main street in Taormina. The lobby is a small room in the central building with enough room for a couple to sit. The grounds in the back are nice and lead to a little pool all rather built into a small plot lot of land. The rooms are large compared to others and we had a mini-suite with a view of the grounds. Our friends had a view of the of the sea that was literally the exact same size as our room only a floor up. Price/cost on this was about 100 Euro. We had a little balcony that is a shared walkway among three rooms. I guess the table with a couple chairs means it is exclusively for us but it wasn't greatly useful. There was another place to sit that had lounge chairs right in front and that looked nice. Pool was great though small it had all we needed.", "title": "Side Street Hotel 10 minute walk to City Center", "helpfulness": 1, "user": "TheKeeneGuy", "date": "October 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 182049039}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Everyone that works here is exceedingly helpful and they should have booted us for being typical loud Americans, We just make more noise than any other culture but they continued to accomodate anything we asked and even helped when we broke a glass around the pool through our evening ending last drink on the first night. I'll call it from the overnite flight but it might have been from the great Sicilian wine.", "title": "Magical place", "helpfulness": 6, "user": "Katherine R", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182002974}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Breakfast and the view from the top are outstanding. We went there every evening and typically closed the place. The people that work in this area are friendly, helpful and the location is great to look out. It is a great part of the property. We did have lunch at one of the swanky hotels in Taormina and found it even more than we could imagine but when the bill came for the sodas we ordered at lunch, we found $100 was a bit more than anyone should have spent. Frankly it is a bit of a joke and brings me to the conclusion that Hotel Carlotta is a great place to stay, worth the money compared to the swanky locations.", "title": "Great place. Great staff. Amazing view.", "helpfulness": 4, "user": "Enrico S", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 181772952}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "If there is any improvement it would be in the condition of our bathroom and the use of the internet. There is no consistent service in the room internet and the room back wall does have some small problem as it sits below grade. Nothing significant for people that are valuing cost but very significant for those that expect perfection. All of this needs to be filtered with the age of things.", "title": "Give the restaurant a chance and enjoy the atmosphere.", "helpfulness": 7, "user": "Phil S", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181346505}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My wife and i stayed in Villa Carlotta for a week in Sept as we were getting married in Taormina. We had a few family members staying with us and in the hotel and staff were absolutely amazing from the moment we arrived.", "title": "Bellissima!!", "helpfulness": 7, "user": "Daniel G", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181341175}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "They provided us a first class service all the way and they couldn't do enough for us the whole time we were there. Even on the morning of the wedding with the usual chaos of photographers, flowers arrangers bridesmaids arriving they were fantastic and helped the wedding day get off to a great start.", "title": "Absolute delight!", "helpfulness": 6, "user": "Rosemary A", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180934562}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The food at the breakfast buffet was excellent and the special drinks and canapés they provided for us and our family as a wedding present was a lovely, thoughtful and very special touch.", "title": "Amazing Hotel", "helpfulness": 5, "user": "James P", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180913531}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The staffs knowledge of the local area is perfect and recommended us some lovely restaurants and bars to try out.", "title": "\"Simply Charming\"", "helpfulness": 5, "user": "Daniel G", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180819118}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The hotel itself is perfectly located about a 5 min walk from the main corso umberto with the most breathtaking views across the bay from their terrace. The rooms we had are decorated to a high quality finish with a traditional Sicilian style and modern twist. They were spacious, clean and very luxurious.", "title": "Wonderful", "helpfulness": 5, "user": "Bronwyn C", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 180647188}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This was a great place to stay. Location good and just a short walk to the center. Rooms were beautiful and amazing views of the sea. Breakfast on the terrace was so nice each morning. The staff here was really fantastic. All so friendly and helpful with restaurant recommendations and beaches. Really enjoyed our time here.", "title": "Loved it here!", "helpfulness": 6, "user": "Leslie M", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179353461}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "My husband and I and our adult son have recently returned from a wonderful week at Villa Carlotta. We chose the hotel on the basis of the superb trip advisor reports and it lived up to all expectations. This is exactly the kind of hotel we like, not too big, personal and so welcoming. The staff were all so friendly. They were very efficient but all had a good sense of humour too. The hotel has a stunning position, close to the town centre and with the most amazing views. Breakfasts on the terrace were delicious and great coffee too. The hotel has an arrangement with a nearby beach club \"La Caravella\"and run a shuttle bus to order. Dominic and his staff were very welcoming and helpful and served tasty lunches. We felt we had the best of both worlds, close to beautiful Taormina yet also near to the sea and good swimming. We were delighted to discover this gem of a hotel and will certainly return. Thank you Mr and Mrs Quartucci and all your staff for a perfect week.", "title": "A wonderful hotel - thank you", "helpfulness": 7, "user": "Heather B", "date": "October 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179299010}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "A stylish hotel, beautifully decorated, in a great location, with very comfortable and well designed rooms. Exceptionally charming and helpful staff and the best breakfasts ever, served on a pretty terrace overlooking the sea - bliss ! What more can one ask for ?! Dinner was slightly disappointing but there are lots of good restaurants in easy walking distance.", "title": "Delightful Hotel", "helpfulness": 8, "user": "Sandy K", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179065972}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Mix up at check-in, not their fault or ours, but handled beautifully by friendly, efficient staff who could not do enough to make us comfortable including upgraded room. It's a lovely small hotel only a short walk from main street in Taormina. Five-star breakfast overlooking the bay below. Our room had all you could want including view of the Mediterranean. We at in the restaurant one night and had a wonderful meal including a chat with the chef who appeared to check on the diners.", "title": "Beautiful Toarmina", "helpfulness": 7, "user": "dwmapes", "date": "September 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178871373}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Our room was small but the view was enormous! Looking out of small balcony at the Mediterranean Sea, the wonderful library/study at the very top of the hotel, the lovely balcony where we went for breakfast every morning, and finally the incredibly helpful staff!! This place has it all. Taormina is one of the most beautiful towns on the coast, the shopping on the main cobblestone pedestrian only street is lots of fun and the hotel is walking distance to the many restaurants and shops.", "title": "Gorgeous hotel!", "helpfulness": 8, "user": "Kikilodica", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178674643}], "location": {"country": "Italy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 16, "very good": 104, "terrible": 3, "excellent": 760}, "aka": "Carlotta Hotel Taormina", "slim_ranking": 0.0232558139535, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "Villa Carlotta is an aristocratic 1860 Sicilian villa converted into a luxury boutique hotel in the centre of Taormina at 5/7 minutes walk to the historical pedestrian area of town. Our hotel, member of the Small Luxury Hotels of the World group, is located in a panoramic and tranquil part of Taormina, overlooking the Ionian sea, lush mediterranean gardens, Italy’s mainland coast and on one side Mount Etna, Europe’s highest and most interesting active volcano.You can feel an informal and elegant atmosphere all around the hotel which has been decorated individually by celebrated Italian interior designers making it an idyllic place, ideal for honeymooners or for those looking for romance, relax and good Sicilian food."}