{"user_rating": 4.0, "review_count": 431, "name": "Hotel Les Suites Labelle", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and I were looking for a cheap place to stay in the downtown / Old Montreal area. It was a last minute thing and we saw the reviews here on Tripadvisor and decided to book it. As most of the other reviews state, this is nothing fancy - no lounge, restaurant, pool,etc. The rooms are very clean but very basic. This is definitely not the place to stay for a romantic getaway. However, if you're just looking for a relatively cheap, comfortable, clean place to sleep, the Suites Labelle fits the bill. It is very centrally located, just off St. Catharines and a 10 min walk from the Old Port area. The room fee includes a basic hot breakfast - great chocolate croissants! The big downside for us was the street where the hotel is located (rue Labelle) is deserted and lined with boarded up buildings. It really kills the \"curb appeal\" of he place and we didn't feel quite safe when we were walking back from dinner at 11pm. Luckily it's only a block from St. Catharine's...", "title": "Nothing Fancy But Great Location", "helpfulness": 1, "user": "sensfan12", "date": "June 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132979764}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "The hotel is located near where I was planning on going. Very neat and clean! A must for me! The rooms are a good size with the comforts of home, equipped with a small kitchen. They take care to respect your privacy. The staff is very pleasant, as well. I will be traveling back to Montreal next year and plan to stay with them again!", "title": "Great place to stay, very clean.", "user": "Audrey S", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132619782}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "When I first walked in, I was (honestly) unimpressed. It's an old, outdated hotel, with cracked chairs in the lobby. And the room was simple, no luxuries, but clean. The location was excellent! So close to the metro stop and restaurants. HOWEVER, here we go... So many people rave about the breakfast, which was lovely (especially the choco pastries), but the menu did not change during our ENTIRE stay. Same EXACT things every day. Little boring. And at the end of our stay, I noticed that the brand new top that I was planning to wear home was MISSING. Trying not to automatically assume it was the maids, I searched my entire luggage and my best buddy searched the entire room. It did not appear and still has not appeared even after unpacking at home. Hmmm...would not exactly recommend this hotel anymore. Sorry!", "title": "Quaint hotel but had a problem", "helpfulness": 1, "user": "Diana N", "date": "June 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132395678}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "This hotel was very well located, near the Latin quarter and St. Katherine's street. It was very clean and the staff were nice and pleasant. My complaint is though is that we reserved two queen beds on expedia and only got two double beds, and were told that all the rooms were double beds. However, on expedia we paid extra to get the queen sized beds. I found this very misleading and was disappointed that they would not refund us the difference. Had it not been for this experience I would recommend this hotel.", "title": "Good location, good hotel, misleading rates though", "helpfulness": 2, "user": "Kathryn J", "date": "June 19, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 132335695}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I took my wife to Montreal on her birthday and we stayed at Les Suites Labelle. We couldn't have asked fro a more peaceful, relaxing stay. The room was quiet, clean, and comfortable. The staff was friendly, and the complimentary breakfast was very delicious. This is by no means a 5 star facility, but if you are looking for a nice place to stay in Centre-Ville that won't break the bank, I highly reccomend Les Suites Labelle.", "title": "Quiet, Clean, Comfortable!", "user": "tduck1990", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132247007}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I'm in Montreal on business two nights a week and have stayed at this hotel about 6 times so far. It has everything I need: free internet, a kitchenette, free hot breakfast, and is very clean. I have been able to park overnight on the street right in front of the hotel (parking meters are free from 9PM to 9 AM) although I imagine that during the summer months this won't be as easy. As others have pointed out, the downside is that it's not on a very nice street and it's in an area frequented by vagrants. I have never felt unsafe but when I come to Montreal with my wife and children, we stay in a better part of town.", "title": "Great value", "user": "lav74", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 126389291}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Perfect location! Very quiet, clean and very friendly staff! The room was quite large, the kitchenette was very handy. Breakfast was great! We were visiting for just four days and were not in the room often, but we were very comfortable when we were. The beds were very comfortable, the bathroom was spacious and clean. I'd highly recommend this hotel. For the price, it's an amazing deal.", "title": "Great Value! Best deal out there by far!", "helpfulness": 1, "user": "Lovin D", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125455380}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Never having been to Montreal before, this was a total shot in the dark. I originally picked Les Suites Labelle because of the combination of location and price. Reading the other reviews, this seemed like a great choice and now that we're back, I'm so glad we picked it. When using Google maps to get to this location from New York State, it directs you to an adjacent hotel. Don't worry-- you'll see LSL once you're on Rue Labelle. LSL is conveniently located right near the Berri-UQAM stop on the metro, which made it easy to get all over Montreal. We liked the location because it was in a fun neighborhood-- it's in the Latin Quarter, adjacent to the Gay Village, a short walk to China Town and a longer (though very manageable, in our opinion) walk to Old Montreal. The rooms themselves were great-- clean, fresh and had a kitchenette. The shower head was actually taller than me (rare) and the bed was really comfortable. Our stay included breakfast, which was great and offered a solid variety of meal options (we're vegan and vegetarian and even we found something to eat!). The only downsides were that my coat fell on the floor and the heater tore/burned several holes in it (a flukey thing but something to watch out for-- I wouldn't be concerned about the safety of the heater, though, because my coat ended up under the the bottom part of the heater... just don't let that happen) and the woman at the front desk was not very friendly. Everything else was fantastic!", "title": "Great value, great location", "helpfulness": 2, "user": "Kelly B", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124999512}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Big comfortable room with kitchenette, dining area and a big bathroom. Conveniently located in Latin Quarter within 2mins of station, superb choice of bars & restaurants within walking distance. Lively neighborhood and a long walk can take you to the Old Town. Good breakfast and nice staff.", "title": "Very good apartment hotel in latin quarter", "helpfulness": 1, "user": "ALLIGATOR9", "date": "January 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123588921}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "No fancy stuff though has a lobby and a reception. Great option for long stays.", "title": "Jolene", "user": "Jolene320", "date": "January 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122680455}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Large bathroom and kitchenette is wonderful when travelling with family. Very clean rooms. Clean crisp linens that don't smell chemically! Always seem to be touching up dings in walls because there aren't any! Very affordable and near a cool section of town. Cafes and drug stores and grocery store around the corner. As well, close to subway, which is very safe in Montreal. Having a free breakfast right there in the hotel, where you can quickly return to your room to plan the rest of your day, is excellent. Basic breakfast fare but all very tasty.", "title": "VERY Clean and Spacious Rooms and Good Breakfast!", "helpfulness": 1, "user": "Anne R", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131748625}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Went to Montreal for the Victoria Day long weekend and chose to stay here mainly because when we booked it--less than a week before we got there--it was the only place that was in our price range (for what we wanted: a 3* place, fairly close to Vieux Montreal and \"downtown\"--though as we discovered, Montreal redefines the meaning of \"downtown\".. in a good way! :). Didn't do much research beforehand (here on TripAdvisor or otherwise)--just read a couple of reviews, it sounded alright, so we booked it for $120/night.", "title": "Great Hotel, Great Location, Great Rate", "helpfulness": 5, "user": "taladas", "date": "May 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130696933}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "... And were very pleasantly surprised with our choice from the second we walked into the lobby. Check-in lasted all of three minutes (there were no issues with the booking or anything). The room, 409, was very clean and well-appointed with everything needed, including the little kitchenette area with dishes and all that (which we didn't end up using at all, but that's besides the point). The bed was a little bouncy, but definitely comfortable. The window in the room opened fully, which was a joy for us, because we don't like air conditioning all that much. We did turn the unit on one night when it was simply too hot outside, and it worked well--no weird noises or leaking or whatever.", "title": "Sooo affordable and convenient", "user": "Ann S", "date": "May 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130279362}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The room was cleaned every day of course, though this seemed to happen rather late in the day--we went for a walk to the Old Port on Sunday morning after breakfast, had to come back around 1:30PM for a new battery for the camera, and the room was as we left it. This didn't bother us in the least, but figured I'd mention it in case someone MAY be bothered. (Breakfast, by the way, is good; nothing spectacular, but then again, breakfast never is unless I make it myself.. :) Scrambled Eggs, Hash Browns, Sausage, various breads, pastries, juices, fruit salad.. can't really ask for more--I mean in other places you're lucky if you get a muffin or some toast.) The only VERY MINOR thing that we didn't like was that on our second-last day our soap ran out (in the morning), and new soap was not provided... I'm sure a call to reception/housekeeping would have fixed that right away, but we didn't bother--we always take a bit of soap and shampoo with us, just in case.", "title": "Good hotel in a very good location", "helpfulness": 3, "user": "SM-Travellers", "date": "May 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130004456}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The location is great.. only about 15-20 minutes away from the Old Port and Old City (though the walk there isn't all that spectacular, not that this matters). St. Denis is two streets away, with amazing places to eat and shop. Heading north (right) from the hotel entrance the first street is St. Catherines, and if you hang a left from there, you can just keep going, past Place Des Arts, into the downtown/touristy core. Mont Royal park is not necessarily within walking distance, but then again it depends what you think \"walking distance\" is... I walk about 5-6km every day so it didn't seem all that far to me (go up St. Denis, hang a left at Mont Royal Boulevard and keep going 'till you hit the park--and then keep going some more until you get to the foot of the cross at the top of the hill :).", "title": "Excellent for the price", "helpfulness": 2, "user": "Chris M", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129143204}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The room was more than adequate, clean, with minimal, neat decor. The room included a microwave, mini fridge, hot plates (with pots and pans), and coffee maker. Parking is secured and underground, though costs extra ($15+tax worked out to be $17.25). Free wifi and included hot breakfast were a nice touch. Check in is later - not until 4pm, while check out is at noon.", "title": "Clean, comfortable room at a great rate", "helpfulness": 3, "user": "rayjayyy", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128620877}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "This hotel is definitely above-average for the price. The rooms are large and well-designed, with comfortable chairs for watching TV and a kitchenette with small dining table. The rooms are clean, comfy, quiet, with good air quality. Staff are friendly; breakfast is a real breakfast buffet, not just some muffins and juice. Two drawbacks: if you have a van or other large vehicle I'd go for the private lot across the street over the hotel's underground parking -- very narrow, twisty one-lane exit/entrance. And the immediate surroundings are rather seedy -- it's a very short walk to a nicer area, but if I were a women staying alone there I'd definitely cab it back at night. The location is, however, central and just a block the Metro.", "title": "Great value", "helpfulness": 3, "user": "Holly B", "date": "April 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 127682119}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "its clean, economic. workers are friendly. good breakfast service, rooms are clean, no smells no nothing. parking passes are available but they charge tax extra????", "title": "One of the best cheapest you can find in downtown area", "helpfulness": 1, "user": "250Traveller250", "date": "April 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127594099}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "the parking is one way path but it is used for two ways, so you might wanna watch out there but all in all its secured. they only need some work in the parking, other than that everything seems pretty good and looks like you are in a good star hotel. good place close to downtown areas, to old montreal. not much of views there but you can walk and do your things.", "title": "Why stay elsewhere", "user": "Amon029", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127156435}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Reasonable price, convenient location, friendly staff, clean & conformable room... why would you stay elsewhere!!!", "title": "rough street, but great value hotel", "helpfulness": 2, "user": "RHHansen", "date": "March 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 126455819}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 2.5, "variance": {"poor": 18, "average": 55, "very good": 229, "terrible": 11, "excellent": 117}, "aka": "Hotel Les Labelle", "slim_ranking": 0.317647058824, "description": "Ideally located in the heart of Montreal, Hotel Les Suites Labelle offers affordable quality accommodations that will meet expectations of both leisure and business travellers. Our apartment hotel offers 97 non-smoking studios and suites, all equipped with kitchenette and modern amenities such as LCD flat screen televisions and free WIFI internet connection.Our mission is simple: Provide our guests the best possible services, without hurting their budget. Our professional and devoted staff will make sure you get the best out your stay in Montreal."}