{"user_rating": 3.5, "review_count": 48, "name": "Hotel Les Orangers", "reviews": [{"rating": 3.0, "title": "Nice stay, a bit pricey.", "text": "Nice hotel, perched on top of town 5 mins walk from the main marina. All rooms super clean and fresh. However, 12Euros for a breakfast and especially 17Euros for Wifi access are extortionate!", "user": "aarghan", "date": "March 2, 2008", "id": 13991853}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Stayed here for a week in October for a trade show at the convention center in Cannes. Upon arrival I was highly dissappointed at the look of the hotel. The staff is very friendly and accomodating, especially when staying up late and having a glass of wine from the hotel bar. The rooms are very small and a bit outdated. The bathrooms seem to be updated compared to the bedroom portion. The TV in my room only went up to channel 9, thus I was unable to access any of the English channels during my stay. Needless to stay I did not spend much time in my room.", "title": "Not up to American Standards", "helpfulness": 1, "user": "pikapptcu", "date": "November 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 10518716, "likes": {"liked": "— Location to restaurants and bars", "disliked": "— Outdated and small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The hotel is an easy walk to the convention center down on the water. It is also a very close walk to the narrow street on the hill with plenty of good restaurants and bars. Just remember....the further you walk down, you have to walk back up after a big dinner or several drinks!", "title": "Nice little hotel", "helpfulness": 2, "user": "Taffman", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7853221, "likes": {"liked": "— Friendliness", "disliked": "— The bed!"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "For the money, this hotel was ok, but I would not reccomend to the American business traveller who is used to staying in Marriots, Hiltons, Hyatts, etc. You can probably stay at one of the nicer hotels closer to the convention center for a little more money. Cannes is great when the sun is out!", "title": "Bad mistake", "helpfulness": 3, "user": "Fugazi", "date": "June 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 7834835, "likes": {"liked": "— Pool and gardens", "disliked": "— Room and cost of breakfast"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This hotel is situated on a hill overlooking the bay and old town. It is a 15 minute walk from the rail station along a main road or a bit longer through the town/old town. Rooms are small but clean and have been recently decorated. Beds are comfortable, but old. Bathrooms are lovely ,with good showers. My wife thought the hairdryer was worse than useless though! The reception staff were really helpful and went out of their way to assist. There is a good pool with sunbeds, a bar and a restaurant. The breakfast was very good with a selection of pastries,bread,meat,cheese,fruit,cereals,yoghurt, tea and coffee. This can be taken in the garden or in the dining room. There is some road noise, but good double glazing and air conditioning allows you to have a quiet night! . There are a large number of restaurants in the old town and port, only a short walk away from the hotel through pretty, narrow cobbled streets which are well worth a look. I would recommend this hotel as being good value for money. We had a great stay!", "title": "First impressions don't last", "helpfulness": 1, "user": "Topvelo", "date": "May 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 7696549, "likes": {"liked": "— The reception and dining room", "disliked": "— The bedrooms"}}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 3, "variance": {"poor": 7, "average": 14, "very good": 12, "terrible": 4, "excellent": 11}, "slim_ranking": 0.559701492537, "description": "Set in the heart of old town in a garden area with views of the bay; near the beaches, La Croisette & the Palais des Festivals.."}