{"user_rating": 3.5, "review_count": 354, "name": "Hotel Chambord", "reviews": [{"rating": 4.0, "title": "Rooms vary greatly, so be careful", "text": "Booked a 2 night stay, pre-peak travel seasonduring the winter. 170 euros per", "user": "Blah_by_M", "date": "October 17, 2012", "id": 143038015}, {"rating": 3.0, "title": "Great value for money", "text": "Very convienet location, near to a wonderful artisan/ fashion street, not far away from Grand Palais, various small and large museums and public transport.", "user": "taylorfam_006", "date": "September 28, 2012", "id": 141469623}, {"rating": 1.0, "title": "A building site without a name", "text": "However, rooms at first were disappointing. Small, lousy TV, broken toilet door. For 170 euros, wasn't what i was expecting. So, I made a call to the reception. And they changed our room.", "user": "deddy_11", "date": "August 27, 2012", "id": 138555816}, {"rating": 4.0, "title": "Great location", "text": "And this one was brilliant. 40 inch TV, king bed that was excellent for a 3 star hotel, great bathroom, an acceptable view over the streets. 4 times size of previous one. So as long as the hotel is not packed, the place is okay to stay in. Otherwise, you are not going to have a good time if you are unlucky enough to get a small room.", "user": "David-John H", "date": "August 21, 2012", "id": 137904301}, {"rating": 4.0, "title": "À coeur de Bruxelles", "text": "Elevator is really small, so those with large pieces of luggage, stay away, or be prepared to lug it up the stairs.", "user": "Vincent D", "date": "August 18, 2012", "id": 137571215}, {"rating": 4.0, "title": "Decent budget option, convenient location", "text": "I spent two nights at the Chambord in February 2013. My experience accords with that of most other reviewers.", "user": "John987654321", "date": "March 16, 2013", "id": 154740900}, {"rating": 3.0, "title": "Friendly hotel at a good location", "text": "Staff are very friendly and helpful; they are liberal with 24-hour wifi passes (although free wifi is one of the benefits of booking through their own website); the position is very good, on top of a metro station, and a short walk from either the European business area or the city centre. There are a few bars and restaurants in the immediate area. The hotel's own breakfast room is airy and pleasant and the food is of good quality and fresh, although the selection is somewhat limited. The room I was allocated was decorated in a rather dreary brown but was otherwise fine, and the bed was decently comfortable.", "user": "Torger B", "date": "March 15, 2013", "id": 154672070}, {"rating": 4.0, "title": "Ottima posizione, bello e confortevole", "text": "Hotel prices in Brussels seem to go up and down faster than a yoyo on acid, probably in response to demand from big conferences and meetings, but when the price is moderate, the Chambord is good value for money.", "user": "mad4freedom", "date": "March 12, 2013", "id": 154314634}, {"rating": 3.0, "title": "well organized rooms, disorganized staff", "text": "There are many positive aspects of this hotel, but also a few flaws that makes med rate it average. To start with the positive things, I found the staff very friendly and helpful. Written information said wifi would cost, but actually it was given for free (24 hrs) once you got an access code form the front desk. And it worked perfectly. About location, the hotel is ideally situated between the EU offices in the Troon area and downtown Brussels. A metro entrance is just outside the hotel door, so very convenient. My room on the fifth floor was clean, with a little veranda, and a nice view of Brussels. This would have been excellent in summer, but it was winter and it was cold. The little heater could not at all keep the room warm when the temperature went below zero. Another negative was the water pressure in the bathroom. Maybe because it was the fifth floor, water was only trickling slowly out of the tap, making a shower a demanding task. But it stayed warm as long as I showered. A colleague experienced cold water only after a few minutes. Another colleague complained about the smell of sewer in the room. There is no minibar, so if you get thirsty, you have to go down to the ground floor with the miniature elevator and find the vending machine having a limited variety of drink options. The breakfast was good, although the access from the ground floor was up through a steep and twisted staircase. All in all an adequate hotel.", "user": "peripateticPhD", "date": "February 25, 2013", "id": 153067622}, {"rating": 4.0, "title": "Friendly staff, reasonable prize, and good location", "text": "I've stayed at Hotel Chambord for a week end.", "user": "Traveller_from_AMS", "date": "February 6, 2013", "id": 151529175}, {"rating": 3.0, "title": "average", "text": "My husband went to Brussels for business for 4 nights, 2 here and 2 at NH Stephanie. This one wasn't as good as NH Stephanie. No airconditioning, so windows had to stay open resulting in noise.", "user": "Friendsinbristol", "date": "January 5, 2013", "id": 148867691}, {"rating": 2.0, "title": "Not deserve the price they ask", "text": "Breakfast basic and pre-made feeling.", "user": "Nikola C", "date": "January 3, 2013", "id": 148713236}, {"rating": 2.0, "title": "Bland business hotel", "text": "Room was quite nice with normal key which rare. No tea and coffee in rooms. Bed comfortable in twin room.", "user": "Randl93", "date": "November 15, 2012", "id": 145473430}, {"rating": 1.0, "title": "Avoid", "text": "I stayed in this hotel in the summer of 2012. At my arrival the first thing that the staff considered suitable to be done for me was to cheat me. Althought I had payed through my travel agency for a standard room they tryed to offer me an economy room. Although the price included 30 minutes free internet in my room I had to pay for this facility", "user": "willgo79", "date": "November 10, 2012", "id": 145089712}, {"rating": 3.0, "title": "Very 'cosy' room", "text": "Je suis resté dans cet hôtel pendant l'été de 2012. À mon arrivée la première chose que le personnel a considéré approprié être fait pour moi était de me tricher. Bien que j'aie payé par mon agence de voyages une salle standard ils ont essayé de m'offrir une salle d'économie. Bien que mon prix ait inclus l'Internet gratuit de 30 minutes dans ma chambre j'ai dû payer cette installation", "user": "A TripAdvisor user", "date": "November 8, 2012", "id": 144907206}, {"rating": 3.0, "title": "Get to breakfast early", "text": "Let me start off by saying the hotel did what it said on the tin. I was here on business but added the weekend which is when I stayed here. As my wife didn't come I wanted somewhere cheap but central and the Chambord matched that description perfectly. I had a single room on the 7th floor which was very small but met my needs. A warning for anyone with heavy bags though - the lift only goes up to 6. The only thing which didn't suit me was the fact that the bar was closed for the weekend. Breakfast was included in the price and on the Saturday I was down fairly soon after opening and all was well. However, on Sunday I had a bit of a lie in and got down later. There was no coffee, no juice, no cheese, no knives and no croissants. When the coffee machine returned there was a bit of a stampede and so I waited for it to pass rather than queue - bad move, When I went up the cups were gone! However, the cheese was restored as was the juice, although the glasses were gone now. Eventually I got a glass and a cup and felt a bit more cheerful but the croissants were never refilled. I don't mean to criticise the girls who were doing their best. They were simply overwhelmed. Maybe they need a more efficient dishwasher so that the girls can concentrate on keeping the food supply flowing. I don't want to finish on a negative note. The staff were very polite and helpful and they were probably the finest asset of the hotel.", "user": "AJMacD", "date": "November 5, 2012", "id": 144622803}, {"rating": 2.0, "title": "Disappointing", "text": "I have been accommodated in the hotel from October 25 till October 28 (3 nights) in a single room on the seventh floor. Elevator goes up only to the sixth floor! I had to lug the suitcase to the seventh floor by myself, nobody helped me. The room was very small and very cold. It was hard to squeeze between the bed and the table. Nevertheless the room and the bathroom were clean. The breakfast in the restaurant was OK, but they have not any sugar-free yogurt, while I am diabetic patient.", "user": "Lilia N", "date": "November 3, 2012", "id": 144412418}, {"rating": 3.0, "title": "Good location, very friendly staff, a nice little place all round", "text": "On Saturday morning, October 27, when I wanted to sleep after a busy day on Friday, I was awakened at 7.15 am because of a noise and loud laughing close to my room door. They were either hotel staff members or some their friends friends, who organized a party in an empty room in the early morning. After one hour of laughing and lovemaking with an approI knew that there were no guests in the near room 70, so I was surprised that it was such noise in the early morning. So I opened the door and saw a dark girl and two young manThey were either hotel staff members or some their friends friends, who organized a party in an empty room 70 in the early morning. After an hour and a quarter of the noise and loud lovemaking they came out and never returned in the room 70. I got a feeling that I have stayed in a cheap one hour hotel. When I complained to the desk clerk about noise, he was not helpful. Probably he knew very well about \"morning party\" in the room 70.", "user": "mikewazowski", "date": "October 28, 2012", "id": 143913757}, {"rating": 5.0, "title": "Top of the line at a very resonable price", "text": "Otherwise, another desk clerk (a tall young man) was very helpful. When I told him in the evening, that the room 71 was extremely cold, he offered me to move to another room on the first floor. My last night in the hotel was ok.", "user": "Ruben C", "date": "October 27, 2012", "id": 143835041}, {"rating": 4.0, "title": "Rooms okay, service not so much", "text": "Mixed emotions about this hotel. Firstly, the staff deserve commendation. The reception staff were unbelievably helpful, as well as polite which extended to the domestic and breakfast staff. Was thoroughly pleased with their attitude after reading some of the reviews on here.", "user": "Psicogeriatra", "date": "October 17, 2012", "id": 143075373}], "location": {}, "stars": 3, "variance": {"poor": 41, "average": 101, "very good": 142, "terrible": 35, "excellent": 35}, "aka": "Chambord Hotel Brussels", "slim_ranking": 0.544502617801, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.0}, "description": "This Art Deco hotel features a first-floor atrium, a bar and rooms which include breakfast. Chambord has a 24-hour front desk and is a 5-minute walk from the Magritte Museum.Cable TV and a desk are provided in the sound-proofed rooms at Hotel Chambord. The breakfast buffet features a selection of warm dishes, pastries and fresh fruit salad.Porte de Namur metro station is only 500 ft from Chambord. The Royal Palace is a 10-minute walk away and the famous Grand Place is one mile from the hotel.ll fountain statue of Manneken Pis. On the main square of the Grand Place you can admire Brussels’ remarkable Gothic Town Hall or visit the City of Brussels Museum. More Gothic grandeur is to be found in the St. Michael and St. Gudula Cathedral at the Treurenberg hill. For shopping, the centre is also an excellent base. Browse around the large City 2 mall or discover the charming little boutiques and brasseries of the Royal St. Hubert arcades. Part of the EU Quarter, Brussels Park is surrounded by the Royal Palace of Brussels, the Belgian Parliament and the U.S.A. embassy."}