{"user_rating": 5.0, "review_count": 133, "name": "Hotel Esperanza", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "If you are looking for a small, intimate setting that is is clean, friendly, very reasonably priced, and close to the beach, but nice and quiet, this is it. Dennis Clifton and his crew will definitely take care of you and tend to your needs. Pictures on the motel's website are very good and accurately reflect just how nice it is. The first night we were trying to decide whether to eat at the restaurant there or go to another one. We chose to eat there. After a wonderful meal that night, there was no decision to make the next two nights. We ate there and were happy we did. The breakfasts were great too.", "title": "A wonderful slice of Costa Rica with American service and standards", "user": "DaveSiegwald", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67604534}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We just returned to Florida after spending two weeks in Costa Rica. We stayed with Dennis at Hotel Esperanza for three of those days. This was our third trip to Costa Rica and knew that it was the rainy season. It didn't really bother us, though, because being there in the rainy season means seeing everything green and beautiful. We took some side trips to explore parts of Guanacaste we hadn't seen before. Every afternoon we enjoyed cooling off in the lovely hotel pool and jacuzzi. We weren't sure how the restaurant would be, but were so pleasantly surprised that we ate every breakfast and dinner there. Dennis prepared anything we wanted for dinner. Be sure to try the Pineapple Flambe for dessert. Breakfast was delicious--fresh papaya, mango and other fruits every morning. The rooms were immaculate; the beds fresh and comfortable. Dennis was very knowledgeable about the area and gave us great recommendations for places to see, too.", "title": "A quiet, relaxing place to stay.", "user": "jolsSarasota_FL", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67604124}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My partner and I travel all over the world and no one has ever given as much personal service as Dennis. He takes care of your every need while you stay with him and it really is like staying at home.", "title": "Home away from Home", "helpfulness": 1, "user": "TechMarauder", "date": "June 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 66422962}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "That being said, the rooms are comfortable, but on the small side. The beds are new, but a little firm for our taste.", "title": "Dennis was great!", "user": "jsclafani", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65903776}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Overall, the hotel offers what you need at a beach location - clean, comfortable accommodations with a great breakfast and an amazingly attentive host.", "title": "LIKE STAYING WITH FAMILY......THE ONES YOU ACTUALLY LIKE TO STAY WITH!!", "user": "bengaum", "date": "May 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65839446}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "This is a great little boutique hotel that you can walk to Playa Carrillo from. Great value overall. The rooms are clean, plenty of hot water and water pressure in the shower. Beds are comfortable and there is air conditioning. Service is awesome as Dennis the owner will try and take care of anything you ask, literally. Good food for dinner and a nice little breakfast provided. But again, for me it was being able to walk to Playa Carrillo, which is my favorite beach in Costa Rica. No development on the beach at all, so you need to drive or walk there. A little hill coming back, but no issue. Pura Vida.", "title": "Great location, service and value.", "user": "EasyGoingMidwestGuy", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 91314162}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The service was great, and the hotel was so beautiful. For the price I felt that it was extremely reasonable. I would highly recommend this hotel for anyone traveling to Playa Carillo.", "title": "Excellent place to stay.", "user": "connie330", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82048189}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Dennis, Dennis, Dennis.", "title": "I wanted to come back before I left", "user": "GDTQuemadotx", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79072375}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "He is the Esperanza Hotel. The hotel has been recently remodeled and the pool area is spotless. However, Dennis, who is the owner, is what makes this place stand out even more.", "title": "We were taken care of with such personal service", "user": "DFamilyWoodstock", "date": "August 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 75369398}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "From the moment we arrived until when we drove away, Dennis was always ready to take care of us. It was also great to have the tour guides pick us up right at the hotel. Dennis has a great relationship with the locals that provide the tour services and always knows the right man for the job. I was travelling with my wife and four friends and we can't wait to head back.", "title": "Dennis knows how to do it right!", "user": "atlasb5", "date": "August 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74365229}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We chose the Esperanza for its quiet location and cozy atmosphere. Upon our arrival and for the next eight days, it surpassed our expectations. Dennis and his staff maintain a tropical piece of heaven: delicious meals, lovely gardens (well tended by Favio) including a star fruit tree guests can snack from, tour and car rental arrangements and comfortable, quiet rooms. The main attraction here is Dennis, the owner of the hotel. He openly shares his knowledge of the area with his guests, and he makes a mean mojito. And if you're lucky, Ana will cook up her fabulous gallo pinto for breakfast! Ask for the bottle of Lizano. It's a short walk to one of the best beaches in the world. Playa Carrillo is a crescent shaped soft sand beach lined with hundreds of palm trees and no hotels, no condos. The nearly empty beach offers calm waters and beautiful seashells. Samara is a ten minute drive away. Shops, restaurants and surf schools can be found there. Playa Carrillo also has a few nice places to dine, all within walking distance of the Esperanza, but Dennis' menu is hard to beat. That Mai Kai Chicken is awesome. We cannot wait to return for some more chill time with Dennis. We have never had a more relaxing vacation ever.", "title": "Intimate Hotel with First Rate Hospitality!", "user": "mercedes62", "date": "July 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72788735}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "My wife and I stayed here for a few days on vacation. Dennis the owner was present and available at all times during our stay, and made sure that we were well taken care of. The beds were very comfortable (best of our whole trip) and the overall feeling of the place was great. It's the nicest place in Playa Carillo that we could discern. Food was good and they have a nicely stocked video selection for any rainy days you might find yourself inside. A couple minutes drive to Samara made it very convenient for getting around, and only about a block or 2 from the beach (had it almost to ourselves). Overall a great experience", "title": "Nicely Updated Hotel with Excellent Service and Convenience", "user": "nsaylor", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71965303}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We really enjoyed our stay at Hotel Esperanza and cannot say enough good things about the owner, Dennis. He kept us fed, entertained, and comfortable during the 5 nights we stayed with him. The Hotel is small, but lovely. There's a small pool, a separate whirlpool and a small toddler pool, plus the beach is a short walk away. We ate at several restaurants around the hotel, as well as in Samara, but nobody beat Dennis' food or service. I casually mentioned that my husband loves mojitos, and Dennis went out of his way to get mint and limes (both hard to come by in this area) so he could make the drink for him. The included breakfast was a treat as well and was a step up from the normal continental fare. We were served fruit, bacon, eggs, and even french toast. Overall we really enjoyed our stay and would stay with Dennis again. Pura vida!", "title": "Great trip! Dennis is the best!", "user": "HopeM", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 71518082}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Hotel Esperanza fit the bill perfectly for our recent honeymoon!! The best things about this hotel are its location, and the service of its staff. Everything was clean, and Playa Carillo is just a short ten minute walk away. We spent our days relaxing on the quiet beach (which we almost had completely to ourselves, due to the off-season), or by the pool, where Dennis and his pleasant staff did anything we asked to ensure that our experience was the best it could be. We dined in the restaurant twice, and the food and cocktails were some of the best we had in Carillo or Samara. Dennis also made arrangements for us to go on a guided horseback tour of some of the surrounding mountains of Carillo (as well as a secluded beach), which was surely a highlight of the trip!! The newly-remodeled rooms are exactly as described on the hotel's website, you can trust what you read and see there. Throughout our stay, my wife and I kept remarking about how glad we were that we had found Hotel Esperanza and had not wound up staying in one of the other hotels in Carillo or Samara. It was that good!!", "title": "Perfect For Our Honeymoon", "user": "jharrison61210", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69889953}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "After 2+ weeks of active touring around CR, we were more than ready for some down time at the beach, and Hotel Esperanza filled the bill nicely! The 10 minute walk to the beautiful and nearly deserted Playa Carillo was just enough exercise for us each morning. Dennis, the owner-manager, was attentive to our every need, and a good guy to boot! The daily breakfasts were well prepared, and served to order rather than buffet-style. We ate dinner here on 3 occasions, and all the meals were excellent as well; there's an extensive menu to choose from. The rooms were clean, the staff pleasant, the grounds well kept, and the pool refreshing, particularly when afternoon cocktails were a part of the routine!", "title": "Great End to a Great Vacation!", "user": "Kevin1948CO", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69765032}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The Hotel Esperanza is beautiful. The food was excellent, and the hotel owners and staff are extremely professional and helpful.", "title": "Our visit to the Hotel Esperanza in Playa Carrillo was wonderful.", "user": "professsor2010", "date": "May 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65603374}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Great place to stay by the Playa Carillo - a top 10 beach in the world!", "title": "Love the Esperanza", "user": "RFM3", "date": "May 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63458322}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Dennis couldn't have been nicer. He's full service if the hotel isn't quite.", "title": "Great experience at Esperanza", "user": "RFM3", "date": "April 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62516749}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "It's only 7 rooms and they're not large but they are very comfortable", "title": "Amazing Service--Great Stay", "user": "beany88", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61703038}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "and come with a gracious host. Thanks Dennis!", "title": "A Charming Hotel near a Hidden Gem of a Beach.", "user": "jbellomo", "date": "April 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 61615485}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Playa Carrillo"}, "variance": {"poor": 1, "average": 3, "very good": 14, "terrible": 1, "excellent": 114}, "aka": "Esperanza Hotel Playa Samara", "slim_ranking": 0.142857142857, "description": "We are a family oriented hotel, welcoming singles, couples, wedding parties, families, children, and handicap guests. Being a small hotel of 7 rooms we offer a warm family atmosphere with the added bonus of having the amenities of the larger hotels. In 2007 we accomplished a total remodel including all guestrooms with European tiles and exotic Mahogany and Cedar woods throughout. The hotel also features the addition of a new custom pool and spa."}