{"user_rating": 4.0, "review_count": 1083, "name": "Hotel Morgana", "reviews": [{"rating": 4.0, "title": "Fantastic, but be aware of location", "text": "If you're going to Rome, then you should be aware that it is easy to arrive to- and depart from a hotel in the Termini area. And it is nice to have the the central bus station and metro close by.", "helpfulness": 26, "user": "A TripAdvisor user", "date": "May 6, 2005", "id": 3445780}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "But it isn't terrible close to most of Rome's attractions, and thats our major complaint about this hotel (as well as any hotel in the Termini area).", "title": "Prego!", "helpfulness": 40, "user": "mike3", "date": "March 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3299011}, {"rating": 2.0, "title": "We must have visited another hotel!", "text": "I can't understand it. Our room looked NOTHING like those in the photos on all the hotel sites. Our \"air conditioning\" consisted of a small humidifier-like rolling unit from the 70's, with a large tube attached to the window. As long as you stood within 2 inches of the unit, you felt a cool breeze. The decor was clearly 1970's....tile floors, an etched glass chandelier with one light bulb, little other lighting, and etched brown tiles in the bath....at least we were able to get a hot shower. Front desk service was adequate, although they skipped our wake-up call on one day when we were scheduled for a tour, and they were hesitant to call a cab for us when requested. The breakfast and breakfast area were nice, and service was excellent. The Termini area is fairly seedy, particularly at night. Given the price, we expected much more, especially for a 6-night reservation, and we would certainly not recommend this hotel, with all of the choices in Rome.", "helpfulness": 4, "user": "Chicagojill", "date": "October 5, 2005", "id": 3994980}, {"rating": 4.0, "title": "Great hotel, friendly staff", "text": "We just back from a 6 night stay at the Morgana. The hotel was very nice and a great value for the low rate we paid. The room was average size by european standards. It was decorated with antiques. The marble bathroom was very nice and had a full bathtub and shower. Our room was spotless and housekeeping did a great job keeping it that way. The breakfast was very good with an assortment of rolls,breads,pastries,cheeses, cereals, juices and coffee. The entire staff was very friendly and worked hard to ensure we had a nice stay. The only drawback was the location. The hotel is located near the main train and bus station, which is great for getting around the city. No need to ever take a taxi, all busses and trains are a few short blocks away. However the area can be alittle seedy, we never felt threatened or unsafe but its just not as pretty as some of the other areas we saw. Also a big plus was that the hotel offered a free one way transfer to the airport if you book direcly with them. That saved us time and money as we had a very early flight home. All things considered the Morgana is great hotel.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "August 28, 2005", "id": 3811783}, {"rating": 4.0, "title": "Perfect Location", "text": "Hotel Morgana is a perfect hotel for those primarily interested in sightseeing in Rome. It is a quick walk from the hotel to the Metro station which will take you anywhere you want to go in Rome. Since there are so many things to see in Rome, this is very important. No one hotel will ever be close to everything you want to see. It is best to get as close to the metro station as you can in Rome. In this case, Hotel Europa is the place to be.", "helpfulness": 11, "user": "Micho123", "date": "August 19, 2005", "id": 3790895}, {"rating": 3.0, "title": "Morgana hotel, good and bad", "text": "The hotel itself is nice and beautifully decorated. The rooms are small, but large enough to do whatever needs to be done before another day of sightseeing. The bathrooms are of average size and the only complaints we had about the bathroom was the tiny shield that was supposed to keep water in the shower. The first night the bathroom was practically flooded because the water pressure shot the water over the small shield (we learned after that night and it wasn't such a problem).", "helpfulness": 12, "user": "tessieUKsurrey", "date": "August 6, 2005", "id": 3741790}, {"rating": 5.0, "title": "Great Hotel", "text": "The breakfast buffet is good the first two days, but it NEVER changes. By the last day (we where there five days) my husband and I almost cracked ourselves up because we knew exactly what food to expect. I would recommend venturing out for breakfast after the first two days, especially if you don't enjoy eating the same thing every day. Free or not, it eventually is not worth it!", "helpfulness": 20, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3706229}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 75, "average": 177, "very good": 399, "terrible": 38, "excellent": 394}, "aka": "Hotel Morgana Rome", "slim_ranking": 0.210734017364, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Hotel Morgana is a charming four stars hotel, ideally located in the heart of central Rome and within walking distance to the main cultural and architectural landmarks as Colosseum, Trevi Fountain, Roman Forum and the Spanish Steps. Hotel Morgana is closed to Termini railway station and steps away from th main bus and subway lines stations thus it allows an easy access to any sites. Hotel Morgana features 121 spacious and luxurious guest rooms and suites that are stylishly designed with a fusion of comfort and elegance."}