{"user_rating": 4.0, "review_count": 95, "name": "Hotel Piazza di Spagna", "reviews": [{"rating": 3.0, "title": "Great Location", "text": "The hotel is the perfect location, two blocks from Spanish Steps. Right below us was a cafe with a gypsy boy singing and his father playing accordian at night (except Saturday evening when things quiet down early, in anticipation of Sunday.)", "helpfulness": 11, "user": "lkn", "date": "October 1, 2002", "id": 708049}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "I stayed here in May 04. This is an excellent hotel. The location is brilliant - it is literally round the corner from the spanish steps.", "title": "Brilliant location", "helpfulness": 10, "user": "Captain_Caveman", "date": "September 7, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 2516294}, {"rating": 3.0, "title": "Great location", "text": "We got a free upgrade to a deluxe room. The rooms were large, clean and very well presented.", "helpfulness": 6, "user": "stevelup", "date": "July 24, 2004", "id": 2318835}, {"rating": 5.0, "title": "Adored the Piazza di Spagna", "text": "Breakfast was - very european - just simple.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 20, 2004", "id": 2093270}, {"rating": 4.0, "stay_parameters": "Stayed February 2002", "text": "This hotel is not cheap but worth paying for if you want a hassle free trip to Rome.", "title": "Wonderful, charming and quaint!", "helpfulness": 3, "user": "Pam A", "date": "February 17, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 1658566}, {"rating": 2.0, "title": "Not so Good", "text": "Location is ideal if you want to be near the action. The Spanish Steps Piazza is just around the corner and there are 3 or 4 wonderful restaurants with outdoor seating on either side of the hotel. Shoppers beware: The Via Condotti is next to the hotel and has every high priced fashion boutique on the planet. The only negative to this hotel was the bathroom, which had an unpleasant odor upon our arrival and it never dissapated. I would rate it a 2 and 3/4 star hotel only for this reason. There is one computer in the lobby that is connected to the Internet and free to use on a first come, first served basis. The staff was very friendly and helpful.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 12, 2003", "id": 913396}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 6, "average": 15, "very good": 45, "terrible": 6, "excellent": 23}, "aka": "Piazza Di Spagna Rome", "slim_ranking": 0.300710339384, "description": "Situated on a charming street between Via Condotti and Via della Croce, only two minutes walk from the Spanish Steps, it is in a perfect position for sightseeing, shopping, visiting museums and restaurants and walking in historical Rome. The hotel, owned and run by three generations of the same family, has a worldwide reputation for caring for its guests who return year after year. Completely renovated and refurbished, with a new breakfast room, each room has its own individual character and offers that personal touch which makes staying with us a truly enjoyable experience."}