{"user_rating": 4.5, "review_count": 2050, "name": "Hotel Monteleone", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "We were in New Orleans for a Conference and didn't book the rooms in time to get the hotels which were reserved. We found the Monteleone by accident on the internet. It was very reasonably priced and in fact was less than most of the hotels which had been reserved for the conference. We were very pleasantly surprised to find this hotel top notch by any standard. The Bellmen open the doors for you day and night and direct you up the red carpeting into the luxurious lobby. The rooms were beautiful. It's one block off Bourbon St. yet completely quiet. The staff was very attentive.", "title": "Monteleone Very Luxurious", "helpfulness": 9, "user": "Jalby", "date": "August 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3815793}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "I would highly recommend it and wouldn't stay any where else if we return to New Orleans.", "title": "Great weekend package", "helpfulness": 7, "user": "EMCPhiladelphia", "date": "August 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3815171}, {"rating": 5.0, "title": "Can't Wait to Go back", "text": "A friend and I booked a 2-night package the week before Christmas 2004, just after the hotel's spa first opened. We had a great time. The room included the spa goodies and champagne we were promised as part of the package; it was big enough and it and the bathroom were sparkling clean. The breakfast buffet was good and the hotel looked beautiful for Christmas. The location was great for getting out into the Quarter on foot or catching a cab elsewhere. The layout of the spa was a little odd (we sort of loitered in the hallway to wait for our pedicures), but the massage was first-rate. Our room was right off the elevator but I don't remember it being particularly noisy--except when there was a Dixieland band playing out front on Saturday afternoon for a wedding (!).", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 24, 2005", "id": 3803256}, {"rating": 1.0, "title": "Extremely poor service", "text": "First trip my partner and I had gone on so wanted everything to be perfect and it was. The hotel is located right in the French Quarter but away from the noise, everything was within walking distance. The Oyster Bar connected to the hotel had the best oysters, we ate there everyday!!! We had a standard room with a king size bed. A little small but very classy. The staff were all friendly and helpful. We enjoyed sitting by the pool and looking over the city. What can I say, we'll be back!!!!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 20, 2005", "id": 3791866}, {"rating": 5.0, "title": "Loved the Monteleone!", "text": "We were originally booked at another hotel, but based on the excellent reviews on this site, we changed our plans and called the Monteleone directly to book a non smoking Deluxe room with a King bed from Sunday through to Friday in June. We checked in approximately 6 PM on Sunday, and were told that we were being given a non-smoking room with two double beds. We asked if we could move to a non-smoking king room on Monday. At that point we were told that one of the hotel's buildings was scheduled for power work on Tuesday and that non-smoking king rooms were available and we could have a room in this building and would be moved on Monday morning when a room came free in the other building. We were told that the Hotel Staff would move our luggage to the new room and we would be able to pick up our new key cards when we returned to the hotel on Monday afternoon after a day of sightseeing and tours.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 16, 2005", "id": 3778295}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Based on 3 different travel guides, I booked the Monteleone for my 12 year old son and me to stay 4 nights. I have no major complaints, but I caution anyone who reads those books to read the fine print; despite many glowing reviews about the newly renovated HUGE rooms, our room was so small that we literally had to move furniture in order to OPEN the suitcase. TINY. It was clean, it had a view of the Mississippi, and all worked well..but it was tiny. Front desk friendly but not entirely informed Other staff seemed kind of uninvested or not able to speak English, so communications were garbled. It's in a great place, it's got history, and it's clean and fine...but I never felt that anyone there had any clue who I was when I entered or any concern that I have a good time. I really don't want to sound too negative, but I guess I felt like a number in a place where I hoped for more. That said, we were never unhappy, and if I lived in a city that went thru Katrina , I wouldn't much care about the northern girl and her son, either. I wouldn't have trouble recommending the Hotel--I just was selfishly hoping for more.", "title": "No complaints", "helpfulness": 1, "user": "rella2", "date": "April 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 14723153, "likes": {"liked": "— History, Look, travel Book reviews, Location", "disliked": "— size of room, lack of personal touch, not great food options in hotel"}}, {"rating": 1.0, "title": "BAD, Hotel Monteleone", "text": "On 03/21/08 had received a confirmation of our standard double room + free upgrade upon checkin via Book-it.com. This was pre-paid in full. On our arrival and attempted check-in at the Monteleone were abruptly and rudely told our booking agent overbooked and they did not have our room. Tine, the check in staff could not find accomodations to fit us. A self proclaimed front desk manager stepped in explained it was book-its fault they overbooked not the hotel. I tried to explain and show him we have a confirmation number. He did not want to listen, nor were we given any other room options. The only offer he gave would not have accomodated us. 2 adults, and an adult sized teen son, would not be able to stay in a standard room w/a roll away at an additional charge of 25.00 for the roll away. We left upset and angry. And are now fighting all involved to get our refund for a room we never stayed in. This is a travel Nitghmare !!! Now they saying we never arrived at the hotel, funny we have a dated picture of the clock in the lobby, and our luggage tickets from valet parking. This is not worth the trouble do not stay here!!!", "helpfulness": 5, "user": "mjcat002", "date": "March 31, 2008", "id": 14682923}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Trip: Jan 27- Feb 2 Business Conference right before Mardis Gras", "title": "Business and Pleasure", "helpfulness": 1, "user": "Quellman", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14603488, "likes": {"liked": "— Close to all attractions and points of interest.", "disliked": "— You have to know which elevator set goes to which floor, sometimes you have to have a transfer."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Location: French Quarter, 1 block from Canal and Bourbon Street. 10-15 minutes from Harrahs and River Walk. Short 10 minute streetcar ride to Garden District.", "title": "Loved the Monteleone", "helpfulness": 2, "user": "ysolde", "date": "March 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14554842, "likes": {"liked": "— The ambience"}}, {"rating": 4.0, "title": "Great Experience at the Monteleone-Not for the Budget Conscious", "text": "Room: I stayed in the main tower, 9th floor overlooking Royal Street. I didn't honestly see the smallness of the room. The king bed allowed ample room on either side and there also was a desk area. The bathroom was very large with a great shower/tub that you could actually soak in. The rooms are all very different. I went to a colleagues room and they had a slightly smaller bathroom but a larger main room with an extra chair.", "helpfulness": 1, "user": "EmmanLukesMum", "date": "March 25, 2008", "id": 14516541}, {"rating": 4.0, "title": "When I think of great New Orleans hotels, I think Monteleone.", "text": "Enjoyed a 4 night stay at the end of May. Second time as a guest of the Hotel Monteleone and have always found it to be a grand property and in a PERFECT location...just steps from Bourbon Street and the great little shops on Royal Street.", "user": "Out_And_About_365", "date": "July 9, 2009", "id": 34333213}, {"rating": 2.0, "title": "Never Again", "text": "Nice, fresh looking room with an air-conditioner that could really cool down the place; however, the weather was so unusually nice (read dry and in the 70s) that we didn't spend a lot of time in the room this trip. The room-darkening blinds are a plus for an afternoon nap.", "user": "Ocracokey", "date": "July 9, 2009", "id": 34307427}, {"rating": 5.0, "title": "A Lovely Old World Hotel w/ Wonderful Service", "text": "The breakfast buffet (main restaurant, along with an ala carte menu) had me coming back for biscuits and gravy every day. The Carousel bar is a great place to meet for a drink. I have other friends and relatives in the area that visit the Carousel bar so the combination of locals and tourists is fun. Where else can you find a revolving carousel bar?", "user": "TravellinBabe", "date": "July 7, 2009", "id": 34128727}, {"rating": 5.0, "title": "A Great New Orleans Hotel", "text": "The hotel feels like it is just bursting with history - and it is. Add to that the seasoned staff members that know much about the property and the city and you can't go wrong. Even if you are not staying here, stop in and take a look.", "user": "athomeinthepines", "date": "July 1, 2009", "id": 33702612}, {"rating": 5.0, "title": "Beautiful older hotel @ a great price", "text": "We stayed in the Moneleone last January and was very disappointed, the staff was sooo rude and the rooms are not what you see on the internet. The room was so small. We go to New Orleans at least once a year, have stayed just about everywhere down in the French Quarter, sorry to say we will never stay at the Monteleone again!", "user": "Gnacat", "date": "July 1, 2009", "id": 33699688}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Our room was small, but immaculately clean, and for New Orleans (and Royal Street!) was ***quiet***. Service in every part of the hotel was excellent, including the Aria Spa. As previously noted, the internet service is not good, and the bed cover has to go (it slides all over the place!) but this was still an great hotel overall.", "title": "An excellent location...excellent service!", "user": "valita", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110633230}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "We've been to New Orleans many times, but this was our first stay at the Monteleone. We'll be back!", "title": "Perfect Location - Exceptional Staff and Service", "user": "MaryBeth5150", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110583211}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "Just came back from 4 days in New Orleans and we stayed at the Hotel Monteleone. Check in was quick, although our room was not ready as we had asked, but I realize that early check in is something that may not be able to be accommodated. They were kind to call when the the room was ready and the friendly staff member checked our luggage promptly in the lobby. The room was beautiful, roomy ( we had a royal salon) and the housekeeping staff quickly arrived with a firmer pillow when asked. Another friendly staff member arrived promptly when we had difficulty with our room safe - fixed on the spot - no further problems. However, what I feel makes the Monteleone the exceptional hotel it is, is Miss Eva, the concierge. She was literally our \"fairy godmother\". She answered all our questions, offered helpful hints and advise and all with a delightful sense of humor. If you are looking for a hotel where you truly feel pampered and special - look no further, the Hotel Monteleone is all that and more. It's location is close to everything. We walked to the aquarium, River Walk shops, the French Market and many of the sights of the French Quarter. You are so close to everything. It was also easy to catch a streetcar to the Garden District (thanks for the help, Miss Eva). The only challenge I feel this hotel has is that the rooftop pool (spectacular) is quite small compared to the number of guests the hotel welcomes. However, even during the busiest times, Zach the bartender and Meredith, a pool staff member always remained pleasant and helpful. I believe the hotel was particularly busy given the Memorial Day Weekend and a wedding that was being held there.", "title": "Highly Recommend", "user": "TampaScott", "date": "May 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 110223018}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My wife and I stayed at the Hotel Monteleone for an entire week. The room is above average size for New Orleans, and the hotel itself, on Royal Street, could not be in a better location in the French Quarter. The staff were all excellent, the room service food was outstanding and even made formal with a full tablesetting. Why would you order room service in New Orleans? Well, as rookies, we had not yet discovered the power of the extraordinarily strong beverage called the \"Hand Grenade!\" I had two of those the night before, and did not feel like going out for dinner. Nonetheless, the food was very near of gourmet.", "title": "We Are So Staying Here Next Jazzfest", "user": "sisukas_mia", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 109496742}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The one complaint is the horrendous Internet service. Fortunately, my iPad has the cellular service, so it was not a big problem for me. Still, there are times you would like to get on your laptop, and I wound up subscribing to the city service for $19.95 a week. Please, do not even bother with that, as it will make you feel like you have entered a time warp and have found yourself back on dial-up. All of that said, this should not be a deterrent to anyone, because notices were delivered to each room that starting next week they are upgrading room-to-room Internet service to modernize the hotel as far as technology.", "title": "Lap of Luxury!", "user": "stingerjeep", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109380275}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "Most of the previous reviews had it right. First the bad: the room was so small that when the dresser drawers were open, you could not walk past the bed. At the end of my first day, I returned at 4:30 PM after walking all day and found that the room was not made up. When I called housekeeping, they informed me that they had until 5 to make up the room and if I wanted early cleaning, I should schedule it. So for the next 3 days, I asked to have the room made up by 1 or 2 pm. And it worked - they got the message. But at a 4 star, you might expect turn down service, not a cheeky \"we have until 5 to clean your room.\"", "title": "Might return, might not.....", "user": "Sactoresident", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 15388465, "likes": {"liked": "— Location", "disliked": "— Housekeeping attitude"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "On the good side, everyone except housekeeping was helpful and pleasant. I arrived late, nearly 10 PM and checkin was prompt and efficient. The room was clean and the bathroom was large. The AC had a thermostat so you could turn it off/on and set the temp. The halls were quiet. It was a great location and felt very safe. There was an ATM in the hotel - very handy and a FREE Internet kiosk to print boarding passes and check flight status.", "title": "Great location, but...", "helpfulness": 1, "user": "sweetlouBaltimore", "date": "April 21, 2008", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 15189486, "likes": {"liked": "— location", "disliked": "— check-in"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We picked this hotel because the conference my wife was attending was headquartered there. The location was really fantastic, right on Royal and only a block from Bourbon. We were lucky enough to get one of the larger/newly renovated rooms. The room was clean and modern, but nothing to write home about. We saw the room of our not-so-lucky friends and it was extremely small with a tiny bathroom and ancient looking fixtures. On the plus side, the pool was a pleasant way to take a break from the day's activities--there is ample sun-bathing space and a pool-side bar. My biggest complaint was that we were not permitted to enter our room until 5pm. They stored our luggage, and there was obviously plenty to keep us busy around the French Quarter. But we arrived at the hotel from the airport at 11am. No one at the check-in desk was interested in making sure that we were placed in a first available room. We sat in the lobby watching people arrive at 3pm and promptly receive there key. I have never had to wait so long to get into my hotel room. Next time, I'll try a new place.", "title": "Value is in the location, not the tiny room", "helpfulness": 1, "user": "CMMNYC", "date": "April 16, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 15083670}, {"rating": 2.0, "title": "Perfect Location", "text": "Was exctied to stay at the Grande Dame of New Orleans hotel and sure enough it was a lovely property. Impressive lobby, nicely appointed.", "helpfulness": 1, "user": "Wabamik", "date": "April 12, 2008", "id": 14979920}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Location in the heart of the French Quarter was very convenient (watch the block between the hotel and Canal Street though, pretty gamey even to a NYer.)", "title": "Highly Recommended !!!", "helpfulness": 1, "user": "MirandaTravel", "date": "April 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14896400, "likes": {"liked": "— location", "disliked": "— Pool was too small"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "While the folks working at the Monteleone are helpful... they can't overcome the horrible mattress situation they have going on here. Maybe I've stayed in too many Westins and J. W. Marriotts but this qualifies as the worst sleeping experience I have ever come across. Please Monteleone consider replacing these Sponge Bob facilities you call beds. Also parking is over priced. Drive a couple of blocks to Canal Place shoppes and park there for $10 less a night. On the bright side the bathrooms are really spacious.", "title": "Worst beds in the world", "helpfulness": 1, "user": "7planes7days", "date": "January 3, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 6546591, "likes": {"liked": "— Bathrooms were spacious", "disliked": "— Horrific beds"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "My husband, son, and I just returned from our annual Christmas weekend in New Orleans. I've considered the Hotel Monteleone before, and decided to book it this year, mainly based on the Papa Noel rate. We were very please with all aspects of our stay. The room was very clean, well appointed, nicely decorated, and comfortable. There was no problem with noises. We had a limited view, but I was antcipating that due to the special rate. I didn't mind. (I prefer to see New Orleans from the ground up, not looking out a window.) The staff was very friendly and helpful. You can't beat the location! It was so easy to get to pretty much anywhere we wanted to be. We tend to try a different hotel each time we visit, but I think we've found a permanent home away from home. I would recommend this hotel to anyone.", "title": "Wonderful", "helpfulness": 4, "user": "CenlaTraveler", "date": "December 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6453927, "likes": {"liked": "— Beautiful Hotel", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Just a note on New Orleans: Please come down to visit in this remarkable city! The French Quarter, Riverfront, and Central Business district are in great shape, and the one thing that will get the city back to normal is....YOU! Come spend your money, eat great food, shop in fabulous stores, tour amazing places, and experience the magic that is New Orleans!", "title": "Fabulous, as usual", "helpfulness": 7, "user": "cliff1788", "date": "December 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6344264, "likes": {"liked": "— Service and freindliness. The staff was very attentive to our kids and my wife....They were thrilled to see tourists!!!", "disliked": "— Parking garage was expensive!!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Me, wife and 3 kids stayed at Monteleone for a night 11/21/06. The Hotel was not damaged by Katrina but you can tell that the City has taken a tourist hit. There were far fewer people in the Hotel and in the city than in past visits. This is just another GREAT reason to visit this hotel. The Monteleone apparently took the opportunity to upgrade its rooms just after the storm. The beds were fantastic! All of the sheets are of high quality and the pillows rival any hotel. The carousel bar was busy every night and had a great clientele. The drinks are priced reasonable and stiff! We did not eat at any of the Hotel restaurants. My 9 year old daughter and I thoroughly enjoyed the audio tour of the hotel. This is a free service provided by the Monteleone. I am not a history buff but the tour is VERY impressive. We did it because it spotlights ghost sightings in the Hotel....partuicularly on the 14th floor....Which is where we stayed. Fortunately...we did not see a ghost! We loved this hotel! New Orleans will make it back bigger and better. In fact the Quarter seemed cleaner than in years past . The restaurants were a lot less crowded but the service and great tasting food was still there! This Hotel is centrally loctaed and perfect for Bar hopping or just hanging out!! We will definitely stay there again for the Sugar Bowl.", "title": "The fabulous Monteleone", "helpfulness": 10, "user": "jamimi", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6083543, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "the monteleone is absolutely wonderful in every way. staying here really made our nola visit more memorable. if you can stay here, do so. you will not regret it. the location is perfect. we could walk to many points of interest, restaurants and shopping. boubon street is a few minutes walk.", "title": "Perfect hotel!!!! Will return!!!", "helpfulness": 8, "user": "bbwvixen", "date": "November 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0}, "id": 6062625, "likes": {"liked": "— The whole decor, and location", "disliked": "— Price of phone calls and internet"}}, {"rating": 3.0, "title": "Decent Hotel, Great Location", "text": "Hotel was decent and close to everything. Room was small, but worked fine for what we needed. Roomed seemed clean, and bathroom was nice. We got the room for $99 through Travelzoo. Seemed like a really good deal. Hotel staff was neither rude nor overly friendly. Wifi was offered at a fee. Valet parking was $30/day. Only drawback was that the hallway reaked of marijuana, and was a little loud in the middle of the night with people returning to their room. I guess that is all to be expected in New Orleans. Would stay there again.", "user": "TimandAsh", "date": "July 22, 2009", "id": 35447528}, {"rating": 3.0, "title": "Great location, horrible service - you decide what's important.", "text": "Preferred-king rooms are in fact often smaller than standard king - not worth the price of the upgrade.", "user": "ksd123", "date": "July 20, 2009", "id": 35274609}, {"rating": 1.0, "title": "Worst Customer Service Ever!", "text": "Any promises the staff give at time of reservations, check - in, or any other interaction are likely not to be communicated with anyone else. We had 4 different occasions where staff members didn't follow through on their word. And management was just as bad. They just don't seem to get the concept of customer service that one expects in a nice hotel.", "user": "TravelstheWorld75", "date": "July 16, 2009", "id": 34926025}, {"rating": 5.0, "title": "Love the REAL New Orleans Hotel!", "text": "On the other hand, the location is great. It's within walking distance of almost everything, yet removed from the noise and stench and traffic that befouls many other N.O. hotels.", "user": "amor915", "date": "July 15, 2009", "id": 34863449}, {"rating": 2.0, "title": "Understaffed and not well trained", "text": "If you want an average sized, clean room in a great location, and don't mind fending for yourself when it comes to service, then you'll find the Monteleone acceptable. If you are at home in the Ritz Carlton, then stay away from here.", "user": "italiafiend", "date": "July 12, 2009", "id": 34564055}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "We went to New Orleans to work on some company equipment nearby and stayed 4 nights. Check-in was very fast and with a friendly staff. I got up to my hotel room and it was clean, but very small. I had a king size bed that took up most of the room. I didn’t mind that too much since I was not there most of the time. The view out the windows was a wall but again I was not there to stay in the room. Getting the car each morning was quicker than I had expected after reading some of the other reviews. We were on our way each morning with about a 5 minute wait. One block off of Bourbon Street made the location great. The only minor negatives I can say was the view and the size of the room. Overall, we had a great time.", "title": "Very Nice Hotel", "helpfulness": 5, "user": "ITguyinTN", "date": "February 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 13206796, "likes": {"liked": "— Location", "disliked": "— Room Size"}}, {"rating": 4.0, "title": "Nice stay - great location", "text": "I stayed at the Monteleone twice in 2007. One was for a work conference and the other for a weekend get a way with my husband. On both occasions I found the rooms very nice (not large) and the staff accommodating. On the trip with my husband, I made a mistake regarding what type of room/bed I wanted. The front desk was able to accommodate our request and switch our room. This type of service is great to have - when so many front desk personnel at other locations can be rude.", "helpfulness": 3, "user": "baltochick", "date": "January 24, 2008", "id": 12958533}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The location of the hotel is superb for those who want to be very close to Bourbon street but do not want to be kept up all night due to the noise on Bourbon street.", "title": "Nice hotel... considering it's a block off Bourbon Street", "helpfulness": 4, "user": "CSquaredC2", "date": "January 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 12805209, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "If I had to make one suggestion to improve my ranking of the hotel it would be the concierge. Having been there twice and for stays more than 2 nights - the concierge appeared more interested in plugging some of the high end places rather than making recommendations for the moderate budget. (And let's face it you can only eat so much.)", "title": "Great Stay at Hotel Monteleone", "helpfulness": 1, "user": "buktrvlr", "date": "January 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12587622, "likes": {"liked": "— Location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "This was my first trip to New Orleans and I was there for the BCS game. The hotel was nice, staff was pleasant, although the rooms were small - but that's city life.", "title": "Love This Hotel!!!", "helpfulness": 2, "user": "mebetutu", "date": "January 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12496083, "likes": {"liked": "— Location", "disliked": "— Nothing I did not like!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I stayed once before years ago,We are locals.We took an upgrade to the next step up , in rooms ,and I tell you the room was very nice.You could tell there were renovations.The bathroom was very large.The view was awesome..Can I have this room again please? The pool scene was very cool ,mostly adults cooling off with a nice drink from the poolside bar,soooo hip..Great job Monteleone..The breakfast line was way too long.,,,but I shall return.", "title": "Cool Pool Scene", "user": "harleybonz", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113197173}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Fantastic hotel with real-world character. Very French Quarter and fits the culture nicely. I utilized the spa and that was great as well. The bar is a fun, unique carousel (a la the rotating restaurant on top of the Space Needle). People were VERY friendly and the family-owned attitude came through all the employees I came across. Room was clean and bath was great. No complaints!", "title": "Great Hotel in great location", "user": "Tim C", "date": "June 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113177887}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed at the Hotel Monteleone on Thursday and Friday, 6/9-6/11, overall the stay was quite nice, the location was great for French Quarter activities. The one drawback was that we had an outside room on the 9th floor facing the Marriott and Friday night the street noise was very, very loud. I am not a light sleeper by any means and the noise kept me up all night. If you are there for the weekend, I would request and interior room, our traveling companions had one, and you may avoid this one drawback, they did. Otherwise, I would suggest you stay here if you want the full French Quarter feel.", "title": "Overall Nice Stay", "helpfulness": 1, "user": "TigerBaseball", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 113088018}, {"rating": 4.0, "title": "Beautiful hotel, great location", "text": "This hotel has lots of character, and what are you doing in NOLA if you don't want character? The only downside was that I could hear the people above me very clearly, and the toilet flushing would wake me up. There was also an omnipresent low thrumming noise somewhere in the floor or wall, and I wound up using ear plugs my third and fourth night. Not unusual for hotels (especially an older one like this), but enough to go from 5 stars to 4.", "user": "soah_kim", "date": "June 10, 2011", "id": 112639968}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "For the 2 of us it was the perfect room. Great king sized bed, super water pressure, and no external noise which made for a perfect sleeping situation for our 3 nights. Always cleand to perfection when we returned from a meal, shopping or sight seeing.", "title": "All we could have ever wanted and then some.", "user": "tunistx5", "date": "June 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112449063}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Just returned from a girls getaway to New Orleans. The hotel is beautiful, conveniently located and the staff is superb. The front desk had no problems with getting us 3 rooms adjacent to each other. They also didn't quibble when we needed to split the bill 6 ways. Elke the concierge was great and the bell staff was wonderful. The Rue Royal location is great for shopping and it is in a quieter portion of the quarter which is nice. The rooms are smaller, more like a European hotel, and the layout can be confusing, but it is an older hotel. It is immaculately kept. Spa Aria is fabulous, Le Cafe had a good and speedy breakfast and Carousel bar is a good place to hang out. The pool was also nice. My only complaint is that the toilet flush was a bit loud.", "title": "Great Getaway", "user": "vlfair", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16676715, "likes": {"liked": "— Atmosphere and location", "disliked": "— loud plumbing"}}, {"rating": 5.0, "title": "Hotel Monteleone -- Great Experience", "text": "I am already planning my next trip back to New Orleans. Ten of us stayed at the Hotel Monteleone over Memorial Day weekend and LOVED it!!! The hotel is on Royal Street which is quiet and charming, but only a few blocks from Bourbon Street's fun raucous. After bar-hopping on Bourbon and Frenchmen Streets, and eating and shopping all over the quarter, it is rejuvenating to turn down Royal Street's quiet elegance rest up at the Monteleone. The Carousel Bar is really nice, and you see it as soon as you step pass the gracious doorman. The rooftop pool is nice, and a great place to read the paper early in the morning before heading out to breakfast. The fitness center which faces the rooftop pool is also quite nice --- quality equipment. The room was average size and well maintained. The bathroom was a decent size and also well maintained. Ask for a room with a view because one of our guest did not and was put in an interior room (no windows). When they went down to the desk to request a different room, they were switched to a different room with no problem. If you are looking for a city and hotel to have a wonderful time site-seeing, eating, dancing, listening to incredible music, then New Orleans and The Hotel Monteleone is where I would begin, if I were you :)", "helpfulness": 1, "user": "MFFNorthCarolina", "date": "June 3, 2008", "id": 16638388}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "If you want to experience New Orleans, stay at the Monteleone. The suite we had was huge with 1.5 baths and beautiful. The Carousel bar downstairs is a must-visit even if you don't stay there. Everything is convenient to the Moneteleone. You are on Royal Street with a look at the unique antique shops, yet only a block from Bourbon and all the action you could want. The area is very safe. Although I was there for a convention, I chose to stay at the Monteleone. I like staying in the Quarter, and I felt this was a better value and experience than the convention hotels.", "title": "Beautiful hotel in excellent location", "helpfulness": 1, "user": "GSC4ever", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16579880, "likes": {"liked": "— Carousel bar, day spa, LOCATION", "disliked": "— there is nothing bad at all"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The rooftop pool is excellent and includes a bar.", "title": "Very nice hotel to stay, close enough to everything, far enough from noise", "helpfulness": 1, "user": "Metravelnow", "date": "June 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16574026, "likes": {"liked": "— convenience of location to everything", "disliked": "— small room for deluxe king bed"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The day spa was wonderful, and I would also highly recommend it. I had a mani-pedi which was heavenly. I would return there for sure the next time I visit.", "title": "Good stay. Not fabulous.", "helpfulness": 1, "user": "amom1268", "date": "May 31, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 3.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 16547790, "likes": {"liked": "— staff", "disliked": "— tiny room"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "This was our first trip to New Orleans and probably our last. It was just not our cup of tea. We arrived late at night after driving for hours in the pouring rain. The weather was unseasonably cold for our October stay. We hadn't eaten and were directed to a family friendly restaurant on Bourbon Street, well within walking distance. The food was excellent, but this restaurant as well as most decent ones in New Orleans were really over priced. We stayed for two nights at the Hotel Monteleone and ate at one of Emeril's restaurants a few blocks from the hotel. Although a nice experience, it was close to $100 for two of us and it was nothing spectacular. His other New Orleans restaurant would have cost us $100 per person - outrageous!", "title": "Average, but historic and good location for Bourbon Street", "helpfulness": 2, "user": "brneyes514", "date": "January 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 2.0, "location": 5.0}, "id": 12436228, "likes": {"liked": "— Best price for New Orleans on Sky Auction", "disliked": "— Small size of room and horrible mattresses"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The hotel Monteleone for us was average. The room was on the small size with a nice view of the harbor. It was nice watching the barges, but the bathroom was also very small and the mattresses were terrible. The breakfast buffet (not included) was excellent with a lot of hot choices as well as cereals and fresh fruit. The staff were nice, the hotel was clean, well located and the decor was very nice and historic. If you want to be close to Bourbon Street, this would be a good option.", "title": "Perfect blend of history & service in the French Quarter", "helpfulness": 4, "user": "globe_walker74", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 12387779, "likes": {"liked": "— Service & location", "disliked": "— no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We spent 5 days and 4 nights in New Orleans celebrating a birthday just before Christmas. The always elegant hotel was beautifully decorated for the holidays.", "title": "Great weekend at the Hotel Monteleone", "helpfulness": 3, "user": "bdesmart", "date": "January 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 12261618, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Service was excellent, with a fast check-in, great restaurant recommendations as well as other activities all handles professionally by Eva the concierge. The Carousel Bar was fun, and housekeeping was always responsive but never intrusive.", "title": "Monteleone okay but...", "helpfulness": 4, "user": "astbear", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 12144933, "likes": {"liked": "— Location", "disliked": "— Very poor car retrieval after check-out & poor room service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The location is perfect - just a few minutes walk to everything in the French Quarter, but because you are on Royal Street you are away from the all night noise of Bourbon St. It is also an easy walk across Canal St to board the streetcars that are running again on St. Charles Avenue, giving you easy access to the Garden District and beyond.", "title": "Grand Hotel, Great Experience", "helpfulness": 6, "user": "Bumpkinsnana", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11715158, "likes": {"liked": "— Maintaining comfort, and elegance with timeless tradition. Had a firendly ghost encounter.", "disliked": "— That we were not able to stay longer!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We just returned from a trip to New Orleans. We had booked the trip before the hurricane to stay in a different hotel. When the other hotel was not going to re-open by the time we were scheduled to come down, we re-booked with Hotel Monteleone. This was our first stay at the Monteleone and we were not disappointed. The hotel was beautiful. The staff was very friendly and helpful. While we were told some services were limited due to the hurricane, we did not experience any ill effects. Room service had not yet resumed and the pool and fitness center were also closed (although guests were given the option of using the services at a different hotel). We were told that maid service was being offered every other day but we were visited by the maid every day that we were there. The only negative comment I could possibly make is that the size of our standard king room was very small but we did not spend much time in the room anyway. We were very impressed with the quality of the hotel and services - especially this soon after the devestation of Katrina.", "title": "Beautiful Hotel Back Again", "helpfulness": 19, "user": "camden72", "date": "December 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4251616}, {"rating": 5.0, "title": "Coming BACK!!!", "text": "I booked my husband and I a trip to New Orleans this past July 30th- August 7th", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 28, 2005", "id": 4069728}, {"rating": 5.0, "title": "Only Hotel I'll stay at in the Quarter!!!", "text": "It was a most enjoyable stay, the staff at the hotel were outstanding, we live a stones throw from George and Barbara’s house in DC, we’ve had the best the Nations Capitol, Northern Virginia, Ocean City MD and Atlantic City has to offer and The Hotel Monteleone was Superb~ As soon as we checked in I told them that I needed a refrigerator to keep my medications in, and we were not in our room 15 minuets when came the knock on the door it was house keeping with a refrigerator, After my first day of walking I needed a wheel chair, I ask the Concierge that morning for a wheel chair she ordered it for me and I had it before noon", "helpfulness": 6, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3932249}, {"rating": 5.0, "title": "Everyone Had a Great Time", "text": "Room Service was Great, Coffee was Great…… the Carousel Bar was FANTASTIC…Great Margaritas Guy’s and the Dinning was delicious! As hard as it was to watch all the Good People of New Orleans going through Katrina, I knew that they would come back! You can not keep a city that alive down for long~ Blessings to all at the Hotel Monteleone and all the citizens of NO…. I’ll be Back with a Passion~", "helpfulness": 9, "user": "A TripAdvisor user", "date": "September 3, 2005", "id": 3839974}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "I have to tell you that on our way home from dinner one night while on Canal St, my wallet fell out of the back pack I had on my lap, I figured I better say something to the front desk, because my key card was in my wallet, The lady at the desk was helping a gentleman, so I waited, not wanting to interrupt , when I spoke the gentleman who she had been waiting on turned and said are you Victoria, I about fell out……he had found my wallet and seen my key card and returned it to the hotel,,,,,,,,, What a wonder full man! We tried to give him the money that was in the wallet that was not important to us, but he being the good guy he is, would not take it, so we went in the Bar and sat and had drinks with him., Paul, if you ever come across this message I hope that your home made it through Katrina and if you were in NO that you and yours were able to get out safely!!!", "title": "Best Hotel we have ever stayed in", "helpfulness": 9, "user": "drlmiles", "date": "August 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3816556}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We (myself, husband and kids ages 6 and 3) stayed at the Monteleone on our way from Texas to Florida. It was CLEAN. The pool on the roof was BEAUTIFUL and perfect for swimming with little kids. The price was GREAT at $99 a night. The location was good, but kind of a long walk for little kids to Cafe Du Monde for breakfast. The bellmen and front desk clerks were very helpful. The concierge was okay - she sent us to Bubba Gumps for dinner which was loud, average food and expensive for the quality. I'm sure she took one look at my little kids and thought they could do little damage to that place. One negative was the noise on Bourbon street. Our room was on the 15th floor, but we could still hear revelers at night. BRING A WHITE NOISE MAKER WITH YOU. Luckily, I had brought my trusty box fan which I always use at a hotel to help drown out noises. Also, we had to park our car at a different hotel because Monteleone ran out of parking spaces. Overall I would HIGHLY recommend it for a family. One more point, the French Quarter has changed little just not as crowded and some stores/restaurants are closed. The rest of New Orleans, espcially downtown and east of downtown is strange. It's like a ghost town. Everything is covered in a grey film. Downtown hotels have reopened, but the office buildings and hospitals are are still abandoned with broken windows, many which have not even been boarded up. Abandoned cars sit under the highways. Driving along the highway east of town, entire neighborhoods are abandoned and seem to not have been touched since Katrina. At about 1 in 12 houses, you'll see a white fema trailer out front which is a sign of rebuilding. All the shopping centers are deserted and damaged except for building supply stores and car dealerships. It's spooky and sad. But do GO and TIP BIG. They need our help.", "title": "Great stay at Monteleone!", "helpfulness": 10, "user": "beasette", "date": "June 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5297101}, {"rating": 5.0, "title": "hotel monteleone", "text": "My wife and I stayed at the hotel monteleone (5/19-5/21 2006). Wonderfully run, very comfortable hotel with a perfect location in the french quarter. The room was spacious, clean and well laid-out. No complaints at all. Could not hear anything from adjoining rooms (a big pet peeve of mine) which was a relief. Great shower too!", "helpfulness": 4, "user": "jebargit", "date": "May 23, 2006", "id": 5193170}, {"rating": 4.0, "title": "Fully Recovered!", "text": "Support New Orleans and treat yourself to some great food and music!", "helpfulness": 14, "user": "Aleta K", "date": "May 10, 2006", "id": 5046625}, {"rating": 5.0, "title": "Fabulous time!", "text": "When my old college friend and I decided to re-visit New Orleans (where we went to college) for this year's JazzFest, we didn't know what to expect. The pre-trip research indicated that many of the open hotels in New Orleans were not 100% yet, i.e. either the housekeeping was minimal or the pool was closed. NOT SO at the Monteleone, where everything was great and in full working order!", "helpfulness": 8, "user": "wijssa", "date": "April 24, 2006", "id": 4999426}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The gracious lobby is large, well lit and welcoming. There is also desk staff on duty 24 hours a day. The front lobby is not wheelchair-accessible, though. The staff were all very polite and cheerful although at least some of the desk staff did not know about the bus that has temporarily replaced the street car. Considering that St. Charles Avenue is very important for tourists, this was fairly important getting around information.", "title": "Love It!", "helpfulness": 6, "user": "Bdopey2000", "date": "April 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4992371}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Stayed at Monteleone from 7/7 for three nights, Hotel staff top notch in every way. The place was super clean, staff a pleasure to talk to, 5 star place at 1 star price. Cant beat location either- one block south of Bourbon Street.", "title": "Great Place-Great Price", "helpfulness": 3, "user": "LongIslandIcedT", "date": "July 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17783354, "likes": {"liked": "— Elegant and Clean", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "Our family had a block of 11 rooms reserved for an event. Our room was to be a double, as there are 3 of us. We checked in, gave our credit card information, and were given the keys to a fourth floor room.", "title": "Billing Fiasco", "helpfulness": 4, "user": "Babs0828", "date": "July 3, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17496979}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "No one was available to help with our luggage, so the 3 of us lugged it all to room 467, which turned out to be a king suite. We hauled everything back to the front desk, waited in a long line, and informed the staff person that we were given the wrong room. He told us there was no problem, he \"checked us out of room 467\" and we were given the keys to room 471.", "title": "Much more than was expected!", "helpfulness": 1, "user": "WorldTraveller1824", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17165933, "likes": {"liked": "— Friendly Service", "disliked": "— Wait for Elevators"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "Our room was clean, comfortable, and nicely appointed. Although our room faced the street, it was quiet. Of course, there was an obligatory hair in the bathroom, but we have come to expect that in any hotel we stay at.", "title": "A True Classic in a Great Location", "helpfulness": 2, "user": "friscocat", "date": "June 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17137953, "likes": {"liked": "— Location, unique character", "disliked": "— breakfast buffet"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "The exercise room is exceptional, with an incredible view. Overall, we had a nice stay.", "title": "Luxury Hotel: but don't use the glassware!", "helpfulness": 6, "user": "Runner56", "date": "June 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16996420, "likes": {"liked": "— location", "disliked": "— lack of cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "I stayed here over four nights while doing a photo shoot in the city. The rooms were clean and comfortable and a welcome respite for the most part. The staff was very friendly and helpful. Except for the time I waited an hour and a half for silverware from room service without explanation. The big drawback to the hotel is the 9.95 per day internet fee. Most hotels in the area have free wireless at this point. I went to a wonderful espresso cafe on Decatur with free wireless to take care of business.", "title": "Monteleone above average but still has some issues", "helpfulness": 6, "user": "lenaellen", "date": "November 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 6043502, "likes": {"liked": "— Cleanliness and comfort", "disliked": "— Internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We arrived an hour before check in and were prepared for a wait.We went to the Carosel Bar to have Bloody Marys and watch the games that were on.The front desk were to call our cell phone when the room was ready.Our phone never rang so we checked with the desk and they changed a well published check in time to 2 hours later.That was really our only frustration.We were in the city for the Saints Monday Night Football \"Party\" over the Falcons(GO SAINTS)The hotel is so convient to eveything including the Superdome where the walk was fine.We have stayed here many times since we sold our home uptown and find it to be all you really need.We even had spa treatments at SPA ARIA this time and the staff were so nice and the treatments were great.For the money the hotel is nice.Some of the rooms are a little small and bathrooms are cramped,but what are you here for?To hang out in a hotel room.Get Real its New Orleans.", "title": "Nothing wrong with it.", "helpfulness": 2, "user": "Star2", "date": "October 21, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5979987, "likes": {"liked": "— Location", "disliked": "— Small bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "We were in town for Mardi Gras, and got to spend a week in our favorite New Orleans hotel, the Monteleone. The Hotel's History, attentive staff, and convienient French Quarter location make the Monteleone a perfect choice. Our room was clean and comfortable, and the staff were very friendly, in spite of the chaotic Mardi Gras atmosphere. Dont forget to check out their legendary revolving bar in the Carousel Lounge! We're looking forward to staying here again next Mardi Gras!", "title": "Highly recommended!", "helpfulness": 4, "user": "ICURYY4ME", "date": "October 19, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5970797}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "We stayed here whilst in town for a conference, after visiting a number of hotels in New Orleans during our research for the event.", "title": "Very pleasant stay", "helpfulness": 5, "user": "GraemeBT", "date": "October 18, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5967169}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Our stay in the Monteleone was excellent, it is ideally located, just far enough away from Bourbon St. for the noise not to carry.", "title": "2nd stay at the Monteleone", "helpfulness": 4, "user": "lvm1", "date": "October 4, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5910346, "likes": {"liked": "— location", "disliked": "— parking problems."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Before booking the Monteleone, I read that it was the \"Grand Dame\" of the French Quarter. What an apt description. This hotel is absolutely breaktaking. We just gasped when we entered the lobby. It's like being whisked back in time to the time of the Great Gatsby! No wonder so many notable writers took up residence here.", "title": "The most perfect hotel in the French Quarter!", "helpfulness": 3, "user": "Suzanne&Laine", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14106852, "likes": {"liked": "— Location, location, location.. and EVERYTHING.", "disliked": "— No ghosts! :)"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "The staff is incredible. So friendly, helpful - anything you need, any time - they are ready, with a smile and a fabulous attitude. The concierge was especially helpful in getting us where we wanted to go.", "title": "Loved Monteleone", "helpfulness": 3, "user": "TayTay56", "date": "March 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13951946, "likes": {"liked": "— The cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The room was beautiful. Very small, which is an issue for some - but you need to remember that 100 years ago, that was the norm. A small room only adds to the character of an historic hotel. The decor is beautiful and the toiletries are fantastic. Be sure to ask for a river view!", "title": "Lovely hotel with great location", "helpfulness": 2, "user": "Alice23Norway", "date": "February 22, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 13769699, "likes": {"liked": "— Location. Breakfast room and buffet. Food in restaurant. Good service", "disliked": "— No space for luggage in the room."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The Carousel Bar is a welcome retreat after a long day in the city and a long night ahead. The bartenders remembered our names (heh heh - can't imagine why) and were friendly and entertaining.", "title": "Beautiful historic hotel", "helpfulness": 3, "user": "Historybuff52", "date": "February 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13693180, "likes": {"liked": "— Friendly staff + attractive, comfortable room", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I can't say a single negative thing about the Monteleone. I will only stay here whenever I am in New Orleans. It's is located in the best part of the quarter on Royal Street - sitting nicely on the sidelines of the action which is only a stone's throw away.", "title": "Great Location, Nice hotel", "helpfulness": 3, "user": "momof4inmd", "date": "February 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 13606936, "likes": {"liked": "— Location", "disliked": "— Room View and Size"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "The Monteleone isn't a perfect hotel, but there are some really terrific things about it. We love the lobby, and spinning carousel bar....truly classic new orleans. The rooms are small, as others have written, but how much time do you spend in your room? They are very clean, and the beds are extremely comfortable, even if it might be getting close to time to rework the look of those draperies. We also love the rooftop pool for hot afternoons. The French Quarter is always loud, and you will get some street noise even on the upper floors, but that's pretty much every hotel in the area. The plus is that you are in spitting distance of all the great restaurants and bars, as well as the street car. Overall, this is a perfect hotel to experience what makes the city unique.", "title": "Classic New Orleans", "helpfulness": 1, "user": "aerolosangeles", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16683556}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "The location, service, and beauty of this hotel make it a great place to visit the french quarter of New Orleans. We especially enjoyed the carousel bar and the availability of great restaurants nearby.", "title": "Our favorite getaway place", "user": "jlegendre", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 112300976}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "Perfect place to stay in New Orleans - great French Quarter location close to wonderful restaurants and all of the bars. Also not too bad of a walk to Harrah's. Beautiful hotel. the Carousel bar downstairs is a lot of fun! Clean, nice rooms - a little on the small side, but that was expected.", "title": "Great location, beautiful hotel!", "user": "courtney_meinen", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112102085}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I stayed here for three nights in early June with his sister and her husband. I cannot recommend this hotel enough--the service was friendly and impeccable, the room was clean and wonderfully luxurious for the price, and the overall facilities (especially the rooftop pool) were terrific. One morning I went looking for the concierge, who was away from his desk, to find out about boat cruises. Before I could even ask one of the bell staff for help, I was approached and asked what I needed. The bellman then spent 15 minutes answering questions and providing advice. When I am lucky enough to return to New Orleans, you can be sure I'll stay here rather than at any generic chain property. Keep up the great work!", "title": "Loved it!", "user": "julieros", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 112024003}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Visited the weekend of 3 Jun 2011. Everything about the hotel is primo. The pool on the roof is a little small, but I didn't mind being bumped into by all the bikinis from the bachelorette party...", "title": "Awesome French Quarter Hotel!", "user": "75guy", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 112003321}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "The main dining area was being renovated, but they made up for it very well with a nice complimentary Continental breakfast. The rooms aren't the largest, but they're very nice. Also, who comes to the Quarter to admire their large room?", "title": "Fun for the girls!", "user": "jerseygirl024", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 111478890}, {"rating": 4.0, "title": "The Monteleone was outstanding as it support large groups", "text": "During the Lutheran Youth Gathering, July 22-26, the Monteleone provided outstanding accomadations, service and support for the large number of youth groups that stayed there. It is a very romantic hotel in a great location in the French Quarter. Whether you go there as part of a large group or as a couple you would be extremely satisfied. The hotel staff was extremely helpful and courtous. They went out of their way to answer questions and provide any assistance that was asked for. We'd go back again.", "user": "Bob P", "date": "July 29, 2009", "id": 36128480}, {"rating": 4.0, "title": "Great Hotel", "text": "The Monteleone is now one of my favorite hotels in the Quarter. The location is right off of Canal Street - near the shopping and casino yet has much more charm than the chain hotels on Canal. Its a short walk to the bars and resturants of the French Quarter.", "user": "Cruze-lover", "date": "July 28, 2009", "id": 36034870}, {"rating": 5.0, "title": "Excellent Hotel", "text": "The king room we booked was small (in fact the bathroom was almost bigger) but it was all we needed. Plus it was quiet and the a/c was cold. What else do you need?", "user": "cl1994", "date": "July 27, 2009", "id": 35965506}, {"rating": 4.0, "title": "well located in the french quarter", "text": "The rooftop bar was beautiful and we enjoyed the revolving bar. Checkin/out was pleasant and efficient!", "user": "frenchyBBN", "date": "July 27, 2009", "id": 35908072}, {"rating": 5.0, "title": "Best New Orleans Experience", "text": "I stayed at the Hotel Monteleone for the ELCA Youth Gathering in July 2009. The staff was wonderful, answering every question we had, holding doors, etc. The houskeeping staff kept my room nice and clean. The heated rooftop pool was great, with views of the city. A word of caution: There are three sets of elevators. Only the Iberville elevators go to the roof, the two sections of 15th floor do not connect, and not all elevators stop at the mezzanine level. The Monteleone is only 1 block from Canal St, 1 block from Bourbon St, and anly about 7 blocks from the famous Cafe' Du Monde. Overall, this hotel is a beautiful place to stay in a great and beautiful location.", "user": "JetSetter721", "date": "July 22, 2009", "id": 35485481}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Our group had been planning our JazzFest 2008 trip for about 6 months. We were going to stay at the Omni Royal Crescent but the rooms were too expensive so after reading the reviews on TA about the Hotel Monteleone we decided to stay here and we were very pleased. Check in was a breeze and they put us in adjoining rooms which were spacious. We were in rooms 1146 and 1145. 1145 was a corner room with two side being windows. The bathrooms were a little small but manageable. We paid $249 a night right off of their own website which was a good price for Jazz Fest weekend. The location is great! We especially liked the Walgreens right across the street to buy water and sunscreen except for Saturday when it rained all day. The carasoul bar is nice yet hard to find a seat. We ate at Mr. B's Bistro across the street the first night and had a wonderful meal. The pool was fun on the roof and they had a little pool bar up there too. The lobby is beautiful and the hospitality of everyone couldn't be nicer. I liked that they had a computer that you could print your plane boarding pass off on. All of our group were completely satisfied with the hotel.", "title": "JazzFest 2008 - Great Time - Great Hotel", "helpfulness": 1, "user": "longlegsally", "date": "April 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 15477124, "likes": {"liked": "— Great Location", "disliked": "— Small bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The good: It's a beautiful hotel with a cool carousel bar and, if the French Quarter is your game, the location is pretty much perfect. Service was excellent and very accommodating, from behind the desk to the concierge. The gym was actually better than expected and the pool was pretty nice. It was closed on the day of arrival, so I can't give a full review. It had water! That's about it. But it looked like a great place to relax, up on the roof, with a nice view.", "title": "Good, but not great...", "helpfulness": 3, "user": "mdcawa", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 2.0, "location": 5.0}, "id": 15439563, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008", "text": "The sorta bad: Loud! This is the fourth hotel I've stayed in in NO, to include two very cheap motels back in the day, and this was easily the loudest. I get the people returning from drunken revelry, and I can live with that, but hearing the X-rated grunts and groans from neighbors is a little much (the neighbors are as much to blame as the hotel on that one). I felt like I was on a San Fernando Valley movie set. Also, as mentioned to exhaustion, the rooms are microscopically small. After reading reviews, I purposely booked a \"deluxe\" room (supposedly larger and one promising a good view). I had to go back to the desk to confirm it was a deluxe room. It was.", "title": "Seen better days", "helpfulness": 2, "user": "subtext", "date": "April 28, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 15435402}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Just spent 3 nights at the Monteleone for a conference, and I had a great time. I was sharing with a co-worker and we had plenty of space. Check-in was problem-free. We were on the 12th floor in the middle (double-double room) facing Bourbon, and those rooms are slightly larger than most. Bathroom had obviously been redone recently, and it had lots of space for toiletries. Water pressure was good the whole time. Our ceilings were 12 feet high, and they really made the room seem spacious. I ordered room service once and it came promptly, and the food was delicious. Also went to the breakfast buffet in Le Cafe a couple of times, and that was also good if a little pricey. The Carousel Bar is great! All the people we encountered in the hotel were friendly, helpful, and so happy to have people visiting the city again.", "title": "Great experience at the Monteleone", "helpfulness": 5, "user": "StJohnFan", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5409273}, {"rating": 1.0, "title": "HATED it", "text": "Only complaints: the room furnishings need updating. The bedspreads, curtains, and rugs probably should be replaced. Also, the smoke detectors have an amazingly bright green flashing light which is quite distracting! At first we thought they were the infamous Monteleone ghosts, but alas, no. HBO would be nice to have, too.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "June 8, 2006", "id": 5323672}, {"rating": 4.0, "title": "Wonderful Hotel", "text": "My fiance and I booked a room at this hotel based on many positive reviews from friends and family members who had spent nights there previously.", "helpfulness": 9, "user": "UnoMasFla", "date": "June 7, 2006", "id": 5318257}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "When we arrived, we were disappointed right away. The check in desk took my credit card, even though we had already paid. Later on, we discovered that they had charged us a fee that they would refund after seven days, but they neglected to tell us. A staff member told me when we found out about this fee that they were supposed to inform all customers, yet she did nothing more to assist us with this problem.", "title": "Great hotel in French Quarter", "helpfulness": 6, "user": "GraceM100", "date": "June 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5313193}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "When we walked into our room, there were two beds (instead of the king we had been promised) and there was a view of rooms that were being redone. We asked, specifically, for a view. A GOOD view!", "title": "Wonderful stay in a wonderful city", "helpfulness": 6, "user": "TheMannClan", "date": "June 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5313103}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "This is a fabulous hotel. I can't think of one single thing that could have made my stay any better. The entire staff was unbelievably helpful and friendly. The hotel was immaculate. My room was comfortable and spotless. Amazing water pressure. I don't know what more to say. I have never stayed in a nicer hotel.", "title": "Magnificent Hotel", "helpfulness": 4, "user": "cdavetype", "date": "September 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5781688, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I highly recommend the Hotel Monteleone. The property is conveniently located on Royal St. in the French Quarter. The entire property was extremely well maintained, clean and neat. The employees were all very friendly and helpful. The pool area was very nicely looked after throughout the day. I found nothing that was broken, falling apart, non-functional, etc. I found a real bargain on the room rates through Travelocity. The bars and restaurants appeared very nice as well, although I only ate breakfast in the cafe. The food was good (standard breakfast fare). My only suggestion would be to offer a bit more variety on the buffet. They gladly checked our luggage when we arrived early, and again when we checked out since our flight did not leave until that evening. I am not a person who is easily pleased, yet I can say that not only was this hotel a great place to stay, the room rates made it a good value as well. The persons running this hotel are obviously doing a fine job.", "title": "First Class Hotel", "helpfulness": 6, "user": "TampaNugget", "date": "September 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5777170, "likes": {"liked": "— Well maintained, neat and clean.", "disliked": "— No complaints."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2005, traveled solo", "text": "I was lucky enough to visit New Orleans last year, just a few weeks before Katrina hit. I chose to stay at the Monteleone because I wanted a hotel that was close to the French Quarter but not too close to its heart, if you get my drift. I checked out their website and booked a standard room.", "title": "Great but not perfect!", "helpfulness": 6, "user": "Andie007", "date": "August 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5622570, "likes": {"liked": "— The location, the staff", "disliked": "— The badly soundproofed rooms"}}, {"rating": 2.0, "title": "Services at Monteleone Hotel", "text": "The Positives: Very smooth check in, super friendly staff (I chatted with the doorman nearly every time I set a toe outside of the hotel), comfortable beds, a nice roof top pool....GREAT LOCATION.", "helpfulness": 5, "user": "vonny7", "date": "August 17, 2006", "id": 5619945}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The hotel is literally two blocks away from Bourbon street, Canal street is maybe 3-4 blocks...I walked down Canal street all the way to the river, explored every inch of the FQ, and never had trouble finding the hotel afterwards. The Carrousel bar was also very fun, but (as per usual) the drinks weren't cheap.", "title": "Great experience overall", "helpfulness": 10, "user": "ChrisErin", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5557574, "likes": {"liked": "— Location, bed"}}, {"rating": 5.0, "title": "Very pleased", "text": "My boyfriend and I stayed here for 4 nights. My extended family also stayed here as my cousin was having her wedding reception here as well. We had a rate of $129 per night for a standard King room. All in all, we were very happy here.", "user": "gowiththeflow49", "date": "June 25, 2009", "id": 33110571}, {"rating": 5.0, "title": "Wonderful Experience. Plan to Return Soon!", "text": "The room is small, as we knew from reading reviews. We understood this as common in the French Quarter, and while we were a bit cramped, it was fine. The bathroom had good counter space, the shower had good pressure, and was all clean.", "user": "Mouse63", "date": "June 23, 2009", "id": 33016384}, {"rating": 4.0, "title": "a positive experience all around", "text": "The rooftop pool was excellent! The bartender was very nice. The pool attendent was always running around, getting drinks and changing out towels. One morning, the hotel set up a table with coffee and we brought bengiets and fruit from Cafe Bengiet. It was a perfect breakfast.", "user": "OnTour77", "date": "June 20, 2009", "id": 32763112}, {"rating": 1.0, "title": "Overrated! Housekeeping are thieves!", "text": "We also sent to the Carousel Bar a few evenings. It was usually packed, so sometimes we could not get a table. As we were a larger family group, this was disapointing, so we went to a hotel bar down the street. But, when went as a couple, it worked out fine.", "user": "br0kera", "date": "June 19, 2009", "id": 32692730}, {"rating": 5.0, "title": "First Class all the Way!", "text": "The staff is frequently mentioned in these reviews, and rightly so. All were very friendly and always had a smile and hello.", "user": "apirateover40", "date": "June 16, 2009", "id": 32496909}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We booked a room at the Monteleone based on reviews we had read on this site as well as others. The room, supposedly a deluxe king, was small, unmemorable and smelled horribly of tobacco smoke. It was exceedingly noisy at night even with the window closed. The plumbing was excessively noisy; we could hear the shower and running water from adjoining rooms. When we arrived, the in-room safe was broken and had no instructions attached; it had to be repaired the next day. The hotel does not have complimentary wireless internet and charges an excessive fee of $10 per day for wired in-room access; at its room rates, free wireless access should be available to all guests. When we requested a late check-out on May 7th, we were first told that \"the very best we could do\" was 12:30 (normal checkout is at 12:00). When we pressed on this, we were begrudgingly told we could check out at 1:00, but it was clear that the clerk felt very put out by this. For a lodging that holds itself out as a luxury hotel and charges accordingly, I believe it falls very well short of the mark. There are far better hotel choices available in or near the French Quarter. I would not stay at this hotel again.", "title": "A Poor Choice for New Orleans", "helpfulness": 4, "user": "WildPops1952", "date": "May 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 15772839, "likes": {"liked": "— The shower", "disliked": "— Poor quality of room conditons; no complimentary internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I took my husband for his first visit to New Orleans. This was my second stay at the Monteleone and it was just as good as the last time, just with some bumps in the road. The staff is very nice and the property is clean (and the lobby always smells like fresh flowers which I just love!). This time we booked directly through the hotel and got the cheapest king deal that they had. My only recommendation is that if you are booking direct, get upgraded and don't take the standard/base rate King if you want a little more room. The room was itty bitty, but that's fine with us, we're in New Orleans and just happy to have a clean and safe place to rest at night. The only other problem was the walls were like paper and we could literally hear the two ladies next door speaking like they were right next to us and you could tell that they were speaking in reasonable levels. This was strange, because my last stay with some friends, our room was right near the elevator and we never heard a thing, so perhaps parts of the hotel were constructed at different times???", "title": "Second visit to the Monteleone.", "helpfulness": 2, "user": "kentuckygirl1021", "date": "April 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15514380, "likes": {"liked": "— The history of the hotel", "disliked": "— the tiny room, but we booked the cheapest and you get what ya pay for!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Just got back from a stay at the Hotel Monteleone and only have great things to say about it -- and this from a picky and frequent traveler. The location is great -- close to everything in the French Quarter but on one of the quieter, more sedate streets. Still one block away from Bourbon, if that's your thing. The building itself is beautiful -- the shining white exterior is one of the prettiest sites in the city. Inside -- classic! We booked a riverview suite for a very reasonable price (average $189/night) and were delighted with the size, decor, ammenities -- everything. Large bedroom, king bed, view of the Mississippi, bath with a jacuzzi tub and separate 2 person shower -- the sitting room was large as well - - and with a separate powder room off of it -- so two bathrooms. The pool on the roof is small but a fun way to chill in the afternoon -- nice bar up there. Downstairs there's the Carousel bar which is beautiful and staffed by knowledgeable bartenders who actually know how to mix real drinks instead of pouring pre-mix out of jugs. Since Sunday was our 29th anniversary, I called \"Ms. Eva\" the concierge before we arrived and arranged for a special anniversary breakfast -- which came right on time -- delicious eggs benedict and chocolate dipped strawberries, with a bottle of champagne and a pitcher of OJ for mimosas. Couldn't have been lovelier! So, rave reviews here for the Monteleone.", "title": "Classic & Perfect", "helpfulness": 2, "user": "Chapinite", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16490630, "likes": {"liked": "— overall committment to quality", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "We were thrilled with our choice of the Monteleone for our trip to NO for a business conference. Most of the other attendees stayed at the Marriott where the meetings were being held. We loved the fact that our accommodations were different than the generic, big box hotels in the area.", "title": "Authentic and classic French Quarter Hotel", "helpfulness": 3, "user": "Msk6261", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 16260541, "likes": {"liked": "— location and pool", "disliked": "— room size"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "First I will say the location is just perfect. Close enough to walk everywhere but far enough to avoid the noise of Bourbon St. The style, as mentioned here is more Old World...kind of on the feel of a Waldorf or Fairmont. We have a tendency to prefer contemporary or \"boutique-y\" hotels but the Monteleone really gives you a flavor for the history of the area.", "title": "Highly recommend - Old World Charm", "helpfulness": 2, "user": "EdJack", "date": "May 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15865360}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We spent a long weekend in New Orelans and found the city to be quite charming.", "title": "Fantastic Location!", "helpfulness": 1, "user": "MelLongIsland_NY", "date": "August 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 18719892, "likes": {"liked": "— Location", "disliked": "— spotty doorman service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Our stay at the Montleone was very nice. The location is wonderful. It is on an antique store lined street right in the heart of the french quarter and only steps away from bourbon street.", "title": "Great Stay at Monteleone", "helpfulness": 1, "user": "sneakyatty", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18458460, "likes": {"liked": "— great room and hotel", "disliked": "— cleaning staff throwing away cups"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The Good: LOCATION, roof-top pool (though they could use more space), spa is lovely, lobby is beautiful, room-service efficient, food good, carousel bar unique", "title": "Lots to Love ~ Heads Ups Too~", "helpfulness": 1, "user": "alexam174", "date": "July 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 18387690, "likes": {"liked": "— location", "disliked": "— room size"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007", "text": "The Bad: doormen not always around, not very accomodating when it comes to early check-in (there were many people left to their own devices in a torrential downpour! we came back soaked and were finally givein a room) bad view from our room", "title": "Could stand some inprovement", "helpfulness": 1, "user": "TravelnCowgirl", "date": "July 21, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18107026, "likes": {"liked": "— location", "disliked": "— staffing at door/ bathroom fixtures"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Overall, we would return to this hotel again if the price was right.", "title": "Fantastic Hotel in Ideal Location!", "user": "traveldolphin", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17958553, "likes": {"liked": "— Location", "disliked": "— Pool"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2004, traveled on business", "text": "Had I not just stayed at the Royal Sonesta on Bourbon St., I'd rate the Monteleone higher. However, I cannot help but compare the 2 hotels, being located only a block and half apart. What's good about the Monteleone is the renovated, albeit small bathroom (no counter space to spread out my toiletries); the tap water doesn't leave your hands slimy after you've washed them; comfy bed w/ turndown service and mint chocolates. And of course, the revolving Carousel Bar is a cool hangout. Here's where it goes a bit awry: street noise and constant garbage truck collection impedes your sleep and serenity; static-ridden clock radio that grates on your ears (I ended up turning it off); no newspaper on your door (you have to walk across the street to buy it yourself?!?); inefficient elevator service. If I was staying here more than just the 2 nights, I'd have asked to change my room to a quieter side. The Monteleone is a very nice hotel, but it is not the ne ultra plus in plush comfort.", "title": "Pretty good but a few caveats", "helpfulness": 5, "user": "IntrepidfromMontreal", "date": "April 20, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 1794086}, {"rating": 5.0, "title": "Wonderful, elegant hotel", "text": "Wasn't sure what to expect from the 50th ranked hotel in NOLA and because of a few of the reviews here. Worried it would be tiny rooms, noisy and rude staff. WOW! Couldn't have been better. The room was number 1432, had a view of the bend of the river, the most comfortable king bed I have ever slept upon, was just big enough for two people and we had very little noise from the outside. Housekeeping was fantastic.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 11, 2004", "id": 1774789}, {"rating": 5.0, "title": "The only place to stay!", "text": "Not bothersome (would let us sleep in) and kept a very clean room. In fact, the staff appeared very concerned to not make too much noise.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 21, 2004", "id": 1735214}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The room was beautiful, no view but we mainly slept there, clean as could be. Everyone was friendly and cordial. I certainly would come back.", "title": "REALLY NICE", "user": "Julesb49", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111175754}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I stayed at the Monteleone over the Memorial Day weekend as a return guest. When I entered the hotel, I was greeted by friendly desk staff. The bellman from the carribian was so nice as he talked with me while going up on the elevator. My roon was spacious and very clean. The bathroom was modern and clean. The rooftop pool was nice with a great poolside bar. The nightly turn down service was a good touch. It was good to go out and come back to a bed ready for you with some mints. Checkout was fast and easy.", "title": "Another great stay", "user": "safety86", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111149561}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "This is the 2nd time I have stayed at this hotel & hands down it beats staying at the generic, boring hotel chains that are available there. The location was perfect being just 1 block off of Bourbon St & 2 blocks from Canal St.. The service is impeccable & I love the Carousel Bar. The rooms may be smaller than the chain hotels but that is a small price for the ambience. I will always stay at this hotel if given the opportunity.", "title": "My Favorite Hotel", "helpfulness": 1, "user": "Icequeen2921", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110984779}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Wonderful. My husband and I had a perfectly lovey time. The suite was beautiful and had everything we needed. We were given complementary cocktails on arrival and I was treated by my darling husband to a morning in the Aria Spa. Fabulous! We will return to this outstanding hotel.", "title": "Anniversary Celebration", "user": "2goodboysmom", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 110963257}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Excellent, beautiful hotel! Histotic, charm, absolutely loved it! Great location near the French Quarter. the staff was excellent!", "title": "manifique!", "user": "kakiLouisiana", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110641390}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Just came back from a 4 day trip to New Orleans, the hotel has an excellent location on a quiet St. just 1 block to Bourbon St., there is a pharmacy and a grocery store next to it. as well as great restaurants Mr. B's, Brennans, ACME oyster house ect. ect. The rooms are small but nicely decorated , clean and with a extra comfy beds.", "title": "Great stay!!", "user": "nimc4", "date": "June 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16952881}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The bed took up most of the room, but it was huge and comfortable! The room looked out over the buildings in the area, which generally speaking, is not the high point of the French Quarter, it's what's inside! The bathrooms were immaculate and marble, good water pressure.", "title": "Lovely beds!", "helpfulness": 1, "user": "ayearolder", "date": "June 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16899691, "likes": {"liked": "— location, beds", "disliked": "— paying for internet in the rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Did not have much interaction with the staff, but I requested turndown service and it was provided immediately. I went back to my room about 5 minutes after making the call and she was already there! Was not ever bothered in the mornings by housekeeping, even on late ones.", "title": "Very nice.", "user": "t32007", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16888365, "likes": {"liked": "— Acoomodations, location, service", "disliked": "— Too many problems with room keys"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "Last point - PERFECT location. Very close to everything delicious and good in the French Quarter.", "title": "Skip the spa", "helpfulness": 2, "user": "txartistNorthTexas", "date": "June 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16805634, "likes": {"liked": "— the level of service from staff", "disliked": "— the spa"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Old hotel that has been redone. Rooms and bathrooms were smallish but comfortable. Service was very friendly and helpful. Doormen were great! Pool on roof was enjoyable, Room keys didn't work majority of the time (went through 7 of them in 5 days). Missed room service one day but we were in and out repeatedly so it was understandable. Meals were pricey but food was excellent.", "title": "Wonderful service!", "user": "bossygal", "date": "June 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16769224, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Without question and excellent hotel with quality staff and ornate property with flare and panache. A must on your trip to N'awlins.........", "title": "True French Flavor in the Quarter", "helpfulness": 1, "user": "AdirondackAdventurer", "date": "February 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13581662, "likes": {"liked": "— The property is lovely"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My husband and I stayed at the Monteleone just prior to the start of Mardi Gras. The staff was gracious and friendly, the room small, but clean, with a great view of the Mississippi River. The Carousel Bar is a must see. Overall, I would definitely stay at the Monteleone on our next trip to NOLA.", "title": "Loved the Monteleone", "user": "fazoolynj", "date": "February 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13382333, "likes": {"liked": "— The cleanliness and the service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Just back from Mardi Gras where I spent four nights at the Monteleone. Location was perfect, close to Canal and Boubon (a block from each) but still on a fairly quiet block. Beautiful old hotel, very nicely furnished, friendly staff. Our deluxe king bedroom was fairly small but not tiny. The rotating carousel bar was remarkable - so was the fact that Pete Fountain and his band stopped by and played on Fat Tuesday. I would definitely stay there again especially for Mardi Gras.", "title": "Would stay again in a minute", "helpfulness": 1, "user": "BrlDsguise", "date": "February 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13356653, "likes": {"liked": "— Location", "disliked": "— View"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "I enjoyed my stay at the Monteleone. It's in walking distance to Bourbon St. The parking is $27 a day. Room & bathrooms were clean. My room wasn't big or small. Room service breaskfast was good & reasonably priced. Be attentive at check-in. The attendant made errors charging an extra $75 that I'm having to dispute with my card company. So many attempts at the hotel I gave up. I would stay here again. Shish happens.", "title": "Great but beware of unexperienced attendant...", "helpfulness": 4, "user": "tahari99", "date": "September 28, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5884848, "likes": {"liked": "— Walking distance to Bourbon St & quiet enough to rest.", "disliked": "— Errors of the attendant"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "Older \"historic\" hotels are so intriguing but can be hit or miss. The Monteleone is a BIG hit. What a fabulous, clean, charming place. We only stayed one night but the bed was so comfy and the shower was terrific. We enjoyed sitting by the lovely pool having a drink and relaxing before heading out to the Saturday night madness. The staff was reserved but helpful and friendly when asked a question. I can't imagine that we will stay anywhere else on future visits.", "title": "Perfect stay- we will be back", "helpfulness": 4, "user": "poodleone", "date": "September 20, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 5818832, "likes": {"liked": "— Beautiful room", "disliked": "— Check directly with the hotel for a great rate"}}, {"rating": 5.0, "title": "Wonderful Hotel!", "text": "We stayed at this hotel over the Labor Day weekend and it was wonderful! I travel to New Orleans at least three times per year and have stayed at a dozen hotels in the French Quarter. None of them were as nice as this hotel. The rooms was spacious and clean. The pool area was great and the staff was over the top. We got great rates through a booking website and enjoyed our stay to the max. Location is unbeatable. Right on Royal Street and close enough to Bourbon (one block away) to get to the action quickly without hearing it all night. My only complaint was the $9.95 daily internet rate! Come on...even the budget chains give that free anymore. Great hotel!", "helpfulness": 6, "user": "Ace", "date": "September 12, 2006", "id": 5792246}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "After going to New Orleans for several years in a row for the Labor Day and having to miss due to Katrina, we were cautiously optomistic about returning in 2006. I'm extremely happy to say the French Quarter is back! Most of the restaurants have returned, the shops are open and the Monteleon looks great. We have stayed here before, but it's been polished up and the rooms although somewhat small compared to a mainstream hotel are extremely comfortable and luxuriously appointed at a very affordable price. Everyone in the hotel from the bellmen to the concierge and checkin staff were very friendly and welcoming (ahh that southern charm).", "title": "Monteleon is Beautiful - The French Quarter in New Orleans is Back!", "helpfulness": 7, "user": "Wherewegoingnext?", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5791351, "likes": {"liked": "— Friendly, clean and COMFORTABLE", "disliked": "— Internet access is additional $"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled solo", "text": "This hotel is in the Quarter and even though only one block off the famous craziness of Bourbon Street, it's far enough away to avoid all the noise and you can get some sleep when you really want to take a break from the partying. Close to banks and ATM's, close to great restaurants and Harrah's casino -- all in easy walking distance! Very close to the galleries that line Royal street and just a few short blocks from the French Market, Cafe DuMonde and Jackson Square -- can't recommend this location and hotel more -- so glad to have them back!", "title": "Great Hotel", "helpfulness": 5, "user": "safety86", "date": "September 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5786482, "likes": {"liked": "— Pool", "disliked": "— Internet access fee"}}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 4, "variance": {"poor": 93, "average": 188, "very good": 604, "terrible": 56, "excellent": 1109}, "aka": "Monteleone Hotel New Orleans", "slim_ranking": 0.0933333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "It’s been said that the French Quarter begins in the lobby of the Hotel Monteleone. In fact, this venerable establishment sits majestically at the foot of Royal Street giving guests the best point of departure for all things New Orleans. Visitors need only step outside this French Quarter hotel to discover shop after shop of fabulous European antiques, estate jewelry, Oriental rugs, and art and antiquities from around the world. Quaint restaurants and specialty shops outside of this luxurious New Orleans hotel line the cobblestone French Quarter streets that lead to Jackson Square, the Old French Market and the Riverwalk where tourists and native New Orleanians stroll the levee and watch the steamboats and barges along the Mississippi River. At this New Orleans hotel, you’ll find history around every corner."}