{"user_rating": 4.5, "review_count": 100, "name": "Hotel Jaizkibel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Had only booked to stay on a Saturday night at the Jaizkibel as part of our driving holiday through France and Spain but an unexpected mechanical problem with the car meant that we did not leave until Tuesday evening. The reception staff (particularly Silvia) were exceptionally kind and went out of their way to help us negotiate with garages and mechanics to source the missing parts for the car and get us back on the road - while making us feel so welcome, even though we did not know from one day to the next whether we would be able to get on to our next destination. The rooms are very clean and comfortable and great value - particularly compared to the parador. The first floor rooms at the back overlook a grassed roof and you wake up each morning to goldfinches and thrushes pecking for food right outside your room. The free unlimited in-room wifi was invaluable in trying to rearrange our trip. The hotel itself is in a quiet residential area but only 5 mins walk into both the old town and the waterfront. Would recommend the waterfront and the three or four roads behind it for fabulous restaurants - much friendlier and more atmospheric than the old town. Also using the boat (Eur 1.60) to pop over to Hendaye (France) for lunch was great fun. From Hondarribia being a one night layover on a much longer trip we ended up staying for three days and falling in love with the town and the people and the hotel.", "title": "So helpful", "user": "JaxnDave", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33400764}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Stayed at the hotel for an extended weekend in connection with a wedding. Very pleasantly surprised - beautifully designed and kept up modern hotel in a residential area of town. Splendid views from the roof top terrace. Room well planned and using the space smartly and with taste. Breakfast buffet and John, in charge of eggs / toasts were first class and clearly among the better breakfast meals I have had in a hotel this year. All in all - very nice hotel managed with care and excellent value for money.", "title": "Beautiful hotel with first class service", "helpfulness": 1, "user": "JakobBengt", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 18344267, "likes": {"liked": "— Breakfast", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Were 'forced' to stay here as the Parador we stayed in the night before was full. A complete change from the ancient surroundings of the Parador but a lovely, clean, welcoming, modern, purpose built hotel. We arrived at just after 11am to leave our luggage but our room was made ready immediately. No views over the bay as this hotel is up the hill in a residential area but it's peaceful and within walking distance of the town. Spotlessly clean and quiet. The only negative comment I have is the garage approach. I was just so grateful I wasn't driving as the entrance and exit to the underground carpark is exceptionally tight for a large car. Luckily my partner has nerves of steel! Just a lovely hotel and excellent value. I understand the dining room is exceptional but we went into town to visit the tapas bars again. Upon our return at 11pm the dining room was still full so I think that's a good advertisement.", "title": "Excellent value for money", "helpfulness": 3, "user": "mairidh", "date": "October 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4071564}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Friendly atmosphere, helpful and professional staff.", "title": "A great discovery", "helpfulness": 1, "user": "Jennidcap", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67592504}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Well designed, comfortable, welcoming hotel.", "title": "Lovely hotel", "user": "nellcote", "date": "May 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 65048423}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Good breakfast and complimentary afternoon snacks when the bar is closed.", "title": "Perfect location, great staff and service", "user": "coockie", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53102378}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Comfortable rooms and surprised to find 3 BBC Channels and Channel 5 available for British visitors.", "title": "Good hotel - Far from old town", "user": "TravelerNYNy", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 2.0, "service": 5.0, "rooms": 3.0}, "id": 35238508}, {"rating": 5.0, "title": "Excellent!", "text": "Rooftop sun terrace, small outside dining terrace and small garden.", "user": "DevonTreacle", "date": "July 7, 2009", "id": 34102709}], "location": {"country": "Spain", "region": "Basque Country", "continent": "Europe"}, "stars": 4, "variance": {"poor": 0, "average": 3, "very good": 21, "terrible": 0, "excellent": 76}, "aka": "Jaizkibel Hotel Hondarribia", "slim_ranking": 0.111111111111}