{"user_rating": 4.0, "review_count": 72, "name": "Hotel Duc de Padoue", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Nicely refurbished hotel, conveniently located on a calm square with parking spaces.", "title": "Very good choice in Corte", "user": "asmile", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47685821}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I can only confirm what other travellers said: the location is excellent and though the entrance of the building doesn't promise much, the hotel premises are tastefully decorated and the staff are very helpful and friendly. The eating area is very pleasant, with a few books and the daily newspaper for you to browse through. We especially enjoyed the generous breakfast buffet and would definitely go back.", "title": "Good choice", "user": "Fordee", "date": "July 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 36219589}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Good, clean Hotel. Excellent position in centre of Corte. Staff very helpful, but not very visible in the evenings if you need anything. Lots of different types of rooms - ask for one with a balcony on the front, over looking the square.", "title": "Modern style and warm service in the historic heart of the island", "user": "SredniVashtar", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35754480}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "We arrived to the spot looking for Hotel de la Poste, which had occupied this historic building before - and walked right into the middle of the opening party for a few neighbors! The hosts offered each of us a coupe of champagne - and checked us in right away. A few minor things, like WiFi (announced in the brochure) were not yet working, but overall the hotel made a great impression right away. We looked into a couple other hotels on our way and this one certainly looked the best. It has great minimalist interiors. The staff were extremely nice throughout our stay, they are a very sympathetic team/family. Great stay.", "title": "Highly recommended", "user": "NorfolkFozzy", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35296998}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "A very good choice in Corte. It's newly refurbished and the staff are keen to get it off it's feet again. Neatly decorated rooms and common areas, good views over the attractive square in which it stands, excellent attentive service, good location just a short walk from the centre. All together, a good value find and highly recommended", "title": "Very recommended", "user": "Juginem", "date": "July 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 35227145}], "location": {"country": "France", "continent": "Europe"}, "variance": {"poor": 2, "average": 10, "very good": 32, "terrible": 0, "excellent": 28}, "aka": "Hotel Duc De Padoue Corte, Corsica, France", "slim_ranking": 0.3}