{"user_rating": 4.5, "review_count": 1781, "name": "Hotel Estherea", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "Will never get another star as the hotel does not have a full time restaurant. That said, try 'Bert's' on the corner for breakfast or lunch. Fast and cheap. As for the hotel, have been some changes in the last several years since we visited. All good. A new section in the back with its own (new) elevator is a big improvement. The hotel lobby, parlor and library are all clean, well maintained gathering places. There is a small niche bar just off the lobby. The restaurant has been expanded. Our internet rate, which was quite good, did not include breakfast which would have been an 18 euro add-on. See the comment about Bert's. Our room, in the new section, was very nice, well appointed, comfortable bed. The hotel is on the Singel Canal, just a short walk from the Dam, or really anywhere as the tram stop is in the next block. Employees all spoke excellent English (Dutch) and were most helpful. Can't complain, except that they need another star.", "title": "needs another star", "user": "notnecessary", "date": "August 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 136836625}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My boyfriend and I chose this hotel based on its great tripadvisor reviews! Since we were only staying in town for a few nights we decided to splurge on the canal facing room because we wanted to wake up every morning and look out on the beautiful canal. We arrived at the hotel at around noon and were told that our room would be ready in an hour, so we stored our luggage and headed out for lunch. When we returned we were given a room, when we arrived in the room it was beautiful and I loved it, but when we looked out the window... no canal view... so we pulled up our reservation just to be sure that we ordered a canal view and sure enough we had so we headed downstairs to talk to the front desk. It turns out there was some sort of booking error and for some reason it said that we had booked a room for 3 and since they dont have any canal facing room for 3 they gave us an alternate room but the fact of the matter was that there were only two of us! So after looking through the reservation system for a while the woman at the front desk let us know that there was unfortunately no canal view room available! Bummer! However she was willing to upgrade us to their luxury suite AND offer us free breakfast AND free wifi for our entire stay! To be honest at first we were still a little upset, we really did want to have a canal facing room even if it was not the luxury suite but when we were shown into the luxury suite our opinion changed. The room was stunning! It was beautifully decorated with a giant chandelier in the middle of the room, I loved it and it was by far the best room that I have ever stayed in! The breakfast was really great, there were a ton of options and it really tasted great! The lobby and bar area are beautiful and great places to just hang out and get a drink. Overall the service made this hotel, they really worked hard to make things right for us! One morning we decided to bike to a windmill that we thought would be about a 20 or 30 minute bike ride away, luckily we checked with the front desk before heading out and she told us that it would probably take us 45 minutes to an hour each way and instead showed us the way to another windmill close by that is also a brewery! It was very cool! The location of this hotel is really amazing! There is a bike rental place orangebike like a block away where you can rent bikes by the day, so this hotel served as the perfect home base for us. I would love to stay at this hotel the next time I am in Amsterdam, and I would even be willing to pay for the upgrade to the luxury suite!", "title": "Amazing Hotel, Amazing Service!", "helpfulness": 2, "user": "cruzin4436", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136738257}, {"rating": 4.0, "title": "Great location, high price ", "text": "The hotel was located in a great part of the city, away from crowds but close to everything. The prices were pretty high and included just the room, no breakfast, no wifi. We were lucky enough to be upgraded to a junior suite but our room was very dark with only one window on the inside of the hotel. The bed was comfortable and the room was quiet. However, I would think you could find more for your money.", "helpfulness": 1, "user": "emtron", "date": "August 7, 2012", "id": 136473343}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Thanks a lot to all fellow reviewers, who gave us a great recommendation to stay at Estheria, first of all!", "title": "Nice, nice, nice!", "user": "Irina94", "date": "August 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136272674}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "We spent 3 nights there before our cruise and were just happy. Our room for three on the third floor did not have a view, but was lovely. The third bed for our daughter was very comfortable.", "title": "Very original!! Great decoration!", "user": "Giselle M", "date": "August 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 136257346}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "We stayed here for a long weekend at the end of January. Although I had read the reviews I was still a little nervous about the hotel, however upon arrival I was really pleasantly surprised. We arrived to a typical Amsterdam street, narrow with a canal and our hotel was a couple of the traditional houses converted. The reception staff were really friendly and we were upgraded to a deluxe room. Our room was lovely (room 216) with a lovely view overlooking the canal. It was immaculately clean, spacious with a extra large bathroom. If you a planning on staying I would recommend that you upgrade to a deluxe room and if possible ask for this room as our friends who were also staying in a deluxe room didn't get such a nice room - again overlooking the canal but not as large and a small bathroom. Another thing which I really liked was the bed linen, nice fluffy pillows and a lovely duvet, no horrible blankets.", "title": "Gem of a Hotel", "helpfulness": 3, "user": "aabeesley", "date": "February 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6780194}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "There was building work going on whilst we were staying however it didn't affect our stay. The location of this hotel is perfect. Literally just around the corner from Dam Square. I would definitely return to Amsterdam and to this hotel.", "title": "Excellent hotel", "user": "TomOnFlickr", "date": "January 30, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6716670}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Excellent hotel in a very good location. Book a room with a balcony and view to the Gracht.", "title": "Lovely Hotel", "helpfulness": 3, "user": "georg4", "date": "January 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6715289, "likes": {"liked": "— The intimate environment", "disliked": "— The building work that was going on"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Hotel was lovely. Staff were friendly and willing to help even when we complained about some building work that was going on they were very apologetic and even gave us a night free. The hotel is a short walk from the city centre so the location is ideal. The free hot drinks and biscuits was a really nice touch especially when you come in from the cold. All in all I would definately recommend staying here if you are thinking about going to Amsterdam", "title": "We Loved It!!", "helpfulness": 2, "user": "lucylab-Penn", "date": "January 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6705229, "likes": {"liked": "— Location,Breakfast,Bar"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We had a beautiful view of the Singel Canal from our room.", "title": "Fantastic Hotel", "helpfulness": 5, "user": "Munkey_Tennis", "date": "January 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6704236, "likes": {"liked": "— The bed.", "disliked": "— Cant think of anything."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed at this hotel on a short break before Christmas. We have 3 kids under 10 and we had a \"family\" room that was really 2 rooms that joined behind a common door. It was great for us because it gave some privacy while still having the kids right there. The location was great although we didn't walk much as the weather was quite cold. The staff were wonderful and very accepting of the kids. The hot chocolate machine in the lobby makes this one of my kids favorite hotels in the world!! Great overall experience!", "title": "Loved this boutique hotel!", "helpfulness": 1, "user": "chellye", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16847154, "likes": {"liked": "— Quality of Service, Child Friendly", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Previous reviews have already stated all the nice things about this hotel, so I won't repeat them. I will just back them up by saying that the Estherea is a GREAT hotel! Super-friendly staff, unbeatable central location, nice extra touches, sparkling clean rooms. I cannot recommend it highly enough.", "title": "Above and Beyond Expectations", "user": "Love2Travel95", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16515117, "likes": {"liked": "— Coffee, snacks 24 hrs. a day, location, staff, clean modern room", "disliked": "— I wish I could have stayed longer!!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Father/ son from Texas stayed for two nights in May. It was the perfect place to stay to visit this wonderful city. Room on fifth floor with canal view. Common areas very pretty and comfortable, Staff right on and helpful. Close to most attractions. Highly recommend.. This hotel deserves it's high rating on Trip Advisor.", "title": "Great Place to get a Great Feel for Amsterdam", "user": "TexasTigerDallas", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16451145, "likes": {"liked": "— The total package", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Stayed here for the weekend, spotlessly clean throughout, bedroom in excellent condition - wonderfully comfortable bed. Staff efficient. Nice touch to have the complimentary hot drinks available 24 hours in the foyet. Lovely frontage of hotel, everything in walking distance, good breakfast. Overall a nice place to stay.", "title": "Classic Elegance", "user": "Jan_AbbotsLangley_UK", "date": "May 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 16398441, "likes": {"liked": "— Spotlessly Clean and in good decorative order.", "disliked": "— Staff were a little stuffy!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This is an amazing hotel. We had a deluxe double with canal view and four poster bed. It was very romantic and beautiful. The staff were all friendly. The best thing was the complimentary tea, hot choc and cakes in reception which you could have when ever you wanted without feeling you were being watched. We took it up to our room which was good too. The hotel was very comfortable to be in with a relaxed atmosphere. The location was the best and was central to everything. I would recommend this hotel and would stay again without hesitation.", "title": "brilliant hotel", "helpfulness": 1, "user": "cocoabearWeymouth", "date": "May 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16298711, "likes": {"liked": "— relaxed atmosphere. complimentary coffee and cakes and room decor", "disliked": "— room service breakfast did not include bacon and eggs only continental"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Hotel Estherea is a fabulous hotel and quite accomodating as well. We just returned from our travels which including this hotel and loved everything about it. Clean, wonderfully helpful and pleasant front desk staff and exceptionally large room for European standards. Easily accomodated me and two kids with lots of room to spare. Coffee, tea, hot chocolate and cookies are always available to guests...a huge perk for a quick snack since Europe is so expensive these days for American travelers...a coffee break anywhere in Europe can easily run $15-$20.00 these days. Fruit is usually also left for guests as well as small cakes if they are left over from the restaurant. The hotel has a wonderfully comfortable lobby as well. Without doubt I would stay here again.", "title": "Beautiful, charming and accomodating", "helpfulness": 1, "user": "jetlagged7", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17943230, "likes": {"liked": "— clean, comfortable and unusually large room", "disliked": "— Loved it all"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The hotel is in a great location - just around the corner from lovely restaurants and bars but still quiet.", "title": "Great Location, Quiet", "helpfulness": 1, "user": "GinaDublin", "date": "July 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17931642, "likes": {"liked": "— Location", "disliked": "— Cost of internet facility"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I found the price expensive but then all hotels seem to be expensive in Amsterdam. We paid 220Euro for a Friday and Saturday night in July.", "title": "Great Stay!!! Loved The Estherea!", "helpfulness": 1, "user": "karlimd", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17883736, "likes": {"liked": "— beautiful lobby,great staff", "disliked": "— nothing!!"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "Rooms are small but adaquate and very clean. The bed was comfortable, the towels were fluffy.", "title": "Decent", "helpfulness": 1, "user": "gatorbait2008", "date": "July 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 17824965, "likes": {"liked": "— clean, location", "disliked": "— small rooms"}}, {"rating": 5.0, "title": "Charming Respite in the Heart of a Great City", "text": "We did not eat at the hotel so I can make no comment on the menu. However, they do have good coffee in the lobby, small pastries and toffees. A nice addition.", "helpfulness": 1, "user": "Hosalito", "date": "July 11, 2008", "id": 17788680}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed in this hotel on a beautiful October Saturday in 2006.", "title": "Gorgeous hotel, great location, tiny and noisy rooms", "user": "FreezeM", "date": "October 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 10050121, "likes": {"liked": "— The location and the atmoshpere", "disliked": "— Tiny noisy rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The good: the location is perfect. It's right near all the tourist attractions, on a beautiful canal on a relatively quiet street. The hotel staff was polite (though not very warm and friendly) and helpful with directions. The entree, the lobby, the rooms (see photo), hallways and the restaurant areas are very well and tastefully decorated. It's classy from the outside (see photo) and from the inside. Everything is very clean. The price for breakfast (14 euros) is not expensive. Complementary hot chocolate, coffee and tea is available 24 hours a day in the lobby.", "title": "Perfect Place to Stay in Amsterdam!", "user": "GermanyBrandi", "date": "October 1, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 10023989, "likes": {"liked": "— Quiet location, special touches like chilled mint water and coffee 24x7", "disliked": "— No parking"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The shower was powerful and fully made up for the small bath you had to stand in to enjoy it.", "title": "we will return", "user": "jackandruth", "date": "September 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10022201, "likes": {"liked": "— read review", "disliked": "— read review"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The bad: we were placed in a tiny (see photo) 'normal' double room (but with a great view of the canal, see photo). They did say that if the room was too small, we could switch and this was one of the smallest room in the hotel. We only spend there one night, so with little luggage it was ok for one night. We would not have stayed in that room for any longer. The bathroom was tiny too. There was not enough room for two people. There wasn't even enough room for one! Another bad thing was the noise. We could hear the people above us walking around in their room, we could hear the slamming of closet doors from our neighbors and all the noise from the hallways. Also we couldn't seem to get the heater down, the temperature was centrally controlled. It caused the room to be way too warm and the air to be as dry as the air in airplanes. Our eyes even hurt a bit! So we slept with the window open. But the window did cause the street sounds to come in. Even though this is a relatively quiet street in Amsterdam, there is really no such thing as a quiet street in Amsterdam. We ended up sleeping very little hours.", "title": "A wonderful hotel", "user": "cafemarmelade", "date": "September 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10017030, "likes": {"liked": "— The great lobby and coffee machine", "disliked": "— The steps at the entrance make it difficult with a stroller."}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Breakfast was good, but nothing special. They run out of fresh fruit and the boiled eggs were disgusting.", "title": "Nice, but very cramped", "helpfulness": 4, "user": "japindy", "date": "September 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 10015148, "likes": {"liked": "— Location", "disliked": "— Room size"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed here during the Summer with my girlfriend, fantastic hotel in a beautiful part of Amsterdam.", "title": "Lekker!", "helpfulness": 1, "user": "collie r", "date": "August 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 136228992}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Very friendly and helpful staff and the hotel and rooms were of a very high standard.", "title": "Beautiful Hotel - one of the nicest hotels I've stayed in", "helpfulness": 3, "user": "CarolineSunderland", "date": "August 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136121077}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I've been to Amsterdam a number of times and stayed in some over priced, rubbish hotels and decided I'd pay that bit more for this visit and it was well worth it.", "title": "WOW!", "helpfulness": 1, "user": "maxrod4", "date": "August 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136036359}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The hotel is in a relatively quiet canal in Amsterdam so perfect if you want to avoid the main Red-light, (although there are a few discrete red-lights dotted along Singel), but still close enough to the centre if you get bored and want to explore the fun parts of the dam ;)", "title": "Great location, nice hotel - but double check your GPS", "helpfulness": 1, "user": "mookiejay", "date": "July 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135799939}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Booked last minute trip to Amsterdam and went over on the Ferry from Newcastle. Hotel was wonderful and made the trip. It was a short walk - 10 minutes if that - from the Central Station. We booked a triple room and a twin room and they were both beautiful. The Hotel is a beautiful hotel, feels very boutique. Breakfast was 18 euros each but only paid for people over 12, so 2 of the kids ate free which was great value. It was immaculate and the staff were fantastic, very friendly and helpful. Amsterdam was lovely - we were only there for 24 hours - did coach and horse ride from Dam Sq which was a great way to see the City, went on the canal bikes which were a great way to do the Canals, nicer than the proper tours. Our Lord in the Attic was good - Hidden church in the attic. We climbed the Westerkerk Tower which was a great view of Amsterdam. Hard Rock Cafe was fab. Didn't get to see Anne Frank Museum as hadn't booked - queues are long - book in advance on line if you want to go.", "title": "Beyond all best expectations", "helpfulness": 3, "user": "Lenchik_12", "date": "July 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135647356}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Stayed for 3 nights, had read a lot of the other reviews and wandered if it would be as good as they said and it was. Hotel is very central and staff very helpful, would definetly recommend this hotel to anyone going to Amsterdam.", "title": "Execellent hotel", "helpfulness": 2, "user": "NISunshine", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14682376, "likes": {"liked": "— Its central location and the room was very comfortable and the free tea/coffee/cakes very good.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We are just back from 4 nights at the Hotel Estherea. It is an outstanding hotel. It is beautifully decorated and extremely well run. The hotel staff is very helpful. Some of them might be a little formal, but all tried their best to help us in any way they could, from getting dining reservations to having a room for us when we arrived at 7 am - amazing! The location was unbeatable - no matter where we wanted to go in the city, it was an easy walk. We finally took the tram the last night, just for the experience. We had a double without the canal view, but it was very spacious. The bathroom, though small, was both spotless, and well equipped. The price was very fair. Even with the sad state of the dollar, it average the same as a recent stay at the San Diego Embassy Suites.", "title": "An excellent hotel, & I am fussy!", "helpfulness": 5, "user": "MaryJane03", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14503010, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "I can't thank all the reviewers enough for all the great information that they have given in their reviews. They helped make our trip go smoothly. From needing our credit card pin number to get the train tickets from the airport to finding the Gollum - a neat brown cafe -your advice was invaluable. I strongly recommend reading all the reviews you can- I felt so comfortable choosing restaurants and finding places - like the advice from about 25 close friends!", "title": "A Real Gem", "helpfulness": 2, "user": "SISTERACT4", "date": "March 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14413809, "likes": {"liked": "— The Decor", "disliked": "— The Window Was Always Left Opened By The Cleaners So On Our Return Room Was Very Cold"}}, {"rating": 5.0, "title": "canal view", "text": "Don't hesitate trying the Luden - just around the block. The food was terrific, reasonably priced, especially in the Brasserie in the front,and felt like being in Paris. The Cafe Luxembourg was also fun, and just a little further down the street. The soups and fries were especially good. The hotel's location near so many great restaurants is just icing on the cake. We tried the hotel breakfast, and it was very good, but also crowded because they were full while we were there. So we only ate there once. Broodje Bert on the corner serves a bargain full breakfast or just a roll if you want, simple but fun to sit down and watch the world go by in front of you while sipping your coffee.", "helpfulness": 2, "user": "versicals", "date": "March 17, 2008", "id": 14338612}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Yes, we had a wonderful time. The weather was cold and rainy - it even snowed. But it didn't matter, we had such a good time in Amsterdam - we recommend it highly- and everyone spoke English!", "title": "A Beautiful place youll never want to leave!", "helpfulness": 1, "user": "PawsD", "date": "March 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14271871, "likes": {"liked": "— Attention to detail and atmosphere", "disliked": "— Bed was far too comfy and I looked forward to getting back after our day out!"}}, {"rating": 4.0, "title": "Great hotel, even with kids", "text": "With kids aged 9, 7 and 4, finding the right hotel with inter-connecting or adjacent rooms is vital. Despite having been promised this, the rooms we were given were separated by an internal courtyard and some distance apart, albeit neighbouring.", "helpfulness": 3, "user": "Donk-Argyle", "date": "February 16, 2007", "id": 6802127}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The next day, we were offered alternative rooms which were right next to each other and from this moment on, we had a fantastic stay. The hotel was excellent with really friendly staff who used their initiative and for whom nothing was any trouble.", "title": "Fantastic hotel- shame about the building work", "helpfulness": 8, "user": "SaschaManchester", "date": "February 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6800874, "likes": {"liked": "— Decor", "disliked": "— Buiding work"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Rooms were very good, well-equipped and very attractive. Worth getting rooms with a view if you can, not on the internal courtyard so you have natural light.", "title": "Helpful staff", "helpfulness": 4, "user": "traveller078", "date": "February 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6797200, "likes": {"liked": "— lovely decor", "disliked": "— workmen starting work at 7.30 am on monday morning !"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Breakfast was not cheap at 14 euros each, but it was good and free for children under 12.", "title": "Lovely hotel!!", "helpfulness": 3, "user": "hotcakes", "date": "February 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6787904, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The location is great with good access to tourist attractions and a variety of good local restaurants.", "title": "Brilliant", "helpfulness": 4, "user": "mtse", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6781173, "likes": {"liked": "— Comfortable beds", "disliked": "— Nothing to fault at all"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2006", "text": "I went to Amsterdam for the first time with my spouse last weekend. We stayed at the Estheria for 2 nights in a deluxe room (room #114).", "title": "Non smokers beware!", "helpfulness": 11, "user": "bunyete", "date": "February 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4405613}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "At first we were very satisfied by the hotel because it is beautiful, our room was large, clean, well decorated, and had a nice view on the canal, and the staff made a good impression on us.", "title": "17th century canalhouse charm", "helpfulness": 19, "user": "RoomRaider69", "date": "January 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4367736}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The first problem arose on the first night: our room was on the first floor and we were disturbed around 1a.m by a group of people talking loudly right under our windows, probably waiting for some friends on the doorstep of the hotel. Apparently, nothing special has been done for (external)noise insulation. However it only last 15 minutes and thus was a minor problem. Note that we could not hear any noise coming from other rooms.", "title": "Fabulous", "helpfulness": 19, "user": "mollysmum", "date": "January 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4358240}, {"rating": 4.0, "title": "Great Location.", "text": "The second problem was of much greater importance. We asked for a non-smoking room, as usual, because we are, though french, very sensitive (negatively) to cigarette smoke. The room was indeed non-smoking, and nobody had smoked in our room, but the room in front of ours (room #115) was a smoking room. And the guests in room #115, in their right, were unfortunately smoking a lot. Our room was invaded by smoke all night and we had to sleep with an open window in spite of the outside temperature (I would say around -5 °C). At the reception, after checking the corridor, they admitted that there was indeed a lot of smoke but could not do anything because room #115 was a smoking room and the hotel was full (so that they could not give us another room).", "helpfulness": 17, "user": "A TripAdvisor user", "date": "January 4, 2006", "id": 4325203}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We thus spent a terrible second night in that hotel.", "title": "Delightful place to stay", "helpfulness": 10, "user": "Jaytraveller", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4316387}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "My mother and I have just come back from Amsterdam and I chose to stay at this hotel due to the great feedback I had found on Tripadvisor.", "title": "A Must", "user": "AllTheGirls", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15490436, "likes": {"liked": "— The Decor", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I have to say the hotel was superb!!! The check in staff very helpful and friendly, the decor very welcoming, the rooms were smallish but so beautifully and tastefull decorated, we really couldnt have wanted anything more. The bathrooms were very clean and the beds very comfortable. A real bonus was also the free afternoon cakes/ coffee for guests.", "title": "Best choice in Amsterdam if you're like me", "helpfulness": 2, "user": "travelmiracle", "date": "April 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15366057, "likes": {"liked": "— location, location, location- you want to feel safe. even the smallest amount of bad energy in hotel neighborhood can dampen your spirits", "disliked": "— the front desk staff was just a bit smug and not several times know where things were nor could answer simple questions"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "We had a brilliant stay and will do so again!!", "title": "Tiny Shabby Room", "helpfulness": 3, "user": "Wanderer151", "date": "April 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 15345373, "likes": {"liked": "— Neighborhood and on a canal", "disliked": "— The room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "If you're like me you want to stay right near everything happening, but have quiet for a restful retreat.", "title": "Wonderful experience", "helpfulness": 2, "user": "ohmyGOSH", "date": "April 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 15144456}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "If you're like me you want to fully experience the location you are in by making your home one of architectural ambiance unique to the area, while not forgiving luxury, comfort and class.", "title": "Not Your Average European Hotel", "helpfulness": 4, "user": "markmcloughlin", "date": "April 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15060838, "likes": {"liked": "— The cozy lobby area", "disliked": "— The fairly pricey breakfast and wireless internet"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Perfect central location on a beautiful canal, a short walk to many restaurants and attractions and right near a tram to take you quickly everywhere else. Wonderful, courteous staff. Gorgeous old-Amsterdam style canal house hotel. The public areas are drop-dead gorgeous and there are now two computers in the living room for guests without charge -- one or the other was always available.. Tea, coffee, cookies etc. left out all day are a nice touch and we appreciated a cup of camomile tea while watching the fish in the fish tank. Our room was quiet (on an interior courtyard), very charming -- comfortable bed and large bath with a nice tub/shower and nice toiletries.. This was my second stay at the Estherea, and I'd love to go back anytime!", "title": "My Favorite Hotel In The World!", "user": "GoGirlToo", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47592311}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The Hotel Estherea is in a good location on the Singel Canal. The description states that it has been held in ownership by the same family for many,many generations. That made us believe that all the personal touches and pride of family ownership would be there. Instead, the reception was aloof to the point of being unhelpful--for example,the porter showed us to our room but he never carried our bags and saw me struggling with mine. He merely opened the door for us and expected his two euro tip! When I emailed the front desk to ask about the taxi charges from the train station to the hotel they told me about 10 euros. They didn't bother to mention that all the taxi drivers in Amsterdam cheat on the fares,which is common,common knowl;edge. What the drivers say is--\"you have 4 bags. That costs extra!\" If the hotel staff knew this, in my view they could have easily have said--BEWARE! We were charged 25 euros for a three minute ride. Apparently that was the highest they had heard of from other complaints issued by hotel guests. When we asked about restaurant recommendations they only came up with one name--we indicated that we were just there--could there be another restaurant in all of Amsterdam.They indicated they couldn't think of one but would get back to us. They never did. Having said all that, I will now state that the location is good and central.quiet,", "title": "Mediocre--At Best", "helpfulness": 2, "user": "Lily L W", "date": "October 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 47329261}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We stayed in a triple room for 3 nights our bed was a super kingsize with lovely bedlinen. Our daughter slept in a proper sturdy sofa bed which was also very comfortable. The room was cleaned everyday with bottles of mineral water replaced in the minibar free of charge. There was a very high standard of cleanliness throughout the hotel which we loved. Lots of lovely complementary toiletries, slippers and a proper iron and ironing board. We didn't have breakfast in the hotel, we ate in the local cafe called broodje bert which was delicious, we also had eggs benedict one morning at Cafe Luxembourg which was also verg good. The free tea, coffee,hot chocolate was such a nice touch, we looked forward to coming back to the hotel late afternoon for a cuppa and some cakes and cookies. Our daughter loved the jars of free sweets and candies that were also on offer. The staff were very friendly and helpful and the hotel also had free internet access which is very unusual, great for checking in online and printing off tickets. The hotel is very central it's near to Dam square, it's within walking distance of Anne Franks house, the canal boats, the museums and Vondel park, we walked everywhere with a 5 year old. This is not a cheap hotel but you get what you pay for and I honestly can't say anything negative about this hotel. I find it hard to believe that some people have had a bad experience staying here. We'll be back at some point in the future.", "title": "Very well furnished and extremely comfortable central hotel", "user": "colettski", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47181203}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I have never been so delighted by a hotel in my long traveling life. Hotel Estherea is right on the Singel Canal and many rooms face onto the canal (though the ones on the 5th floor only have one window, the ones below have huge picture windows). The hotel lobby is just delightful and beautiful and quiet most of the time. This boutique hotel is near some great restaurants, and it is perfectly located. We asked to hold our bags several times, and the front desk staff was amazingly helpful and kind. I wish there were a hotel like this in every European city. It is a real find, and I would never stay anywhere in Amsterdam again. (DO NOT go to the American Hotel, despite its reputation -- SO touristy). This is a charmer! (Oh, and you'll love the gorgeous salt water fish tank in the lobby -- tres elegante!).", "title": "Beautiful Boutique Hotel, Amazing Service, Lovely Rooms", "user": "EmilyMartha", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47139524}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The staff was excelent and very helpful with any questions that we had. We spent 2 nights there and it was much better then the 5 star hotel we stayed in on the way back to Paris in Brussels. We found out the hard way via cab rides that the best way to get anywhere in Amsterdam is either the canel hop on hop off boat., or simply when you go out the front door of the hotel go right and the first cross street make another right and walk a few blocks to the center of the city. No need for fancy places to eat as any small pub will do and the food is just as good.", "title": "Great staff very helpful, good location, worth the price", "user": "LOSUsa", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46831502}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We spent 2 nights here about 10 days ago.", "title": "Great location, lovely hotel", "helpfulness": 2, "user": "diesy8", "date": "July 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135590716}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Our room was available straight away when we arrived which was great and it looked over the canal. The staff were vey courteous and helpful though unfortunately this did not last.", "title": "Wonderful hotel", "helpfulness": 2, "user": "deeg324", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135462503}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Tea, coffee and cake were complimentary of an afternoon and evening which was a quality touch and rare in most hotels. We found the common areas really comfortable and homely. These ares were great after dinner, reading or just relaxing as the rooms are quite small.", "title": "cultrual city break", "helpfulness": 1, "user": "chris a", "date": "July 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135153379}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Upon asking staff on our second day at reception for information about various things to do and see, restaurants etc. they really were not that helpful or interested which was a shame. I will say though that there was one young guy who took our bags and he was delightful and informative.", "title": "Rooms are nice, staff is rude", "helpfulness": 1, "user": "Rock504", "date": "July 22, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 135084666}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "There is so much to do and see in Amsterdam and walking around is the best way to see all. The food and restaurants are great and to us, very reasonably priced. We went out for breakfast each morning and it was 1/4 price of the hotel. It was unfortunate that it rained alot as we would have done so much more.", "title": "Always Estherea!", "helpfulness": 1, "user": "SaoTomeTripper", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135005945}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "My wife and I stayed at the Estherea for our 20th wedding anniversary. On arrival we got a lovely warm welcome and a surprise basket of celebratory freebies in our room. The view from our window was of one of Amsterdam's numerous canals, very picturesque!", "title": "Happy Anniversary", "helpfulness": 9, "user": "Snootsworth", "date": "February 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4473432}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Our room was clean, nicely decorated and really only lacked tea and coffee making facilities. Mind you all we had to do was take up the complimentary coffee from the lobby up to our room!", "title": "Gorgeous hotel, great location!", "helpfulness": 10, "user": "pomandoz", "date": "February 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4472115}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "The hotel itself is very inviting, lots of dark wood, old books and leather sofas. The staff were always friendly and courteous, always willing to help and answer questions.", "title": "Worth every euro", "helpfulness": 3, "user": "Captain Mikey", "date": "February 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4465271}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Amsterdam is a fantastic city to explore and the Estherea's location is ideal for getting to all the sights.", "title": "Wonderful hotel", "helpfulness": 7, "user": "menumad", "date": "February 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4461445}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "All in all we had a fantastic time...do visit Anne Franks' house and do eat in the little cafe bar \"De Prins\" opposite the house on the other side of the canal....brilliant food, nice vibe and cheap!", "title": "Perfect location", "helpfulness": 11, "user": "Dantechnet", "date": "February 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4414644}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We spent Christmas at Hotel estherea - chosen thanks to the many good reviews it was given. Our fifth trip to Amsterdam and the best hotel we've been to. Arriving in ( after trecking round shops and bars) to the 24hr tea/coffee/hot choc machine was heaven (no kettles to boil)! There was even iced-water with fresh mint!", "title": "Wow - Christmas at Estherea; the best!", "helpfulness": 15, "user": "traveller015", "date": "December 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6526705, "likes": {"liked": "— Public rooms -cosy", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Public rooms very cosy and Christmas decorations very tasteful. (Bowls of chocolates on various tables)Friendly, helpful staff. Breakfast is optional - well worth the 14 Euros - especially the sausages and the muffins!", "title": "EXCELLENT!", "helpfulness": 13, "user": "TKlash", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6473533, "likes": {"liked": "— Everything!", "disliked": "— Check it out1"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Room overlooked canal ; was a great size and tastefully decorated (antique writing desk!)", "title": "loved Estherea", "helpfulness": 12, "user": "doownelg", "date": "December 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6437734, "likes": {"liked": "— The extras like drinks and snacks on tap and lovely lounges to relax in 3 in total inc. bar", "disliked": "— Stairs a little steep"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We'll definitely return.", "title": "Beautiful hotel", "helpfulness": 12, "user": "SargeantPepper", "date": "November 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6305289, "likes": {"liked": "— The ambience of the hotel", "disliked": "— unfortunate noise in street below"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2006, traveled as a couple", "text": "Stayed at the hotel for six nights in December, 2006. In my opinion, you will not find accomodations to equal anywhere in Amsterdam.", "title": "Loved it", "helpfulness": 4, "user": "JOJO99", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6160249, "likes": {"liked": "— Room decor, furnishings and free refreshements.", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Hotel Estherea", "text": "We had a wonderful night at Hotel Estherea. Great location, very hospitable,nice extras such as coffee, hot chocolate and snacks.Rooms are very nice and comfortable. Also had a wonderful private tour fron Wynard at Senior Holland Travel very enjoyable time.", "helpfulness": 1, "user": "dekane", "date": "September 27, 2007", "id": 10012811}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Prior to arriving in Amsterdam I e-mailed hotel for directions from Central Station. They were prompt in giving accurate directions. After checking in we asked several questions to understand how to get around. Front desk staff was basically cold and and not helpful. Amsterdam was interesting but not easy to get around. The hotel room was clean, location was fine but would not be a country we would look forward to visiting again. The hotel offered hot chocolate and coffee in their lobby area as a courtesy.", "title": "The best hot chocolate", "helpfulness": 1, "user": "zaydeboy", "date": "September 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10011122, "likes": {"liked": "— Only the hot chocolate they offered was great", "disliked": "— Cold front desk staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Had a lovely stay in this hotel, pleasant reception area and staff friendly. Room was a lovely size and well equipped, a friend also stayed but their room was a little small.", "title": "Beautiful Hotel", "helpfulness": 1, "user": "Gohop", "date": "September 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10010139, "likes": {"liked": "— Location", "disliked": "— The chance of getting a small room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Walking distance of all areas of the city. Loved Amsterdam can't wait to go back would book same hotel again.", "title": "Quality and quiet in the middle of it all", "user": "micklois", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10008554, "likes": {"liked": "— location and comfort", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Stopped at the Estherea in June and decided to return , not dissapointed at all , a better view this time with our friends and us getting canal view rooms on the first floor , although some noise is apparent from rooms above its not too disturbing , Great location 5 min Rembrandt square , 5 mins Red light District , 5 mins Dam Square , 10 mins centraal station . Buffet Breakfast at €14 is good value , fruit juices , breads , toast , bacon ,eggs , scrambled , fresh fruit and plenty of tea and coffee . Tea and coffee available day and night free of charge , biscuits and pastries replenished on a regular basis . Absolute quality rooms decorated and furnished to a high standard , no wonder this hotel is consistently out performing its rivals in the same price bracket , beleive me you will get a quality experience at the Estherea without braking the bank", "title": "Excellent Honeymoon getaway", "helpfulness": 1, "user": "NayKat", "date": "September 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8852658, "likes": {"liked": "— Location", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Selecting a hotel in Amsterdam was very difficult, as there were so many mixed reviews. I finally picked this one as the negative comments were minimal and it had air conditioning, and we did need it! This hotel was located along the relatively quiet Singel canal. As we ventured out toward the Dam Square and the pedestrian shopping street, we really began to appreciate the location. We were within walking distance of everything but away from all the congestion of people, bikes, trams and autos. The hotel was very nice, with elegant and formal decor, and big tasseled room keys. The bed was very comfy and the linens very luxorious. We had large windows overlooking the canal and street. The bathroom was small but nice, and the toiletries supplied were impressive. The hotel doesn't look like much from the outside, but it is housed in several centuries old buildings, with all the ambiance you'd want in an Amsterdam hotel. The hotel was a bit pricey, but after seeing some of the other hotels we had considered online, we were glad we'd paid the extra money for this one. We did not eat breakfast at the hotel as there were several pastry shops in the vicinity where we were able to but meat pies and beverages for about 8 euros.", "title": "Lovely Hotel away from the chaos", "helpfulness": 1, "user": "Karenkinm", "date": "September 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 41211694}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed for 6 nights at this \"canal house\" hotel. It was perfect in every way from the canal side location, to its beautifully maintained and furnished interior, to its friendly and helpful staff.", "title": "A fantastic, family owned historic hotel in an idyllic central location next to a canal", "user": "Teresa_GreenCheshire", "date": "September 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39906248}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "My wife and I and our 9 year old son have just returned from a very enjoyable stay at this wonderful hotel.The staff were very professional and courteous, and dealt with any requests swiftly. The location of the hotel really couldn't be better, right on the Singel canal, within walking distance of virtually every sight in the city, as well as shopping and entertainment areas. At the same time the immediate area is fairly quiet, so you have the best of both worlds. The free tea, coffee and hot chocolate in the lobby are a nice touch, as is the library.", "title": "Wonderful Amsterdam hotel in the ideal location", "user": "FR73", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39539087}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I stayed at the Estherea for 3 nights in mid July. We loved the hotel, great rooms - with the most comfy beds ever! It was tough to get out of bed in the morning! The bathroom was lovely with a big walk in shower, double sinks and a big jacuzzi. In the lobby guests are provided with free hots drinks and a selection of biscuits, which were delicious. The fish tank in the lobby is great, lots of lovely sea life to watch. The staff were all lovely and very helpful. We didnt bother with breakfast at the hotel, we chose to eat out, there are plenty of places close by to grab a nice breakfast - Cafe Luxembourg does nice omlettes! There is also a bakery in the alley beside the hotel and it is practically impossilbe to walk by and ignore the smell of delicious things cooking! Esthera is in a great location, its on the Singel canal, which is beautiful, and is within easy walking distance of all the main attractions. It takes around 20 minutes to walk to central station, and its a nice walk. Its also really close to one of Amsterdams best restaurants - The Five Flies http://www.thefiveflies.com/nl/index.asp? - a must if you stay here! Another great place also located really close is Ludens http://www.luden.nl/2/Amsterdam/default.ecms. We also had lunch at the Dylan in the courtyard, it was lovely too and on a warm sunny day it was great relaxing in the court yard http://www.dylanamsterdam.com/ We treated ourselves to dinner at Ciel Bleu http://www.cielbleu.nl/en/Home.html Its expensive but the food & the views were amazing. The food presentation was stunning, we didnt know if we were supposed to eat it or wear it! Another place worth checking out is the Grasshopper, coffee shop, bar and steak house all in one building. The terrace outside was beautiful and a great place to relax and soak up the sun http://www.thegrasshopper.nl/.", "title": "Fabulous Hotel in a Fabulous Location", "helpfulness": 3, "user": "Pauline_1", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39480435}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "There are 2 benches out the front of the hotel and after a long day it was nice to chill there with a glass of wine watching life float by on the canal.", "title": "Lovely stay at Hotel Estherea", "user": "alexnkev", "date": "August 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39351599}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at Hotel Estherea at the end of August.", "title": "Fabulous stay at Hotel Estherea & Amsterdam", "helpfulness": 1, "user": "rodeli", "date": "October 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10079646}, {"rating": 4.0, "title": "Great Hotel Great Location", "text": "The hotel is very central and within walking distance", "user": "jabby1", "date": "October 14, 2007", "id": 10078702}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "to the main attractions like Dam square, the Red Light District, museums and Central Station.", "title": "I want to go back!", "user": "david999", "date": "October 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10066544, "likes": {"liked": "— the neighborhood", "disliked": "— a bit expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Stayed 1 night at Estherea during our 3 week Europe honeymoon (independant travel). Arrived in Amsterdam by train. NOTE - TAKE A CAB to the hotel ! we made a mistake by walking - is too far to walk. There is also a bus that stops behind the hotel.", "title": "Beautiful decor, lovely breakfast and fantastic location!!", "helpfulness": 2, "user": "carolandbob", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8716961, "likes": {"liked": "— The elegant, classic decor"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Paid 170 Euros for a canal vew room (#310). WONDERFUL room (see pic), HUGE, spacious, with comfortable bed. Hotel was very quiet (since is on the canal side) but very centrally located (take the bus, is hassle free and covers almost all the sights). We even got a gift basket from the hotel ! I had informed them being our honeymoon but I was surprised to see the gift basket since we only booked 1 night there.", "title": "You probably can't go wrong here.", "helpfulness": 3, "user": "m0thily", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8665921, "likes": {"liked": "— Beautiful decor, great location, comfortable bed, clean bathroom", "disliked": "— Noisy in the early morning, no view from our room, weird room-key policy"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "for a wonderful view. Ask for Rooms 110, 112, 210 or 212. for a canal view. For a city with pricey hotels, we were happy to pay 185 euro per night to stay in such an elegant small hotel.", "title": "A Small Palace", "helpfulness": 1, "user": "Najdyah", "date": "September 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8611115, "likes": {"liked": "— The entrance of the hotel and the decorations", "disliked": "— the small staires and rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "It is quite comfortable to sit in the lobby or read a newspaper in the library while enjoying a complimentary cup of coffee, tea or hot chocolate and cookies. There is also a small staffed bar.", "title": "Fantastic hotel", "helpfulness": 2, "user": "hufsa", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8588939, "likes": {"liked": "— Hotel interior and canalview. Also location.", "disliked": "— The bathrooms were a little small."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The buffet breakfast was included in the price and was nicely done. It included eggs, sausages, cold cuts and cheeses, cereals, fresh fruits and juices, and marvelous assortment of homebaked breads and pastries.", "title": "Great Find in Amsterdam", "helpfulness": 1, "user": "onthego66", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8524102, "likes": {"liked": "— Location", "disliked": "— Expensive breakfast"}}, {"rating": 5.0, "title": "Fantastic hotel", "text": "We couldn't have hoped for a better hotel from which to explore Amsterdam. The staff are friendly and helpful. The location is beautiful. Our room was comfortable and beautifully furnished.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 1, 2006", "id": 4567438}, {"rating": 4.0, "title": "Great location", "text": "A great location within walking distance of interesting sites. Not too far from an American Express office which came in handy. Did not try the full breakfast in the morning -- the muffins and fruit on the continental table were enough. Great advice on restaurants, appreciated the loan of an umbrella, and help with directions.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 24, 2006", "id": 4500401}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "This hotel is a wonderful choice. The staff were extremely friendly and helpful. They gave excellent restaurant and excursion recommendations. We loved the 24hr coffee, tea, and fruits. The library and lounge was a great place to relax. We had one of the smaller rooms facing the canal, but there are bigger ones. It was perfect for a couple. The room and bathroom were immaculate. The hotel is situated within walking distance of everything, such a great location.It was far enough away from the things, that it was quiet and peaceful to sleep. My boyfriend and I would definitely recommend staying here and will stay there again.", "title": "Absolutely wonderful!", "helpfulness": 10, "user": "sheky3", "date": "February 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 4498992}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "My sister and I stayed here for three nights at Christmas 2005. I agree with all of the positive reviews posted here.", "title": "excellent", "helpfulness": 9, "user": "connaught", "date": "February 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 4496173}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "As two young women in our early 20s, we especially appreciated the safe street that the hotel was located on, and the gleaming bathroom with TWO side-by-side sinks.", "title": "Great value, great location", "helpfulness": 9, "user": "E&JJ", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4476857}, {"rating": 3.0, "stay_parameters": "Stayed January 2007", "text": "This hotel is definitely a looker. Eye catching lobby area, beautifully appointed and adorned. Very cozy, the kind of place where you can sit, chat and drink till late in the evening. The rooms were equally as charming and a decent size for Amsterdam. The service was helpful and ambitious, providing directions, a decent hair dryer and generally trying to be one step ahead of our needs.", "title": "A Gem", "helpfulness": 6, "user": "sixlegsup", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6634872}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The hotel is a little noisy. Not due to the clientel, but the generally tight quarters and fairly thin walls. If you require absolute quiet to catch 40 winks then you may need to mention this when you book. Also, the hotel is currently undergoing renovations. Unfortunately, we were not informed of this prior to booking or check-in and the work often started prior to 9:00.", "title": "Welcome to the Hotel Estherea...", "helpfulness": 8, "user": "leighdd", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6633945, "likes": {"liked": "— Caring attention to detail-they go the extra mile !", "disliked": "— High internet charges-bad news when travelling with a teenager !"}}, {"rating": 5.0, "title": "Lovely experience in this charming hotel", "text": "The hotel sits on a lovely canal and has some great cafes and restaurants nearby. The Luden quickly became one of our favorites. It is also just a few blocks from Dam Square and is generally centrally located to the city sights.", "helpfulness": 9, "user": "memnj", "date": "January 18, 2007", "id": 6616635}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Would rate 3 and a half, but will curve down due to the construction. Just came from a 4 star hotel in Paris and this does not quite reach that level, though the service is probably some of the best around.", "title": "The Absolute Best Place", "helpfulness": 10, "user": "EliMiami", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6570154, "likes": {"liked": "— Hot chocolate & beautiful place", "disliked": "— Best hotel in Amsterdam"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I stayed here with my 13 year old daughter, in January. This proved to be a really excellent choice. We had a room on the 5th floor, very quiet, well appointed and a large bathroom, by European standards. We did not opt to pay extra for a canal view-we were only there to sleep anyway !", "title": "Loved This Hotel", "helpfulness": 11, "user": "Hinkle", "date": "January 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6560310, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Stayed here in September 2007 for my birthday and we thoroughly enjoyed our stay. The hotel is a 10 minute walk from the centraal train station which is directly linked to schipol airport. Overall it took about 45 minutes to get to the hotel from the airport and it only costs a few euros on the train and is very easy to use.", "title": "quality hotel", "helpfulness": 1, "user": "JackMan_ValleyGirl", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16210964, "likes": {"liked": "— Canal view and the large room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "The hotel is well located for all the sights in amsterdam. Dam square is 10 minutes away whilst the red light area is about 15 minutes. In the opposite direction is the leidesplein which has plenty of bars and restaurants whilst just behind the hotel is a retaurant called Hansje Claes which we would recommend.", "title": "Lovely Hotel at a reasonable price", "helpfulness": 2, "user": "Jeewiz", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16164491}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We had a room with a canal view and it was clean and comfortable and for amsterdam was quite spacious. The bathroom was also quite large and again was immaculate.", "title": "A delightful experience", "helpfulness": 1, "user": "cocas", "date": "May 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 15810645, "likes": {"liked": "— The location and the friendly staff", "disliked": "— Probably the size of some rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Hotel Estherea was a delight! We so enjoyed it, that my children groaned about leaving. First, it has a lovely and welcoming public area with warm lighting, wood panels, and leather sofas. It also has a small bar and a library-- to top it off, there is 24 hour a day hot chocolate and coffee available, and the hotel puts out pastries, cookies and candy. This was a big hit with the kids, and they would look forward to return from cool, wet sight-seeing to sit with us and sip cocoa! The rooms were comfortable and tastefully decorated, and the bathrooms spacious and well equipped. Photos do not capture how lovely it is. We will definitely return. What a delightful place!", "title": "Elegant but comfortable", "helpfulness": 2, "user": "FamilyTravelPlanner", "date": "April 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14979176, "likes": {"liked": "— The rooms and the public areas were so warm and welcoming", "disliked": "— There is nothing I didn't like about it"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Have just returned from a 3 night stay at the Hotel Estherea.", "title": "loved the decor", "helpfulness": 1, "user": "Nick W", "date": "April 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14873538, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We were delighted with the hotel. The location is very attractive being on one of the cannalls (Single) and is central so many of the sights are within walking distance.", "title": "Bloomin' great", "helpfulness": 3, "user": "Langton_Traveller", "date": "April 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14853152, "likes": {"liked": "— Comfortable public rooms and bar to enjoy waitng for rain to stop!", "disliked": "— No real gripes."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The decor is fab if not a bit over the top with dark reds velvet, tassels and chandeliers everywhere.", "title": "Hotel Estherea", "user": "LoLoChicago", "date": "April 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 14815550}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Staff are helpfull and polite and the rooms are comfortable (we were on the 4th floor with a stunning cannal view).", "title": "Beautiful hotel and I'm not easily pleased", "helpfulness": 1, "user": "shopaholicchocaholic", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14694317, "likes": {"liked": "— The ambience", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "There are definitely some great things about the hotel - we were very grateful to be given a room immediately after arriving at the hotel several hours before scheduled check-in. The staff were efficient and polite, the free fruit and hot drinks most welcome and the location is great. However - as previous reviewers have mentioned - we often found the room to be cold, this wasn't helped by the fact that the cleaners left the window open each day after cleaning (even though it was snowing outside!)and one of the radiators wasn't working. Our room was located next to the lift and this combined with the thin walls meant that we were disturbed by noise from lift mechanism each time the lift was used. We didn't complain as our break was only for a few nights and we didn't spend much time in our room but given the choice I wouldn't stay in that particular room again!", "title": "A little disappointed but not a bad hotel", "helpfulness": 4, "user": "Anon0", "date": "March 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4629823}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "What is not to like? My wife and I have been to Amsterdam twice--each time staryed at this wonderful small hotel. We already have reservations for june 13/14 this year. The location is superior. We are not the DAM square crowd---we like the relaxed atmosphere---there is enough fun a good restaurants for us--two fine pubs near by. We found the management and employees friendly and helpful at all times. We travel in Europe quite often and look for hotels like Estheria---small family run fine hotels---we have developed our own list and frrequent them when possible. Estheria is great.", "title": "Estheria--my home in Amsterdam", "helpfulness": 5, "user": "domer65", "date": "March 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4629013}, {"rating": 5.0, "title": "luxury at an affordable price", "text": "we have just returned from a 4 night stay. Our room although a bit on the small side, had a canal view which made up for the room size. The bed has to be one of the most comfortable hotel beds I have ever slept in, with crisp clean white sheets. The hotel was very clean, it has been polished to perfection. The free coffee, tea etc was a real bonus.The hotel is in the best location for exploring Amsterdam. We have been to Amsterdam on numerous occasions and have stayed in many different classes and types of hotels,always trying to find one that is located centrally, that has a good ambiance, that is clean, well looked after with attentive staff. We have found it with the Estherea - we will not stay anywhere else.", "helpfulness": 14, "user": "carsdeb", "date": "March 17, 2006", "id": 4628220}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "ps try the all you can eat ribs at the sing singel pub, turn right when you leave the hotel and keep walking you will find the pub on the right approx 200 yds.", "title": "Reception staff and cold room let it down", "helpfulness": 12, "user": "EdCole", "date": "March 6, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4585993}, {"rating": 5.0, "title": "Couldn't have been happier with the Estherea", "text": "we were asked to pay upfront plus a €70 deposit by a rude reception man because we did not have our cradit card. When we got back to the hotel that night the room was freezing. The night porter was on and said that there had been a few complaint and that he will get it addressed in the morning. The next day when i spoke to the same reception guy he said there was no problem and that i needed to turn them on myself. I have never heard of a hotel room that you have to turn on the radiator yourself. So 1 turned the radiator knob to a different position and when we came back that night the room was still freezing. We were leaving the next day and all we struggled to get an apology out of them. So basically was not impressed with the staff. Location was great and the place was nice and clean. Would not pay good money to stay there again.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 5, 2006", "id": 4584587}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Lovely hotel! Our double room was small with no canal view. I requested one, but no rooms were available. Still, room was nice and cosy and the bed absolutely fab! Bathroom was also small, but again nice and clean. Free tea,coffee and hot chocolate with cakes in lobby! Location is central but nice and quiet! Overall we were very pleased with our stay.", "title": "Lovely hotel", "helpfulness": 1, "user": "goldma", "date": "October 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10322470, "likes": {"liked": "— room cosy - bed excellent", "disliked": "— no view"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Tip - If you like tea/coffee in your room without going downstairs, get a travel kettle with you, very handy! We never travel without it:)", "title": "Simply Perfect!!", "user": "BlakeNewYork", "date": "October 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10297271, "likes": {"liked": "— Charm"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Perfect hotel in a perfect location. Charming, beautiful and personal. Loved everything about this hotel!!", "title": "Fine but very small rooms", "helpfulness": 2, "user": "fkls", "date": "October 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10250552, "likes": {"liked": "— Breakfast, LObby", "disliked": "— Very small Rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Nice small Hotel with perfect position to explore Amsterdam but expensive with very small rooms", "title": "great hotel", "helpfulness": 2, "user": "steveski", "date": "October 21, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10200509, "likes": {"liked": "— comfortable bed", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Lobby, breakfast hall, library (9/10)", "title": "What a great hotel....!", "helpfulness": 3, "user": "AnaMo", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10089914, "likes": {"liked": "— The free coffee & tea bar 24/7", "disliked": "— Pay for internet"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "After weeks of research on every internet side imaginable I found this hotel and had a good feeling, so I booked it. My wife and I were immediately excited as soon as we stepped into the hotel. The decor is very classy and has an old world feel. The people that work there are super friendly, helpful and will do anything they can to help you find or get somewhere. The room was a suite with a four poster bed overlooking the canal. it was perfect. The bed was comfortable too. Every morning and night there was always complimentary fruit or cookies and always fresh coffee or hot chocolate. My wife and i travel a lot and try to get a lot of value for the dollar. We would definitely stay here again.", "title": "STAY HERE! YOU WILL NOT BE DISSAPOINTED!!", "user": "meswender", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46204195}, {"rating": 2.0, "title": "I must have stayed in a different room", "text": "I carefully chose this hotel based on Tripadvisor reviews and other sources. I was quite disappointed (for the first time with Tripadvisor). We chose a canal view deluxe room based on other posts. I booked on their web site and paid full price, so I wasn't being \"punished\". The room (410) was quite plain, two small chairs and a small desk. You need to leave the bathroom to towel off. A shallow closet (too shallow for hangers to hang perpendicular to the wall) and no drawers at all. Bed and bedding adequate at best. This place is 2.5 stars - two for the room and an extra.5 for the lobby.", "user": "jock b", "date": "October 4, 2009", "id": 45826902}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled solo", "text": "I stayed on my own for one night at Hotel Estherea prior to joining up with a group tour. I actually had changed my hotel reservation about a week in advance of the trip after reading a recent string of negative reviews on Tripadvisor of the hotel that I had previously reserved. I was so pleased that I decided at the last minute to change to the Hotel Estherea instead. I arrived at 11am following my arrival on the redeye flight from the US, and my room was ready even though it was well before the designated check-in time. The room was small but very pretty, clean, and the bed was very comfortable. The location was great- centrally located to many of the tourist areas, just a few minutes walk to Dam Square, yet in a nice quiet neightborhood on the Singel Canal. My only disappointment was that I only could spend one night.", "title": "Lovely Hotel", "user": "hmmsbrown", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45810396}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "The hotel was great except for the fact that the Wi-Fi was not free - it cost 10 Euro per night, PER DEVICE. I was travelling with my wife, and we both have laptops, and we both have iPhones, so that meant an extra €80 for a 2-night stay (O2 Ireland charges HUGE data roaming rates, so the €10 per day Wi-Fi fee was unfortunately still cheaper than paying the roaming charges on the iPhones). I am just frustrated when I go to a four star hotel, pay four-star rates, and then get soaked for the Internet access. Someone needs to tell the hotel management that everyone - and I mean everyone - uses Wi-Fi these days, and it should not be an \"extra\".", "title": "Warning - No Free Wi-Fi", "helpfulness": 1, "user": "EuroYankee", "date": "October 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 45644340}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This is not a hotel that I would recomend to my worst enemy. Unfriendly staf that left us waiting for an hour (!) when checking in without explenation. The room was dirty, the bed broken (!) and there where blood stains on the sheets....we left of course after complaining. The staf refused to listned and charged us for the room...never been treated this way in a hotel before.", "title": "Unfriendly staf dirty room", "helpfulness": 1, "user": "Hanna100", "date": "September 29, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 45373736}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This was our fourth visit to the Esterea. While it is a lovely hotel and ideally situated, we found that there were a few things that should have been better in a 4 star hotel.", "title": "A few niggles this time", "helpfulness": 1, "user": "Traveller from UK", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 135003802}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Firstly the bar/lounge/library areas were always cold due to the fierce air conditioning that was on constantly despite the none too warm and wet weather outside. We felt that in the circumstances, it could have been turned down as it was quite unpleasant to sit in these areas.", "title": "No Hotel More Beautiful", "helpfulness": 1, "user": "SNAW2L8", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134930525}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Breakfast had a superb choice of food. The dining room is plush but the tables are tiny with very little room to eat on. All the plates are dinner plate size and we felt way too big for the size of the tables, especially is you only wanted to eat a piece of toast! Used plates/bowls were not cleared from the tables and we had to pile them up on one side, which left us even less room to eat. The waiting staff at breakfast were conspicuous by their absence.", "title": "As excellent as expected !", "helpfulness": 1, "user": "uphnguyen", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134864848}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The pillows we had in our room were so soft that we found them impossible to sleep on. We asked for more but they were exactly the same. Perhaps a selection of soft and hard pillows would be more appropriate? Also, more than one bath towel and one hand towel per guest would have been appreciated.", "title": "Great stay", "user": "louisp03 p", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134787348}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "These were just small things but took the shine off our visit as they constantly niggled us.", "title": "A Wonderful Hotel", "user": "pickering4", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134732178}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We stayed at the hotel for 3 nights. The rooms were larger than expected and extremely comfortable. There are great facilities like free tea, coffee and hot chocolate. Very comfortable foyer with 2 areas with large tables for business meetings.", "title": "Great hotel", "user": "gregor20", "date": "July 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17562895}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Staff was helpful and courteous. Overall, highly recommended.", "title": "Wonderful Stay Summer 2008", "helpfulness": 1, "user": "Kizzi32", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17186051, "likes": {"liked": "— decor, location and service", "disliked": "— nothing! ..... maybe for the future they could consider tea and coffee making facilities in room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Had a wonderful stay at the Hotel Estherea in June 2008.", "title": "Great Hotel in a Nice Neighborhood", "user": "fmcgillin", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17093644, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "During our stay at the hotel we had a lovely room overlooking the canal on the 5th floor. The decor was luxurious, the bed exceptionally comfy, flat screen TV, airconditioning. The bathroom was nice and roomy with two large twin sinks and a huge bath! There is free tea and coffee next to reception, it would have been nice to have this option in the room, but hey you carn't have everything!", "title": "Perfect Location!!!", "user": "CaliforniaLuv2travel", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17018544}, {"rating": 4.0, "title": "Comfortable but Costly", "text": "The reception rooms, bar and library in the hotel are nicely decorated and make a nice relaxation area. The breakfast is European buffet style and the coffee excellent, I would highly surprised if someone could not find something they liked there as it was well stocked and they had a good choice, and they included some good healthy option like smoothies which made a nice change.", "helpfulness": 1, "user": "sherek", "date": "June 13, 2008", "id": 16896888}, {"rating": 5.0, "stay_parameters": "Stayed January 2007", "text": "I think that this hotel show the best correlation with Amsterdam.", "title": "Romantic and cozy hotel", "user": "Forsait1979", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 45365583}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "It’s very compact and cozy. It is located in the foot availability to central square/area of Amsterdam and other central sights (including Van Gogh's museum).", "title": "Fabulous Stay", "user": "twodogstravel", "date": "September 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43920964}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Numbers very small, but modern enough, TV accepts many channels.", "title": "Elegant and romantic", "helpfulness": 1, "user": "OsloSigne", "date": "September 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 43623293}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The excellent first floor from the general drawing room, it’s beautiful aquarium, ancient books.", "title": "perfect position,clean and very comfortable and beautifully decorated", "user": "MrKCUk", "date": "September 21, 2009", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "rooms": 5.0}, "id": 43405348}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "It’s very tasty breakfast with very various components – both meat, and milky, and dessert food.", "title": "Clean, comfortable, accommodating, beautiful and a good value as well.", "helpfulness": 1, "user": "NonUnTurista", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41279357}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Amsterdam"}, "stars": 4, "variance": {"poor": 28, "average": 97, "very good": 493, "terrible": 20, "excellent": 1143}, "aka": "Estherea Hotel Amsterdam", "slim_ranking": 0.0470588235294, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Located in the heart of the city, Hotel Estherea is housed in a row of historic buildings on the major canal. Behind the 17th century façade, guests find a warm welcome in comfortable surroundings. With its woolen carpets, crystal chandeliers and sumptuous furniture, the hotel is an oasis of tranquility in the middle of the bustling city.The Estherea first opened its doors in the 1940s. this family business is currently run by the third generation. Although the hotel’s comforts and facilities have been brought up to date over the past sixty years, the concept of personal service and attention remains unchanged. All 92 rooms have been recently renovated and are all accessible by elevator. Each room has its own unique character: a wonderful place to unwind a day of exploring the city."}