{"user_rating": 4.5, "review_count": 382, "name": "Hotel Everest", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "definitely value for money, with a friendly atmosphere, helpful staff, prime location and a decent rooftop restaurant with amazing views. Hotel Everest definitely deserves all the positive reviews it has received thus far.", "title": "Lives up to previous reviews", "user": "jhonti", "date": "August 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137181032}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "I am happy to be here to.knoe.this.kinf.hotel.room.are very clean and.cheap.good people good.food i.will.come.back.again.the view.from.roof.top.is.amazing very.quite i stay hrre 4 night and.felt like home thank you", "title": "Great hostel", "user": "zekelaszlo", "date": "August 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 137129496}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "Laszlo", "title": "Solo Traveler, got sick-staff very helpful", "user": "380sunny009", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 136959319}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "This hotel was clean, comfortable, and very hospitable. I meant to stay for only three nights, but got food poisoning on the day I had to leave. I was physically exhausted, so traveling was not possible for me that day. I had to leave the room I was staying at for another couple who booked it, but the son was extremely nice and let me stay in a different room to rest for the day and night. He brought me tea, lime soda, and water, and his whole staff was very helpful and took care of me the entire day. As a solo female traveler, I felt very safe and well taken care of. I was treated superbly by the staff, who knew I was sick and always made sure that I was okay.", "title": "Great place to stay in Pushkar!", "user": "fifi_kel", "date": "August 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136877122}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The rooftop restaurant is very relaxing, with a beautiful view of Pushkar, and the food is delicious as well (I really enjoyed their fruit muesli).", "title": "Great place - clean, friendly, well run, well placed.", "user": "Gareth W", "date": "August 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 136541004}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Excellent choice in Pushkar. The rooms are very clean and all of the windows are covered with mosquito nets. Hot water daily (not that u need it).", "title": "Great Option!", "user": "charlenedj", "date": "October 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143606438}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Rooftop restaurant was perfect for chilling out and the view over Pushkar is stunning. Sunsets from this rooftop are some of the best we've seen in our 7 week stay in India. They also have a pet tortoise on the roof and monkeys visit on a daily basis.", "title": "Roof top notch", "user": "Mister M", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 142943266}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We initially booked 2 nights at the everest and ended up staying 6. We booked thro HostelBookers and the rate was quite a bit more than the rate we'd have got had we contacted them directly. Luckily the manager charged us their basic rate which was 450 rupees a night for a double room for every night we stayed.", "title": "Excellent rooftop restaurant", "user": "lovingindia", "date": "October 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142373462}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "The Everest is situated in the back lanes and although they're traffic free there are still plenty of cows and motorbikes around so those small lanes can get a bit crowded but then this is the case for mose accommodation in Pushkar. There are also frequent power outages (every day) so make sure you have a torch for walking back.", "title": "A colourful hotel full of smiles and central to everything.", "user": "Fondofferns", "date": "October 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142260799}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Free Internet access in rooms and rooftop was a huge bonus.", "title": "Best all-rounder in town.", "user": "Alibooboo", "date": "October 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 142107571}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Great location and clean rooms with plenty of character. The staff were extremely helpful with anything you needed. So much so that when I clumsily managed to step in some dung one of the staff offered to help me clean my shoe. The owner of the hotel took care to tell us if we were getting ripped off and recommended Yogi's guest house in Jodphur which I too would strongly recommend as well as hotel Everest.", "title": "Friendly family run hotel", "user": "holygoalie", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141239262}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "The friendliest and most efficient hotel in all Rajasthan. The best location, the best accomadation and the best cook, make this the best hotel in Pushkar, what ever your budget.. Bunty and his father will welcome you and offer the best free advice and the wisest council. Everyone is welcome at the cleanest and best-run hotel you could hope for.................", "title": "Best value and service in Pushkar", "user": "theodoridi", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141195065}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Such a friendly helpful staff!! The hotel is also beautiful and at a great price. It's right in the center of pushkar too, so super close to all shops, restaurants and sights. The restaurant on the roof is also super awesome! Great view of the city :)", "title": "Relaxation in the center of pushkar", "user": "kjparker", "date": "September 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 140979215}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed here for 3 nights in September 2012. This Hotel is a bit of the main street but in less than 5 minutes walking distance through a lifely neighbourhood to the main road and the lake. So it's a good place to relax and the roof terrace was a nice place to enjoy breakfast on.", "title": "Nice and welcoming place", "user": "Barbara_Indien_12", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140738369}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "The owner, his father (including the little cute dog) and the staff were really nice and helpful and answered all our questions and could help us. The room was big, light and clean compared to other hotels. So we really recommend staying at Hotel Everest in Pushkar!", "title": "Great family hotel with a lovely folks!", "user": "Tiki2384", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 140662564}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "If you are looking for a clean, colourful and warm place to stay in Pushkar, look no further. Everest Hotel was definitely one of the best places we stayed in India so far. That's why we ended up staying 7 nights instead of 4. The staff is so friendly and helpful, and always smiling, or singing :) Plus, Bundy picked us up from the bus station to save us from all the touts that jumped on us on arrival - and that although we never confirmed booking (we only made an enquiry for rooms). He also organised our bus to Bikaner, took us up to the bus station and waited with us so we hop on the right bus, which was really helpful. The rooms are simple, but very clean, and have lots of storage space, so absolutely good for the price. Another big plus is the rooftop terrace, where you get amazing views over the city, the surrounding hills and part of the holy lake. It's a great place to chill out, especially in the morning. The Wifi (free) is working really well up there too. And there's a little turtoise living up there! The location was perfect for us. You're far enough from the main bazaar to escape all the hustle and bustle from all the pilgrims and their morning prayers (they start at 5.30am!), but still it's only a few minutes walk to get there. The bus station is only a 5 minutes walk as well, and there's a beautiful little hill behind there where you can walk up (within 20 minutes) and watch the sunrise. All in all, we had an amazing time there, and will definitely be back in November before we fly back home :)", "title": "Best place to stay in Pushkar!", "helpfulness": 1, "user": "ClaudiTim", "date": "September 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140646915}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Had a great stay here for 2 nights in August. The rooms (we had 2 doubles) were spotless, with comfy beds and a/c. The hotel is an easy walk from the lake and main bazaar and has a good rooftop for chilling out, they will also pick you up from the bus stand when you arrive. The food was great, good prices and really helpful restaurant staff (we recommend the tomato garlic pasta and amazing homemade chips if you want a change from curry!). I was recommended to stay here by a friend and would definitely recommend it to others.", "title": "Great stay!", "user": "Esther Z", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139272129}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "we got to the Hotel because it was recommended in lonely planet.", "title": "Best anniversary in the world!", "user": "hila r", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138674707}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "we got there on our first year anniversary and we got the room with the \"maharajah\" bed which was amazing! the hospitality was super nice and it just felt like home away from home. we planed to stay 2 nights.. ended up 4!", "title": "book in advance !!", "user": "LondonTomuk", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137523224}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "it was definitely the best room we had in our 2 month visit to India (except for the beach hut in Palolem). Extra clean ,super comfy bed, beautiful wall and ceiling paintings, excellent rooftop and real friendly employs..", "title": "Average", "user": "Dane H", "date": "August 16, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 137319015}], "location": {"country": "India", "region": "Rajasthan", "continent": "Asia", "city": "Pushkar"}, "variance": {"poor": 3, "average": 14, "very good": 87, "terrible": 5, "excellent": 273}, "slim_ranking": 0.0689655172414, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "We are a three story hotel with a scenic rooftop restaurant. From our roof you can see the lake and also enjoy a evening flying kites.Our central location brings guests close to the main shopping lane, a stones throw away from the bus station and the lake.and you can entire all pushkar from our beautiful cafe as well"}