{"user_rating": 4.0, "review_count": 154, "name": "Hotel Villa Liana", "reviews": [{"rating": 4.0, "title": "comfortable quiet liana", "text": "Read previous reviews and a bit apprehensive. Stayed at Hotel Liana for 3-day break. The Hotel was quiet, very comfortable, and clean. Room was a little dated in looks but serviceable with T.V - no AC although cold fan to ease August heat (sweltering 32 C). Great gardens to relax in (though plenty of mosquito's - beware! Was bitten lots. All staff warm and friendly. Although location a little remote from centre of Florence buses easily navigatable and 'hop-on hop-off' tourist bus at end of road with ticket valid for full 24 hours.(pay on bus). Came in from Pisa Airport via train to Florence Train Station then taxi from station to Hotel (7 euro's) - walk will take approx 30 mins. Overall opinion - loved Florence - Great Hotel.", "helpfulness": 5, "user": "genesta", "date": "August 31, 2003", "id": 1270122}, {"rating": 4.0, "title": "Liana a good choice", "text": "Hotel Liana is a fifteen minute walk from the Duomo, but the price, the staff and the room made it worth the extra walk with my group of eleven college students. I shared a garden room with twin beds. Lots of light. Nice and quiet, unlike the area in the city with many of the three star and two star hotels. The shower in my room was one of the hand-held European jobs with no shower curtain, but that was survivable and even comical. The showers in some of the other rooms were American style. A note of caution, ask for a room upstairs or in the back, behind the desk. They tried to put some students in a first floor room in the front, but I made a fuss because the room smelled like raw sewage. I know I am not the only one to have complained about this room. I had read a review before I went that mentioned the same problem. Sounds like a problem with city sewage, but the room would not have been bearable. As a result they put four students in a suite instead of two twin rooms. It was not what I wanted, but a minor inconvenience. Simone and Laertes were especially nice hosts.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 25, 2003", "id": 923866}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Just returned from fabulous trip to Tusacny.", "title": "Fabulous florence", "user": "Lu_J", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5942796, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Staff very helpful and hotel just 2 minutes walk from park which was brillant for our two small children to run around prior walking to all the sites.", "title": "excellant location with very helpfull staff", "helpfulness": 2, "user": "Youngoggy", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5905252, "likes": {"liked": "— Traditional Italian Hotel with relaxed atmosphere", "disliked": "— Car park difficult to find/ not well sign posted"}}, {"rating": 4.0, "title": "A great place - depending on which room you're allocated", "text": "Room excellent (downstairs) so easy to get pushcair in and out.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "December 3, 2004", "id": 2861137}, {"rating": 4.0, "title": "Great atmosphere", "text": "Four beds plus cot and still plenty of room.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 5, 2004", "id": 2418158}, {"rating": 4.0, "title": "Great place to stay!", "text": "Breakfasts were good - but not always clean table ready.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 24, 2004", "id": 1741955}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "I just got back from a week in Italy, and received a very pleasant surprise at Hotel Liana. The room was very spacious with extremely high frescoed ceilings. The furnishing was very tasteful, and the bathroom was recently remodeled. The hotel has a romantic atmosphere, and is in a quiet, but yet somewhat central location. The breakfast was excellent and plentiful. Overall, you will receive a great value for your money.", "title": "A Very Pleasant Surprise in Florence", "helpfulness": 1, "user": "CosmosTraveller", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 12475753, "likes": {"liked": "— The atmosphere", "disliked": "— Lack of an elevator"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed at the hotel Liana on my birthday. It was supposed to be a special treat, but it turned out to be a special nightmare.", "title": "A Terible Experience on my birthday", "helpfulness": 1, "user": "MaxineSF", "date": "December 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 11904084, "likes": {"liked": "— Location, the building itself", "disliked": "— One could not rest in the room, bad smell, cramped bathroom, very expensive for the low quality"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We were given a \"garden\" room on the ground floor. Its connection to the garden was that it faced a garden wall. The room was very basic and the furniture arrangement totally defied common sense. Our bathroom was only accessible after we removed the desk chair. The bathroom was very basic and very small, ones elbows were in danger of getting abbreviated when brushing hair.", "title": "Villa Liana - pleasant accomodations in Florence", "helpfulness": 1, "user": "dickensdad", "date": "October 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10403705}, {"rating": 1.0, "stay_parameters": "Stayed September 2006", "text": "There was a stench in the room when we arrived, but we attributed it to the city problems. It turned out that the problem was a stench from a toilet across the hall. We could not get any sleep as the toilet was used frequently during the night and the door of that toilet was slammed each time. The lack of any sound proofing made it appear as if someone was right in our room.", "title": "Terrible Smell and Poor Service", "helpfulness": 3, "user": "Duckwise", "date": "January 4, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 6552403}, {"rating": 2.0, "title": "shabby 3 star hotel", "text": "To make a reservation we first contacted the hotel via e-mail to make inquiries regarding availability and prices. We were offered a room at a rate of 150 euro a night. We made a final reservation by phone because we did not want to give our credit card number via e-mail.", "helpfulness": 1, "user": "fiddlegal", "date": "November 28, 2006", "id": 6231104}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 18, "very good": 87, "terrible": 5, "excellent": 34}, "aka": "Liana Hotel Florence", "slim_ranking": 0.41341991342, "description": "Sojourning at Hotel Villa Liana means staying in an oasis of tranquility even if you are staying in the historical center of Florence. Hotel Villa Liana, antique aristocratic villa from the XIX century and former consulate of the British Empire, is situated in a residential neighborhood a few minutes walk from the Santa Croce square, the Florence Dome and Galleria dell’AccademiaThe Jewish synagogue is closed to the Hotel."}