{"user_rating": 4.5, "review_count": 208, "name": "Hotel Caprice", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Chose to stay in the Alps for a little atmosphere, great location. Highly recommend getting a room facing the Alps, nothing like waking up and opening your curtains to the alps. The restaurant was a little pricey in the hotel, but there are several others in Wengen, inclding a great little pizza place. There's also a grocery store a block from this hotel. The manager was exteremely accomodating, even driving my luggage to the train station for me, only 200-300 feet, but still nice. This location makes travelling up the alps, like the Jungfrau, very quick and easy.", "title": "Great all-around experience", "user": "Herk_Driver", "date": "February 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4452084}, {"rating": 5.0, "title": "We truly stumbled upon a treasure", "text": "Thank you for your hospitality. We truly stumbled upon a treasure.", "user": "A TripAdvisor user", "date": "February 7, 2006", "id": 4440948}, {"rating": 5.0, "title": "World class design/boutique hotel experience!", "text": "We were looking for a pleasant site to stay and we have found a magic place. Each steps in the Caprice hôtel is an unbelievable pleasure. The warmth and the good taste of the place has made us feel wellcome the minute we walked in.", "user": "A TripAdvisor user", "date": "January 28, 2006", "id": 4393496}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 4, "variance": {"poor": 10, "average": 14, "very good": 33, "terrible": 1, "excellent": 150}, "aka": "Caprice Hotel Wengen", "slim_ranking": 0.428571428571, "description": "The award winning, 4-star, Hotel Caprice is privately owned and a proud member of Small Luxury Hotels of the World group (since 2007). A luxury hotel constructed in charming Swiss chalet style, Hotel Caprice boasts lavishly appointed, spacious rooms with natural wood decor and large picture windows. Most rooms have incredible south-facing balconies with spectacular views of the Jungfrau massif and Lauterbrunnen valley. The fine dining restaurant at Hotel Caprice is renowned for its elegant style and delicious gourmet cuisine served with regional and International influences. Hotel Caprice is conveniently located in Wengen enjoying a prime position for easy access to the slopes in the morning and 'ski-in' status for guests returning at the end of the day. Our vibrant bar and sun terrace areas are perfect for apres ski, whilst our cosy lounge, with open log fire, welcomes guests looking for a more relaxed environment. We also offer a massage service and a FREE Finnish sauna! With over 200km of downhill ski runs and 500km of hiking trails on its doorstep, Hotel Caprice is an excellent choice for both winter sports and summer adventure holidays. At Hotel Caprice we strive to deliver excellence in hospitality, accommodation and food standards with minimum impact on the environment and our beautiful surroundings. Hotel Caprice is the proud recipient of the TripAdvisor \"Certificate of Excellence\" for 2011."}