{"user_rating": 2.5, "review_count": 7261, "name": "Hotel Pennsylvania New York", "reviews": [{"rating": 1.0, "title": "Hell on Earth", "text": "When we got to our hotel we were looking forward to flopping down on the bed flicking on the tv and getting some sleep before going out to get some take away and start our shopping holiday by meandering down some potential streets.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 29, 2005", "id": 4148915}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Well, it went rather differently to that. We got to our room with beds that just had blankets and sheets no duvets. The room was dusty and looked more looked miserable - the tv was unplugged and i suspect it didn't work, the beds were rickety and looked over 40 years old the walls were covered with unidentifiable stains. and the bathroom!! rust colours all over the ceiling, grime marks galour, the toilet looked like it was open to the general public. My friend became upset and so went down to front desk who insisted that this was a standard room. My friend mentioned that there had been talk of refurbishment on the hotels website, this comment was ignored. they gave us another key to another room. It was better, except the maid had clearly not had a chance to clean it. So back down we went. They gave us yet another key. The room, thankfully was better and thankfully the room had been cleaned. This room was still questionable - I had to buy a can of cleaning fluid which I sprayed every morning on the bath and in the toilet on the sink. On my last day there I met a guy in the foyer and we got onto the subject of the hotel. He told me that the first room they allocated him had been disgusting, there were beds with no duvets, dust and rust everywhere and there had been blood and hair on one of the beds. he said they'd allocated him a second room it was better but hadn't been cleaned then he had gone down and demanded and third and a credit card refund. People be warned - I see there are people on here saying the hotel is not that bad - I've stayed in hostels all over the world - this is a HOTEL and was one of the worst experiences ever - thankfully this was not the first time I stayed in NYC so I do have good memories of the place.", "title": "3rd time staying here this year", "helpfulness": 8, "user": "cookie2crumb", "date": "November 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 4148264}, {"rating": 1.0, "title": "A dump", "text": "This was the third time I have stayed at the Pennsylvania this year. Please do not be put off by other reviews. It may not be the ritz, but you get an excellent location, clean rooms and friendly staff for affordable prices! I will definitely stay here again when I go back to NYC!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 27, 2005", "id": 4147002}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "I only wish I had read the reviews on this Hotel before I booked. The first room they gave us was a nightmare paint peeling from the walls, water stains on the ceiling, handles on the dresser were broken off. My wife went down to the lobby to request another room which they gave us and was somewhat better with only the paint peeling from the ceiling and the shower fixture was barely hanging on. If I could have gotten out of staying here I definately would have.", "title": "Had a great stay, don't be put off!!", "helpfulness": 8, "user": "Ceri99_uk", "date": "November 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4146244}, {"rating": 1.0, "title": "Thanks for the memories...none of them good.", "text": "I know the idea of the reviews is to give people an honest picture of the hotel but these reviews had me really worried!!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "November 25, 2005", "id": 4143627}, {"rating": 1.0, "stay_parameters": "Stayed November 2004", "text": "I would never recommend this place. It's worse than terrible. Completely filthy, there was blood in the bathtub. Not to mention the shower was so small that we couldn't even stand up straight to shower (after they came and cleaned the blood). Towels are worn and thin. Floors are worn and dirty. Everything was disgusting. Never, EVER, EVER again.", "title": "Atrocious", "helpfulness": 4, "user": "KPop", "date": "December 12, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4234681}, {"rating": 1.0, "title": "Don't book this hotel", "text": "Very important to warn people to book this hotel. I´ve never been in such a terrble hotel. The rooms are dirty and cold.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 11, 2005", "id": 4232070}, {"rating": 4.0, "title": "perfect", "text": "i stayed at this hotel with my boyfriend in early november and we wanted every thing to be perfect. I had hurd that the hotel had reputation for cockroches but i didn't see any, (or any other bugs). On are arrival we were upgraded as a gesture of good will, we had a excellent veiw of the empire state building from are room. The room could of done with a lick of paint but it was clean and very comfortable and the fridge was very handy. The staff we friendly and the location excellent, round the corner from everything!i will be staying at this hotel again in april and i recomend it to everyone.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 11, 2005", "id": 4231771}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "I have just returned from a 4 night stay in this hotel. I had read some reviews prior to going to New York and thought I was prepared for the state of the hotel but was not. The place is totally neglected and shabby. It is crying out for a lick of paint and a good carpet shampoo. Thankfully the room we were allocated was not too bad. Again it needed redecorating and there was rubbish left over from a previous guest but thankfully the bedding and towels were clean and the bathroom although the fixtures and fittings had seen better days it was functional.", "title": "Hotel Disappointment", "helpfulness": 3, "user": "OWIE", "date": "December 9, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 4228484}, {"rating": 1.0, "title": "Do not stay in this Hotel!!", "text": "By New York standards it is not the best hotel to stay in if you are on a budget but it's location is ideal. However unless it undergoes serious redecoration and renovation I don't think I would rush to stay in it again.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 9, 2005", "id": 4222702}, {"rating": 1.0, "title": "\"The Hotel Nasty\"", "text": "Attended a convention in NYC in October, 2005.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 2, 2005", "id": 4158759}, {"rating": 3.0, "title": "What a surprise", "text": "By far the dirtiest hotel I've ever stayed in.", "helpfulness": 5, "user": "shielaIreland", "date": "December 1, 2005", "id": 4156922}, {"rating": 1.0, "title": "Perfect Location", "text": "Bathroom was not clean and moldy in corners. Toilet wasn't flushing. Dirty carpet and bed sheets.", "helpfulness": 7, "user": "Jue50", "date": "December 1, 2005", "id": 4156817}, {"rating": 1.0, "title": "Gross", "text": "The beds hadn't been moved in ages. Bent down to retreive some change under the bed and saw used q-tips, condoms, and moldy food.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 1, 2005", "id": 4156692}, {"rating": 2.0, "stay_parameters": "Stayed November 2005", "text": "We requested a room change, and after some inital reluctance, the hotel manager granted us a new room.", "title": "Cheap and slightly cheerful", "helpfulness": 2, "user": "macca1Uk", "date": "November 30, 2005", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 4153614}, {"rating": 3.0, "title": "It was fine!", "text": "After reading some terrible reviews over several months about this hotel and trying in vain to change it, we were pleasantly suprised when we were shown to our rooms (there were 9 of us!). Ok, it's all a bit tired and old, the doors are odd and it does need decorating but the beds are comfortable and sheets and towels are changed every day - new carpets in all 4 rooms - I really have to say that we had no complaints about the hotel at all and I don't believe that you could ask for a better location! It's not as bad some of the reviews make out - give it a try!!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "December 8, 2005", "id": 4219526}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "We have just returned from a 6 night break in New York and we stayed at the Hotel Pennsylvania.", "title": "Had a great time !", "helpfulness": 2, "user": "madmaxgirl", "date": "December 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4159474}, {"rating": 2.0, "stay_parameters": "Stayed November 2005", "text": "After reading the reviews on here we tried several times to change our hotel, as i'd just found out that I was pregnant but we were unsuccesful.. so we decided to just turn up at the hotel and see what state the room was in. We arrived at the hotel very tired after 2 flights and were suprised as there wasn't a queue to check in. Ok so the corridors look like something out of the Shining and the doors are strange, but we weren't bothered about that as long as the room was decent. We'd prepared ourselves for the worst and I can honestly say that we were really suprised. We stayed on the 14th floor and the rooms were old and did need redecorating.. but they were clean, tidy and comfortable. The bathroom was spotless and the maids came in the room every day to hoover and put new towels out. All the staff that we spoke to were very friendly and helpful. We didnt spend alot of time in the hotel.. after all, who goes to New York to stay in the hotel room ?. The hotel is in a great location.. we found it easy to get to all the sights and shops from this hotel. Your also very close to alot of places to eat.", "title": "Don't accept Room 697!!", "helpfulness": 4, "user": "mau083", "date": "December 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4159348}, {"rating": 1.0, "title": "Hotel Transylvania is more like it", "text": "If we ever visit New York again, i'd book this Hotel again without hesitation.", "helpfulness": 7, "user": "Amy M", "date": "December 2, 2005", "id": 4158928}, {"rating": 1.0, "title": "Nightmare, beware!!!!!", "text": "Room 697 has NO heating, and although the outside temperature was below freezing, a call to the maintenance engineer produced no action! Reception and Left Luggage staff were very helpful and friendly, and the position of this hotel is superb - in the centre of EVERYTHING, and one block from Macey's! Room equipped with hair dryer (we used ours as a rather ineffective mini fan heater!), ironing board and iron, plenty of clean towels, bed linen changed etc. - but a drink-making facility would have been welcome. A cavernously-huge hotel, famous in the 20s, 30s, 40s, but long overdue for a refurbishment. For a short stay, in the centre of NY when time is important, it's OK, but if visiting in the winter - check the heating in the room is working!!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 2, 2005", "id": 4158839}], "location": {"country": "United States", "city": "New York City"}, "stars": 2.5, "variance": {"poor": 1274, "average": 2261, "very good": 1356, "terrible": 2056, "excellent": 314}, "aka": "Hotel Pennsylvania", "slim_ranking": 0.848416289593, "detail_rating": {"service": 2.5, "cleanliness": 2.5, "value": 2.5, "sleep": 3.0, "rooms": 2.0, "location": 4.5}, "description": "A great location doesn't have to be out of reach. New York's Hotel Pennsylvania is in the heart of Midtown Manhattan, and our surprisingly affordable rates leave more money in your pocket to enjoy the city.Each day our guests hit the streets and arrive at fabulous New York City locales within minutes. Marvel at the Empire State Building, savor exciting Times Square and take in a Broadway show or, hop on the subway right by the hotel and head to one of NYC's diverse and exciting neighborhoods. Just steps away from Midtown's most popular attractions, and offering countless easy transportation options, New York's Hotel Pennsylvania puts you in the middle of the action."}