{"user_rating": 4.5, "review_count": 28, "name": "Hotel Hydra", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "just a wonderful hote complete with great service and attitude. stayed 3 nites. the view from our room was superb, the rooms very large and", "title": "beautiful spot", "helpfulness": 1, "user": "aurora1jwr", "date": "July 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133412598}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "decorated very nicely. Katerina went out of her way to be make our stay that much more pleasant!", "title": "Perfection in Hydra", "user": "TravelingTomato8", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133293089}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "After three stressful days of business in Athens, my two nights on Hydra were a gift - much in thanks to my wonderful experience at Hotel Hydra. As a very frequent traveler, I am what some might call....picky. And I was a little nervous after reading the reviews on tripadvisor - the unanimously glowing reviews seemed too good to be true. But I am pleased to add my glowing review to the mix - Hotel Hydra was just perfect. Katerina was so kind and hospitable, making me feel exceptionally welcome. Room 202 was wonderful - spotless, bright, tastefully appointed, comfortable bed and seating, great water pressure...and the view. that balcony is special. Breakfast was delicious and beautifully arranged. The stairs are no joke and in hindsight i should have had a donkey take my roller bag up to the hotel upon arrival, but the climb did not bother me for the rest of my time there. I walked up to the hotel 2-3 times a day and it wasn't terrible. And absolutely worth it for such a gem of a hotel (and the view!). I am convinced there is no better place to stay on Hydra and I can't wait to return.", "title": "wonderful stay", "user": "andreaki200", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131892950}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We spent one weekend at Hotel Hydra and absolutely loved it. The building itself is a perfect example of up to date Greek island style - fresh and luxurious in its simplicity. The location is convenient with a very nice view over town and port.", "title": "Wow - What a view", "helpfulness": 1, "user": "detraveler_7", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131357809}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Katerina, the host, on whom many here have commented, is very helpful indeed and goes out of her way to make her guests feel at home. I recommend Hotel Hydra without hesitation.", "title": "Fantastic Hotel and Even More Fantastic Host", "helpfulness": 8, "user": "aprico82", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115595266}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We booked for one night on our way back to Athens from Spetses. This small hotel had been highly recommended by friends. We had been warned of the many steep steps and when Katerina texted me to ask our expected arrival time, I asked her to book a donkey to carry our suitcases. Be aware that it is a fixed tariff on Hydra for donkey hire, expensive at 15 euros each way, but with three sets of baggage we could not have managed without it.", "title": "Island hopping", "helpfulness": 1, "user": "Quickie", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163891793}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We had a warm welcome on arrival and our large room with separate sitting room was lovely but quite expensive. The air conditioning was effective, and the TV had the usual English-speaking channels: CNN and BBC World News. The view across the harbour was amazing. The room was very clean, looked recently redecorated and to a maintained to a high standard. However the bathroom was quite small - shower cubicle but no bath..", "title": "Fabulous hotel on an enchanting island", "helpfulness": 1, "user": "Lars G", "date": "June 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162967268}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We opted to have breakfast in the little internal courtyard although we could have opted to have it in our room. It was a fairly simple continental breakfast; I disagree with others that breakfast is 'huge'. For dinner there are plenty of restaurants nearby at the same level on the hillside, including the aptly-named Sunset Restaurant. Katerina and her colleague were charming, spoke excellent English and were very helpful.", "title": "My wife loved it, I'm not so sure.", "helpfulness": 1, "user": "Phillip S", "date": "May 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 162564695}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "In summary, not cheap but very pleasant for couples on a short break. Steep steps at the hotel entrance and more stairs inside with no lift left me breathless on arrival despite being fit. Therefore difficult to access for anyone not reasonably fit - but then so is most of Hydra.", "title": "Unforgettable", "user": "KarineN", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160159573}, {"rating": 4.0, "title": "Perfect, modest but charming!", "text": "I stayed in Hotel Hydra in mid-May with a friend of mine for two nights. The experience was truly fantastic. This is for the following reasons:", "helpfulness": 5, "user": "mariospk", "date": "July 8, 2012", "id": 133783382}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Spent three days there in late June-what a treat! Yes you have to climb hundreds of steps but if you go to Hydra, where no motor vehicles are allowed you should know that already. The view is extremely rewarding- make sure you get a room with a view. Rooms are more like suites, very specious and with great amenities - the only thing lacking was a full body mirror. The real treasure is Katerina who runs this small hotel almost single handedly and is the most charming hostess you could wish for, as well as your personal info-point for all things Hydra! Highly recommended.", "title": "Best on the island", "helpfulness": 2, "user": "mariagThessaloniki", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 115383279}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We just spent 8 days at this quite charming hotel in Hydra. Sure, you have to climb steps, almost 150 steps to be precise! But this is Hydra. Either you never want to climb any steps and you sleep directly in the port , near the donkeys and the mass of tourists, or you walk up stairs! We did just that. The first day, it seemed a lot, but after 48 hrs we got accustomed to climbing back and forth 3-4 times a day just like the locals do! The decor is splendid. The beautiful soft colours of the wall and of the furniture but first you have to stop by the reception to meet the gem that directs this hotel Katerina Nikolaidou. Always smiling, always at your very needs. She offers breakfast served anywhere in the hotel (room, terrace and probably as you chat wit her at her desk)! at any time of the day. And we did have our breakfast till 1pm! Fresh and still hot pastries, fresh fruits and anything else that you care for and that she can offer you from her small cuisine. We stayed in a larger room for 3 days, facing the port of Hydra. Very large living room . Very nice bedroom. Bathroom large enough for an hotel like this. A/C and a small kitchenette. We were then moved to a slightly smaller room with a balcony...the room with a balcony that most people wanted! Smaller living room, same size bed room but larger bathroom with bath/shower sliding doors closing completely. We had a partially closing bath/shower in the first room, and too much water got on the floor, but a very minor problem.", "title": "Excellence in every aspects. Well worth the steps...but then you are in Hydra!", "helpfulness": 9, "user": "CarpeDiemX", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114567537}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "WiFi is free but they will have to change the capacity of their connection. On the second floor, you have to stay in the living room or else you lose the connection.", "title": "Nice but requires you to be fit to reach it!!!", "helpfulness": 2, "user": "MariKara", "date": "August 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 74948341}], "location": {"country": "Greece", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 7, "terrible": 0, "excellent": 20}, "slim_ranking": 0.217391304348, "description": "One and a half hours away from the port of Piraeus, “Hotel Hydra” underwent a huge refurbishment, reopening and it is already the V.I.P. destination. Tasteful and meeting high standards it is an addition to the island’s unique elegance and is in itself a reason for a trip to the island of Hydra, Greece."}