{"user_rating": 3.5, "review_count": 600, "name": "Hotel Alixares", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Perfect location for visiting the Alhambra. Entrance a short walk across the parking lot. Desk staff very helpful and speak english very well and the fact that they could reserve our Alhambra tickets was a big plus.", "title": "Perfect for the Alhambra", "helpfulness": 1, "user": "swissgirl_7", "date": "July 11, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 8102751, "likes": {"liked": "— Great location near the Alhambra", "disliked": "— Canteen atmosphere at breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Otherwise, the hotel is quite basic despite its 4 stars. Rooms and bathrooms a good size, buffet breakfast ok, bit of a canteen atmosphere - but quite honestly for the price we paid we were very happy. Wouldn't plan a longer stay though - too much coming and going and the pool area could definitely do with a bit of a tidy and better sun loungers - we had the 4* Riu Ferrara to compare with later on our trip. Hotel is more a 3 1/2*.", "title": "quiet on the south western side", "helpfulness": 3, "user": "typicalaussie", "date": "June 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8018821, "likes": {"liked": "— Quiet at night", "disliked": "— nothing.... clarinet player in next room left the next day."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "An excellent hotel and an obvious coach hub.Buffets three times a day at a reasonable price. There was a strange whining sound on the north east around room 231 which has been noted elsewhere but otherwise perfect. Walk down to the number 32 one euro fare to city centre or just sit on it for the round trip.Get your tickets for the Alhambra by phone before you leave home...see the web site selling them! There are plenty of seats in the Alhambra everywhere for the older walker.Take a bus from the airport then a taxi from the catherdral to the Alexaris. Take a taxi back to the airport from the hotel 30 E. Dont even think of dragging luggage up the hill! The only tiny disappointment was the Flamenco no castanets and a lot of beef making a lot of noise.Granada wonderful.Best value open top bus in bus terminal just below hotel where ticket lasts 24 hours and you hop on and off starts around 10.30. Dont forget to ask for pensionista rates over 65 everywhere..", "title": "If only they were all like this!", "helpfulness": 1, "user": "MarcoPolomint", "date": "June 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7936438, "likes": {"liked": "— It was all-round brilliant", "disliked": "— Some might find it too far from the city centre"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Ideal location for visiting the Alhambra which is about 5 minutes walk away. Also very convenient for the rest of Granada, due to the Number 32 bus, costing 1 Euro, that runs regularly from the city centre past the hotel. A very attractive hotel with excellent facilities and an above average buffet selection.", "title": "Great for the Alhambra", "helpfulness": 4, "user": "sunnysuffolk", "date": "June 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7729690, "likes": {"liked": "— Cleaniness and friendly staff", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Writing a positive review of a hotel is much harder than writing a negative one (See also our review of the Gran Hotel Lar in Seville.) It was a pleasure to stay here and we only wish we could have prolonged our visit. Staff were pleasant and helpful and we managed perfectly with our minimal Spanish!", "title": "Handy for the Alhambra", "user": "Doofer", "date": "May 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7713538, "likes": {"liked": "— Location", "disliked": "— Caters to coach tours"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The Hotel Alixares is in a perfect location for the Alhambra but that's about all. We only booked B&B but were advised that we could use the restaurant (as you would expect) and that also there was Room Service. We tried the room service option but no one could understand me!!!! Breakfast was quite unpleasant, the buffet lunch was ok and I can not comment on the dinner as when we went to enter we were told by the rather rude Maitre d to wait to the side as we were not in a 'Group'..... we didn't bother..... Instead we got the 'Not for the faint hearted' bus that runs from the Alhambra to the centre of Granada where we were able to get a great meal at one of the many restaurants. The room was adequate and clean. I would visit Granada again but would definately not stay at this hotel.", "title": "Great for Alhambra", "helpfulness": 3, "user": "Kristina2611", "date": "October 20, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5974940, "likes": {"liked": "— Clean rooms", "disliked": "— We were made to feel we were unimportant as we were not in a group."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Excellent position for alhambra - if you already have tickets great, but if not (like us) then it's up at 630am and the 2 minute walk to the queue (prob about 2 hours in queue) and then you get in. also walk into town to plaza nueva is very short downhill and then either walk up hill or get the €1 bus. hotel is clean, rooms are slightly smal, but you only sleep there!! excellent service and plenty of parking", "title": "Perfect for Alambra and rest of Granada", "helpfulness": 1, "user": "G.Evans", "date": "October 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5965604}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "It is a big hotel, used mainly for organized tours (which means loads of people in the halls, in the swimming pool, having breakfast, all checking in and all at the same time). The rooms are nice, the staff was amicable but often too busy assisting the tours, so you have to be lucky to call them at the right time.", "title": "Big Hotel, Bad Breakfast, Bad Location", "helpfulness": 1, "user": "Danilo P", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 5963987, "likes": {"liked": "— The swimming pool was pleasant", "disliked": "— The location"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "Breakfast was terrible - the worst of the 8 hotels we stayed on during our vacations last month. No fresh fruits (only canned stuff, in syrup), few options of food (breads, pastries, cheese, etc.), and bad coffee (made in a 50-gallon bucket, which might explain the low quality).", "title": "Terrible. Avoid at all costs.", "helpfulness": 6, "user": "DameMeditation", "date": "October 14, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5955689, "likes": {"liked": "— Closeness to Alhambra", "disliked": "— Humming noise in room which made it impossible to get a good night's sleep."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "As for location, it is really close to the Alhambra (actually, across the street). However, it is quite far from the center. In the evenings, there is absolutely nothing to do nearby, and unless you are willing to take a cab to the center and back, you'll be bored to the bone. Had I known this in advance, I'd have chosen a hotel closer to the city center, because it is much easier taking a bus to the Alhambra, during the day, than a cab in the evening to go to the bars and restaurants.", "title": "location , location, location!", "helpfulness": 3, "user": "VVB", "date": "October 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5907144, "likes": {"liked": "— location,", "disliked": "— cold pool"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Except that it did not show up on Tom Tom the location of this hotel was perfect for seeing the Alhambra. Large hotel, helpful staff, well equipped room, although we always had problems getting hot water at nighttime, good breakfast. Parking was in the Alhambra car park at reduced price.", "title": "best location ever for the Alhambra", "user": "exttravellers", "date": "February 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 56980544}, {"rating": 4.0, "stay_parameters": "Stayed December 2009", "text": "We stayed at this hotel while visiting the area to ski in the sierra nevada, unfortunately the weather was not suitable for skiing, however this hotel is in a fab location if you want to visit the alahambra palace which is outstanding. The hotel rooms are narrow but have adequate space and are very comfortable. The food in the hotel was very good with a lovely choice for breakfast and evening meal. It would benefit from more tables and chairs in the bar/lobby area and they definately need another member of staff on the bar as there was always a wait to be served. The wine is cheaper to buy in the restaurant than the bar which I found very odd but after the first night we bought our wine from the restaurant and then took it into the bar after dinner.", "title": "Fabulous Location for the Alahambra Palace", "helpfulness": 1, "user": "suzybabe36", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 53882183}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Its a lovely walk down into the centre of Granada and there is a choice of routes to take and it is easy to get the bus back up the hill to the hotel afterwards. Granada is a lovely city to visit with plenty to see and Calle Nava is not to be missed with its selection of tapas bars, order a small beer or wine and you are served with a free tapas great fun way to spend an afternoon!", "title": "Great breakfast too!", "user": "raegan131313", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53421226}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I would definately stay at this hotel again if I was visiting the area.", "title": "Perfect for the Alhambra", "helpfulness": 1, "user": "SherwoodSal", "date": "January 11, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53182844}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Location is tops and easily able to walk to downtown Granada but most likely take a bus back as it is on the hill. Great value hotel, staff pleasant and helpful. Would stay again. Rooms very spacious.", "title": "Perfect hotel for visiting the palace", "user": "BrendaCumbria", "date": "October 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48108700}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed at the Alixares Hotel for on night in July... I was not expecting a lot, but I was very disappointed with the hotel and the service.... The hotel looked tired and so did the staff... Clearly this hotel is relying mainly on its location... But it is definitely a 3 star hotel at best. This hotel is geared up more to tour groups....", "title": "Very Disappointed with this Hotel", "user": "PVmomontherun", "date": "July 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 72303027}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Although the bedroom was clean and was able to accomodate a family of 4 (2 teenagers and 2 adults, it had a number of shortcomings:", "title": "I expected worse, but it wasn't that bad", "user": "paxmaac", "date": "July 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 69352722}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "1. The airconditioner did not cool the room enough...", "title": "Great, highly recommend", "user": "beachsd13", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 68783074}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "2. The rooms smelled of a sickening perfume.... When I passed by the cleaner's cart I smelled the same scent so this might be the scent of their cleaning stuff...", "title": "Perfect location for Alhambra", "user": "Cay", "date": "June 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67284993}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "3. The service at the hotel was lacking", "title": "Superb location to visit the Alhambra and Generalife.", "user": "LizMcK59", "date": "June 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 66312680}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Porcel Hoteles has three hotels in Granada and one in Madrid, and we chose to stay here because we had enjoyed a short break in the Hotel Ganivet in Madrid. Hotel Alixares is in a prime location, as a 5 to 10 minute walk downhill brings you to the Ticket Office for the Alhambra, and the Generalife gardens. There are two routes for walking into town - both of them relatively steep, but scenically well worth the time and the effort. Minibus services 30 and 32 provide a frequent service into town (Plaza Nueva), and the stop (a turning circle) is located fairly close to the hotel. Service 32 will take you to Alabaicín and Sacromonte, which are two other important areas of sightseeing in Granada. The hotel also has details of a bus trip to the Sierra Nevada. However the hotel is not particularly close to the railway station, and a taxi will cost you €8 to €9, unless you are in tour group with coach transfers.", "title": "Menus to end all menus!", "helpfulness": 1, "user": "Jetter56", "date": "May 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 64912622}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This hotel excels in catering for large tour groups, some of whom may only be staying for one or two nights. The staff keep their eye on the ball to make sure everyone is happy, and still find time to deal efficiently and courteously with individuals' requests and concerns. The decor of the hallways, stairs and bedrooms has a slightly old feel about it. Rooms are comfortable and welcoming, although some modernisation could be contemplated - for example the installation of lights in the ceiling. There was a roomy wardrobe, but it was both in a dark corner of the room, and might have benefitted from enhanced illumination. The glass partition around the shower needed sealing, as it leaked onto the floor when one showered. There was a good supply of extra pillows and blankets, as nights in Granada can be cool even after a hot day, as it is located at 2,200 feet. Hotel Alixares stands in a quiet road, the only disturbances being the emptying of bins in the early hours of the morning (nevertheless Spain's general eco-consciousness and cleansing operations by town councils are to be applauded), and the occasional wake-up calls by tour group leaders at around 6.00am on the doors of their tour members, who are scattered about this large hotel. The room we had possessed the old type of safety deposit box - ie. the key has to be requested from Reception, and there is a daily charge. Although a deposit is normally required too, we were not charged it. The TV options were second to none. Our room boasted an HD plasma screen with a huge array of channels for visiting speakers of various European languages. We had no problem keeping up to date with the British Parliamentary Elections. There are two desk-top PCs in a secluded area off the main hallway. For €1 you get 15 minutes. However printing has to be effected by arrangement with Reception, including the use of their printers. The hinge-shaped hotel Swimming Pool of medium size is in a pleasant location. The water is clean and the filtration system is constantly in operation. The surrounds and the provision of sunbeds and parasols were also in good order, and added to the ambience generally. Although we did not actually swim, the temperature of the water was inviting.", "title": "Perfect for location, otherwise disappointing", "user": "APF2", "date": "May 10, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 63745015}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The big plus about this hotel is the incredible catering. The dining room seats around 200 guests. There is a lively atmosphere, and if you enjoy talking to tour groups as you line up to select your buffet menu, you will not be disappointed. On the other hand if your booking has been an individual one, you are located by your friendly waiter in a quiet area of the restaurant close to the panoramic windows. An a la carte menu is available in the evening, but no-one will feel short-changed by the quality of the buffet options, which are extensive. Breakfast costs €9.50. The evening buffet reins in at €14, and is a highlight. A chef is on hand to cook a choice of fresh chicken and fish before your eyes. Prices of drinks could not be bettered - 1.5 litres of water cost €1.90, and a good quality Valdepeñes could be had for less than €6.", "title": "Right at home at the Hotel Alixares", "user": "lithebod", "date": "May 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63625756}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This hotel represented really good value for money, and we very much enjoyed our three-night stay here.", "title": "At the Alhambra's Doorstep-Literally", "user": "TJBSt_Louis_Missouri", "date": "April 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 62298344}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Entrance and reception good but room somewhat tired and would benefit from updating as would the cafe/bar. Internet access in room free but signal not good. Its location is ideal for visiting the Alhambra across the road and that would be the only reason for staying there. Restaurant facilities were very poor, as again it was a buffet using low quality, usually tinned foods, not freshly prepared as might be expected in a 4 star hotel.", "title": "Easy to find from the motorway, staff were friendly and spoke good English", "user": "MissBugg", "date": "April 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 60139867}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "We were sent here after mixing up other reservations, and it was a wonder we got any room in Granada that weekend. Apparently, All Saints' Day weekend is very big for going to the Alhambra.", "title": "Busiest weekend of the year, but the staff never stopped smiling", "helpfulness": 2, "user": "lagunamarie", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10606776, "likes": {"liked": "— location & staff", "disliked": "— lack of internet access in room"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The room was beautiful, great view overlooking the pool and mountains. Pretty quiet, considering we were right next to the elevator.", "title": "Beware of the barbacue restaurant", "helpfulness": 1, "user": "Tonytuff", "date": "July 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8253972, "likes": {"liked": "— Price", "disliked": "— Restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "The staff were able to get us tickets in a guided tour of the Alhambra, which sells out almost every morning. The hotel is within close walking distance to the Alhambra, and you can get teh bus into town there for just 1 euro. Taxi to the main bus station costs around 7 euros & well worth it when you have luggage!", "title": "Late Spring in Granada", "helpfulness": 3, "user": "GilbertSheffield", "date": "July 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8242197, "likes": {"liked": "— value for money", "disliked": "— volume of people in reception"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "For two days, bus after bus of tour groups came in. Reception/Concierge was flooded all the time. However, the staff always took time to answer your questions, help you with anything, and never stopped smiling. They never cracked under pressure. MAJOR bonus points for that. Really outstanding on that front.", "title": "Great Hotel", "helpfulness": 2, "user": "bethofmossley", "date": "July 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8236395, "likes": {"liked": "— The swimming pool", "disliked": "— bar was abit expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The internet worked in the lobby, but not in my room. The breakfast was decent, but not spectacular. It would be nice if they sold stamps at the front desk, like many 4 star hotels.", "title": "Ideal place to stay in granada", "helpfulness": 2, "user": "bainsey", "date": "July 16, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 8125745, "likes": {"liked": "— staff and location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I thoroughly enjoyed my stay at the Alixares. I wasn't on a guided tour or with a hired driver and the directions and signs to the Alhambra made it much easier to find. If your priority is maximizing your time and convenience to the marvelous Alhambra . . then this is the hotel for you. Put simply, it is almost out the front door and a big advantage.", "title": "If your priority is Alhambra - Y ! Granada old-city, shopping, etc - ??", "user": "jrleonardfl", "date": "October 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48003832}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I can see where you might want to be in one of the hotels in the old city center if your stay in Granada was longer than a few days. I saw a couple that looked inviting near the Plaza Nuevo for example. I didn't feel like driving a rental car down the hill, into crowded streets, roundabouts and the like so I took a reasonably priced cab from the Alixares on three occasions and kept the car parked across the street in the public lot. I received a stamp on my parking ticket at the hotel lobby for a nice reduced daily rate.", "title": "Great location for Alhambra visit", "user": "FamilyHolidayFinder", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46962050}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel staff was quite helpful. I should have noted the name of the gentleman that assisted me with maps, valuable information and restaurant tips. HIs English was outstanding. The view from my hotel room was wonderful and a photo is attached. Tile accents were nice and overall, the room was quite a good value. If you are drawn to Granada to witness the Alhambra and Generalife as I was, then I can't imagine a better choice.", "title": "Superb location.", "helpfulness": 1, "user": "walliro", "date": "September 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44214845}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Our family of four stayed in two rooms next to each other. The rooms were clean and comfortable. The pool and deck area were wonderful - we spent two afternoons lounging there - lots of umbrellas and lounge chairs, and the pool is very large and perfect to swim in to cool off in the heat of the day.", "title": "The best location for the Alhambra", "user": "windiburrow", "date": "September 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 43272849}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is about 200m to the Alhambra entrance gates and about a 10 minute walk down the hill on a pedestrian pathway through beautiful gardens to the town. However, it is important to note that the hill is very steep especially on the way back up. For us, it was not a problem and we welcomed the exercise after dinner....although our two teenagers would have preferred a ride! For those with heart issues or problems walking, I would recommend taking the bus.", "title": "Exellent location for visiting Al-Hambra", "user": "archie1978", "date": "September 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 41084377}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We have recently returned from a two day break at the Hotel Alixares, a four star hotel five minutes walk uphill from the Alhambra main entrance. The taxi fare from the airport was e30. Our room on the third floor overlooking the pool (only open in summer) was a little frayed around the edges but clean, comfortable, warm and well equipped. The public areas are all marble and polished wood and the staff efficient and friendly. The hot buffet breakfast tasted a little greasier than we are used to but the cold buffet could not be faulted for range, quality or quantity. Overall it was very pleasant stay and at less than ninety pounds for two nights for two people with breakfast (via octopus.com) it was excellent value for money.", "title": "good location, good breakfast, great value", "helpfulness": 4, "user": "LancashireukGrommit", "date": "April 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7481522}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "We stayed at Alixares with a ski club and found the hotel very good indeed. Its situation is very convenient for Granada with a fifteen minute walk or frequent bus service.", "title": "Lovely hotel", "helpfulness": 4, "user": "jdaEngland", "date": "February 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6834905, "likes": {"liked": "— Friendly staff and good standard of accommodation. Very good food for price paid.", "disliked": "— No complaints at all"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Staff very welcoming. Rooms cleaned daily to a high standard. Good choice of meals and very reasonably priced drinks in the restaurant.", "title": "Handy for Alhambra", "helpfulness": 6, "user": "Stellaman", "date": "January 7, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 6561977, "likes": {"liked": "— Proximity to Alhambra", "disliked": "— No character"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "All in all - highly recommended", "title": "Great location but that is all", "helpfulness": 5, "user": "ab0si", "date": "January 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6561370, "likes": {"liked": "— location", "disliked": "— attitude of staff"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "A functional modern hotel with all the facilities you need. Rooms are a little small, but well equipped. Decent breakfast buffet although dinner didn’t look to appetising. The bbq and outdoor bar were closed when we were there, but have heard that it’s good. Its best points are excellent value for money and the location just across the road from the Alhambra and its car park (you get a discount if you have to park at the latter. The hotel charges for its own limited parking). It’s a long hill down to the city centre but buses ply the route every 3 minutes, making the return climb unnecessary.", "title": "Alhambra was on the doorstep", "helpfulness": 7, "user": "Kimbos", "date": "November 27, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6182710, "likes": {"liked": "— Close to Alhambra", "disliked": "— No tea or coffee making in room"}}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 49, "average": 160, "very good": 253, "terrible": 30, "excellent": 107}, "slim_ranking": 0.564885496183, "description": "The complete Alixares hotel is located opposite the stunning Alhambra, one of the most wonderful monuments in the world, and a 15-minute walk from Granada's city centre. The hotel offers its guests a comfortable and cosy atmosphere in a modern environment. Hotel Alixares offers Wi-Fi Internet connection throughout the building, a reception desk open 24 hours, several fully equipped meeting and conference rooms, an Internet Point, an outdoor swimming pool, a private parking area, a bar and a restaurant, just to mention some."}