{"user_rating": 5.0, "review_count": 569, "name": "Hotel Le Germain-Dominion", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My wife and I stayed at the Dominion 1912 for 3 nights at the beginning of May, 2007. The hotel is in a great location in the old lower part of the city, and is within easy walking distance of all of old Quebec City. Our room was average size but very pleasantly decorated (see photos). The bed was the best hotel bed I've ever slept in, including the beds at the chain that has the \"heavenly bed.\" The biggest plus about this hotel for me was how quiet it was. I'm a light sleeper, and I slept well in this hotel. The hotel had a very attractive lobby, with comfy couches and chairs all near a big fireplace. There was complimentary coffee and tea in this area, which is where breakfast was served every morning as well. The hotel staff was courteous and helpful, without being overbearing. Overall, I'd say the Dominion 1912 was one of the nicest hotels I've ever stayed in, and I'd return if I ever get back to Quebec City.", "title": "Peaceful Dominion", "helpfulness": 10, "user": "CosmoC", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7955333, "likes": {"liked": "— Pleasant atmosphere and the bed.", "disliked": "— Nada"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is the best hotel I have ever stayed at!", "title": "Best hotel!", "helpfulness": 9, "user": "Gregan", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7780488, "likes": {"liked": "— The bed!", "disliked": "— Nothing at all"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The staff were friendly, the room was lovely, the toiletries were fantastic (Aveda) and the bed and pillows were so comfortable. I didn't want to leave the hotel!", "title": "What a wonderful place!!", "helpfulness": 9, "user": "only_the_best00", "date": "May 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7723209, "likes": {"liked": "— Service and the beds!", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The breakfast is included and is yummy. And there is free coffee, tea, hot chocolate all day.", "title": "perfect", "helpfulness": 6, "user": "zaccaria", "date": "May 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7549674, "likes": {"liked": "— coffee", "disliked": "— visit too short"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The whole hotel is spotless, and the staff have fantastic attention to detail.", "title": "Somewhat disappointing", "helpfulness": 16, "user": "Ouimet", "date": "April 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 7363500}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I can't say enough about the Hotel Dominion 1912 where I stayed for five days in October. Staff is absolutely friendly and helpful; room was beautiful and clean. The continental breakfast each morning was more than adequate--and coupled with the now-famous coffee machine, who could ask for more? My room was on the 8th floor and faced the St. Lawrence--spectacular view and a truly memorable stay.", "title": "No room for improvement", "helpfulness": 3, "user": "Essmiss", "date": "November 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6082377, "likes": {"liked": "— Helpful, welcoming staff", "disliked": "— Wish it had a restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I would return in a split-second and I cherish the hope that this will be possible someday.", "title": "No need to look further", "helpfulness": 5, "user": "Love vacation time", "date": "October 7, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 5926388, "likes": {"liked": "— modern, clean and comfortable"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "If you like to be in a boutique hotel with courteous service, comfortable rooms, a good location, a nice continental breakfast and cleanliness is important to you......the Dominion will not dissapoint you. I loved the modern decor and the fact that there are not hoards of visitors walking through the lobby to gawk. The concierge was willing to help with dinner reservations and did an excellent job in securing my requests. For dinners our favorite was Ristorante Michelangelo. It is a bit out of the area (about a 15/20 minute drive), but they send a car for you and return you to the hotel with no fee for this service. The restaurant decor is exceptional and the food was very good as was the service. We dined at Toast (B), Cosmos Cafe for lunch (C-), L'Echaude (B).", "title": "A Wonderful hotel", "helpfulness": 4, "user": "Hobbes", "date": "October 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5910847, "likes": {"liked": "— the gestalt of the p lace", "disliked": "— It's not more readily accessible! I'd love to stay here over and over again."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Loved this hotel in the Lower Town. OUr room was spacious and quiet. The decor had been described as minimalist but the place was actually quite comfortable. Staff was tremendously helpful in all ways. Breakfast is served buffet style in the lobby and is very good.", "title": "Not as good as we hoped", "helpfulness": 17, "user": "TheTravelCouple", "date": "October 1, 2006", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 5895732, "likes": {"liked": "— location", "disliked": "— service/value for money"}}, {"rating": 5.0, "title": "A Real Luxury Boutique Hotel", "text": "Location was good and out of the touristy bit of Quebec. The bed was comfortable and big and the view was of the port.", "helpfulness": 5, "user": "annbury", "date": "September 27, 2006", "id": 5883844}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We had two nights at this hotel and we loved every inch of it. I was debating between this and the 71, but opted for the Dominion and would look no further. In fact I am planning a summer golf trip just to go back. A boutique hotel, unpretentious, the first superb characteristic is the service. I am sure I could have ordered a camel and they would have found one. Polite to the extreme, attention to detail and made us feel so welcome. The lobby is fabulous, featuring comfy, plush chairs and sofas. Perfect to sit in front of the roaring fire and have a drink or to go over the many menus they will provide you with for nearby restaurants. So simple in design but truly elegant and warm. I was afraid the modern aspect of the rooms would be cold, but far from it. The rooms are immaculate, large, you could fit 6 people in the shower. Put it this way, when you walk into the room, your radio is playing soft music and there is a square black dish on the swing tray beside your bed with two green apples in it. When you go back to the room for the night, your bed has been turned down with wonderful robes awaiting and the dish is now on the window sill and in its place is the tv guide opened to the day with the tv converter on it. Detail..detail..detail. The breakfast in the lobby and adjoining room is a continental and everything you would want, hard boiled eggs, granola, yogurt, fruit, croissants, pain du chocolate, breads, jams. There is also a 24 hour wonderful cappuccino/espresso maker and also available is hot chocolate and tea. In the morning, our skis which were secured in the hotel were place in our vehicle, and the car was de-iced and warmed for us. (sigh)Can you tell I didn't want to leave.? Forget the Chateau, - have a drink there if you will. I've been there, its fine, but this is the place to stay. Book it and love it!!!", "title": "Superb!", "helpfulness": 8, "user": "katyrose", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7247386, "likes": {"liked": "— service and atmosphere", "disliked": "— we had to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Just came back from a weekend in Quebec City. I cannot recommend this hotel, part of the Le Germain group, highly enough. We were a group of 40, a high end group of businessmen and spouses who travel routinely all over the world, used to staying in 5-star hotels with 5-star service. I am the organizer. Without a doubt, the service in this hotel was above and beyond anything we could possibly have asked for, or paid for. Their staff were tremendous, assisting us prior to our arrival with arrangements on the ground, group rates, local research of services required, lovely sized rooms, well appointed. Never once did anyone frown at anything we requested, every service offered with a smile and even a suggestion how it might be bettered if need be. And not one extra charge for all the extra work. Kids welcomed, a nice fitness room lower level, free fruit 24 hours in the lobby, a gorgeous intimate lobby bar, communal breakfast in and off the lobby area, with tons of natural lighting. And all within walking distance of the top restaurants in the old walled section of Quebec. Go there. Don't even think about any other place!!!", "title": "An absolutely outstanding hotel experience", "helpfulness": 8, "user": "flyinmom", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6891911, "likes": {"disliked": "— That we were there in -26C wind chill weather!!! There was NO downside to this place."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We have stayed at the Dominion 3 times in the past year and a half and have never been disappointed. The staff members are always more than helpful.", "title": "Our Favorite Place to Escape", "helpfulness": 6, "user": "Mighty1", "date": "February 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6852284, "likes": {"liked": "— The Beds", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Superb attention to detail- look no further!", "text": "The hotel is in the perfect area. Just about everywhere you will want to go is within walking distance.", "helpfulness": 9, "user": "essandpee", "date": "February 26, 2007", "id": 6840160}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The rooms are wonderful and I can't say enough about how comfortable the beds are!!!! The only word of caution is to be careful because you just might not want to leave the room. We recently bought two pillows from the hotels online boutique store and will soon purchase the duvet as well.", "title": "Wow Wow Wow!", "helpfulness": 7, "user": "dumoulin", "date": "February 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6809474}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We are baby-boomer travellers and we prefer comfort and a bit of luxury.", "title": "Stay here...", "helpfulness": 7, "user": "annierlux", "date": "January 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6624099, "likes": {"liked": "— The general ambience of the hotel.", "disliked": "— Loved it all,,,"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The rooms are large with superb amenities. For once the hotel pics are actually what you get!", "title": "Romantic and cosy", "helpfulness": 5, "user": "saluttoi", "date": "December 28, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6509521}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The beds are fantastic...a great nights sleep guaranteed.", "title": "Hotel fabuleux!", "helpfulness": 10, "user": "cagibi", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6310344, "likes": {"liked": "— Everything! Great room, view, bed, shower, aesthetics, staff, location, breakfast...", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Breakfast was simple (croissants, coffee, fruit, cereal but of a high quality. Check out the tea collection!", "title": "Perfect location, staff and experience!", "helpfulness": 6, "user": "H2H", "date": "November 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6269885, "likes": {"liked": "— No doorman to help with bags at the front door - not easy to wrestle the luggage up the stairs", "disliked": "— Have the cab driver drop you at the entrance off the parking lot - much easier to get luggage in ."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The staffs were very attentive and helpful.", "title": "The Best Hotel EVER! ( and I'm picky! )", "helpfulness": 6, "user": "superroadtripper", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6181312, "likes": {"liked": "— The front desk service, the cleanliness, and the view!", "disliked": "— nothing-we liked EVERYTHING!"}}], "location": {"country": "Canada", "city": "Quebec City"}, "stars": 3.5, "variance": {"poor": 6, "average": 16, "very good": 83, "terrible": 2, "excellent": 462}, "aka": "Dominion 1912 Hotel", "slim_ranking": 0.0408163265306, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "The neighbourhood that saw the birth of QuebecThe hotel was inaugurated in 1997 in the former office building of Dominion Fish & Fruit Limited, erected in 1912, and enjoys an enviable location on Saint-Pierre Street in the heart of Quebec City's historic Old Port district.The hotel possesses the elegance, comfort and refinement that are distinctive to all Le Germain Boutique-Hotels. Although completely renovated, it still exudes the charm of yesteryear, thanks to efforts to preserve its historic character. Somehow, the hotel has a soul, and it's this in particular that attracts guests.Relaxing Comfort In Serene SurroundingsThe rooms, where meticulous attention to detail reigns, each deliver a slice of history. Guests will nevertheless find that the design and amenities have a modern feel, allowing them to fully enjoy a relaxing oasis in the heart of a neighbourhood as picturesque as it is lively."}