{"user_rating": 3.5, "review_count": 158, "name": "Hotel Jules Cesar", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The Jules Cesar is a member of Small Luxury Hotels of the World. It's not particularly small and it's not luxury. What it is is a reasonable 3 star hotel in a good location on a main boulevard in Arles and only 5 minutes stroll to the main Roman remains which are definitely worth the visit to Arles. The hotel was clearly last refurbished c1970 and whilst the room and bathroom were spacious, quiet and clean they are definitely old fashioned. The public rooms are elaborately furnished, the service is generally very good with the valet parking particularly efficient. Prices are high given the property and its provincial France location - €300 for a superior room and €20pp for breakfast seems a little excessive. One benefit it also has is a pleasant pool to relax in after the heat of the roman ruins.", "title": "Just OK", "user": "Rover10", "date": "September 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 140169028}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Whatever you do however, ensure that you have insect repellent for an evening out (the hotel interior is fine) but an outdoor restaurant at night invites attack from the aggressive Rhone delta mosquitoes.", "title": "Adequate", "user": "toasty754", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 138079822}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Can't say anything really bad about Jules Cesar but then again there's nothing great to report either.", "title": "Very average hotel", "user": "JTMCOOLS10", "date": "August 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 136966891}, {"rating": 5.0, "title": "On my bucket list", "text": "On the positive side - it was easy to find and in a good position to explore the town.", "user": "Tassels57", "date": "August 7, 2012", "id": 136530387}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "The staff were all welcoming, friendly and helpful and spoke good English.", "title": "Great stay. Would definitely stay there again.", "helpfulness": 1, "user": "craftyphd", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135093482}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I really enjoyed our stay at this hotel. The room was very spacious and had a lot of character. This hotel is a member of the Small Luxury Hotels. Very close to many restaurants and definitely within walking distance to all of the historical sights. The only down side was that they seemed to be short handed at the front desk at times. We had to wait extra long for a valet to retrieve our car. I would definitely recommend this hotel.", "title": "Great hotel in a great location", "user": "OrlandoGator", "date": "July 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133709647}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This hotel is in an old convent and attached to the 18th century church that supported the convent in days past. The rooms have stone wall, the corridors have archways, there is an interior garden from 200 years ago and a modern pool. The restaurant is 2 stars, meaning better than 99% of restaurants in the USA. In an area where ordinary restaurants serve excellent food, this is over the top. The location could not be better--walk out the door and you are in the charming city of Arles. All in all, this place is really great and is probably as good a hotel, all things considered, as you will find in Provence.", "title": "Superb and one of a kind", "user": "bricklinng", "date": "July 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133294461}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The only good thing about this hotel is its location in relation to the old town centre. Our room was overpriced, tired, fusty, had noisy plumbing, an inadequate dribbly shower, furniture and beds that had seen better days - even the children thought it was depressing. It is advertised as a 'family hotel', but my 13 & 11 year old were not allowed to eat in the hotel's restaurant the evening we were there. That didn't matter as there are plenty of places nearby to suit all pockets This hotel has seen better days and should be rated a 2 or 3 star at very best.", "title": "Not worth its 4 Star rating", "user": "vjr100", "date": "July 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 133276707}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I am giving this hotel an \"average\" rate cause I think they could be a way better hotel if they made an extra effort. It has a lot of potential, and they don't take advantage of that.", "title": "Could be a wonderful hotel", "user": "Liz_Nogueira", "date": "June 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 131440512}, {"rating": 4.0, "title": "Spoil yourself - stay for dinner", "text": "Location: very good - you just need to cross the street to get to the old town.", "user": "Brian H", "date": "May 1, 2012", "id": 129208560}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We enjoyed staying above our usual class. Lovely room, friendly service. We had the breakfast. Wonderful, and fresh -- best croissants we had the whole trip.", "title": "first class accommodation and service", "user": "msntrav", "date": "October 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 119724768}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The room was comfortable but would have liked a bigger window (ours was very small and in the corner of the room).The bathroom was huge and nice but the shower didn't work so we took baths instead. The hotel was in a good location. But, a little annoyed b/c website said WIFI available and there was no WIFI in the room (only in the lobby) and we got charged 13 euro for parking per night which we would have appreciated knowing in advance. The courtyard was nice and staff friendly otherwise. The hotel restaurant was high end and was pricey ($30 euro for daily dinner course menu) but good. Was hoping to use this as a base to see and tour Rhone wine region but would not recommend due to toll roads and time it took to get to wineries.", "title": "good but could be better", "user": "Gretchen F", "date": "September 18, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 118257871}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "August is very hot in Arles,35+ so sight-seeing needs to be done in bursts and this hotel is ideally situated for an air-conditioned siesta. Decor is traditional Provencal Arlesian, all fabric walls in deep colours and furniture in style. Bathrooms are a bit 1980s, in that they are very marble and floors dangerously slippy, but everything works and a modern minimalist bathroom would probably be out of place.", "title": "Traditional hotel, centrally located.", "user": "cosmicstar", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117078022}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Food in evening excellent. Modest menu of five choices per course, but I mistrust restaurants that have big menus. Everything was beautifully cooked and presented, particularly the plate of about 8 different seasonal veg stuffed with different flavours, which came with the main course. Wine waiter knows his stuff, agreeing with us that a wine was much sweeter than normal with the vineyard chosen. he came back with another bottle which was a different colour and perfect. All his bottles for that year were similarly darker. We agreed it still tasted god but just not the expected taste which the second bottle was. he will recommend the sweeter wine for the foie gras. You need insect repellant in the evening. As the waiter said, \"This is the Camargue.\" Breakfast dull and not much choice.", "title": "Atmospheric hotel", "user": "s1ward", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115525249}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Enjoyed our weekend at the Hotel Jules Cesar in Arles. The hotel, a former convent, was full of interesting bits and pieces and very atmospheric. The small outdoor pool was a welcome retreat after a day's sightseeing in 30 degree heat!", "title": "Beautiful Ancient Monastary Hotel", "user": "ilovetraveling1", "date": "November 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87891239}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We only stayed one night before boarding our river cruise but would loved to have stayed a few more nights. The hotel is central located and walking distance to all the sights. Loved our dinner in the hotel's restaurant with delicious, fresh French cuisine served with charming, personal service. I would recommend a Superior category as our \"standard\" room was small which is so common in Europe.", "title": "Charming hotel", "user": "Nancy V", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 128251439}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We had a great one night stay, and an incredible meal here. The hotel is a renovated convent. Which means that the rooms are not cookie cutter, and are not modern standard construction. But, they are lovely, and offer a great experience. Linens and bath products were good. Service was very good. But, the highlight was the restaurant. We blundered through ordering a meal in French. The staff was understanding, but there were some surprises. And, the meal itself was absolutely fabulous. Worth the trip to Arles all by itself. Check the price before you go in. It will be $100 or more a head just for the food, but you won't have many better meals in your life.", "title": "What a nice surprise", "helpfulness": 1, "user": "jeff3545", "date": "March 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126273472}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "You can't beat the location or the décor of this traditional hotel, but what we really loved was the service. The people at the reception were incredibly friendly and professional. I enjoyed chatting with them in my French, which doesn't always go so well.", "title": "Fine hotel, impeccable service", "helpfulness": 2, "user": "NewYorkJudy", "date": "January 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122655598}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "It's true that some of the hallways had a somewhat musty smell, as other reviewers noted, but our rooms were fresh and clean, and we found the lobby an inviting place to have a cup of coffee and/or read our email (there's no wifi in the rooms). We took all our meals outside of the hotel.", "title": "Where Time Stands Still and Luxury Reigns", "helpfulness": 2, "user": "Relais-Reviewer", "date": "December 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121599950}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "Head to Arles, that meeting point of waterways and land routes, and to the splendid grandeur of the Hotel Jules César. This hostelry will not disappoint. Drive along the Boulevard des Lices and the first impression of the17th century Carmelite convent, now converted into a splendid hotel, is one of white marble, wrought iron balustrades and manicured, fragrant shrubs. This is a Provençal legend and a relief of Julius Caesar looks down on an ancient chapel that is a protected historical site.", "title": "Very nice classical hotel in a great location", "helpfulness": 1, "user": "Mau-travel", "date": "December 10, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 121598169}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 4, "variance": {"poor": 26, "average": 37, "very good": 52, "terrible": 7, "excellent": 36}, "aka": "Jules Cesar Hotel", "slim_ranking": 0.44}