{"user_rating": 4.5, "review_count": 117, "name": "Hotel Mirabeau", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We only stayed for 1 night in early Sept but are very impressed by both the quality of stay and service. The twin room we stayed in was exceptionally spacious by European standard. Beds are large and comfortable. There's no air-con but we opened the windows for air and were not the least troubled by noise outside (we were facing the main street and it was a Friday night). We didn't plan for breakfast at first but after having a quick glance the next morning we made the correct decision of taking the breakfast at the Hotel, which although limited in choices was generous and fresh and of great quality. Ladies at Reception speak excellent English and were helpful in all aspects. Under 10 min walk with suitcases from train station. Heartily recommended.", "title": "Great value", "user": "JJB", "date": "September 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 177971574}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "My Mother and I spent 6 wonderful days at the Hotel Mirabeau in Tours. The staff was warn and welcoming. Our room was super clean, spacious, and comfortable.The hotel is perfectly located about 5 mins from train station and tourist office.We look forward to coming back and would recommend this hotel to anyone visiting Tours.", "title": "Wonderful stay", "user": "vauxlevicomte", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177116185}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The staff at hotel Mirabeau has been a delight and the customer service beyond expectation.", "title": "Amazing Service", "user": "Paul_Keijzer", "date": "September 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 177083290}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "This was highlighted by the fact that I recently got an email from the hotel staff saying they had found my mobile phone behind on of the bed heads. We stayed there two months ago but despite that they were be able to identify who the telephone was from and send me an email to notify me and offer to send the phone over. Amazing, wish every hotel took their customer service that serious. Next time you are in Tours, stay at Hotel Mirabeau, you won't be disappointed.", "title": "Good value", "user": "cathers76", "date": "September 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176827989}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "We stayed for 3 nights as part of a wine tasting trip to France. Tours was a good base and we hired bikes over 2 days. The hotel have a garage that you can store your bikes in around the corner from the hotel.", "title": "Excellent value", "user": "valevala", "date": "August 31, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 174972774}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed in Tours at the end of our short Loire valley cycling trip. We arrived hot and tired before check in time had opened, but were checked in promptly and given access (and clear directions) to a secure garage to store our bikes. Our luggage had already been delivered to our room on the second floor. The room was very spacious, with a sleek, modern bathroom and lots of natural light. Bedding was comfortable and we heard nothing from outside the room. The location is excellent - a short walk to the station and a nice base to meander around Tours. It's in a completely different class to the other 2-star hotel we stayed at on this trip. I'd definitely return, both to Tours and to the Hotel Mirabeau.", "title": "Location, space and comfort", "user": "Naustrav", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 170240173}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We did not know what to expect from a 2 star hotel (in South Africa a 2 star hotel is less than basic) and were a bit reluctant to book at the Hotel Mirabeau, but they had such good TripAdvisor reviews. The rooms must have been recently renovated - everything was spotless and the decor really nice. The en-suite shower was spacious ; I liked the fact that the toilet was in a separate toilet closet. It is relatively close to the station and Tourism information office.", "title": "After a month of traveling in France - this was the biggest surprise.", "user": "Philda B", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168159578}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed 4 nights in mid June. We had Rm 17 - on the top floor in the back. It was very comfortable and clean and overlooked adjacent rooftops and the breakfast garden below. Very quiet and a good temperature, although it might be hot if the weather weren't so mild. (It was too cold to eat outside when we were there, but the breakfast room looks out on the charming garden. Decent breakfast. A bit of a long walk to the historic area, but my sisters were staying right in that area and it was very noisy. Wifi was a bit iffy in our room but fine in the public areas and probably in the more central rooms. All in all a very good choice.", "title": "Very comfortable", "user": "MajaMD", "date": "July 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 166615010}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Easy walking distance from the downtown train station with a very helpful and attentive staff. The rooms were simple and seemed a little dated, but they were clean and comfortable. Wifi worked fine and the rooms were plenty cool for late June. The location is excellent for strolling around the city. Parking is not available, but we had no trouble finding a spot for our rental car on the street. Access to main roads out of town to visit the Loire chateaux was good and the staff provided good recommendations. The price was great, so since we didn’t spend too much time in the rooms anyway, we were very satisfied with our choice.", "title": "Excellent, Economic Stay", "user": "SCalCanz", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166276624}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We stayed for five nights, using this as a base to go and explore the general area. We found the Mirabeau quite comfortable and very clean. The room had clearly been recently renovated and even though our room faced onto a main street it was very quiet. What made this hotel exceptional was the staff. They went beyond professional to truly warm and welcoming at every turn. They truly felt more like hosts than like hotel staff. The location was excellent--close enough to everything but just into a residential area so it was quiet and safe and very comfortable. I would be very happy to stay there again.", "title": "Very welcoming and helpful staff", "user": "Shariann L", "date": "June 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 164654648}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Would definitely stay here again", "title": "Clean quiet basic 2 star hotel with a great breakfast", "user": "nnsanci", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161908000}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Pros|", "title": "Nice hotel nearby Tours Train Station", "user": "MarciaB6", "date": "May 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 161321256}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Central location (but lots of street parking)", "title": "Excellent quality, with character, and affordable price", "user": "Txiquitin", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 159380041}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Quiet", "title": "Comfortable, functional, great location.", "user": "Stephanieefany", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158284962}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Clean", "title": "Excellent quality and price ratio", "user": "Andre A", "date": "April 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157584481}, {"rating": 4.0, "title": "Value for money", "text": "I stayed in room 22. A single occupier. The room was bright, clean and roomy. Really nice bathroom which also had a window. I was with 3 friends who all had seperate rooms. Easy walk to the train station and the centre of town. Breakfast was continental and very nice. Friendly staff. At the tourist office we had ordered a free guide (Valerie) who took us around Tours for nearly 3 hours. Hired a car for two days and had free parking opposite the hotel. Last day we hired bikes. This is a beautiful part of France and I would come back to this hotel again", "user": "Gina W", "date": "August 27, 2013", "id": 174311727}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Room was surprisingly large and nicely decorated in this reasonably priced hotel only 10 minutes walk from the train station, and 15 from the old town.", "title": "Friendly, convenient and good value", "user": "ManuelaMoo", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 174016040}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The staff were friendly and helpful, the WiFi was fast and there was a fan in our room, but no full air conditioning.", "title": "Can't praise it highly enough", "helpfulness": 1, "user": "dorothydixer", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172948746}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Beautifully furnished and finished hotel. Good staff - polite and smiley without being too solicitous. Handily located right off the motorway. Parking free and plentiful and right opposite the hotel. Rooms were comfortable clean and beautifully decorated with antique furniture and neutral colours. Breakfast was generous and loads to choose from. C'est magnifique!", "title": "Good location", "user": "sakss", "date": "August 16, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 172523919}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We arrived in tours late afternoon and went to the tourist centre who then found this accomodation for us. There was free parking opposite and the room was clean and spacious. It was only a 10 minute walk to the restaurant distinct. Be sure to stop at the most beautiful basilica we have ever seen .", "title": "Excellent staff - very helpful, centric hotel, nice stay", "user": "DidemSILAY", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170705310}], "location": {"country": "France", "region": "Centre", "continent": "Europe"}, "stars": 2, "variance": {"poor": 2, "average": 8, "very good": 61, "terrible": 1, "excellent": 45}, "slim_ranking": 0.0441176470588}