{"user_rating": 4.0, "review_count": 415, "name": "Hotel Saint George", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "My girlfriend and I stayed at Hotel St George from 12th-17th June 2006 and both found it to be a most enjoyable place to stay - clean, friendly and well-run.", "title": "Lovely Hotel - good location", "helpfulness": 12, "user": "Tarff", "date": "June 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5360782}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The rooms were of a good size with a clean and working en-suite toilet/shower room. The bed was comfy and the television received czech,german and uk language channels. One small let down were the 4 cigarette burns on the bed-sheets and towels. The staff spoke good English and were knowledgable about the local entertainment and places of interest.", "title": "Great Hotel", "helpfulness": 8, "user": "Travelling_Acadian", "date": "June 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5338842}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The hotel is just 3 minutes away from I.P Pavlova metro station which in turn is just 1 stop away from the main 'Muzeum' stop. However I would suggest walking the extra 5 minutes into Wenceslas Square as it takes you through a park and towards the impressive National Museum. We were surprised at how close the hotel was to some of the major attractions despite seeming to be on the outskirts. We walked quite comfortably to the Old Town Square,National Opera,Theatre and Charles Bridge all well within 20 minutes.", "title": "Worth staying for the hot tub!", "helpfulness": 12, "user": "Kip", "date": "June 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5295414}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "Although we were only really in the hotel to sleep and for breakfast (excellent choice of meats,cheeses,cereals,fruits and yoghurts) we would not hesitate to recommend it to others looking for a cheaper stay in the centre of Prague.", "title": "Nice hotel, had everything we needed!", "helpfulness": 8, "user": "John J", "date": "May 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5229173}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "For eating/drinking check out Pod Kridlem near the National Theatre and U Pinkasu near Mustek metro.", "title": "Excellent", "helpfulness": 9, "user": "RachDewsnap", "date": "May 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5229123}, {"rating": 4.0, "title": "Good Hotel", "text": "The hotel is really nice, its clean and the staff are friendly and the breakfast is good. It is ideally situated for Wenceslas Square. Prague was lovely, I want to go again in Winter! Next time I would stay nearer the Charles Bridge as this is where most of our time was spent.", "user": "furry_chick", "date": "May 12, 2006", "id": 5057204}, {"rating": 5.0, "title": "Excellent", "text": "Excellent value for money.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 6, 2006", "id": 5038867}, {"rating": 1.0, "title": "Alchemist", "text": "Only a short walk to the centre of town. 2 restaurants nearby were also excellent. One was Korean and AUTHENTIC! The other is one of the funkiest places I have been to with a caveman theme. Both were a lot cheaper than city centre restaurants. Walk down the main road to thhe opera house and you will find them.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 2, 2006", "id": 5026521}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Staff were professional too.", "title": "SUPERB AND INEXPENSIVE", "helpfulness": 4, "user": "sinead09", "date": "April 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4974780}, {"rating": 5.0, "title": "A superb hotel", "text": "Room was huge.", "helpfulness": 12, "user": "Vinybabe", "date": "March 6, 2006", "id": 4586252}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "If you are going to Prague and want a quality hotel at the fraction of the price I would definitely recommend this one. We went in February and the rooms are lovely, warm and clean. Breakfast was included in the price, which was a cold buffet and had a good selection of food and drink on offer. The staff were friendly. Access to the internet was available for free but this was only for the first 15 minutes.", "title": "Lovely Hotel", "helpfulness": 2, "user": "Geaynor", "date": "February 24, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4499644}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Just got back from a short stay in prague with my boyfriend and we stayed in the hotel st.george. The hotel was clean and smart with nice rooms-the showers were great and bed comfy. The drinks were cheap, even in the mini-bar and the staff were really helpful, marking places on maps for us and recommending places. The sauna you pay for but both the gym and jacuzzi are free...although the jacuzzi is a little cold. The only thing i would say is that if i went again i would prefer to stay in a different area, perhaps closer to old town since we didn't spend any time really in new town.", "title": "St. George", "helpfulness": 5, "user": "bunnygirl_88", "date": "February 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4497218}], "location": {"country": "Czech Republic", "region": "Bohemia", "continent": "Europe", "city": "Prague"}, "stars": 3, "variance": {"poor": 10, "average": 60, "very good": 219, "terrible": 6, "excellent": 120}, "aka": "Hotel St George", "slim_ranking": 0.280832095097, "description": "The Hotel Saint George is set in a renovated historic building dating from the 18th century. It is located 700 metres from Wenceslas Square and offers a wellness area featuring free hot tub, sauna and fitness facilities.The interiors at the Saint George are elegantly decorated with Biedermeier-style furniture. The spacious rooms all feature individually controlled air conditioning, satellite TV and a minibar. Guests can relax in a lobby bar with a billiard table, which is opened from morning to late evening. WiFi is available in all guest rooms and public areas free of charge.The I. P. Pavlova transportation hub can be found within 200 metres and the Prague Opera and the National Museum can be reached within a 10-minute walk. The Charles Square is 800 metres away."}