{"user_rating": 4.0, "review_count": 205, "name": "Hotel Serenissima", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I have just returned from Venice where i had the most amazing stay with my partner in this hotel. The staff were so friendly, welcoming and they could not do enough for us. The owner (Marie) was just divine and like a typical mother to people in the hotel hence the reason why we nicknamed her \"Mama Italia\". The rooms were so cosy and gave a real Italian feel to them. Breakfast was so tasty even serving heated rolls and croissants along with jams, cheeses, juices, tea, coffee or hot chocolate. Nothing was a problem for them. The staff were also extremely helpful with advice on places to go and where not to go which was a real help as it was our first time there. The hotel was right in the centre of all the attractions. The Rialto seems to be the place to go. We were minutes from Saint Marcs Square and minutes from the cafes, shops and restaurants. Overall i would recommend for anyone to stay in this hotel. It was amazing.", "title": "Amazing Hotel", "user": "irisheyes3Ireland", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13703242, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Great little hotel in great location. Very friendly staff, and very tasty breakfasts.", "title": "Great place", "user": "AGS217", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8538539}, {"rating": 3.0, "title": "good value hotel in a very expensive resort", "text": "The hotel was very well positioned only 5 mins walk from both St Marks Square and the Rialto bridge. The room was slightly bigger than we had anticipated, after reading some of the previous reviews. If you find that your air cond is not working,just check with reception, because ours had been turned off. It is very stuffy without it. The breakfast was the most basic we have ever had on a holiday, and whatever you do , dont order tea at breakfast. The minute we arrived at the airport , we were parted from nearly 80 euros for public transport and bus passes. This proved to be the way it was for the whole break . Dont be under the illusion that you can do this trip on the cheap,because you cant. We paid generally 10 euros for 2 small beers, and in one restaurant ( AL BURCHIELLO) we paid 50 euros for 2 plain pizzas and 2 beers. The beers were 9 euros each and they took 12% and 5 euros service charges on top. Scandalous! The biggest dissapointment was the attitude of the people that we encountered, working in Venice ie. waiters etc . Niceties and good manners do not exist. We appreciate that a lot of the big cities are this way, but we found Venice to be in a class of its own. We did visit the Lido, ( 15 mins on the water bus ) and we found it a great relief from the hustle bustle of the main areas. I think that we would agree with some of the previous reviews, in that in the future we would stop there , away from the madding crowd.", "helpfulness": 4, "user": "davejames", "date": "June 19, 2007", "id": 7938380}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Venice is a place unlike anywhere else, and everyone should visit once. It has great places of historical interest with fabulous churches and palaces. All in all it was too hectic to be romantic,and too expensive to really enjoy yourself. Pay a visit , but dont stay longer than a couple of nights.", "title": "Good little semi-private hotel/hostel", "helpfulness": 1, "user": "Delorean", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7836947, "likes": {"liked": "— The location, cleanliness, and service.", "disliked": "— Small, hard, beds with super-thin blankets and a bathroom down the hall."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "Overrall very nice. The check in office was two minutes from the train station, and very easy to find. The room itself was just two minutes from San Marco square, with a guide to lead you there from the check in office. That's a great set-up - I never would have found it myself, without a guide the first time.", "title": "Fantastic location", "helpfulness": 4, "user": "choward1", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7645978, "likes": {"liked": "— location", "disliked": "— no lift"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We selected this hotel from the Michelin green guide and found it to be very well located, a friendly athmosphere and staff. We recommend it to anyone traveling to Venice. Don´t miss the island tour, specially Burano and Torcello.", "title": "Very good option in the midde of everything", "helpfulness": 1, "user": "JaimeQ", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 18069968, "likes": {"liked": "— Location", "disliked": "— no lift"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Hotel in a great location not far from St Marks Square and near Gondola station. Rooms were lovely even though my friend and I were on the 4th floor with no lift. So if you can't do stairs very well then this hotel is not for you but if you want a cheap hotel that is in a central location then this is the place. Hotel staff very helpful and friendly. Would go definatley go back to this hotel.", "title": "Fantastic", "helpfulness": 1, "user": "kittykat1986", "date": "July 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17941855, "likes": {"liked": "— The location", "disliked": "— Having to walk up 4 flight of stairs to get to my room"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We were recommended this hotel and it turned out OK. It is in a great location between Rialto and San Marco in Venice. In Venice terms the rates were competitive/cheap however as the most expensive hotel we stayed on for our trip I'm not sure on value for money. However the receptionist was very friendly, helpful and welcoming and though the room was small it didn't really matter as we were out most of the time. The bathroom was very small and I'm not sure the air conditioning worked. I heard another customer asking on this and being assured it was on but I'm not convinced. The breakfast was quite basic but nice and the staff for this friendly. Can't be beaten on location and we enjoyed our stay.", "title": "Wonderful location and a friendly little hotel", "user": "MissyW13", "date": "May 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 16469010, "likes": {"liked": "— Location", "disliked": "— Small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "After being confused with the many options and locations to stay within Venice I am so pleased I booked the Serenissima. The location between San Marco Square and Rialto Bridge was brilliant. The family run hotel was very friendly, very clean and all their recommendations for where to eat were perfect. This was important to me as I was a woman on my own. It wasn't important to me at all that my room didn't have a view and that it was small but adequate. (My 6ft 2in hubby would have had trouble in the minute ensuite though!) They have a small bar and areas off the landings to sit and read. Breakfast is basic with lovely coffee.", "title": "Just right for the perfect break.", "helpfulness": 3, "user": "Jane G", "date": "March 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14164127, "likes": {"liked": "— Friendly,clean good location.", "disliked": "— no view but that wasn't important to me"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "I have a terrible sense of direction and had trouble with getting the right exit out of San Marco Square. I hope this will help others as it is simple and quick if you get it right! Look to the right of the banners for the Correr Museum. Opposite end to the Basilica etc. The number above one of the shops at the exit you need is 88 and one is called Markus. The exit is marked Per Rialto. There is one bridge to cross and when you get near a 4* hotel and Georgio Armani you will see the sign and the red flag outside the hotel.", "title": "Great Location", "helpfulness": 1, "user": "brazilianwanderlust", "date": "March 4, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 14055410, "likes": {"liked": "— Location", "disliked": "— Nothing in particular bothered me"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Went to Venice to sight see and needed somewhere central just to lay our head. Hotel Serenissima was recommended to us and fitted the bill perfectly. Its small and clean. Unfortunately two single beds pushed together and beds a little creaky, but all was clean and a perfect location. Breakfast was simple and nice - fresh coffee and breads. Perfectly central to St.Marks and Rialto. Everything in Venice is so expensive. We paid 100euro for 2 B&B. Elsewhere this would have been expensive, but in Venice it was the most reasonable and central we could find.", "title": "Handy place, did the job", "user": "caitni2000", "date": "November 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 48396343}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Location is the primary reason for staying at the Hotel Serenissima. It's right in the middle of Venice, so you can walk anywhere. It's a very old building, but the rooms are very charming, quaint, and clean. Unfortunately, it was very hot when we were there and the air conditioning couldn't keep up with the heat.", "title": "Quaint old hotel!", "user": "WashingtonTraveler60", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34275376}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The staff were very pleasant and accommodating. The only drawback is the homemade breakfast is limited to bread products.", "title": "Good value in the middle of everything", "user": "swede1102", "date": "March 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 25499985}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Venice is expensive, but this hotel gave us an affordable option for a quadruple room. The hotel is cozy, but the room was small for four people. Nevertheless, it was good value for the money we paid, particularly when I compared to the options we had.", "title": "Cozy, Private Hotel Amid the Chaos that is Venice!", "helpfulness": 2, "user": "amandalynn0220", "date": "January 29, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24005334, "likes": {"liked": "— The coziness and the staff", "disliked": "— I can't think of anything! Great Hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "The great thing with this cozy hotel is that it's in the middle of everything. A five minute walk from San Marco Square and a five minute walk away from Rialto Bridge.", "title": "Venice is magical!", "helpfulness": 3, "user": "SoLucky2Travel", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21012997, "likes": {"liked": "— Convenient location", "disliked": "— Nothing...I was in Venice!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "booked via [--]", "title": "Excellent location!", "helpfulness": 1, "user": "AroldoSilva", "date": "January 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6598786}, {"rating": 2.0, "stay_parameters": "Stayed August 2006", "text": "Location", "title": "quaint old fashioned", "helpfulness": 2, "user": "westiekate", "date": "September 3, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 5764937}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "Excellent, a few steps to San Marco square. is a trully bargain in Venice", "title": "Safe and sound", "helpfulness": 3, "user": "SKYEYE", "date": "August 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5707763, "likes": {"liked": "— Location and cost", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The Staff", "title": "Value for money", "helpfulness": 5, "user": "Molepolole", "date": "August 2, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5544940, "likes": {"liked": "— very good value for such a central location", "disliked": "— vile breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Friendly and polite.", "title": "Great value", "helpfulness": 8, "user": "Remanso", "date": "June 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5325563}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 2, "variance": {"poor": 7, "average": 27, "very good": 100, "terrible": 4, "excellent": 67}, "aka": "Serenissima Hotel Venice", "slim_ranking": 0.359580052493}