{"user_rating": 4.5, "review_count": 1281, "name": "Hotel Adlon Kempinski", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We had a wonderful week at this hotel. Our room did not have a great view but it was quiet and met our needs. The Concierge made my stay perfect. The help and guidance I got each day helped me plan the perfect stay for me and the weather. The food here is very expensive. Breakfast is $30 a person-not unreasonable for this kind of hotel. However, we had a hamburger and club sandwich in the lobby area and it was $$$$.. The location is right near the Brandenburg Gate but that can be a plus and a negative as everything happens there. If you are walking, it is perfect but if you need a cab they can't always get near the hotel. However, I am not sure you could find better service than the service at this hotel. It was a very enjoyable stay.", "title": "Fantastic, old world hotel and old world service: They care!", "helpfulness": 2, "user": "gjmh", "date": "October 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143239822}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I must say mostly because of the efforts of the Concierge: Ermano ( not sure I have the name right but if you look at the picture of the concierge staff he is on the far right)", "title": "A big hotel, but not necessarily a great hotel.", "helpfulness": 1, "user": "Sarcophilus_harrisii", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142923382}, {"rating": 5.0, "title": "Hotel boasting 4 different breakfast mueslis.......", "text": "The hotel has a long history, but we found a (very) big hotel that is just like any other big hotel in this class. Everything worked like a machine, nothing went wrong - but this is what can be expected for the king of money one has to pay. The hotel's decor is somewhat beige in colour, and so is its feel. The room was 'just' a hotel room, with slippers, bathrobes, and all the other things. Expensive mini bar, but no chocolates on the pillow at night. The prices in the lobby bar are high (a bit too high?), but the service and the drinks (and the food) are very good. The reception proudly announced, that we had been upgraded ... I knew that already, because I upgraded ourselves and paid for the priviledge a week before.", "helpfulness": 1, "user": "Lieutenant_Feraud", "date": "October 12, 2012", "id": 142630566}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Top quality hotel in prime location at the top of Unter-den-Linten, right by the Brandenburg gate. Rooms immaculate and spacious. Breakfasts rank amongst the best I have eaten in hotels. I was particularly impressed by the offering of 4, not just one, mueslis for breakfast. If you're trying to photograph the Brandenburg Gate, do so from one of the conference rooms on the second floor. If you're not actually a guest, don't worry, walk in as if you own the place and no one will ever challenge you !!", "title": "Elegant and luxury", "user": "Grisham73", "date": "October 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142611514}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "I spent two nights in the hotel, which can find at the city center, next to Brandenburg Gate. The Reichstag and Unter den Linden is few steps from te hotel. Te Museum-Ireland and TV-tower is not far away from the hotel.", "title": "Can't wait to go back", "user": "skinanny", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142463779}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This is the hotel MJ dangled his baby out of! Located a stone's throw from the Brandenburg Gate on the historic Unter den Linden. We had good access to the subway and public transport (bus). Also a quick walk to the Reichstag. The room was spacious and clean and included a small kitchenette, which we did not make use of. The bathroom was fabulous - complete with a separate make-up station!", "title": "Luxury & Location", "helpfulness": 1, "user": "JB0", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145858282}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Upon arrival we were offered chilled champagne. The staff was very professional and even went out of their way to track down a luggage stand for us. The beds were comfy and there was a, much appreciated, fresh bottle of mineral water waiting for us everyday. We didn't eat breakfast at the hotel as it was astronomically expensive but I'm sure it was also fabulous.", "title": "Breakfast Buffet", "helpfulness": 1, "user": "wincoernst", "date": "November 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 145820474}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The pool and hot tub are wonderful, clean and luxurious. Definitely get down there if you have time to relax. There is fresh orange & lemon water available for your refreshment while you swim, as well as a bar where you could enjoy a cocktail.", "title": "Excellent \"Historical\" Hotel", "user": "cjohann", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145324069}, {"rating": 5.0, "title": "Annoyed at first, but it's high quality", "text": "Free wi-fi. Quiet rooms.", "user": "Pat D", "date": "November 11, 2012", "id": 145167161}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The Adlon Hotel at the Brandenburg Gate offers a very opulent break fast buffet with free champagne and a choice of several fruit juices. Fresh fruit as well as an excellent choice of joghurts was very pleasing. The cold cuts, a speciality in Berlin, were not offered in the variety as one would find them in a well assorted super market in Berlin. The breads were just out of this world in their variety, tastes, freshness and shapes. The service is unobtrusive and very diligent serving coffee, teas, drinks or whatever one wants, immediately when the levels in the cups or glasses were low.", "title": "Definately now more of a conference Hotel", "user": "AndyBee", "date": "November 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 145067661}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Stayed here on business and was amazed at the quality & attention to detail throughout my stay. Rooms were brilliant & suites out of this world. Location is unmatchable in Berlin and the Brandenburg Gate at night a view to remember.", "title": "Adlon Berlin", "user": "jwr1972", "date": "November 6, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144771002}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Really, the hotel takes your breath away. Gorgeous building, massive imposing lobby and increadible views over the Brandenburg Gate, Reichstag and Tiergarten. Lots of high ceilings, dark wood, white marble and red carpets. Beautiful guest rooms with huge bathrooms, oversized bathtubs and rainbow showers.", "title": "Beautiful Property...Shame About the Rest!", "helpfulness": 5, "user": "geminigirl789", "date": "November 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 144594281}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "And I'll never go back.", "title": "Luxury hotel with inconsistent service but good service recovery", "helpfulness": 2, "user": "JSM8", "date": "November 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144402500}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel was hot. My room was overheated and stuffy-and the Adlon doesn't trust its guest to set the temperature, so the fancy comupter controlled air conditioning has a whopping 4 degree range. 20-24. That's right folks, despite your being able to afford the place, you can't be trusted to know what temperature you want your room!", "title": "Best Hotel in Berlin", "helpfulness": 2, "user": "Sirius_blk", "date": "November 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144249824}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The food was shockingly bad. The 'highlight' for me was my €18 caesar salad, which was a few leaves of butter lettuce, two shavings of parmesan cheese, a spoonful of Bacos-(fake bacon bits!!) and a thin citrus-y dressing. I sent it back and ordered the Tom Yum soup with prawns and chicken. Two small prawns and three bits of chicken. And another €18. I'd wanted to try their Italian restaurant, Gabriellas, and was given directions to get to it by one of the bellmen as it can't be reached from inside the hotel. I wandered up and down the street in the rain for ten minutes before giving up and going back in. I asked at the front desk if perhaps I'd misunderstood, only to be told that Gabriella's had closed 6 weeks earlier.", "title": "Sheer Luxury!", "helpfulness": 2, "user": "BrianofLondon", "date": "October 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144137621}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Thank you very much for making our stay so memorable! The service in adlon is perfect, every hotel may learn from the team of Adlon how to smile, how to serve, how to exceed expectations. Even the look of the staff was great! Perfect uniforms, very clean, very good looking personnel!", "title": "Best impression of Berlin", "user": "Maria C", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144030021}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Food is amazing, choice at breakfast is very big. Location is the best in Berlin as well.", "title": "The very best in Berlin", "helpfulness": 1, "user": "sergio a", "date": "October 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143991770}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "For the second time I had the opportunity to spend a full week at this outsanding hotel, located in the best part of town. Never changes - always impeccable.", "title": "The best location ever!", "helpfulness": 1, "user": "Smityush", "date": "October 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143823090}, {"rating": 4.0, "title": "World class service", "text": "The service is superb and its cost is surprisingly much lower than any other hotel of the same category in Europe. It stretches the value of money, in a very positive sense. The breakfast is likely the best I ever experienced in my intense travelling life. I highly recommend it!", "user": "Lancburm", "date": "October 26, 2012", "id": 143739686}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I had wonderful experience in this hotel! Everything is up to very high standards. It is very beautiful building, comfortable and well kept, staff is very attentive. Naturally hotel charges (restaurant, etc) are high (around 30 euro for breakfast). Given great location, right on Unter den Linden near the Brandenburger Tor there are plenty of places where you can find great food so not having prepaid meals in the hotel doesn`t create many problems and gives you opportunity to discover surrounding areas.", "title": "Nice hotel in a very Good position", "user": "Alicia L", "date": "October 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143738857}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 28, "average": 71, "very good": 194, "terrible": 22, "excellent": 966}, "aka": "Adlon Kempinski Hotel", "slim_ranking": 0.024024024024, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}