{"user_rating": 4.0, "review_count": 1110, "name": "Hotel St. Marie", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Stayed at the St Marie last weekend. The hotel's location is great. Walking distance to everything. Rooms are small, but very clean and comfortable. I would stay here again, no problem.", "title": "Great location", "helpfulness": 3, "user": "ccmiami", "date": "December 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11655351, "likes": {"liked": "— location", "disliked": "— small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We ate an awesome restaurant in French Quarter called Irene's, amazing. Can't say enough about it. You will probably wait more than hour to be seated but defenitely worth it!!!! Also go to Mothers for po boys and Port of Call for the best burger in town.", "title": "Delightful!", "helpfulness": 1, "user": "NJAlison", "date": "December 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11512644}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I was a little worried after reading some of the reviews. We wound up being very pleasantly surprised. Yes, there was a bit of a musty smell but, otherwise, everything was fine--no complaints. The room was very clean and decorated very nicely. I think someone complained about the carpet needing a cleaning in a previous review--we did not find this to be so. The courtyard was lovely with a fountain and tropical plants. Since the restaurant was closed, they served a continental breakfast--coffee, tea, orange juice, croissants and danishes. You could hear the nightlife as soon as you left the front door, but our room (with balcony overlooking the courtyard) was very quiet. The staff was very nice, especially the man who attended to the breakfast area.", "title": "A Taste of the Real French Quarter", "helpfulness": 4, "user": "voudouJoe", "date": "December 5, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 11261591, "likes": {"liked": "— location", "disliked": "— the coffee in the room"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "This was our third trip to New Orleans. The first two places where we stayed did not beckon us to go back again, but we will definitely stay at Hotel St. Marie on our next trip to New Orleans.", "title": "Pretty Tired Property", "helpfulness": 3, "user": "72Westy", "date": "November 28, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 11110942}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Hotel St Marie is everything a French Quarter boutique hotel *should* be. If this is what you are looking for, you will not be disappointed. I would stay here again in a minute.", "title": "I really want to love this hotel.", "helpfulness": 3, "user": "KateALondon", "date": "November 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11011630, "likes": {"liked": "— The Location", "disliked": "— The noise from the street at 5.00am"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "We stayed at the Hotel St Marie for two nights. We were 4 adults and 9 teenagers. As a result we experienced a few different rooms. All of them were very comfortable and clean. Not a lot of character once you leave the common areas, but the rooms were spacious and well-appointed. Very good value for the price. We particularly enjoyed the balconies -- both those facing the street and those facing the inner courtyard. Also, the pool was very clean and refreshing. From past experience, I know that a French Quarter boutique hotel can be very iffy in terms of cleanliness and upkeep! Actually, it was not my first choice to stay in the French Quarter for just this very reason. While I did appreciate the condition of the hotel, every single room had a pervasive odor of disinfectant. As the hotel is within a block of Bourbon Street let's just say that I can appreciate the hotel's regular need for strong cleaning agents and would rather they be used than not. One other thing . . . while my room faced the courtyard and was very quiet, those rooms which faced the street were loud for much of the night. The staff was very friendly and helpful, honoring our request for rooms in close proximity and going out of their way to help with restaurants, directions and nearby services.", "title": "Hotel St Marie", "helpfulness": 2, "user": "LillianV", "date": "July 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8076829}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I recently stayed at the Hotel St. Marie over a long weekend in June 2007. Our room was a good size with a small balcony overlooking the courtyard. The courtyard is cozy with a pool and chairs and lots of folliage around. The hotel is 1 block from Bourbon St. which is great if you dont want to much noise after a long nite of partying. The beds were comfortable, great water pressure. The bathroom does not have a regular door, but rather a closet-type door. This was not a problem my guest and I are together. Our television was rather small, but we didnt spend to much time our room. There are 5 floors, we stayed on the 3rd. There is only 1 elevator which is kinda slow, but it bother me. The lobby is nice and quiet with chairs to wait around for guests if need be. The hotel staff was super nice the days we were there...from the valet to housekeeping. The valet/bellboy service is kinda sporatic, but when avaiable....they are friendly and courteous. My cousin staying at the hotel as well had to leave his keys with the front desk as the valet were busy parking other cars. Our room was cleaned later in the day which I had hoped would be done earlier. The price was excellent. I would stay here again. The restaurant downstairs has good food for breakfast and dinner. The hotel can be an intimiate place for a getaway weekend, as it was for us, or can be for a family stay as well. Remember that this hotel is not modern, but antique...which means things wont be as perfect as say the Omni or Hilton. We wanted an older hotel in the French Quarter and we got one....which was cool.", "title": "French Quarter Appeal", "helpfulness": 3, "user": "txfrnk1", "date": "July 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8056539}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "I have stayed at the Hotel St. Marie before and, in fact, stayed in the same room as I did before. Not that I am complaining, we had two rooms with an adjoining balcony that viewed all the way down Toulose Street. The hotel is what you would expect. It is a nice hotel, but what ruined my trip was the stay. Espcially, a gentleman working the desk and the general manager who did not handle my complaints, but was more worried about a bad review on trip advisor.", "title": "The hotel is great hotel, the staff is great except for the desk & GM", "helpfulness": 3, "user": "nolavisitor", "date": "June 28, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 8023691, "likes": {"liked": "— The location", "disliked": "— the staff"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "My complaint was simple, we needed to leave a room key for a travelor who was arrivig later. Although both rooms were paid for with the same credit and the same credit card was being held to pay for incidentials on both rooms, the gentleman at the desk would not allow the person who had booked and paid for the room to leave a key for the room because he was not listed as staying in the room. That may be understandable, but when we asked to either call up the room and have the person staying in that room to come down or check the computer to verify who was paying for the room, he refused. When we attempted to continue the conversation we walked away.", "title": "You will Love the St Marie", "helpfulness": 6, "user": "esamrei", "date": "June 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7968424, "likes": {"liked": "— Location and ambiance", "disliked": "— Room keys, not cards"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "At check out this same gentleman was working the desk, when I attempted to discuss this previous problem with him he walked away and called his general manager (whom I had talked to on the phone after the problem intially occured). The general manager came down and was more concerned about my tone with the desk employee and me leaving a bad review than he was about solving the problem or even apologizing for what occurred.", "title": "Great 1st Time Visit", "helpfulness": 1, "user": "iufanslw", "date": "June 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7936443, "likes": {"liked": "— My room had a small balcony which overlooked the street", "disliked": "— Elevators were slow - but that was sort of expected"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "stayed at the St. Marie recently. It does have an excellent location near the heart of Vieaux Carre. We paid about 75.00 without tax. Had I paid much more than that, I would have felt cheated. Nothing terrible mind you, but after waiting an hour for my bags to brought to my room from storage, I called to remind them. Still had to wait 30 minutes. The knob on the light switch was missing, rendering it impossible to use. Was told they would take care of it-they didn't. They did switch rooms from a view of the A/C units via only one small window, to a larger room with three windows. One suggestion, and this goes for all hotels, will you please put up another towel bar or at least a hook or two so we can have a towel at the sink and not fighting over towel rack space?!! One final comment re service. On our day of departure the valet pulled my car up, got out and walked away while I had two bags at the curb. Personally, I can go for carrying my own bags and skip the tipping, but this guy didn't even try. All he had to do was lift two small bags into the trunk and my two bucks would have been his two bucks.", "title": "Great location, average accomodations", "user": "tapstring", "date": "October 14, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 10079216}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "The Hotel St. Marie was a diamond in the rough! We found this hotel on another website, and having never been to New Orleans before, went in completely blind. Much to our surprise, the hotel was fabulous! It has that old fashioned charm you're looking for, a balcony, spacious rooms, comfy beds, and you're only a block off Bourbon Street! I can't compliment the staff enough, either. We came from from Pat O'Brien's completely famished, and the night desk clerk ordered us a pizza from a local hot spot, and it was delivered to the lobby by bicycle in ten minutes! I can't wait to visit again...we'll definitely be staying here when we do!", "title": "Fantastic Location, Wonderful Staff", "helpfulness": 1, "user": "Pontleau", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10058948, "likes": {"liked": "— Price, Location, and Helpful Staff", "disliked": "— Not a thing!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Great Hotel located 1 block off of Bourbon Street.", "title": "Enjoyed the Location", "user": "Sean_Owens", "date": "October 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10035443}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Best part about this hotel is the location, location, location. Right off of Bourbon Street, 2 blocks from Patty O's, and there's a Lucky Dog Vendor right up the road for that Midnight to 2am nosh that you're dying for after partaking of the numerous libations up and down the Quarter.", "title": "Not bad, but not great either.", "helpfulness": 1, "user": "LondonTrailfinder", "date": "October 1, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 10025967, "likes": {"liked": "— Location, location, location!", "disliked": "— Damp smell in room."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "Pro's", "title": "Unbelievably great location!", "helpfulness": 2, "user": "satxtourista", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8655365, "likes": {"liked": "— Price", "disliked": "— Drainage"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We've stayed at the St Marie a total of three times so far. We couldn't be more pleased with any of our experiences there.Each time just gets better!! The staff are friendly and helpful, the place is clean, and the pool is a welcome relief from the New Orleans summer heat! (along with the wonderful AC in the rooms) We've stayed in both street and pool facing rooms there, the noise from Bourbon has never been a problem. The location can't be beaten, it's right in the middle of everything, close to dining, bars, nightlife, easy walk to Cafe Du Monde and French market. We've always felt safe coming and going even late at night, there was never anyone hanging around that shouldn't have been there (which I can't say for other hotels I've stayed in) We didn't eat dinner at the hotel's restaurant, however we did eat breakfast at the Bistro, and while the ambiance was great (sitting in an open setting watching the quarter come alive in the morning) the food was nothing to write home about and was a little overpriced. We will probably skip the Bistro next time. We would recommend this hotel to everyone, we will stay at the St. Marie for our next visit to our favorite town.", "title": "3rd time's a charm!", "user": "sweetpearn77", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8618674, "likes": {"liked": "— Location, value, cleanliness, EVERYTHING!!!!", "disliked": "— nothing to complain about!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "P.S. The Gumbo Shop for dinner and Commanders Palace for the Sunday Jazz Brunch are definite musts while in town!!!!", "title": "The St. Marie was Fantastic!", "helpfulness": 1, "user": "MMMSanFrancisco", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8588712, "likes": {"liked": "— Close to everything, yet peaceful and quiet.", "disliked": "— I couldn't stay longer."}}, {"rating": 5.0, "title": "Hospitality Hotel", "text": "I recently stayed at the Hotel St. Marie with my wife and our 11 year old son. It was wonderful. The hotel is only 1 block away from all the action of Bourbon St. and walking distance to all the great restaurants in the French Quarter. Since it is off the main drag it is very peaceful and relaxing.", "helpfulness": 4, "user": "cape11honeysuckle", "date": "August 29, 2007", "id": 8539084}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "The hotel was very clean with beautiful architecture. Our room had a small balcony overlooking the street (very nice) with 2 beds in a very spacious room. The beds were very comfortable. They also have rooms with balconies overlooking a beautiful garden courtyard and a small pool. My son loved the pool. There is a restaurant (we didn't eat there) in the hotel as well as a bar. From the valet to the front desk, the staff at the St. Marie were very professional and friendly. If you're traveling to the French Quarter, you can't go wrong at the St. Marie.", "title": "Nice Hotel Great Location", "helpfulness": 1, "user": "westminsterboy", "date": "August 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8428912, "likes": {"liked": "— clean safe area", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "My daughter and I had travelled from California and were pretty weary. Big John greeted us in the driveway, had our SUV safely parked, and escorted us to the lobby. There we met Jerry the hotel clerk. She smiled, gave us a super rate and made us feel so welcome! We loved our room which had a balcony overlooking the French Quarter and Bourbon Street. The furniture was elegant, beds very comfy....It made us feel so safe and allowed us to walk everywhere to see the sights of New Orleans French Quarter. Thank you for making our stay memorable.", "title": "good place to stay", "user": "machinist13", "date": "August 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8396530}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "After reading some of the reviews we were going to stay elsewhere, however when that reservation got messed up we ended up in going to Hotel St. Marie. We stayed on the second floor with a balcony. It is a great location (one blk from Bourbon Street). The room was nice and clean - yes the doors can use some paint etc., but it was not bad. Not a 4 star but a good 3.", "title": "Great location, nice clean room", "user": "Kingwood1811", "date": "February 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 13549995, "likes": {"liked": "— Location", "disliked": "— Parking fee"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We felt secure and did not have any unexpected guest (rodents etc.). The staff was very helpful and friendly. Parking at $25.00 per night was expensive, but ........", "title": "The room I stayed in needs alot of work", "helpfulness": 3, "user": "jlsch1", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 13435862, "likes": {"liked": "— You could listen to live bands right off the Balcony off Burbon Street", "disliked": "— AC did not work and lack of staff to solve problem until late 2nd day of my stay"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Overall, ppl in NO realize that they need the tourist. Very nice and helpful. Went mid week, so it was slow.", "title": "ok stay for the money", "helpfulness": 2, "user": "oneheath", "date": "January 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 13008590, "likes": {"liked": "— location", "disliked": "— security"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "Had a room in the extension of the hotel which if you get a room in the extension go else where. Don't bring alot of bags due to you have to climb alot of stairs to bring up your luggage up to the room. You can see going up to the room they really don't maintain the hotel and it is an overpriced for the shape it is in.", "title": "Meh", "helpfulness": 1, "user": "dptesq", "date": "January 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12913648, "likes": {"liked": "— Location", "disliked": "— Mildew smell."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007", "text": "The room I stayed in needs alot of updating and the Air conditioning did not work. I came in on a Friday evening. It was really muggy and had to leave the windows open on the balcony to circulate the air due to AC did not work Friday night. Finally got a service person to respond Saturady evening around 5pm. When the guy came he said the AC worked which all he did was check the filter which was very dirty and then said it was fixed. Went to KPals to eat and came back to the room which was warmer and muggy. Called again and finally got another room due to the AC service person did not come out. Really aggravating to have to pack and lug luggage down the stairs a 10pm at night to get another room. They should have done this Friday night. At least the AC worked in the other room.", "title": "Our room was robbed", "helpfulness": 9, "user": "MZR", "date": "January 14, 2008", "detail_rating": {"cleanliness": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 12607645}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Our first visit to New Orleans (Fri. 'till Monday) and we were thrilled with our room at the St. Marie. The parking attendant was terrific, the check-in process quick and courteous, the maid service great and the continental breakfast steward was helpful each morning. We hated to leave. Great place!", "title": "Thumbs Up for the Hotel St. Marie!", "helpfulness": 1, "user": "Deniang1", "date": "November 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10969868, "likes": {"liked": "— The beautiful old french provencial room", "disliked": "— There was no down side. We loved it all."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The hotel St. Marie was a wonderful hotel. The room was much larger than I expected. The only thing I did not enjoy while there were the front desk agents. We only had to deal with them 2 times and both times they were extremely rude. The room we stayed in also had a balcony facing the courtyard and although it is right off bourbon our room was extremely quiet. I would definitely recommend this hotel to anyone and I will be staying there the next time I go to New Orleans", "title": "Loved The Marie", "helpfulness": 1, "user": "hawynangl87", "date": "November 3, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10567102, "likes": {"liked": "— the room", "disliked": "— the front desk"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "After coming from Cape Girardeau, MO to New Orleans every year, we found the St. Marie four years ago and now consider it our New Orleans \"home.\" Unlike so many other hotels, the staff - from the manager to the front desk to the bellman, the housekeepers, everyone...is very friendly. We have stayed in the historic part of the hotel, which is a real treat if a room is available (those go fast). The regular rooms are quite nice, large, lots of bells and whistles (though we wish the rooms had mini-fridges), including free internet access. The courtyard is small but attractive and restful. Hillery's is one of the best places in New Orleans to dine, and the Bistro turns out great breakfasts at reasonable prices. The streetside bar is a fun place to start a conversation with locals or other visitors, and Gregory the bartender is absolutely wonderful. Here's just one example of how accommodating the staff is...as we were checking out, two women were checking in. They asked if the hotel had a business center with computers. The manager said no, it didn't, but if they needed access to a computer over the weekend, he would arrange for them to use his. When you walk into the St. Marie, you don't get the feeling that staff is being nice because they have to...you truly feel they are happy to see you.", "title": "It Has to be the St. Marie!", "user": "SallyRay", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10505687, "likes": {"liked": "— Location", "disliked": "— No room refrigerators"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "My friend and I decided on this hotel after some major searching. We were very pleased with our stay here. We went for Halloween and the rates were reasonable. It's a good location if you want to experience Bourbon Street or the French Quarter because it's centrally located. Can be noising being so close to Bourbon, but it didn't cause us any problems. Rooms were clean, but not fancy. Had a charm of the old hotel. Don't expect the Four Seasons, but they are well appointed rooms and the staff is helpful.", "title": "A PLACE WITH CHARACTER", "helpfulness": 1, "user": "WildFan", "date": "October 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10483710, "likes": {"liked": "— LOCATION", "disliked": "— NO ELEVATOR IN OUR PART"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I was in New Orleans because the University I graduated from was playing Tulane in football. Unfortunately/Fortunately, it was also Voodoo Festival Weekend.", "title": "Overall nice...but noisy..", "helpfulness": 1, "user": "MemphisWinelover", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10457438, "likes": {"liked": "— Great service and wonderful decor", "disliked": "— Noise from outside"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This hotel was chosen for us through Priceline and we couldn't have been happier. We paid only $80 per nite and we stayed 2 nites. It's an older hotel full of charm. There's a pool in a very relaxing garden out back. Many of the rooms have balconies.", "title": "Loved the service!", "helpfulness": 2, "user": "dukes225", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17228121, "likes": {"liked": "— Staff", "disliked": "— our room had no balcony"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We loved its' location in the French Quarter. You're close to everything, but since it's on a side street, it's quiet.", "title": "It was ok.", "helpfulness": 4, "user": "specialteacherTexas", "date": "June 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 17214314, "likes": {"liked": "— location, courtyard was charming", "disliked": "— moldy smell in room, filthy carpet"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The first room had a problem with the shower, but we were given another room right away. When I got back from a seminar, our bags were in our new room.", "title": "Yuck!", "helpfulness": 5, "user": "MarineCorpsWife", "date": "June 20, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 17086027, "likes": {"liked": "— Valet service", "disliked": "— Condition of room"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The staff was amazing. In particular, Sandy at the front desk, was very helpful. We got there too early for check-in, but our bags were stored and we were called as soon as a room was ready.", "title": "True New Orleans feel", "helpfulness": 2, "user": "tkeiy609", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16969584, "likes": {"liked": "— Access to Bourbon Street and French Quarter", "disliked": "— Noise from night life"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "The restaurant is under renovation, but there was a complementary continental breakfast available every morning.", "title": "Nice staff, but really damp", "helpfulness": 2, "user": "Sarah_the_Critical", "date": "June 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16862584, "likes": {"liked": "— Convenient location, if you want to stay in the French Quarter", "disliked": "— Damp floors were icky"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "This was the second time staying here. We had stayed last year as well. We have a special place in our heart for this hotel. It is great and homey. Unfortunately the restaurant is no longer there and they are working on getting a new tenant. Remember that many places are still trying to get their businesses in order after the Katrina tragedy. Staff is very friendly and helpful and courteous to your needs. If you are looking for state of the art high frills kind of place, then look else where. If you are looking for a good boutique, old charm New Orleans hotel then make your reservations now.", "title": "Great As Usual", "user": "63impala", "date": "April 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 15122551, "likes": {"liked": "— The charm", "disliked": "— The elevator"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We requested a room on the Toulouse side of the hotel over a month in advance, (and contacted them to remind them of this request twice before we arrived) and when we got there the guy at the check out desk put us no the other side and said, \"Well, it says all over the reservation not to move your room, but someone did anyway.\" No apologies, just too bad for me. The room was dirty, the pillows were completely flat, and the TV picture was so bad that it was almost unwatchable. The worst part is, when I told them I was unsatisfied with my stay, they acted like they didn't care. no apologies, no nothing, just too bad for me again. If all you care about is trying to be near Bourbon St., then the price isn't bad, but there are plenty of hotels near Bourbon that are probably comparable and since the service was about as bad as it gets, anywhere else has to be better.", "title": "Bad experience all around", "helpfulness": 3, "user": "RABThird", "date": "April 12, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 14992118, "likes": {"liked": "— Close to Bourbon Street", "disliked": "— Horrible Service"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Our stay was great and the price was great for being so close to everything. Stayed three nights in room facing Toulouse Street. The hotel has a awesome location in the french quarter. The room was nice and beds were comfortable. We had a wonderful balcony that featured a table and chairs to enjoy the evening entertainment.", "title": "Great Stay-little loud", "helpfulness": 1, "user": "BUcinTX", "date": "March 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14474029, "likes": {"liked": "— location", "disliked": "— noise from outside"}}, {"rating": 5.0, "title": "Quaint, clean and professional, great location", "text": "The only drawback was hearing the Opera House most of the night. We are early birds so that didn't help. Guess it should be expected so close to Bourbon St.", "helpfulness": 1, "user": "whiskeytango17", "date": "March 7, 2008", "id": 14127099}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This is a great stay in New Orleans. The hotel provided great service and the staff was very professional. The rooms/hotel were very clean and nicely decorated. The rooms have balconies that overlook and beautiful courtyard. To top it off, it's right in the heart of the French Quarter about a 1/2 block off Bourban Street on Toulouse. I will stay there again and would definitely recommend it to others.", "title": "fantasic stay", "helpfulness": 1, "user": "zeusrdr", "date": "March 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14041521, "likes": {"liked": "— location", "disliked": "— bathroom doors were NOT solid"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stayed at the Hotel St. Marie in New Orleans for one evening earlier this month. And although the hotel is very charming and comfortable, be aware that you may encounter a few mice sharing the room with you.", "title": "Nice Hotel, but be mindful of the rodents.", "helpfulness": 3, "user": "FLYMYGLI", "date": "January 8, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 12429306, "likes": {"liked": "— The charm and location", "disliked": "— The non-responsiveness of the hotel staff. And most importantly, the rodents."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007", "text": "We'd contacted the front desk to report the sightings of these uninvited guests and asked them to send up someone to investigate (just so that the hotel would know that this was a problem). It was around 1:00AM and the person at the front desk asked us if we wanted to change rooms. We told them that since it was such a late hour and that it wasn't really convenient to switch rooms just yet, but we wanted someone from the staff to check it out and then we'd assess from there.", "title": "Just...so,so....", "helpfulness": 4, "user": "artman60", "date": "January 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 1.0, "location": 5.0}, "id": 12305181}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "No one from the hotel staff ever showed up and after investigating ourselves (moving furniture and looking underneath the bed and armoire), we decided that we could find no more sightings of mice and attempted to get some sleep (of which we did not get a lot of with one eye open).", "title": "Good choice for a quick trip", "helpfulness": 2, "user": "McBizzle1", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12198384, "likes": {"liked": "— Proximity to Bourbon Street without all the noise", "disliked": "— Dark rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "Upon checking out the next morning, we mentioned to the front desk clerk that we'd experienced mice the night before and that we had called the front desk and requested that someone from their staff come up to investigate, which did not ever happen. Their response was 'oh, I'll make a note of it.' We weren't looking for any compensation or to raise a huge fuss as other guests were checking in, but we felt that the staff should be more concerned that mice were present in the rooms of their hotel.", "title": "Outstanding Hotel", "helpfulness": 1, "user": "FlyFlinger", "date": "December 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11972313, "likes": {"liked": "— Location", "disliked": "— Hallway noise (thin doors)"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "If you aren't fond of small furry rodents sharing your hotel room with you, I would book elsewhere.", "title": "Great Stay!!!", "helpfulness": 2, "user": "frankgrimes7", "date": "December 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11918466, "likes": {"liked": "— Location", "disliked": "— Valet was slow"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We stayed at the Hotel St. Marie from May 27th through the 31st. Overall the Hotel was a very nice place to stay. We upgraded to a balcony room over Toulouse St. which was very nice to be out on in the evenings. Very little noise from Bourbon St. when the doors were shut at night. The bed was actually very comfortable and the maid service was efficient. The whole staff was helpful and gave us easy access to get where we wanted to go.", "title": "very nice hotel", "helpfulness": 2, "user": "helenomia", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16771918, "likes": {"liked": "— comfort of the room", "disliked": "— the placing of the table with lamp, cord strung across floor in front of balcony doors"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "I stayed at the St. Marie while on business recently and had one of my best hotel experiences anywhere! The staff was efficient, informative and cordial (special nod to Caleb, the night desk officer who instantly replaced a non-working coffee maker with a brand new one when I reported it!) The room was immaculate, thoughtfully prepared for me each day, and the general environment was interestingly decorated, and quiet. A simple yet delicious continental breakfast was laid out early each day, and was tidied and replenished constantly. This is reflective of the sense of overall attentiveness at the St. Marie, as is the daily complimentary paper by the elevator. The breakfast room is surrounded by windows looking out on the corner of Dauphine St., providing an interesting early morning French Quarter street scene. Guests greet each other, and there is a general feeling of", "title": "Simply Exceptional", "helpfulness": 2, "user": "nanc119", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16490547, "likes": {"liked": "— Location, cleanliness, decor, staff", "disliked": "— somewhat limited access to technology if traveling w/out laptop - expressed in guest questionnaire & responded to by hotel graciously"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "welcoming throughout. I was within walking distance of everything I needed, including my business, and although you are close enough to hear some of the sounds of nearby Bourbon SStreet, I enjoyed a sense of peace and interesting river to park views from my beautiful wrought iron balcony. As familiar favorite spots change with economic fortunes in New Orleans, it was my great fortune to find the St. Marie, and I will recommend it and definitely stay again in the future!", "title": "Quaint & enjoyable.", "helpfulness": 1, "user": "thevnilly", "date": "May 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16308562, "likes": {"liked": "— Balcony in room.", "disliked": "— Smell of first floor."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We stayed in one of the king balcony rooms. The first floor was still undergoing renovations & had a bad smell to it. The room was small, but not a problem. I think the balcony is what really made it special. It was nice to come back after walking around the French Quarter and relax on the balcony or at the small courtyard. Staff was friendly and accommodating. Would visit again.", "title": "Best hotel in New Orleans!", "helpfulness": 1, "user": "Passport78", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16155638, "likes": {"liked": "— Location!", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Have been to New Orleans four times and this hotel is the best! The location is wonderful, not even a block away from Bourban! The hotel decor is very charming and the pool area was great! The rooms are huge! I stayed in a queen sized room with three other girls and we had plenety of room. We requested a balcony so that we would have a view of Bourban Street which was really nice. The staff was wonderful! We had a 6am flight and the staff made sure that we didnt have any problems with getting a cab to the airport so early in the morning.", "title": "Excellent Stay!!", "helpfulness": 1, "user": "tiffjs11", "date": "May 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16040983, "likes": {"liked": "— My room", "disliked": "— Internet wi-fi a bit sketchy"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "I just stayed at the St Marie and had the best time! The hotel is beautiful and is in the perfect location. The staff was so nice and the rooms make you feel so comfortable! I stay there every year on my birthday and will definately continue to do so.", "title": "Amazing hotel!", "user": "jillian801", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8379371, "likes": {"liked": "— Location", "disliked": "— None"}}, {"rating": 4.0, "title": "Great Hotel", "text": "We had a wonderful experience at this hotel. The staff were very accomodating and friendly. There is one guy who works at the front desk who is very arrongant and makes you feel like you are a bother or not wanted there, but the rest of the employees were great!", "helpfulness": 1, "user": "Frankie50", "date": "July 31, 2007", "id": 8266864}, {"rating": 4.0, "title": "Excellent location", "text": "Great location and quiet as well! We will definitely be returning within the next year or so.", "helpfulness": 2, "user": "Gringa222", "date": "July 25, 2007", "id": 8232197}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We traveled to New Orleans for the last weekend of Jazz Fest and stayed at the St. Marie. Excellent location for everything in the French Quarter! Our room was average size, nicely decorated, clean and had a 'balcony' that overlooked the small pool in the courtyard. The balcony is just big enough to stand on so don't think you're going to sit out there! Air conditioner worked great which was a good thing since the temperatures were in the 90's with the same humidity! Man was it hot! Didn't like the fact that there were no safes in the bedroom- had to use safes by front desk. Not a major inconveniece but would have been nice to have one in the room for the camera, iPod, money, etc. I was worried about street noise due to location but it wasn't an issue at all! Staff was helpful, bar was good but a bit pricey. Stay away from the restaurant . . . we went down for Sunday breakfast and ended up leaving due to NO SERVICE. Will definitely stay at the St. Marie again- location, location, location!", "title": "St Marie - Location To Be", "helpfulness": 1, "user": "Jazmincleo", "date": "July 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 8109209, "likes": {"liked": "— Location", "disliked": "— It was a bit grubby, the air con was too cold and the mattresses need errrrm, well maybe new beds would be a good investment"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Staying with friends in Louisiana for a few weeks, we were invited to a corporate event in town on the afternoon and so decided to book a room at a French Quarter Hotel and have a night on Bourbon Street afterwards than drive 40 miles home.", "title": "Nice French Quarter Location", "helpfulness": 2, "user": "KJR0711", "date": "July 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8108494, "likes": {"liked": "— Location", "disliked": "— One (very slow) elevator"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "A very average stay. This is a nothing special hotel. We had a room with a private balcony and the outside doors had a gap between the floor and the door so you could hear everything outside. Not a huge deal as it is the quarter and you are dealing with old buildings. I will say though that the gap between the floor and the room door leading to the hallway is HUGE! We're talking about an inch here people. Walking down the hall you can hear everything that goes on in each room.", "title": "Just Average", "helpfulness": 4, "user": "Paul H", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 15997569, "likes": {"liked": "— The location", "disliked": "— The gap between the door and the floor"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "No ceiling fan in my room which I have gotten used to in the quarter. The TV is on the smaller side and old. They need to upgrade. On the positive side it is close to all the action of Bourbon and is nicely decorated. If you spend under $100/night then it's worth it. Otherwise keep on looking. This is a bland choice, you can do better.", "title": "LOVED the Hotel St. Marie !!!!", "helpfulness": 1, "user": "saintaugustineFLgirl", "date": "May 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15939580, "likes": {"liked": "— ideal location, and great staff", "disliked": "— no complaints at all"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "i have been to new orleans many times and now this will be the hotel of my future stays. i was traveling with a first time visitor and i just couldn't drag her off the property. we slept in, enjoyed the balcony, they had fluffy croissants and the best coffee, took a dip in the pool and lounged in the courtyard. the front desk staff was helpful and patient. they all went out of their way to help us locate everything we needed. by far one of the most pleasant hotel stays i've ever had and the highest recommended stay in new orleans. oh... and don't underestimate the power of the valet. not only are they kind,professional and dog gone fast but they were of great service also. forget the visitor information centers, stop and talk to Jason in the parking garage. he's the sophisticted southern gentleman with all the information you could need. he's got the best of new orleans down pat and may just let you in on the best local hangouts, sites off the beaten path and all the neat places that'll keep you coming back to new orleans time and time again. enjoy this place-you won't forget it!", "title": "Great Find IN Orleans", "user": "thebeachishome", "date": "April 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15486274, "likes": {"liked": "— Staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Folks my wife and I went on our 6th aniversary. This is our 4 trip together my eighth. This was our fist stay here and is our of our favorites. Great location. Staff was great. Bellmen and Vallets great! Ask for some breakfast suggestions at the front desk I have no doubt you will end up at our new favorite breakfast in N.O. Enjoy the flavor.", "title": "New Orleans Rocks", "user": "DallasTequilarose", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15430729, "likes": {"liked": "— walking distance to everything we wanted to do. Very comfortable and clean", "disliked": "— no dining services . Finding a place to eat breakfast was a problem for us.mimi fridge in the room would be nice."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2004, traveled as a couple", "text": "This was our first trip to New Orleans and we enjoyed it so much we are already making plans to come back. The Hotel St. Marie was very clean and nice and the entire staff couldn't have been more friendly or helpful. Our only negative was the dining room being closed for construction. The complimentary sweet rolls and juice were appreciated but after a day or two we'd much rather have a real breakfast to start the day of non stop activities.There is so much to do in New Orleans and we felt so welcome by all who work and live there. Thank you for such a wonderful mini vacation and we will definitely return to the Hotel St. Marie.", "title": "We loved it and can't wait to go back!!", "user": "valandjohn", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15416030, "likes": {"liked": "— The whole package - very historic and homey at the same time...", "disliked": "— The restaurant is being renovated, but the continental breakfast was great"}}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 3, "variance": {"poor": 77, "average": 150, "very good": 442, "terrible": 36, "excellent": 405}, "aka": "St Marie Hotel", "slim_ranking": 0.4, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Intimate French Quarter Hotel situated 1/2 block off Bourbon Street & 5 minutes from central business district."}