{"user_rating": 4.5, "review_count": 961, "name": "Hotel Lancelot", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled solo", "text": "I had a great stay at Hotel Lancelot. I was there several days in the begining of June. The hotel is in a great, quiet accessible neighborhood just 3 blocks from the Colosseum. The neighborhood is residential and filled with great small trattorias, and numerous interesting churches and historical sites.", "title": "Great affordable Hotel, with very helpful staff.", "helpfulness": 16, "user": "ruws5", "date": "August 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5559235, "likes": {"liked": "— The great staff and location and price.", "disliked": "— Towels could have been thicker."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "The Hotel is run by Mrs. Kahn who is lovely and her daughter and a wonderful helpful staff. The room that I was given was absolutely emaculate.", "title": "An excellent value in an interesting area...", "helpfulness": 11, "user": "gene", "date": "July 29, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 5526117}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The staff at Hotel Lancelot could not have been nicer. They were extremely knowledgeable. At one point I mentioned that I had entered a church that had beautiful mosaics. Instantly one of the staff members pulled out a map and said \"well if you are interested in beautiful mosaics..go to this place and this church and this is how to get there.\" I did and they were absolutely right. It really made my vacation in Rome very special to see things that were not necessarily in the guide books but that were known by the staff and locals. I had a great appreciation of Rome and its history because of the great staff at this hotel", "title": "Great Hotel in Rome", "helpfulness": 11, "user": "artgaldm", "date": "July 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5430247}, {"rating": 4.0, "title": "Lancelot hotel", "text": "I basically took a chance on this hotel, having seen some good reviews in some of the guide books and on this website. I am very glad that I did. If I am in Rome again I will not hesitate to stay there again.", "helpfulness": 11, "user": "007wife", "date": "July 1, 2006", "id": 5415442}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at the Lancelot for five nights mid June based on reviews on Travel Advisor. We found reviews to be accurate and our experience was generally a good one. We booked the sixth floor room with terrace which was really nice as the room was very small and it was great to sit out there and see the colliseum especially at night all aglow in lights. General Celio area is really neat and as I had been to Rome many times I enjoyed staying in a less crowded area and the little restaurants in the area were great and reasonably priced. Staff at hotel very nice and if you needed breakfast before they open they would make a note and be there in the morning open for you. It was very very hot and our A/C was not functioning up to par and we really got no response from front desk in solving the problem...only complaint about the Hotel. Since it did work somewhat we just made the best of it but I did feel we were blown off with respect to that situation. For the money this is an excellent choice in Rome and the location although not totally central was good and easily accessible to all modes of transportation and taxis were very easy to get .", "title": "Fab & Friendly", "helpfulness": 5, "user": "mda_yorkshire", "date": "June 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5372168}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed at the Lancelot for a week. Pluses are the terraza rooms overlooking the coloseum, staff, and free WIFI. The hotel cost $300/", "title": "The hotel is just a two star accomodation", "helpfulness": 1, "user": "MarianaG", "date": "June 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 17115101, "likes": {"liked": "— free WIFI", "disliked": "— the lousy bed"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "night. The breakfast is the same everyday and it gets crowded in the dining room. The hotel is used by as a departure point and return point for people on cruises and thus the ebb and flow of tourists. Our bed was a double and it was OK. It is not a bed you want to spend any time in, just sleep. The bathroom was small, like a sink, a toilet, and ultra-small shower. The room had a safe which was good. We left a computer in a dresser and never had any problems with theft. Laundry is cheap and done quickly by hotel staff. The room is not set up to work, there is no desk, just antique furniture and dressers. The neighborhood is OK. There are lots of restaurants but you need to watch out for tourist traps. One place had the audacity to charge us 6E for a beer. The gelato is great!!!! I liked the non-tourist neighborhood behind Via Nazionale. Walk to the taxi stands if you need one. The hotel did not impress us.", "title": "Beyond Perfection!", "helpfulness": 5, "user": "kppr", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17018985, "likes": {"liked": "— Helpful staff.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "What can I say that hasn't been said? The rooms are charming and spotless. The staff is beyond helpful and friendly. The location is supreme. The breakfast and breakfast room are lovely and well staffed. The front desk staff thinks of things you need before you know you need them. The lobby area is a comfortable and inviting spot to relax and/or meet up with friends and family. I will recommend this hotel to anyone going to Rome and hope to return myself soon.", "title": "We loved this place!", "helpfulness": 4, "user": "heiho", "date": "June 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16949487, "likes": {"liked": "— Friendly staff, great room, great location", "disliked": "— No complaints!"}}, {"rating": 5.0, "title": "Fantastic!!!!", "text": "I cannot recommend this hotel highly enough! This was the perfect place to stay in Rome - just a few blocks from the Colosseum and Roman Forum, and an easy walk to most other attractions. Mrs. Kahn and her staff were friendly and accommodating even from my first email inquiring about rooms. Our room was good-sized, very clean and new with a nice bathroom, comfy bed, and even a small balcony. Staff seemed to go out of their way to be friendly and helpful, whether it was to call a taxi, help us find a restaurant, decipher a map, or tell us the day's weather forecast. Before we arrived, they gave us detailed instructions on how to most easily get there, and even specified which kind of taxi to take from the train station (metered) and the approximate cost (we narrowly escaped being charged three times the price, so were very grateful for the information).", "helpfulness": 4, "user": "richsea", "date": "June 14, 2008", "id": 16925872}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "Dinner at Hotel Lancelot was 25 Euros per person, which included a 3 course meal, wine, and coffee. We sat at \"round tables\" with other guests, and shared stories of our travels at the end of the day. The Hotel Lancelot was one of the highlights of our trip. We would definitely stay there again.", "title": "Lancelot! Excellent value for your money!", "helpfulness": 2, "user": "shipwreck", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16854019, "likes": {"liked": "— Clean and close to everything", "disliked": "— everything was great"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We had just the most amazing time in Rome- and the Hotel Lancelot was part of it! 3 days- too short but long enough to want to come back.", "title": "Fantastic location", "helpfulness": 2, "user": "Gerlinde8", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15511262, "likes": {"liked": "— location", "disliked": "— no tea and coffee facilities in room"}}, {"rating": 4.0, "title": "Great Customer Service at Hotel Lancelot", "text": "I stayed there with my 2 daughters and we all felt very welcome.", "user": "Sapper123", "date": "April 26, 2008", "id": 15378733}, {"rating": 5.0, "title": "Great location, great staff, great everything!", "text": "The room was very clean and well kept.", "user": "Lisa1446", "date": "April 21, 2008", "id": 15196364}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The Hotel has a great location about 5 min away from the Colosseum and everything else is walking distance - at least we thought so. We even walked back from St Peters and it was very enjoyable. I could recommend the hop on hop off bus we saw a lot.We also booked dinner there and we met some very intersting people every night. The food was very nice and the service very good and friendly.", "title": "Convenient Location", "user": "psu2kids", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15008261, "likes": {"liked": "— Friendly staff.", "disliked": "— Noise."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Overall I would recommend this hotel to all my friends-", "title": "wonderful hotel", "helpfulness": 1, "user": "kezymc", "date": "April 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14987468, "likes": {"liked": "— THE SERVICE", "disliked": "— NOTHING"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at the Hotel lancelot because of its location but were not disappointed by the service provided either. The staff were incredibly friendly and helpful able to give information on the sites, transport options etc. The rooms were clean, reasonably spacious if simple in design.", "title": "A Close Roman Experience", "helpfulness": 2, "user": "DarrellM77", "date": "October 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5957728, "likes": {"liked": "— The Service", "disliked": "— Very Simple"}}, {"rating": 5.0, "title": "Wonderful Hotel & Service at the Lancelot", "text": "We could just about see the Colosseum from our window but it was no more than a five minute walk to either the great stadium or the Roman Forum. There were several excellent restaurants nearby also so we did not take advantage of the \"roundtable\" eating experience offered by the hotel although judging from the noise coming from the restaurant each time we passed the atmosphere was clearly being enjoyed. The only downside was that breakfast was quite simple and not particularly inspiring.", "helpfulness": 5, "user": "Zampano", "date": "October 9, 2006", "id": 5931253}, {"rating": 4.0, "stay_parameters": "Stayed September 2006", "text": "If you are looking for a straightforward hotel in a good location, with friendly service, but not too expensive, then the Hotel Lancelot is for you.", "title": "Perfect Hotel", "helpfulness": 4, "user": "RogerRabbitsRun", "date": "October 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5920380, "likes": {"liked": "— Friendly", "disliked": "— All ok"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed at the Hotel Lancelot Sept 13- 17th and were very pleased with everything about this small, lovely hotel.", "title": "A Great City Hideaway", "helpfulness": 7, "user": "matkustaja", "date": "September 8, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5779396, "likes": {"liked": "— Excellent location, helpful staff, quiet and clean room", "disliked": "— Ro"}}, {"rating": 5.0, "title": "A Wonderful Hotel in Rome", "text": "On a previous trip to Rome we stayed in the Piazza Navona area and although it was fine we definitely liked the quieter and more neighbourhood type atmosphere of the Lancelot. Not to mention it is only minutes from the Colosseum and Forum.", "helpfulness": 6, "user": "scphel", "date": "August 22, 2006", "id": 5694082}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "Best location we could pick for what we did. Bus stop is right there and you can walk to the Metro. The staff was helpful and nice. The rooms were nice and clean. We got a balcony which was beautiful. A little loud since the walls are thin, but nothing that bothered us. I would definitely pick this place again if I was staying in Rome and recommend it to all of my friends/family.", "title": "Great Value and Location", "helpfulness": 2, "user": "trendytraveler11", "date": "June 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16703148, "likes": {"liked": "— Value and Location", "disliked": "— Noise in AM"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Regarding the \"Above & Beyond Service\": We met the owner/chef, Faris Kahn, on our first evening. They serve a 3-course dinner where guests dine together round table style--nice guests including Kiwifamily5 (they wrote a review too). Faris dines with his guests and we had the good fortune of having him at our table the first night. We opted to dine out on night 3 and I chipped my molar & cracked my temporary crown--was very upset about my \"lost in translation\" experience with the restaurant staff. Faris noticed that I was upset when we returned to the hotel, provided kind words, and drove and translated for me at 24-hour dental clinic--didn't get back until past midnight!!!", "title": "Above & Beyond Service", "helpfulness": 5, "user": "WarriorPrincesses", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16357106, "likes": {"liked": "— Exceptional Staff and great location", "disliked": "— slow internet access"}}, {"rating": 5.0, "title": "Great Location, Lovely Place", "text": "We (husband & I) stayed at the Hotel Lancelot for 4 nights. It is the perfect location, a few blocks from the Coloseum--there was nothing like walking past the symbol of Roman history as we set out every morning to explore and again as we returned to the hotel! There is a Coloseum subway stop and that stop is just two from the main subway terminal where the 2 subway lines intersect. There are also quite a few restaurants & gellaterias within a few blocks but the hotel itself is at the end of the street so it is quiet!", "helpfulness": 5, "user": "m b", "date": "May 20, 2008", "id": 16251447}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Rooms: Small but clean, excellent powerful shower! Very comfortable, firm bed (my husband is picky & tall)! FREE wireless internet, we brought our laptop. You will want to check fees (if any) if you do not have your own computer.", "title": "Glasgow to Roma May 2008", "helpfulness": 4, "user": "Louisa67", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16191096, "likes": {"liked": "— Spotlessly clean. Very very comfortable bed. Loved the first floor terrace."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Breakfast: Good selection continental breakfast, includes fresh fruit, yogurt, sweet & regular rolls, some meats & cheese (spread).", "title": "Great hotel, helpful staff.", "helpfulness": 4, "user": "kiwifamily5", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16177219, "likes": {"liked": "— Staff spoke excellent English, were helpful and accomodating. Hotel clean and very nicely presented.", "disliked": "— nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "just spent 4 nights (28/1 TO 1/2) at this great hotel ,very central and in a very lively area with good restaraunts and pubs try the Camden Town Irish pub very friendly staff 3 mins from the hotel,come out of the hotel turn left and then take the second left its 20m up the street.", "title": "good hotel", "helpfulness": 3, "user": "debar56", "date": "February 3, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 3.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 24187395, "likes": {"liked": "— location and friendly staff", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Great hotel, great location", "text": "The room was ok in size with a great bed and a balcony. the bathroom was small but it had everything and it had a great shower. Good breakfast with plenty food available and very friendly english speaking staff.", "helpfulness": 1, "user": "JuKaB", "date": "February 2, 2009", "id": 24084207}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "I spent a week at the Lancelot at the end of December/beginning of January. It's a very pleasant hotel in a quiet side street three minutes from the Colosseum. There were five of us and we stayed in the family room, which was spacious and comfortable, even with the extra bed. A previous reviewer complained about the size of the bathroom, ours was a good size (my son is 6'3\" and he had no problems taking showers). The breakfast was very good quality and plentiful. The staff were friendly and helpful. It was a great experience overall!", "title": "Excellent stay at the Lancelot", "helpfulness": 5, "user": "mountainflower", "date": "January 21, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23760378, "likes": {"liked": "— Location and dinners!", "disliked": "— Everything was great."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "My husband and I stayed at the Hotel Lancelot for a couple of nights before going on a cruise from Civitavecchia. We booked direct with the Hotel via email and they were most helpful and polite in all their dealings with us before the stay.", "title": "Great hotel!", "helpfulness": 1, "user": "rsm0329", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 23345531, "likes": {"liked": "— Amazing staff, location", "disliked": "— No iron, small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We booked a transfer from the airport through the Hotel and were duly met by their driver who gave us a very interesting commentary on the journey, pointing out all the main landmarks along the way. The location of the hotel is ideal, the Colosseum is literally at the end of the street. There is a Hop-On-Hop-Off bus stop just near the Colosseum where you can take a tour of the city on an open-top bus. We did that to get our bearings before deciding how to get around for the rest of our stay (we mainly walked).", "title": "Great Location, Enjoyable Stay", "helpfulness": 1, "user": "Philrdg", "date": "January 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 23323820, "likes": {"liked": "— Friendliness and the Terrace Views", "disliked": "— Bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "My wife and I stayed at the Lancelot for a long weekend and we loved it but not without a couple of kinks. There is nothing else to say about the location: a couple of blocks from the historical center but still hidden from the crowd; it could not get better than this. The staff is very welcoming (with exception of one person) and also very helpful. They pointed us to a couple of nice restaurants and were always ready to answer our questions. We stayed two nights at a double bed room with no terrace or balcony and two nights at another one with terrace, both located on the 6th floor. The first room was OK but we would be happier with larger bed and bathroom. The second room was more spacious and very comfortable. So, this is the first kink: if one is too large (not our case), he/she will have a hard time using the restroom or taking a shower. The second kink: we were disappointed with the breakfast: very frugal and not really in synch with the price we paid. A couple of toasters and some scrambled eggs with bacon would bring it closer to what we were expecting. That goes together with the lack of room service. Even though the hotel counts a nice little bar and a nice small garden, a regular room service would be one of those niceties that could make a difference, specially for those staying at a room with a terrace.", "title": "The terrace is worth the visit", "helpfulness": 1, "user": "LuizTrip", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 33347248}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Loved it! 10 minute taxi ride from the station (around 16 euro) Hidden away behind a electric gate, it could be mistaken for apparetments. Lovely welcoming by an amazing family. The round tables are weird at first, but it turned out great! Massive room, with huge windows and an excellent veiw. So comfy and calm!", "title": "Great family-run hotel!", "user": "seapoint40", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 32915389}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I deducted a star only because we were never told the check out time, so we asumed it was 11am like most european cities, but it was 10am and we were unprepared!", "title": "Lovely hotel in quiet location.", "helpfulness": 1, "user": "RBRBoston", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31435143}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Great otherwise.", "title": "Great Location / Helpful, Friendly Staff", "user": "bradnr", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31310055}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I was very happy with this hotel. The location is great. It's within a couple of blocks of the colosseum. The location was perfect for beginning your sight seeing. You can start at the colosseum and work your way north. If you're looking to be more in the heart of ancient Rome, you may want to stay north of the colosseum. It's hard to tell when you've never been somewhere. But, I found this place to be ideal.", "title": "Excellent Stay", "helpfulness": 1, "user": "WilsonMissouri", "date": "May 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31147378}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Wow. Not the most eloquent choice of words, I suppose, but this hotel was exactly what we wanted. Great food, beautiful room, excellent staff, great location, beautiful view from the upper floors. We stayed 10 days, starting with a fairly large group of seminary students and then a few days more with a small group of friends. The Lancelot felt like home. The bed was comfortable, the bathroom was clean and well-appointed. The room was oh-so-clean when we returned each day. The food is great. We actually looked forward to eating each night in the hotel. Half-board is well worth the cost. Wireless Internet worked well in the room. Nice sitting rooms, coffee bar, intimate environment. Classy and classic. Within easy walking distance of the coliseum. Great neighborhood with restaurants and gelato bars, grocery stores, etc. A bit of a hike to the closest metro station (Colosseo or Manzoni), but the bus stop is just at the base of the hill. Have stayed twice and look forward to staying again.", "title": "Yes, Really. All Fives. A wonderful hotel.", "helpfulness": 1, "user": "DeanC", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28394019}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "This is my 4th visit to Rome in 7 years. Although I am sure there are other wonderful, small hotels in Rome, I always stay at the Hotel Lancelot.", "title": "my 4th stay", "helpfulness": 2, "user": "laurieann", "date": "March 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26068946}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "We stayed 4 nights end of Feb 2009. Hotel is 7 minute walk from Colosseo metro stop & easy to locate as it is not on one of the twisty roads. We had a Triple room for 3 adults 180 euro. Not luxury, but nice & clean. 3 comfortable single beds in a generous sized room. Good, cold breakfast included. Love the neighborhood. Lots of tiny restaurants down the block for dinner.", "title": "Return Visit, Loved It!", "helpfulness": 3, "user": "Monon", "date": "March 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25761435}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Great staff. Plus the 2 euro cappuccino they serve in the tiny bar is the best we had in Italy.", "title": "loved it, loved it, loved it!!!", "helpfulness": 1, "user": "hur1eys", "date": "March 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25470760}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Highly recommend", "title": "Great Hotel with wonderful family atmosphere", "helpfulness": 1, "user": "Geri0", "date": "February 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 24690395}, {"rating": 5.0, "title": "Great place to stay near the Coloseum!", "text": "This hotel is great. If you book and can't get the top floor try and get one of the rooms with a terrace on the first floor. We had 3 rooms for 6 nights with basically connecting terraces and it was perfect with my 23 month old and 8 year old niece they could go from room to room. It was also nice when you're too tired to go out and eat and can bring back the food to the terrace and eat as a family. My friends from England joined us for 3 nights and said they liked their room on the 5th floor. The staff was very helpful. The hotel arranged for a van to pick 8 of us up with luggage and the driverwas great. Our plane was about 45 mins late and he was waiting.....which I can tell you was a god send after a long flight.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "June 10, 2006", "id": 5329041}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "If you are there and need some nice restaurants there are several nearby. There is a nice Pizzaria as you exit the hotel to the right and go around the bend just on the left at the next street. We ate pizza there a few times. Also there is a great restaurant/hotel across from the Coloseum on the corner across from the old Gladiator school. I can' remember the name but there is terrace dining and it was great. My mom said her lasagne was the best. I would definitely stay at the Lancelot again.", "title": "Great hotel", "helpfulness": 6, "user": "papa4330", "date": "June 8, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5324892}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "My Wife & I and my mother inlaw stayed at the Lancelot for two nights after our transatlantic cruise. My wife and I had a twin room and my mother inlaw had a single. Both were on the 5th floor. The rooms were very clean and had all the extras that a standard room in the US would have. The hotel is in a very good location for touring Rome. Mrs Kahn and her son run the hotel and they are like family to guests. We ate in the dineing room both nights and the food was excellent. When we return to Rome again for a visit we will deffently stay there again. If anyone has any other questions that I can answer please email me at papa4330@yahoo.com.", "title": "Great hotel in a great location", "helpfulness": 2, "user": "jerink22", "date": "June 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5298779}, {"rating": 4.0, "title": "Hotel Lancelot Really Exceeds Expectations", "text": "We stayed at the Hotel Lancelot for 3 nights and were very pleased. It is a stone's throw away from the Colloseum and and all public transportation, which was very convenient. While the rooms were small compared to U.S. standards, they were very nice and the bathroom was nice too. The staff at the front desk was always friendly and very helpful. The breakfast was great, a nice variety. I would definitely recommend this hotel if you are looking for a reasonably priced hotel in the city.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5232394}, {"rating": 4.0, "title": "Good Hotel", "text": "We stayed here for five nights as part of a two week Tour of Italy, and were very pleased. The location is great, our complimentary breakfast was the best we had of the six hotels we stayed at (all found via TripAdvisor, by the way....) and the staff's service was absolutely superior. They were so willing to help - their taxi service is at the hotel's entrance within three minutes of being called - very impressive. I was on the search for \"cannolis\", and one staff member recommended a Sicilian pasticerria (called Dagnino, in Piazza della Republica) that was out of this world. The best part of the hotel was the bar area - where it seemed as though all the \"social\" guests congregated at the end of the day to share stories of the Rome sights or other worldly experiences. The room adornments and decor left something to be desired (at least some sort of picture above our bed would have made a world of difference), but when you get down to it, this is not a resort hotel where you'd spend a significant amount of time in your room, anyway - so who really cares? The A/C unit in the room worked and was adequate - something which we struggled with at our other hotels. Overall, we loved Lancelot, and would recommend it to any traveler looking for a great value.", "helpfulness": 4, "user": "haroldz", "date": "May 28, 2006", "id": 5227842}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We stayed here for 4 nights at the beginning of a two-week tour of Italy (Rome, Florence, Venice, Verona and Milan). You can read all the reviews for this hotel and still it will not do it justice. The hotel itself is beautiful and clean. Its location is simply outstanding. You walk about two hundred yards along a typical residential Roman street and suddenly the Colosseum is right in front of you in all of its grandeur and beauty. Every time I walked this street and saw the Colosseum it still continued to amaze me.", "title": "Great hotel in an unbeatable location", "helpfulness": 9, "user": "lynneharvey", "date": "June 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5369398}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The rooms are tastefully furnished; bathrooms are not huge, but they are fantastically clean and functional - loved the bidet! We had a small balcony on the fourth floor and it was lovely to open the doors and just watch the street below.", "title": "Weekend in Rome", "helpfulness": 4, "user": "Jure R", "date": "June 21, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 5369200}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We had initially booked the 'half board' deal (including evening meal), but were very disappointed with the quality and the quantity and for the remaining nights we ate at different restaurants located close to the hotel. The wine included with the meal was only of basic/table standard and not very pleasant. The buffet breakfast was fantastic and my suggestion is to opt for B and B and take your choice of many restaurants located close by.", "title": "Excellent Hotel", "helpfulness": 12, "user": "Moriarty", "date": "June 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5369067}, {"rating": 5.0, "title": "Lovely Lancelot", "text": "There is a pizza restaurant (take a right from the hotel and head down the street about 50 feet) - yum yum, very cheap too. There is also a great gelateria close (take a left and another left from the hotel). On our last night we ate at the restaurant located opposite the Colosseum (upper terrace) and the waiters were fantastic at getting great photos with my friends and I and the Colosseum in the background - thanks a million to them.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 18, 2006", "id": 5358576}, {"rating": 5.0, "title": "Great hotel, great location!", "text": "I just returned back form hot weekend in Rome where i spend 2 days in Lancelot hotel with my girlfriend. This is a nice hotel overall, it has a good location, 5 min walk from Colosseum. If you are planing to come with the car, they have 5 parking spaces infront of hotel, cost is 10€ per night.", "helpfulness": 3, "user": "Hollidayo", "date": "June 13, 2006", "id": 5337488}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Stayed 3 nights at the Hotel Lancelot. It is a small to medium size hotel about 3 blocks from the Coliseum. Rooms and common areas are nicely updated. Small but modern bathroom with excellent shower. Breakfast (included) was very good. We did not eat at their restaurant in the evening.", "title": "Nice value in Rome's Ancient City", "helpfulness": 2, "user": "Hi-H0-Silver", "date": "May 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16033325, "likes": {"liked": "— Location", "disliked": "— stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Wonderful Hotel-- Great location -- Great staff-- Clean new rooms-- We just returned from 2 and half weeks in Italy.", "title": "Great place to stay!!!", "helpfulness": 1, "user": "cabinlife", "date": "May 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15862860, "likes": {"liked": "— Staff, cleanliness, location.", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Stayed 4 night at Lancelot --one night before cruise and 3 nights after. They made all limo arrangements for us. At first we were traveling with older parents and at the end we were traveling with our 21 year old sons. Lancelot was great for both. Easy to find, and walk to and from bus, good food, and Colosium.", "title": "World class service and a Great Bargain", "helpfulness": 1, "user": "fllyover", "date": "May 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15650173, "likes": {"liked": "— staff"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The staff gave us great advise and very attentive to detail. Breakfast was great.", "title": "A nice, pleasant hotel in a great location", "helpfulness": 4, "user": "Atsa", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15610744, "likes": {"liked": "— Good quality service in a great location", "disliked": "— No significant dislike"}}, {"rating": 5.0, "title": "Perfect Stay & Location", "text": "Eat at any restruant near the hotel and it was great except ones that faced colosium. They charge $100 more for same food.", "helpfulness": 2, "user": "spf0", "date": "May 1, 2008", "id": 15547384}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I stayed at the Hotel Lancelot based on other traveler reviews on Trip Advisor. We were not disappointed. The best part of this hotel was the staff. They were so helpful in giving us ideas on how to get around, where to go, etc. We would recommend one of the rooms with a courtyard as it is worth the extra 12 euros per night. It makes the room so much larger, and it is a nice retreat after a long day of walking the streets of Rome. We would have given complete 5's across the board, except that the bathroom in our room (#6) was way too small, and the internet was horrible. Otherwise, it was a perfect stay. The location really can't be beat. We also decided to stay in one night and eat at the hotel and the food was excellent and reasonably priced given all that you got. We would absolutely recommend this hotel and if we come back to Rome, will stay there again.", "title": "Excellent service, great location, overall great deal.....", "helpfulness": 2, "user": "blondiemurc", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30445670}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "We stayed at Hotel Lancelot for 5 nights for a combo of business and leisure. Having never traveled to Europe before I had no idea what to expect of the rooms other than reading in many guidebooks that European hotel rooms are very small with tiny beds. We were pleasantly surprised with a good sized room, queen bed, and a private bath. The only complaint about the rooms, was the shower did not drain well and we would have to turn the water off during the shower so that it would not spill onto the floor. We did not take up the issue with the staff as we liked our quiet room location. The complimentary breakfast was convenient. There were many restaurants in the few blocks surrounding the hotel and it is convenient to the Coloseum metro stop. One of the staff members (I think he actually was the cook) highlighted a walking tour for us one day that was AWESOME. After we walked that tour, we really felt like we had been to Rome! The hotel was by far our favorite part of our Italy trip...the lobby is nice to sit and have a bottle of wine at night after walking 10 miles a day!", "title": "Great hotel and staff", "helpfulness": 3, "user": "LucyandI", "date": "May 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29739301}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "My 3 friends and I stayed at the Lancelot April 19-21, traveled elsewhere in Italy, and returned for 2 nights at the end of our trip. We stayed in a quad which was set up with a double bed, a single, and a roll away. The room was large enough for the 4 of us. The staff was always kind and helpful and we enjoyed the daily breakfast buffet. There were a few common rooms to use as well as two outside terraces, which we did not take advantage of. If the weather had been a bit warmer, it would have been delightful to end the day with a glass of wine in either of these spots. The hotel is close to the Colosseum and to a metro stop. There are a number of restaurants close by. Each night the hotel offers a fixed price dinner for an additional cost. We took advantage of this on our last night and had an enjoyable evening dining with some of the other hotel guests. All in all, I would recommend the hotel for its exemplary service, cleanliness, and location and would stay there again on a return trip to Rome.", "title": "A comfortable stay", "helpfulness": 1, "user": "4Hfriend", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29312866}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This review is posted very late, but it is still accurate!", "title": "Great Hotel in the Eternal City!", "helpfulness": 1, "user": "Brkln71", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28946718}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I booked the Lancelot for my honeymoon last May and we had a fantastic time here. They arranged to have a car sent to pick up my wife and I from the airport and had a bottle of sparkling wine waiting for us in the room.", "title": "Great location, super friendly", "helpfulness": 1, "user": "AnH0nestMan", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28705719}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 8, "average": 43, "very good": 252, "terrible": 3, "excellent": 655}, "aka": "Lancelot Hotel Rome", "slim_ranking": 0.0188976377953, "detail_rating": {"service": 5.0, "cleanliness": 4.5, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Hotel Lancelot is a peaceful haven at a short stroll from the Colosseum and the Roman Forum. The friendly english speaking staff are always willing to help you with suggestions and tips on discovering Rome's treasure's. A distinctive feature of the Hotel are the \" round tables\" at which people from every corner of the earth meet and converse over breakfast or the generous evening meal."}