{"user_rating": 4.0, "review_count": 597, "name": "Hotel Principal", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "We booked this based on the strength of the ther trip advisor reviews and we were not disappointed.", "title": "Looking for comfort, great location AND value? This is THE one!", "helpfulness": 11, "user": "Winter_Log_Fires", "date": "November 26, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6176964, "likes": {"liked": "— Cleanliness, value, AIR CON and location", "disliked": "— The receptionists weren't overwhelmingly welcoming"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "When I go to cities, I have a difficult task to find somewhere in a great location which is clean, comfortable, en suite, tv AND isn't over the odds money wise.", "title": "A budget gem", "helpfulness": 2, "user": "L.A.Silk", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6173873, "likes": {"liked": "— Clean, quiet and great location", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006", "text": "This is the best example I've found.", "title": "No problems", "user": "Tracey1977", "date": "November 21, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6160787, "likes": {"liked": "— Being so close to La Rambla", "disliked": "— the rooms were quite small"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "AIRPORT", "title": "Fantastic bathroom!", "user": "Rio1981", "date": "November 20, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6157017, "likes": {"liked": "— The bathroom and shower", "disliked": "— View, slithgly dodgy area"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "When arriving for the first time, when you get outside, go RIGHT! We turned left and wandered for a while wondering where the hell the train was. It's right and up the escalators. Buy a T10 ticket. You can legitimately share them and gives you 10 journeys for a discounted rate. Don't be fooled by other tourists not buying them - they just don't know about them. You don't need to speak Spanish to buy them - the automated machines display in English and even if that fails, \"T-10\" is easy to spot.", "title": "No Good if you want to sleep.....", "user": "bpascua", "date": "November 20, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 6155760}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This is a clean, reasonably priced hotel in a great location. it's just off La Ramblas and a short walk to the Metro and/or the official tourist buses of Barcelona. The staff was friendly and helpful. Free computers and internet access available. The room was a bit on the small size, and the television was horrible, but then again you're in Barcelona and probably shouldn't be sitting in the room all day anyway. :-)", "title": "Nice Place", "helpfulness": 2, "user": "HoboProf", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12304538, "likes": {"liked": "— location, location, location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "I stayed in the Hotel Principal for the last week of November 2007. I had an excellent experience in this hotel. In fact it probably should be a 3 star rating instead of 2. I had a single room which was very comfortable and clean. This may be the first time I stayed in a hotel and did not experience ambient noise coming from adjacent rooms. The only issue for me was people arriving late at night and not having any consideration while in the hallways. But that’s another story.", "title": "Excellent Experience", "helpfulness": 2, "user": "chris1107", "date": "December 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11281126, "likes": {"liked": "— Great location, clean, and quiet.", "disliked": "— My bed was somewhat lumpy but not the worst I've experienced at this price level."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The hotel is a short walk to La Rambla and almost every sight in the old city and L’Exiample is accessible from the metro . The breakfast -at 8 euros extra per day- is a western style buffet (eggs, toast, coffee etc...). Liceu metro stop is a short walk away on La Rambla and the marina can be reached on foot in less than 10 minutes.", "title": "Good hotel in great location", "helpfulness": 2, "user": "Richb2004", "date": "December 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11264751, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Warning: WATCH YOUR WALLET. Barcelona is rampant with pick pocketing thieves. Sadly, I was a victim of this while riding the metro (the last day of my trip). When I went to the police office to report the theft, there was a line of people who also shared similar stories with me. I also witnessed a theft while sitting inside a bus. You’ve been warned!", "title": "Cheap and cheerful hotel", "helpfulness": 3, "user": "SED77", "date": "November 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 10787581}, {"rating": 4.0, "title": "Very Good Hotel", "text": "The hotel also has a nice rooftop terrace with ample seating. The outdoor bar/café at the end of the street is a nice convenience for the weary tourist at the end of the day. However I would avoid the restaurant across the street from the bar. There are many better options a short walk away.", "helpfulness": 2, "user": "tom057", "date": "November 8, 2007", "id": 10691461}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I stayed here for a long weekend in early September 2007. We were 2 couples and each of us got excellent rooms. Our room had no balcony but had a fantastic shower/bathroom (room 326) . Our friends had a balcony over looking the road and 2 double beds (room 321). The rooms were clean and very comfortable, and the air con was ice cold which was excellent given the temperatures we had, it has a lift also. The hotel has a few vending machines selling over priced water and snacks, but there are load of shops around, even a small supermarket about 6 houses down the road. The hotel has Wi-fi also, and free internet access via 3 pcs in the lobby. The hotel itself is about 2 mins walk to the middle of the Ramblas (home of the over priced beer and food), but if you head the other way you can eat great food at the fraction of the cost. I have read about the \"dodgey\" street on other reviews, but its no problem, we never felt threatened, always people about. The hotel has a 2* rating but I would think its more like a 3*. The only negative comment would be that it has no bar (but plenty around the hotel) and provides cups/kettle, but no tea bags/coffee milk etc, but its a moot point really. I reccommend this place for all.", "title": "Excellent Hotel", "helpfulness": 5, "user": "Dash_R", "date": "September 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8693379, "likes": {"liked": "— Location, rooms, air con", "disliked": "— No bar, no tea/coffee in room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed 3 nights in early september. We had a double room overlooking the street - very clean great little view over the street with the balcony. Suprisingly very quiet... I would highly recommend this hotel to anyone. Great location so close to La Ramblas..... and the main square. Well done management and staff!!", "title": "GREAT GREAT GREAT", "helpfulness": 3, "user": "robbo1963", "date": "September 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8619648, "likes": {"liked": "— Location and Rooms", "disliked": "— No fridge in room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We had a weekend break in June and stayed at the Hotel Principal Barcelona which I would fully recomend. This nice little hotel was very easy to find and is idealy situated being within very easy walking distance of las Ramblas where you'll find some really nice cafe's, bars, resturants, shops and local sites ect.. It is a small pleasant hotel with friendly helpfull staff. The rooms were clean and are of an average size ours had a small balcony which overlooked a quite street.", "title": "Fully recomend Hotel Prinipal", "helpfulness": 3, "user": "adyrach", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8510635, "likes": {"liked": "— Location", "disliked": "— Breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My only complaint would have to be the breakfast the choice was limited and not of the best of tasting and the hot food was not particulay hot.", "title": "Recommend the Principal", "helpfulness": 3, "user": "MerseysidePippa", "date": "August 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8349367, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "But overall it served its purpose and we would definatly stay there again it was a basic but nice hotel to stay in while we enjoyed sightseeing in the Beautifull city of Barcelona.", "title": "Nice hotel and location", "helpfulness": 2, "user": "jessandmatt", "date": "July 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8136201, "likes": {"liked": "— Cleanliness, location and free internet access", "disliked": "— The hand held shower!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Just back from a lads weekend in Barcelona and the Principal served us well. As other reviewers have said the location is ideal as only a short stroll and you are in the ramblas with all the associated tourist amenities. Rooms were clean (and well cleaned during stay) and had the necessary to make it suitable as a base but perhaps not if you were going to spend much time in them. Breakfast was ok to poor but as you are so close to other offerings then I would suggest a short walk is the best bet. The area behind does become somewhat more sinister late at night (well certainly in the early morning hours) with plenty of prostitutes and drugs on offer, a firm no is usually enough but you may need to be prepared for continual approaches. The reception staff were generally helpful and allowed us to have some of the rooms early (we had arrived at 11.30) and offered advice on transport etc. I would use again should the opportunity arise.", "title": "All round good experience", "helpfulness": 3, "user": "kiwiruss", "date": "March 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7245207, "likes": {"liked": "— Location", "disliked": "— Noise and mess in road due to works"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "3 Couples from Dublin, all aged 40 ish just back from Barcelona,", "title": "Location is its best asset", "helpfulness": 1, "user": "Sharon,Dublin", "date": "March 7, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 6926757, "likes": {"liked": "— Location", "disliked": "— Not as advertised on Web site."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "The hotels location was its biggest asset, 3 min walk to Las Rambles. We booked 3 superior rooms with balcony. The balconys were tiny, you would struggle to have 2 people sitting out, however with new path laying beneth our balcony the noise was too much to sit out. Only 1 of our 3 rooms had the advertised jet shower, in fact our shower needed to be fixed upon arrival. We all thought the breakfast was poor, the hot food was barely warm & the cold buffet was the same as any other continental breakfast we didnt think it was worth €8 each. If I were to return to Barcelona I would stay in the Gotic quarter, just the other side of Las Rambles.", "title": "Welcoming and great breakfast", "helpfulness": 4, "user": "HarrietUk", "date": "March 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6907192, "likes": {"liked": "— Location", "disliked": "— Bedroom view."}}, {"rating": 4.0, "title": "Good hotel to stay in Barcelona", "text": "I was worried after I booked the hotel when I learnt it was on the 'wrong side' of the Ramblas, but it wasn't a problem. There were plenty of people of all ages milling around the area at all times of the day and night and we never felt unsafe.", "helpfulness": 2, "user": "Riche55", "date": "February 27, 2007", "id": 6849534}, {"rating": 4.0, "title": "Fine hotel, near the Ramblas", "text": "The hotel itself was bright and welcoming. The room was perfectly adequate with comfortable beds, a decent shower and Uk Sky news on the TV.", "helpfulness": 2, "user": "NewYorkDave", "date": "February 21, 2007", "id": 6821921}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "A couple og glass doors welcomed oss to Principal Hotel. The staff were very helpful. We got a room on the first floor and it was nice and tidy. With an excellent big bathroom. The high ceiling made the room spacious though it wasn't large. Unfortunately the aircondition wasn't working as good as we hoped, but we fell asleep. The street is small and narrow, and when we were there construction work woked us up. It wasn't a big problem, we were going out anyway, and I guess the street we'll turn out nicely when it's done. A breakfast bouffet is available, and we ate there the first day, but found out that it was cheaper for students to get som food at La Bouqeria (which you must visit!)", "title": "Perfect!", "helpfulness": 3, "user": "lassh", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7414455, "likes": {"liked": "— location, tidy, free internett", "disliked": "— not properly working aircondition, small elevator"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The rooms are very clean, and we had a nice view of the backyard. The location is good, near from La Rambla and good comunicate. It is a little noisy but only during the day. A good place if you wanna spend some days in Barcelona.", "title": "A good place", "helpfulness": 3, "user": "Catyn", "date": "April 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7299423, "likes": {"disliked": "— Las obras en la calle"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Hotel is in easy walking distance of the Ramblas and the Gothic area. Due to road construction, the hotel is difficult to access by vehicle. The staff was exceptionally kind and helpful, providing wine glasses, ice, cork screw, voltage adapter, etc. A first time visitor might be put off by the back road location, but one quickly learns that most of the area's delights are on the back streets. Very much enjoyed our stay.", "title": "Pleasant and comfortable, great location.", "helpfulness": 4, "user": "YourFool", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7294526, "likes": {"liked": "— Value and location.", "disliked": "— Adjacent noisy road construction."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "excellent value for money hotel,for the price we paid it could not be faulted.There were two adults and one child in our party,as we booked with 'barcelonahotels.com' we only paid £17/night extra for the child place.Not many other websites offered this option at all.We would have had to book either two rooms or reserve a room with a third bed in it-this would have cost a lot more money.Worth remembering if you have child in your party.The bed was kingsize and there was a bed/settee too,plently of room for all three of us in the room.There was a lcd tv,(sky news),kettle and cups(no spoons,tea bags or milk),lovely powershower and bathroom,central heating and or air conditioning. The area was a bit on the rough side,but i have to say i felt a lot safer there than i did on The Ramblas or the rest of the tourist traps.There was a hostel across the road where a young student party from Germany stopped in one night,they bought their own alcohol from the spar shop near by and headed off into town-this was the only example of noise we experienced at night.If anything i would say it was a lot quiter than most of the city i saw,it was a welcome relief to find the hotel so peaceful after all the crowds and sightseeing. There is noise and disruption by day because there is a new pavement and road surface being constructed,this did not cause us any problem either;work started mainly after 8.00am-still quiter than some of the areas i saw.I read the reviews about the drug dealing and prostitutes, i did not notice this,but then again Barcelona is stuffed full of very bizarre things and some very strange looking people;if i saw drug dealers and prostitutes i was not aware! The rest of the streets had their fair share of social problems too.If you are used to The Hilton or want five star luxury this hotel is probably not for you.You would struggle to find the equivalent hotel or b&b in the uk for the same price.", "title": "excellent value", "helpfulness": 6, "user": "citybreakerCheshire", "date": "April 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7286636, "likes": {"liked": "— clean,modern facilities in the room and well equipped."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel does not have a lot of space for the dining area and at times it was a little bit cramped but this was not a major issue,the food was very good quality,again not a lot of room for display,but what they had was quite sufficient and good attention to detail was maintained.", "title": "Good location, great value hotel", "helpfulness": 4, "user": "Riflerangeblues", "date": "March 31, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7259488, "likes": {"liked": "— Clean and spacious, good quality accommodation", "disliked": "— No bar on site for a last drink of the evening"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Excellent hotel stayed there for two nights occupying a triple room. I can't say anything bad about this hotel at all. Service was excellent we did not have enough towels the day we arrived and we received them in about 5 mins. Breakfast buffet was included in the deal, again excellent value for money and lots of choice. I was a bit worried about some of the reviews saying that the breakfast was not all that and the so called shady area. I'm not sure what people definition of shady is but i did not find this area shady at all and i was a part of group of three girls and we had absolutly no problems during the day and early hours of the morning. In regards to the breakfast if you want convenience then it is def worth it and like i mentioned good quality (well i happily stuffed my face). Location was also very good relativly easy to find altho you may need to ask for directions but people are more then friendly in helping and there is a station nearby to the hotel like 5 mins away. Only thing i have to say to be wary of which is nothing to do with the hotel. Is pickpockets who are rife in Barcelona and i had two not so good experiences with them. There are however safe's available in the rooms which i did not use and looking back probably should of. All in all tho very good experience with this hotel and if i was to go back i would book with this hotel again.", "title": "Can't go wrong", "helpfulness": 1, "user": "travelicious84", "date": "October 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10427610, "likes": {"liked": "— The service", "disliked": "— Nothing that i did not like"}}, {"rating": 4.0, "title": "Excellent Location, Good Hotel", "text": "My boyfriend and I stayed here from October 20-24th. We're in our late 20's and wanted to do a lot of sightseeing and stay at a decent, relatively inexpensive, very conveniently located hotel. This hotel was perfect. We booked at otel dot com and it worked out to about $160 USD/night including buffet breakfast.", "helpfulness": 1, "user": "Caprice611", "date": "October 27, 2007", "id": 10372991}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Room and Check-In:", "title": "Great location for main sights.", "helpfulness": 2, "user": "flaxy", "date": "October 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10348204, "likes": {"liked": "— Location, cleanliness, free internet.", "disliked": "— surrounding area."}}, {"rating": 1.0, "title": "Not a happy hotel experience", "text": "We arrived at the hotel at 10 am after our cruise and were very surprised that our room was ready. We stayed in room 331 (3rd floor) and it was compact and had a view of a wall (ok since we were hardly there). The important items in the room were a hair dryer, safe, no alarm clock (but wake up calls were fine), flat screen tv, kettle, shampoo (not very good quality so bring your own).", "helpfulness": 4, "user": "appliepie2", "date": "October 2, 2007", "id": 10031533}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Location:", "title": "Thank goodness for Hotel Principal!", "helpfulness": 3, "user": "Tabb", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10019376}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Great location for hotel, approx 150 yards from the nearest metro. Clean rooms, air con, tv, radio, decent shower. Breakfast provided lots of choice. Helpful service when obtaining lost baggage from airport. Highly recommended.", "title": "Great location and value", "helpfulness": 1, "user": "Gareth_Hill", "date": "January 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6693451}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Very pleasently surprised. This hotel was very central, a couple of minutes from La Ramblas. Our twin room was modernly furnished and spotlessly clean, as was our en-suite bathroom. Our excellent rate included a nice and varied buffet breakfast, from juice to fruit and yogurt, cereals meats and cheeses/salads, breads croissants and hot food. Staff were pleasent and efficient at all times. The roof-top terrace was an added bonus. An excellent experience overall.", "title": "Fantastic value!!!", "helpfulness": 1, "user": "Claire.oconnell", "date": "January 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6611387, "likes": {"liked": "— Very clean"}}, {"rating": 4.0, "title": "A great stay", "text": "Me and my partner stayed at the hotel for 4 days from 09/01/07 to 13/01/07. I was extremely impressed with almost everything about the hotel, especially at the price we were paying. We managed to book the room around two months before for around £50(75 euros) per night. The room was slightly smaller than I expected from the photos I had seen but it was by no means small. It was very clean upon our arrival and was cleaned every day we were there whilst we were out. Having read the reviews on trip asvisor I was worried about the noise and the staff, but the staff were very kind and would help with anything if you asked but I would say that if you make an effort to at least try and speak spanish then they tend to remember you and say hola when they see you, however they speak fluent english so it really isn't a problem. The noise was not a problem at all even though we had a room at the front with a balcony, I would say it was quite nice to wake up to the noise of the locals. The only bad thing about the hotel was the roadworks going on in front of it. It is based on a quiet street but the roadworks make it look ugly until you get inside. As for the city itself, it is beautiful. The pick-pocketting problem didn't affect us thankfully, but I would say as long as you're careful then it isn't a problem, so just take out what you need and leave the rest in the safe in your hotel room. The food tends to be rather expensive in most places on la ramblas and I found a few places where the drink prices were ridiculous but there are a few gems, however don't be fooled into going to the italian which offers a set menu for 6.50 euros, it was quite frankly the worst dining experience of my life. There best places we found to eat and drink where between the hotel and la carme st. Make sure you visit the cathedral nearby, and go to la sagrada familia which is just a quick metro journey away. I would say however that once you've been to barcelona and visited the sights it's not somewhere that I'd desparately want to go back to, but that's only because I've got a lot of other places I want to visit first! Enjoy", "user": "nostaw_01", "date": "January 16, 2007", "id": 6606028}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We spent an enjoyable 3 nights in Barcelona, staying at the Hotel Principal. It's a lovely hotel, just off La Rambla. Okay, it's probably the wrong side of La Rambla, but we never felt threatened – the street leading up to it is busy all day with locals and tourists alike.", "title": "Great location, great value", "helpfulness": 3, "user": "L.E.Smith", "date": "December 3, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6321367, "likes": {"liked": "— Location and price", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The room was very clean and had obviously been refurbished quite recently. It was a little on the small side but perfectly adequate considering how much time we actually spent in it. The bed looked a little small at first glance (mind you, we have a king-size at home) but it was actually very comfortable. We were lucky to have a room with a balcony overlooking the street. My parents were also staying at the hotel and their room overlooked an internal courtyard, which meant that it was quite dark, though on the plus side it was probably quieter than ours. We didn't have problems with noise from the neighbouring rooms, but were waken up by people in the corridors returning to their rooms late at night and on one occasion by a rubbish truck beeping loudly outside.", "title": "Great Value for Money", "helpfulness": 2, "user": "mollybear", "date": "December 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6313397, "likes": {"liked": "— Everything - service, cleanliness, comfort, value for money", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007", "text": "Nice hotel, good location just off ramblas. Had twin room which was 2 double beds, although i dont think they all are. The new bathrooms are very nice. I agree the roads do look a bit creepy from ramblas to the hotel but never had any problems. The view from window is not great but i wasnt after a nice view. If you want a reasonably priced hotel with nice rooms and bathrooms, A/C and great location i think you will strugle to find better in Barceona.", "title": "Good Base in Barcelona", "helpfulness": 1, "user": "JR323232", "date": "July 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8093048, "likes": {"liked": "— Clean", "disliked": "— side street to get there"}}, {"rating": 3.0, "title": "Hotee Principal ", "text": "Just arrived back from a 3 night stay at this Hotel. Found it very clean quiet and comfortable. Our room was on the 4th floor. It was rather small but adequate but the view from the small balcony was not pleasant but as we were only there for a few days it did not bother us unduly. None of the taxi drivers seemed to know where this Hotel was so we use to carry a piece of headed note paper around so show them the address. It is up a very dodgy looking road but we did not experience any problems. Some of the reception and kitchen staff were very rude although the lady on the desk on the last day was very helpful when our taxi failed to appear. Don't bother with the breakfast for the 8 euros they charge you can get a much better one on Las Ramblas.", "helpfulness": 5, "user": "AJH36", "date": "July 3, 2007", "id": 8044019}, {"rating": 4.0, "title": "Good combination of location and price", "text": "Stayed at Hotel Principal for 2 nights after a cruise ending in Barcelona. Hotel was very new and clean inside, obviously recently renovated. We arrived quite early (9am) and had to wait about two hours (11am) for a room to be ready. Normal check-in time is 1pm so we appreciated them getting us a room early. They also have a large luggage room we could have left our bags in while we went out, but we didn't want to leave our stuff.", "helpfulness": 2, "user": "mikef99", "date": "June 30, 2007", "id": 8030410}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Room was tiny - not much bigger than our interior stateroom from our cruise ship, but generally comfortable, and again new/clean. Air conditioning worked very well. Bathroom was large, with tub and shower, marble counters, etc.", "title": "Clean, quiet, good air conditioning, secure surroundings, breakfast available", "helpfulness": 1, "user": "Lauriecarol1", "date": "June 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 8027463, "likes": {"liked": "— Quiet, near Las Ramblas", "disliked": "— Neighborhood"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Hotel has free WiFi internet, plus two internet terminals in the lounge. Internet was flaky though, it worked about 75% of the time.", "title": "Good budget hotel", "helpfulness": 3, "user": "Duderoo1975", "date": "June 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 7833532, "likes": {"liked": "— quite central, staff, cleanliness", "disliked": "— Location, no bar, having a kettle & cups but no tea of coffee!!"}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 30, "average": 92, "very good": 315, "terrible": 10, "excellent": 150}, "aka": "Principal Hotel Barcelona", "slim_ranking": 0.421755725191, "description": "Hotel Principal is situated in the centre of Barcelona’s Old Town, just 200 metres from Las Ramblas. It features a rooftop terrace, 24-hour reception and free Wi-Fi access throughout. The Principal offers simple, attractive décor throughout and rooms are spacious. Each has air conditioning, a flat-screen TV with satellite channels, as well as tea and coffee making facilities. The hotel serves a daily, buffet breakfast. There are several bars, cafés and restaurants within walking distance of the Principal. Guests can make use of computers with internet access, available in the hotel reception. Staff at the tour desk can provide information on Barcelona’s tourist attractions and arrange car rental. The Principal is 10 minutes’ walk from Barcelona Cathedral and the city’s Gothic Quarter. The Old Port is around 700 metres from the hotel, whilst Liceu Metro is a 5-minute walk awa"}