{"user_rating": 4.0, "review_count": 995, "name": "Hotel Valencia Riverwalk", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Can't believe the poor ratings folks are giving this place. It's centrally located in downtown San Antonio (8 minute walk to the Alamo and a couple of blocks from Riverwalk), great young friendly staff and hip decor. The V Bar was packed on Saturday night and the rooms were clean (the bathroom was sparkling). The noise people complain about I didn't hear, you do get some street noise but nothing that would keep you up. You can't miss with this one.", "title": "Great joint", "helpfulness": 1, "user": "scoremedia", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7381198, "likes": {"liked": "— Everything.", "disliked": "— Had to leave."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I booked our room through the property, so not to have any confusion regarding the type of room we required. I even called and confirmed with the hotel a week in advance. What was so special, I wanted TWO beds with a river view. We were traveling with our daughters age 12 and 14, and have had problems in the past booking online with expedia and other websites when we arrived at the hotel. So, I assumed booking through the hotel would remedy the problem (we all know, one should never assume), it did not. We arrived to a lovely hotel with very friendly valet staff, and that is where it ends. At check-in I was told they had our room ready, great considering it was 12:00, could I just give them a credit card and sign on the dotted line. What a KING??? No I booked a room with TWO beds! Sorry we only have this room and would be happy to give you a roll-away at no extra charge! Needless to say I was not pleased, The manager came, no apology, nothing. After a stand-off and my voice growing louder, he asked us to take a sit and would go and speak to yet another manager (the one that can make a decision), 25 minutes later a room was found. Of course the room was not ready and we were assurred we would be called once it was. Guess what, no call so at 5:00 we returned to be told yes the room was ready and again no apology for not calling to let us know. I admit the room was lovely inside, however I would not recommend the river view, its not worth the extra money. The courtyard is a joke and is closed a lot of the time for weddings, etc. If you go to the bar make sure they charge you the correct amount. My husband and I had a bottle of wine out on the terrace one night and were charged $20.00 over the price listed. Guess what it happened twice! The location is OK and not in the heart of the riverwalk, but close enough to enjoy. If you stay here, which some of you will stand, your ground and watch they are charging.", "title": "won't return", "helpfulness": 4, "user": "sgeddie", "date": "April 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 7293081, "likes": {"liked": "— The valet guys!!!!", "disliked": "— front desk manager."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This place was awesome! Everything was perfect. The room was beautiful with a courtyard view and balcony, very spacious and very clean. The bed was beyond comfortable. The staff was pleasant, the room service/food was abosulety wonderful. I definitely suggest the hotel's filet mignon... to die for! The location was ok, I thought it was going to be in the heart of Riverwalk but its only a few steps down to it. The hotel has two separate restaurants, both are limited menus and over priced. Only bad thing was the champagne in the minibar. Other than that, I WOULD DEFINITELY STAY HERE AGAIN and plan on doing so. Btw, you can experience Riverwalk in 3 days, no need to stay longer.", "title": "Honeymooners...Worth every penny!", "helpfulness": 2, "user": "wondrly", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7246182, "likes": {"liked": "— Everything", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This Hotel is beautiful, probably one of the nicer hotels that I have stayed at, definitely 5 star. Only one problem, and it's a big one. We left one night early because it was sooooo incredibly loud, and I've never been one to do that, I usually just grin and bear it. I had seen reviews that said the same thing but thought \"I'm young and going to party a bit, surely I won't be bothered by it...\" I was wrong. I slept about one hour total and that was after three strong magaritas!!! We stayed on the downtown side of the hotel on the 3rd floor. There is a bar on the street level next door that blared their music out of speakers on the street ( can't understand how they can do that, but they do) After about 3am that went away, Then the buses started running and I heard a bus stop and start loudly right in front of the hotel every 3-5 minutes. Every car that drives down the street is heard easily and it is on a major throughfare. I'm really not exagerating here, I wish I was. It's possible that you might do better off staying on the river side but I can't imagine that this place has a bit of soundproofing, so that might not be any better. I was very disappointed because the rest of the hotel is absolutely to die for. I loved the decor and the restaraunt was good. Customer service was great. I would love to stay again, but sadly probably never will unless they fix this huge problem.", "title": "nice but Loud", "helpfulness": 3, "user": "lindsey381", "date": "March 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 7191565, "likes": {"liked": "— The hotel itself was wonderful, 5 stars!!!", "disliked": "— The noise was unbearable!!!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My wife and I stayed at the Valencia for an overnight getaway (we live in Austin, about 90 minutes away) in San Antonio. We're in our 30s and travel extensively.", "title": "Great riverwalk hotel, minus a few details.", "helpfulness": 8, "user": "TheDogPark", "date": "March 19, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7191227}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "This is my favorite hotel anywhere! At first it was wierd, but the dark atmosphere in the lobby and halls really grew on me. The fire in the courtyard is awesome. I also love the decor of the rooms. I've stayed at this hotel 4 times now. It's the only place I stay when I travel to San Antonio. Sometimes it can be a little pricey, but it's still way below average for it's quality. I've stayed here for as little as $100 and as much as $200 a night. I've seen times where it's gone much higher though.", "title": "Favorite hotel anywhere", "helpfulness": 7, "user": "swzine", "date": "February 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3211705}, {"rating": 2.0, "title": "Service Problems", "text": "Great looking place but service needs quite a bit of work. Computer entries from my telephone reservation were wrong, room service got our orders wrong twice, etc. The room itself needed some attention. . .there was no plug in the bathtub, the tv remote's batteries were dead, one lamp didn't work and the plant was dying.", "helpfulness": 6, "user": "fbc34", "date": "January 18, 2005", "id": 3015420}, {"rating": 5.0, "title": "Very Chic and Sophisticated!", "text": "I really enjoyed staying at this hotel for two nights in November 2004. I tend to book boutique hotels when I travel because I enjoy the personalized service, non-traditional decor, and interesting clientele. I found the rooms at the Valencia much roomier than similar boutique hotels, including some of the Kimpton hotels. The furnishings were very nice.", "helpfulness": 6, "user": "geoffsomerville", "date": "January 14, 2005", "id": 3007557}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "The interior courtyard is spectacular with a 20 foot cascading waterfall set behind a gas bonfire. The ceiling is completely open to the sky and the nights were clear and beautiful during my stay. If I stayed again, I would book one of the rooms with a balcony overlooking the courtyard. Definitely a great place to have a glass of wine!", "title": "A very nice hotel", "helpfulness": 7, "user": "Jody H", "date": "January 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 2975016}, {"rating": 5.0, "title": "Stylish and hip", "text": "Also, there is an excellent Mexican restaurant adjoining the hotel and overlooking the riverwalk. I had an excellent meal there. Great salsa.", "helpfulness": 4, "user": "palladium35", "date": "December 11, 2004", "id": 2875930}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "It took me a while to decide if I liked this hotel or not, but after being there for a few hours, I realized i did. Yes, it is dark, but that is actually part of the hotel's charm.", "title": "Unique Hotel near the Riverwalk", "helpfulness": 8, "user": "brandyandbrian", "date": "May 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3449600}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "The modern decor is very similar to the \"W\" chain of hotels. The rooms are very large, the bed is comfortable, and the hotel is very clean. The bathroom is fair size, but the Aveda products make up for that.", "title": "The most amazing hotel in the world!!!", "helpfulness": 6, "user": "ashleigh s", "date": "May 2, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3431248}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "The Hotel Valencia is located right on the Riverwalk, but it is a good 10 minute walk to the part of the Riverwalk where all of the action is. There are not a ot of river view rooms, but the courtyard rooms have a better view anyway. I would recommend asking for one of those.", "title": "Escaped at the Valencia", "helpfulness": 4, "user": "christinemeier", "date": "April 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3427150}, {"rating": 5.0, "title": "Fabulous Hotel", "text": "I did not get a chance to try out the restaurant (Citrus) in the hotel but it is supposed to be one of the best in San ANtonio. The \"V\" Bar is great ~ great views, great service.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 29, 2005", "id": 3423780}, {"rating": 2.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "The things i didn't like about the hotel are that there is not a full service spa and no pool. If you are looking for this, I recommend the Westin.", "title": "Dark and foreboding", "helpfulness": 10, "user": "Prufrocker", "date": "April 22, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 3398476}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "After reading the other reviews about this hotel, I was a bit apprehensive about staying here, but it was my birthday and we wanted to do something very special. WOW!!! This place is totally awesome. The moment you drive up, you are greeted very respectfully by the Valet attendants. You are then greeted by the hotel reservation attendants. They did everything they could to make our stay a most pleasant one. We got a room over looking the courtyard and had no problems with noise at all. In fact it was very romantic with the sound of the waterfall during the day and the roaring fireplace at night. The Citrus Restaurant in the hotel is awesome. The entire staff was so courteous and made us feel so welcomed. I would highly recommend this place to anyone who doesn't mind spending the money and creating a wonderful memory. Thanks Hotel Valencia!!!", "title": "I love this hotel!!", "helpfulness": 6, "user": "jdiaz31", "date": "February 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6744789, "likes": {"liked": "— The friendly staff", "disliked": "— The expensive goodies provided in the hotel room. We chose not to use anything, but rather bought our own at a local Target."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We stayed here on our last night after a long family Thanksgiving!", "title": "Loved the Valencia", "helpfulness": 1, "user": "lauraDesMoines", "date": "February 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6726672, "likes": {"liked": "— location and decor"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "We loved the modern decor. We loved the location. Great Hotel!", "title": "ok, but too noisy", "helpfulness": 8, "user": "AnarchyJim", "date": "January 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 6591485, "likes": {"liked": "— NOISE!", "disliked": "— Stay somewhere else"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I felt like I was in Manhatten!!!!", "title": "Noisy Disappointment", "helpfulness": 6, "user": "RL-TX", "date": "December 18, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 6470083, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "If you're in San Antonio to party, this is probably a great, chic hotel. If I was there staying out until 2am every night, the noise really wouldn't have been an issue.", "title": "Nothing bad to say....", "helpfulness": 3, "user": "cookies11", "date": "November 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6308150}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "My sister and I stayed at the Hotel Valencia 2 weeks ago and I love this place!! You have to be in the mood for a mod, hip sleek and minimalistic experience. I read the reviews here before I visited and listened to what some said about it being too dark, but I frankly loved it. Yes, it's a bit dark, but not dark in a weird way - just in a neat way. The staff was very accomodating. Our room was great and I loved those faux mink bedspreads! If I had to complain about anything, the only thing I could come up with was the odd choice of music in the bar on Saturday night. The entire crowd was 40+ and white, but the music blaring was hip/hop, almost rap (bad choice). Not a big deal; we just walked past the bar and to our room. This hotel is a pleasantly healthy walk from the main part of the Riverwalk and it is nice that you pass all the other hotels, restaurants and bars on the way back to this hotel because, after a big meal, the walk was invigorating. I will definately stay here again when I visit San Antonio. P.S. there's a great German bakery right across the street in an old hotel.", "title": "Different in a good way", "helpfulness": 5, "user": "LTKING", "date": "April 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3397025}, {"rating": 5.0, "stay_parameters": "Stayed July 2004", "text": "Very pretty hotel and great staff and rooms. Will recommend it to everyone. It is at the end of the Riverwalk, but that's fine if you don't mind walking and getting the exercise. Pricey, but worth it.", "title": "Very nice hotel!", "helpfulness": 4, "user": "Mazzy0774", "date": "April 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3395849}, {"rating": 5.0, "title": "The Valencia rocks!", "text": "Great vibe, excellent location. Had a riverview room which was awesome. reserved off the hotel website - it was spacious and very nicely finished. Yes, some will find the atmosphere a little different, but if you like the W, you'll love the Valencia (actually, the 'V' is cooler in a much more understated way). Helpful staff - the guys at the front door were tremendous. Will definitely be back!! Didn't get to try the bar or restaurant - spent too much time carousing along the riverwalk.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "April 17, 2005", "id": 3369434}, {"rating": 3.0, "title": "A little edgy... a little odd", "text": "We stayed at the Hotel Valencia in San Antonio, attracted by a 4 star rating by Expedia. The hotel is about 2 yrs old, and nicely maintained. It was a bit odd though, but perhaps you won't mind.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 24, 2005", "id": 3228860}, {"rating": 4.0, "title": "Great Service!!", "text": "First, the feel of almost all of the public space is dark, with accent lighting where needed, but shadows everywhere. The guest halls took some getting used to with lighting levels (clearly intentionally set) very low.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 22, 2005", "id": 3216608}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The style is for sure chic and great. Waitstaff and hosts are all so wonderful but the one night we stayed we heard it all. From the maids taking, people dinning on the patio below and car/trucks passing. My husband did not get to rest at all. I won't stay again but I will visit the sunday brunch.", "title": "Noise Level", "helpfulness": 1, "user": "Loves2Travela", "date": "November 12, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6111940, "likes": {"liked": "— chic style", "disliked": "— noise"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Before posting this, I read the previous 8-10 reviews before me. I can say that I agree with them all - the good and the bad. But when the bad ones are true, they truely do overshadow the paper-thin physical appearance of the hotel.", "title": "Good and Bad Reviews are true", "helpfulness": 5, "user": "Fletch32", "date": "November 6, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 6079537, "likes": {"liked": "— Full cable - not just standard ESPN and CNN; 2 computers with internet - free", "disliked": "— Noise; Stunned management acted like it was the first complaint they'd ever had"}}, {"rating": 3.0, "title": "Hotel Valencia wants to be a \"W\" when it grows up.", "text": "The room had beautiful fixtures and decour, and the rooms had lots of modern chic. Great detail, even down to the Plantation shutters in the rooms - and we stayed in two over two nights.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 29, 2006", "id": 6023498}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "That's because the noise was horrible. The hotel should be embarassed and ashamed at the oversight. Sound-proof windows are a necessity on busy downtown streets. The Valencia has none. It sounded like there was a construction project going on outside. The manager the next morning played dumb, saying he had not been informed of a construction project.", "title": "No Sleep!!!!", "helpfulness": 4, "user": "GUNDY'S", "date": "October 16, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 5960332}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Have you ever heard the garbage men when they grab a big Dumpster with the big robot arms then turn it upside down into the back of the truck, rapping the bin over and over to jar out garbage at the bottom? That was the sound that went on all night between midnight and 4am. The manager had no clue such a thing existed in their little neighborhood.", "title": "Not for Me!", "helpfulness": 2, "user": "jakester20", "date": "October 15, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 5956969}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We booked this hotel as a romantic getaway, having previously stayed in an associate hotel (the Lancaster in Houston). The web site made the hotel look great and from a style perspective we weren't disappointed. The hotel has a great feel, is clean and stylish.", "title": "Almost, but not quite......", "helpfulness": 4, "user": "GraemeBT", "date": "February 26, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6842442}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "However:", "title": "One of the better hotels in the area but far from great", "helpfulness": 6, "user": "dcormann", "date": "February 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 6821290}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We arrived at the designated time of 4pm and our room was not ready. The receptionist suggested we sat in the bar as the room would be ready in a few minutes and he'd come and find us. An hour later, after having to queue for the reception desk again, I was handed my key and told that the room had been ready for half an hour.", "title": "Bait and Switch", "helpfulness": 1, "user": "s0calgal", "date": "February 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 6815048, "likes": {"liked": "— Away from main part of Riverwalk"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The room was exactly as we expected, a King bed and with a courtyard view. We both work long hours and very rarely get the chance to sleep past 6am so we were delighted that the wooden blinds shut out all the light and allowed us to sleep until 9.", "title": "Glorified Inn on a glorified creek", "helpfulness": 3, "user": "nikkilew", "date": "February 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 6806084, "likes": {"liked": "— ambiance", "disliked": "— lack of consideration"}}, {"rating": 5.0, "title": "One Smidge Short of Excellent", "text": "The courtyard was, however, very noisy. There was a wedding party going on and people shouting across the courtyard from balcony to balcony.", "helpfulness": 4, "user": "Rebekajean", "date": "February 6, 2007", "id": 6751720}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Excellent hotel got engaged here the staff was wonderful and made it a time to remember. Highly recommend this Hotel!!!", "title": "\"Awesome\"", "user": "Brian B", "date": "September 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118715547}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Unbelievably impressed by the quality and customer service at Hotel Valencia. My husband and I live in San Antonio, and decided to treat ourselves by booking a room here to celebrate my birthday. From the moment we pulled up, we received EXCELLENT service. The valet and bellhop were courteous and helpful. The front desk attendants were warm and welcoming. We arrived at 1pm (check-in is not until 4) and they happily accommodated us by getting us a beautiful king bedroom. The hotel atmosphere is gorgeous. Beautiful water features, lighting, etc. The room was clean, cozy and very chic. Great bathroom amenities, filled mini bar, flat screen tv...everything you would expect of a hotel of this class. Upon our return from lunch, I found a hand signed birthday card from the whole staff in my room as well as cheesecake with strawberries as a birthday treat! I could go on and on, but for anyone looking for an exquisite hotel room, excellent customer service, and ideal location on the Riverwalk you MUST book a room here. I'm not typically one to do reviews, but this type of service deserves proper acknowledgment. Thank you for making my birthday so special Hotel Valencia! We will be back!", "title": "Birthday Bliss!", "helpfulness": 1, "user": "Adela1122", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118608187}, {"rating": 5.0, "stay_parameters": "Stayed September 2011", "text": "Outstanding service and courteous staff. Great and prompt room service. Delicious food. Will stay there again.", "title": "Best hotel experience to date!", "user": "joobah", "date": "September 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118584696}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Got to town early, room not ready, left bags and went to riverwalk. Nice enuf, sat and people watched after one pass back and forth, needn't come back again. Back to hotel, Room finally ready. Staff just so so, we are too old to matter. Hallways dark, room modern, which i like. Uber hip lounge and restaurant but mike didn't want beef cheeks for dinner so we went to Landry's for seafood. Yuck, worst meal ever. Morning.. Shower is cool but built for basketball players, i'm 5'1\"\" couldn't reach robe hook over door. HA", "title": "Pretty stuck on itself", "helpfulness": 1, "user": "Pami46", "date": "September 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 118572015}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The Hotel Valencia Riverwalk is amazing.", "title": "Best hotel stay EVER!", "helpfulness": 2, "user": "GeoJenna223", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118507153}, {"rating": 5.0, "title": "Different SA Hotel", "text": "Great hotel, but it is a very different vibe than other SA riverwalk hotels. Chic, dark, tech savy, hip would be how I would describe the place. Our room was a large, king room with balcony overlooking the courtyard. Some noise from the courtyard, but otherwise a great room. Could hear the kids in the pool at the Holiday Inn next door and the staff cleaning the courtyard late at night. The front desk was very helpful. I found the low lighting throughout the property to be relaxing.", "user": "rcmjr", "date": "July 6, 2005", "id": 3639136}, {"rating": 5.0, "title": "BEST San Antonio Hotel", "text": "Park across the street in a surface lot for $7.", "user": "A TripAdvisor user", "date": "June 21, 2005", "id": 3589881}, {"rating": 5.0, "title": "First rate hotel and restaurant", "text": "All-in-all, a great place to stay on a quiet section of the riverwalk.", "user": "A TripAdvisor user", "date": "June 19, 2005", "id": 3576043}, {"rating": 4.0, "title": "Super cool hotel!", "text": "We stayed at the Hotel Valencia over Memorial Weekend. This is a first class hotel. Our room was very big and spacious, and the beds were VERY comfortable.", "user": "ash2flame1", "date": "May 23, 2005", "id": 3494909}, {"rating": 5.0, "title": "Most Incredible Hotel I Have Stayed At", "text": "The Hotel is located right by some great Restaurants and Bars. It is also located at one of the ends of the Riverwalk so it is very quiet.", "user": "linkin12", "date": "May 21, 2005", "id": 3490250}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Had a wonderful stay for our Wedding Anniversary.", "title": "Fantastic place for our 25th Wedding Anniversary !", "helpfulness": 1, "user": "westminster49", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118426991}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We were upgraded to a suite with a lovely balcony and fantastic view of the surrounding area.", "title": "Definitely Not Upscale", "helpfulness": 1, "user": "Maricella C", "date": "September 19, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 118322042}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We loved the pool area - very clean and comfortable.", "title": "Two Words-Top Notch!", "helpfulness": 1, "user": "amrsc77", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118041043}, {"rating": 4.0, "title": "Citrus Resturant Weekend Lunch", "text": "Enjoyed cocktails in the V bar for Happy hour and had a good breakfast in the morning.", "user": "JourdoS", "date": "September 12, 2011", "id": 117976707}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Centrally located to walk to all the restaurants in Santana Row.", "title": "24hr girls / mom get-away!", "user": "Wenbrooks", "date": "September 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117904573}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I stayed at the Valencia Hotel on the beautiful Riverwalk in San Antonio for one night on October 8, 2011. Because of an event in the hotel’s neighborhood, where some of the streets were closed off to traffic, it was difficult to find the entrance for valet parking. After calling the front desk, though, they helped us get there. I had stayed at the Valencia before, and knew that the location was just what I wanted. On the Riverwalk, close enough to the event I visited San Antonio for that weekend (International Accordion Festival at LaVillita), but far enough not to be right in the middle of all the action. It’s a pleasant walking distance and very pleasant walk. I opted for a city view room (king bed) because I knew I would be spending most of my day at the Riverwalk anyways, so there was no need to have a view of it after dark. The room was a very good size, window facing the courtyard (but unfortunately also the opposite wall). I liked the look of the dark wood shutters, but not the fact that they could not be opened all the way. The room was already very dark, and a little more light would have been welcome. I like the modern interior styling of the rooms very much. Lovely dark wood floors. I appreciated that they had not flowered bedspread (yeah!!). The bed was very comfortable. There was an entry way into the main room, after the room door, which is a nice feature; it gives you enough privacy in case a hotel employee enters. The long desk along the wall is very functional; it also is large enough to store other items. I never was able to get the TV to work, but didn’t really need to because I was out and about mostly (just wanted to check for weather report). Nice style; good location; fair value. Too dark in the rooms though. Hard to read. The front desk let us check out at noon, even though check out time is 11:00. There is no self-parking available at the hotel, which I don’t like. There are parking opportunities in the neighborhood, but not really very much cheaper, so I opted for the valet. It took much longer than promised to get the car from the valet. In all fairness I must add it was raining that morning, which is kind of unusual, and which may have made it take longer for the valets to retrieve the cars. Personnel is very friendly. Rooms are clean.", "title": "Modern vibe", "user": "Kokko", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119970170}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Hotel Valencia is nice and right next to Riverwalk which is very convenient. Why is it so dark? I don't know how the front desk staff can see what they're doing. No grab rails on tub which is dangerous for older people. Also no coffeemaker in room nor is coffee available in lobby. This is unusual. Hubby had to go to Starbucks to get his much needed caffiene. Clean enough but probably wouldn't book again. Light this place up!!", "title": "Dark", "user": "walkfast", "date": "October 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119834484}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "This is a very classy place and its presentation is consistent through out. A hopping bar on weekends adds to the fun. Restaurant cuisine is creative and the giant waterfall upon entering is a visual plus along with some artistic flair in design of rooms. Has the same vibe as a Za-Za property. Will definately go back !", "title": "Stunning and sleek", "helpfulness": 1, "user": "michaelSugarland", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119673731}, {"rating": 4.0, "stay_parameters": "Stayed October 2011", "text": "Very nice building, chic atmosphere, only area of improvement would be they staff's personal touch. Service was very good, but very business like, not quite the \"go-above-and-beyond\" attitude I have found in hotels of the same class/price range. But overall a nice stay.", "title": "Very nice hotel.", "user": "billyor", "date": "October 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 119669736}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Came to hotel for business convention and it was very contemporary, pretty cool, but it was so dark in the lobby and in the rooms compared to the hotels that I stay in when traveling for business every week, I felt like they were trying to hide something. I just didn't get why it was so unlit, how is that safe? So my main issue is there is minimal lighting in the room and my bedframe was dark brown and the carpet was a dark color so there was no visual delineation between the two. The mattress is too small for the frame so the bedframe stuck out several inches from the mattress. I didn't spend much time in my room but every single time I came back during a break or to go to sleep, I rammed my shins into the corners of the bedrame and said a few choice words out loud. Wear shin guards if you stay here, seriously. It is hazardous.", "title": "Great location but hazardous bedframes-wear shin guards", "user": "Equestrian", "date": "October 13, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 119270969}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Great location and very busy bar scence on a Saturday night. Lobby is on the second floor and reception is badly lite and hard to hear due to the acoutics and the water fall. Looks great but not very user freindly IMHO. Room 11th floor was facing Houston street and VERY load traffic noise, WIndows were single pane. Many mood lighing opportunities with dimmers at multiple locations in the room. Room furnishings were very well done and appointed. For the location across the street from the Majistic Theater it is a great consideration to stay if attending the theater. Their restaurant was a fabulous find. Most hotel restaurants are middle road this one was at the high end of a meal expereince. Wonderful food and great service. Would definately go there again.", "title": "Not Great but Not Bad", "helpfulness": 1, "user": "PLKAustin", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 124963577}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I loved my stay at Hotel Valencia. The building and lobby is beautiful the staff was friendly and fast. The room was modern and very clean. We had breakfast from room service and I couldnt ask for more. The V bar is a great place to finish your night since all you have to do is take the elevator to your room. The location is a little ways off the riverwalk but I was happy with it. When we go back to the riverwalk, the only hotel im staying at is Valenica :)", "title": "Beautiful Hotel", "user": "Valarie A", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124950271}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "we love this room to go as a family or with other couples. The rooms are spacious and very comfortable. the restaurants Are excellent and the bAr has great service.", "title": "Hotel Valencia San Antonio", "user": "Vanessa M", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124903549}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Just ended a great stay at Hotel Valencia. Room was comfortable, decor and feel of lobby, bar, and restaurants was swanky. Loved it and will stay there again. Bonus...saw Charles Kelly from Lady Antebellum there.", "title": "Swanky and Comfortable", "user": "Jtaylgator", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 124892639}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Booked for President's weekend. First visit to San Antonio. Agree with other Tripadvisor comments on dark lobby. However, after a couple of days not bad.", "title": "Out of our comfort zone", "user": "Chucknoble", "date": "February 20, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 124889347}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We booked a standard room and were upgraded automatically, without asking, to a courtyard view with balcony (room 401), which was nice. The room was large with a nice long desk/table and was aesthetically pleasing. It had fancy smoked-glass doors on the bathroom & closet and an impressive mini-bar & serving area. The bathroom tub, sink & toilet were very clean, however, we both noticed that everything else was very dusty. It looked as though they've never dusted or wiped any other surface in the room. I was also surprised that there were no dresser drawers in the room. There was only two small drawers underneath the mini bar (in the way of the bathroom door) and a small drawer on each nightstand. The long desk/table unit was completely open underneath and could have easily accommodated a short dresser unit. Strange. I've never had a room without dresser drawers before. BUT, the rest of the room and view was nice, so we were pleased.", "title": "Unique hotel but in need of some attention", "user": "Linda B", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 124839316}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Then came morning. We were rudely awakened to the sound of pounding and then an electrical saw. We discovered the fountain in the courtyard right next to our room was being worked on. Not happy about being awakened, I talked to a lady at the front desk and advised that no one had warned us about the construction when we checked in. She kindly apologized and offered to move us, but I declined since we only had one more night there & did not want to have to move everything. Though I told her that it would be considerate to guests to start construction after 9 am. She said she would put in a request to the manager about starting later. She also gave us free valet parking for our inconvenience. Her professional & considerate attitude was very much appreciated. Later that day, we received a voice message from a manager and he apologized to us for the inconvenience and ordered the construction begin no earlier than 9 am. And sure enough the next morning, no rude awakening.", "title": "Worth what you pay", "user": "sydspot", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124766260}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The valet attendants / bellboys were always very attentive & friendly and held the front door open for us every time.", "title": "Impressed", "helpfulness": 1, "user": "Louise F", "date": "February 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124583173}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We had breakfast at their restaurant, Citrus, each morning. Their food is gourmet and very good -- a little pricey, but worth it. My only complaint is that on the first morning, I had to wait what seemed like an eternity for my coffee and then had to ask for a regular-sized mug, rather than their tiny teacup, because they wouldn't leave the pot on the table for refills. But the next morning I just asked for a mug right away and all was good.", "title": "A True STAR in the Lonestar State!", "user": "1blkhny_va", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124397902}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We did also stop in briefly at the bar for a beer one afternoon and the bartender was very attentive. He gave suggestions, a free sampling and only charged my husband for one of his two beers.", "title": "less than average in cleanliness", "user": "HThomas", "date": "February 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124152286}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The hotel is fairly nice however it could use some more lighting in the check-in area and in the rooms. It's in close proximity to the Riverwalk and within walking distance of the Alamo.", "title": "Comfortable Stay", "helpfulness": 1, "user": "Charlie V", "date": "February 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123947737}, {"rating": 3.0, "stay_parameters": "Stayed January 2012", "text": "The rooms are a good size and come with a full complement of drinks in the mini-bar. The beds were comfortable and clean. The food at the on-site restaurant (Citrus) was pretty good. The bar doesn't open until 4pm, but there are plenty of food/drink options near the hotel. A few of the employees at the reception were not very helpful to say the least.", "title": "Expensive parking $29 per night but great location,bad beds and bad service.", "user": "Rstrack", "date": "January 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 123804715}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Overall, it was a comfortable stay and I would recommend it to others.", "title": "Could be great but.....", "helpfulness": 3, "user": "yumyumguy", "date": "January 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123673162}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "$29 per night parking is ridiculous!", "title": "Fun and hip hotel", "helpfulness": 1, "user": "mihai123", "date": "January 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123669804}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Bad matresses covered with Egytian cotton sheats, ridiculous.", "title": "Perfect Wedding Night Stay!", "helpfulness": 1, "user": "Debra S", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123514329}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I love chic, boutique hotels and am very picky about where I stay but I was genuinely blown away by this place. The whole hotel is an experience--from the floor-to-ceiling waterfall in the entry way to the dimly lighted sort of sexy lobby on the second floor. The lobby area which houses the restaurant, bar and has a balcony with a fire pit overlooking the river walk reminds me of a swanky bar--dim lighting, candles, a chic little lounge...it even smells good!", "title": "Can I move in?", "helpfulness": 2, "user": "isaleistar", "date": "January 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123421772}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The room itself was very nice with a big, comfy king sized bed with high-end linens, a large flat screen tv, a lovely bathroom, and fancy little complimentary soaps and shampoos. Have you ever been to one of those hotels and thought---I wish my house looked like this? That's how I felt. Impeccably decorated.", "title": "Great Location and Free WiFi!", "helpfulness": 1, "user": "denajennell", "date": "January 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 123310876}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I walked though the bar and restaurant but didn't eat there. They were equally swanky looking. They also had a pool area but being from DC I did not anticipate a pool being open in January. Looked very nice though.", "title": "Be Warned Room 721", "user": "Theflattireguide", "date": "January 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 123205673}, {"rating": 2.0, "stay_parameters": "Stayed January 2012", "text": "Very nice location about 4 blocks from the Alamo and literally right on the river walk. About half an hour from the airport (cost about $30 including tip for a cab).", "title": "Personal info on scratch paper receipt!!!", "helpfulness": 1, "user": "miabel", "date": "January 16, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 123183997}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "A few slight nit-picks. I loved the swanky, dim lighting throughtout the hotel, but in my room it was a bit annoying. Even with all the lights on I had a hard time doing my makeup in the bathroom (and the room itself wasn't any better). I got locked out of my room because my key stopped working the second time I used it. No free breakfast and the prices were pretty high. Lastly, the room was slightly noise until about 10:30. There was a marachi band playing at one of the restaurants on the river walk below my window. Even though I was on the 9th floor I could hear it although the air conditioning drowned it out a bit. Just be wary getting a room facing the river walk, courtyard, or a room closer to the ground level.", "title": "Very nice and Very romantic hotel!!!", "user": "CLKing315", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123158485}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "Clean,great location,hotel contemporary but atmosphere very dark ,valet parking $29/night and beds uncomfortable.", "title": "Clean,great location,hotel contemporary but atmosphere very dark ,valet parking $29/night and beds uncomfortable", "user": "ccwill", "date": "October 9, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 119102216}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Has a dark romantic feel to it, its clean and has a good enviroment. The only downer and its not Valencias faults but if you get a city view the street is very loud! Kept me up most of the night!", "title": "Great", "user": "nikole505", "date": "October 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 118977711}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "Very nice location. Room appeared clean. Staff was great. Hotel dark and depressing ...room dark & depressing....made entire trip very sad. Hated to go back to the hotel at the end of the day - but used Hotwire so had prepaid. Just incredible that the whole place was soooooo gloomy... Lobby dark, room dark, restaurant dark..... Not sure what management was thinking with the lack of lighting, but they might want to rethink. Valet parking was outrageous at $29 per day.... around corner was $9 per day in public garage. Definitely think about it very hard before you book here...life is too short.", "title": "gloomy and sad", "user": "civicgyrl", "date": "October 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 118941639}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I had business in San Antonio - so I stayed a couple of extra days, and brought my husband down for the weekend. We had an amazing time. This hotel is wonderful, and the people are amazing. They found out it was our anniversary and we had chamagne and chocolate covered strawberries in the room for us. Huge surprise. Citrus is a MUST - the food is wonderul.", "title": "Business and Pleasure Combined for great four days!!", "user": "Lisa D", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118782436}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Our room faced the inner courtyard and had a small patio which was nice.All the staff were very friendly.", "title": "Great stay!", "user": "Moose1422", "date": "September 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118780665}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 4, "variance": {"poor": 82, "average": 103, "very good": 234, "terrible": 42, "excellent": 534}, "aka": "Valencia Riverwalk Hotel", "slim_ranking": 0.109510086455, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located on the historic San Antonio River Walk, Hotel Valencia Riverwalk is a boutique hotel in San Antonio located in the heart of downtown. Hotel Valencia is ideal for a romantic or weekend getaway, a business trip or a group or convention. Our hotel is within walking distance of the Alamo and other downtown attractions and only a short drive to Sea World, Six Flags Fiesta Texas and various golf courses. Enjoy signature cocktails in Vbar and dine in the acclaimed Citrus Restaurant. Amenities include signature beds with Egyptian cotton linens, complimentary high speed internet and newspaper."}