{"user_rating": 4.5, "review_count": 768, "name": "Hotel Luxembourg Parc", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "EXCELLENT location, charming boutique type hotel. Avoids the tourist throngs. I would stay here again in a heartbeat. Easy access to many important Metro lines and the RER B from CDG (you can walk from the RER to the hotel...providing you don't have too many bags in tow). The staff is friendly and extremely helpful and well versed in English. The breakfast is pricey but well done. Good sized elegant room with comfortable bed and large bathroom. Our room faced the cobblestoned rue Servandoni with geraniums outside the window. The lovely Luxembourg Park is just across the street. What are you waiting for?", "title": "Believe the Glowing Reviews", "helpfulness": 5, "user": "shep77", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10051414, "likes": {"liked": "— Wonderful location that avoids the tourist mobs", "disliked": "— Can't think of a thing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "What a wonderful hotel and staff. They are simply the best. We stayed in France for 12 days on our honeymoon, with the majority of that time at HLP. Like others before me stated, they were absolutely helpful and treated us like family.", "title": "Wonderful Honeymoon Destination", "helpfulness": 3, "user": "degbert71", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 10048133, "likes": {"liked": "— The Staff", "disliked": "— The Bed"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2003, traveled as a couple", "text": "I was a little pessimistic about going to France on our honeymoon and I fell in love with it. Thank you HLP!", "title": "Amazing hotel in the heart of Paris", "helpfulness": 2, "user": "gellura", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8878375, "likes": {"liked": "— Lovely location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "This is an amazing hotel with friendly, attentive staff. I highly recommend this hotel.", "title": "a brilliant little hotel", "helpfulness": 6, "user": "motherdaughter", "date": "August 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8503925}, {"rating": 5.0, "title": "Charming Hotel in Paris", "text": "This was my second time staying at \"lux parc\" in Paris. I knew the location was perfect: on the left bank, right next to Luxembourg Parc and down a charming little cobblestone street. The rooms are beautifully appointed; quite large by Paris standards and the views are captivating.", "helpfulness": 5, "user": "grandkids6", "date": "August 21, 2007", "id": 8466325}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed at the Hotel Luxembourg Parc for our honeymoon (Room 236) and loved it. Room was small but well appointed and romantic. Bed was very comfortable. Bathroom was also small, but with beautiful white marble. Air conditioner worked well, and was much needed, as it was 41c when we were there. Breakfast was excellent, but on the expensive side. Staff was very nice and helpful. Location was a little walk from heart of the Latin Quarter, but not too far to make it a pain to get to. Overall, it was a nice experience and would certainly recomend to anyone....", "title": "Excellent Hotel, A Little out of the Way", "helpfulness": 1, "user": "nycgreenwich", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 139377667}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "If you are looking for a wonderful small, hotel in a great area of Paris, this is it. The rooms are lovely, clean and bright. The staff is very helpful and although we did our best to speak French, they went out of their way to speak English. When we requested a restaurant or other location, they drew maps for us. The restaurants they recommended were just what we were looking for; some fine French and some mall bistros. It is walking distance to Notre Dame, St. Chapel, the Marais and many other sites. The Closest metro is a few blocks away.", "title": "A great mall hotel in a wonderful location", "user": "barnstablerw", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139366397}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "The hotel is right across the street from Luxembourg Parc and Palace. It is a beautiful place to walk and have a picnic.", "title": "Excellent well located hotel.", "user": "Gozziebean", "date": "September 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139276729}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The hotel is well worth it's no. 3 rating in Paris. Fantastic furnishings and relaxing surrounds. Bedroom great. Staff are very helpful. Breakfast is pricey but of course is optional. Probably best to try a cafe. Well stocked bar open until midnight.", "title": "The perfect surprise", "helpfulness": 2, "user": "LoulaRose", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139051108}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I stayed at Hotel Luxembourg Parc during a surprise getaway weekend with my boyfriend; I wanted our time in Paris to be special but intimate and this hotel was the perfect choice (thanks to Trip Advisor) as it offers the best quality along with relaxed familiarity. The decor and furnishings are classically beautiful, areas such as the small bar and reading room allow you to enjoy the hotel away from your room and extra touches such as free wifi and clean towels morning and evening make your stay extra comfortable. The location is exquisite - you have St Germain on your doorstep offering a large shopping district and cobbled streets packed with bistros and restaurants for evening dining options. Nearby transport options (buses / river / metro) give you easy freedom to explore the rest of the city or you can just walk a few minutes to Luxembourg Parc and relax with the locals. The staff we met - Michel and Cecilia - were very friendly and without them we would would have felt like strangers in Paris. Instead they helped us have some wonderful experiences and we would love to come back - I will need to start saving again!", "title": "Nicely Positioned", "user": "restlesshouston", "date": "August 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 138965458}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This hotel is in one of Paris’ many lovely older buildings and has a traditional French style. The double room was quite large as was the marble bathroom, with a shower and bath plus a view out to the Luxembourg Gardens. The bed was not ideal for a honeymoon as there was a very defined gap in the middle and two single duvets instead of one large one. The room was perfectly clean and quiet but since it’s an older building the floors were quite creaky. Free wifi was provided and there was a gym and breakfast available although we didn’t try these.", "title": "Great location, ok hotel", "helpfulness": 3, "user": "Rachel_Whales", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 2.0, "service": 4.0}, "id": 116170050}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The location is pretty good with a very easy walk across the road to the gardens and about 10 mins to Notre Dame. It’s about a 5 min walk to the metro or RER. The staff were lovely and very helpful.", "title": "Beautiful hotel in amazing location", "helpfulness": 2, "user": "LMM1109", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116087602}, {"rating": 5.0, "title": "Excellent Facility and Service", "text": "It’s worth noting that the fridges don’t actually work, apparently they are just to cool drinks but ours wasn’t cool at all. This probably isn’t an issue for most people though and the staff kindly let me put our milk in their fridge.", "helpfulness": 1, "user": "briane1", "date": "July 30, 2011", "id": 116037529}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "One final thing is that twice during our stay the cleaning staff came in and rearranged the room despite the do not disturb sign being up. This is probably a personal thing but I like to get settled in and don’t particularly like cleaning staff coming in every day and moving my stuff around, hence the reason I left the sign up.", "title": "Lovely hotel, superb setting, service second to none", "user": "rarebreed06", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115906433}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "All in all a nice little hotel if you’re looking for something near Luxembourg, however I'm not sure it’s worth the price paid.", "title": "Je t'aime Hotel Luxembourg Parc!", "helpfulness": 1, "user": "Lady_of_Lilador", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115879082}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed at the Luxembourg Parc in the second half of our European vacation. This hotel was simply the best.", "title": "Absolutely Perfect", "helpfulness": 6, "user": "StLMissouri2", "date": "November 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10673929, "likes": {"liked": "— The location, the Gardens, the bathroom, and the bed!", "disliked": "— Nothing - everything really was perfect!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The front desk was courteous and helpful. A man at the front desk even mapped out different restaurants for us to try in the area and each night we tried a new one. They were all wonderful! Our favorite meals were in Paris!! The front desk spoke perfect English and helped us as we tried to learn the customs and the language.", "title": "Loved Everything About This Hotel", "helpfulness": 8, "user": "TravelLadyBoston", "date": "October 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10467955, "likes": {"liked": "— The elegance of the hotel and the staff.", "disliked": "— Bathroom was a little small."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The hotel was in a perfect spot. Right by the metro - walking distance to downtown St. Germain. We walked as much as we could - but the location was wonderful with all the metros. Across the street is the beautiful Luxembourg Gardens. We spent an afternoon walking around and had a mini picnic. Just wonderful.", "title": "Best in Paris", "helpfulness": 3, "user": "Nige7", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10258740}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The room itself was small - but beautifully decorated and the bed - good, Lord, the bed ... it was so comfortable! We slept like babies!! The bathroom was a perfect size with great toilettries. The shower was just heavenly!", "title": "Loved This Hotel", "helpfulness": 2, "user": "LML31", "date": "October 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10171338}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Our room was decorated in Napolean style - very pretty. The hotel was quiet and in a great location. We didn't do the breakfast - it wasn't really worth the price. There are plenty of other places to try right up the street or further in St. Germain.", "title": "Peace and quiet in the city", "helpfulness": 3, "user": "Biggles68", "date": "October 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10085705, "likes": {"liked": "— The quiet room"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I just hate it when a small incident ruins your opinion of a otherwise pleasant hotel and I have to give a low rating. The hotel itself is very well situated in a quiet street but just a walking distance from a lively neighborhood. The room was spotless and the size was large in Parisian standard. Our room overlooked the beautiful Luxembourg garden and a quaint courtyard.", "title": "Transportation rip-off", "helpfulness": 14, "user": "catseattle1", "date": "September 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 140309125}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The issue I had was the transportation option I had purchased from the hotel website at the time of booking. It had offered CDG airport to hotel transportation for 120euros that was to be paid directly to the hotel at the time of the booking. I thought it was quite on expensive, but we were arriving in Paris very late at night and did not mind paying extra for the peace of mind. The driver met us right at the gate and drove us to the hotel w no problem. When we arrived, my husband stayed behind to help the driver unload the suitcases and I preceded to check in and head to our room first. Then the hotel receptionist halted me to say that I needed to pay the driver directly. I showed him the email I had gotten from his hotel saying that my card was debited for both the room plus the 120E for the transportation but he insisted that they never charge for the transportation. I just figured I can always check my credit card statement later to figure all that out and took out my credit card to pay the driver. Then my husband comes in with the driver and tells me that he told my husband that we owed him 60E for the ride. There's four of us looking at each other, then there was a brief conversation between the driver and the receptionist in French and the driver ran 120E on our credit card instead of 60E. If I wasn't so tired and totally jet legged, I would've insisted that we only should pay 60E instead of griping about it this morning on trip advisor. I did some research this morning on how much it costs on average to get into the city from CDG, it's about 50E if you take the regular taxi. I hope that this review helps to prevent other travelers from paying too much on their ride into city.", "title": "Fabulous Hotel - Spectacular Staff", "helpfulness": 1, "user": "Jim18PC", "date": "September 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140275311}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed at the Hotel Luxembourg Parc for 4 nights the first part of September 2012. We were there with family members for a special birthday celebration and European vacation. From the moment that we were met at the door by Cecillia welcoming us to the hotel, there was nothing that the staff would not do to ensure that our vacation was perfect. The hotel was immaculate, the rooms large and the marble tub and bathroom luxurious. Cecillia made wonderful recommendations for dinner including calling the restaurant to ensure we had reservations. The entire staff was superb and very focused on ensuring that all of our needs were met. Daniel the bartender was very friendly and made us feel very much at home in the cozy bar where we started and finished each evening. The location of the hotel was incredible with the Luxembourg Parc directly across the street. It was fun to wander the streets and mix with the locals and still be within walking distance to many wonderful restaurants and shops. We will certainly recommend Luxembourg Parc to our friends who travel to Paris and would not consider staying anywhere else when we next travel to this amazing city. Thanks to the entire Hotel Luxembourg Parc staff for a beautiful Paris experience. Shar and Jim", "title": "25th Wedding Anniversary in Paris - Great Romantic hotel", "user": "NY-MiamiCouple", "date": "September 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140008640}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The Hotel Luxembourg Parc is a great choice for a romantic getaway or any trip to Paris. A great location in a wonderful neighborhood. The staff was outstanding, friendly and helpful. The park across the street is a wonderful and beautiful park with just about everything you can think of in it. The neighborhood has everything you would want within a 5-10 minute walk. Restaurants, great shops, a beautiful church and easy access to the metro and buses.", "title": "Parisian Peace and Perfection", "helpfulness": 3, "user": "plum62", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139808387}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed in two hotels while in Paris, to get a feel for the city and the neighborhoods and the Hotel Luxembourg far out shined the Seven hotel, which was ranked 3rd most romantic in Europe, the Hotel Seven was nice, but the service was just not to the same standard as Hotel Luxembourg.", "title": "Love this hotel..", "helpfulness": 2, "user": "PJS308", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139441937}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Situated in a fantastic area for shopping (clothes galore) this hotel is small but perfectly formed. Yes the rooms are small - but this is Paris and our room was stunning, immaculately clean and tastefully decorated.", "title": "A Gem of a hotel", "user": "tip2p", "date": "October 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20844575}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The reception staff were polite, welcoming and accommodating. Lounge/ bar area is small but intimate and tis extends into the library area where we had a night cap after our night out. Our room overlooked the side road and was quite. My husband had rung ahead and as a surprise had arranged with the hotel a car from the station, a bottle of champagne and the largest bunch of roses I have ever seen. The hotel had recommended and booked a restaurant for us and were on had to make suggestions of an itinerary for our short stay.", "title": "Hotel Luxembourg Parc - tops for the Paris experience", "helpfulness": 1, "user": "ToonTowner", "date": "October 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20795130, "likes": {"liked": "— The location and the decoration of the room.", "disliked": "— The price."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed for two nights over a weekend in the middle of October and were fortunate enough to have glorious weather.", "title": "Just what you would want in Paris", "helpfulness": 1, "user": "wonderlust26", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20637766, "likes": {"liked": "— Our room and bathroom, the staff, the location", "disliked": "— the girl in the breakfast room could be more pleasant"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The Hotel Luxembourg Parc is a great place to stay if you want to feel like you are truly staying in Paris. Its rooms are decorated in traditional French design and not like a cookie cutter hotel room you would find in a hotel chain room. Because of this, you’re going to pay a little more than you would for other hotels in Paris. If you are just looking for a place to sleep while in Paris this is probably not the hotel for you. If you’re looking for something to add to your Paris experience, this is definitely the hotel for you.", "title": "Not absolutely perfect", "helpfulness": 2, "user": "TheQueenslander", "date": "October 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20603395, "likes": {"liked": "— The boutique nature of the hotel", "disliked": "— Small room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The hotel is located directly across the street from the Luxembourg Parc. The park itself is a wonderful place to walk through and relax.", "title": "A delightful small Hotel", "helpfulness": 2, "user": "Sasdax", "date": "September 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20238765, "likes": {"liked": "— The whole experience!", "disliked": "— Leaving, wished we had stayed longer!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "This hotel is in the perfect location close to the Luxembourg Gardens, metros, restaurants, bakeries and within walking distance to the Louve, Notre Dame, Latin Quarter etc. The rooms are small (average sized for Europe) but very clean with a small refrigerator and safe. There was no iron! The bathrooms are very nice with a soaking tub/shower combination.", "title": "Great location, some problems with front desk staff and elevator", "helpfulness": 1, "user": "PacoCA", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115873051}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Most of the front desk staff were knowledgeable and very helpful. They allowed us an early check-in and brought our luggage up to the room. Unfortunately, the elevator was out of order several times during our 6 day stay, including the last day when we had to lug 3 large pieces of luggage down 3 flights of stairs in a very narrow stair case. The front desk staff (young man) had to be pulled from a back room to check us out.", "title": "We spent our first night as married there! But...", "helpfulness": 2, "user": "loluna", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 5.0}, "id": 115810481}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Despite the few hick-ups, our stay was very memorable, and the hotel was a major plus for us!", "title": "A Beautiful and Friendly Hotel in a Great Location", "helpfulness": 1, "user": "Cecilesmom", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115773410}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Well, we choosed the hotel after reading the reviews at Tripadvisor.", "title": "Everything People Say Is True", "helpfulness": 2, "user": "jzimmerm", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115706699}, {"rating": 5.0, "title": "The Perfect Parisian Hotel", "text": "The hotel is amazing, but there are few things to be aware of if you are thinking about staing there.", "user": "Brandtly", "date": "July 23, 2011", "id": 115683016}, {"rating": 5.0, "title": "A gem", "text": "A beautiful, small treasure of a hotel in a wonderful neighborhood. Easily accessible to all of Paris by foot or by the Metro.", "helpfulness": 1, "user": "Taic4u", "date": "April 22, 2007", "id": 7415733}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The hotel is small but perfect. It is a short walk to the senate or the gardens. Due to the small size the staff is not overwhealmed and takes care of everything. Will stay again. The decor was great and loved the courtyard . Close to everything.", "title": "Peace and Tranquility", "user": "finlynchmom", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138344759}, {"rating": 4.0, "title": "Luxury Stay", "text": "We stayed here for three nights. The room was clean and had a large armoire for storage of suitcases and clothing, so the small size. We visited the breakfast buffet one morning and it was decent, but was not replenished when food ran out, so make sure you go early to get the best selection. The neighborhood around the hotel is full of boutique shops that were fun to walk by on our way to the Metro each day. The Jardin du Luxembourg was also fun to explore.", "helpfulness": 1, "user": "Grace B", "date": "August 25, 2012", "id": 138278938}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This beautiful intimate hotel was just lovely, the staff was wonderful and so helpful...close to everything! One day we left and turned right to see all the sights, the next we turned left to see the rest.", "title": "This Hotel Could NOT BE BETTER!", "helpfulness": 2, "user": "michael f", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138113112}, {"rating": 5.0, "title": "Excellent touch of class in a great location", "text": "Just outstanding. Nothing else need be said. You read the other reviews so mine would just be more than redundant. The whole experience was just exquisite! AAAAA++++++ x 1,000,000!!!!", "helpfulness": 2, "user": "tally11111", "date": "August 23, 2012", "id": 138071892}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The staff, the location, the stunning decor of the hotel. It was all just amazing. I used to live 1 1/2 blocks away and being back in my old 'hood was incredible. Can't wait to go back.", "title": "The perfect choice of stay in Paris", "helpfulness": 1, "user": "Andrew B", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137974405}, {"rating": 5.0, "title": "Luxurious retreat on the left bank", "text": "Fabienne has been with the hotel for several years. She is the quintessential Parisienne. She knows all the corners of the city and had no hesitation recommending places to eat and visit. She happily spoke with us in (perfect) English and indulged me while i practiced my french.", "user": "Harborchick", "date": "August 16, 2007", "id": 8439975}, {"rating": 5.0, "title": "Super place to stay.", "text": "Sophia is brand new to the hotel. A young woman from Sweden who is in Paris to perfect her french, Sophia was a most willing and attentive server at the hotel. She was very sweet and obliging with every request. Again, her english was perfect (we thought she was a Canadian) and she happily moved from french to english.", "user": "Neewells10", "date": "August 14, 2007", "id": 8418941}, {"rating": 5.0, "title": "Pied a Terre in the City of Light", "text": "This is a wonderful hotel; small, luxurious, quiet, perfectly situated and charming. It is a short and interesting stroll to Boulevard St. Germain along boutique-lined streets. The Odeon Metro line is 5 minutes away and connects to all points of the city via Chatelet or Montparnasse. There is a wonderful neighborhood bakery near St. Sulpice, on the corner of Rue Mabillon and Guisarde, which serves freshly baked breads and pastries if you want to pass on the expensive breakfast at the hotel. For other daily supplies there is a supermarket on Rue de Seine, just beyond Boulevard St. Germain.", "user": "familytravelz", "date": "August 9, 2007", "id": 8380576}, {"rating": 4.0, "title": "Charming hotel, great location.", "text": "The front desk staff speak English and are helpful recommending restaurants, local attractions and arranging transportation. By all means, take time to walk around the Gardens across the street and see the famous fountain in which children sail rented sailboats a la Madeleine. St. Sulpice, currently undergoing exterior renovation, is at the end of the cobbled alley that borders the hotel.", "user": "JMBWashington", "date": "August 9, 2007", "id": 8378651}, {"rating": 5.0, "title": "Lovely Luxembourg!", "text": "Rooms are beautifully decorated and functionally outfitted. Double/triple glazed windows keep street noise to a minimum. The marble baths have generous counter space and excellent lighting. The interior designers have done a magnificent job of creating environments that are elegant but comfortable; unique prints and paintings (some artfully illuminated), high quality fabrics, wood floors with Persian carpets and comfortable furniture make a stay here pleasantly homey.", "user": "TravelingTxn", "date": "July 26, 2007", "id": 8237633}, {"rating": 5.0, "title": "Highly Recommended", "text": "There was no iron or ironing board provided, although there was same day laundry service (in by 10am, back by 8pm).", "user": "flippywebsurfer", "date": "June 4, 2007", "id": 7756766}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "At the beginning of May, we spent 6 memorable nights in this perfectly located hotel. We booked it based on its raving reviews, and as many other visitors we were pleasantly surprised that this hotel deserves the high praises. It is not only within walking distance from 2 metro stations, but also to the Louvre and Notre Dame, the famous rue Bonaparte and just across the street from the wonderful Luxembourg Gardens. This spotless and impeccably decorated hotel aims to combine the highlights of baroques style with modern life conveniences and of course the famous French chic (white marble bathroom; hardwood floors with Nain design Persian rugs; period furniture and the crystal chandelier in our suite). We enjoyed the pastries served for breakfast (straight from the Gerard Mulot’s pastry store located at less than 5 min walk from the hotel-a recommended visit if you are a dessert lover).", "title": "Remarcable hotel in Paris", "helpfulness": 2, "user": "mnaag04", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114948162}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Our gratitude to M-dames Fabienne and Lydia, who proved an impeccable professionalism in dealing with all the issues we had.", "title": "We absolutely loved this hotel", "helpfulness": 1, "user": "cathykatz3", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114712375}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We cannot wait to return there.", "title": "A touch of luxury in Paris.", "helpfulness": 2, "user": "WickB", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114691525}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We had four rooms and loved this hotel: it is charming, fantastic location, delicious breakfast, and helpful and friendly staff. I definitely recommend this hotel if you are going to Paris. Great for couples, families and friends.", "title": "Excellent, but if only the Metro were closer", "user": "leidenaar", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114325813}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My adult daughter and I stayed 2 nights at this elegant hotel and wished we could have stayed longer. While the room wasn't large, it was beautifully appointed, comfortable, and gave us a corner view from 2 windows. As I was recovering from a cold and the usual fatigue of travel, it was great to pull the blinds, keep the day out, sleep in, and catch up on my rest. We ate a lovely breakfast (late of course) in a room that let us look out on the street scene near the Luxembourg Gardens. The common rooms are beautiful, and the hotel is set on the typically ancient curving streets of the Left Bank. Set one foot out and you're in nowhere but Paris! Shops, dining, and sights are all easily accessible. Our hosts made great dinner recommendations (La Maison du Jardin for dinner--terrific, twice), offered advice for patisseries, pharmacies, sights, and were enormously helpful and kind. I'd stay at this hotel again in a minute. Wish I was still there!", "title": "Intimate, classy, and great staff", "helpfulness": 1, "user": "Draz97", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114011583}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Dear Luxemborg Parc Team,", "title": "Amazing place and staff.", "user": "guilhermesousa", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138892820}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "we would like to thank you for the great hospitally and attention we had from you in our great stay in Paris, at Luxembourg Parc Hotel.", "title": "A dream!", "helpfulness": 1, "user": "Feedyoursoul_35", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138782186}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We would like to thank in a very kind way Jules for the great company you were specially in the night we were celebrating our Paris Semi Marathon run. We hope we can meet again for such a nice conversation as we had that night. And Cecilia, not only for helpíng us as a brasilian girl but also for how nice you were all the time. It was a great pleasure to meet you all.", "title": "Best place to stay in Paris!!", "user": "HeatherMcMahon", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138777435}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Wish you all the best.", "title": "Excellent Boutique Hotel in a Great Location! Get the real Paris experience away from the chain hotels.", "helpfulness": 3, "user": "IzzyEdmonton", "date": "August 27, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 138563959}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My husband and I stayed here for our second time in early July and we loved it just as much as the last time. The location is amazing if you want to be in a quiet area yet be able to walk to the main sites. From here we walked to Notre Dame (about 20 minutes). We even walked to Saint Sulpice for mass one Sunday morning and that was a beautiful experience because just after the mass, the organ player plays for a good 20 minutes after!!! What sound! There is an outstanding restaurant nearby called La Maison Du Jardin only 5 minutes away walking. As for the hotel, we just loved our room. I believe it was room 35 and it was huge with high ceilings with a nice view of Luxembourg Park. I love shopping and from here, I was able to easily walk to Rue Saint Michel for great shopping at middle end stores. Nearby, there are lots of cafes where you can have a coffee. The hotel made all of our dinner reservations.The rooms were spotless with nice products. We love this place so much that we are going back again to celebrate a milestone Birthday. I highly recommend this place.", "title": "Wonderful stay - great location, warm and helpful staff", "helpfulness": 4, "user": "JerryHBoston", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138464377}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "The is not an all dancing, all singing, baton wielding hotel. It is small, comfortable, efficient, and possesses extremely pleasant and helpful staff. The rooms are a good size, for Paris, well and appropriately furnished. The common areas are small, but extremely comfortable and useable. There is little in the way of view from any window, but that little view is pleasant. The hotel is out of the way enough to be quiet, yet within walking distance of the river. We walked happily to the Bastile and the Musee D'Orsay. The park opposite should not be missed. We took two rooms lately, and have stayed in three of their rooms over the past year, all were delightful, although one of the bathrooms could do with some additional maintainance. Breakfast is basic, but good, with the best orange juice. This hotel is unlikely to appeal to those who like Hiltons, room service (which they do not do) or uniformity. I'll be back.", "title": "Cosy, Lovely, Efficient", "helpfulness": 1, "user": "Capetian", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19583131, "likes": {"liked": "— quiet", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My wife and I stayed at the Hotel Lumembourg Parc from August 4th through the 9th. I chose the hotel due to the extremely high ratings on Tripadvisor. The hotel definitely lived up to it's number one rating. This was our second trip to Paris and third trip to France.", "title": "Perfect", "helpfulness": 3, "user": "SoftwareTraveler", "date": "August 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18964533, "likes": {"liked": "— Elegant and well appointed", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We arrived in the morning after our overnight flight. The staff was extremely friendly and quickly checked us in. Overall the building was very nice. This is a small but very elegant hotel with traditional decor. The lobby has a well stocked bar with a Espresso machine. The elevator is a glass enclosed lift that overlooks a small welcoming courtyard with a small fountain.", "title": "Perfect", "helpfulness": 4, "user": "SoftwareTraveler", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18873097, "likes": {"liked": "— Elegant and well appointed", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We booked a standard room. Typically we book superior or deluxe rooms, but we figured most of our time would be outdoors. I believe the Hotel Luxembourg Parc does have larger rooms available compared to what we chose.", "title": "Spot on", "helpfulness": 1, "user": "SwodRam", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 18642970}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The standard room is an expectedly small Parisian room, but very well furnished and comfortable room. The bathroom was well appointed with marble and modern fixtures. This particular room had two twin beds together side by side. They were a bit firm for our taste, but still comfortable. There were plenty of pillows, room to stow luggage, and even a small welcome gift. The hotel is amazingly clean.", "title": "Wonderful FInd", "helpfulness": 3, "user": "NYCityRes", "date": "July 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17807250, "likes": {"liked": "— Service/staff, wonderful boutiquey feel, library"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "My teenage daughter and I stayed here for four nights mid- October and were delighted with our choice to stay here (based on tripadvisor reviews). We were warmly welcomed by Zina who continued to be a great help on a number of occasions. She, as well as other staff members, were more than happy to assist with travel plans, reservations and directions during our stay. They would cheerfully greet us coming and going and were genuinely interested in our excurssions. Also, the cleaning staff were most pleasant and made the effort to converse.", "title": "Charming Stay at Hotel Luxembourg Parc", "user": "TrixieG", "date": "October 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21322642, "likes": {"liked": "— It is quaint, very clean and the location is wonderful!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The hotel is meticulously clean and tastefully decorated with warmth and comfort. We had a corner room and it was very light and charming. The marble bathroom was large and bright with lovely products. My daughter and I had hot chocolate one night in the library and it was very cosy. In the breakfast room, I appreciated the availability of lattes, fresh orange juice etc with our breakfast. We particularly enjoyed the pain au chocolats , fresh buns and croissants and cheeses - the fruit salad was also very fresh and tasty.", "title": "Our honeymoon stay", "helpfulness": 3, "user": "TChase", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 21110603, "likes": {"liked": "— Location and Laurent the bartender", "disliked": "— Small room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The location is indeed stellar and extremely conducive for those of us who prefer to explore on foot. You will discover the Sorbonne, the Pantheon, Notre Dame and St. Sulpice practically on your doorstep. However the Metro and RER were also close by allowing quick access to the Eiffel Tower and further afield. (A note of warning, deciding to get to Versaille ourselves, we were informed by the ticket seller only after we purchased RER train tickets from her for Versaille that the train line was out of service that day. Thus began a 2 hour confusing trek to get there with the Metro and other trains. This is not uncommon for train lines to be out of service so make sure before purchasing at the station or splurge for the hotel's package). There were many choices of restaurants nearby. Intimate Boutique shopping is close in St. Germain as are the more 'common' stores along St. Michel Blvd.", "title": "Hotel Luxembourg Parc--not quite what expected", "helpfulness": 3, "user": "MaryPasadena", "date": "October 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 21077580, "likes": {"liked": "— location", "disliked": "— room category received at check-in"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We had a lovely stay and would highly recommend staying here.", "title": "Fabulous Boutique Hotel", "user": "Travel_Snob78", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21035029, "likes": {"liked": "— location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I just spent 4 wonderful honeymoon nights in Paris at this lovely hotel. The employees at the front desk were very nice and super helpful with all of our needs. Our room was small but very clean, and this hotel is in a great location. Grab a coffee and take a walk through the park across the street. PLEASE visit Laurent, he tends bar and is only more than happy to suggest a great cafe, restaurant or jazz club. He was such a great man to talk to. We thoroughly enjoyed his company over a glass of wine each evening and I hope you will too! The breakfast was included in our rate but if we had been paying for it, I would have opted to go elsewhere. It's fine, just very simple for the money.", "title": "Absolutely charming hotel", "helpfulness": 1, "user": "SiandMike", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21002046, "likes": {"liked": "— Location and service", "disliked": "— Cant think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Sorry That it took me so long to write this review.", "title": "Absolutely Incredible..", "helpfulness": 1, "user": "higginsthewonderdog", "date": "July 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115647188}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My wife and I visited in April. Quite Honestly, Hotel Luxembourg Parc was one of the reasons we had such an incredible time. The Hotel is in a great location, our room was large comfortable and the staff was superb. There are just not enough superlatives to describe how much we enjoyed our stay.", "title": "Terrific", "helpfulness": 1, "user": "Alexander041", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115453780}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "By the way, it seems as if all of Paris is within walking distance and that the Hotel Staff knows everyone in the City.", "title": "Wonderful hotel with pleasant staff and lovely room.", "user": "JoDD45", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115367813}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We spent 3 nights at the Luxembourg Parc, he room was large and comfortable and the marble bathroom was luxurious. The hotel was very quiet and the staff most helpful, friendly and discreet. Location is terrific, one and half blocks from Boulevard Ste. Germaine, two from Rue de Rennes and three from Boulevard St. Michel.", "title": "Beautiful boutique hotel in a great location", "user": "CT-Travelers08663", "date": "July 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115318537}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed here for our 10th wedding anniversary. We informed the hotel of this in advance and they upgraded our room. The room we were given was spacious and beautifully furnished with excellent facilities (two televisions, stereo, ample space for clothing, marble bathroom with large corner bath, double sinks and enormous shower).", "title": "Believe the Hype, charming hotel in great location", "helpfulness": 4, "user": "MissMinivan22", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115204477}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We stayed at Hotel Luxembourg Parc Oct. 31-Nov. 7, 2008, and were most impressed with the accommodations and with the staff. Our room wasn't ready when we arrived, so Fabienne (at reception) served us delicious breads and coffee in the library. Her thoughtfulness was the norm for all members of the staff during our stay; in fact, we have never experienced such at any other hotel. They even allowed my husband to use the computer behind the desk to check e-mail several times while the computer (free) in the library was down.", "title": "Lovely Hotel", "helpfulness": 3, "user": "r0ckhill", "date": "November 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21978302, "likes": {"liked": "— Everything!", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Our room (executive--#31) was lovely; the linens were luxurious;", "title": "Lovely Hotel and Can't Beat the Location", "helpfulness": 2, "user": "ronToronto", "date": "November 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21914058, "likes": {"liked": "— price and location", "disliked": "— no criticisms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "the bathroom was spotless with plenty of room for our toiletries. There was also plenty of closet and cupboard space for our clothes.", "title": "Great Location, Helpful Staff, You get what you pay for!!", "helpfulness": 2, "user": "Chazoo", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21837700, "likes": {"liked": "— Location", "disliked": "— No room service - although they are looking to have this!!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The lobby is small but beautifully decorated. The breakfast room is also small, but we never had trouble getting a table. The breakfast came with our room (we booked directly with the hotel's own website), so we ate there each morning and enjoyed both the ambiance and the servers who were quite busy but also accommodating.", "title": "Perfect Paris Boutique Hotel", "helpfulness": 2, "user": "Luv2TravelNJ15", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21709479, "likes": {"liked": "— Room and location", "disliked": "— Dinner recommendations by front desk."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The \"library\" is a small, beautiful room off the lobby. We enjoyed a glass of wine in front of the fireplace most nights. That was a delightful way to end the day.", "title": "Excellent boutique hotel - 4 1/2 stars", "helpfulness": 7, "user": "Michael01UK", "date": "November 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21545122, "likes": {"liked": "— The hotel service and sitting rooms", "disliked": "— Breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Saw the very good reviews. Well we spent our time there. Very good base to visit Paris (metro is pretty near). Paris is beautiful just a bit.. too cold.", "title": "Enchanté", "helpfulness": 8, "user": "DallasRod", "date": "November 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10964468}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Luxembourg parc has a very helpful staff and the hotel itself is very nice. We were pretty lucky with our room. A couple we met there wasn't like that. We had those napoleon decors and that make it really special. Our time there was just great. Paris is really an amazing city. Need to speak some French. Fortunateòy we had some word. Anyway that is an extraordinary city. Much romance.. we'll surely be back.", "title": "Very comfortable and charming", "helpfulness": 1, "user": "alfnat", "date": "November 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10913365, "likes": {"liked": "— Location and room", "disliked": "— Breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Good friendly service, excellent location.", "title": "We Loved The Luxembourg Parc", "helpfulness": 8, "user": "bjtheyankeesfan", "date": "November 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 10832739, "likes": {"liked": "— Achitecture, Parisienne look, location, small, quiet", "disliked": "— Location - would have liked it closer to the Metro"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My husband said it took me longer to chose a hotel in Paris from various websites and guidebooks than it did to buy our condo in Boston! But my 'shopping' paid off - the Hotel Luxembourg Parc was wonderful. From everything I'd read about Parisienne hotels rooms are small - ours was not - it was charming. The bathroom was very clean and lovely in white marble with a fabulous deep tub and large overhead hot-hot shower, big white towels; the combination of the building's original heavy overhead beams made it architecturally dramatic. The front desk personnel were helpful and all spoke English. On a rainy Sunday afternoon after spending the morning at the Louvre and walking Paris all day we ate a romantic late lunch of lapsong suchong tea and crepes on Ile Ste Louis, we bought a bottle of wine and cheese on our way back to the hotel - the front desk made a blazing fire in the fireplace in the library, brought us some crusty rolls from the kitchen and we enjoyed a momentary fantasy of living in Paris - it was the perfect day - the perfect hotel.", "title": "Superb Paris hotel", "helpfulness": 6, "user": "Sarah_MattWales", "date": "November 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10797785, "likes": {"liked": "— Cleanliness and location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Wonderful, clean hotel with very friendly staff. The staff were excellent and were there to welcome us when we checked in at 4 in the morning ! The hotel was absolutely spotless, the room we had was huge, with a lovely view onto the luxembourg museum. The breakfast was substantial and set us up for the day. The staff spoke english but also allowed us to try our French. There was a very nice bar where you could have a pre or post dinner drink.", "title": "Best location in all of Paris; beautiful Hotel", "helpfulness": 6, "user": "lashero", "date": "November 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10710116, "likes": {"liked": "— EVERYTHING - location; well decorated; wonderful staff.", "disliked": "— No complaints."}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "variance": {"poor": 5, "average": 20, "very good": 129, "terrible": 3, "excellent": 611}, "aka": "Luxembourg Parc Hotel", "slim_ranking": 0.00278862242052, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}