{"user_rating": 4.5, "review_count": 85, "name": "Hotel Regia Ristorante", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The Hotel Regia is situated next to the beautiful cathedral in Trani with views out to sea. Our room at 140 euros per night had 2 windows and a balcony so that you could take advantage of the lovely views. The room was large and furnished nicely, ditto the bathroom. Pleasant staff who attended to your needs. Bed was large and too firm for me - but others may be OK with that. Car parking is tricky in Trani old town so the parking at The Regia was very welcome - a sat nav is useful in locating the hotel. Trani and Hotel Regia both highly recommended.", "title": "Lovely hotel perfectly situated", "helpfulness": 2, "user": "White-family", "date": "October 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21068408}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We stayed in Trani overnight last year, at another hotel, but when I saw this one I fell in love with it. So when we found ourselves able to re-visit Trani for 2 nights last month, the Regia was the only place to stay- though it's pricier than other hotels in Trani. Its great attraction is its location- the only commercial property in the Cathedral square, overlooking the lovely white cathedral and the deep blue of the Adriatic. Just round the corner is the harbour, with lots of lively restaurants and bars, but the square itself is very quiet, once the children playing ball against the Cathedral walls have gone to bed. The hotel is a small 18c palazzo, but inside it is remodelled in a light, airy, modern style. We didn't get a chance to eat in the hotel restaurant, but breakfast on the terrace was fine, (so long as you only want a typical continental breakfast). Staff very pleasant; like most staff in Puglia not much English is spoken. Trani old town is lovely, and the cathedral (actually 2 churches, one on top of the other) is very interesting as well as lovely. A great long day trip is out to the Gargano peninsula, quite unlike the rest of Puglia.", "title": "A truly beautiful place to stay", "helpfulness": 2, "user": "Shawpathways", "date": "July 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17615615, "likes": {"liked": "— Its great location", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Perfection on the Adriatic Sea", "text": "Just returned from Puglia and had 2 nights at the Hotel Regia. A lovely hotel with perfect views of the Adriatic Sea. High ceilings, large rooms, an elevator, nice bathrooms and internet access. Nice breakfast in the cafe or on the sidewalk outside overlooking the water. Don't miss walking along the water and checking out the catch of the day being sold - you may have it for dinner that night. We dined at the Hotel Regia one night and the food was good and representative of the area. The church just in front of the hotel is spectacular and very different. Be sure and have a drink or gelato at one of the restaurants overlooking the wharf. Great people and dog and cat watching.", "helpfulness": 2, "user": "bettyh", "date": "May 16, 2008", "id": 16088018}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We took a chance on this little gem, only hearing about it (and the town for that matter!) in a blog from someone's travels and pictures but it looked really great and it was. This small hotel is perfectly situated on a picture perfect piazza in front of the town's cathedral. Behind that is the Adriatic Coast. All of which make up your room's view at this hotel. Some rooms also look out onto the nice fishing harbor and you can watch the boats come in with their catch in the morning. Our room was large with a large window and walkout balcony. It had a big roomy bathroom. Plain but nice enough furniture. The breakfast had gorgeous fresh fruit . The staff was very nice They even helped call the airlines for 3 days to find our luggage. Very helpful. But did not know much English. For us it was not an issue, as I speak decent Italian but in Puglia knowing some Italian really helps! Trani has a fabulous medival town center centered around a fishing port. We fell in love and can't wait to return.", "title": "Room with a duomo ,perfection!", "helpfulness": 2, "user": "TravelerwannabeIT", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 15998345, "likes": {"liked": "— location", "disliked": "— older furniture"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "As part of a 12 day trip in Puglia, we booked the Riva del Sole in Giovinazzo. It was such a disappointment, we checked out after one long night and made reservations at the Regia for the final two nights of our holiday. The Regia is completely charming, located across from the incredible Duomo in Trani. The rooms are simply furnished but spacious with high ceilings and roomy, handsomely tiled bathrooms. If Room 30 is available, it is especially large and has the best views of the cathedrale and the sea. The staff doesn't speak much English, but they are all sweet and helpful, moving your car if necessary, and they also decided to move us from a perfectly acceptable room to an even nicer one when it became available the second night. Breakfast is included and while it's just like breakfast in most Italian hotels, it is served in the light-filled hotel cafe. Take the hotel's recommendations for dining. They suggested Corteinfiore, which is a short walk away, and we had a most amazing lunch there. Don't let the ugly apartment blocks that surround the village keep you away. Trani is well worth visiting and the Hotel Regia is the ideal place from which to begin your explorations.", "title": "What a Gem", "helpfulness": 2, "user": "Cholmley", "date": "May 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15831052, "likes": {"liked": "— location", "disliked": "— The pillows were a bit hard"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Fantastic location (experience it at sunset: it's unbeatable), beautiful palace with impeccable - if not soulful - rooms (the whole hotel seems to have been renovated recently), friendly staff, excellent value for money (I stayed there during the week after Easter and paid 130 € per night for a double room with breakfast).", "title": "Excellent", "helpfulness": 2, "user": "StefanoBruxelles", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36113491}, {"rating": 3.0, "stay_parameters": "Stayed June 2009", "text": "Hotel Regia deserves each one of its four stars, with change to spare.", "title": "lacks charm, but location superb", "helpfulness": 1, "user": "lambs_ear", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 32888352}, {"rating": 3.0, "stay_parameters": "Stayed June 2009", "text": "The Hotel Regia would appear to have had a recent makeover and in my opinion now lacks any charm and character it might once have had. However, it's in a beautiful location between the huge cathedral and the pretty port. The terrace overlooks the sea and two large canopies keep it shady and cool for eating and drinking. The staff were helpful and friendly and spoke a little English. It's a good, functional base for exploring the lovely town of Trani. Don't miss the passeggiata around the port on a Saturday night. And if you feel like splashing out, the Osteria La Banchina restaurant on the sea front, serves superb seafood caught that morning.", "title": "Enjoyed Trani", "user": "polarbear234", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 32622428}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Just returned from Italy, final stay was in Trani at the Regia Hotel. It by looking at other photos has had a refurbishment. The rooms were modern with light wood and stainless steel fittings, little of the it could be anywhere feel. But that did not matter becaue I had room 26 overlooking the sea and the view was wonderful. The hotel itself was very quiet, breakfast wsa either in the cafe or outside on the patio. these to seemed different form other photos so have added a couple. There isn't a yes/no to recommending it to a friend as it depends on personal taste.", "title": "great location, great staff", "user": "sscc0404", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31465532}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I visited Matera with my 5 years old daughter and we took the Regia after having read Tripadvisor's reviews. The hotel met our expectation.", "title": "Enzo saved our trip", "helpfulness": 4, "user": "Tom10", "date": "November 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22080638, "likes": {"liked": "— The staff and the views"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This old Palazzo is across from the Duomo on Piazza del Duomo, which is spectacularly situated overlooking the sea. The piazza, the streets, the whole town is made from a lovely beige stone. We had a view of the sea from our hotel room that I will never forget. The staff was very friendly. Dinner at the restaurant was good (they are drowning in fresh fish in this town) and the waitress was absolutely wonderful! Trani is small and it's lovely to walk by the sea and watch the fishermen unload, or stroll the streets of the old town. From the hotel, it's a very short walk either into the old town or down to the port and the Piazza del Duomo has a beautiful promenade on the sea.", "title": "Spectacular Position", "helpfulness": 1, "user": "GoGirlToo", "date": "May 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130192308}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed for one night on 29 April. This hotel is in an old Palazzo with a completely modern interior. It is in the most wonderful location right next to the Cathedral and overlookng the outer harbour of the port. Despite being so central and despite a music festival around the corner, it was very very quiet (because of the direction in which it faces and the lack of direct traffic passing). Just beautiful and wonderful for wandering around the old town and sights. Being Sunday night, the restaurant was not supposed to be open - but they had a group dining and immediately invited us to dine there when I enquired about local restaurants nearby as we were very tired. The meal was lovely and the staff were simply lovely. Very kind and friendly. The breakfast was also good and the room very comfortable - with a view right out to sea!! A lovely spot for our first night in Puglia!", "title": "What a spot!", "helpfulness": 1, "user": "BroughtonBelle", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129860792}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Great location, great room, great staff - really good value, I would say. We were given a room that clearly had been occupied by a heavy smoker the night before, but when asked the staff kindly moved us to a different (and much nicer) room.", "title": "Super hotel in beautiful Trani", "user": "Soren95", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129226117}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed 1 night in this small hotel which overlooked the Piazza, Castel and Duomo and the sea. Our room had been renovated with modern, blond wood which offered a stark contrast to the building. The room was clean, comfortable and the ammenities were fine. The views were spectacular. The staff was helpfull. Breakfeast was good.", "title": "Great Hotel and Location", "helpfulness": 2, "user": "Montclairite", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 113532775}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Parking is free but in a public area at least 100 meters from the hotel. The location of the hotel is in a \"protected area\" and car access is at times prevented by automated stantions. The access is controlled by the local military so you need to be patient until you get some one to open up in order to drive to the door to drop off or gather luggage.", "title": "Can't wait to return", "helpfulness": 2, "user": "mamalumpy", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64427275}], "location": {"country": "Italy", "region": "Puglia", "continent": "Europe"}, "variance": {"poor": 1, "average": 6, "very good": 29, "terrible": 4, "excellent": 45}, "aka": "Regia Hotel Trani", "slim_ranking": 0.285714285714}