{"user_rating": 4.5, "review_count": 2618, "name": "Hotel Riu Palace Mexico", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Rui Mexicao was an upscaled very elegant hotel. We had a wonderful time. Six apple rating is accurate for this hotel.", "title": "Elegant", "helpfulness": 1, "user": "DebbieOwingsMillMD", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16547967, "likes": {"liked": "— Elegant hotel, unbelievable staff, relaxing", "disliked": "— Shows, more activities needed"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I am going to be as honest as I can in my description.", "title": "It started out rough but got better!", "user": "ChicagoSheryl", "date": "May 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 16538566, "likes": {"liked": "— Great service and food", "disliked": "— Smelly and uncomfortable room"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Food: Very good. They have to also include food that Europeans enjoy too so you see a lot of sliced meats and some odd food that we aren't used to. They had pretty much something for everyone. The only negative was the getting the reservations to the speciality restaurants. They gave out numbers starting at 8 am and started the process of booking times at 8:30 every morning . It wasn't a problem for us because we were up early, but could be a problem for those who like to sleep late. If you missed out on the restaurants the buffet was extremely good. A nice lady working the omlette station even went out of her way to go and get spinach for my omlette which I thought was great service. So much food you will not go hungry. Men do have to wear long pants for dinner, even in the buffet. Speciality restaurants good, we enjoyed all four of them.", "title": "Excellente", "user": "EdLNebraska", "date": "May 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16510070}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Hotel and Grounds: Beautiful. The hotel was extremely clean and lovely. You always seen people cleaning and working on the upkeep. Very upscaled and classy.", "title": "Third Trip to the Riu Palace Mexico", "user": "krijowri", "date": "May 28, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16472225, "likes": {"liked": "— Beautiful resort, fantastic food, unbelievable service!", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Room: Wonderful. Large room with a self serving bar in the closet with a fridge in a closet. The best thing was the air pressure gauge on all the doors. It kept the doors from slamming when the guest came in late or up early. This was a real plus in my book after staying at other hotels and being awakening all hours of the night. The only negative was there were a few days when the staff were talking louder in the halls early in the monring. The room cleaning staff were great.", "title": "Wonderful Honeymoon!", "user": "ChristySullivan", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16468842, "likes": {"liked": "— The service", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed at the RIu Palace Mexico from November 12-19th 2011. When we arrived at the resort we were welcomed with a delicious drink while we were checking in...which went smoothly. We received our room key and towel cards and were told exactly where our rooms were. (We were a group of four). We had rooms 1097 and 1103 which were on the same level as the lobby just past where the outdoor courtyard is (they were both facing the back of the resort towards Cancun, but the nice thing was it was quiet with no one being able to see into your room). Location was perfect for us.", "title": "Amazing service......amazing resort!!!!", "helpfulness": 10, "user": "Loonychick", "date": "November 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121091116}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I will say too that there is a musty smell in the lobby as others have said, so I was expecting it, but honestly that smell was limited to the lobby area and you did tend to get used to it. Definately didn't ruin the vacation by any means. We were welcomed with a cute towel animal and flowers on our bed...usually every day we got something new. It was always cool to see what they would leave for us each day. The room was immaculate and a great size. We are used to a king size bed at home but my husband joked that he had to text me to see if I was up in the morning. This bed is huge, and although being pretty firm...we both slept well. No complaints there at all.", "title": "Average... nothing special.", "helpfulness": 3, "user": "MexicoLuvinHillbilly", "date": "November 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 121058618}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "The grounds are kept immaculate as well. I would get up every morning around 6:30 to take pictures and there were alot of staff out and about cleaning and literally scrubbing the walkways, railings etc. The beach is absolutely stunning! It is huge and the vast amount of palm trees was really nice. We took advantage of the hammocks one day and had a siesta on the beach...who wouldn't enjoy that?", "title": "No better place to fall in love again or begin your lives together.", "helpfulness": 3, "user": "RandyHazaert", "date": "November 24, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 121003074}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The service is bar none, the best service we have ever received at any all inclusive we have ever gone to. They wouldn't even let our coasters get wet without coming around and changing them for us. They would come and ask if we wanted another drink if we were only 1/3 done...so you're glass is literally never empty. And I am a sucker for a nice tropical drink in the proper glass and they did not dissappoint in the lobby bar. Always with a piece of fruit in it too. Just a personal preference but I enjoyed it. Everyone there from the cleaning staff, to the groundskeepers, to the waiters and waitresses to the people at the front desk and the front door were always smiling and extremely friendly. And I have read some comments from people that the staff are always looking for tips. I found the opposite to be true. We tend to tip for every round of drinks because, lets face it they all work so hard there so that WE can have a great time. We found that sometimes we would try to give some waiters a tip and they would almost run off like they didn't want the tip. We certainly never felt like it was expected but with the amazing service that we received how could you not tip? Everyone was always saying Hola and have a nice day. I was amazed at how many staff members speak extremely good english at this resort...but I also enjoyed trying to speak spanish.", "title": "Wonderful Hotel", "user": "sedonico", "date": "November 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120966368}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Also wanted to mention that we didn't find the pool was cold as some have stated. We were actually quite happy with the temperature. On the beach it was a nice touch when the waiters would come by with a tray of assorted drinks and ask if you would like to try one. Once again service was amazing. We didn't even pull out our insulated drink cups the whole time we were there because our drinks were replenished so quickly.", "title": "\"Fantastic staff, handy location\"", "helpfulness": 3, "user": "Dewclaw34", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120930274}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Travel dates 11/5 – 11/12. We arrived at the Cancun airport early in the morning, briefly waited for our transportation and arrived at the RIU Mexico Palace around 10:00 a.m. Our bags were taken by a very friendly staff member with a big smile who took us to the front desk. The lobby was quite impressive and clean. We were told by the man at the front desk that our room would not be ready until 3:00 p.m. He informed us that we would have room #52. After reading prior reviews, I asked if we could have the 2nd or 3rd floor. He didn’t seem too happy but said he would see what he could do. We were directed to a changing room where we could change clothes and begin to enjoy the amenities. We were not greeting with a ‘welcome drink’ as some other guests described in their reviews. I actually thought the man at the front desk was cold and impersonal.", "title": "Great service", "helpfulness": 2, "user": "ltritz", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120786393}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "After hanging out at the beach we decided to check back in at the front desk around 1:00 p.m. and at the slight chance our room would be ready. We were then told that ‘we were one of the lucky ones’ and that our room was ready. We were taken to room #1143 on the 2nd floor. We were given two keys, so I’m not sure why other reviews mentioned they only got one. The room is average, but clean. Toiletries were supplied, stocked mini bar (Vodka, Run, Tequila, Scotch, water, soda and beer). The bed was 2 doubles pushed together but it wasn’t an issue. There was a balcony, but unfortunately we had a high wall and if you were sitting in the chairs, you could not see over it and enjoy the courtyard view. Towels were always provided as well as the restocking of the mini bar. We always left a couple dollars for house keeping, since they always did a good job. A couple of ‘towel animals’ were left for us which was a nice little surprise. We did not experience a nightly turn down service. It is a little noisy. The folks upstairs got up between 6:00 a.m. and 6:30 a.m. everyday and it sounded like they were tap dancing and rolling marbles on the floor. We were actually told by a visiting travel agent that we were on the ‘renovated side’, which if facing the beach, is on the left. To be honest I wouldn’t have wanted to stay on the ‘un-renovated side’.", "title": "The Service is What Makes This Place Stand Out", "helpfulness": 6, "user": "ChicagoSlim", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120718654}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Beach is beautiful and clean. Clear turquoise water, small waves not enough to knock you down. Plenty of chairs and palm trees, you don’t have to be there at 8:00 a.m. to get a spot. The pool was ice cold. Chairs around the pool seem to go quickly. Not sure why since hardly anyone was in the water. We are beach people, so we didn’t spend much time at the pool. There is a bar for the pool and one for the beach. They also come around and serve drinks to you at both.", "title": "A terrific stay.", "helpfulness": 6, "user": "Traveler6011", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120602379}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The playmakers would come around and announce what was going on, so you had the option to join in or not. The same time every day, was the same activity. There was volleyball, bocce ball, darts, dancing, bingo, water aerobics and rifle shooting. There is an activity listing at the desk/both where the towels are given out. We noticed that on Thursday’s, there is a kitchen tour. This was pretty interesting to see the ‘behind the scene’s’. You are given 2 towel cards (per couple) for 2 towels. If you want more, sorry. But they always had fresh towels available for exchange. The fitness center is small a couple treadmills, elliptical, bikes, stair climber and some weights. Some days it was crowded and others I was the only one in there. We tried getting a kayak one afternoon, but it was an hour wait. It didn’t seem like they had too many water sports equipment available.", "title": "Don't believe that this resort is anything but amazing", "helpfulness": 7, "user": "bennuk85", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120569746}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I must say that the service was very good. Everyone (with the exception of the guy checking us in) was very professional starting at the top all the way down to the landscapers. Everyone seemed to be happy to be there and willing to help with whatever you needed. Everywhere you looked someone was cleaning something. A huge difference from some of the other islands I have been to. Yamir was very helpful with the restaurants reservations, along with restaurant service itself.", "title": "Beautiful Resort; Great Location", "helpfulness": 3, "user": "By the beach", "date": "November 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 120552837}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Just returned from Riu Palace Mexico, after an enjoyable stay. From checkin to checkout, every staff member was very pleasant. The grounds are spectacular and the lobby has a certain charm. The rooms, as others have mentioned, are a bit dated in décor but very spacious and clean. Yes, it is certainly hot and humid on the Yucatan peninsula, but I'm not sure what others expected. The food was adequate, though hardly spectacular. Indeed, the steakhouse was worse than the buffet. The only exceptional dining experience was Sir Edward. Pool could have used a bit more maintenance - surface residue always visible and the floor and swim-up stools were disturbingly slippery (all presumably from sunscreen, etc), so a good scrub wouldn't go amiss. The beach area was very spacious with plenty of chairs. Service was extremely attentive. Drinks were a bit watered down, most evident when a martini was ordered. All in all, a good time with only minor reservations.", "title": "pleasant stay", "helpfulness": 1, "user": "PlanoTripper", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16439650, "likes": {"liked": "— staff, grounds", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "This hotel is beautiful! All of the staff are very attentive and hard working. They were extremely friendly and defintely made you feel welcome. The food is delicious! The only thing I thought was a little lacking was the entertainment and nightlife at the resort, but I guess it is geared to an older crowd because that is what a large portion of the guest population appeared to be. I have stayed at a RIU in Jamaica and this one blew it away. I would definitely recommend it if you are looking for a wonderful relaxing getaway. By the way, I am an American, so I guess you can't really stereotype an entire population of people.", "title": "Wonderful Vacation!", "helpfulness": 4, "user": "phree82", "date": "May 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16384523, "likes": {"liked": "— Everything!"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I normally don't complain about things but this time I am. We were tired and hungry by the time we reached the resort, there was no type of service at all, when we checked in the person at the counter tried to over charge us by $300.00. Even though he had just made a copy of our confirmation telling him how much we booked the room for, I was livid! We finally got to our room which was nice, just as the picture showed and we ran down to eat because at this point I was getting angry i was so hungry. We were told we could not come in because my husband had to be wearing pants! HELLO its Mexico not only did we come for vacation but its freaking hott! So we walked ALL the way back to our room so he could change and returned. The food was very good, nice selection but I had to ask for drinks because no one was paying any attention to us. The next morning we walked ALL the way out to the pool and when we asked for towels we were told we should have been given a card at the front desk for each towel. We had to walk ALL the way back to get this and by this time we were sweating our butts off! It got better after that but the first few days were rocky. We usually go to Cancun which is very close to the airport and the customer service was immaculate so I was comparing my experience there to this one and it was a little disappointing.", "title": "It started out bad!", "helpfulness": 2, "user": "ABrignac", "date": "May 21, 2008", "detail_rating": {"front_desk": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 16281763, "likes": {"liked": "— The food, pool and the beach", "disliked": "— food"}}, {"rating": 5.0, "title": "Total Luxury... AMAZING!", "text": "I have just arrived back from Rui Palace and have had the holiday of my life! Please ignore the American reviews, they just love to complain... The same goes to the American guests, even the locals don't like them! If anything they put a dampner on my holiday as they just love to moan and bitch at the amazingly helpful and pleasant staff who will do anything for you. Lighten up folks!", "helpfulness": 6, "user": "itsjojo", "date": "May 20, 2008", "id": 16261343}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "On arrival to the hotel you are greeted with the most beautiful grand lobby complete with the biggest chandalier I have seen. The staff are so friendly and give you complementary drinks while they check you in. Then your bags are delivered to your room... and the rooms are great! Not the brightest rooms but everything you could want...2 double beds pushed together, a mini bar and optics which is restocked daily and a great bathroom with shower and bath. The room is tidied a couple of times a day and the even come in to check your air con and close your curtains. They even sorted out my makeup and would hang up my clothes for me! I put a few things in my safety box but I felt that I could leave anything out and it would be safe... and it was!", "title": "Never Again!!!!", "helpfulness": 2, "user": "jill0489", "date": "May 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 16206455, "likes": {"liked": "— Close to shopping area.", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "At the RPM service is the name of the game, best service I have ever had. Air conditioned lobby bar, great! As well as air conditioned buffet. Shade on beach as well as sun, and sunbeds are abundant. Maintenance & cleanliness can't be beat. All common restrooms spotless all the time. Mini bar in room with liquor, beer, soda, water. One important comment on the quality of guests; Booze is available everywhere and the waiter service to your chair or table is non-stop yet I did not see one sloppy drunk the whole week I was there. All liquor is top shelf and no drink is to fancy especially in the lobby bar. Our room was kept spotless, and the air conditioning kicked. All the food in the ala cartes or buffets were as good as you could ask for. In summary the RPM is a shining star and if you go there is much to appreciate.", "title": "Wonderful stay", "helpfulness": 5, "user": "tony838", "date": "June 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16718489, "likes": {"liked": "— Service", "disliked": "— Ala carte dinner reservation process"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Impossible to be disappointed.", "title": "Just Brilliant", "helpfulness": 5, "user": "shethinks", "date": "June 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16689324, "likes": {"liked": "— Everything, aboslutely everything"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I've been to Riu Palace Mexico last April and to be honest, I can't understand the ratings given by some people: either I am a very easy person to please or others are impossibly pleased, no matter where they stay.", "title": "Restored Opinion", "helpfulness": 4, "user": "dasmarian2", "date": "June 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16645181, "likes": {"liked": "— Beauty of the resort"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I've stayed at other Rius and the Palace makes all the difference:", "title": "Fabulous Getaway!", "helpfulness": 3, "user": "jtie55", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16581950, "likes": {"liked": "— Service", "disliked": "— Had to pay to use the internet (not that big of a deal)"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "-enormous rooms", "title": "Great trip to the Riu Palace Mexico May 2008", "helpfulness": 1, "user": "ksinkc", "date": "June 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16575009, "likes": {"liked": "— The quality of the rooms, complex and the dining experience", "disliked": "— The deterioration of the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Our family of 4 and friends(also family of 4) went for Christmas break. We've been to several Riu resorts in Los Cabos(Santa Fe), Punta Cana(Bamboo) and this was the best! We knew the resort was renovated in Dec. '12 & that is the reason we chose it. We love the style, like we are in Miami, South Beach. You can see from pics.", "title": "5 out of 5 overall!", "helpfulness": 4, "user": "toronegro63", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149516176}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Rooms - The rooms are modern, clean and spacious. Large shower, jacuzzi tub in middle of room (we liked it), Firm mattress. Sunken sitting room and large balcony. A/C and fridge works well.", "title": "Our little piece of heaven on earth <3", "helpfulness": 5, "user": "TrishandMassimo", "date": "January 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149514889}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Staff - Staff were friendly, accommodating, and always available. Alfredo at front desk is exceptional in service. We noticed the housekeeping were always supervised by manager and didn't have access to room by themselves. We think that is good for security. Always bring lots of $1 bills to reward good service and it is very much appreciated by staff and they treat you well. And they work hard.", "title": "Great way to ring in the New Year!", "helpfulness": 10, "user": "Brooke S", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149426294}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Grounds - grounds are kept clean although some palm trees were dying (guess from replanting?).", "title": "A RUInous Experience", "helpfulness": 11, "user": "Tedieboy", "date": "January 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 149419131}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Pools - are not very large, though there are 4 and it was cold. Pool bar and cafe has nice view of the ocean. No drunks at pool.", "title": "The staff make it!", "helpfulness": 2, "user": "DaveandClare", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149418017}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband and I just got back yesterday, May 18th, from five days at Riu Palace Mexico. We booked the 6 Apple Square Deat about one month ago. It was very nice: good service, nice rooms, pretty grounds, lovely beach (despite \"sand whales\").", "title": "Very Good Overall", "helpfulness": 5, "user": "eakNYC", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16202153, "likes": {"liked": "— Beach and hotel grounds", "disliked": "— quality of drinks/ bar service in general"}}, {"rating": 5.0, "title": "The Riu Palace Mexico was fantastic", "text": "We arrived with the intention of requesting and, if necessary, paying for an upgraded room. This resort has no ocean view rooms, however, and our reception agent really discouraged us from paying more for a courtyard (view of beautiful fountains) room over a garden (view of the next resort). We hemmed and hawed and he eventually gave us a courtyard room, which actually faced the pool and was as close to the beach as you could get, for no additional cost. We were very pleased with the location of our room.", "helpfulness": 3, "user": "PipeyMorden", "date": "May 17, 2008", "id": 16139183}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The beds were very hard as other reviewers have mentioned, but not worth fussing about. The room was spotless and a small leak from the a/c unit was fixed immediately. Housekeeping also responded immediately to our request for more towels.", "title": "Loved the food, but the room left room for improvement.", "helpfulness": 2, "user": "TanTexan", "date": "May 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 15994282, "likes": {"liked": "— The food was excellent!", "disliked": "— The room was lacking."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The food was very good in the buffet restaurant. Having been to \"a la carte\" restaurants at other AI's we opted to fore go the experience this time around. One nice touch was that regardless of the cuisine of the day, they always offered several delicious, authentic Mexican dishes, as well.", "title": "Loved the RIU Palace Mexico", "helpfulness": 1, "user": "earthangeluk", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 15993356, "likes": {"liked": "— Beautiful resort grounds", "disliked": "— Beds and linens"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "One negative was the quality of the drinks. It was virtually impossible to get a proper cocktail. Even when you ordered liquor straight up, it didn't seem quite right. Wine and beer with meals were fine, and this certainly wouldn't cause me NOT to recommend the place, however if you're a connoisseur, this shortcoming might matter to you.", "title": "Luxury and Service - a winning combination!", "helpfulness": 7, "user": "stripey2000", "date": "May 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15954414, "likes": {"liked": "— The outstanding service and attention to detail", "disliked": "— People who create a fuss and moan over the smallest things!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We returned from our Honeymoon in Mexico on Sunday and we had an amazing time in this hotel.", "title": "Fabulous Time! Ignore the bad reviews!", "helpfulness": 6, "user": "lolapops", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120897721}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We arrived on the wednesday and check in was quick and to the point, a welcome drink was given which was delicious! Staff on check in desk very courteous and answered all our questions.", "title": "Mostly good, a little bad", "helpfulness": 3, "user": "Alicia N", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 120887545}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The room we had was large and spacious - 2 queen size beds pushed together, a sitting area, bathroom and a large balcony. All very clean too, and the mini bar was a welcome addition. Our balcony overlooked the main courtyard area which was nice, and it was lovely to sit up there at night and listen to the band after the entertainment.", "title": "So so fantastic", "helpfulness": 2, "user": "MarkyboyRainworth", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120872685}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "The beach at the hotel is amazing! It was very clean, and plenty of shade provided by the trees. A waiter also came round with trays of various drinks so you didn't even need to get up off your sunbed, which was really nice! The sea is quite clear once you swam out a bit.", "title": "Fantastic service with the most perfect beach!", "helpfulness": 7, "user": "Melissa M", "date": "November 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 120827372}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The pool was not as big as I expected - this was a bit of a down point for us, and we quite like swimming around - it's set up in a odd way, it's kidney shaped, but cuts off in the middle and there is no slope to get it, just steps. One side where the pool bar is located it quite shallow and the other half is deeper for swimming. Again, plenty of sunbeds and waiter service.", "title": "Brilliant holiday again", "helpfulness": 4, "user": "michael p", "date": "November 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120795995}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Just got back to Denver late Jan 15th. We've been to Cancun/Playacar about 8 times over the past 15 years and have stayed at 3 Palace's, to include the one in Cabo and Las Animas in Cancun. This was the best Palace we've stayed at by far, followed by the one in Cancun, with Cabo a distant last. I could not agree more with illinifann's comments--it's as if I wrote them. We did find, however, that the buffet food was as good as if not better than the speciality restaurants. We also found the wait staff to be a bit better at Don Julian (buffet)--they really worked hard to ensure you had everything you desired in prompt fashion. The only complaint I would raise was the quality of the wine--poor compared to Las Animas but much better than Cabo's (worst wine we have had at any RIU). The hotel \"remodel\" was much better than expected given some of the comments posted late last year. Regarding in-room privacy--the shower has a large \"frosted\" European shower door--you can literally walk into it fully clothed, undress, shower, dry off, and then get dressed again, without fear of getting seen by anyone in the room--we Americans are really hung up about nudity but I fully appreciate the concern when there are children in the room. The dimensions of the shower surprised us as they are about 4 feet by 4 feet with recessed shelves holding clean towels or your clothes--they don't get wet unless you get carried away with the hand-held shower--I used the overhead shower option--fabulous--and we had lots of water pressure and hot water. Regarding some earlier comments about lack of lounge chairs on the beach--there were sufficient numbers when we were there. We visited the RIU Yucatan--we have stayed there 3 times previously--and all agreed that the relatively small price increase at the Palace was well worth it. (We had forgotten how large the Yucatan was compared to the Palace). One last note regarding transportation to/from the airport. This was the first time we arranged to pay for \"private transportation\" to the resort. We have not had much success with previous Apple trips getting us from the airport to the resort and back over our 8 trips--a \"milk-run\" of sorts (i.e., stopping at many resorts before arriving at our resort). It was not worth the extra $100. Another couple from Denver took the Apple shuttle and arrived 5 mins after we did. On the return trip their shuttle left 5 mins before our private van--same type of van, by the way--and arrived 15 mins before we did. It appears that they are using more small vans like they did in the 1990's rather the the very large buses they began using in the early 2000's.", "title": "Best RIU Palace we've been to", "helpfulness": 11, "user": "Irwin08", "date": "January 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149829314}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "In closing, this was our best RIU experience to date: Great staff, wonderful facilities (Gym has new equipment too), good food and spectacular weather (ave temp was 85 degrees F.). One last tip--if you can fly on Tuesdays--the package price was several hundred dollars cheaper--all airfare driven. Enjoy!", "title": "Great Resort", "helpfulness": 10, "user": "illinifann", "date": "January 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149735901}, {"rating": 4.0, "title": "Riu Palace Mexico", "text": "Just got back from Riu Palace Mexico. I've been coming to Cancun/Riviera Maya for many years and have stayed at an assortment of AI's. The newly remodelled Palace is a great resort, the best I've been to. The rooms are nice, large, modern...love the large shower. Of course the stocked mini-fridge is an added bonus.", "user": "kooku27", "date": "January 14, 2013", "id": 149626468}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The specialty restaurants were all good and the steak house was surprisingly good. I usually don't get a tasty steak in Mexico but the ribeye that I had was very tasty. The Japanese place was also good.", "title": "Renewed", "user": "familyhohoho", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 149619749}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The buffett was as good of a buffett as I have had in Mexico. Large selection and very tasty. In fact we strolled next door to the Riu Yucatan one day for lunch and were going to eat there but we noticed their buffett had about half the selection of the one at the Palace so we went back and ate at the Palace.", "title": "Remodeled and beautiful", "helpfulness": 11, "user": "Vicki C", "date": "January 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 149556827}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I stayed at the Riu Palace Mexico 11/12-11/19 2011. I had always wanted to try a RIU property. We've stayed at some of the other chains before and been quite happy. The service here is top notch they anticipate your next need even before you do!! I chose this because of the beach and was not disappointed, it is beautiful. The food was very good, no complaints. We ate at the buffet every night but one. The place is spotless I have never seen a place cleaned daily as thoroughly as they do. The staff there is wonderful. The only complaints I would have would be the beds they are not comfortable and they should invest in new ones. Also,you have a key to open your door instead of a card key and you kind of have to play around with it. Minor things in my opinion, go and have a great time. We would definitely return here.", "title": "Had a wonderful experience here", "helpfulness": 3, "user": "oceanlover59", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 121248533}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "This is our 8th all inclusive in 4 years........and this was the BEST resort we have stayed at by far!!! The Riu chain is just a step above to begin with but when you go to a Palace it is exactly what they say, a Palace. Everything from the grounds, to the food and especially the service.", "title": "Fabulous Palace !!", "helpfulness": 1, "user": "dallas-cheryl", "date": "November 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121246561}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The Area: First time to the Mayan, but have stayed at Cancun before....very close to the same. Lots to do, lots of excursions. Maybe the only slight downfall is it is more commercialized then say Cuba or Dominican. It just depends what you want. We like both....the exclusiveness and quietness of Cuba (where we have stayed), but appreciate all there is to do and see in the Cancun/Mayan area.", "title": "RPM November 16-24", "helpfulness": 8, "user": "Phantomjww", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 121214177}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We did Xel-Ha....excellent!! Not sure if I like it better then Xplor but they are 2 different kinds of parks. Xel-ha there is more to see and is more of an relaxing sight seeing park with different activities. Xplor is geared towards adventure. Both are excellent and well worth their money!", "title": "a wonderful trip, an amazing wedding", "helpfulness": 4, "user": "namenotavailable", "date": "November 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121213021}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Also did the Coba Ruins tour. Very good as well. Lots of interesting things there about the Mayan culture.", "title": "The most FANTASTIC Vacation", "helpfulness": 1, "user": "Stephanie S", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121156971}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "My family and I have been coming here for years with absolutely no intentions of ever staying anywhere else. This past year the resort went through a renovation so I can't speak for the modern new look, but is top notch in service, comfort and most importantly food! The beach is large and beautiful and the water is warm and clear. The staff bends over backwards to meet your every need and truly seem happy to be working there. The only disappointment we've noticed is that in leaving tips for the maids (not required but always nice) it appeared the cleaning supervisors were entering the rooms first and taking the tips before the cleaners even came in. We mentioned this to the front desk, and aren't sure if it was addressed, but started handing the tip directly to the young ladies cleaning our room. All in all, wonderful and will definitely return!", "title": "Fantastic!", "helpfulness": 8, "user": "Lynne R", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149360649}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Two families of four, with teenagers, stayed at Riu Mexico Dec. 27 through Jan. 1. After reading reviews of their remodel, we were a little cautious, but were pleasantly surprised upon arrival. I must say I missed the Spanish styled decor, but everything was fresh and clean and new and did not deter from our enjoyment of the resort. Our main complaint was with the layout of the room, with no division between the bath and the bedroom. Although not an issue for a couple, if our kids had been staying in the same room with us, it would have been \"awkward\". Also, when my early rising husband left me sleeping, he could not turn on a light!", "title": "Great trip!", "helpfulness": 9, "user": "GAgirl46", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149297820}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "With all of that said, we had an absolutely marvelous time. The food was tasty, both at the buffet and ala cartes. Service was impeccable and the staff helpful and fun. DiDi was so charming...our kids had so much fun with him. The pool was warm, and we never had problems finding chairs. We also sat on the beach which was shady and relaxing. We were so impressed with the New Year's Eve celebration which included a special buffet, live music outside, champagne and all the hats, whistles, etc. a celebrant could ask for. Even though the resort was full it never seemed crowded. We would definitely go back again. Thanks, Riu Mexico!", "title": "excellent christmas vacation", "helpfulness": 5, "user": "tom w", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149250288}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "Our family did spend christmas 2012 at the Riu Palace Mexico and had a wonderful time. It is surley a 5 star as thr improvements made at the hotel were excellent. The new pool areas and easy access to the beach were good for our family. Not only did we enjoy thye pools but some family took advantage of Scuba Diving as it was very convient. Others just enjoyed all the fun at the beach, as there was always things going on. We do plan to return.T Woodmansee and M Barbere faily", "title": "If its not broke dont fix it", "helpfulness": 14, "user": "karen_kershaw", "date": "January 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 149211135}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Spent a week in Mexico and had the oppertunity to use the facilities at the Palace as family were there. I have stayed there in the past and used to love the old spanish colonial charm of this resort. Its gone. The whole hotel is done in Pepto Bismal purple/pink,white and crome. The rooms have open bathrooms with a tub right next to the bed. I spent New Years there and they seemed to cater to younger people alone. Very disappointing. Never seen so many children at this once quiet resort. Service is slower than it used to be in the bar areas but still great in the restaurants. Just stunned that they have changed this once beautiful place into a cookie cutter resort. They would have been smart to give this place a small face lift and made it adult only as I know many people who return there again and again for its ambience and relaxing atmosphere.", "title": "Great time at the Riu Palace Mexico", "user": "susandron", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149207059}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Stayed in June 2012 for daughters after wedding celebrations so we organised our own blessing on the beach.", "title": "really ready for the planned refurb", "helpfulness": 1, "user": "MrT1610", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 149164516}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "had a good time overall despite quite a lot of heavy rain but this hotel is due a refurb at the end of 2012 and it's showing signs of needing. Staff as ever though were superb, never anything but smiley faces.", "title": "Not rooting for this Riu", "helpfulness": 3, "user": "sdfeldshon", "date": "January 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149133073}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "This is our 3rd or 4th Riu vacation at Playa del Carmen. It was OK but not great.", "title": "Excelent excelent excelent", "helpfulness": 10, "user": "G4A-SM", "date": "January 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 148941926}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Biggest disappointment was the specialty restaurants. Only japanese was worth the effort.", "title": "Great AI on a Beautiful Beach", "helpfulness": 13, "user": "ColumbiaMom", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148815427}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Steak at steakhouse was undersized and overdone. Mexican (I got the grouper) just OK.", "title": "Thoroughly Modern Riu!", "helpfulness": 25, "user": "IanandAnn1981", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148809412}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 93, "average": 172, "very good": 626, "terrible": 53, "excellent": 1674}, "aka": "Riu Palace Mexico", "slim_ranking": 0.163265306122, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "* Located on the Yucatan peninsula, 3 km / 1.9 miles from Playa del Carmen * Within the Playacar resort, along with the Riu Palace Riviera Maya, Riu Yucatan, Riu Playacar and the ClubHotel Riu Tequila hotels * 2-storey building * Surrounded by 20,000 m2 / 24,000 sq. yards of lush gardens * Located on the beach * Complimentary sun loungers on the beach * 200 m / 650 feet from Mexican Street * 55 km / 34 miles from Cancun Int???l. Airport * Credit cards accepted: Visa, MasterCard, Amex, Diners"}