{"user_rating": 4.0, "review_count": 165, "name": "Hotel Le Clement", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "Great location in the heart of St. Germain, one block from Odean Metro on St. Germain Blvd. and surrounded by nice restaurants and across the street from an upscale fruit and vegetable market. 2 blocks from great Rue Bucci and Rue du Seine. Had a triple which was very small, as is typical. Recommend a room overlooking street. No locks on bathroom doors. My problem with hotel is that there was major construction on first floor. No breakfast room, dust, construction all day long. They did not apologize for the inconvenience, and basically one just went right up to the room. Very disappointing. With that said, location is great and desk was polite. Quaint but simple. I would stay there again if there were no construction.", "title": "Great location", "helpfulness": 8, "user": "bayhomes", "date": "June 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3618197}, {"rating": 2.0, "title": "Clement- Under construction/no air cond", "text": "Just returned. The room we arranged by phone was not assigned and the hotel was full when we arrived. The 6th floor middle attic room is even smaller than most Paris hotels in this category, especially small with slanted ceiling. Did not have bed arrangement we discussed by phone, but good news is that only on the 6th floor can you personally control the A/C. The corner rooms on 6th floor were bigger. The person I talked to a week before about room config no longer worked there. She had committed to a room arrangement that didn't exist. We moved to Room 318( third floor corner), which was larger and what we requested, much newer bathroom, more light. However, A/C for all floors below 6th floor are controlled by main desk. A/C is turned on only if you call reception to ask. The A/C is a fan; it is NOT air conditioning. We stayed in several other rooms in France with A/C, so we know this hotel was not providing AC. Room 318 is next to supply room, and is noisy. The front rooms on the street are NOISY. Hotel lobby/breakfast area is under construction (hammering), as well as building nearby (major truck noise). In addition, this hotel is next door to free soup kitchen, so crowds show up early. The hotel is across from a shopping center with restaurants setting up tables early mid-day, and a prime location for 30+ motocycle parking. Hotel staff pleasant; probably a good rate for small, noisy location. Suggest checking out Hotel Bonaparte instead; similar category but less congested area.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 13, 2005", "id": 3547871}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Wonderfully situated on the left bank in the 6th! Double room with two beds, upstairs in the back with fresh air but no view. Quiet! Clean, Clean! Nicely heated for mid February. Good size bathroom. Very nice, English speaking personnel at front desk who were most helpful.", "title": "A happy Find, good value!", "helpfulness": 7, "user": "mpwalk", "date": "March 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3314022}, {"rating": 4.0, "title": "Hotel Le Clement best bargain", "text": "Good location for wandering the smaller streets. In the middle of good neighborhood restaurants. Every place in Paris is easy access with two Metro stops within a short walk of the hotel. The only way we traveled even from the airport was on the Metro.", "helpfulness": 11, "user": "NOLATravellers", "date": "January 31, 2005", "id": 3100970}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 2, "variance": {"poor": 8, "average": 19, "very good": 86, "terrible": 4, "excellent": 48}, "aka": "Le Clement Hotel", "slim_ranking": 0.262688232013}