{"user_rating": 4.0, "review_count": 170, "name": "Hotel Indigo Albany-Latham", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "Just stayed here for one night while in town on business. Upon entering the hotel, we were greeted by the front desk person and were in our rooms very quickly. This place is all newly renovated and everything is new and clean. The rooms had a unique design to them and the bed was very comfortable. Nice flat screen TVs and the shower had plenty of pressure. The restaurant lounge on site seemed adequate. In the morning, they have a cafe with Starbucks coffee available. Very convenient and right off the interstate.", "title": "Nice Newly Renovated Hotel", "user": "mainetoday", "date": "December 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 22457235, "likes": {"liked": "— new clean rooms, comfortable bed", "disliked": "— wireless internet was down"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Great large rooms w/ hardwood floors large shower. Starbucks in lobby w/ healthy breakfast options and a very cool furnishings and decor. Had a sense of energy and in the atmosphere. I will stay again. Bistro restaurant with bar had just opened and while I did not eat there it also looked great. I will look forward to eating dinner there next rip through Albany. The location is across from Desmond where my conference was I stayed here in a better room for less. 2 minutes from airport by shuttle.", "title": "Indigo again and again", "user": "roadwarrior044", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22401916, "likes": {"liked": "— decor and freshness of everything", "disliked": "— All good"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Hotel Indigo is the perfect blend of “east meets west”; its uncluttered oriental design influences are perfectly melded with cozy occidental creature comforts. This boutique hotel is big enough to offer nice amentias, and small enough to offer polite professional personal service, which is delivered by a pleasant and attentive staff. The hotel is “ship shape and Bristol fashion” clean, and they offer artfully prepared food on site, with a host of other restaurant choices nearby. This comfortable hotel is easy to find, being adjacent to Route 87 exit 4. My family enjoyed our stay and readily recommends booking accommodation here when in the Albany NY area.", "title": "A peaceful place to stay", "helpfulness": 1, "user": "FormerNavalPerson617", "date": "November 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21797760}], "location": {"country": "United States", "city": "Latham"}, "stars": 3, "variance": {"poor": 10, "average": 23, "very good": 67, "terrible": 7, "excellent": 63}, "aka": "Hotel Indigo Latham", "slim_ranking": 0.294117647059, "description": "Discover Affordable Luxury at the New Hotel Indigo in Albany, New York The Hotel Indigo Albany - Latham is a sophisticated, Full-service hotel near the Albany International Airport (ALB), providing a complimentary shuttle to the airport. Our boutique hotel in Latham, NY is ideal for travelers who desire an oasis to escape from the ordinary, but value the traditional hospitality & services of a standard hotel. Our luxury Albany, NY accommodations offer convenient access to area attractions such as the Saratoga Race Course, Joe Bruno Stadium and the Times Union Center in downtown Albany. Our hotel is near premiere shopping spots including the Colonie Center Mall & upscale, downtown shopping on Pearl, Broadway and Lark Streets. Situated just north of Albany, our upscale hotel in Latham, NY offers close proximity to corporations in the Wolf Road Business District as well as Rensselaer Polytech, GE, the Albany Medical Center and various government offices. We also offer 1,200 sq. ft. of flexible meeting space, free high-speed, Wi-Fi Internet access and well-appointed rooms with modern decor that are an oasis for the business traveler to Albany. While lodging at our pet friendly hotel in Albany, we hope you take advantage of our 24-hour fitness center and sauna, Golden Bean coffee shop, and our Blu Stone Bistro and Bar. For the best in luxury Albany accommodations, choose the new Hotel Indigo in beautiful Albany, NY."}