{"user_rating": 4.0, "review_count": 1047, "name": "Hotel Tamarindo Diria Beach Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed at this hotel for 4 nights. I asked them to put me in one of the newer rooms, across the street by the pool, and they were able to accommodate me. The rooms were clean, cold AC, and very spacious. It was 2 min away, across the street, from the beach. It was also in the middle of town so close to everything, surf shops, stores, restaurants, etc. It was a very nice place to stay and room was very affordable! Id stay there again!!!", "title": "Perfect Location!", "user": "drdan21", "date": "November 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145939755}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We stayed for 3 nights at Hotel Diria. Beautiful location, right on the beach. The grounds were very nice! The pool, the beach, the rooms, all very nice!!! The only thing we found poor was the service. Often just one bar tender, which made for a lot of waiting. We tried to order food at different times and they couldn't make it, not sure why?? This place is so large, don't people eat at weird times? Also, don't get excited about the casino. The slot machines are very old and more then one would just drop the coins right through. We didn't come here to gamble but thought it would be fun.. anyway, overall great place to stay with lots and lots of restaurants within walking distance!!!", "title": "Great location", "helpfulness": 1, "user": "TravelEM03", "date": "November 21, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145934936}, {"rating": 4.0, "stay_parameters": "Stayed November 2012", "text": "Beautiful big resort and spa. Not much to say besides its the nicest hotel situated in central Tamarindo, right on the beach.", "title": "Easily the posh spot in Tamarindo.", "user": "unHoly-One", "date": "November 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 145861001}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Only flaw is that it's too big and therefore, as a customer, special attention and care are not easily found. Although everyone is superbly nice, they are not always attentive to customers needs.", "title": "great time surfing", "helpfulness": 2, "user": "craby57", "date": "November 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 145831369}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The combo of CR surf adventures and the Hotel Diria made for a great experience and the town of Tamarindo had thing to offer to all in dinning and fun things to do. We spent 8 days and 7 nights there and didn't do ever thing to do. just a note the tour desk will spend the time need for you to make the best of your time in Costa Rica. The sun sets are some of the best I seen any where.", "title": "Great location, above average property", "helpfulness": 2, "user": "BruceCostello", "date": "November 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 145673272}, {"rating": 4.0, "title": "Really enjoed Tamarindo Diria", "text": "We stayed at the Tamarindo Diria at the end of July 2007 for one week and we really enjoyed our time here. Though not a high-end five-star hotel, it was very nice and accomdating. The staff here was very friendly and they all spoke English quite well. The food at the restaurant was good as well and overall the property was clean and very pretty.", "helpfulness": 1, "user": "MABnj", "date": "August 28, 2007", "id": 8522632}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We had a garden view room, so it was in the back half of the hotel by the big pool and away from the beach. The room itself was nice - pretty simple, but clean and sufficient. It had a safe, pretty comfy bed and a clean bathroom.", "title": "So many things to love about The Diria...", "helpfulness": 1, "user": "runbettsrun", "date": "August 27, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8515524, "likes": {"liked": "— breakfast buffet", "disliked": "— the sheets"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The pool was nice and almost always empty and quiet. They have a swim-up bar, and again, the staff here is very friendly. The only downer was construction while we were staying there, but you sort of got used to it and could ignore it.", "title": "Do Not Stay Here!!!!", "helpfulness": 1, "user": "JERSEY11", "date": "August 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 8458524, "likes": {"liked": "— Pool and BUgs"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007", "text": "We also arrange two day tours through the hotel - a trip to the Arenal Volcano and white water rafting and both trips were a lot of fun and we didn't have any problems.", "title": "Warning - Your stuff will not be safe in your room !!!!", "user": "SurferGoob", "date": "August 15, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 8427642, "likes": {"liked": "— Did not stay the first nite. Moved out.", "disliked": "— Security"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007", "text": "My husband and I just returned from a week at The Diria. We loved it! The beach front location was superb! My husband surfed right in front of the hotel while I was sitting so comfortably on a chaise facing the ocean. The room was adequate: a bit small but kept very clean by the cordial and accomadating housekeeping staff. The food was excellent...the breakfast buffet was so good and we ate several meals there. The prices were so reasonable...filet mignon for $14!", "title": "Only good for looks", "helpfulness": 2, "user": "californiaclaudine", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8363786}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "My friend and I stayed at the Diria because someone had suggested it. In the town of Tamarindo, there currently are not too many options for four to five star accomdations so this is a great option for the money, location, service, decor, and hotel.", "title": "Good hotel for the price", "helpfulness": 1, "user": "Aucks", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8262149, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had paid for a superior room facing the ocean and when we got there we got a room on the first level facing the ocean, but you really couldn't see the ocean and the room had a king size bed which meant the room was smaller. We asked to change rooms since we didn't feel it was a \"superior\" room. We later found out that the only difference between a superior room and a standard room is that the former has an ocean view. Keep that in mind for booking, also, don't book through the hotel as their price is higher then what you can find via Expedia, or hotels.com.", "title": "Underated", "helpfulness": 6, "user": "ChicagoOnthego", "date": "July 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8228170, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We ended up in room 330, it was supposed to be an ocean facing room and it was expect we had a huge tree blocking our view of the beautiful ocean. Regardless, the sun would always greet us in the morning.", "title": "Protect Your Valuables", "helpfulness": 4, "user": "NorthCarolina_7", "date": "July 11, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8099657, "likes": {"liked": "— Location", "disliked": "— Security"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The room was always clean and free of bugs. Service was on par and the guest service/tour opeartor was very helpful.", "title": "Nice beach front hotel", "helpfulness": 2, "user": "pmulliki", "date": "July 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8097058, "likes": {"liked": "— Pool bar and proximity to the beach", "disliked": "— Rooms were too small"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The daily buffet breakfast was always good.", "title": "Nice views, but service was not good- overpriced", "user": "wwtraveler13", "date": "July 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 8079837}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "While the Hotel Diria has the very serious advantage of being the ONLY resort style hotel right on the beach and in the middle of town, I cannot say I was entirely satisfied with my stay. First, there is a lot of construction going on. In the hallway right outside my ocean front room, they were redoing the ceiling. It was dusty and loud all day - even on the weekends. If you opt to stay here, make them promise to put you in a room away from the construction. I asked to move, but they were completely sold out. Second, the walls are paper thin and many of the guests who opt to stay in Tamarindo are in party mode. Given the construction and the other loud guests and the blaring music from the hotel's own bar, this is not the place to go for quiet beach serenity (and, in fact, if that's what you're looking for, I'd skip Tamarindo all together). Third, the housekeeping staff really dials it in. They didn't replace dirty glasses with clean ones, they didn't restock in-room coffee, the floor was never quite clean, etc. For a hotel of this caliber, it was not acceptable. Fourth, when you check in they give you a ticket that you can exchange for 1 beach towel. If you fail to return the ticket at check out, they charge you $20. Personally, I like to use more than one beach towel at a time and $20 seems like a pretty steep penalty for loosing a towel or... just the ticket.", "title": "Room for Improvement", "helpfulness": 1, "user": "xteen", "date": "December 4, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 146779560}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "As for the positives: The grounds are very pretty. The ocean front rooms have beautiful views, although not a lot of privacy. The hotel has good security. There is a separate kids' pool. The breakfast is decent.", "title": "Great Spot in Tamarindo", "helpfulness": 1, "user": "Don M", "date": "November 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 146509481}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "Some reviewers obviously did not have the same experience I did, but I had a great time at the Tamarindo Diria. This starts right from the excellent staff that great you, the check in staff, wait staff and even the housekeeping staff.", "title": "Great location but expensive and not so clean", "user": "278michaelr", "date": "November 29, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 146421137}, {"rating": 2.0, "stay_parameters": "Stayed November 2012", "text": "Positives", "title": "Not really worth it.", "user": "androd25", "date": "November 26, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 146228342}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Location is perfect", "title": "Nice Hotel, Pristine Beach", "helpfulness": 3, "user": "sketchyStarr", "date": "November 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145954603}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "This place was a gem in the middle of a beach town. Our room wasn't bad, again not a five star resort, but it was a nice place. Definitly not a caribean beach, brown water, brown sand. But I took surfing lessons for $25 with a free tee shirt and had a great time. The hotels food was OK, expensive for what you get. We stayed in a beach front room and the sunset was amazing. From walking around the town< I would say it is probobly the best hotel in the area, lots of bars and food around.", "title": "It's a nice place.", "helpfulness": 4, "user": "adam_uh", "date": "December 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 11974829, "likes": {"liked": "— It was a great setting.", "disliked": "— I'm used to clear waters and white beaches."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I stayed at the Diria on a recommendation and was sourly disappointed. If the stay had gone as planned then it would have been only a mediocre stay. The room was modest with firm bedding and uncontrollable temperature. The freezing shower matched the freezing pool. The pool was overlooked by a construction site and the “cat calls” that come with a construction site were offensive. The easy beach access gave way to a polluted ocean. The sewage of the street flowed directly into ocean in front of the hotel. The ocean could not be swum in without risk of infection. The hotel did not inform guests of the possible risk but actually encouraged going into the polluted waters. The breakfast was good but not all it was hyped to be. The security was a façade and the part where the trip went wrong. The door in our room did not lock properly. We returned from dinner to a room with money and electronics missing. Upon informing the staff of this it took about 48 hours to get a response. The staff was well trained in American customer service, friendly and accommodating, all except the General Manager. He did not believe anything had been taken and accused us, the guests and friends of stealing from one another. Of course this was all said through a translator since he did not speak English. This a property promoting its staff speaks English. The most the General Manager could offer was a 5% discount after over $1000 had been taken. I have never been disrespected like the General Manager at the Diria disrespected me. I do not recommend this hotel.", "title": "Unsecure and Rude", "helpfulness": 1, "user": "COsma16", "date": "December 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 11914586, "likes": {"liked": "— The staff except GM", "disliked": "— Being stolen from"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This was an awesome stay. This hotel was exactly the place I was looking for in early December - a hotel on the beach with nice rooms, good location, and great food. The hotel is located in the middle of Tamarindo, but the back overlooks the ocean. The grounds are very well maintained, including the swimming pools. There were many lounge chairs, however none were on the beach itself. The hotel is a busy place but was still quiet and pleasant. The restaurant and bar were excellent, however the prices are more in line with U.S. prices The hotel is within walking distance of several other restaurants. With its central location, the hotel is a good launching point for trips to other beaches. We stayed in a oceanview room (#125). The bed took up the entire room, but most of our time was spent outside the room. Beach access was very easy. The staff was very helpful and spoke English. The breakfast was outstanding and a daily highlight!", "title": "A fabulous stay on the beach", "helpfulness": 2, "user": "jmille80", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11879797}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "Of note, the water pressure in the shower was fine on the first floor but temperature fluctuated a lot! I would like to see some lounge chairs on the beach itself. I have no other complaint!", "title": "Very nice hotel, fantastic location", "helpfulness": 3, "user": "ewcarter36", "date": "December 2, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11202996}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I would highly recommend this hotel and will certainly stay here again on subsequent trips to Costa Rica!", "title": "Great location & value in Tamarindo", "helpfulness": 1, "user": "ValleyFlyGirl", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11196064, "likes": {"liked": "— Location, and convenience to the beach, shops and great restaurants"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Several friends and I stayed at the Diria in late August and had a great time. We stayed in a room across the small street and had no problem. The walk is only about 2 minutes from our room to the sand. We enjoyed the pool across the street as well. It was mostly empty throughout our whole stay.", "title": "Great location, nice hotel", "helpfulness": 1, "user": "CaraAnt1", "date": "November 21, 2007", "detail_rating": {"front_desk": 1.0, "business": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10961808, "likes": {"liked": "— Location", "disliked": "— Check-in, staff not very helpful"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The location of the hotel is excellent. You are in the middle of several shops and restaurants. I recommend Witch's Rock (limbo!) and Hotel Pasatiempo (open mike night) for nights out! We had a great time at both places and both places are about a 5-10 minute walk from the hotel.", "title": "Nice Hotel - We enjoyed it there", "helpfulness": 2, "user": "caseant01", "date": "October 18, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 10112832}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The breakfast (included in the price of your stay) is really great. It is a buffet style and had something for everyone.", "title": "One of the best hotels I've ever stayed!!!", "helpfulness": 1, "user": "Constantin-Gabr... U", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10043921}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Bring an umbrella! In August, it rained just about every day and mostly around 4 pm. Sometimes it lasted an hour and sometimes it lasted 4 hours.", "title": "Good Stay Takes Some Adjustment", "helpfulness": 2, "user": "maa72", "date": "September 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8708332, "likes": {"liked": "— LOcation on the beach"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I recommend renting scooters from Tamarindo Adventures. We rented 6 scooters for about 6 hours and paid around $30 each. We spent all day driving and visiting different beaches and shops. It was amazing!", "title": "Nice Hotel for the area", "helpfulness": 3, "user": "jbs123", "date": "September 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8687991, "likes": {"liked": "— beach front", "disliked": "— water pressure"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "My girlfriend and I enjoyed our stay overall here. The staff is very friendly and willing to help. Although they started ignoring us at breakfast after about our 4th morning. They will tell you the best local places to eat, party, and shop. The hotel grounds are kept very well and the cleaning crew is quick. If you're into surfing (you probably should be if you're staying in this town) talk to Amos outside the hotel beachside. He has boards, and is a very knowledgeable surf instructor. I would recommend this hotel to any first timers in tamarindo. The only bad thing I can say about staying here is the inconsideration of the staff in the morning and at night. They tell and move around metal carts with plastic wheels over the rough paths... It makes a ton of noise during the early morning and late night near the bar/restaurant. You should be fine as long as you're not too close to the road or restaurant.", "title": "Don't stay in room 103 or 105 unless you prefer to wake up at 6:00AM", "user": "Bdiddy23", "date": "December 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 147100737}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "My husband and I recently stayed at the Diria with our two young children for a week. We LOVED the hotel, the staff, the food - all of it. I really cannot say enough about how wonderful the trip was. As for the bar/food service, it is a little slower then in the USA, but isnt that what you go on vacation for? You do not demand food in Costa Rica, you experience food in Costa Rica! Slow down and enjoy yourselves. Our room was located across the street from the lobby building, overlooking the pool. It was wonderful and surrounded by really cool wildlife. The ONLY thing I would really really like to see changed before our next trip back (which will be soon) is the addition of screen doors on the patios. We would have loved to listen more to the birds and howler monkeys, however the mosquito's in Costa Rica are fierce!! Over all, we highly recommend this location. GO!", "title": "We Loved our experience at the Hotel Diria!!", "helpfulness": 1, "user": "kelly h", "date": "December 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147053296}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The most beautiful hotel I've ever seen, huge nice pool! Very nice swim up bar in the pool. Great kind stuff! The hotels is surrounded by huge palms and trees.I've seen monkeys, iguanas and squirrels in the hotel's territories.", "title": "The best hotel ever!!", "helpfulness": 1, "user": "Kelly42139", "date": "December 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147033806}, {"rating": 3.0, "title": "Love it for the most part", "text": "We love to come here. This is our 2nd time but the wait staff at breakfast HATES to bring us tap water. We don't drink coffee and only ask for water. They will ignore us or only bring one glass for both of us. It makes us want to go somewhere other than Tamarindo for a week. Maybe another hotel would like for us to spend our money with them? And they would be happy to give us water? Seriously we only ask for this one thing and the waiters are so rude about it.", "helpfulness": 2, "user": "Renee S", "date": "December 6, 2012", "id": 146894347}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I didn't dislike this property by any means. It is on a very nice beach, it is in an ideal location and there are a few options for dining. I just feel that for the price they charge, it should've been a nicer property. Small details made my experience sub-par. The AC leaked all over the bed, the property and room weren't super clean, the property feels a little old and tired and the service was really not great. It is definitely a surfer hotel and it is fun to watch all the activity along the beach. The drinks were good at the bar but I had to flag someone down twice to get service (not because they were busy, but rather too busy talking to co-workers than to work!). The breakfast buffet was very good and located in a nice restaurant overlooking the beach. Tamarindo was a fun little town but I don't think it's worth staying more than two nights unless you are a surfer. If you find a good deal on the hotel, definitely go! If you are paying full price, I just don't think it is worth it.", "title": "Not a bad property but not a good value for the price", "helpfulness": 2, "user": "SEGMN", "date": "December 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 146877615}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My wife and I recently spent four nights here on our trip across Costa Rica. I agree with what most others have said. We found our room (ocean front) very clean. The grounds are attractive and well maintained. The pools were very nice. Service was also good. The location is convenient for most all there is to see and do right in Tamarindo. There are plenty of eating choices a short walk from the hotel. The beach itself is great for surfing and swimming.", "title": "Pleasant Stay", "helpfulness": 2, "user": "highdesertbadger", "date": "December 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 147745444}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "However there were a number of annoying negatives. Our room was small with the bathroom being very small. While we did have a nice view of the beach, there were several nights when music coming from either the Diria or a neighboring hotel was very loud and continued late (one night until 1 AM) which kept me awake on both occasions. While the grounds are nice form lounging and enjoying the ocean view, if you sit too close to the wall separating the beach from the hotel property there is a steady stream of beach vendors trying to sell all sorts of \"stuff\". And they come back over and over, even though you've said \"no gracias\" on numerous times. The pool \"across the street\" was nice and not used much, but the majority of lounge chairs were broken and if they weren't they were uncomfortable. The hotel should replace these plastic chairs with the nice ones across the street.", "title": "Nice hotel on the beach", "helpfulness": 3, "user": "Diane M", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147642337}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "Overall we enjoyed our stay. We found the breakfast to be one of the better ones we had during our stay in Costa Rica, although as in all the other places we stayed at, the variety each day is almost identical. And finally the hotel has parking. It was safe and not too far away from our room.", "title": "Great Hotel for a Wedding or Vacation Alone", "helpfulness": 1, "user": "Jessica B", "date": "December 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147633896}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Tamarindo is a bit too much like a Mexican beach resort but we got suntans, did some nice beach walking and swam in the surf before having to return to the cold and snow of the north.", "title": "Got what I expected", "helpfulness": 1, "user": "Matt H", "date": "December 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 147589756}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "We recently spent 4 days at the Tamarindo Diria Beach Resort; great place, directly on the beach. Room was spotless, restaurant / bar from the Hotel was fair, location is outstanding with its terrace and palm trees. Located close to very nice shopping boutiques and a few nice restaurants. A good choice for surfing, fishing, day dreaming and relaxing. The only negative note (but it is very little compared to the other benefits) is that the towels at the pool were in better condition than the ones in the room.", "title": "Beautiful resort.", "helpfulness": 1, "user": "JLeeRush", "date": "December 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 147344938}], "location": {"country": "Costa Rica", "continent": "Central America", "city": "Tamarindo"}, "stars": 3.5, "variance": {"poor": 88, "average": 152, "very good": 407, "terrible": 66, "excellent": 334}, "aka": "Hotel Tamarindo Diria Beach & Golf Tamarindo", "slim_ranking": 0.695652173913, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Modern oceanfront hotel with Costarican flavor, located 65 km from Liberia Airport (LIR)."}