{"user_rating": 4.0, "review_count": 2955, "name": "Hotel Riu Palace Aruba", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2010", "text": "This info is very good for Aruba traveller to the rui hotel", "title": "01 01 2010", "helpfulness": 3, "user": "mi4shampoo", "date": "January 14, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 53469185}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Our stay at the Aruba Riu palace was overall wonderful. Can't wait to go back, however pillows are terrible and mattresses are hard on your back.", "title": "They couldnt have made it nicer", "helpfulness": 9, "user": "ArubaFan14", "date": "January 13, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53387542}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Food was great makes you want to tip the chefs", "title": "Free drinks attract wrong crowd", "helpfulness": 1, "user": "illuso", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 53322353}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "the unorganized front desk cant be helped people arrive in hoards and everyone is rude and tired. But once you check in it feels like paradise.", "title": "The beds are horrible!!", "helpfulness": 2, "user": "cylylo", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 53317706}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Don't bother to upgrade your rooms, its just a scam all rooms a jr suites and the only better room is the ones that are all suite with pillars around Jacuzzi. warning all rooms have Jacuzzi and step up to bedrooms to. So save yr money or go for the best no middle grade rooms available as illustrated in the brochures. bring your own pilows. If you are booking with sunquest be sure to stay under your baggage weight. Spa was a 3 out of 5", "title": "People who liked this placed must have been blinded by love", "helpfulness": 1, "user": "child_of_the_hoodlum", "date": "January 12, 2010", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 53313585}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "First and foremost I must thank everyone and trip advisor for all their inputs and for the website. Now I must do my part. Arrival at Queen Beatrix Airport was smooth. Luggage was acquired and a taxi ($25.00) took us straight to the hotel (approximately 15 min.). Taxi fare is based on location to, and not per person. Each person is allowed one luggage piece and a carry-on. Additional luggage is $2.00 per bag. Also, check to see if you qualify for a free shuttle when booking your trip. Others we met had this free mode of transportation.", "title": "A fantasy Island paradise!", "helpfulness": 4, "user": "BigALexFlorida", "date": "January 7, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52865041}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Check in was smooth, and a drink server was there to give us some refreshments.", "title": "great food, great location, clean, fab pool", "helpfulness": 3, "user": "lauracutts80", "date": "January 6, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52731572}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Of course we ended up in the so called dreaded Block \"C\". Overall it was very nice and a lot of space. Yes there was carpet and tile floors, but it worked out for us. There were two bathrooms, a kitchen area, a living room and a bedroom. The balcony was small (standing room only for two), but it had a great view from the fifth floor. The balcony allowed for viewing the Caribbean, beach and lighthouse in the distance. We also had another view (through other windows) of the beach, as well as some of the best sunsets ever! Overall my wife and I enjoyed our room and felt very comfortable. Also, we didn't have a problem with room security (specifically the safe).", "title": "Beautiful Hotel and Beach.. For mostly couples", "helpfulness": 2, "user": "MKISS74", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52685385}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I must say that all staff was very friendly. The language is Papiamento, but everyone speaks English. Also, if you speak Spanish, you're really in baby.", "title": "Awesome Vacation", "helpfulness": 2, "user": "KimberlyMarie", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52646320}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "As far as dining, well we pretty much hung out at the Don Nicholas buffet for all meals. The weather was great, so we dined outside and enjoyed the fresh air and the view. The restaurant staff were all great, and always ready to give the best service. We loved the food! All meals were different, and there was quite a variety to choose from, also you don't have to worry about a reservation, like at the other a la carte restaurants. Drinks are per glass and no bottle, but you can have as much as you want.", "title": "NIce place, but not typical American sensibilities", "helpfulness": 3, "user": "ChicagoGrossie", "date": "January 4, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 52616531}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "I just returned from my 5 day stay at the Riu Aruba. My observations:", "title": "Excellent stay, not without small disappointments - but great overall", "helpfulness": 4, "user": "bethrad", "date": "January 18, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 53817280}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Check in was fairly orderly, considering the large throngs of people that converge on the check in desk with the arrival of each airport shuttle. I asked about changing rooms, and they replied that they were completely sold out and that wasn't possible.", "title": "unaccommodating", "helpfulness": 4, "user": "njnister", "date": "January 18, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 53807381}, {"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My room was in building A, and had a beautiful view. Yes, the beds are hard. The room was completely tiled with dark furnishings. I'm not a fan of dark furniture, and in my mind tropical areas usually have light furniture. This is a style preference and not really a factor in my overall opinion of the hotel.", "title": "NEVER AGAIN!!", "helpfulness": 3, "user": "bostontravelgirl44", "date": "January 18, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 53797879}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The bathroom was nice with two double sinks and a jetted tub, which I never used (but considered it every night).", "title": "Front desk staff rude!", "helpfulness": 1, "user": "ilove2escape", "date": "January 18, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 53762720}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "The room had a ceiling fan, but I found most nights that I could sleep without air conditioning or the fan and be quite comfortable.", "title": "A good experience in Aruba", "helpfulness": 6, "user": "KellieMachado", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 53714245}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We just returned from our visit to Aruba. We stayed there for 12 days. The hotel has openend in August 2007. It used to be the Aruba Grand. There are two new buildings A and B and one older building, building C. We read negative comments on the C building, but we did stay in C and the rooms were very spacious and nice. I think the C building is also renovated completely because it looked very new. The only thing is dat the C building has French balconys and A and B have bigger balconys. But because of the hard winds not many people stayded on their balcony. The food in the hotel is excellent, we are not really \"buffet\" people, but the buffet here is really great. Also the a la carte restaurants are really good, they have more sphere than the buffet restaurant (because it's really big). The beach is great at the Riu, it looks like if there is more space than at the beach with the other hotels. For example the beach at the Marriot is so crowded. The Marriot is very expensive but if you walk at the beach there it looks like Benidorm, it's really busy there! If i could say one thing that's not so good at Riu than i would say the music at the pool. It was far too loud. If you stay at the swimming pool it feels like you're on MTV. But if you stay at the beach you aren't bothered by that. Overall it's a very nice hotel and i would stay there again.", "title": "Luxurious new hotel with great food", "helpfulness": 5, "user": "LindaSchilder", "date": "May 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15530742, "likes": {"liked": "— the food and the beach is great!!", "disliked": "— the music at the pool"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "we went to Aruba 4/01/08-04/08/2008. it was our second time in Aruba- we were there 4-5 years ago on our honeymoon. this was our first time at a RIU property. we were looking to stay at an all inclusive high rise near the other high rises.", "title": "had a great time at the RIU", "helpfulness": 7, "user": "violet_ryan", "date": "April 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15517413}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We loved our stay at the RIU, great food, great service! The bar staff, pool staff , desk staff and wait staff was quick, friendly and efficient. Our room in the main building was amazing with the most amazing view overlooking the pool and ocean. The room was clean and our baloney was rather large. All inclusive is truly all inclusive at the RIU, mini bar & room service included. Food & drinks were available 24 hrs a day. literaly. The bad elements of our stay was the noise from the elevator and the wind knocking over umbrellas at the pool. The pool area is all sun, so it was a challenge with the umbrellas. This is a very large hotel so if you are looking for somewhere intimate and quaint this is not the place for you. I love a grand lobby and staying on a high floor so it was perfect in that sence for us. The front desk was very helpful making reservation for dinner off the property for us. I would definately recommed the Japanese restaurant on the property - very good! Most amazingly, the hotel was fully staffed at all times, which is remarkable, due to the size of the hotel and number of guests. Not a long wait at the bar or concierge. We would definately would go back to Aruba, and this hotel.", "title": "Save Your Money, Try Another Resort", "helpfulness": 3, "user": "Bobberson", "date": "April 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 15460058, "likes": {"liked": "— The Pool", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Just returned from Aruba, we stayed at the Riu Palace from April 13-27. This was our honeymoon and we didn't take any shortcuts in terms of room and price etc... we wanted the best and RIU's have a good reputation. We experienced the RIU Bambu in Punta Cana and it was amazing! Great weather, great food and fantastic staff. Our expectations were alot higher for many reasons, Aruba is known to be an amazing island with great food, shopping and most importantly a very safe island. Let me begin with my review...", "title": "Absolutely stunning!", "helpfulness": 9, "user": "seetheworld75", "date": "April 28, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 15431068, "likes": {"liked": "— The room and the food!", "disliked": "— The lack of activities."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We booked the best room available, I believe it is the Suite Oceanview... has a jacuzzi in the room and marble floors and sunken \"living room\" area. Check in was a breeze, when we arrived to our room 636, new building, we were satisfied with the room. I was kinda expecting more but it was fine. Very big balcony, nice jacuzzi, shower had good pressure, double sinks, king size bed (not 2 queens pushed together), safe, walk in closet, fridge etc... one thing that was forgotten was our honeymoon package included the honeymoon welcome which should of had a bottle of champagne and fruits etc.. nothing. I called the front desk and they assured me that the following day it would be done. No problem.", "title": "LOVE Aruba!!", "helpfulness": 3, "user": "Coastalpines", "date": "April 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15433619, "likes": {"liked": "— The views", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "It was a beautiful hotel. Great staff, service, experience. We loved it and had a great time.", "title": "Absolutely Great Place", "helpfulness": 2, "user": "green004", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15068381, "likes": {"liked": "— It was very nice, clean, friendly, - went with another couple for 20 year anniversary", "disliked": "— We really did not have a problem at all."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "Just returned from 3 nights at the Riu Aruba. The hotel is beautiful. The beach & pool were great. Room was 903 in Bldg. A and it was magnificent . Big balcony with 2 lounge chairs overlooking the pool and beach, jacuzzi tub, all marble bath. Only complaint was the bed, very hard. Requested a pad after the 1st night and housekeeper bought an eggcrate type pad and that really helped. Service was great during the entire stay. Check-in and out was a breeze. Food good at the buffet. Ate dinner at the Krystal, Milano & Nautilus. Food and service just ok, actually prefer buffets at breakfast and lunch. Bar service was great. Top shelf alcohol was available if you asked. All in all a great trip and great hotel.", "title": "Great time at the Riu", "helpfulness": 3, "user": "kjmc33`", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15057543, "likes": {"liked": "— location, service", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My huband and I stayed at the RIU from April 4 to April 11. It was a wonderful vacation. This is not the first time at an all inclusive resort. But it was the best. The most important thing for us was the cleanliness. We found the resort very clean. The rooms were cleaned every day. If we ran out of something, we placed the empty container on the bed and when we got back it was taken care of. The one thing we did not like was the way the beds were. We had two full size beds beside each other but they were not hooked together and when you rolled over you could fall throug the crack. The other problem, the walls were not insulated very well and we could hear noise from the room next to us.", "title": "Great Vacation", "helpfulness": 6, "user": "OhioHarley", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15006901, "likes": {"liked": "— The choice of food.", "disliked": "— The birds at the outdoor restaurant."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "The food was excellent. The specialty restaurants were very good. You needed to get up and set your reservations at nine o'clock in the morning but the line went very fast. At other all inclusives I had to get up a 5am to get in line for the restaurant.", "title": "Had a WONDERFUL time!", "helpfulness": 1, "user": "NONNIENy", "date": "April 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 14989653, "likes": {"liked": "— Convenience of accomodations; all very close together (restaurants, spa, rooms, etc)", "disliked": "— Beds are a bit hard.........."}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "The buffet was excellent. They had crab legs, shrimp, caviar, and other delicacies. The restaurants were very clean. There was someone cleaning the tables and taking your dirty dishes a soon as you were finished. The people in the restaurants were very nice and friendly. The only negative was the outside restaurants. There were birds flying in by your table and landing on the floor to eat scraps. The breakfast buffet was terrific.", "title": "Horrible!", "helpfulness": 1, "user": "airchic", "date": "April 11, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 14964696, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I went with my boyfriend in Oct 2007. This was the newest hotel there at the time. It was definitely the talk of the island. Many people there own timeshares, and are anxious to know about the Riu. Aruba is filled with honeymooners and affluent retirees, so if you are looking for a spring-break party trip, Aruba isn't for you :)", "title": "Amazing Hotel!", "helpfulness": 2, "user": "chills4", "date": "April 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 15417313, "likes": {"liked": "— Room & Restaurants", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Rooms - soooooo clean & spacious! We had an oceanview, walk-in closet, his & hers sinks, king size comfortable bed. Ideally you want to request a room not directly attached to the hotel....they are larger & nicer.", "title": "Loved the Riu", "helpfulness": 2, "user": "djMaine", "date": "April 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 15409937, "likes": {"liked": "— Room was great with a fantastic view, great beach, good food."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Pool - very spacious, great swim up bar with tables & chairs right in the pool.", "title": "Pros & Cons of theRiu Palace Aruba", "helpfulness": 1, "user": "queenie19355", "date": "April 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "rooms": 5.0, "location": 5.0}, "id": 15404936, "likes": {"liked": "— The location", "disliked": "— The food"}}, {"rating": 4.0, "title": "Good all inclusive", "text": "Beach - beautiful beach, no one tried to sell us anything, comfy beach chairs - note: get up early if you want a cabana! ie-5am!", "helpfulness": 4, "user": "turksandcaicos", "date": "April 25, 2008", "id": 15326719}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Food - it's a Riu so it's fantastic. All the restaurants were amazing - the nicest I've ever eaten at at an all inclusive.", "title": "A Little Piece of Heaven", "helpfulness": 6, "user": "Jujuhudd", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15290300, "likes": {"liked": "— The beach and pool", "disliked": "— Sand in my shoes - sunscreen in my eyes"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed at the RUI palace Aruba from April 1 through", "title": "RIU Palace Aruba", "helpfulness": 3, "user": "Cazadore", "date": "April 22, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 15219424, "likes": {"liked": "— Room and view", "disliked": "— The number of people staying st the hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "April 8. The beach, sand and the water were fantastic.", "title": "Better Than Expected", "helpfulness": 5, "user": "bustagrimes", "date": "April 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15202623}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The hotel staff was friendly however, the place was", "title": "Great Honeymoon at RIU Palace", "helpfulness": 5, "user": "thrillwill", "date": "April 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15134038, "likes": {"liked": "— Friendly staff and great view", "disliked": "— Beds"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "probably 95+ occupied. I really don't like hotels that", "title": "RIU Aruba...Great Hotel and a Wonderful Island", "helpfulness": 5, "user": "suemas", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15114341, "likes": {"liked": "— The staff was incredible, so was the pool and beach!", "disliked": "— small casino"}}, {"rating": 5.0, "title": "The BEst", "text": "are over booked and consequently do not have the facilities", "helpfulness": 7, "user": "Waitinline", "date": "April 17, 2008", "id": 15101627}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed at the Riu in Aruba for our honeymoon (October 11-17, 2009). This was our first trip to the Caribbean and we weren't sure what to expect, but we LOVED it. We didn't have any problems on the direct flight from Charlotte and our arrival at the Beatrix airport was smooth. Make sure to ask your travel agent to give you some form of documentation to get the free DePalms Tours shuttle to the hotel, because ours forgot. We were still able to ride the shuttle (we told them we were on our honeymoon) and all was well. Check-in was painless and we were given a drink immediately upon arrival. We were impressed with our room and with the speedy arrival of our bags. We overslept then spent too long at breakfast the first morning so we missed the dinner reservation timeframe, but were happy to eat at the buffet. My husband really liked all the restaurants and we had lunch most days at the buffet (Don Nicholas) or Nautilus. Everyone was friendly and we met quite a few Americans. When we were there, I can honestly say we only saw three or four children. It seemed to be predominately couples (a lot of honeymooners!). We didn't really venture into the Casino, but the nightly shows were entertaining and the poolside BINGO games were fun. The weather was perfect, which is pretty typical for Aruba, and it only started to storm a little as we were checking out. The only excursion we did was the Pirate Ship snorkeling/rope swing adventure and we loved it! We had a wonderful honeymoon at the Riu and we'd go back in an instant!", "title": "Perfect Honeymoon at the Riu!", "helpfulness": 3, "user": "WolfpackGirl86", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 53294591}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Except for a few things (lack of in-room wifi, crazy slow elevators, and lounge chair hoarding), we loved the Riu. We’ve stayed at the Hyatt, Renaissance, and the Radisson in years before. These are all so different that you can’t compare them, so I won’t, but the Riu definitely held its own. It is maybe a little less “tropical”, more modern feeling than the others.", "title": "Some kinks to work out, but highly recommended", "helpfulness": 6, "user": "sofieann", "date": "January 11, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 53185691}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Buffets: I liked these. Nobody bothers you to take your room # or anything. Just sport the bracelet and you’re on your own. One or another of the buffets is open almost all day, so you can grab something quick to bring to the beach, and then come back an hour later for a proper breakfast with your people. Very carefree and relaxing to not have to go to a sit-down restaurant for every meal. NO TO-GO COFFEE until 10:30 though, which was a huge miss. I walked to Dunkin Donuts every morning for coffee to take to the ocean.", "title": "Perfect Weather, Great Experience, Is it all WORTH IT?", "helpfulness": 2, "user": "SUPERMARIO-NY", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 53175848}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Restaurants: Nice change of pace from the buffets, but I would have been fine without them. You must wait in line at the lobby between 9am and noon to reserve for that evening. Each restaurant can only fit about 30 people per sitting, so you have to reserve early to snag a spot. Menus are very limited. No liquor is served – only wine & beer. Rank: Gourmet (good), Japanese (good, except for “sushi”, which was cooked beef (?) and smoked salmon with rice), Steakhouse (ok, not better than the buffet food and worse service I thought), Italian (n/a, didn’t visit based on boring menu).", "title": "Super Friendly Staff", "helpfulness": 1, "user": "LYNNYDYN", "date": "January 9, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53054653}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Drinks: Everything is poured from open bottles, including wine. So I’m not sure you are getting anything other than boxed wine transferred to bottles. But service at the bars was great… we were always sure to tip though, whereas I gathered most people did not.", "title": "Do not pick The Riu for your vacation in Aruba!", "helpfulness": 2, "user": "NiBr", "date": "January 8, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 52967493}], "location": {"country": "Caribbean", "city": "Palm - Eagle Beach"}, "stars": 4, "variance": {"poor": 174, "average": 393, "very good": 916, "terrible": 161, "excellent": 1311}, "aka": "Riu Palace Aruba Hotel Palm/Eagle Beach", "slim_ranking": 0.75, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "> * Opened: summer 2007> * Situated in Palm Beach on the island of Aruba> * Two 10-story buildings, one 8-story building> * Located on the beach> * Complimentary sun loungers and parasols on the beach> * 4 km / 2.48 miles from Oranjestad> * 700 m / 2296.7 ft. from various shops> * 10 km / 6.21 miles from the airport> * Credit cards accepted: Visa, MasterCard, Amex, Diners"}