{"user_rating": 4.5, "review_count": 278, "name": "Hotel - Albergo California Positano", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My Partner and I travelled to Positano for a family wedding and found it to be a very beautiful town with amazing views from both the beach and from further up the (v steep) hill. We had never been to the Amalfi Coast before and we were a little anxious as to how gay friendly Positano was. We needn't have worried as we experienced nothing but an amazingly warm welcome from Maria and her lovely family who own and run Alberto California. When we requested an ironing service for our wedding shirts, although this service is not normally offered to guests, Maria went out of her way to have ths done. Excellent! and greatly appreciated! Also although this hotel is approx 10-15min uphill walk from the beach, the views are spectacular.", "title": "Made to feel very welcome and what a view!!", "helpfulness": 1, "user": "JonnyP82", "date": "May 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 65816238}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Both my Partner and I and also my Brother and his Partner stayed for 5 days at the hotel and we were constantly met with friendly conversation and even the odd hug from Maria! NB.. Unlike other hotels where staff greet two men staying together with a raised eyebrow and an offer of 2 seperate beds, nothing like this happened to us at California. We would definately go back to this hotel.", "title": "Welcome to the Hotel California Such a lovely place...What a nice surprise", "user": "TGDino", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65024083}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "May 11-12-13, 2010 You too will be singing The Eagles late-1976 hit! There's plenty of room at this Albergo California Hotel but no room for for improvement required. Maria will take care of everything and will make you feel-at-home. She is Momma Maria to many guests in addition to her family which comprises her hospitable staff.", "title": "The most magnificent hotel", "user": "brickm", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64777137}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The views from the hotels' balcony are indisputably Marcello's (Rauol Bova's) apartment building in 2003's Under The Tuscan Sun - fabulously!", "title": "Best view and value on the Amalfi Coast", "user": "RockyMtnBlue", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 64421908}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "The spaciousness, cleansiness, and above-adequate accomodations of this awe-inspiring location equates to best-value for the price.", "title": "sensational location, beautiful hotel, marred by only one thing...", "helpfulness": 1, "user": "blisteringbarnacles", "date": "December 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 51579663}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Fantastic location, tremendous service, beautiful rooms and Maria takes great care of her guests. It was almost like staying with family (good kind of family!)", "title": "Best place to stay in Positano!", "helpfulness": 2, "user": "FlyingScot123456", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46951994}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "After reading about Albergo California a few years ago in \"Rick Steve's Italy\" we have just returned from our 4th stay there, this time taking 4 friends who now love the hotel as much as we do. You won't find better hospitality than from Maria & Antonio. They address every need. The rooms/bathrooms are spacious and the entire hotel is SPOTLESS. (Ask for Rm 62, where the Positano scenes from Under The Tuscan Sun were filmed.) Plan your day while having a tasty breakfast on their gorgeous terrace overlooking the sea. The location is perfect, walking distance from the SITA bus stop. Maria has always been genuine, honest and sincere each time we have stayed there. Where else does the owner of the hotel give you a big hug when you leave!!?", "title": "Absolute gem on the Amalfi Coast", "helpfulness": 1, "user": "We_L0ve_Italy", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45799998}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "After reading rave reviews about Albergo California in \"Rick Steve's Italy\" a few years ago, we've stayed at Albergo California 4 times in the last 6 years and have never had more wonderful service from any hotel on the Amalfi Coast. Maria & Antonio & family are truly exceptional. Each time we have stayed, they have gone out of their way to make sure every need is addressed. The hotel is SPOTLESS, the rooms spacious. (Ask for room 62, where Under The Tuscan Sun was filmed.) The breakfast is delicious and the service is excellent. Where else would the owners of a hotel give you a big hug when you leave?! A true gem on the Amalfi Coast!", "title": "No greater view or hospitality in Positano!", "user": "We_L0ve_Italy", "date": "October 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45761728}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "we just got back from a trip to Italy. Rome, Sorrento, Positano and Amalfi Coast. Positano was the highlight of a great trip,Hotel California was just what you think of when you think Italy. Breathtaking views, balconys, terrace for breakfast or to share a bottle of wine.Hostess/owner Maria is there to make your experience the best ever. She gave us two suggestions for restaurants that were the 2 best of the whole trip. Even arranged a driver to pick us up. She was never pushy we could have easily said no. Her suggestion for a driver to take us back to Naples train station was greatly appreciated, we never lifted a finger and it was taken care of. Never in my travels has any one been more friendly than she. Everyone feels like family. Easily the best hotel experience we ever had. Would go back in a heartbeat and will refer everyone I can. You meet people that come back year after year and now you know why.", "title": "heaven on earth...wonderful views, best service ever", "user": "babzy54", "date": "October 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45719311}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "we rented scooters overnight and they warmly opened up there garage so we could park them for the next day.", "title": "Heaven On Earth", "helpfulness": 4, "user": "dolcevitaadventures", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36386045}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We had a great 3 nights here! The views are amazing, location is central - although it's quite a hike up from the beach if you're not in great shape! We stayed on the ground floor which was just ok - wish we could've stayed on a higher floor so that we wouldn't have traffic past our balcony. Breakfast was sparse but did the trick. Service was friendly and thorough. It's a great deal in Positano!", "title": "Great views, large room!", "helpfulness": 3, "user": "nyctraveler300", "date": "November 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 49503030}, {"rating": 5.0, "stay_parameters": "Stayed October 2009", "text": "just visited positano for part of a wonderful cooking tour and felt immediately like i knew maria for a long time! she's very helpful and VERY genuine! the hotel is immaculate, the service fantastic and the atmosphere typically hospitable italian. i just love it!!", "title": "maria and the hotel california are it!!", "helpfulness": 2, "user": "cucinacutie", "date": "November 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48941572}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "her recommendation of ristorante scirocco was absolutely great and i would recommend a visit there to anyone. it sits on top of positano instead on the beach and is a wonderful change for a beautiful meal! maria actually arranged for the restaurant staff to come and pick us up and take us back!", "title": "Nice, comfortable hotel", "helpfulness": 2, "user": "WorldTravellerr", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48370598}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "if you visit positano--hotel california is it!!!!!", "title": "A Gem in a gem", "user": "VictorZeus", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47756185}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I stayed at Hotel California for seven days in mid October. Though I had requested a room on an upper floor when booking, I was told there were none available upon check in and given a room on the ground floor. I thought this would be an issue given the fact that to enter the hotel guests must walk right past the french doors of the ground floor rooms and can see right into your room if the doors and curtains are both wide open. I asked to be moved, was told it would cost more, so I declined. I just accepted it and really it was fine, though it would have been nice to have been able to have the doors and the curtains thrown wide open at all times because the views are spectacular.", "title": "How do you solve a problem like Maria?", "helpfulness": 2, "user": "PalmBeachTravelIT", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47144395}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We ended up in Positano 2 days earlier than expected and walked in to this place. This side of Positano, the south side, is ideal because there are less stairs to get up and down to the beach. The bus from Sorrento stops just a block or so from this hotel. It is the 2nd and final Positano stop. My mother and I shared room 63 which had a queen bed and one window high up on the wall that opened to a hallway or something. The air conditioning and everything else worked well and the rooms were clean. They have suites with views of Positano and the ocean which I would like to book for my next stay. Breakfast was great and we sat out on their huge patio with a mediteranean view. We loved the family staff and wished our entire stay was at this hotel.", "title": "Excellent Location and wonderful family run place!", "user": "Rndthewrld", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70841890}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed here for four nights. We chose this hotel based on its unbeatable views of the township of Positano, the beach/ocean and the spectacular cliffs of the Amalfi coast.", "title": "Spectacular view with true family service.", "helpfulness": 3, "user": "AdsMan", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68665995}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "The hotel: offers about 12 rooms and is spread across 4 levels with a very wide, open air terrace offering smashing views of Positano (among the best you could find here). It offers free, undercover secure car parking which is a HUGE plus (street parking is €3.00 per hour if you can find it). My only complaint is the lack of WiFi and/or a computer with internet access. In this day and age, this is a must – although, Maria (the owner) tells me it’s coming next month (July 2010).", "title": "One of my favorite hotels", "user": "KonaDave", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67550088}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "The room: Room 62 is a large room on the top floor with huge ceiling (about 3.5m high), wardrobe, safe (the size of two bricks), en-suite (shower over bath, bidet, heated towel rails), comfortable king-size bed, desk with chair, fridge, TV and private balcony (large enough for one person to sit and admire the view). Cost was €160/night with breakfast (pastries, juice, yoghurt, toast, cereal and the best cappuccinos I’ve had whilst in Italy). Also, room 62 is where they filmed a scene for the movie “Under The Tuscan Sun”!!!", "title": "Wonderful gem facing the sea.", "user": "rcjackrussel", "date": "June 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67496245}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The service: everybody here has been so obliging, warm, friendly and all spoke good or very good English. Special thanks to Gianni, Antonio and to both Marias for your extra special hospitality during our stay.", "title": "Beautiful Views and Great B&B", "user": "Sominex", "date": "June 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67027381}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 3, "variance": {"poor": 6, "average": 4, "very good": 63, "terrible": 5, "excellent": 200}, "aka": "Hotel Albergo California Positano", "slim_ranking": 0.219512195122}