{"user_rating": 3.5, "review_count": 170, "name": "Hotel Post", "reviews": [{"rating": 5.0, "title": "Excellent value for the money", "text": "Several times we have stayed at the Hotel Post over the past few years and always we have found the service excellent. It is not a luxury hotel, makes no attempt to be one, has no pool, sauna, etc. We don't want or need these things when we travel, would rather spend our money in other ways. Prices at Hotel Post include breakfast which is not always the case in other hotels. It is clean, quiet and centrally located and we will plan to stay there again when we visit Vienna next.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 6, 2005", "id": 3445527}, {"rating": 3.0, "title": "Okay, nothing particularly memorable", "text": "This hotel is very central to everything without being in the centre of all the noise (2 min walk to the main shopping area), and is okay for the price. Its a little bit down at heel (slightly tatty rugs in the room, slightly fraying towels) and, but it was clean, and the staff were pleasant enough. I have to admit, though it was perfectly comfortable it wasn't the best 3* hotel I've stayed in. Apparantly Mozart and Nietzsche have lodged there in times past. There is a great italian restaurant across the road from it, super friendly staff!", "helpfulness": 10, "user": "BeeperLondon", "date": "November 16, 2004", "id": 2827285}, {"rating": 5.0, "title": "Good hotel", "text": "We found a relatively cheap deal for this hotel. It is in no way a luxury hotel, so don't expect to find interesting decor & don't look in the mirrors (for some reason they seem to have the same effect as those mirrors on old fairgrounds which make you look shorter, bigger, etc- very odd!) It's a good hotel for the price. Our room was very spacious, clean and comfortable. The bathroom was spotless and had both a bath and separate shower. The location was excellent- 3mins walk from a metro station, 6mins walk in the other direction to Stephansdom. I would stay here again.", "helpfulness": 7, "user": "Quarrier", "date": "August 28, 2004", "id": 2499618}, {"rating": 1.0, "title": "Worst hotel I ever stayed in!", "text": "We booked this hotel through the tourist office at the train station in Vienna. We asked for a comfortable hotel in a central location. We paid 104 euros for one night in a double room. When arrived at the hotel we were given a room on the sixth floor. The moment we came out of the lift I couldn't believe my eyes. It was a scene from a horror movie. The corridor looked like the hallway of a mental institution. The walls were not painted, there were no carpets on the floors and the corridor was full of furniture it was hard to walk through. It was a very scary sight. The moment we open the door to our room a smell of sewage overwhelmed us. The room matched the corridor. The dated wall paper had black stains all over it. The carpet was torn, the room was cramped with sofas and chairs which you wouldn't dare sit on. The bathroom covered with orange and brown tiles smelled so much of sewage we physically felt sick.", "helpfulness": 8, "user": "persson28", "date": "May 10, 2004", "id": 1905586}, {"rating": 1.0, "title": "Failed to honour reservation", "text": "That day we spent as much time as possible outside the hotel as we didn't want to go back to that terrifying room. When we eventually returned to sleep we pushed the sofa against the door ! Do yourself a favour, don't spoil your holiday in Vienna by staying at Hotel Post.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "December 15, 2003", "id": 1518771}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We arrived at Hotel Post at 11.30pm after a 4 hour coach journey from Salzburg, and were really disappointed with what we saw. The lobby of the hotel is extremely dated as is the restaurant/bar area. The communal areas are in desperate need of modernisation. However, the man on reception when we arrived was extremely helpful. Unfortunately for the rest of our stay the reception was manned by unfriendly staff, as was the restaurant.", "title": "Not special", "helpfulness": 9, "user": "vicki1978", "date": "August 10, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 8382903, "likes": {"liked": "— The location", "disliked": "— The poor service"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Our room was fine, very large and was quite well decorated - it was clean and comfortable. Unfortunately the noise from just outside the hotel makes it impossible to sleep with the windows open so it was very hot at night.", "title": "Mixed Views", "helpfulness": 9, "user": "OhGreatOne", "date": "February 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6808181, "likes": {"liked": "— Location", "disliked": "— Overall Look and Furnishing of the Rooms, The Bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Breakfast was terrible - very little choice served in a very small and cramped room. It is also quite expensive compared to much nicer hotels we have stayed at in other European cities.", "title": "Great central location, but some problems", "helpfulness": 6, "user": "freudsigmund", "date": "January 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6594656, "likes": {"liked": "— the central location some 300 meters from the heart of Vienna.", "disliked": "— the noise from the neighboring discotheque."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The main plus point of the hotel is the superb location right in the city centre and is only a couple of minutes from the St Stephensdom cathedral. But I wouldn't choose to stay in the hotel again.", "title": "Okay, but some problems", "helpfulness": 7, "user": "brissie_traveller", "date": "July 23, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 5499767, "likes": {"liked": "— Location", "disliked": "— Poor value for money"}}, {"rating": 4.0, "title": "Great place to stay", "text": "We stayed at Hotel Post for three nights on our honeymoon. This was our first trip to Vienna. As hotels within Vienna quite expensive, we settled on a three-star hotel and were able to get a significant discount on three nights stay. The location is very good, 10-15 minutes walk away from the heart of the tourist area. The staff were very kind, courteous and professional throughout our stay. The breakfast, as described in other reviews, was typical for what we received at other Austrian stops (more than a continental breakfast, but standard North American breakfast items such as bacon and sausages are nowhere to be seen). Our hotel room faced the street and we had no problem with noise.", "helpfulness": 8, "user": "MargaretM61", "date": "May 27, 2006", "id": 5222628}, {"rating": 5.0, "title": "Another wonderful stay!", "text": "My husband and I stayed at the Hotel Post this month for the second time. Again we had an excellent experience. Our room was really clean and we had excellent service.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 23, 2006", "id": 5203618}, {"rating": 4.0, "title": "Great hotel, Great location!", "text": "When my lock broke on my suitcase I took it to the front desk and they were able to get my bag open with no damage within minutes.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 4999223}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "The hotel restaurant is excellent. I loved that they had vegetarian choices on the menu and their breakfast is excellent, with lots of choice in food, juice and comfortable booths and tables.", "title": "Great new year", "helpfulness": 5, "user": "steveokAustralia", "date": "January 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4394538}, {"rating": 5.0, "title": "The only place I'd stay.", "text": "Our room was really large and sunny with a great view of the street below. Our bathroom was in the room and was very clean and spacious. The ceilings were very high and we had 2 huge windows.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 21, 2005", "id": 4129327}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "I definitely look forward to staying at this hotel in the years to come.", "title": "Great Hotel for the money!", "helpfulness": 5, "user": "LotteLondon", "date": "September 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3841371}, {"rating": 4.0, "title": "Toptastic!", "text": "I stayed at the Hotel Post for 3 nights. It is right in the centre of the city, handy for the underground system and all attractions. The room was lovely, overlooking the street, and the buffet breakfast kept you going until lunch. I would definitely stay there again.", "helpfulness": 6, "user": "tralee01", "date": "July 8, 2003", "id": 1131042}, {"rating": 4.0, "title": "Great Place!", "text": "The Hotel Post was a pleasant surprise. I was not expecting much, considering our extremely low room rate, but was pleasantly surprised at not only the comfort and space of our room, but how attentive the staff was. The Front Desk staff was extrememely friendly and knowledgeable. The location is suberb, because its so close to everything but far enough away from the commotion. It is one short block from the Ringstrasse tram and about 1 and half blocks from the Kartnerstrasse which is in my opinion, Perfect. The cafe is also quite good although most of the staff speaks only german. All in all, worth every euro-penny!", "helpfulness": 16, "user": "A TripAdvisor user", "date": "April 11, 2003", "id": 932751}, {"rating": 5.0, "title": "lovely hotel", "text": "I took a trip with my college to Vienna and the whole group stayed in this charming hotel. It is within walking distance of all the sights. The rooms are great and homely. The beds are super comfortable, after a long day of walking around it is great to come back to a welcoming place. They have an old fasioned lift that gives it that extra special feeling. I would reccomend this hotel to anyone traveling to the city. The rates are affordable and worth every penny.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "December 30, 2002", "id": 829595}], "location": {"country": "Austria", "continent": "Europe"}, "stars": 3, "variance": {"poor": 14, "average": 47, "very good": 75, "terrible": 11, "excellent": 23}, "aka": "Post Hotel Vienna", "slim_ranking": 0.613079019074}