{"user_rating": 3.5, "review_count": 1005, "name": "Hotel Riu Florida Beach", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "My wife, 17 yr. old daughter and I stayed here on 06-22-2006 and 06-23-2006. The hotels nice but the room had a musty stale odor. The pool area and beach area were great. During our stay, there was quite abit of seaweed but this is not our normal experience in Miami. The beaches are usually pretty clean and clear. Ocean Dr. was great again and the beach at Ocean Dr. is a muct see. We have stayed at the Riu in Cancun and in Florida. Cancun was great all around, but for the price, the pool and the beach at Riu in Florida it was pretty good. If your a really nit picky person spend more money and go get a luxury hotel.", "title": "Not the best but not the worst", "helpfulness": 5, "user": "TexasSheriff", "date": "July 6, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5432726}, {"rating": 4.0, "title": "there's nothing wrong with this hotel!", "text": "we've just returned from our honeymoon, and the riu florida beach was the last destination on our trip which also included vegas and mexico. Yeah, this hotel wasnt as good as the hotels we stayed in in those places, but it was still absolutely fine. i dont think the people writing all the bad reviews on this site bothered to check it out before hand. either that or they just like to moan.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "July 3, 2006", "id": 5419205}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "the hotel has a nice big lobby, and the rooms are perfectly ok. maybe could do with a bit of redecoration but not because they are dirty, just a bit dated. the pool area is lovely, as it the pool bar. The breakfast buffet is everything you could ask for and more, and the hotel staff were nothing but nice to us, giving us directions, telling us about which tours to do, and letting us use another room to shower in after we had checked out of our room on our last day, for free. i've stayed in plenty of hotels where they have made you pay for this.", "title": "not my favorite place", "helpfulness": 5, "user": "mtnstreamdream", "date": "June 27, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 5393154}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "there are obviously beeter hotels to stay in in miami, but not for this price.", "title": "How did this become a 4 star hotel?", "helpfulness": 12, "user": "Speukes", "date": "June 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 5381682}, {"rating": 1.0, "title": "Beware of dirty rooms, horrible staff, and PARKING TICKETS", "text": "there is a boadwalk at the back of the hotel (which is right on the beach) where you can walk all the way down to south beach. this takes about 40 minutes, but with gorgeous beach and sea views all the way, whats the hurry?! Ocean drive and the art deco district are not to be missed, especially at night. Lincoln road is also worth a visit, about 25-30mins walk from the hotel, its a nice pedestrainised street with shops and loads of places to eat.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 21, 2006", "id": 5372486}, {"rating": 5.0, "title": "More than we ever expected", "text": "We knew nothing about this hotel previously, but booked it because we were able to get a very reasonable rate and it was in close proximity to a convention we were attending. To be honest, we weren't expecting much because we had been disappointed before by wonderful hotel photos on the internet which didn't look anything like the hotel when you arrived.", "user": "Tammyjake", "date": "September 28, 2005", "id": 3944157}, {"rating": 1.0, "title": "CAUTION!!!! THIEVES", "text": "In this case, we were VERY pleasantly surprised. Although it's obviously an old hotel (as it appears most all of the hotels are in Miami Beach), it is VERY well maintained, with a lot of character. Although our room was a bit dated, it was scrupulously clean, so no complaints there.", "user": "A TripAdvisor user", "date": "August 29, 2005", "id": 3814442}, {"rating": 5.0, "title": "Great hotel, will definitaly stay in RIU again:-)", "text": "The hotel staff was the most helpful and friendly we've ever experienced. We were amazed.", "user": "bartekwusa", "date": "July 11, 2005", "id": 3657060}, {"rating": 4.0, "title": "It's just a good place!!", "text": "The pool area is beautiful (lots of palm trees), and even though there are miles of fantastic beach just steps away, it's hard to tear yourself away from the pool.", "user": "A TripAdvisor user", "date": "May 23, 2005", "id": 3494717}, {"rating": 4.0, "title": "Cannot complain about a thing!! (just inspect your car when you leave)", "text": "We ate both at the restaurant by the pool, as well as the breakfast buffet, and all were great and not excessively expensive.", "user": "truesaint", "date": "April 29, 2005", "id": 3424419}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Great hotel which backs onto a fantastic beach . We stayed in room 935 , not a sea view room but it had a nice view of downtown Miami . Room was spacious and modern . No complaints with the room whatsoever . Buffet breakfast was great also , plenty of choice . Buffet dinner bit on the expensive side though . Some reviews reckon its a 20 min walk to Ocean Drive , more like 40 though. Not a lot outside the hotel and it is a fair way out but it depends on what you want . I prefer to be a bit away from the crowds and noise anyway . Pool area was good but oh that beach is only a stones throw away !!!! Overall the hotel had great staff and was spotless clean . Some of the negative reviews on here seem a little unfair by my experiance anyway . One small point , not many Engish in hotel mainy Dutch and German during my 10 day stay . Take a trip to Key West .... Fantastic !!! ENJOY MIAMI !!", "title": "Great Hotel", "helpfulness": 4, "user": "keithpearson1", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 129721557}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "I stayed at the Riu Hotel during the Hip Hop memorial festival May-June 2011. The hotel was pleasant enough. On arrival we were shown to our room we wanted a sea view and were promptly shown a bigger room with a beautiful sea view rather than the construction site of the other one at no extra charge. rooms a little dated but quite adequate. Rooms cleaned daily. Theres a fridge in the room. We stayed on bed and breakfast basis...cant complain plenty to choose from from. As well as an egg station. There a shops including a Subway in close proximity. Staff were very helpful i didn't really notice a language barrier as some have mentioned.", "title": "Id stay here again", "helpfulness": 3, "user": "AudreyM49", "date": "April 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 128516176}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The Hotel backs onto the beach. Buses run right outside and across the road takes you to Ocean drive and Washington St where you'll find lots of Bars, Clubs, Shops and Restaurants including the famous wet willies.", "title": "Absolutley Amazing!", "helpfulness": 6, "user": "Kelly M", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127470618}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Nothing can prepare you for the event that is Black Beach weekend. So if you dont like huge crowds of people, Hip Hop blasting from sound systems and cars. Men calling you every other step you take and paying extortionate prices during that period...Don't go during the memorial weekend.", "title": "excellent staff. excellent location", "helpfulness": 3, "user": "Andrew W", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127288968}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "But overall it was an experience...I like new experiences, so at least i can say I did it, but i wouldn't repeat that one.", "title": "Great location, not so great hotel!", "helpfulness": 2, "user": "damiengibson", "date": "April 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127159908}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We have just returned from a two week stay at the Riu. The hotel is very clean and the staff are hard working. Everyone there ensured that our stay was pleasant. The location is fantastic, although maybe a little too far north. It is a not a long walk to SoBe but it is a hot one, so it's better to get a cab. The shops on Lincoln Road mall are very expensive, better to browse than buy, and the bars are dearer (apart from Van Dycke Cafe) we were bothered three times in five minutes to pay a tiny two drink bar bill at one place. The real placeto be is South beach, check out the News Cafe and people watch.", "title": "Great Holiday.", "helpfulness": 3, "user": "southbeachgirl", "date": "August 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 8446944, "likes": {"liked": "— Rooms serviced quickly, staff very hardworking, pool staff meant no towels on sunbeds.", "disliked": "— Elevators extremely old and slow used for both staff and guests. Only two in hotel and one was out of order for 4 - 5 days."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had two lovely rooms at the Riu, although not adjoining as requested. There is a lot of work going on in the general area but it is not too noisy. The whole area is being regenerated at the moment.", "title": "Better than I expected.....lovely", "helpfulness": 8, "user": "Jaz109", "date": "July 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 8139213, "likes": {"liked": "— Location", "disliked": "— Staff MONICA so called Supervisor"}}, {"rating": 5.0, "title": "the best holiday ever!", "text": "Francois the pool guy is great, with a quirky sense of humour, just make sure you take care of the towel tokens!!", "helpfulness": 6, "user": "elizi", "date": "June 23, 2007", "id": 7970176}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Breakfast was great especially the freshly made omelettes and fried eggs (cold egg always lets down a buffet breakfast). Only one moan, breakfast is too European, catering mainly for Germans (who make up the main guest base), cold meats, grated carrot, onions and fish, sweetcorn and chicken - to go with the bacon and eggs!! No baked beans in sight - surprising as they are an American staple.", "title": "Great View", "helpfulness": 3, "user": "rg81", "date": "June 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7958981}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Fantastic holiday, only spoiled by the rudeness of guests from one certain nation.", "title": "Very happy with our stay...", "helpfulness": 23, "user": "SummerSR", "date": "May 28, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7710340}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My girlfriend and I stayed at RIU for a weekend in January. I got the room at a Hotwire discount rate of around $105 plus tax per night. Much lower than any other comparable hotels I could find in Miami Beach. We found the hotel to be very charming, especially the lobby. It had a very classic 1930s feel to it. The staff at the front desk always seemed swamped but treated everyone fairly and friendly. Definitely worth giving specific credit to their service. The rooms were very standard. One oddity, we were given a room with two double beds. I phoned down to reception and was told that the entire hotel only has 3-4 rooms with king size beds. Finding this odd, I went downstairs personally and asked a different staff member, but was met with the same answer. Not a huge impediment to our weekend, but odd nonetheless. I also noticed that half of our floor was blocked off for renovations, so it would appear that the property is taking efforts to update. The view from our room at one angle was a lovely view of the ocean, but at the other angle was the shell of the building next door that is under construction. Our discounted rate did not include breakfast so I cannot comment on that. But I would suggest trying the Front Porch Cafe down near 15th and Ocean drive!", "title": "Great Value Option in Miami Beach", "user": "rocketsfan007", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125551014}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Honestly we did not spend much time in the hotel during our stay, and did not take advantage of the pool or beach access. But upon check out we went out there while waiting for the car and were pleasantly surprised how nice the pool area was. The beach access was also convenient, and it appeared you could rent chairs from a vendor right out front.", "title": "old hotel,needs a complete makeover !", "helpfulness": 4, "user": "gabriela63", "date": "February 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 124913514}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I only had two complaints worthy of mentioning. 1) the first night the shower pressure was hot and cold, literally! It would start out a good pressure with a medium comfortable temperature, then would shift to low pressure freezing cold, and back to high pressure scalding hot! Very dangerous and uncomfortable, but this only happened on Friday night. 2) I had read mixed reviews about the valet service, so came in with an open mind. Much like the front desk, the valets were always over worked and scrambling to get cars. Rarely did a valet greet us to open the doors and take our bags. I generally would unload the car and hand the keys to someone directly. No biggie from my perspective, but others may be used to better service. I would also suggest calling down about 10-15 minutes before you want to leave so they have time to bring the car around. This worked out great for us, except on Sunday morning, when of course every one is checking out.", "title": "Tired", "user": "Carl H", "date": "February 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 124618060}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Overall a great option in Miami Beach, nothing glamorous or fancy. But at this price you can spend all you want on $16 drinks in South Beach!", "title": "Okay hotel and location", "user": "oldflame", "date": "February 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 124401354}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "stayed here for 3 nights,4 days,really bad....my room was dirty and with ants,my advice:stay in another place more confortable........", "title": "Alright hotel, Miami beach... Pictures are probably better than reality...", "user": "cruser123456", "date": "January 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 123906846}, {"rating": 4.0, "title": "Fantastic value", "text": "We were very pleased with this hotel - granted the rooms are not that smart and the decoration is a bit old but everything was very clean and comfortable, the lobby, pool and staff are all lovely and the breakfast buffet was just amazing (although quite expensive!) The free pool towels were very welcome and the housekeeping staff responded immediately when we had a problem with an overflowing cistern! It is a good 20 minute walk from all the action but during the day walking along the beachfront to the art deco area is lovely. If you are averse to noise though make sure you ask for a room high up as the bar in the lobby is very noisy!", "helpfulness": 5, "user": "SophieMidlandsUk", "date": "January 16, 2005", "id": 3010911}, {"rating": 4.0, "title": "Great hotel! Enjoyed!", "text": "I was quite leary of booking this hotel due to the complaints of other reviewers. I'm glad I went ahead and did. The hotel has a beautiful lobby and the pool area is very attractive as well. It is right on the boardwalk and we walked down to the end of it on New Years Eve. The beach area did not appeal to me for swimming but many people were enjoying it. The sand was reasonably clean. Our room was clean, the bed a bit hard for me, but otherwise a nice room. I loved the balcony overlooking the ocean. The staff were friendly and helpful. We did not eat there but ordered out for Pizza and it was great. We had breakfast the next morning at Denny's which is very handy. Don't be afraid to book this hotel, I love the fact that it has balconies, a lot of the hotels on Miami Beach don't! We only spent one night and then went on a cruise on the Norwegian Sun. We were very pleased with that as well.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "January 11, 2005", "id": 3000228}, {"rating": 4.0, "title": "Don't believe the hype.....", "text": "The hotel is fine. Clean, efficient, and reasonably priced. We stayed for 12 days from Dec 27th, and have no complaints about the hotel, its policies or its staff.", "helpfulness": 9, "user": "Mrandyd", "date": "January 9, 2005", "id": 2991152}, {"rating": 1.0, "title": "HORRIBLE CHOICE!", "text": "My only gripe is its location - There are only a couple of decent restaurants within 10 blocks of the place. OK if you have a car; Not so good if you don't have a car or are lazy.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 6, 2005", "id": 2983179}, {"rating": 4.0, "title": "Very nice Family Hotel", "text": "We had reservations to stay at the Riu for two night 12/31-1/2. As we pulled up to the hotel I knew we were in for a surprise. The location of this hotel is horrible. There is one valet and one bellhop. All the employees at the front desk speak another language and the odor in the lobby is horrible.", "helpfulness": 5, "user": "timcooke", "date": "December 29, 2004", "id": 2961172}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Just left the Riu. They have two elevators and one of them has been broken for six months! We booked an oceanfront room and they gave us a room with no view. After getting the correct room which took 2 hours we headed down to the bar for a drink. They had 5 employees working at the bar but they were talking and playing games with each other and it took 30 minutes to get a cocktail. Everyone we talked to at the hotel was complaing about the service and the elevators. This is my third visit to this Riu and it will be my last. I only paid $70 per night and it wasn't worth $50.", "title": "Service Is Awful!", "helpfulness": 1, "user": "sportingreview", "date": "November 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 11047708, "likes": {"liked": "— The Ocean", "disliked": "— The staff"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I'm a huge fan of America and my trip to this hotel somewhat robbed me of my \"US fix\". First of all, the people behind reception don't speak English very well whatsoever, sometimes I did had to pinch myself to remember I was in an English speaking country. The hotel has two very slow elevators and one of them is always broken, be it 1 or 2. The place itself is not actually that bad, the location is not within walking distance of anywhere, especially in the heat, so be prepared to fork out for taxis everywhere you go. I've noticed people complaining about a smell around the hotel, I diden't notice anyting, although the staff talk their time cleaning things up, a kid threw up in reception and it wasern't mopped for nearly an hour. The computers are also a waste of money, I seem to remember it was $7 for 30 minutes! It wasen't all THAT bad despite my review seeming pretty negative, but for a US hotel, it's not acceptable, you can do much better for the same price.", "title": "More like a cheap European holiday", "user": "bilsim", "date": "November 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 4.0}, "id": 10672429, "likes": {"liked": "— that it was so close to the beach", "disliked": "— the fact that English was the second language"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Well for starters only one elevator worked. The bell boy said this was going on for months and it will be at least 4 more months.", "title": "not recommended", "user": "CheeCheePepper", "date": "October 31, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "business": 1.0, "cleanliness": 2.0, "rooms": 3.0, "location": 3.0}, "id": 10470525, "likes": {"liked": "— breakfast", "disliked": "— wireless internet acces only in lobby"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The hotel rooms were nice. Bathroom and towels could be better. Lounge chairs for pool side in the morning could be hard to get. By the afternoon people clear out. The beach was nice but lounge chairs you have to pay for.", "title": "Great Beach", "helpfulness": 1, "user": "tnle", "date": "October 24, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 10299008, "likes": {"liked": "— The beach and location.", "disliked": "— The mildew room and single elevator"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "This Riu is not like the Riu in Aruba, Cabos, or anywhere else so don't be fooled. Pool is small and needs renovating. The help isn't that great.", "title": "I like very much the people there.", "user": "Golduy", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10174859}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The RIU was great. The front desk staff is friendly and helpful. I though the rooms were a tad outdated but it wasn't something to complain about. It was almost good because you KNEW you were in miami with the pink and green decor. I did not think the beds were hard like most people were saying. In fact, it had a very soft mattress cover. I found the room and bathroom to be spotless. I did not have a problem with any fire alarms like one reviewer had. The pool area is THE BEST! Gorgeous. Cute little tiki bar out back. The buffett breakfast was not good. We only ate there once and did not go back. The location is not the best, but it is a short cab ride to the action. The hotel is directly on the beach and boardwalk which was wonderful. The hotel does not have a airport shuttle which it needs desperately. DO NOT TAKE SUPER SHUTTLE FROM THE AIRPORT! GET A TAXI OR A PRIVATE TRANSFER BY LIMO. Super shuttle took absolutely forever. We had to wait at the airport for 20 minutes for the shuttle to arrive, stop at every arriving terminal, stop at every hotel, it was horrible.", "title": "Loved the Riu", "helpfulness": 2, "user": "devilmebettie", "date": "December 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6348404, "likes": {"liked": "— The pool.", "disliked": "— The breakfast."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Very nice hotel and very nice staff. 5 minutes by bus or taxy from ocean drive and jackson road etc Just on the beach! Room clean and spacious. They had given us a nice present for our Honeymoon", "title": "We Have Been For Our Honeymoon", "helpfulness": 1, "user": "ROSCO77", "date": "December 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6330266}, {"rating": 2.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "I stayed in this hotel together with my girlfriend for 14 days. Our first impression was good and the rooms were old but clean. Our room was located at the highest floor.", "title": "Fire station or hotel???", "helpfulness": 4, "user": "AndyPlanet043", "date": "November 26, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 6178665, "likes": {"liked": "— Location", "disliked": "— Service"}}, {"rating": 1.0, "title": "Food Poison at the Riu", "text": "Already after a couple of days went the fire alarm off around 5:00AM, this stopped after a minute and after I opened the door I saw fellow guests halfnaked swearing to the personel; it was a hoax. Can happen...", "helpfulness": 2, "user": "luckyto13", "date": "November 21, 2006", "id": 6159122}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Couple of days later, the same sound... another fire alarm, again, we left the room right away and again personel met us half way and told us it was false. This happened one more time.", "title": "Fantastic staff - Great for a few nights", "helpfulness": 6, "user": "Nibbles", "date": "November 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 6055192, "likes": {"liked": "— The excellent staff", "disliked": "— Immediate location"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed here last week on a business trip. Check in quite quick. Stayed in one of the renovated rooms on the 6th floor (Ocean front, cornerroom). New colors, look fresh. Only thing they forgot to replace was the bathtub. Looks like it dates from the 50's.", "title": "Great again", "helpfulness": 1, "user": "Rich040", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 126274405}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Staff great as always. Lot of them have been working there for the past 8 years at least. which I think is a good sign. Breakfast buffet is one of the best you will find. Live cooking, great variety of breads, fresh fruit, cheese, meats, etc. When having breakfast; find yourself a table on the terrace. Quick service. Bar at the pool is nice. Had dinner in the restaurant once - lot of choices.", "title": "Riu Florida Beach, Fading fast?", "helpfulness": 6, "user": "Sankarmukh", "date": "March 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 125930823}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Is about a 20 minute walk to Lincoln Road. Taxi is about US$ 8. Gym has basic machines (with water and clean towels). Only comment would be that rooms can be quite noisy - but neighbor was one of the business colleagues - not a family with young children.", "title": "DISSAPOINTING RIU.", "helpfulness": 2, "user": "roaminggeoff", "date": "March 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 125881013}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "All together; this is one of the best value for money hotels in SoBe.", "title": "Nice hotel with great views", "helpfulness": 2, "user": "PB6751", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125666508}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "My family of 4 (myself, wife, and two sons aged 11 & 15) stayed in this hotel 5 years ago and was quite happy with it. We originally chose it for the great location--a little north of South Beach (short cab ride or a pleasant walk to Lincoln Road), so it is quiet, but right on the beach. But, we went there this February and it is a different story.", "title": "More a two star, than a four star hotel!", "helpfulness": 2, "user": "StefanBungalski", "date": "March 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 125618368}, {"rating": 3.0, "title": "Not bad for older Miami Beach properties", "text": "Stayed at the Riu in March, 2005. The hotel lobby is nice, and the location is desirable - right on the beach. Given that I got a better rate on this hotel than other similar hotels were going for, I was happy with the situation. But it's a 3-star hotel at most. Much of the area has older properties, so it may be unfair to give it a lower rating. And the staff was nice. So I would recommend it if you get it at the same price or lower for similar area hotels. Otherwise, you may be bitterly disappointed if you overpay.", "user": "blaze4fun", "date": "March 26, 2005", "id": 3303628}, {"rating": 4.0, "title": "Ignore all the bad reviews.", "text": "My wife and I just spent three days at the Riu Florida Beach, and I can honestly say to all review readers, definitely ignore all the negative reviews you read about this hotel. Most negative reviews are written by negative-type personalities that find fault with everything that comes into their lives, and in fact their negativity is what draws problems to them. Veteran hotel and service employees can sense this a mile away, and it ultimately affects how they treat you.", "user": "gpeter52", "date": "March 21, 2005", "id": 3292584}, {"rating": 1.0, "title": "Wouldn't Recommend to My Worst Enemy", "text": "The hotel has an honest three star rating, and is European flavored through and through. If you want 4 or 5 star, then book it, but this one at three stars is clean, reasonably modern, and presents well. If you want everything perfectly painted, carpetted, decorated, then stick to 5 star hotels, and their prices. 90% of the guests, or what seemed like 90%, were German, French, Italian, etc. The lobby is large and picturesque, the service is good if you smile first, the food is fine (breakfast was included with our room), the pool area is great, and access to the beach and boardwalk is right there. You can take this boardwalk all the way to South Beach if you wanted to.", "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3291758}, {"rating": 5.0, "title": "Great View", "text": "We had booked an oceanfront room, non-smoking, with king size bed, but at check-in we were politely offered a corner room, much larger, but smoking, and after inspection with eyes and nose, we accepted their standard oceanfront non-smoking room. It was bright, clean, and had a great view of the pool, and ocean. We were very comfortable, and had no complaints.", "user": "Capecodder411", "date": "March 12, 2005", "id": 3268600}, {"rating": 1.0, "title": "A Riu Dissapointment", "text": "The hotel fronts right on Collins Avenue, so the entrance-way seems less than hilton-like, but once into the lobby, everything scales up nicely.", "user": "bettyz", "date": "February 26, 2005", "id": 3232546}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I read the hotel review through expedia and travelocity. They gave its a 4 1/2 stars on their rating so I thought it is a good place to stay. I didn't know my nightmare started when I walked into the lobby. I checked into the room after waited for the front desk who was busy talking on the phone with her friend. They gave me a room with 2 double beds when I had requested a 1 king bed. It was a smoking room. After agreed to pay extra $20/per night to change to a better room. The new room was so stink, and I also found bugs bed. The wall is so thin that I could hear the man next door blowing his nose and snored through out the night. Before I checked out, they gave me a bill without itemized. I took a good ten minutes to go through the bill. The water bottle in the mini bar which listed for $2.50, they charged me $3.00. Parking is $12/per, they charged me for 5 days instead of 3. I was so happy to check out the hotel, and would never come. I told everyone I known not to book Riu Florida Beach.", "title": "Hated the Riu in Miami", "helpfulness": 5, "user": "jd4590", "date": "October 28, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 6022905, "likes": {"liked": "— The hotel experience ruined my trip", "disliked": "— don't stay at this hotel, it would ruined your trip"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Me and my partner stayed at the Riu for 10 nights in August, after reading the reviews before we went i was a little worried about the hotel, But as soon as i got there my worries were gone. Almost everything was great, especially the pool area and how close it was to the beach. The location was great too only a 20 min walk to south beach, great when venturing out for a meal or a night out. The only thing i can say could be better are the rooms, they are a little old, but they were always clean so that didn't bother me.", "title": "Great hotel, Great location!", "helpfulness": 7, "user": "GGHG", "date": "October 27, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 6017167, "likes": {"liked": "— Location", "disliked": "— Rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "The staff are friendly, while we were there there was a tropical storm, so we had to stay indoors for a couple of days, as soon as the sun was back the staff had everything ready and we were sunbathing within an hour.", "title": "Rooms are in desparate need of renovation !!", "helpfulness": 12, "user": "hessenlady", "date": "October 6, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 5923110}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I loved Miami, make sure you go to the Florida Keys as well it's a great day out. I can't wait to get back there.", "title": "Good Hotel, Average Location", "helpfulness": 4, "user": "Seanjl", "date": "October 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 5896167, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Hope everyone enjoys it as much as i did, have a great time!", "title": "would stay again", "helpfulness": 17, "user": "jewelsoftravel", "date": "September 14, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5801920}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Read many unhappy reviews but was pleasantly pleased. The RIU is a Spanish owned company and operates with a European style. A little slower, but staff were very pleasant. This is an older 1950's hotel with a nice lobby, gorgeous pool, pool bar and right on the beach. 90% of the guests were South American and European so some Americans may feel uncomfortable, but we found the clietele nice looking and sophisticated. The buffet breakfast ($12) and dinner($20) in the restaurant were awesome and a great price considering South Beach. Drinks were inexpensive by SoBE standards.", "title": "Great Value at the RIU", "helpfulness": 16, "user": "galvestonboys", "date": "September 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5790469, "likes": {"liked": "— Pool, great staff, and sophisticated Euro/South American clientele", "disliked": "— Update rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The room was Holiday Inn (not Ritz Carlton) and could use a little updating, but was otherwise clean, cool, and comfortable. The location is about 1 mile from the action on Ocean Drive, so an easy drive, frequent city bus, cab, or even a walk-unless, of course, you are the typical American. For the price, we consider the RIU a hidden SoBE gem with a fabulous Euro-South American flair.", "title": "Great Experience", "helpfulness": 14, "user": "Trek8000", "date": "August 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 5712852}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Satyed two nights in August before heading out on a cruise. The hotel was full of friendly people willing to help. The pool and beach area were great. The rooms were clean (sure they could use a face lift but they were clean with the right amenities) and the airconditioning worked well.", "title": "Room just average, bad location", "helpfulness": 6, "user": "shelter", "date": "August 11, 2006", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 2.0, "value": 2.0, "rooms": 2.0}, "id": 5601405, "likes": {"liked": "— The ocean view.", "disliked": "— The area of town."}}, {"rating": 4.0, "title": "for the basics \"and some\" stay here", "text": "A most enjoyable experience!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 27, 2006", "id": 5518753}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We spent 2 nights here in July 2006. The room was small and smelly, little bathroom with a stained bathtub. The pool area looked nice and the ocean view was great but the beach just ok.", "title": "one night stand", "helpfulness": 8, "user": "tropical_travels", "date": "July 22, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 2.0}, "id": 5497126, "likes": {"liked": "— price / pool / beach", "disliked": "— appearance"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We stayed at the Riu for 4 nights & 5 days. The staff was very nice. We had breakfast a the hotel every morning which was very nice. There was a lot of chooses & you could have your eggs made any way we wanted. We only had dinner there once, & that was also very good. Our room was ocean veiw & was very nice, the room was a little mustly smelling, not not to bad. We just opened the door to the deck. The pool area also nice & we could walk to the beach if you wanted. The boardwalk was also a plus you could walk on the boardwalk instead of the beach. Our flight did not leave until 8:00 pm, the hotel said we could stay the day & just leave our luggage in a room up front & they would let us used a room to shower up in when we wanted to leave(at No charge). If you like to walk it was very nice, parking was hard to find. We left the car at the hotel most of the time, unless we were traveling a big distance. If we go back to South Beach, yes I would stay here again.", "title": "Nice place & good location", "helpfulness": 11, "user": "Rick and Diane C", "date": "April 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3420260}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "I agree with reviewer who said that anyone who had a problem with this hotel, has a problem themselves. The rooms were clean, and the service was fine. It is very Spanish speaking, it is Spanish owned but all of Miami is as well.", "title": "This is a good hotel - don't believe the knockers", "helpfulness": 25, "user": "notalamb", "date": "April 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3401090}, {"rating": 4.0, "title": "Don't listen to the bad reviews", "text": "The hotel reception is a beautiful area. They looked after the fabulous pool very well. Usual scrabble for beds in the morning, especially as there are a lot of people from the new Pope's country. The beach was in front, simply walk out of the pool area onto the boardwalk and the very clean beach is there.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 7, 2005", "id": 3342829}, {"rating": 3.0, "title": "Nice hotel", "text": "Only downside was that there were few restaurants within walking distance, but with the taxi fare to Art Deco district or Lincoln Road Mall being $6, who cares. This is no wild hotel, go to South Beach for that, and it isn't four star but you aren't paying $200 per night. If you are looking for a nice place in Miami Beach, this is it.", "helpfulness": 9, "user": "ManchesterUKTraveler", "date": "April 4, 2005", "id": 3329540}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "This opinion is from a family of Brits who holiday around the world all the time. We know bad when we see it and this place really is OK. I gave it 5 stars to counterbalnce the absurd 1 stars other reviewers have unfairly given. I really rate it a 4 star on the Trip Advisor scale.", "title": "Relaxing Retreat", "helpfulness": 13, "user": "citigorich", "date": "April 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 2.0, "service": 4.0}, "id": 3326588}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Well let me just say that this was one of the best and friendliest hotel experiences I have ever had.", "title": "We absolutely loved this hotel! fantastic value, extrodinary tropical property", "helpfulness": 25, "user": "pamelaroad", "date": "November 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4144540}, {"rating": 3.0, "title": "Ok hotel", "text": "The hotel itself is located on the corner of 31st street and collins ave right next to The Palms hotel.", "helpfulness": 6, "user": "Ceomhar", "date": "November 9, 2005", "id": 4101231}, {"rating": 5.0, "title": "Awesome Service even during a hurricane", "text": "Now the rooms are a bit simple (holiday inn like), but the hotel property, restaurant, lobby and beach are incredible. The value for your dollar here goes extremely far compared to what else is offered on South Beach.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 26, 2005", "id": 4055032}, {"rating": 4.0, "title": "good choice", "text": "WE were about 10 blocks off the action, but right behind the hotel is the boardwalk that you can walk right down to the action. If you don't want to walk, you can take the bus that drops off right in front of the hotel for $1.50 each way. Valet parking is only $10 a day which is a steal for South beach.", "helpfulness": 20, "user": "Pedro", "date": "October 13, 2005", "id": 4020367}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "About the Pool and tropical garden out back...all I can say is WOW!. Even after the hurricane it was beautiful, relaxing and all included with your stay.. lounge chairs, towels are included unlike other properties. There is even a pool bar, bathrooms, shower and hammocks hanging from the palms in the grove they have created in the back of the property.", "title": "What a really great family hotel", "helpfulness": 22, "user": "Nomad_Nortman", "date": "October 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3998029}, {"rating": 1.0, "title": "Dirty, Dirty, Dirty", "text": "Spent one night in Feb at the Riu. The boat show was in town and rooms were hard to come by so stayed here one night despite the negative reviews. The place is DIRTY. A fresh coat of paint on the outside makes it presentable but don't be fooled! The carpeting was so gross we kept our shoes on. THe blankets were full of cigarette burns (we were in a non smoking room). I took extra sheets off the housekeeping cart so that our skin would not come in contact with the blankets or spreads they were that old and soiled. The pool area is lush but again - dirty. The mats on the pool chairs were disgusting they had so many stains. You are allowed only one towel per person and they were small. We ate at the pool bar - the food was medicore at best. The beach in front of the hotel was littered with bottle caps and cigarette butts. The beach rental chairs were $5 - for a plastic chair with no pad. I would NEVER stay here again. It needs a major renovation.", "helpfulness": 8, "user": "klenc", "date": "February 25, 2005", "id": 3230515}, {"rating": 4.0, "title": "Riu was just what we needed", "text": "My wife and I just got home from the Riu Miami Beach. We were suprised at how nice the grounds and beach were. They got us in 2 hours before check-in and gave us a great room with a two-sided balcony that had a great view of the ocean and pool. The room was big enough and had a king bed.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "February 15, 2005", "id": 3193092}, {"rating": 4.0, "title": "Nice Hotel", "text": "The pool, semi-private lagoon beach and grounds were the best. They added fresh sand to the pool area the day we arrived. They seemed very attentive to details.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 6, 2005", "id": 3166616}, {"rating": 1.0, "stay_parameters": "Stayed January 2005", "text": "The location was great as you could walk the boardwalk down to South Beach or the sidewalk to Lincoln Rd.", "title": "I just don't get this hotel - So terrible", "helpfulness": 11, "user": "JoshLu H", "date": "February 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 3106318}, {"rating": 2.0, "title": "Sent us to other hotel although room was paid already", "text": "They didn't do a great job with wash cloths and towels but they called to check on us and corrected the problem quickly. We'll be going back to a Riu resort soon.", "helpfulness": 4, "user": "traveller_spain", "date": "January 23, 2005", "id": 3026464}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Booked Hotel through Virgin, nice enough hotel paid $20 extra per night to upgrade to a seaview room, valet parking a nice touch but $14 a day. Pool and Bar nice but terrible location for anything else, in middle of nowhere, need a taxi to get to restaurants if you want a drink with your meal. Beach not as nice as gulf coast - for price would recomemend St Pete Beach as a lot nicer and cheaper - personally not worth what we paid. Stayed for 5 nights from 1 Oct 07.", "title": "Nice Hotel - Rubbish Location", "helpfulness": 1, "user": "jbinns79", "date": "October 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 10149668, "likes": {"liked": "— Clean Room", "disliked": "— Location"}}, {"rating": 4.0, "title": "We liked the Riu", "text": "We stayed at the Riu for two nights from Sept 19th as part of our 2 week tour of Florida. It was one of the best hotels on our trip and the most expensive. The staff were helpful and friendly. We upgraded to a sea view room with balcony for an extra $20 per night, and payed for valet parking at $14 per night. The pool and tiki bar were nice, and the buffet breakfast huge - chef cooks omelettes etc. to order. On arriving at our room we went straight out onto the balcony, which had just been painted. The painters tried to warn us but we got paint over our clothes. We didn't complain though. I got the paint out of my shorts but Sue still has paint on her clothes. The beach is lovely here, with man-made rock breakwaters where people catch fish in the evenings.The beach drops steeply into the sea though. Only one lift was working so there was a bit of a queue.The walk into town along the board walk is pleasant enough and patrolled by security on cycles. There are a few strange people along there, could be alkies, but we had no trouble. 17th street (Lincoln Mall?) has all the shops and eating places you would want. We dined in one place down there, with a free bottle of wine thrown in for only about $20 each - the chapest dinner all holiday! So, all in all, with its ups and downs, we had a lovely time there. I would go back for a longer stay if I could afford it.", "helpfulness": 2, "user": "philnsue", "date": "October 13, 2007", "id": 10072896}, {"rating": 2.0, "title": "Don't use the telephones to call home", "text": "We arrived at the hotel at 4pm to find a short que. We were soon seen to by a very helpful lady called beau and ask for a room with a sea view and were given this for 20 dollars a night, a discount of 10 dollars per night on the usual price. Our room while small was lovely, it was on the top floor which I was also pleased about. The room had 2 double beds, not the most comfy but not the worse I have slept on. The air con was fantastic as was having a fridge in the room. Also the hair-dyer was brilliant by hotel standards.", "helpfulness": 3, "user": "svvt", "date": "September 6, 2007", "id": 8664554}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The pool area was very pretty however very very very busy, hense we never in our 2 week holiday took a dip. The beach was lovely regardless of what other people have said on this site its like being within a postcard. While it may have a little sea-weed in it (but what do people expect its the sea after all) it was lovely and warm and very blue.", "title": "SEPT 07 Trip - Skip RIU - it will disappoint", "helpfulness": 5, "user": "DrJScott", "date": "September 3, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 8614841, "likes": {"liked": "— ??", "disliked": "— room"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We ate dinner in the hotel on various occasions while not brilliant it was cheep enough. The lifts within the hotel were terrible. The staff used the same lifts for moving various bits of bedding about and god knows what. On more than 10 occasions there was only 1 lift working and myself and my partner had to walk the 10 floors to our room. Staffs attitudes were indifferent if not difficult on most occasions. You would be speaking to a member of staff about a subject then the member of staff would break of conversation and begin to have another additional conversation with thier colleague in another language, quite rude.", "title": "We expected something better", "helpfulness": 4, "user": "rawaspecial", "date": "September 1, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 8603395, "likes": {"liked": "— Pool area, beach and sea", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Finished our USA holiday with 2 night stay here. Very happy with our choice it is classed as south beach but is not actually in the heart of south beach which i think is a good thing as it is crazy down there! but a bit more chilled around the hotel. The room was lovely, bright and modern it looked like it had recently been refurbed. It had a fridge which was handy for keeping drinks cold.", "title": "Another lovely Riu Hotel", "helpfulness": 5, "user": "Norwich_Tractor_Boy", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130923045}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Free wifi in the lobby was handy and we enjoyed the buffet breakfast which were reasonable prices for Miami ($14) BIG TIP - if you are going to the airport the public bus stops right outside the hotel and charges $2.50 each , the hotel charges $15 each to go on a bus, as the say in America - you do the math!", "title": "Again a happy stay at Florida Beach", "helpfulness": 4, "user": "Eugene_033", "date": "May 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 130621192}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This was our 5th visit in 7 years to this hotel and every time we had a good stay. The rooms are almost al refurbished with new paint on the wall and new carpet on the floor. We even noticed some changes in the bathroom! The people at the reception where as kind as always. WiFi is still not for free 24/7 but you get 90 minutes for free every day. And.....now they have WiFi in the rooms as well. But if you are on the beach or at the pool, you can use Free WiFi from the City of Miami Beach! We did not went to the pool, i still hate those people who leave their towels at 7 in the morning and come back at 10 to have a good spot! I still think this should not be tolerated! We always went to our friend Carlito at the beach. Rented two beds and an umbrella for $25 a day! That was perfect for us. Also unbelievable but still possible...you can eat outside (breakfast and dinner) but there is not a smoke free zone!! As a non smoker i find it discusting to enjoy my dinner while people are smoking in the area! RIU do something about this!!", "title": "Wonderful hotel!", "helpfulness": 4, "user": "lula2210", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130611645}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Unfortunatly parking space is a problem at Miami Beach but we used the Hotel Valet Parking. It's $20 a night (cheap compared to next door Palms which charges $36) but waiting almost every for 15-25 minutes for your car is not good! Altough the guys from the Valet Parking did their best to get your car asap i find this a minus point and hopefully this will solved soon.", "title": "Value for money", "helpfulness": 2, "user": "familyschneiders", "date": "May 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 130222022}, {"rating": 4.0, "title": "Frendly service!", "text": "We stayed 16 days at the Riu and we had a great time! Looking forward to visit the Riu again!", "helpfulness": 2, "user": "Ordinolau2", "date": "May 16, 2012", "id": 130068862}, {"rating": 1.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "Stayed here for 3 nights and have to say it was MINGING. No way a 4* the room was a 80's deco. Full of Germans and food was for them only. We had left loads of loose change in the pull up arm rest that locked in the car for all the dam tolls and never gave it a thought leaving it in the car as it was vallet service at hotel but when we got car back the next day it had all gone. You hand the key over to them to park your car so he had the key to unlock armrest bingo money gone.", "title": "Needs major updating", "helpfulness": 2, "user": "1foxyminx", "date": "January 1, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 12208173, "likes": {"liked": "— Leaving", "disliked": "— everything"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "To be honest I can't think off 1 positive about this hotel and would not recomend this hotel at all it was minging", "title": "Don't believe all the bad reviews, but don't believe Riu's 4 stars either", "helpfulness": 4, "user": "TorontoMinded", "date": "December 31, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 12116562, "likes": {"liked": "— location, nice lobby", "disliked": "— apathetic, poorly managed staff, cockroaches"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "My wife and I booked a room at a good rate at this property over the Christmas Holidays 2007. We were spooked by all the bad reviews, particularly because RECENT reviews are particulary consistent in their negative comments, but since our travel plans were extremely last-minute we booked an available \"OceanFront\" room here anyway.", "title": "Awful Ruined Holiday", "helpfulness": 2, "user": "Ffoxylady", "date": "December 28, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 12006567, "likes": {"liked": "— Leaving", "disliked": "— Booking To Stay In It"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Despite its four-star claims, this property is clearly no more than a THREE star property- clean and in a decent location (see below), but with some real problems. Those prepared to put up with a few inconveniences won't mind their stay here. Those seeking a four star experience, or expecting a similar level of care or quality as you would find at other Riu properties should DEFINITELY look elsewhere.", "title": "2 star posing as a 4, and failed miserably", "helpfulness": 2, "user": "TrippinCowboy", "date": "December 27, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 11975840, "likes": {"liked": "— Nothing. Zip. Zilch.", "disliked": "— Too many to list."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "LOCATION: For us, perfect. A 20 minute walk down Collins Ave or the boardwalk along the beach. This is a quieter stretch of the main beach/hotel street. This was perfect for us, as the beach up at 31st is as beautiful as it is along Ocean Drive, and we appreciated the quietness.", "title": "ok ish....", "user": "tillypoppy", "date": "December 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 11948064, "likes": {"liked": "— room"}}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 3, "variance": {"poor": 117, "average": 234, "very good": 393, "terrible": 95, "excellent": 166}, "aka": "Riu Florida Beach Hotel Miami Beach", "slim_ranking": 0.489795918367, "description": "This 10-story building is located on the oceanfront in South Miami Beach. Provide limited parking at an additional charge. We are only a 20-minute walk to the Art Deco district; 7.5 miles from downtown Miami, 3.1 miles from a variety of shops, and 11 miles from Miami International Airport."}