{"user_rating": 4.0, "review_count": 141, "name": "Hotel Cardinal", "reviews": [{"rating": 4.0, "title": "Very French!", "text": "When we arrived the staff was very nice and we got our room right away. The locatiion is perfect for touring Aix-en-Provence on foot. A beautiful city that should not be missed. It was decorated in typical old French furniture that was charming. Beds were comfy and the room was mostly quiet. My friend was awakened by an arguement in the street.", "user": "CSturgeo", "date": "September 28, 2010", "id": 81397094}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Our room had a rather odd bathroom situation. The door into it was only about 5' 9\" and any regular sized guy would find it a nuisance if not dangerous!", "title": "Quiet, friendly hotel in excellent location", "user": "Henobarbus", "date": "September 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 80000786}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We only spent one night here before moving on and when we wanted to pay and get breakfast the poor man on duty seemed to be a one-man show. He did his best but we felt sorry for him. With all his rushing around it is no wonder he is so thin! The air-conditioning promised for 2010 was not yet available nor the wi-fi.", "title": "Okay", "user": "Dutchfemale", "date": "July 13, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 70781437}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "Hotel Cardinal is ideally located for the old part of Aix in a quiet street near the Cours Mirabeau. It's also within fairly easy walking distance from Avignon Centre SNCF station and the bus station. Despite just being down the street from the church of St Jean-de-Malte we were not disturbed by bell-ringing (didn't hear any) even on the Sunday morning. We had a room on the ground floor which was spacious and like, the public areas, elegantly decorated with some original paintings. True, we heard people coming in during the evening, but apart from that the room was very quiet. The breakfast was nicely presented and was what we would expect from a 2* hotel. The staff were friendly and helpful. When we arrived we found a leak from the washbasin and spoke to the guy on reception who investigated it immediately. By the time we got back from dinner it had been fully repaired - I'm always impressed when something's wrong and it's rectified quickly without fuss.", "title": "Historic hotel with beautiful rooms", "user": "socgrad", "date": "June 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69084855}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Only a couple of points to note. Our bathroom had a bath with shower attachment, which isn't quite the same thing as a shower. Secondly, I don't think the room had air conditioning, so it may get a bit stuffy in high summer.", "title": "Better not to choose this hotel", "user": "BerryNi24", "date": "March 11, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 58277314}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stay in hotel Cardinal for one night. The personal is very kind and polite. The rooms are very typical \"french\" style with nothing except for the toilette modern, and this gives a good atmosphere. The only thing disappointed us is that was powderly!!!!", "title": "So typical", "user": "PeterMoscow", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 14876381}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "I studied abroad in Aix-e-Provence and always stay at Hotel Cardinal when I return. You can't beat the location or the price. You can walk to the bus station or train station (TGV station is outside the town center, however, so you'll need to take a bus or taxi into town if arriving that way). The hotel is just a couple blocks from Cours Mirabeau, the center of town. But it is on the quiter side of Cours Mirabeau, so you don't have to worry about a lot of noise.", "title": "Great price, location", "helpfulness": 1, "user": "VUKY", "date": "March 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14496808, "likes": {"liked": "— Location, Price, Charm", "disliked": "— Old decorations"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The decor in the hotel is all antiques, but it's definately \"Provence.\" The staff speaks English and is always willing to offer suggestions and help you find what you're looking for. From my experience, the bathrooms have a bathtub and handheld showerhead--definately takes some getting used to--but it's clean. I reccomend just booking directly through their Web site.", "title": "Beautiful and a great location", "helpfulness": 3, "user": "Rools", "date": "September 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8615347, "likes": {"liked": "— The fantastic water pressure and internet availability", "disliked": "— Basic bathroom"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I envy anyone going to Aix--such a charming town. I've traveled quite a bit and still think it has the best restaurants I've ever been to. Be sure to wander throughout old town. You'll stumble upon great shops and cafes! It's a very walkable town, so even if you get lost, it's easy to find your way back.", "title": "Great location -strongly depends on the room", "helpfulness": 3, "user": "Provence2007", "date": "July 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 8034184}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We have just returned from two days at the Cardinal Hotel. We booked over email with no French and the staff were incredibly helfpul, especially Paulo, who was kind enough to lend the hotel iron.", "title": "Enjoyed the Cardinal", "helpfulness": 5, "user": "Jonathan_68", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7711229, "likes": {"liked": "— Location", "disliked": "— Room size"}}, {"rating": 5.0, "title": "The Hotel Cardinal Aix-en-Provence", "text": "I recently stayed here on a 6 day visit to Aix and absolutely loved it. Set on a quaint historic street near a beautiful church, it was the perfect place for me and my 2 best friends from college. Great location and 3 blocks from the Cours Mirabeau, the street is quiet and very well lit. Madame Bernard and her staff are absolutely delightful and very helpful...the morning breakfasts are wonderful with coffee and croissants served on a silver tray at your table while listening to classical music playing softly overhead. The hotels in Europe are old and quaint, you either like this or you don't. This one is wonderful, clean, lots of character and I would return here in a heartbeat if I could. If I get to travel to Aix again, I would only stay here!! Thank you Madame Bernard, Allan, and you entire helpful and kind staff for a wonderful stay.", "helpfulness": 3, "user": "ohioAnnie", "date": "May 8, 2007", "id": 7565812}, {"rating": 1.0, "stay_parameters": "Stayed April 2007", "text": "Just got back from Provence. Me and my wife we stayed at this hotel for 2 days during our stay in Aix.", "title": "Depends from room you get", "helpfulness": 5, "user": "dottorsocrates", "date": "May 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 7487855}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I got a terrible room (no.20) at the top floor. It was very old and very small, with a dusty moquette and a tiny, old and dark bathroom with linoleum on the floor.", "title": "4 night is 3 different rooms!", "helpfulness": 6, "user": "LadyAstur", "date": "January 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6640910, "likes": {"liked": "— Breakfast, location", "disliked": "— bad rooms, relaxed cleaning"}}, {"rating": 2.0, "title": "Friendly, very French but odd", "text": "Ok we knew we reserved a two star hotel so we never expected a four seasons but this was too much.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 17, 2006", "id": 4628557}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "In case you get room number 6,12 or 20, our friends rooms, well the judgement changes a bit and I would give a Okay with some problems.", "title": "I can recommend wholeheartedly", "helpfulness": 17, "user": "nhtourist", "date": "February 1, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4407759}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "Booked by e-mail. Quick, easy... perfect !", "title": "Fine", "user": "jcdarocha", "date": "February 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55064860}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Location is perfect, in the center, just near by \"Cours Mirabeau\"", "title": "Good stay in Aix en Provence", "helpfulness": 1, "user": "cinzia.sole", "date": "July 19, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 35124319}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Hotel and room are clean. The wall had some dark mark... i do not know where is that from...", "title": "Great location", "helpfulness": 4, "user": "Volanges", "date": "September 24, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 20338076, "likes": {"liked": "— Location; views from the room, artwork on the walls", "disliked": "— Quality of mattress and sheeting; cleanliness"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "You have to leave at 11h30..... and it's not 11h31. If you are late, the hotel will call you and ask you to leave in less than 15 mins.... without the smile", "title": "Lovely room (number 8)", "helpfulness": 4, "user": "Lizziebubs", "date": "September 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 19596250}, {"rating": 1.0, "stay_parameters": "Stayed May 2008", "text": "We stayed in Hotel Cardinal for one night with my husband and my 18 months old child. We made a reservation directly to the hotel through internet and it was quick and easy. The hotel is beautifully located right in the center of Aix en Provence, in a very peacefully road. We parked our car in a private parking very close to the hotel, but at night we found a place right in the street. The hotel is very small and besides being only a 2 stars is very nicely decorated and has that french touch. we had the room nr 6 on the first floor. There is an elevator which was very useful for the baby poussette. Our room was nearly 15-20m2, with one bed bor the child and a double bed for us (though a french size I guess). We had one window on the back and the room was very quiet..perfect! The bathroom was big and kind of newly decorated. We did not have breakfast but saw at the entrance small tables for it. The staff was nice and welcoming. We paid 70€ for the room for the night and was very happy about it. If ever we'll go back to Aix, for sure we will consider popping by again.", "title": "Avoid", "helpfulness": 3, "user": "London002", "date": "June 21, 2008", "detail_rating": {"service": 1.0}, "id": 17099965}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "variance": {"poor": 10, "average": 19, "very good": 56, "terrible": 5, "excellent": 51}, "aka": "Cardinal Hotel Aix En Provence", "slim_ranking": 0.0882352941176, "description": "Typical XVIIIth century Aix-en-Provence style Hôtel. Situated in the heart one of the most gorgeous areas of the city center : Quartier Mazarin. Between the \"Quatre Dauphins\" fountain and the XIIth century \"Saint Jean de Malte\" church and the Musée Granet, our hotel will surely help you immerge in the wonderfull athmosphere of our town, its history, its culture and its traditions."}