{"user_rating": 4.5, "review_count": 288, "name": "Hotel Grodek", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "This hotel was a wonderful surprise! When we arrived, the road leading to hotel was under construction making us apprehension. In 21 day our trip, the Hotel Grodek was our favorite. It is a charming hotel with a great location. Rooms are small but lovely , comfortable and clean. Enjoyed our both our breakfast and dinner. Staff is friendly and helpful. We would definitely stay again and recommend it to others.", "title": "Wonderful Hotel", "user": "LivvyRose", "date": "June 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113526416}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "Wonderful accomodation. This is a lovely, charming hotel with a great location. Rooms are not too big but beautiful and clean. Breakfast is delicious and so is dinner if you decide to eat at the restaurant. Staff is extremely helpful and nice. The city is just beautiful with the snow, although temperature was very low (-15 C) in December. I would definitely reccomend this hotel for a romantic  week end", "title": "Excellent hotel", "helpfulness": 1, "user": "ss1972", "date": "May 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 109350562}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Great place, central, lots of character, modern, reasonable price", "title": "Excellent hotel, historic building nicely done up", "helpfulness": 1, "user": "psinner", "date": "April 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 104625115}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The hotel is in the heart of the old city, on a quiet dead-end street. The staff were very helpful in advising on everything from the weather forecast to the various options for visiting Auschwitz. We found the room a bit small but comfortable, with a superb bathroom (shower only). The towel drying rack was useful for damp clothes when we came back from a rainy day of touring. The most impressive aspect of the hotel is the restaurant, which in good weather opens onto a lovely small patio. The menu is extensive, the food carefully prepared and served, and the tables spaced to allow for quiet conversation. There is a good wine list at reasonable prices. The breakfast buffet was generous and attractive. Our only small complaint is that the bed has a very soft mattress that provides little support. If this small hotel has space available, snap it up.", "title": "Location and Food", "helpfulness": 2, "user": "PierCove", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 104281858}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I was impressed by both the city of Krakow itself and by the Grodek Hotel.", "title": "Just perfect", "helpfulness": 4, "user": "from_moscow", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102277173}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Krakow is perfect location to go and shop have exelent meals and go sightseeing. You must go and see the Salt mine, but remember it is a LOT of steps to go down and the elevator for the trip up was very small.", "title": "Perfect locataion, nice breakfast, exelent fresh coffee, good service", "helpfulness": 1, "user": "NorwayLilly", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 101524363}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Really loved our stay in Hotel Grodek - the location is perfect, just 2 minutes walk from the main square, and also right beside the Jewish Quarter, so it's an ideal spot from which to explore the city. Our room was lovely, a decent size with a very spacious, modern bathroom. The restaurant was also well worth a trip for dinner, food was delicious and reasonably priced. Only downside was the room was very warm, so much so, it was uncomfortable at night, we tried to adjust the temperature switch in the room, but it made no difference. Other than that, we loved everything about Hotel Grodek and would absolutely recommend it to a friend.", "title": "Lovely, cosy hotel in a fantastic location", "helpfulness": 4, "user": "dubhig", "date": "February 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 95888877}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Loved this warm and spotlessly clean hotel. Great location, just a few minutes walk to the main square. On the breakfast buffet there was a good choice of fresh fruit, cereals,cooked meats and cheeses but we opted for the freshly cooked bacon and eggs every morning. The small library bar was cosy and intimate with a real log fire and comfy leather settees. The service was very good we never had to wait more than a few minutes for drinks. The bedroom was large and nicely furnished with a decent sized bathroom and also very quiet even though there was some renovation work going on next door to the hotel. All in all we could not fault this small hotel and we are really looking forward to going back.", "title": "warm and cosy boutique hotel", "helpfulness": 3, "user": "CHIVS", "date": "January 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 91867143}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We're usually weary of reviews with 5/5, but this hotel really deserves it. It's location is brilliant, 5 mins from the main square, which in the cold weather over Christmas was perfect, the food in the restaurant is DELICIOUS and well worth eating at. The service was superb, the room was lovely and very comfortable. We would very happily recommend and/or return to this hotel. It made our Polish Christmas.", "title": "A hotel deserving of such a high rating!", "helpfulness": 1, "user": "Holidays_lover052", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91085218}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We really loved this hotel - the location was perfect - it is a little difficult to find when you arrive but trust my advise go right down to the bottom of Sienna Street ( just right of St. Mary's Church ) -Na Grodku Street is literally across the street facing onto the park. The Hotel staff are amazing, very friendly and can't do enough for you. Their English is fantastic. The breakfast is brilliant -endless cups of excellent coffee. Thank you Asia ! Book all your tours through reception. We were not disappointed. A drink in the libary bar after a day out is a must! Sitting in front of the log fire was such a treat because it was -15c when we were there. Mr Stanislaw keeps all the fires well stacked with logs.", "title": "Excellent Hotel Staff fantastic!", "helpfulness": 1, "user": "GBK_10", "date": "December 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90473724}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Lovely service they were helpful (booking us a taxi and offering suggestions), very comfortable rooms with a very cosy feel, fantastic location. It took us literally 5 mins to walk to the town square. I would definitely recommend this hotel.", "title": "Comfortable and cosy", "helpfulness": 2, "user": "Rachel_Whales", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116050288}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The water may be a little hard, not the fault of the hotel I'm sure but good to know for washing your hair. Breakfast was lovely but I think the yoghurt should be kept cold instead of just sat on the bench for hours. We had two single blankets in our double bed instead of one large blanket, perhaps this is common in Europe though as we have the same at our current hotel.", "title": "Lovely hotel in an excellent location", "helpfulness": 2, "user": "GingerGreaterLondon", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115961771}, {"rating": 1.0, "title": "A complete disappointment", "text": "Avoid this hotel until October 2011 as there are building works next door, from then on I would certainly recommend it. We really enjoyed our stay. The hotel is an old building which is beautifully restored and tastefully furnished. I had a single room which was adequate in size and had a large ensuite shower room (which suitaed me as I don't like baths!) As the hotel is small, only 23 rooms, there is a personal feel to the place. All the staff were very friendly and helpful at all times.. The breakfast was a cold buffet (no hot food) but there was an excellent choice. The location of the hotel was excellent too. If I return to Krakow I would certainly stay at the Grodek.", "helpfulness": 2, "user": "Francesco C", "date": "July 27, 2011", "id": 115868597}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Came here with high hopes. Stayed one night and left for Sheraton. Construction outside woke me up at 6am and hotel is old, run down and without charm.", "title": "Very Disappointing", "helpfulness": 2, "user": "VATourist097", "date": "July 20, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 115594389}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My first trip to Krakow. The location and reputation of this hotel seemed so promising. While it was a \"nice\" place to stay, the hotel has seen better days. Greeted by a huge dumpster at the lobby door which was there through the entire stay. The lobby and room both are showing wear and tear. The room was tiny compared to the write-up on a \"deluxe double\". The restaurant was just plain bad - both service and the quality of the food.", "title": "Highly Over-Rated", "helpfulness": 2, "user": "mssheilaz", "date": "July 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 1.0, "service": 3.0}, "id": 115568651}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband & I stayed at Hotel Grodek for 5 nights, our stay was really good, A lovely room,comfy bed,very clean, it was so quiet at night and even though there is workmen next door they did not bother us at all, all the staff was very nice & helpful, there is a computer with Internet access for you to use on the 1st floor, which i found great to email our children, in a very quiet little street with only a few minutes to walk to the old town square.", "title": "Fantastic,Elegant,quiet Hotel with a lovely restaurant", "helpfulness": 3, "user": "mumbo", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115412975}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The restaurant is fantastic,we had dinner there one night, the service was great, food was so nice and the price was not bad either, Breakfast each morning was so lovely, Everything you could want including scrambled eggs made to order if you want and lovely fruit salad.", "title": "comfortable boutique hotel", "helpfulness": 1, "user": "juneflyAmsterdam", "date": "July 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115292026}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The sum up do not hesitate to stay at Hotel Grodek your stay will be so good in lovely Krakow", "title": "Still a little gem but the environs need urgent attention", "helpfulness": 1, "user": "GvKl", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115014336}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Kim & Mal Veale Australia", "title": "Hidden gem!", "helpfulness": 2, "user": "galaxykent", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114630145}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This hotel is elegant and comfortable, with good beds and an understated decor of light muted colours and wood panelling. Breakfast is fresh and served in a modern extension with skylights. There is no private parking but when we stayed there we had the luck to find a spot right in front. The location is fine, with the rynek around the corner yet just outside the bustle which will guarantee an undisturbed night.", "title": "Great location & helpful staff", "helpfulness": 1, "user": "EMarcus", "date": "June 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 114310446}], "location": {"country": "Poland", "region": "Southern Poland", "continent": "Europe"}, "stars": 5, "variance": {"poor": 2, "average": 12, "very good": 52, "terrible": 2, "excellent": 220}, "aka": "Grodek Hotel Krakow", "slim_ranking": 0.0254237288136}