{"user_rating": 4.5, "review_count": 258, "name": "Hotel Villa Sonia", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Have to admit that for the view alone its impressive. Its hard to say whats not right but there are many minor things wrong that made its a good stay but feels it has alot more to offer. Keep in mind that this place is popular for local weddings which do look impressive but the downside is that the food on those nights for hotel guests is a lower prority to the staff. Chill and apprecaite the great views as the service is not quick.", "title": "Has Potential", "user": "LennonDMP", "date": "July 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 18316799}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Recently stayed here and agree with reviewers that an Etna view room is essential, there is little point staying here otherwise. The highlight for me other than the view is the swimming pool. Perfect temperature when I visited in June, soft water and little chemicals but still very clean. The food at lunchtime was OK but the service could be slow dependent on who was on duty. Food in the evening was acceptable but wouldn't wish to eat in the hotel every day. Good options available in the village. I used the hotel shuttle bus/car on a couple of occasions and the pick ups back were on time. Hotel clean and quite well run. Although a little old fashioned it functions well and overall I liked it..", "title": "Liked this hotel", "helpfulness": 1, "user": "martinlfc", "date": "July 23, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 18164774}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Villa Sonia was a bit of a disappointment, whilst undeniably very clean, and with a fabulous view of Mount Etna – that is if you are not in a standard room where instead you will get revving mopeds on the road at all hours (not helped by being on a hill), a view of a car park being erected and rock music from the local restaurant if your window is open), it was not quite what was envisaged when the place was booked!", "title": "Not quite what it says on the tin...", "helpfulness": 1, "user": "foxtrot11", "date": "July 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 17399247}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The pool area is small for a hotel with the number of bedrooms it has – you will need to get to the pool area early to get the best spots; the plastic sun-beds are packed in and free, but you will be charged extra for a thin mattress and you are looked on by people waiting for the hourly bus on the road above. If you have a pace-maker, do check the temperature of the pool before you dive in, it is ‘refreshing’ early in the summer season and you will normally have it to yourself. Also you will have to go to the bar to get a drink, the waiter will not come and ask you, nor will he be particularly attentive during lunch. The lunch meals by the pool were certainly nowhere near 4 star standard; we experienced: watery pizza, second rate sea food salads - and small prawn cocktail starters, for which you will pay €12!!! At least the prices were kept in line with 4 star and you will get bread to fill you up with the cover charge! The breakfasts were ok, though do make sure you ask for proper coffee, or you will get instant... (yup!...) The evening meals certainly redeemed the hotel’s culinary skills and were good with a very good selection of wines (the hotel is used for wedding receptions by the locals) – live entertainment is frequently provided in the evenings with a singer and his synthesiser, who loves his job. The general atmosphere around the hotel was not hugely convivial and do make sure your mini-bar is full if you want a drink after 11:00pm or so – the bar will be closed.", "title": "Fantastic Hotel", "user": "ChrisEdinburgh", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17359303}, {"rating": 2.0, "title": "Stunning views of Etna", "text": "Some of the reception staff were very helpful, giving us tips on what to see and to make sure we know the taxi fare before you take one, or you will be charged through the nose and then some. Castelmola has fabulous views, though most restaurants were average to poor, prices still London-like. Taormina is a very pretty town, good shopping and places to see – take the cable car down to the sea, it is very quick and only a few Euros.", "helpfulness": 2, "user": "Masterloucat", "date": "June 25, 2008", "id": 17203821}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "As there are no reviews so far for 2008, I thought it appropriate to say that Villa Sonia proved to be the delight we had hoped for.", "title": "A wonderful find", "helpfulness": 2, "user": "Whitby1964", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16329091, "likes": {"liked": "— The staff", "disliked": "— Sicilian drivers!"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The Superior Etna View rooms were well worth the money. Although dated, in a wonderfully Italian way, the whole hotel makes a great change from the current \"Hip Hotel\" style.", "title": "really ok", "helpfulness": 1, "user": "t_southbound", "date": "November 16, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10849087}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Breakfast was well served, and with a good choice. Lunch on the terrace could be anything from a small snack to a large meal. We only ate \"in\" once but the menu was well priced and with a nice choice of traditional items. The menu changes daily, and with several choices at each course, I can see why some people pick the half board option.", "title": "Top of the World", "helpfulness": 3, "user": "jaybeediamond", "date": "September 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10010011, "likes": {"liked": "— Location, Cleanliness, Spaciousness, Level of Service", "disliked": "— Like all of Europe - they cannot brew tea!"}}], "location": {"country": "Italy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 14, "average": 31, "very good": 63, "terrible": 5, "excellent": 145}, "aka": "Hotel Villa Sonia Castelmola, Sicily, Italy", "slim_ranking": 0.333333333333, "description": "Hotel Villa Sonia is a historic rural home situated in Castelmola in the district of Taormina where a real corner of “Paradise” awaits you. A charming residence surrounded by green vegetation and having as much tranquility as one would desire, ideal for romantic escapes or family holidays. Ensuring your relaxation are its position, structure and the professionalism of its qualified staff, which provide the facilities that enable you to spend all the time you want to, reliving ancient times and rediscovering unique flavours that only a land as rich and generous as “Sicily” can give you. Tradition, love and hospitality for every single characteristic and detail distinguish our rooms and accompany our guests in the best periods of the year. The hotel is set in a unique and silent natural environment, yet just a few kilometers from Taormina and the sea."}