{"user_rating": 3.5, "review_count": 140, "name": "Hotel Luzzatti", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We had quite a bit of mold in our bathroom. We asked if we could get a different room but the employee said he would take care of it and have it cleaned. When we returned to the hotel in the afternoon nothing had changed and he said it was not mold but because of the humidity in the bathroom... and no there were no other rooms available (although there were hardly any people durig breakfast). When we wanted to check out immediately he stated that we had to pay for 2 nights because it was 5 p.m. by then. A long discussion later (in which you could see that there was no interest in us as customers whatsoever) we gave in and stayed for another night. The breakfast that was decribed as such a treat was OK but nothing special.", "title": "\"It's not mold... it comes from the humidity...\" :))", "user": "Dogenwurm", "date": "July 11, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 34450530}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Overall this hotel cost us hours of angry thoughts and trouble. Our remaining night we stayed at the \"Albergo Giusti\" in Via Giusti which was very friendly and very clean!", "title": "Near Historic Rome, quieter side street, close to Termini and Metro.", "user": "Polyglot_xy", "date": "May 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 29346142}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "In retrospect we asked ourselves if we were too picky about the bathroom but the way they dealt with our request was so unprofessional that we feel that these people should work somewhere else but not in a hotel.", "title": "Rather Spartan, but a good experience overall", "user": "PandaPaws", "date": "September 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 20410049, "likes": {"liked": "— Good value", "disliked": "— Peeling paint"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007", "text": "Narrow, vertical hotel with nice staff and the best breakfast of our 3 hotels in Italy. Our room and bath were fine--not over-roomy, but very clean and in very good condition. The value is good--comparable to other prices for the room and breakfast. Upon arrival, we took a taxi from Termini train station because directions were hard to understand and we had bags (10 circuitous minutes, less than $20US). Afterwards, we walked or got Metro day passes. Termini is the best location for any tours you may want to explore by bus, open-air bus, or walking guides. It's also central for city buses; see the info kiosk in the bus-slotted departure/arrival yard in front of the main Termini foot thoroughfare.", "title": "staying in luzzatti hotel, rome", "helpfulness": 1, "user": "pocci", "date": "April 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 7407458, "likes": {"liked": "— it was clean,and we received a very good treatment.", "disliked": "— there was no attention for decoration. the room was too dull."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "I have to preface my comments by mentioning that we stayed just one night at this hotel, and it was the night after we arrived in Rome from California, so anything resembling a bed was looking pretty attractive. As others have mentioned, the hotel is in a slightly seedy part of town, but it seemed safe enough. There was a good gelateria nearby, and it was fun to be in a real neighborhood rather than the usual tourist areas. It is a short walk from the Metro station, on a quiet side street. We wished we had had more time so we could have taken advantage of the pleasant courtyard in the back. Breakfast was fine, though not particularly memorable. The desk clerks and other staff were very pleasant. Our room was on the second floor (what we in the US call the third), and was rather spartan, no luxuries nor decorations. I did comment at the time that it is perhaps no worse to have nothing on the walls than to have some of the trash that passes for decor in many hotels I have visited. The room was clean, and everything was functional, but the peeling paint in the bathroom gave a poor impression. The air conditioner worked a little too well and we weren't able to figure out how to adjust it, so we had to resort to a on or off strategy. All in all, I thought the place was a good value for the money, as Rome seems very expensive.", "title": "Hated the Luzzatti", "helpfulness": 2, "user": "kersan", "date": "October 11, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5943213, "likes": {"liked": "— nothing at all", "disliked": "— the disgusting level of cleaning"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Booked thru Venere.", "title": "dump", "helpfulness": 2, "user": "staninottawa", "date": "September 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 5881070}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 2, "variance": {"poor": 11, "average": 28, "very good": 65, "terrible": 7, "excellent": 29}, "aka": "Luzzatti Hotel Rome", "slim_ranking": 0.485826771654}