{"user_rating": 4.5, "review_count": 680, "name": "Hotel Belvedere Bellagio", "reviews": [{"rating": 5.0, "title": "Travelled for two months, this was my favourite place!!!", "text": "Ahh Bellagio. . . We stayed here as part of a two month round world trip and it is simply stunning. We werent sure weather to stay in Lake Como or stay at this little village. We are so glad we chose the latter. Lake Como is too big, it has traffic lights and grafitti but this little village has cobblestone streets and wine bars...", "helpfulness": 19, "user": "MissTravelAlot", "date": "January 10, 2007", "id": 6573579}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I think ive worked out the rooms of this hotel and they are as follows.", "title": "Go for the view!", "helpfulness": 10, "user": "markm99", "date": "November 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6179115, "likes": {"liked": "— View/Pool", "disliked": "— Cost"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Newly renovated rooms, which are divine, are at the back of the hotel, no views. We originally had two of these rooms, numbers 405 &403, as we are a family of four travelling.", "title": "Perfect spot in Bellagio", "helpfulness": 8, "user": "mgoldin", "date": "October 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6027766, "likes": {"liked": "— Location", "disliked": "— Dining room"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Once you see the view though, youll break down in tears if you havent paid the supplement to have a view room. If you have never paid for a view before or will never pay for a view again MAKE SURE YOU PAY FOR A VIEW AT THIS LOCATION. I cannot stress this point enough.", "title": "So So", "helpfulness": 6, "user": "natasha499", "date": "October 16, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 5961075, "likes": {"liked": "— The bar seved great green olives during hapy hour.", "disliked": "— The room was horribly small"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Suffice to say we asked to upgrade to a room with a view but they where heavily booked and could not offer us the same 2 x twin rooms with view as all the clever people had booked their view rooms when they booked their accomodation originally.", "title": "Friendly and Welcoming. A MUST STAY at the Belvedere Hotel.", "helpfulness": 10, "user": "Happy-Travelers-II", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5930009, "likes": {"liked": "— The Warm and Friendly Staff", "disliked": "— nothing."}}, {"rating": 4.0, "title": "Reviews accurate", "text": "Great setting and excellent service. Staff was great and I'll take the location set away from the Bellagio village - quieter and easy parking and it's less than 5 mins walk. Pool and view were great . Room also beautiful and newly renovated, one complaint was there was only a tub and no shower. Overall, recommend highly rather than staying in crowded noisy waterfront which we initially thought we wanted to do. Not a place for kids due to walk from town.", "user": "barow44", "date": "September 19, 2006", "id": 5815828}, {"rating": 5.0, "title": "Wonderful view, great service", "text": "Overall, loved it.", "user": "jmi11s", "date": "September 14, 2006", "id": 5801693}, {"rating": 4.0, "title": "What a View", "text": "View - Absolutely the best view from anywhere, I'm convinced.", "user": "meems4u", "date": "September 4, 2006", "id": 5768438}, {"rating": 2.0, "title": "If you don't like warm and fuzzy this place is for you", "text": "Service - Excellent. We asked for breakfast to be brought to our room, which they were happy to oblige (though they do not have \"room service\" per se).", "user": "Boston4_Traveler", "date": "August 29, 2006", "id": 5724345}, {"rating": 4.0, "title": "Beautiful setting", "text": "Food - Good. Not fabulous, but good. One great thing was that if you ordered a bottle of wine and didn't drink it all, they could save it for you to have the next night at dinner. Genius.", "user": "thecraigs", "date": "August 19, 2006", "id": 5625117}, {"rating": 4.0, "title": "Excellent value", "text": "My wife and I stayed there for 3 nights around 15 th of July 2006.", "user": "Ducat", "date": "August 6, 2006", "id": 5561374}, {"rating": 5.0, "title": "Loved the Belvedere", "text": "We really liked the hotel and I would rate it as excellent value for money in Italy where rooms are generally expensive and not quite matching the star classification of other countries. Actually, I would personally rate it as a 3 stars +.", "user": "HandsomePete", "date": "August 3, 2006", "id": 5550455}, {"rating": 4.0, "title": "Beautiful setting", "text": "Staff are extremely competent and helpful : They had not received our booking for the first night ( my fault ) and despite of this and being full that night for double rooms, they managed to accommodate us in a single room with an extra bed, which was small but had a magnificent wiew. They also offered to look for accommodation for us in other hotels, but we decided to stay in the single room as we were so tired from a full day of motorcycle and we immediately liked this hotel and the warmth of the staff. Then the next day we were moved to a standard double room with magnificent view on the lake and small Pescallo harbour. They also provided garage for my bike.", "user": "stephensmom", "date": "July 13, 2006", "id": 5462758}, {"rating": 5.0, "title": "Loved this hotel", "text": "Only two cons in this otherwise 100% picture, where I agree with some other reviews : It is true that bathrooms ( showerrooms would be more an appropriate word ) in the 2 rooms we had were extremely small, and should not be recommendend for big persons! They were spotless though.", "user": "luckybird", "date": "July 13, 2006", "id": 5462491}, {"rating": 4.0, "title": "Great views", "text": "Also insist on staying in the main building, rooms below the restaurant deck ( Numbers 500 + ) and below the pool are not nicely located and do not seem to have been renovated.", "user": "golfhead", "date": "June 29, 2006", "id": 5410876}, {"rating": 2.0, "title": "Buyer Beware!!", "text": "My husband and I stayed for 3 nights at the Belvedere in September, 2004. Our reservation, which I made 8 months in advance and had a written confirmation, was for 4 nights! The day of our arrival, we had traveled 8 hours on a train from Switzerland, then taken a ferry and finally a cab to get to the hotel. We arrived tired only to find that Elena, the manager, had given away our room to someone she felt needed the room more than we did \"due to medical reasons\". She didn't know anything about us, physically or otherwise, how could she make a unilateral decision like that? Moreover, the hotel was booked solid so she had already booked us into a pension (2 stars, tiny room) . There were no other comparable rooms in Bellagio that week due to an annual auto race being held at the same time. She kept saying \"you save money, you lucky!\" I was outraged and let her know it! She couldn't understand that the issue had nothing to do with money..... Finally the next day, after much ado, she moved us into a room that she said was an upgrade but it really looked like the room we had reserved. No compensation of any kind - no complimentary dinner, no nothing. The hotel was beautiful, the view magnificent, and Bellagio amazing. We thoroughly enjoyed our visit of Lake Como and didn't let Elena's poor management ruin our visit. However, we cannot recommend this hotel since, obviously, a confirmed reservation means nothing to them. Other travelers may not be so lucky and it may ruin their vacation. Avoid!", "user": "forumchatter", "date": "October 3, 2006", "id": 5903683}, {"rating": 2.0, "title": "Good spot but unfriendly staff and security cameras pointing at your room", "text": "This hotel is a short walk from town and sits on the other side of the peninsula from the main part of town. It is a nice spot that looks out on the water. We had a few issues with the staff and the room. The staff was not very friendly and seemed to want the guests to \"move on\" rather than provide assistance. It seemed like we were bothering them if we asked a simple question. We asked the front desk for advice on which town to visit by ferry, her response, a very short, \"where do you want to go?\" On arrival at the hotel at about 2.30pm we asked if we could get a light lunch. A very unfreindly barmaid brought us a cold dry ham and cheese sandwhich, when I asked for mustard she gave me a strange look and walked away. We asked that reservations be made at a restaurant, after making the phone call she simply said they are booked all night and turned her back on us. Later we found out from the same person that Tuesdays most restaurants are closed. Why didn't this person offer to make reservations at another restaurant during our first discussion. The breakfast staff went to the same charm school, barely a smile or good morning. They seemed intrested in getting the job of serving breakfast done and then hoping you'd get out of there asap. The room was acceptable, nothing special, but the bathroom was the size of a phone both. Also many of the rooms have security cameras with glaring red lights pointing at the patios. This did not add to the charm. After a period of time we grew to accept that \"someone was watching\", apparetly there has been some crime at the hotel and this was viewed as a deterrent. I'd try another hotel next time we visit.", "user": "raybo55", "date": "October 3, 2006", "id": 5903113}, {"rating": 5.0, "title": "WONDERFUL", "text": "This hotel is a gem. The staff provided an excellent service and were warm and friendly, particularly the Scottish woman who was a general manager (i think). She was very helpful and provided lots of local information.", "user": "Elainegiano", "date": "September 29, 2006", "id": 5891376}, {"rating": 3.0, "title": "Great Location, OK Staff", "text": "The standart of cleanliness was excellent. The towels were changed twice a day !! We got exactly the room we asked for , one with a view over lake. WONDERFUL.", "user": "NekoCat", "date": "September 27, 2006", "id": 5882418}, {"rating": 2.0, "title": "would not stay here again", "text": "This was the first hotel in our 3 x week trip to Italy. It was the best hotel we stayed in.", "user": "italiancook", "date": "September 21, 2006", "id": 5822147}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe"}, "stars": 3, "variance": {"poor": 12, "average": 34, "very good": 180, "terrible": 9, "excellent": 445}, "aka": "Hotel Belvedere Bellagio Italy - Lake Como", "slim_ranking": 0.0588235294118, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Perfect for relaxing vacations, the Hotel Belvedere offers all you need to rejuvenate body and soul. Nothing better than a peaceful holiday by Lake Como at Hotel Belvedere in Bellagio to get away from it all.Also known as the pearl of Lake Como, Bellagio is located at the tip of a peninsula which divides the lake in two arms and faces the Alps across the lake. Such a unique position has been making Bellagio a famous holiday destination since the Roman times.The panoramic restaurant and terrace of Hotel Belvedere offer stunning views of Lake Como. Additionally, the hotel features a luxuriant garden and a wellness treatment center, including an outdoor heated swimming pool, a large spa tub, a fully equipped fitness room, a Turkish bath, a sauna and much more to provide guests with a relaxing holiday in Bellagio. The hotel also offers manicures and pedicures, body scrubs, body treatments, aromatherapy treatments, massages and facial treatments. Reservations are required for massages and spa treatments."}