{"user_rating": 4.0, "review_count": 550, "name": "Hotel Alhambra Palace", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "The reason to stay at the Alhambra Palace is for the great views of the city and location near the Alhambra. It's an easy and interesting walk into town (Plaza Nueva) along the walls of the Alhambra and a convenient bus ride back up. This was my second stay and really nothing has changed in the five years since my first. The room this time was a little smaller but adequate. The bathroom was not arranged very well and also small. The service is a little snooty. The sandwiches in the bar were expensive and made us laugh when they were sadly presented on the plates with no garnish, no presentation - not even cut. The breakfast is wonderful and the hotel is spotless. All in all, it's a great space - I still love this place and would stay again.", "title": "Beautiful Views and Great Location", "helpfulness": 1, "user": "DFHS", "date": "May 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 64949997}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We planned on spending the last couple of days of our trip to southern Spain in luxury at this hotel. We were gravely disappointed, and in addition, we lost an entire night's sleep, which detracted from our otherwise wonderful vacation. The above mentioned room had a lovely view, and pretty decoration. However, the room is barely larger than a closet, and far worse - is directly under some kind of generator or compressor. It got worse later in the evening - perhaps supplying the HVAC system or something. When we complained the next day, we barely got a \"I'm sorry.\" Not wanting to be 'ugly Americans', we accepted their offer of another room. We just wanted to warn anyone who's thinking of staying here, to be very careful of which room they offer you.", "title": "Beware of room #301", "helpfulness": 3, "user": "JChristiansen", "date": "May 10, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 63784657}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "The hotel we had when we first visited Granada - Abadia, was far superior, as well as far cheaper. Beware of luxury hotels, whose staff may be snooty as to which guests they offer the better rooms to.", "title": "Lovely hotel in an excellant location", "helpfulness": 1, "user": "marydairy", "date": "May 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63551832}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I stayed here for one night with a friend, the purpose of our visit being to see the Alhambra Palace. I selected this hotel for it's location and was not disapointed.", "title": "Delightfully Kitsch Hotel Close to the Alhambra", "user": "tobyteabag", "date": "May 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63346688}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "We arrived by car at just after 11am and were immediately checked in at reception and taken to our room, number 210. This room had a small balcony and the most magnificient views of the snowcapped mountains and the city centre down below. The room was more than adequate and had a lovely bathroom with complimentary soaps etc. Needless to say we did not spend much time in the room other than to sleep.", "title": "Good Hotel", "user": "KT785", "date": "May 1, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62930066}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We only had one night in Granda, so our sole objective was to see the Alhambra (which, by the way, is totally worth an entire day's visit). The Alhambra Palace was the perfect place to stay. The hotel has the same Moorish architectural influence as the palace, and is only a five to ten minute walk away. The staff is friendly and attentive, the public areas are beautiful, the rooms were clean and well-appointed, and the restuarnat and (especially) the lounge/snack bar have stunning views overlooking the city. A very extensive breakfast buffet was included.", "title": "The place to stay in you're visiting the Alhambra", "user": "siouxknox", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 47183243}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "One word of caution, it is VERY difficult to get to the hotel by private car. Even though we had a GPS (based on recommendations from Tripadvisor comments), it literally couldn't get us there. It tried to send us the wrong way up a one-way street. When we refused to do that, it fruitlessly sent us in circles. After nearly an hour of frustration, we flagged a cab and followed it in our car up, up, up to the hotel. Leaving at the end of the next day, we learned that the trick is NOT to come through the old part of the city, but to make your approach from the equivalent of its beltway, and the hotel is just a few minutes off an exit on the northern end of town. But still, the best bet is not to drive at all.", "title": "A beautiful hotel - a short walk to the Alhambra", "user": "Macman1940", "date": "October 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46960673}, {"rating": 5.0, "stay_parameters": "Stayed September 2009", "text": "This is a first class hotel. The public spaces are beautiful. The breakfast buffet has everything from Cherrios® to champagne. Our room was huge with a bathroom larger than most hotel rooms. It is located at the base of the Alhambra. You can walk to the entrance to the Alhanbra in about ten minutes. Only a madman or a native would take a car into Granada. This hotel is located conveniently just off an exit of the highway.", "title": "A really sumptuous hotel", "user": "JuneRB", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 45782797}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "When we arrived at this hotel we were told that our reservation for two nights through bookinhotels.com had been cancelled, much to our dismay. The gentleman on reception couldn´t have been more kind & helpful & could offer us a room but at a much higher price than we expected. This being the case, we only stayed one night. Our room was very comfortable, although small, & the facilities were everything one could ask for. In the evening we sat on the terrace for drinks & the view is spectacular. Breakfast was included in the price & was excellent. Added to all this, the car parking is free, what a change. If you want to spoil yourself, stay here.", "title": "Beautiful hotel-- away from the center of town", "user": "elisaabcnews", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 45355911}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This was our splurge for the trip and I am so glad we stayed here. Its the most beautiful hotel (see pictures) at the top of the hill near the Alhambra. The inside is just stunning--luxurious, with a terrace that overlooks the city. The rooms were nothing special but they had beautiful views. I didn't mind that it was outside the center of the city--but it was definitely a work-out if you didnt want to wait for the bus to get home. We were very happy with this hotel", "title": "lack of amenities", "helpfulness": 2, "user": "ebie1", "date": "September 23, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 43890206}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "If your visit to Granada is only to visit the Alhambra then this hotel is ideal but of you are looking for anything more then I would give it a miss.", "title": "Ideal location to visit the Alhambra!", "user": "welshgirlNetherlands", "date": "March 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 57873908}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The hotel was built in the days when size mattered on a grand scale however these days it has just become a bit dated and very worn. The room was adequate and clean but we were constantly having to complain about having no water in the room.", "title": "Perfect place for a short stay", "user": "glag", "date": "March 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 57546839}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The cost of the food and the drinks in the bar area was quite expensive compared to our stay in both Seville and Cordaba, I suppose given that it is a 1/2 hour walk down a very big hill into the town itself they have a captured market in the people staying in to eat!", "title": "A superb experience - not cheap but fantastic value", "user": "Brian002", "date": "January 2, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52391062}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Perfect place for a one night stay and a visit to the Alhambra", "title": "Al-HoJo's Palace", "helpfulness": 2, "user": "rdannin", "date": "December 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 52254602}, {"rating": 2.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "This must be the very best hotel we have ever stayed at. It is worth paying just that bit more to stay here. The reviews made us book this hotel and I can say we were not disappointed!", "title": "Christmas heart break", "helpfulness": 3, "user": "MarbellaSpainPatsy", "date": "December 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 51840843}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This hotel is ideally positioned for visiting the Alhambra, and this really is its strongest selling point. The bedrooms were nothing special, although the public areas were quite attractive. This is a seriously expensive place to have lunch in - €8 for a toasted cheese sandwich! Dinner was also expensive and unexciting. There are very few eating options within walking distance, but a regular bus into town offers plenty of choice at much better value. Great location, but eat elsewhere.", "title": "Location the main appeal", "user": "Ireland_member", "date": "April 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 62819953}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Well located for visiting the Alhambra, just a walk through the gardens. The hotel entrance lobby is decorated in keeping with Alhambra theme and the main room corridors are spacious and wide with windows at the end to snatch a different view and perspective of Granada.", "title": "Great location but hopeless internet and IT equipment!", "user": "katdSurrey", "date": "April 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 62603424}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Bedroom decor is a little tired, but it is in keeping with the feel of an old fashioned grand hotel. Staff were helpful and polite.", "title": "a good choice", "user": "love2travel4242", "date": "April 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62365748}, {"rating": 5.0, "title": "Alhambra, Granada", "text": "Hopeless internet! We were stuck here during volcano ash crisis but failed to get on the internet. They have no business centre and an archaic tv and keyboard system that simply does not work.", "user": "AnanyaDutta", "date": "March 24, 2010", "id": 59417358}, {"rating": 3.0, "stay_parameters": "Stayed February 2010", "text": "The moral is: travel with your own laptop!", "title": "Good views but.....", "user": "CAEWALES", "date": "March 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 3.0}, "id": 58131540}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 27, "average": 70, "very good": 216, "terrible": 5, "excellent": 232}, "aka": "Alhambra Palace Granada", "slim_ranking": 0.152671755725, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Experience a revival of a grand tradition of European hospitality at Hotel Alhambra Palace. Inspired by the beauty of the Alhambra, our hotel conjures up a sense of culture, aristocracy and elegance. Relax on one of our terraces with a refreshing drink or outstanding gastronomy. Hotel Alhambra Palace has been offering stylish Granada hotel accommodation since 1910. Experience 100 years of tradition and unique Granada hotel living in the Hotel Alhambra Palace."}