{"user_rating": 4.0, "review_count": 373, "name": "Hotel Sirmione", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "Sirmione in my opinion is the best place to stay on Lake Garda as it is busy with loads of restaurants and shops - lots will not like it however that are looking for a secluded spot. Sirmione is quiet at night however but bustling during the day. The Hotel Sirmione is in a lovely location and has a great breakfast service and helpful staff for arranging trips away. Nice pool and sunbathing but can be busy. One thing, the pool smells of sulphur as it is a sulphur pool - so a bit of an eggy smell. This I did not mind BUT I foolishly went in the pool with my jewellry on -silver bracelet and engagement ring and they turned black instantly. I could not get this off and had to have them professionally cleaned at home. I did not see any specific signs and was a bit annoyed although there may have been signs but I missed them or they may have been in Italian.", "title": "Brilliant Lacation", "helpfulness": 3, "user": "Snedders", "date": "October 16, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5961321, "likes": {"liked": "— location", "disliked": "— smelly pool"}}, {"rating": 5.0, "title": "Great Hotel", "text": "Great hotel and great location and would definitley stay there again.", "helpfulness": 6, "user": "Bredin", "date": "September 19, 2006", "id": 5816693}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Staff very friendly except for reservations where they could have shown a little more interest in my questions. Food very good and well presented at each course.", "title": "Lovely View", "helpfulness": 6, "user": "AdamD4", "date": "August 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5709080, "likes": {"liked": "— Location, and very friendly staff", "disliked": "— Air con system is very awkward"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled with family", "text": "Very clean hotel, pay extra and have a balcony over looking the lake. Be aware the small bottle of wine, nuts and bread straws left out each day the items are not free but come from the mini bar at a cost; which will be added to your bill. Good walks around the hotel and take a boat trip around the bay, best method of travel is by one of the lake steamers.", "title": "loved this hotel", "helpfulness": 1, "user": "clazza25", "date": "August 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5705107, "likes": {"liked": "— i cant single out one thing, all of it was amazing", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Hotel Sirmione is perfectly located in the touristy peninsula of Sirmione's old town. Near the castle and small harbour the rooms, pool and garden overlook Lake Garda. The staff were all very polite and spoke excellent English. We stayed there for a week for our wedding in the quaint hilly village of Malcesine. Upon arrival we had a bottle of champagne waiting in the junior suite we had booked. The castle in Malcesine (where we married) has a stunning view of the lake and is well worth the ferry ride from Sirmione. The town itself is busy, but still has plenty of charm and gelati. There is a large gap in quality between Hotel Sirmione and the 5* Villa Cortine Palace, but also a large gap in price. So if money is not an issue I would go for the Villa Cortine. A must if you stay in Sirmione is the Ristorante Signori, with its unbelievably generous manager/owner Sergio. Altough you'll find cheaper places to eat, you won't find better quality food. The view, service, and food make this one of the best restaurants I have ever been to.", "title": "Lovely hotel", "helpfulness": 13, "user": "GG", "date": "June 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5357483}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We have just returned from a weeks' stay in this lovely hotel. It was our first time in Lake Garda and we did refer to Trip Advisor before booking it. Firstly the location, in the centre of the \"old town\" was ideal - in the middle of the bustling (mostly pedestrianised) town, just opposite the castle (which looks stunning when the sun is setting). So easy to walk into the town to wander around the shops. Secondly the staff were top class - very professional and genuinely friendly especially in the restaruant. There were quite a few Italian guests in the hotel which is reassuring - if the natives go there then it must be good!", "title": "Super hotel in great location", "helpfulness": 6, "user": "Babserella", "date": "May 28, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5229274}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Our room was 116 (executive with balcony) which had a lovely view over the little harbour where the boats are moored and you could (just about) see the lake to the right. The hotel bar has an outdoor area where you can watch the mountains change colour as the sun sets - truely a magical and very relaxing setting. We had a few cocktails there... The food in the restaurant is good and breakfast covers every option included hot eggs and bacon. Local wine Bardollino is a steal at 14 euro per bottle.", "title": "sirmione is special", "helpfulness": 14, "user": "gallimaurfry", "date": "November 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4126532}, {"rating": 5.0, "title": "Fantastic hotel", "text": "We loved the sulphur pool and took a dip every day. The chambermaids also do an excellent job - worth a mention - freshly ironed sheets every day!", "helpfulness": 21, "user": "A TripAdvisor user", "date": "November 1, 2005", "id": 4079735}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe"}, "stars": 4, "variance": {"poor": 24, "average": 56, "very good": 154, "terrible": 9, "excellent": 130}, "aka": "Hotel Sirmione Lake Garda, Italy", "slim_ranking": 0.388059701493, "description": "Hotel Sirmione e Promessi Sposi is the ideal choice for those who love sunsets over the lake and want to enjoy romantic, unforgettable momentsof beauty. It is located in the little village, in the square dominatedby the Castello Scaligero. Many rooms have a terrace over the lake where you can have breakfast and spend unique hours. But that’s not all: the guests of the Hotel Sirmione e Promessi Sposi can have lunch by the lakeside at the Restaurant Dei Poeti or take care of their wellness and relax in the thermal spa with Finnish sauna, water path with emotional and sensory showers, relaxation zone, whirlpool and thermal pool with lake view: a sequence specially designed to provide you with an irresistible thermal experience, of relaxation and wellbeing."}