{"user_rating": 4.5, "review_count": 456, "name": "Hotel Gault", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I will keep this short because everything I say about this hotel has been previously written. The rooms (and bathrooms) are enormous and comfortable. The place is the perfect size for a boutique hotel and in a great location. The food at the restaurant is amazing, tasty and so artistic. You really cannot find a better place to stay in Montreal for the price.", "title": "Best Place to Stay in Montreal", "helpfulness": 2, "user": "Surlaplage", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28893286}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed four nights at the Hotel Gault. Impeccable friendly service with real insider knowledge. Very comfortable boutique hotel rooms, spotlessly clean, perfect bathrooms, free high speed WiFi access in the reception/lobby area. High end and tasty buffet breakfast available.", "title": "Perfect city boutique hotel, ideal location", "helpfulness": 1, "user": "Hopetimist", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28334408}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Hotel Gault is perfectly situated in the western part of old Montreal. Five minute walk to Square Victoria metro station. Ten minute walk to centre of old Montreal. Fifteen minute walk to Rue St Catherine shopping district.", "title": "Refreshingly different from other hotels", "helpfulness": 1, "user": "LondonW4", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28276845}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Would heartily recommend this hotel and very happy to stay there again.", "title": "Hip, romantic retreat with fabulous customer service", "helpfulness": 1, "user": "JH&PH", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26706115}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Fulfilled every expectation of being unusual, luxurious and the ideal retreat. If you want something small with all the mod essentials and more personality and a sleeker style than typical white-space design hotels, then this is it. Great for independent travellers wanting a haven, but still right in the centre. Would definitely choose Gault again.", "title": "Trendy, Casual but Business friendly, Terrific Service", "user": "BritIt", "date": "March 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25443419}, {"rating": 5.0, "title": "Gault is a Gem", "text": "Three college friends met for a long weekend in Montreal, and we were treated to a wonderful stay at Hotel Gault. This boutique hotel is clean, modern and chic. Everything about it far exceeded our expectations--great location, clean and very chic, delicious breakfast. And the service is exceptional. The staff are knowledgable, friendly and very helpful, especially Andre who was there before we even realized we needed his help! I would absolutely return, and I have already recommended this little gem of a hotel.", "user": "Maxnhammie", "date": "June 9, 2005", "id": 3541231}, {"rating": 5.0, "title": "Outstanding", "text": "Surprised my wife for her birthday with a weekend trip to Montreal. We stayed at the Gault after I made an exaustive search of the hotel scene. Just an incredible place. I am fortunate to have visited many a fine hotel worldwide and found this gem to be spectacular in every detail. Staff and service was sterling. The breakfast in the lobby is not to miss. The design and furnishings are incredible. Very minimalistic, modern yet very comfortable. The room is an architectural dream. Perfect location in the old town of Montreal. No attention to detail has been spared. I can't rave enough.", "user": "A TripAdvisor user", "date": "June 6, 2005", "id": 3533990}, {"rating": 5.0, "title": "Go for the Gault", "text": "What a terrific hotel! We stayed for three nights, and were not disappointed. As mentioned in other reviews, the staff is exceptionally friendly and helpful (and young!), with great dinner and shopping suggestions tailored to what we were interested in. The hotel is clean and modern, but still feels comfortable and romantic. Although the hotel was completely booked the weekend we stayed, it never seemed crowded or busy; a feeling of relaxed (but hip!) elegance was maintained at all time. We stayed in an \"Essential\" room, which is the least expensive, but the room was plenty big. No dressers, though, so prepare to keep your clothes on shelving. The shower was wonderful, big with great pressure. The breakfast is amazing: plentiful and delicious, with hot items cooked to order. The hotel is located in a quiet part of Old Montreal. It is a mostly business district so on the weekends it is very peaceful and private, yet the bustle of the more touristy section of Old Montreal (which we pretty much avoided) is only a few blocks away, as is the nearest Metro station. All in all, a fabulous time. We would definitely stay there again.", "user": "Hikingrrrl", "date": "May 31, 2005", "id": 3513751}, {"rating": 5.0, "title": "One of our best hotels ever", "text": "We travel a fair amount and generally stay in nice hotels. Based on reviews in Trip Advisor, I picked the Hotel Gault for our 4-day vacation. It is a fantastic place! It is a small hotel, but everything about it is done big. The modern styling is wonderful. The rooms are large and very comfortable. The breakfast every morning was delicious and the staff was superb. We will stay there any time we travel to Montreal, no question.", "user": "ganymebe", "date": "May 30, 2005", "id": 3511432}, {"rating": 5.0, "title": "Five-star service at four-star prices", "text": "We got the first of several pleasant surprises at check-in, when we learned that we had been upgraded to a suite (complete with wraparound terrace) with no increase in rate. We loved everything (well, almost everything) about the Hotel Gault: the clever, open-plan design in our suite; the magnificent breakfasts; the luxurious deep bathtub; and most of all, the friendly, helpful, professional staff (special mention to Caroline, customer service superstar). The hotel is extraordinarily well located in the historic district but also on the edge of downtown Montreal. Only minor peeve: although there is excellent wi-fi service in the lobby, we had problems with the high-speed internet connection in our room.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "August 4, 2005", "id": 3737582}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Really a great hotel. Rooms are comfortable and huge. Love the bed and huge tub. Daily breakfast was great- leisure,great offerings and could read numerous papers or watch ET or Nemo on the flat screen tv. Staff is very nice and the location is great for strolling around,shopping or getting a bite to eat. Only thing I thought was strange when I was there was the entrance and lack of staff helping you get your bags up the stairs or holding the door open- not a big deal for a smaller hotel but something I noticed. The streets can be a bit noisy as there was lots of contruction going on when I was there and the heated cement floors will pop and crack quite loudly after turning them up or off. Most people I am sure would not notice this- as I am a light sleeper. They did a really nice job with everything. Restaurant called AREA around the way is absolutely excellent!", "title": "Slick but Warm and Toasty", "helpfulness": 11, "user": "larkoolaw", "date": "June 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3612376}, {"rating": 5.0, "title": "best hotel i've ever been in.", "text": "the service was wexcellent - professional hotel people who tired to serve the guest - from the first moment i came in after a lousy cab ride and the guy at the desk said - would you like to sit and relax and have a cafe while we get your room ready - everybody there had the same attitude. and then the physical feature - although ultra moderne and i was a little bit nervous about that - it turns out that everything wasd provided and the comfort level was high.", "helpfulness": 8, "user": "muzzmashe", "date": "June 24, 2005", "id": 3608010}, {"rating": 5.0, "title": "Cool, classy oasis in a busy city", "text": "My wife and I stayed at the Gault during Grand Prix weekend (our second stay here) and what a great way to enjoy the weekend. Close enough to the action by Metro, taxi or on foot, yet a world away from the crowds. The other reviews are accurate, we really can't add much. When we checked out, they asked us to complete a survey. One question asked was \"improvements needed?\". Our reply - NONE.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 14, 2005", "id": 3551513}, {"rating": 5.0, "title": "Our Best Hotel Experience Ever...", "text": "My wife and I have travelled to many places here in Canada, the United States, and Europe, and Hotel Gault was without a doubt our most enjoyable hotel experience to-date.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 12, 2005", "id": 3544929}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "We really loved our stay at the hotel. When we walked in, Andre was there to greet us with a warm smile. He knows his stuff and use his suggestions and expertise. The front staff was very warm and helpful, especially for small requests, spa suggestions, etc.", "title": "Fantastic Service with only a few suggestions", "helpfulness": 1, "user": "westcoastvangirl", "date": "December 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22385194, "likes": {"liked": "— Service & Breakfast", "disliked": "— TVs"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The location was great although too bad it was cold (we're from the West Coast so we are not good with cold LOL!). The hotel lobby was amazing - I loved the art pieces. The room was clean, simple and modern. The heated tile floor was great in the bathroom. The bed was super comfy and overall a great view of Old Montreal from our Extraessential room.", "title": "Great Boutique Hotel", "user": "2hampsters", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22317771, "likes": {"liked": "— modern, low key hotel with great staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The one thing we both raved about was the breakfast that was included with our room price. It was DELICIOUS! I will never look at continental breakfast the same ever again! Great coffee, great selection, and loved the choice of a la carte.", "title": "Believe all the raving comments", "helpfulness": 2, "user": "BarkusPie", "date": "November 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22272476, "likes": {"liked": "— Staff friendliness and overall modern look of the hotel", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Top Notch Service", "text": "For the price we paid (we had a government rate, which is around the same as the promo rate), there was nothing substantial to complain about. We would come back again for sure and I loved Montreal so much.", "user": "food4ager", "date": "November 23, 2008", "id": 22120276}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Our only suggestions were", "title": "Hotel Gault was more than good, but....", "user": "DonnaandSimon", "date": "November 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 22029235, "likes": {"liked": "— historical quality of the building, the modern feeling in an old setting", "disliked": "— the entrance"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Read all the reviews on this site, which helped us select the Gault. We stayed in a Studio, one of the largest options. Very clean, extremely modern. We are not modern furniture people but felt it would be fun for a change. If you are really into this type of look, this place would be fantastic for you. Lots of new stuff but also valuable stuff from the 40's-50's and 60's. The bed is incredibly comfortable. We loved our bathroom (which for us included a tub) Our studio had a mini fridge, wet bar and microwave. The living area was seperated from the bedroom by a custom built wood piece which did not reach the ceiling, but was really more of a divider. The TV/DVD was located on that, on a swivel that could face either room area. If you want something supremely cushy and comfy, this is not your place. OUr studio was wonderful but not the most Cozy thing we have stayed in. Having said that, it was fun to 'try something different on' since we are huge antique people. The lobby is terrific. Neat bar and surrounding area. Breakfasts were very good, and we found that we ordered the hot breakfast items every morning. Service very gracious there, expecially if you remember that although it is 'free', the server deserves a tip. Things were replenished regularly. The Gault is on the edge of Old Montreal- get your bearings so you don't miss the busier streets of Old Montreal. The staff was enormously friendly. Also, take the hotel's address and number with you if you are taking cabs. Not all of the drivers have discovered the Gault yet. We LOVED Andre. He has genuine passion for the hotel and the area. But all the front desk/concierge folks were very professional and friendly and helpful. We had no problems with housekeeping. Left our room, put out the sign and when we came back it was all set. It's true they don't change the linens every day but why tax the environment with the extra soap and hot water. If we threw towels on the floor, they were replaced. If we hung them, they were not. Fine with us. We ordered drinks and apps room service- quick and efficient. Husband forgot his razor, brought one up. Staff always inquired as to whether we enjoyed a recommended restaurant etc. We can only give this place high marks, but most especially because of the people who work there.", "title": "very good place", "helpfulness": 7, "user": "lcookster", "date": "October 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4029351}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The other trip advisor reviews do not lie. This is a real find. Everyone on the staff was so accomodating i every way.", "title": "C'est Super!", "helpfulness": 7, "user": "pmode", "date": "October 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4005623}, {"rating": 5.0, "title": "Quiet and Sophisticated", "text": "The room had minimal decor, but the amazing bed and comfy linens made up for it! nice shower and bathroom too. The breakfast was out of this world (don't miss the French toast or the croissants). The Gault Martinis at the bar were fantastic!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 6, 2005", "id": 3997795}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Great location, we walked everywhere! I can't say enough good things about this hotel. Feel free to email me with other questions.", "title": "Fantastic hotel", "helpfulness": 17, "user": "Monsieur_Lenoir", "date": "September 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3944552}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "First of all, I wanted a room with a terrace but it wasn't available. I didn't realize that all their rooms have doors/windows that open completely that allow fresh air in and transports you to another time. Below passed a horse drawn tourist cairrage over cobble stoned streets and I was completely taken. A minor drawback was the maid service that came in at turn down service time rather than the morning while we were out but one call to the front desk immediatley rectified the situation with a follow up to see if it was to our liking. THe lobby is always quiet but homey (if modern). THere was a quiet coctail party the night beofre we left and it was unobtrusive to the guests. The staff was super. Incredible Lychee Martinis by Adrianne who seemed to always have been there. Everyone in the reviews talk about the staff and they really are the best asset of the hotel. THe hotel was pricey but I knew that when I booked. No surprises. THe breakfast the next day always seemed worth it in the end. We were never more than a $5 cab ride from anywhere and the metro too was near. The beds were very comfortable and made you want to sleep longer. THe heated bathroom floor does work quite well. I have stayed at W's elsewhere but this is taken to the different level. It's not clubby or young. THe decor may be a bit cold but it was actually condusive to just lounging around downstairs. THe black clad staff were so quiet but always at beck and call. My best hotel experience.", "title": "The Best", "helpfulness": 15, "user": "wheelieWoo", "date": "September 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3912605}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Gault hotel is at the heart of Montreal and its location could not be better.", "title": "Would have been better with clean towels...", "user": "philo-backpack", "date": "February 17, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 24698017}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The rooms are huge and some details in the design are just amazing and the food was more than decent.", "title": "Would definitely return again...", "user": "Leeskater", "date": "February 16, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 24636454, "likes": {"liked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Yet , I have to admit one of my most vivid memories of the hotel are the stained, one with one of those big brown stains and the oter one had pubic hair which obviously weren't mine.", "title": "Disappointing", "helpfulness": 1, "user": "Steviem71", "date": "February 10, 2009", "detail_rating": {"front_desk": 2.0, "business": 1.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 24421778, "likes": {"liked": "— location and lobby", "disliked": "— room and service"}}, {"rating": 5.0, "title": "Consistently excellent, discreet, hip boutique hotel in Montreal", "text": "I can't believe there is so much attention given to details, yet I obviously got stained towels that should have been clean, since it was nicely folded on the side of the shower.", "helpfulness": 2, "user": "MontgomeryTraveler", "date": "January 6, 2009", "id": 23313512}, {"rating": 5.0, "title": "Tasty Brunch in wonderful ambiance", "text": "I just was not able to figure out how someone could have miss that, and to be honest, I was disgusted enough just not to ask for replacement towels, preferring to find more hygienic ways to get dry.", "helpfulness": 1, "user": "BestCity", "date": "December 14, 2008", "id": 22721986}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "All the positive TA reviews of Hotel Gault are 100% true! Our recent two-night stay at Hotel Gault was absolutely perfect: minimalist chic but with warmth and outstanding creature comfort! We loved the blend of the old and ornate architectural exterior with the more stark and loft design of the interior. The public spaces had both a rarefied and inviting openness about it with clever combinations of warm blond wood and tin ceiling and concrete walls, with wonderful displays of modernist art and whimsical but perfectly comfortable furniture. Our Extraessentiel room with its high ceiling was huge, and the bathroom with its separate tile & glass shower and its separate tub was also spacious --approaching the size of an entire hotel room in some cities! The bed and bed and bath linen were all plush and of excellent quality. The decor was minimalist and stylish, with use of warm colors. Service was exceedingly nice and attentive. The bountiful breakfast service with an abundant variety started at 6:30, with coffee and espresso made to order. The location in Old Montreal was charming with small restaurants and coffee shops nearby while being a little away from the heavier tourist traffic; it took us about 20 minutes on foot to get to Centre Ville for our work-related meeting, which made for a nice and enjoyable way for us to see the street and sidewalk culture of both sides of Montreal. I am afraid that now that Hotel Gault has just re-affirmed for us the meaning of \"boutique\", we will be obsessed with finding something similar to it whenever we travel!", "title": "Minimalist chic with warmth and creature comfort!", "user": "pln61", "date": "October 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21159109, "likes": {"liked": "— accommodations; style; location; service", "disliked": "— absolutely nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Wow! We travel often for both business and leisure, and when a special birthday trip brought us to Montreal, we chose the Hotel Gault. What an excellent decision we made.", "title": "One of our finest hotel experiences ever", "helpfulness": 1, "user": "lewisnyc", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20738798, "likes": {"liked": "— Property, location and service", "disliked": "— Would be hard pressed to find any negatives."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Simply put, this is one of the two or three finest hotels I've ever been to, anywhere in the world. And for it's price range, it's certainly #1. The closest comparison in terms of quality, location and service I can think of is the wonderful MyHotel Chelsea in London.", "title": "Fantastic Stay at Hotel Gault", "helpfulness": 2, "user": "TCinSF", "date": "September 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20411661, "likes": {"liked": "— Room, Location, Service, Breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "As other reviewers have stated, the property itself is gorgeous. We were in a \"Terra\" room and it certainly lived up to the amazing reviews. Another fantastic feature was the included breakfast, and we even had dinner at the property once.", "title": "Super!", "helpfulness": 2, "user": "carolAbington_PA", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20112172, "likes": {"liked": "— Accommodations", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The staff were universally wonderful. Polite, friendly, helpful, and patient with my embarrassingly bad French (I'm working on it).", "title": "Missing the breakfast", "helpfulness": 2, "user": "dro212nyc", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19767242, "likes": {"liked": "— Good Location, super-attentive staff, breakfast", "disliked": "— That I can't have that breakfast catered to me!!! :("}}, {"rating": 5.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "Design meets comfort. Staff makes you feel like you're home. They are truly the best. The hotel doesn't really have a restaurant; they have a kitchen. A kitchen that makes fabulous tasty food 24/7, wonderful breakfasts, a nice little bar downstairs. Just what you need to be comfortable, nothing you don't. The rooms are clean, modern well-equipped, but so, so comfortable. I travel here for business (have tried the Vogue, Le Germain, St. Paul but have come back here now for two years) but I would definitely bring my spouse back here for a weekend getaway. Only drawback is you have to walk a little for restaurants/stores, but not far and it's a neat old neighborhood, and of course the staff is always willing to give you a good steer. Le Gault, c'est magnifique!!", "title": "My favorite hotel— anywhere", "helpfulness": 12, "user": "JJinMI", "date": "September 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3907446}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "Just returned from four nights at the Gault. While the staff, breakfast and location were great, housekeeping was a disaster. We checked in to find clipped toenails on the floor and hairs in the shower. Despite requests with the front desk to have our room serviced late morning/early afternoon, housekeeping would show up at 5 PM daily, a time when we, and most guests, were resting up and showering before going out for the evening. Used glasses were never replaced, an empty tissue box not replaced, sheets on the bed not changed unless requested. paint peeling from the shower ceiling. This was in a $400/night suite. I would expect better at a Motel 6. Never again!!!!!!!!!", "title": "Housekeeping on strike????", "helpfulness": 3, "user": "runslow_8", "date": "September 13, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 3900445}, {"rating": 5.0, "title": "Hidden Jewel", "text": "The room was outstanding. Very quiet, good location for exploring Montreal. Excellent breakfast. Staff really courteous and helpful. Andre, the Concierge, had excellent suggestions for shopping and restaurants. We can't wait to go back!", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 22, 2005", "id": 3795419}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "My family just spent 5 nights at the Gault. This is one mod little hotel that earns its good reviews. This boutique property is fun, stylish, well located for leisure visitors, and unlike so many other trendy hotels of the moment, it hits on all the key hospitality cylinders without a single backfire. Our room was spacious, with an extra comfy kingsize bed and a rollaway for junior. The design element is big here, so if you like modern, the Gault is going to be to your taste. Minimalist decor, but cozy and bright. Breakfast is a treat as many other reviewers have noted. Service is attentive and friendly, but not obtrusive. The Gault pays attention to all the little details that can make or break a hotel stay. It is consistently just a little better than you might expect and the knowledgeable staff pulls it off with composure and elan. Highly recommended.", "title": "Vive le Gault", "helpfulness": 13, "user": "ChiveTidbits", "date": "August 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3760327}, {"rating": 5.0, "title": "The creme de la creme!", "text": "This was one of our best hotel stays ever. The room was superb, the staff delightful and the breakfast a gourmet treat! We would return to Montreal just to stay at the Gault...", "helpfulness": 5, "user": "alimonk", "date": "August 8, 2005", "id": 3745533}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 4, "variance": {"poor": 8, "average": 15, "very good": 74, "terrible": 1, "excellent": 358}, "aka": "Gault Hotel Montreal", "slim_ranking": 0.0294117647059, "description": "The Gault is a boutique hotel housed in an historic building built in 1871. The hotel lies in the heart of Old Montreal, just steps away from the downtown and the convention centre. In contrast to the exterior of this landmark building, inside, The Gault features a minimalist style. Together, they create an incomparable communion of old-world comfort and luxurious contemporary design. Furnished with classic 20th-century pieces, The Gault experience is enhanced by huge French windows that flood each of the 30 suites with natural light and create a radiant atmosphere. All the rooms are open-plan and equipped with Mondrian custom oak cabinetry, an LED flat-screen television, and Blu-ray technology. Some suites feature 3D televisions. All guests enjoy HDTV, complimentary high-speed wireless Internet access, and free local calls. iPads are available on request."}