{"user_rating": 3.5, "review_count": 105, "name": "Hotel Universel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "This is a good hotel for a business traveller. The rooms have nice furnishings; internet is provided; a small refrigerator; and a clean bathroom with decent towels and shower. Desk service is excellent.", "title": "Good hotel- room selection system needs a bit of work", "helpfulness": 2, "user": "dkona", "date": "October 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5926692}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Our issue was the room provided to us. We arrived for a 5 day stay in the middle of the week, when business was a bit on the slow side. We were provided with a room closest to the elevator and next to a stairway. Apparently the hotel knew the coming weekend would have the arrival of several bus loads of young (preteen or early teen) hockey players. You can guess what followed- running and shouting in the hallway,, fights in the stairway, etc. Despite the efforts of the front desk to calm the actions, it was not a quiet weekend.", "title": "It's now our little retreat!!!", "helpfulness": 4, "user": "ErinPoirier", "date": "September 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5823345, "likes": {"liked": "— The Decore and the Food!", "disliked": "— It has wireless internet!!!!"}}, {"rating": 4.0, "title": "A Great Place to Stop!", "text": "In circumstances of impending tournaments, other hotels usually will book business travellers (and none tournament participants) in a separate wing or at the end of the hall. Somehow this hotel could not do this. .", "helpfulness": 7, "user": "Guestess", "date": "June 28, 2004", "id": 2227436}, {"rating": 5.0, "title": "Surprisingly lovely hotel", "text": "My husband and I were on our way to Montreal, and we decided to stop in riviere du loup. We went to an information place, and looked at the hotel brochures. My husband picked up the one for Universel and joked, \"Imagine if we could afford to stay here\", and I looked at it, and I knew I had to stay there. We checked the price, and it was the same as everywhere else! So we went there, and had the most beautiful time. Fist of all the decore in the lobby is FAB! Our room was perfect! The restaurant is amazing, the food was delicious, and the decore there is beautiful as well. They give you fancy breads with oil and vinegar, and as much as you want, they will keep filling it with no problems! We will definetly be coming back....definetly! And I am ordering the pasta again!!!!! YUM! With spinach noodels, YUM!!!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "August 12, 2003", "id": 1223697}, {"rating": 5.0, "title": "Great Place to Stay", "text": "We were enroute from Maine and needed a place to stop and get some laundry done as well. What a pleasure to have our room, laundry and great restaurant all under one roof! The gentleman at the front desk was extremely helpful too.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 19, 2003", "id": 1021481}, {"rating": 4.0, "title": "Great Hotel!!", "text": "This a great hotel. For how reasonably priced it was, the service was great.....unlike my French. But that was no problem...the staff was very welcoming and very helpful. I will definitely go there again.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "January 18, 2003", "id": 838348}, {"rating": 2.0, "title": "Never Again!", "text": "We were given a room on the first floor in front of which was a very noisy truck. They were having roofing work done and the noise and smell of tar was overwhelming until approximateley 6 in the evening. By 7:30 the next morning the truck was back and waiting for us to \"get going\" so they could start work again. Furniture was missing from the room, the lock on the patio door didn't work properly and all in all it was a very unpleasant experience. Worst of all, the clerk at the front desk was arrogant and unhelpful. Was it because we live in Toronto. Unfortunately, we wonder!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 17, 2002", "id": 698088}], "location": {"country": "Canada", "city": "Riviere du Loup"}, "stars": 3, "variance": {"poor": 17, "average": 23, "very good": 44, "terrible": 1, "excellent": 20}, "aka": "Universel Hotel Riviere Du Loup", "slim_ranking": 0.4375}