{"user_rating": 4.5, "review_count": 436, "name": "Hotel Courtyard", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "My husband and I were on a package tour which included the hotel stay. But when we got there on our first night, we found that the room was terribly cold, and there was a power cut-off and there was no electricity for the whole night. The bed was a very thin mattress, was told the locals slept with no mattress. We had came from a very hot and humid Singapore, and the first night we had to wear sweaters, jackets, gloves, neck scarf, fleece hats, all the winter clothes we had. We requested if there was electric heater but they say only blankets, in the end we did not get them any blankets. The next morning we saw, opposite to our hotel, Courtyard Hotel. We met Michelle, she took to see the rooms. I booked the room immediately, it had a thick 6-inch king-size mattress, an electrical heater, clean-white bedsheet and duvet. And the room price was similar to our first night hotel.", "title": "You have to definitely stay here !!", "helpfulness": 2, "user": "Mona_Lisa_2009", "date": "March 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26031422}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "If I had to stay in Thamel, Kathmandu, I'll definitely stay here again. And I'll recommend to anyone. But you have to book directly with the hotel, they are not available thru the tour agent.", "title": "Luxury Oasis in hectic Thamel!", "user": "ck_cel", "date": "February 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24896257}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "My boyfriend & I stayed in the Courtyard Hotel last November 08 while travelling around the world...and it is one of the best experiences we have had so far in our trip...Michelle & Pujan really stretch themselves to make you feel at home...and they will help you in all the arrangements you may need for any activities you wish to do during your trip...the rooms are very well decorated in a boutique style and they are very cosy and quiet...the Courtyard Hotel is located right in the centre of Thamel which is ideal for shopping and dining out...Although Thamel is very hectic and noisy, I have always been amazed about how peaceful the Courtyard Hotel is...everytime we were entering the hotel it was as if someone had switched off the noise from outside...you would never imagine you are only 100 metres away from busy streets...The Courtyard Hotel is an authentic nepalese place and for really really good value...it is truly the best way to stay in Kathmandu...Merci beaucoup Michelle & Pujan!", "title": "Dont stay anywhere else.", "user": "Helen1011", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 24821225}, {"rating": 5.0, "stay_parameters": "Stayed February 2009", "text": "Hannah age 10 says...", "title": "Not a Hotel but an EXPERIENCE!!", "user": "CRUZINSUZIN", "date": "February 17, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24657466, "likes": {"liked": "— The owners Michelle and Pujan", "disliked": "— Leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "\"Absolute heaven, in the middle of busy loud noisy Thamel its a quiet oasis. The Staff, Michelle and Pujan would do anything to make you happy. I was really really sad to leave.\"", "title": "perfect in every way", "user": "ezcarcheck", "date": "February 9, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24402025}, {"rating": 3.0, "stay_parameters": "Stayed April 2009", "text": "Staying at The Courtyard Hotel for a few days was a pleasant experience, tucked nicely away from the chaos of Thamel, in large and modern rooms.", "title": "A Pleasant stay in Thamel", "helpfulness": 1, "user": "Trekker334", "date": "April 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 27481785}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "We were slightly disappointed after reading the reviews that the social interaction and putting themselves out for guests seemed to be preferential on behalf of the owners. We received a warm welcome, however a few false promises and slightly put out reactions at asking for simple help (having never been to Nepal before), after wards which wasted a great deal of our time. The rest of the staff were very helpful however. Would recommend taking a torch as only one small candle is provided.", "title": "My favorite hotel in whole world, and I am a real traveller.", "user": "gunesxgunter", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27079175}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "Every other aspect was fine, we enjoyed the breakfast, lovely front garden area and great location. Would recommend for a few days stay in Kathmandu.", "title": "Hey Lucee! I'm Home!", "helpfulness": 1, "user": "DSGCanada", "date": "March 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27065933}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "I stayed at Hotelcourdyard for 6 nights. I am a 64 years old and an experienced traveller. This is the most welcoming hotel I have ever been to. The owners Michelle and Pujan make you feel just like visiting a dear friend. There is a saying that ''Hostels bring people together hotels keep them apart''. This is different experience. You are introduced to other guests properly and have dinners out and happy hours together.", "title": "A central oasis with huge rooms and a welcoming courtyard where guests mingle and chat", "helpfulness": 1, "user": "3under3kiwis", "date": "March 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26954791}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Not to mention that the The rooms are really large, towels are an inch thick and snow white. The linen is pure cotten sateen weave. Garden and, bar, and library most pleasing. Even with power cuts, 24 hr. hot water. Staff is allways there to please you.", "title": "If your not staying here, they must be full!", "helpfulness": 2, "user": "botjam", "date": "March 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26456844}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We have just returned from a great three-week trip to Nepal. On arrival to Kathmandu after the long flight and being hit with the chaos of people, bikes, rickshaws, cars and lorries all sharing the road, arriving at the Hotel Courtyard was a welcome oasis.", "title": "Great hotel, but Michelle and Pujan are the real stars", "helpfulness": 1, "user": "Samkirk9", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28504213}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The Hotel is set in Thamel, so very central, yet set back in a courtyard area away from the hustle and bustle of Kathmandu. We stayed at Hotel Courtyard for our first three nights and then returned for our last three nights. We stayed in two rooms, both suites, one with a four poster bed, which were huge and overlooked the courtyard. The rooms are individually and tastefully designed, with plenty of comfortable seating areas complete with scatter cushions, stylish décor including Nepalese items and beautiful framed photography on the walls (there are TV’s and in one of the rooms we had a DVD player, if that is important for you, but you really don’t need them). The bed is the most comfortable bed that we slept in on our journey through Nepal, which isn’t difficult when all the mattresses were as thin as toast, but then the level of detail that has been invested in this Hotel shows by the fact that the mattresses have been imported to ensure quality and to ensure guests have a quality nights sleep. The bathrooms have western flushing toilets and toiletries are provided, as are fluffy, thick white towels. We had a good shower in both of our rooms and I believe that some rooms do have a bath.", "title": "An absolute gem of a hotel", "helpfulness": 2, "user": "TravelPad", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28315932}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "So, all in all this hotel has all the material qualities you would expect from a boutique hotel. But that isn’t what makes this hotel special: that comes from Michelle and Pujan, the owners. The level of service that these two invest in Hotel Courtyard is nothing less than extraordinary, which creates an ambience that I have yet to experience at any other place we’ve travelled to in the world. Even before we arrived I had been in contact with Michelle who was extremely helpful in helping me with my itinerary, to the extent that Michelle phoned me in London to chat about it. This was nothing compared to the hospitality that we were shown once there. As soon as we arrived we were taken to ‘The Library’ and given refreshments. It’s full of books and DVD’s that you’re welcome to use (they even have a cinema room), but also a relaxing space to sit and chat to Michelle, Pujan and the other guests. Anyone who stays here will know that the Library becomes the hub of social interaction past a certain time in the evening, complete with the odd drink from the bar, and often into the early hours, as Michelle is happy to sit chatting to guests, well that’s too impersonal - new friends. Michelle and Pujan are excellent hosts, genuinely interested in you and in making your holiday one to remember. Pujan and Michelle will help with any arrangements that you have and on the way back to the Courtyard at the end of our stay Pujan even spotted us stuck in traffic somewhere in Thamel, took us out of the vehicle and carried my heavy rucksack back ‘home’.", "title": "So good we went twice...", "user": "agrantDubai", "date": "April 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28056321}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "These two have a great attitude towards life and running a business and you can nearly always find one or both of them sitting in the courtyard chatting to people, which is infectious and before you know it new friends have been made, and at times this makes it hard to leave the comfort of the Courtyard and explore Kathmandu. Both of them encourage the interaction with other guests, all of which you will find to be like-minded people, which makes for many interesting conversations with people you may never have even passed the time of day with. Our last night in Kathmandu was a memorable one spent with Michelle, Pujan, Ute, Emma and Chris in a local Newari restaurant. How many places in the world would you get that level of warmth and kindness from hotel owners?? You turn up as strangers and really do leave as friends.", "title": "An Oasis in Kathmandu", "user": "Rainbowlover69", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27800846}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "People have to find this place and when you do you can guarantee that you will want to go back… we certainly do and will be. Thanks Michelle and Pujan for a memorable stay.", "title": "I felt like part of the family after 2 days", "user": "Kelvish", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27568311}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "This hotel is so fantastic, it actually inspired me to join Tripadvisor because I just had to brag about it!", "title": "Perfect place to stay!", "user": "Ceri007", "date": "February 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24317945, "likes": {"liked": "— Hospitality"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The Courtyard Hotel is fantastic. I can't imagine a better place to stay in Kathmandu! Wonderful hosts, beautiful rooms and perfect location. You really feel at home at the Courtyard!", "title": "Great place", "helpfulness": 1, "user": "catergrape", "date": "February 3, 2009", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 24170239}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "Prior to arriving at Hotel Courtyard, we had also stayed at Kantipur Temple house. Which gorgeous in terms of architecture. The place at Kantipur is quite romantic but nothing has beat (in terms of boutique hotels) Hotel Courtyard. The hotel is still under-going some major renovations, but the rooms that are completed are great, with European and local touches. If you are looking for a place that is detail oriented this is the place. Thick luscious towels ( a rare find in Nepal), shampoo, hand wash in the rooms!, the rooms smelled great and inviting and the lighting is pretty nice (as you will read -- shedding of electricity is a huge issue) and I loved the linens. I think I just ran and plopped on the wonderful beds!", "title": "Being Part of a Winner Makes One Feel Special", "user": "aesta", "date": "February 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24157094}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Michelle really puts her heart into this place and it is evident with the great reviews and the people that come through the doors. She has done a stupendous job of welcoming people into the hotel and her home.", "title": "Must stay at the Courtyard !!!!", "helpfulness": 2, "user": "snodwink", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 23801324, "likes": {"liked": "— the atmoshere", "disliked": "— the bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Cons: Since the place is so neatly tucked away its actually hard to find this place if you don't get airport pick up. (We had arrived from another town.) The signage outside the hotel is limited and not very large. We took a taxi here and almost no one knew where this was. The breakfast could have been a little bit better. But the best by a lot of standards in Nepal. Overall, this place was wonderful. Warm, inviting and cannot be beat. I will definitely come back in a few month's time.", "title": "It's worth going to Kathmandu just to stay here!", "user": "gorigirl", "date": "January 6, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23315294, "likes": {"liked": "— the owners, staff, and other guests", "disliked": "— breakfast - not enough hot veg options"}}], "location": {"country": "Nepal", "region": "Central Region", "continent": "Asia"}, "variance": {"poor": 5, "average": 22, "very good": 75, "terrible": 2, "excellent": 332}, "aka": "Courtyard Hotel Kathmandu", "slim_ranking": 0.0551181102362, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "East meets West in this 25 room boutique property. Built in traditional Newari architecture with European- inspired interiors, this hotel combines old-world elegance with the comforts of modern times. The Hotel Courtyard is located on a quiet street in the heart of the popular tourist district, Thamel ,steps away from many restaurants, shops and popular Kathmandu tourist attractions."}