{"user_rating": 4.0, "review_count": 47, "name": "Hotel Arc de Triomphe", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We staid at the hotel for 7 nights, two adults and one teenager.", "title": "Good location, badly maintained and bad bad service", "user": "CharlieMidEast", "date": "August 1, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 36388538}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "Location - the Hotel is very well situated - allot of restaurants, easy metro access and many supermarkets and shops nearby. This is probably the only advantage of the hotel.", "title": "Great hotel & service, as always!", "user": "biancaboo", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25531807}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "The hotel is defining itself as a boutique hotel, which is a rather pretentious definition for this hotel...the room are indeed large but poorly maintained - the bathroom has black stains, the fixtures in our room were broken and the linen were not clean. The rug was dirty so we always had to be with our slippers on. When we asked to replace the dirty linen, we had to bring them ourselves downstairs and to choose the replacement in the hotel basement. Soaps and clean towels were not always refilled and we had to do it ourselves.", "title": "Small clean no-nonsense hotel", "helpfulness": 3, "user": "Eplgh", "date": "February 2, 2009", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 24100143, "likes": {"liked": "— Large clean rooms, very close to Arc de Triomphe and the metro", "disliked": "— Basically no view (almost no windows) in the back-yard rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The hotel elevator broke down and was not fixed until we complained - so for 3 days out of our stay we had to climb 4 floors...not so pleasant after wearing our legs out in the streets of wonderful Paris...", "title": "Great location and fine family room", "helpfulness": 1, "user": "musser", "date": "February 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6823709, "likes": {"liked": "— Location", "disliked": "— Brakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "The service all in all was bad – there is one clerk at a time in the hotel, so no service is granted (see towels, linen and soap story above…)", "title": "Excellent Base", "user": "Antventure", "date": "December 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6503900}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Stayed here for two nights. Friendly and helpful staff. Great location. Close to the Metro and many restaurants. Great jumping off point for the rest of Paris.", "title": "Completely satisfied", "helpfulness": 2, "user": "Hofman24", "date": "December 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121998632}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We stayed in the Triple room. Sufficient space, quiet and clean.", "title": "Friendly, clean and great location", "user": "yogini23", "date": "November 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120509432}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "We recently stayed at this hotel for 4 nights to celebrate our wedding anniversary. We found it to be in a great location, 5 minute walk from the Arc de Triomphe, metro and taxi rank and plenty of places to eat nearby. The hotel is well run, has recently been refurbished, was clean, quiet and very comfortable. The staff are all very friendly and welcoming and the reception is manned 24hours. Overall we thought it was excellent value for money and we would definitely stay here again.", "title": "Small but..", "helpfulness": 2, "user": "s0kutatsu", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 111449814}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The only minor complaint I had is that they use rubber backed sheets on the bed and although this is becoming common practice in hotels, I find them uncomfortably hot and it was disappointing as the rest of the bed linen, duvets and pillows etc were high quality and comfortable.", "title": "Best value in Paris", "helpfulness": 3, "user": "catman460", "date": "November 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50162664}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "..very clean, modern and the STAFF are VERY FRIENDLY !", "title": "disappointment ! this isn't aboutiqe hotel.", "helpfulness": 3, "user": "angi_9", "date": "August 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 38474850}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We ended our trip with three nights in Paris and unfortunately it was at this hotel. We booked the hotel due to pricing and location. What a mistake. Some of the front desk people were friendly while others didn’t bother to make eye contact. The hotel is on a small side street close to the Arc de Triomphe. There are restaurants, ATMs, laundry all within a block. However the hotel is sorely lacking in space or amenities. We booked a triple room for three adults. The lobby is quite small and one person works behind the desk. There is a one person elevator or a winding staircase with awful blue carpeting. When the person at the desk saw how many bags we had, she offered to keep some of our luggage downstairs because she was unsure if it would fit. Even though the offer was nice, none of us felt comfortable with that suggestion. One person went up in the elevator with a suitcase while the other stayed in the lobby. The second person sent the rest of the bags while the first person got them off the elevator. When we opened the door, I could not believe how small it was. Not only was it small, but it reeked of smoke. I had been to Paris before so I was a bit shocked. The bathroom was even smaller. There was a queen bed and a single bed, a table and a cabinet with a safe. We had one large suitcase per person and one carry on. We had to stack them on top of one another. The bathroom had no shelving to set anything out. The towels looked like the towels my husband uses to wash our car. I went downstairs to tell the receptionist about the smoke and she said it is a non-smoking hotel, but they can’t do anything if someone in the room smoked. The maid came in and sprayed a bottle of solution in the air (and on us since it was so small) to get rid of the smell. Didn’t help a bit. That night, all you heard was banging, people going up and down the stairs etc. The second morning of our stay, someone was banging on our door. I wasn’t sure what to do because there are no peep holes. Here it was the receptionist asking us for the iron from the day before. Somebody else wanted to use it. I lay back down to hear the fire alarm go off. My husband opened the door and people were leaving their rooms with their hair sticking up. We didn’t know if we should leave or stay. My husband went downstairs to find out what was going on when the receptionist said they burnt toast in the toaster and they cannot shut the alarm off, it had to run for 5 minutes. Just what you want to experience while you are on vacation. There was no offer of a discount or anything for the interruptions. If you can find another hotel, do it. I would not recommend this hotel.", "title": "There has to be something better; fire alarm", "helpfulness": 1, "user": "Joni010", "date": "November 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 145105147}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "We stayed in this hotel for a week for my training in Paris. It is strategically located (2mins walk to Charles de Gaulle Ettoile) and close to a lot of great restaurants. I like it because its very convenient, the rooms are well maintained and the staff are very friendly. Breakfast is decent.", "title": "Strategically located, rooms are lot bigger than ive expectes, friendly staff", "helpfulness": 1, "user": "elynoremarie", "date": "September 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 141313237}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed 2 nights recently before going on a river cruise and thoroughly enjoyed it and would recommend it to fellow travellers.Great staff that are helpful and speak english.. Our room was very well appointed and spacious. The buffet breakfasts are the BEST..so much variety and the food is excellent quality. Very handy location to attractions,restaurants,metro and even a mini market.Great stay.", "title": "Great location", "helpfulness": 1, "user": "RonicaAuckland", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135462987}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "I stayed two nights. Staffs are nice and helpful. The staff at reception speaks fluent English! He is very helpful and nice, he always smile. Room is very well decorated, very very clean. Location is excellent! I will stay here if I cone to Paris again.", "title": "I love it! I love the room, location, service!", "helpfulness": 2, "user": "Bibibala", "date": "December 29, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122250780}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The hotel doesn't have so many rooms and I had a largish room (was travelling alone) but the toilet/shower room was small. When I sat down on the loo my legs are touching the wall (and I am not fat!) and I kept banging my elbow to get toilet paper. The shower was old and water was coming out the sides and getting in my face. The towels were a bit dated and not soft & fluffy", "title": "Not a bad location but average hotel", "user": "KCS", "date": "May 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 160916304}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The bed was not close to the light switch and table for the side I sleep on so had to get a chair to put in between as a bedside table and then get out of bed to turn the bed side light off!", "title": "Exploring Paris", "helpfulness": 1, "user": "Jan P", "date": "March 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 154024134}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The sheets came away both nights almost as soon as I was in bed and I ended up on the mattress a lot which was not so comfortable.", "title": "Perfect situated boutique hotel", "user": "steve63", "date": "February 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152570786}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "There is no lobby as such, just a functional reception desk.", "title": "Excellent Staff!", "helpfulness": 1, "user": "NEKMom", "date": "January 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150689688}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Was located close to Arc de Triomphe (as the hotel name suggests) so not a bad base to go for a walk.", "title": "Lovely Boutique Hotel", "user": "Entertainment100", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148676632}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 3, "average": 7, "very good": 28, "terrible": 1, "excellent": 8}, "aka": "l Hotel Paris", "slim_ranking": 0.447295036252, "description": "We offer services of quality, localisation of the hotel is perfect, near the Champs-Elysées and the business quarter of La Defense."}