{"user_rating": 4.0, "review_count": 310, "name": "Hotel le Notre Dame", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "Loved this hotel- the rooms are divine- bathrooms larger than expected. Staff fantastic. For a 3 star I was thrilled- I am usually a 5 star tossed but wanted to stay somewhere a little quirky for my daughter. Not suitable for older people as you have to lug your cases up the stairs - no porter etc. The concierges were a one woman/man miracle. Would have loved room service. As a 50 year old the location was a bit full on and busy - if I could have picked the hotel up and move it 3 blocks back into a quiet street I would give it 100%:)", "title": "My favorite hotel of all- just a shame about the noisy location.", "helpfulness": 2, "user": "Spreadthelove", "date": "July 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 2.0, "service": 5.0, "rooms": 5.0}, "id": 115358700}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This hotel was perfectly located!!!! We could see Notre Dame from our window! There is a subway stop across the street. And there are plenty of restaurants within walking distance. The hotel was recently renovated and is beautiful (the only negative is the extremely small elevator...with luggage you can really only use it one at a time). The staff is friendly and speaks perfect English. The breakfast is ok; you are better off going to a cafe on your own, unless you are pressed for time. The location is really the reason to stay here, you will not be disappointed!!!", "title": "PERFECT Location", "helpfulness": 2, "user": "mcdhj1980", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 113177811}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Amazing location, and although it was noisy like some of the reviewers have stated it is in the heart of an amazing district with views over the Seine and of Notre Dame. Room was fine, funky decoration which we thought was really cool but a fridge and kettle would have been good. Probably not a good hotel if you can't carry your bags as the lobby is up a flight of stairs from the street. Reason for only three stars is that on our last night there was loud banging below us from ten until eleven-thirty and smoke rising through the floor, followed by a really unpleasant smell of chemicals - went down to reception and found them welding one of the beams in the ceiling below us. Our complaint was met with a \"sorry, but we had to do it\" - it should have been done in the daytime, or we should have been warned and offered a move to another room. Poor ending to a great stay.", "title": "Fab hotel but final night ruined", "helpfulness": 2, "user": "CarlandSuzanne", "date": "June 11, 2011", "detail_rating": {"service": 4.0}, "id": 112744319}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I have just returned from a three day stay with my daughter. It was my daughter's first trip to Paris so I asked the hotel to give us a room with the best view. We had a corner room on the fourth floor and we could see Notre Dame , lit up at night, from our bed!! The area is lively and exciting and within a short walk from many of the major attractions. The hotel staff could not have been more helpful - any questions we had were answered or researched immediately. Cant wait to go back ! On the first morning we had breakfast at a local restaurant but found it to be expensicve. The second morning we had breakfast within the hotel ( with the same views) it was very good and excellent value.", "title": "Fabulous location and wonderful staff", "helpfulness": 1, "user": "TheWilds42", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 112687156}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "This hotel is situated in a convenient location next to many food and tourist places. The rooms are clean, well air conditioned, and superbly decorated! The staff are very friendly and helpful. As a young traveller staying alone I felt very safe. I would come back here again and recommend it to anyone!", "title": "Amazing Hotel!!", "helpfulness": 4, "user": "caelac08", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 111142835}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We arrived at the Hotel in the afternoon and within a few moments of checking in we were able to explore the area surrounding the hotel.", "title": "The best location you could possibly have for exploring Paris", "user": "4hindstrete", "date": "April 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 102402352}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We were in the centre for everything we wanted - bars and restaurants galore!", "title": "Great value and location.", "user": "SantiRoca", "date": "March 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101838421}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The view from our room was spectacular as we could see the Notre Dame Cathedral.", "title": "What a view!", "user": "butterflycats", "date": "March 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 101610839}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "A wonderful sight, especially at night..", "title": "Excelent hotel", "user": "c870262", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100109317}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "It was so easy to access the Metro and when we went back to the Airport it was effortless.", "title": "Noisy rooms", "helpfulness": 3, "user": "PawelL", "date": "February 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 96576834}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The location of the hotel is excellent..we were able to walk everywhere. There is A LOT of noise at night if you are overlooking Notre Dame side. (This is coming from people that live in NYC) The view is just amazing. Outside the hotel, it is a high energy vibe as soon as you step outside the doors- a lot of people, tons of cars on a very busy blvd, souvenir and tshirt shops all around you, hustle and bustle..it reminded me of Times Square in NYC. This was all day and into the night! The rooms were clean and well appointed, the staff were very helpful. We stayed at a quieter hotel in an excellent location on our way back through Paris and enjoyed it a little more for the relaxing, quieter vibe.", "title": "Great Location, A lot of ACTION", "helpfulness": 1, "user": "ntm4", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116159447}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This was the second time that we have stayed at Hotel le Notre Dame in the past two years. The service remains excellent, the bedroom was beautifully decorated and immaculate. We reserved the corner bedroom on the third floor which gives a stunning view of Notre Dame directly across the Seine. We opened the drapes at night and went to sleep gazing up at the gargoyles.", "title": "Personal service coupled with fantastic views has us coming back.....", "helpfulness": 2, "user": "Niamhaine", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116109836}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "A Continental breakfast was available each morning in the breakfast room that overlooked Paris coming to life on St. Michel Blvd. The staff was very friendly and informative.", "title": "Umm.... Amazing location, hotel needs to be gutted and renovated", "helpfulness": 2, "user": "Transient-friend", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 1.0, "service": 3.0}, "id": 115920368}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had a small room, that smelt, had an uneven floor that creaked, barely any closet space, barely any space around the bed at all, teeny tiny bathroom with inadequate shower screen (so you flood the bathroom each time you shower). Although recently renovated by Christian Lacroix (?!) it just seems like a dingy pub covered in pretty colourful wrapping paper. It was not worth €250/night for a room with a view. They simply capitalized on the fact that behind the tree outside my window was the Notre Dame.", "title": "The best location in Paris.", "helpfulness": 2, "user": "McKinney01", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115818322}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Yes! The location is fabulous. Right at Notre Dame in the Latin quarter, with a great variety of restaurants, boulangeries (bakeries) and creperies in the area. Unfortunately this also means relatively high noise level till 4am. We usually sleep late so it wasn’t a huge problem but rooms facing Notre Dame or Seine are not for people who want some peace and quiet.", "title": "WOW, great hotel in a great location", "helpfulness": 1, "user": "BurleighBT", "date": "July 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115781554}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My husband and I stayed here for 4 nights on our honeymoon. It was by far the best hotel we stayed in during our European travel. The room was very clean, the staff was very nice and accommodating. They went out of their way to make us happy, gave us directions, advice, and even helped us with our terrible French.", "title": "Best Hotel of Our Trip", "helpfulness": 4, "user": "KESW", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110728450}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "We stayed for three nights in the corner room, which was large, with a view of Notre Dame and a bathtub. We liked our stay so much that upon our return from Normandy we booked another room. This room didn't have a bathtub (other rooms with bathtubs were booked), so the room was smaller, but we could lay in bed and view the Cathedral.", "title": "Book this for a special Paris experience!", "helpfulness": 4, "user": "JWKD", "date": "May 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 107169575}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I didn't give five stars for value considering the current USD to Euro. At the time it was $1.51 per Euro, which meant we were shelling out 50% more to stay here.", "title": "Great location and staff, but very dusty, cramped and rickety", "helpfulness": 2, "user": "Kseniya_LadyRider", "date": "May 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 106632692}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "If you want to spend a little more in order to stay here, I recommend spending the extra for a bathtub and view of Notre Dame. These two insure you are given a larger room. Otherwise, I don't think this hotel would be worth the price. Taking a bath in a very clean room over looking Notre Dame with a glass of wine is about as good as it gets. I think.", "title": "Amazing view, relaxing hotel", "user": "MissHoolie", "date": "April 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104921127}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Also, the best ice cream of my life is located in the alleyway behind this hotel. Amorinos. May sure you stop by.", "title": "Great hotel, fab location", "helpfulness": 1, "user": "Rce82", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 104231238}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 7, "average": 49, "very good": 117, "terrible": 6, "excellent": 131}, "aka": "Le Notre Dame Paris", "slim_ranking": 0.201896263246, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}