{"user_rating": 4.5, "review_count": 676, "name": "Hotel Murmuri Barcelona", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "I could not have been more pleased with my decision to stay at Hotel Murmuri for a Thanksgiving week mini-vacation with a friend. The hotel is located on Rambla de Catalunya with restaurants and shops lining the street. It was steps away from the Diagonal metro, parallel to Paseig de Gracia - a major high-end (window) shopping destination that's also home to Gaudi's La Pedera/Casa Mila (among others), and a 10-15 min walk from La Rambla. It was literally walking distance to everything, so the location could not be beat!", "title": "Fantastic Hotel, Great Location & Reasonably Priced", "helpfulness": 1, "user": "Nitra315", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121156916}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This hotel is the equivalent of a boutique hotel in the U.S. - small, but efficient, quiet, clean and modern with beds, bedrooms and bathrooms sized like US hotel equivalents. I booked a room on the top floor with a private terrace and 2 double beds for under $200USD/night. If we needed new towels or an iron they were just a phone call away. My only pet peeve was that they did not have wash cloths (only handtowels and regular towels), so I would suggest that you bring your own to plan to buy them in town.", "title": "Good hotel for price", "helpfulness": 1, "user": "dgaronce", "date": "November 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120769079}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The front desk staff spoke English fluently and ensured that we were able to check-in immediately upon arrival at 10am. I unfortunately neglected to get the name of one of the women at the front desk who made fantastic lunch and dinner recommendations (Tenorio and Tragaluz respectively) - she was our culinary savior after one too many meals at sub-par tapas restaurants near La Rambla.", "title": "Poor Customer Service", "helpfulness": 1, "user": "Rob V", "date": "November 16, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 120687079}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "When we checked out of the hotel at 5am, they promptly called us a taxi that arrived within minutes. Needless to say, I had a great time, and if my travels take me back to Barcelona, there's no question I would stay here again.", "title": "Exceeded Expectations!", "user": "Ann R", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120447093}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We loved the location, and the rooms were great. Standard boutique hotel- not too cheapy feeling. Do not expect a concierge with knowledge of great local spots (his #1 suggestion for a night cocktail was the hard rock cafe)- but if you have your own plan, which we did, this is a great base in a cool neighbourhood.", "title": "Great Hotel", "user": "Pat Z", "date": "November 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120425243}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "My husband, another couple and I stayed here on our last night in Barcelona. It was our favorite hotel the entire stay. It's in a wonderful location-close to dining, shopping and Gaudi architecture. The staff is extremely welcoming and helpful. The rooms are small and clean, but make the most of their space. We ate dinner at the restaurant in the hotel our first day there and it was delicious. We would definitely stay here again", "title": "Wonderful boutique hotel", "user": "mumiller1", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119488095}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "A well trained attendant staff makes our 5 night stay on the Rambla Catalunya as delightful as expected and much more. The receptionists/ hosts seemed to eagerly answer your queries regarding diner, sightseeing, transportation options and all of your needs in a quite professional manner; and always utilizing custom marked maps highlighting your needs. The bar was well manned and intimate. The area surrounding the hotel offers fabulous Tapas and Catalan diner options, chocolate shops and local breakfast at cafe Francesco around the corner had great fresh squeezed OJ, cafe cafe con lesche and a traditional ham or veggie sandwiches. Location ideal for all public transportation including the Aerobus from the airport. Props to Maria C, Roberto, the movie star look-a-like, Frank, and Nick.", "title": "Staff and Service excel at this Barcelona Hotel", "helpfulness": 1, "user": "Kendotm", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119335374}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Great stay for two nights post a Med cruise. The Privilege Double room was large w king bed & very comfy. Bathroom offered all the comforts of home: clean, robes, slippers. Street noise on a Friday night wasn't too disturbing. Hotel bar is very pricy. Cafe Mauri around the corner is great for a snack/coffee, tea, etc. Enjoy the city and walk your legs off!", "title": "Without hesitation", "user": "dtvl", "date": "October 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119310424}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "The location was good if you prefer to be away from the hustle & bustle of la ramblas. Very expensive to eat & drink at the hotel bar & restaurant, however why would you when there are so many outside your door.", "title": "Meet expectations", "user": "Petracca", "date": "October 14, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 119286643}, {"rating": 1.0, "stay_parameters": "Stayed October 2011", "text": "Room was clean & looked like the photos however quite small. Internet was in Spanish only", "title": "Sadly, primitive internet capability kills it.", "user": "andyrama1", "date": "October 11, 2011", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 119200044}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Friends and I were delighted with this find in Barcelonal. Centrally located, but just enough off the \"path\" to offer quiet nights and safety. The staff is very accomodating, nelpful and friendly to language challenged guests. Breakfasts are terrific offering", "title": "Well kept secret in Barcelona", "user": "marianne a", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120025930}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "superb breads/sweet pastries, along with meats & cheeses, eggs, coffee and teas; then, you can request cooked-to-order directly from the kitchen for a few eruos more than the standard breakfast fare. Rooms are very clean and large with a neat seating area/balcony with windows overlooking interesting housing and roof top gardens. We enjoyed watching waiters from a nearby restaurant take their \"smoke breaks\" on the roof of one building. They were telling jokes, laughing, smoking and in general having a great time on their break. Fun to see, even if we couldn't hear them.", "title": "Lovely Hotel,great location.", "user": "harrybBunbury", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119931322}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Great Small hotel,Pleasant & helpful staff,comfortable beds and rooms.Best Location in Barcelona.", "title": "Apartment hotel", "user": "RoboRuth", "date": "October 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119863452}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We had a very spacious, ultra-modern, clean 2-BR apartment attached to the Murmuri Hotel for 439Euro/night. It had a kitchen (with dishes) and a large deck (with deck lounges and table-and-chair set). View out the back is nothing to write home about, but the apartment was quiet and centrally-located. Internet use was only 10Euro for 24 hr. Hotel has a lovely bar and small restaurant, and there are plenty more to choose from in the neighbourhood. Would definitely stay here again!", "title": "Lots of positives but a few noteworthy minuses", "user": "TxTree", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 119773924}, {"rating": 3.0, "title": "Very small Room!!!", "text": "My family and I recently stayed for five nights in one of the 2 bedroom apartments (Liceu). There are lots of reasons to like this hotel, but a couple of annoyances kept me from loving it.", "user": "rosebud10", "date": "October 22, 2011", "id": 119589903}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "We booked through the website Mr and Mrs Smith on arrival the hotel had upgraded our room to one with a terrace, the room was small but very comfortable and nice, a little on the dark side, however was a little suprised that this room was a step up from the one I had originally booked so am not sure what that would have been like. The staff were pleasant and polite.", "title": "Great Location", "user": "barnyardMoraira", "date": "November 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120409345}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The breakfast however was horrid, the buffet was fine but we made the mistake of ordering poached eggs and bacon, truly terrible, inedible, and for 16 euro unacceptable, normally I would have complained, I had a terrible cold and just could not face the hassle.", "title": "Nice hotel, nice staff and great location but internet charges are expensive", "helpfulness": 1, "user": "Lillias", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120317696}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Our first night we had dinner outside on the terrace, I was sorely disappointed, very expensive.So yes all in all excellent location, a pleasant enough room just terrible food. So just dont eat there.", "title": "I recommend it for its modern style & for its location next to subway station (Diagonal) but not for their service.", "user": "Engaa", "date": "November 7, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120311344}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "My husband and I stayed here in two rooms with our two teenagers for a couple of nights en route to the UK. We arrived straight off a long haul flight at 10 am and they had one room available for us immediately and I was very grateful for that. The rooms are very small. I don't normally bother that much about size as you are on holiday and usually out and about but with large suitcases in tow, it actually makes quite a difference. Our second room was avalable about an hour and a half later which was really great. The only drawback was that the rooms weren't near each other. Even though my kids are teenagers, I like our rooms to be nearby, it's much easier when we're sharing suitcases and one night someone tried the door on our room. This was probably another guest who'd made a mistake but at 3 am, if it had been the kids' room, and they aren't next to us, they'd have got a scare. After our early check in, we came back in the evening and our rooms had been cleaned with fresh towels provided since we'd all had showers that morning. A nice surprise.", "title": "Overrated. Overprized. Lacks the details.", "user": "Alecprime", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120078366}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The hotel is really nicely decorated, all the staff are very nice and very helpful and the location is excellent. The drawbacks are that the rooms are small, as previously mentioned and there was no tea/coffee making facilities in our rooms and the mini bar was expensive, as is usually the case in hotels (over 3 euros for a small bottle of water).", "title": "Chic and comfortable", "helpfulness": 1, "user": "GrouchyOldMan", "date": "November 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120075840}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 10, "average": 45, "very good": 206, "terrible": 16, "excellent": 399}, "aka": "Hotel Murmuri Barcelona Catalonia", "slim_ranking": 0.0669216061185, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A new concept of Boutique Hotel opens in Barcelona in March 2008. Murmuri Barcelona is getting ready to surprise you, please you and serve you. A meeting point in the Rambla Catalunya where you can delight in the murmur of the constant throb of the city. Created in an intimate style, with reminiscences of classicism, not forgetting the most modern and sophisticated design."}