{"user_rating": 4.0, "review_count": 178, "name": "Hotel Am Parkring", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Stayed here 4 nights late September, 2006. The lobby/reception area is being moved and entering the hotel and getting to the elevators involves literally walking through a construction site. Ceiling tiles were missing with electrical wires hanging down and several workers present making considerable noise. However, none of this could be heard from the room and was only encountered entering and leaving the hotel. No internet access unless you bring your own laptop, but the Marriott next door will let you use their business center at a reasonable price (the AM Parkring directed us to an internet cafe which was many blocks away). Room and breakfast were fine, although the dining room was full once with no place to sit except with other guests at same table.", "title": "OK, depending on what you like", "user": "Westshore", "date": "October 11, 2006", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5938448, "likes": {"liked": "— Clean", "disliked": "— Construction in hotel, no internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Location of hotel is OK. Hopefully I will return to Vienna but will stay closer to the Opera as the museums were my primary interest. Overall Vienna was wonderful and I would love to return.", "title": "Very convenient location", "helpfulness": 3, "user": "Steve-G23", "date": "October 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5935901, "likes": {"liked": "— Location and price", "disliked": "— Rather impersonal, with no real communal areas"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We selected the hotel for its value and convenient location close to the city centre and with easy access to the main sights and the underground. Despite the fact that the hotel is in a prominent position on the Ring we had difficulty locating it because its ground floor does not front onto the road and signing is poor. Whilst the reception is on the ground floor, hotel rooms are on the top floors of a 13 story block, which makes for good views across the city. Our room was spacious and well furnished, with a very comfortable bed and easy chairs, and was kept spotlessly clean. Breakfasts were high quality and the restaurant also, though quite pricey. Staff on reception were very friendly and always able to provide helpful advice. We had a special deal by booking and paying well in advance, which meant that it was excellent value, especially for Vienna which is an expensive city.", "title": "Great Location", "helpfulness": 1, "user": "mkannur", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5930245, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We stayed at Vienna for only 1 night . This hotel was located very close to the main city attractions( walkable) . The front desk was very friendly and helpful. Breakfast was good though the room was a bit crowded.", "title": "Great Location", "helpfulness": 1, "user": "mkannur", "date": "August 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5624427, "likes": {"liked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "The room was extremely modern and had a fabulous view.", "title": "A good choice", "user": "jinnyt", "date": "July 20, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5490047, "likes": {"liked": "— location", "disliked": "— restaurant staff"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Stayed here in two room with my husband and kids the week before Christmas. Quite comfortable. The kids room (2 single beds) was dorm-like, our room (double bed) was quite spacious. Both rooms had wonderful open city views, large, bright recently renovated bathrooms, and refrigerators. Free breakfast was great. We paid $119/nt for the dble room & $99/nt for the kids room. Staff was helpful (extra blankets, pillows, taxi to airport, fixing a fuse we blew). Walking distance to all major attractions, near the underground.", "title": "Excellent value, good location", "helpfulness": 4, "user": "barlovian", "date": "December 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4300593}, {"rating": 5.0, "title": "Great Value for the Price!", "text": "My husband and I stayed in this hotel May 11 - 18, 2004. We paid $131 Euro per night which was a reasonable price in this area. We had an adequately-sized room with a strong shower and view of Vienna above the roof of the American Embassy. It was clean, quiet and the staff was very accomodating. The hotel provides free internet access in the lobby. The room charge includes a full American breakfast - eggs, bacon, ham, cereals, fruit, champagne, juices, danishes, etc. It is served in a charming room on the top floor with a great view of Vienna. The evening dinner is served in the same room. The hotel's currency exchange rate was much better than American Express or the airport. It's a short walk to cafes, shopping and the center of Vienna. It was a wonderful oasis after time in the noisy and hectic main square in Vienna. Many people told us it is their favorite hotel in Vienna.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "February 15, 2005", "id": 3186501}, {"rating": 3.0, "stay_parameters": "Stayed August 2004", "text": "Charming location on Parkring, across from Stadtpark. Room reminiscent of a railroad sleeper car--no room to do anything but shower and sleep. Fortunately, in Vienna, there'd rarely be any reason you'd want to stay in your room. Breakfast very nice. Room price reminiscent of those charged by OPEC (whose offices are just down the street). Would stay here again, if the prices were lower.", "title": "A place for Sleep, Shower, and Breakfast", "helpfulness": 4, "user": "Roskolnikov", "date": "August 30, 2004", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 2503559}], "location": {"country": "Austria", "continent": "Europe"}, "stars": 4, "variance": {"poor": 6, "average": 21, "very good": 64, "terrible": 5, "excellent": 82}, "aka": "Am Parkring Hotel", "slim_ranking": 0.1689373297, "description": "The 4-star Hotel Am Parkring, located in the 11th through 13th floors of the Gartenbauhochhaus along the elegant Ringstrasse, offers the finest views of Vienna. Whether in the rooms, suites with roof-deck, the gourmet restaurant \"Himmelsstube\" or the presentation room - in the Schick Hotel Am Parkring you'll enjoy a magnificent panoramic view. The 58 rooms and suites are tastefully furnished and equipped with modern technology, high-speed internet and air conditioning."}