{"user_rating": 4.5, "review_count": 543, "name": "Hotel d'Aubusson", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "My son and I stayed at this hotel on the left bank for a week during his spring break from school. We felt as though we had found the secret to a wonderful, comfortable, and friendly stay in Paris. This hotel has a first class location just over a block from the Pont Neuf on Rue Dauphine, within easy walking distance to the Louvre, Saint Chappelle, Notre Dame and, in the other direction, the main shopping district of St. Germain du Pres and the Luxembourg Gardens. The nearby Metro stop is convenient, just one stop away from Musee d'Orsay (though the Musee d'Orsay also is an easy 10-15 minute walk) and, best of all, is on the main line for the train to Versailles (we went twice). On a sunny day, we walked all the way up to the end of the Champs Elysee and the Arc de Triomphe but it was a bit of a hike. Our rooms, which were the smaller, less expensive rooms on the front side facing the street, were clean, comfortable, cozy and quiet with pristine baths, plenty of hot water and fluffy towels. Each room had a working desk, a sofa or easy chair and a tv with BBC and CNN as the English channels. The front desk is incredibly helpful, particularly with dinner reservations and tips on where to go and we found the service to be first rate -- from the front desk to the breakfast room, housekeeping and the bar. The breakfast is just wonderful and while it seemed expensive given the fall of the dollar, it really is a great value for the price (eggs, oatmeal, fresh fruit, croissants, pastries, etc.). Good coffee and hot chocolate too. There are a number of terrific restaurants within easy walking distance - we especially liked Les Bouquinistes which is a Guy Savoy restaurant 2 blocks away toward the Seine and a cafe called Cafe Atlas about 2 blocks in the other direction. The hotel has a jazz concert in the bar every afternoon and there is internet access from a computer in the bar and another computer off a nook toward the back. An altogether pleasant and thoroughly satisfactory stay.", "title": "A wonderful place to stay!", "user": "LemonGingerRose", "date": "June 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16782785, "likes": {"liked": "— the location and the service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband and I stayed for 5 nights and we had a wonderful time at the hotel. The front desk was very helpful, the location of the hotel was perfect (close to the river and Rue Buci where there is a lot going on at night) and we enjoyed the quaint feel in the lounge/bar area. We absolutely adored the decor of our room as well as enjoyed the central courtyard for a mid afternoon glass of champagne. We will definitely be back!", "title": "Wonderful Experience!!", "helpfulness": 1, "user": "LuvMyPug2008", "date": "June 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16670091, "likes": {"liked": "— The Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Outstanding in every respect. I made arrangements with the concierge in advance of arrival for some champagne and flowers in the room for my wife's birthday. The instructions were carried out perfectly and to great effect!", "title": "A perfect hotel in the best location in Paris", "helpfulness": 1, "user": "Mark W", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16648718, "likes": {"liked": "— The location and the excellent personalized service.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Room was beautiful and the bath was large and beautifully appointed.", "title": "The Jewel of Paris", "helpfulness": 2, "user": "AleksinToronto", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16641008, "likes": {"liked": "— Exemplary service in an ideal location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The d'Aubusson is in a perfect Left Bank location that is also near the Louvre and other popular Right Bank sights.", "title": "wonderful room in great location", "user": "Paris1scarf", "date": "May 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16470017, "likes": {"liked": "— comfortable bed and air conditioning", "disliked": "— Diverter was not working so we had to use hand shower."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Our family stayed in the Hotel D'Aubusson in May 2008. The location is terrific, just a block off the Seine and just a block to a selection of terrific restaurants for dinner and patisseries for a nice morning sweet.", "title": "Great location, every detail is perfect", "user": "tramac", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16183681, "likes": {"liked": "— location, staff, room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I chose the hotel based on reviews on TA. I contacted them directly with several quesitons, as I have a person in a wheelchair, so I had specific needs. They were extremely responsive via email. Once I booked the hotel, I found out a family member stayed there a few years ago and loved it. So, I had High expectations.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "Me_Too_As_Well", "date": "April 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15240140, "likes": {"liked": "— Pretty much everything", "disliked": "— Having to check out"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Once we arrived, every detail in the hotel was perfect. The rooms were very spacious and very clean. The entire staff truely made us feel welcome and were very attentive. The hotel offers every service one might need. Little details, like a small treat left most every evening for us - champaign, macaroons, etc was an unexpected treat. The hotel lobby, bar and living room area were also very nice and welcoming.", "title": "A Winning Hotel on the Left Bank", "helpfulness": 3, "user": "NewJerseyWanderlust", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14528558, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My wife and I stayed here for four nights in October 2006, having picked the hotel from a 'Top 10' Paris guide.", "title": "I Should Definately Stay There Again", "helpfulness": 2, "user": "doly", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14005609, "likes": {"liked": "— position, staff", "disliked": "— the size of the room"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "We booked directly through the hotel website, and opted for their 'Romance' package (I need all the help I can get . . . !). That came with a pick-up from the station, a bottle of champagne and a dozen red roses on arrival, two free tickets for a Seine cruise, two free passes for the Louvre, and a champagne lunch.", "title": "Loved the d'Aubusson!!", "helpfulness": 2, "user": "jeanniedc", "date": "February 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13718241}, {"rating": 1.0, "title": "The reviews here are absurd, terrible value.", "text": "I regret to say that the D’Aubusson was so disappointing my wife and I left after an hour. The room was 500 Euros, and it was a basic room (Jr Suite) with some extra square footage, low quality bedding and furniture, and AC that was insufficient. The bath had no separate shower, which is expected at 500 euro plus. The elevator had no air flow/fan and was insufferable. There was no phone in the room. Their parking elevator was acting up so if they parked your car they might not be able to get it out. No door man at arrival for luggage. This is bargain basement at its best. Just pathetic.", "helpfulness": 14, "user": "traveltoomuchToronto", "date": "August 23, 2011", "id": 117147083}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This hotel is for bargain mongering Brits that want to stay on the left bank cheap and is not worth 200 euros.", "title": "Fantastic location but a bit pricey", "helpfulness": 6, "user": "Lizcat", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116959670}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We went to the Hotel De Crillon, and were treated properly with a great room, some luxury, for a little more than D’Aubusson .", "title": "Never come to paris and not stay here", "helpfulness": 3, "user": "NLPP_11", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116747655}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My partner and I stayed here from 4th - 8th August and as a special treat we chose this hotel for it's luxury having read great reviews. Don't get me wrong, we had a lovely stay. The room (306) was very spacious, with a huge bathroom and it was very quiet at night even with the windows partially open. The staff were all friendly and there was quite a large choice of breakfast items, with you being able to eat as much as you wanted and it was all very nice. As for the location, it's fantastic for arriving from the airport by train, easy to stroll to many of the major tourist sites and easily accessible to the metro for trips further afield or slightly away from the main Parisian centre. There are loads of restaurants and cafes in the near vicinity too.", "title": "Perfect hotel and location", "helpfulness": 3, "user": "MaryHogan", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116747286}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "However, there are a few points that I would make and these are made because of the cost of a nightly stay - £285 for 2 people b&b at current exchange rates - and for no other reason. I did put these comments on a card at the end of our stay. We realise Paris is not a cheap city but have visited several times before, staying in cheaper hotels that have given better value for money. Sorry!", "title": "Quite nice", "helpfulness": 1, "user": "Curnutte", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116664338}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I drove myself absolutely crazy trying to pick a hotel in Paris. So many to choose from, conflicting reviews and where to stay, right or left bank. This was my first time in Paris and I was traveling with my whole family (8). I finally decided on the left bank and the Hotel d'Aubusson. I was not disappointed. First of all I am so glad I chose the Left Bank as it was only a 5 minute walk from our hotel over the bridge to the right bank and many Paris attractions. When we returned back to the hotel at night we were surrounded by an entire neighborhood of restaurants, cafe's and bars. It is so beautiful to wander around the area. Everyone is sitting outside, music is playing. Wonderful area to be in and felt very safe.", "title": "Absolutely the right choice", "helpfulness": 2, "user": "lattelite", "date": "August 10, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116519057}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "We were within walking distance to most of the main sightseeing sights. The Eiffel Tower was a good 45 minute walk but in going there you pass many other sights and it is a beautiful walk along the Seine. We did take a taxi there one night though as it was late. The are by the hotel is busy and if you leave your windows open at night it will be noisy but all the rooms have 2 sets of double panes on the doors and when closed you hear nothing. We enjoyed opening our windows during the day to hear everything below. The hotel staff are just A+. We arrived late at night and were greeted outside by several employees helping us to get to our rooms. Everyone who worked here was extremely polite and helpful. Thank god they all spoke english. The rooms are good size by Paris standards. Bathrooms are very nice. Our rate included breakfast which was awesome. Fresh squeezed juices, pastries, cereal, yogurts, fresh cut up fruit, eggs, bacon sausage, potatoes, veggies etc. Wonderful breakfast each morning. We also had a free boat ride on the Seine. The boats leave from Pont Neuf which is 5 minutes from the hotel. This was a wonderful cruise. We went early evening as it was cooler and less busy. The hotel provided us at a minimal charge, tickets to the Louve. We were able to walk right to the front to get in, this saved at least an hour or more in line. Thank god as it was very hot the day we went. Each morning we would stop at the front desk. Tell them where we were heading and they would draw on our maps the best routes, give us ideas for lunch, tips on the area etc. I really can't say enough about them. In the end I came down to 3 hotels to choose from. Relais Christine, Hotel Luxembourg Parc and d'Aubusson. We went to see the other 2 hotels as I was curious. Relais Christine is just around the corner. 30 seconds from d'Aubusson. This hotel is also beautiful. Gorgeous courtyard. The advantage to staying here is that it may be a little less busy as it is on a side street. We needed multiple rooms and the difference in price added up so that is why we didn't go here. Luxembourg Parc looked very nice but the location would not have been good for us. It is right by the Luxembourg gardens which are beautiful and worth a visit but it would take a good 15 minutes just to get to the Seine. The area also gets quite at night. After a long day sightseeing you don't want to have to walk back that far to your hotel. We loved d'Aubusson and would definitely return. There are also several other hotels on the same street and numerous within the area. some are cheaper but the area is the best.", "title": "Beautiful rooms, excellent location", "user": "Alexanasta", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116460539}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Loved this hotel! Travelled with two teenagers and rooms were big considering French standards. Location was walking distance to a very vibrant area! Staff very helpful, good breakfasts. You won't be disappointed...", "title": "Cafe Laurent in the Hotel is a truely wonderful.", "helpfulness": 1, "user": "Susan2dboots", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116362042}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We didn't stay in the hotel 2010, we have in past years, and it is very lovely. We chose their sister hotel so we can travel to our beloved Paris more frequently. The Café Laurent is a part of the Hotel. My review is for the Café Laurent. I have to disclose our dear fondness of Flavien who can kick his leg up to the sky, & Arnold with the most beautiful eyes. They are our adopted son's, without their consent in Paris for the past 12 + years. Jazz by Christian Brenner fills the place three times a week; he is a gifted and most talented and has guess talents as a wonderful surprise. We have enjoyed and appreciated Christian for more than 10+ years. I'm trying to write a helpful review; hopefully I have done so. Most Sincerely, Susan", "title": "Nice Botique Hotel in a Great Neighborhood", "user": "roctraveler1", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116323847}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The room was in good shape for the age of the hotel. The bathrooms were updated. The lobby and sitting room are very nice. We stayed for three days over our10th wedding anniversary and got the VIP package. The manager left us a nice note upon arrival. We received a bottle of champagne the fist night and a bottle of wine our last night. Included in the VIP package was a river cruise on the Seine, a reservation for afternoon tea and breakfast every morning. Breakfast was delicious. The staff was friendly and very helpful the first two nights. There were different people on staff on the third day and they were not quite as friendly and helpful (on a comparative basis). The location could not be beat. We were within a short walk of most museums and tourist locations and the Metro was only two blocks away. The only thing that left a bit of a bad taste with me was that the hotel charged us a 20% premium over the actual cost of a 4 day Museum Pass when we purchased them at the front desk. They didn't tell us when we purchased them...and I didn't ask. It was only Euro 20 so it was not a big deal but it was my last dealing with the hotel as I noted the price upon check out. Overall, I think it was a very good experience and we would like stay there again.", "title": "Fabulous hotel in the best location in Paris", "helpfulness": 1, "user": "Deniseadvisor", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116142744}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We decided to make a short visit to France and splurge a bit. We found the hotel d'Aubusson on the Internet and were intrigued by the fact that they had jazz in their lounge. What a good choice! Not only was the music terrific but the entire experience exceeded our expectations, The location is excellent, the room and ambiance are total quality, and the entire personnel treated us like we were their special friends. A bit pricey and well worth it.", "title": "A special visit", "helpfulness": 3, "user": "millerbjohn", "date": "November 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10960769}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We stayed at this hotel for one week in late October 2007. We chose it due to the excellent reviews we have read but mostly for the location. It was two blocks from the Seine and Pont Neuf.", "title": "Perfect Location", "helpfulness": 5, "user": "Esther32", "date": "November 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 10945373, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Therefore, we could easily walk to the Louvre, Notre Dame, San Chapelle, The Orangerie, The Cluny and many other sites on our list. The Odeon metro stations was a 4 minute walk.", "title": "Warm, friendly, wonderful!", "helpfulness": 2, "user": "Travelbugtoo", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10905712, "likes": {"liked": "— The staff!", "disliked": "— The bed was a little hard........but that is just me!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The room had wifi (not free) which we needed for our business.", "title": "Small Gem in the Center of Paris", "helpfulness": 3, "user": "seery1", "date": "November 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10643088, "likes": {"liked": "— Location", "disliked": "— Bath Towels"}}, {"rating": 5.0, "title": "No Disappointments - Very Satisfied", "text": "Before we arrived we had contacted the concierge to make a few dinner reservations for us which went perfectly. While there, the staff was helpful when we needed them. We did not buy the breakfast package as we preferred to do it the Parisian way and start at a cafe every day. The only strange thing was that housekeeping showed up at about 10pm each night for turn down service which was not convenient but hardly anything to complain about. The rooms were pretty and very clean. I would recommend this place. Do not expect to get into your room one minute before check in time. Jet lagged or not, it was made clear to us that this would not happen. Though we landed at 7am, we gained at access to the room at 3 pm. So, plan your first day with that in mind.", "helpfulness": 6, "user": "CM601", "date": "October 22, 2007", "id": 10225956}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We were highly impressed with Hotel D'Aubusson. I am comfortable with French, yet every staff member was also completely capable with English and more than happy to use it. Everyone staff member we encountered was helpful, greeted us with a smile and went the extra mile. The rooms are modern and comfortable. The buffet breakfast is very good and includes several hot items. The location could not be more ideal. Easy walking distance to many of the great monuments. Small hotel and cozy for those who prefer something smaller to the large hotels. Only downside was often even at 3pm the room had not been made. The hotel was so great we overlooked this one inconvenience", "title": "Charming Atmosphere In A Perfect Location", "helpfulness": 1, "user": "TravelBugsForever1", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115930684}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We stayed here for one night. Knowing Paris quite well I also knew that this hotel was in quite a touristy area (St Michel/Odeon), but the road it's on is a quieter one than many around it and leads straight up to Pont Neuf. The hotel itself is small but really nice, with a lovely inner courtyard for drinks and/or breakfast. The standard rooms are ok but not overwhelming (really nice Hermes toiletries though). What did stand out though was the service - the people at reception went out of their way to make us feel comfortable and were extremely helpful with all our issues (most notably getting a restaurant that was just what we were looking for - relaxed atmosphere with a modern French cuisine - Christine round the corner from the hotel). Would come back here even though St Michel is not my favourite area in central Paris.", "title": "Lovely hotel, really good service, great location", "helpfulness": 2, "user": "PuffleIreland", "date": "July 26, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115792720}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "From the moment we were greeted at Gare du Nord by the driver sent by Hotel d'Aubusson, we knew we had made the right choice of hotels. We were given room #507 which is a corner apartment on the top floor. It was roomy and comfortable for 3 adults: there was a king bed and a twin and still plenty of room to walk around, a table with 2 chairs, a desk and a wardrobe. The bathroom was spotless and had a shower and tub with plenty of fresh towels and Hermes toiletries! Because we were in a corner room, we had 3 windows that opened. The weather was cool for July so we enjoyed the cross-breeze. At night, there was noise from the street but as soon as we closed the window, we couldn't hear it at all. Because we had booked with a summer promotion, we had breakfast included every morning...it was a perfect start to the day and so convenient before heading out to explore Paris. And as for convenience, this hotel is just in the most perfect spot. Returning from a full day of wandering all over Paris, we could always find that special place for dinner within a block or two. Tons of cafes, brasseries, or a fresh gelato cone or fresh-made crepe were just steps away. When we ever get back to Paris, we'll stay right here at Hotel d'Aubusson.", "title": "Everything we expected!", "helpfulness": 2, "user": "deeloef", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115731909}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "wow- where to start?", "title": "Perfect Location, Phenomenal service, Charming living areas", "helpfulness": 3, "user": "Doby47", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115633055}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "LOCATION-- The location is perfect. I much prefer the 6th district (and it little boutiques, cafes, bistros and art galleries) to any others. The hotel is not deep in the 6th though- it is close to the river so you can walk to the Louvre, Notre dame and all the bridges and go the rightbank. On the south side of it you can wallk to St Germiane cafes, theaters etc.", "title": "Old world charm with modern conveniences", "helpfulness": 1, "user": "annecw_10", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115447627}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "My wife, 14 year old son and I spent three generally pleasant evenings in the Hotel D’Aubusson in June, 2011. I recommend the hotel.", "title": "A good choice in Paris", "helpfulness": 2, "user": "OrrvilleRedRider", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115426882}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We had two rooms adjacent (but not adjoining) each other on the 3rd floor (floor #2, in European parlance). Our son had a “classic room” and we had a “superior” room. Both rooms over looked the Rue Dauphine. Although the street is rather narrow and heavily trafficked during the day, two sets of double pane glass doors meant that street noise was never an issue.", "title": "Beautiful", "helpfulness": 1, "user": "ABHayes", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115424458}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Both rooms had a small table with two comfortable chairs, as well as a desk with a chair. The beds were queen sized, and were comfortable. We had two windows (floor to ceiling double french doors each) and I was pleased with how bright the room was. Our son’s room, which but one window, was somewhat darker. The bathroom had one sink and tub/shower combo. Amenities were my favorite – Hermes green orange. Linens and towels were of high quality. There was plenty of storage space in a wall of closets in the entry foyer in each room. Lighting in the room was good.", "title": "Lovely home base in Paris!", "helpfulness": 1, "user": "foleymomma", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115387213}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "During our stay the A/C worked well, although it never truly cooled the room beyond comfortable. Since the weather was mostly in the 70’s or lower while we were there, it made me wonder how the air conditioning would do in truly hot weather. That said, I had no reason to complain.", "title": "Loved the location and the staff!", "helpfulness": 1, "user": "maccc", "date": "July 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115213950}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Breakfast was decent by the standards of French hotels. There were the standard hot options – eggs, potatoes, bacon and so forth. And the fruit and bread selections were plentiful.", "title": "This Hotel has everything: Charm, Location, and Peerless Customer Service", "helpfulness": 3, "user": "JFC90", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115068593}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed at the d'Aubusson for our honeymoon based on reviews on TripAdvisor and we were not disappointed. The hotel was charming. Our room had high ceilings with wood beams, a very comfortable bed with a fluffy duvet, and a spacious, clean bathroom. The service was wonderful from the housekeeping staff who not only turned down our bed but put out slippers for us each night, to the front desk who were helpful and friendly. The breakfast was a full meal that was graciously served. The hotel is situated just a few blocks from Blvd. St. Germain and near the Pont Neuf bridge - just across the Seine from the Louvre. We would defintitely recommend this hotel.", "title": "Wonderful Hotel! Wonderful Location!", "helpfulness": 2, "user": "chetravelers", "date": "January 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 13108033}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My husband & I just stayed 6 nights here over New Years 2008. We had a great experience in Paris thanks to the hotel. The staff was extremely friendly & helpful. We had difficulty with the language, but mostly everyone spoke English to accomodate us. We were upgraded 2 room levels on arrival, which was a pleasant surprise.", "title": "Definitely Recommend!", "helpfulness": 7, "user": "heysarahbeth", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12746953}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The rooms were very clean. They had turn down service & there was always a little treat waiting for us in the evening (i.e. orange candy, chocolates, pears). The concierge was helpful. The front desk made dinner reservations & booked a train to Belgium for us. The buffet breakfast was a nice addition - cheese platter, large assortment of breads & pastries, cold cereal & but a relatively small selection of hot food by American standards (i guess my complant is that it was the same food every day - never changed). The steamed milk with coffee was good.", "title": "Great Hotel, service and location", "helpfulness": 4, "user": "Nonrevpej", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11887886, "likes": {"liked": "— Clean, spacious, quiet, room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The location is great! So many restaurants in the immediate vicinity. We walked everywhere. I read reviews about the loud music from the bar & noisy street. However, we didn't hear ANY noise from our room.", "title": "Lovely hotel, superb service", "helpfulness": 7, "user": "John-Draper", "date": "December 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 11648062, "likes": {"liked": "— Service, location, rooms", "disliked": "— Breakfast in the restaurant."}}, {"rating": 5.0, "title": "Feels like home", "text": "I would definitely recommend this boutique hotel & would go back myself!!", "helpfulness": 5, "user": "Vitina", "date": "December 7, 2007", "id": 11297270}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 11, "average": 21, "very good": 98, "terrible": 5, "excellent": 408}, "aka": "Hotel d Aubusson", "slim_ranking": 0.0200780814278, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "The Stylish and very attractive Hotel d’Aubusson is housed in a true Parisian mansion dating back to 1634 and located in the very heart of Saint Germain des Prés, a stone’s throw away from the renowned Pont Neuf bridge and within easy walking distance to The Louvre museum, the Orsay museum, Ile Saint Louis and the Notre Dame cathedral. Boasting discrete luxury, Louis XV furniture, original Aubusson tapestries and a wonderful wood burning fireplace."}