{"user_rating": 4.5, "review_count": 370, "name": "Hotel La Belle Juliette", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I'm extremely critical in all my reviews as Trip Advisor has served me abounds for the past 10yrs now its time to pay it forward. Ahh where shall I begin, I will keep my lengthy opinion of this city overall at bay during this review & stick to the hotel. First & foremost I was graciously welcomed, provided a map to the city including all the hotel information and shown to my room, the front desk clerk explained to me all the features and then brought up my luggage, he was very polite & he spoke excellent english. The room was small but I expected that since its europe, what was weird was the small door for the toilet which was placed in a 3.5ft sq closet like space, acceptable for anyone who isnt too large, but it would be better if the door didnt close automatically when u went in, it makes it really claustrophobic. The Mac computer/TV in one was excellent idea, the free wireless internet was really fast, and the bed was super comfortable with 4 pillows the way it ought to be. What I enjoyed most was the rain showerhead, with 3 side shower heads and great water pressure that's great being I just came from Rome where water dribbled out. The french windows opening out onto the street were also a nice touch. Now the concerns: There is no desk space/place to work, I was hunched over on my labtop trying to get work emails done an hour a day. I looked at the breakfast menu since it is not complimentary 1 morning they want $25usd for a continental breakfast?? I walked back to my room. Plenty of restaurants in the area instead may i suggest St-Placide Metro around the corner alot of food variety in that intersection, I heard drilling either floor below or floor above one morning around 9:30am only heard it the 1 morning, there is a construction site next door which I think should be mentioned on TA I have enclosed a photo. I thought the hotel was awesome overall, just personally don't see $300 a night rate I paid for the smallest room option, especially", "title": "4 Star Review Excellent Stay, Great Hotel Just Overpriced", "helpfulness": 7, "user": "SunsetInStyle", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 137848152}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "in August, I travel alot, Paris is a ghost town except for all tourist attractions in august be prepared for the lines, walking back to this place at night alone might have you looking over your shoulder, it did for me. Throw in a few freebees some how like breakfast (I don't mean the marshmallow on my pillow), or drop your rate but to be honest walking back from Eiffel Tower area I passed several hotels much closer and when I looked them up they were at least $75 cheaper a night. Tips: Take the metro everywhere buy the 10 ticket value pack it saves you $6usd, maps make places look close, they are not by any means in paris. Download the TA CityGuide map to your smartphone/itouch it works offline & has a subway map therefore you won't need a paper map out all the time. Don't expect anything but the bare minimum of assistance from anyone in Paris besides the staff in this lovely hotel, from my travels the french seem to only know english when they need help with something like when they're outside their country & lost which is kind of ironic based on their general perception of helping people lost in paris....", "title": "Chic & Modern but also comfortable", "helpfulness": 3, "user": "tucsondood", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137789331}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I have stayed here twice. I find the hotel staff to be very welcoming and friendly. They remember your name and really try to make you feel like you are the only one there (which is a feeling easy to come by at this place).", "title": "Very friendly and professional staffs", "helpfulness": 1, "user": "Lx6", "date": "August 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137706854}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I stayed here for weeks and weeks...it was always good. Room service is great, and their cappuccinos in the morning are excellent.", "title": "Good but...", "user": "Turbo986", "date": "August 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 137634027}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I used the spa and received wonderful massages. The whole downstairs little spa room is adorable and very unique.", "title": "Perfect for our romantic break", "user": "sofg11", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137567438}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My partner and I arrived into Paris only to be disappointed with the accommodation we had booked. With plans to celebrate our 20th anniversary with a week in Paris we needed to take quick action...... So it was straight onto Tripadvisor for an alternative ( not easy at this time of the year) We found it here at the Hotel La Belle Juliette. The person on the end of the phone (Dany) was nothing short of amazing, he sorted out a weeks booking, as well as private car transfer from where we were to the hotel all within less than a few minutes. On arrival at the hotel he offered us the most sincere welcome we have ever enjoyed arriving into Paris. What a positive attitude and all our problems dissolved away. Oh to the hotel. It's furnished beautifully! well located, modern, clean and fitting of a weeks celebration in Paris- and of course Dany!", "title": "Justn by the phone call we knew we were somewhere special", "helpfulness": 1, "user": "UpfrontAustralia", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141758589}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had the most lovely weekend staying at this hotel. The room was small but this is Paris and the quality of the furniture, furnishings and extras more than made up for this. They had thought of everything. The shower is fantastic.Lovely toiletries, complementary bathrobes and slippers and comfortable bed. WiFi in the hotel is free.The staff are lovely and all speak impeccable English and cannot do enough to help. I asked if they had soya milk at breakfast and someone went out to get some - impressive. By the way have breakfast. The room where it is served is lovely and the quality is excellent. Only reason we did not give a 5 for sleep as we had a fire alarm at 6.30am. The use of a hairdryer in another room tripped the alarm. Lots to do in the area being near St Germains and Montparnasse. Some nice restaurants in the area. We tried Lancetta on the basis of an earlier recommendation and endorse that recommendation. All in all we would certainly recommend this hotel.", "title": "A gem of a hotel", "helpfulness": 1, "user": "ADLP05", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141108361}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I took my wife to Paris for her birthday and stayed at the La Belle Juliette (booked through Mr & Mrs Smith). We were fortunate enough to have one of the junior suites (quite small but you are in Paris) with all the facilities you could wish for from Nespresso machine and iMac's to the fabulous traditional french chic furnishings. Staff could not do enough to assist, recommending restaurants and booking what ever we needed. The other most wonderful thing was the smell when you enter or walk around - this is from the cellar spa and all the high-end treatments and perfumes. truely wonderful (and I still have the slippers)", "title": "Best hotel in Paris", "helpfulness": 1, "user": "Simon H", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141084781}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed for 6 nights in May 12 at the start of our month long holiday in France. We traveled direct from Australia (24hrs) and arrived at the hotel at 9am, but were not due to check in until later that afternoon. The staff were very accommodating and gave us access to the day spa showers so we could shower and change out of our traveling clothes. The staff also juggled our rooms to enable us to check in at about 10am. The rooms are well appointed with comfortable beds but are particularly small (it is Paris). The bathrooms are great, with awesome showers that have a huge shower head and side wall jets. There is a little bit of noise from surrounding rooms, and while the street was generally quiet through the night, without fail there would be the occasional scooter or garbage truck banging down the street in the early hours of the morning. There was construction going on next door, but for the most part this wasn't too noisy and restricted to daylight hours. I do have to stress that the staff were absolutely fantastic, and the location is really good, as it is slightly off the tourist path but still quite close to the metro and shops etc. If you stay here, check out Bakkus (restaurant and wine bar just down the street) - great selection of food and wine.", "title": "Excellent service, nice overall hotel", "user": "rowey_79", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 140571003}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "Had a rough first night here, fire alarm went off because someone smoked in a room. Slept until 3 pm because the window blinds were incredible! However missed room service because of it. Shower is a little tricky, but nice. Apple computer/tv had some glitches. I agonized over this review because we had few problems, which you don't expect when you drop big money. However I am glad we stayed there. My favorite part of Paris is walking around this neighborhood. There was construction going on next door which was not great.", "title": "Great location, quiet neighborhood, friendly staff, very romantic", "user": "haroldHood", "date": "September 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 140497721}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My wife and I recently stayed here for 5 nights and found this to be great boutique hotel with excellent service staff and amenities.", "title": "Amazing Boutique Hotel!", "helpfulness": 4, "user": "ruckus87", "date": "March 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 126450078}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The location is practically in walking distance of all the major sites and local neighborhood has many great shops and scenes to explore.", "title": "Great design, but too expensive", "helpfulness": 3, "user": "M0nsieurHul0t", "date": "March 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 126126502}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Ok, this hotel looks great, the interior decorating is very nice, but it is really really too expensive for what's offered. We stayed in a Suite -which cost me an arm and a leg- and it was quite small, we had to watch out not to bump into each other. The bathroom could just merely fit the bathtub and one washbasin. The so-called fireplace that is advertised on the website does not function... Breakfast is very sober (unless of course you pay for a lot of extras). There are better hotels in Paris, for half this price.", "title": "A small gem in a big city", "helpfulness": 1, "user": "AndrewinDublin", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125766797}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "This really could be a one word review, with the word being \"Wow\". I booked La Belle Juliette as a surprise for my wife's 40th birthday. Even before we arrived we had an inkling of how good they would be when I contacted the hotel to ask if they could book some restaurant's for us in advance. They complied without hesitation.", "title": "Lovely Gem Of A Hotel", "helpfulness": 3, "user": "555NewYorker", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125671278}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "When we arrived we found that the front of house staff were fantastic. Nothing was too much trouble, from advising us where to have a quick bite to eat, which was the best way to walk to a certain location, or just wishing my wife a happy birthday. They took an interest in us and our stay and that, for us, is what makes a hotel enjoyable. The other part, naturally, is the room. I had booked the Junior Suite ( Well it was her 40th) and this was a beautiful room, with a fantastically huge bed, huge bath, 2 Mac pc's and a Nespresso machine which i found a daily use for. Overall the room was tip top.", "title": "Magnifique", "helpfulness": 4, "user": "Johnfishwick-stape", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125665359}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I stayed here last week for 3nights and loved everything about this hotel. Paris was classic and it was great to come back here after a big day due to the following; friendly and professional reception staff (loved Danny nothing was a problem) , a romantic pink room with huge bath and comfy bed, fresh towels and robe, turn down service each night with chocolate on pillows, tasty food using room service, the location is handy as metro and shops are a few minutes away. About 40 mins to airport by taxi.", "title": "Location and romantic room", "helpfulness": 1, "user": "770Traveller", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124570544}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Only thing I didn't like were the pillows, I like a flatter one to sleep on.", "title": "Paris Feb 2012", "user": "Lisa K", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124392811}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "Would recommend this place!", "title": "Cute boutique hotel in great location with well meaning staff let down by several key mistakes", "helpfulness": 11, "user": "zanaida", "date": "January 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 123842359}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Great boutique feel to the hotel, friendly staff and lovely deco. Great location!!", "title": "Very memorable!", "helpfulness": 2, "user": "dancing_luv", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 123580183}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This review is actually difficult to write as I so much wanted to love La Belle Juliette and give this gorgeous little boutique hotel the 5/5 most others here feel it deserves. This sentiment is no doubt helped by the fact that the very friendly front-desk staff gave us an upgrade upon learning that this was our honeymoon. We were overjoyed as you can imagine!", "title": "Beautiful and very girly", "user": "Jennieee", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123351280}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Staff very polite and helpful in confirming a tour we had previously booked, and then helping us arrange an alternative when the Tour Provider let us down.", "title": "Satisfied Customer", "user": "Cleme", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140477117}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Situated in a quiet street, (despite the building work next door), but within walking distance of attractions, the overall atmosphere was calm friendly efficiency.", "title": "Comfortable, chic, and great location", "helpfulness": 1, "user": "WrennRWC", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140450824}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The pool is small, more like a large hot tub, but suited our needs. Beds very comfortable.", "title": "Cheese in bed, paddle in the pool, heaven on earth", "helpfulness": 3, "user": "LucyMo_103", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139559361}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The restaurant was convenient, but there are far better restaurants in Paris.", "title": "Simple, sexy, stylish", "helpfulness": 1, "user": "Jonathan_Philips", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139553783}, {"rating": 5.0, "title": "A Great Find", "text": "From the friendly first impression to the beautiful, clean and comfortable rooms, to the great service throughout our stay, we were extremely satisfied with our stay at La Belle Juliette. Our room was beautifully decorated, comfortable, and quiet, and the hotel is conveniently located to good restaurants, shopping, and the metro. We will definitely stay here on future visits to Paris and give La Belle Juliette the highest recommendation.", "helpfulness": 1, "user": "Peter F", "date": "September 3, 2012", "id": 139300769}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Pros", "title": "Nice room and location but piling vibrations during day", "helpfulness": 1, "user": "Kallang", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142833578}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "(1) Stayed in suite which was nicely decorated, had 2 Mac computers that doubled as TVs and a nespresso machine.", "title": "Stay here now.", "helpfulness": 3, "user": "andy w", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142231880}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "(2) Quiet at night.", "title": "Funky Boutique Hotel on the left bank", "user": "AH40", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 142191476}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "(3) Great neighbourhood with cute little shops and restautants. Near the department store Bon Mache. Great Sunday market nearby", "title": "I don't get it.", "helpfulness": 4, "user": "KerriJK", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 142085277}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "(4) Near a metro station", "title": "Wonderful Stay in Paris!", "user": "WisconsinBadgerfan1", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142020150}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We have just returned from a trip to Hotel La Belle Juliette. We stayed in room 107 for 7 nights. The property was fantastic and the staff is wonderful. Carlos checked us in and made a great first impression that really set the stage for the rest of the visit. He took his time in showing us around and gave us the true boutique hotel experience. The rooms are in fact small. Our room was a junior suite. I would suggest that if you have concerns about room size that you should get a junior suite, otherwise just deal with what you get. We felt a bit cramped but made do with it. After all it was so well maintained and pleasant that it didn’t bother us.", "title": "Fantastic", "helpfulness": 5, "user": "Billyphx", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128640714}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The property is in a residential neighborhood on a street that as you walk towards the river has more and more shops and restaurants. After walking for ½ kilometer you are right in the thick of things. That being said, the best way to get around is via Metro. There are a few stops for 3 different lines right nearby. A must for this trip was the “Paris By Metro” offline app on my iPhone. This app allowed me to plan a day of metro commuting on my phone without having an internet connection. If want to walk, Notre Dame, the Louvre and Orsay are all within a 20 minute walk through absolutely gorgeous neighborhoods. Wifi in the hotel worked incredibly well. The iMac competers functioning as TV’s were really cool and easy to navigate.", "title": "Amazingly perfect in every way!", "helpfulness": 3, "user": "Kristen B", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128615920}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Breakfast at the hotel is how others have described it…Nothing to rave about. It was included in our rate so we ate there everyday, but after a few days it was boring. Other than breakfast I really can’t complain about anything.", "title": "a Cosey Boutique Hotel", "helpfulness": 1, "user": "Rami S", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 128209843}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Ohh...Another tip...within 1 block there is both a pharmacy and a grocery store. If you are a Starbucks diehard you are out of luck.", "title": "Cute hotel", "helpfulness": 1, "user": "Rusty10075", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127735810}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband took me Paris for the first time last month. I decided on Hotel La Belle Juliette from all the wonderful Trip Advisor reviews. We stayed here for 8 nights and it did not disappoint! We arrived before check in. Jean-Baptiste graciously took our bags and offered their Spa for us to freshen up and called us when our room was ready. Dany brought us to our room where our bags were already delivered. It was gorgeous! We were welcomed to a trail of rose petals from the door to the top of the bed, a personalized note, box of cholocolates and bottle of champagne. The bed was extremely comfortable and the shower was heaven. The room did not seem too small...you're in Paris after all! The staff is what put this hotel over the top! We were greeted morning, noon and night by our names and they went out of their way everyday to help us...always a smile on their face! I can honestly say that I miss Jean-Baptiste, Dany & Guillaume who work the front desk. And Aurelie...she was just as amazing. Loved going to the bar in the evenings before heading to our room for dessert and a glass of wine. Aurelie always went out of her way to make us feel so special. You can not go wrong with Hotel La Belle Juliette and the location is wonderful. I long to come back to Paris and can not imagine staying anywhere else!", "title": "Beautiful Parisian boutique hotel with very friendly staff", "user": "Marshall137", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127599229}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed for our anniversary (young couple) and I have to say the hotel and staff where amazing, we will definitely be staying again.", "title": "Amazing Stay at La Belle Juliette", "user": "Darknightsky", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125406163}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "great location 2 mins from metro station and it located in a lovely area with a wonderful patisserie around the corner.", "title": "A little jewel in the heart of Paris", "helpfulness": 3, "user": "amkdt", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124873137}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "thank you for the memories!", "title": "Expensive Hotel, Great location, small but great rooms, friendly staff!", "user": "mamitanl", "date": "February 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 124825294}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Beautiful small boutique hotel, where every detail is thought through. Very nicely decorated rooms, ultra comfortable (albeit with a little bit of noise from the road - but none from the other rooms!), with very nice bathrooms. We used the small but exquisite spa: so beautiful, peaceful and relaxing! The breakfast was delicious and served in a very nice room.The whole place is very chic and elegant, but not at all snobby. The atmosphere is very relaxed: it felt like a home, rather than a hotel. The service was amazing: very personalised and efficient.", "title": "Romance & etc.", "user": "SugarPooh", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124665271}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Perfect location too: in a quiet residential area, but with lots of cafes and restaurants and only 5 minutes walk from St Germain.", "title": "A perfect stay in a perfect hotel", "helpfulness": 1, "user": "georgmac", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124621546}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 8, "average": 19, "very good": 81, "terrible": 1, "excellent": 261}, "slim_ranking": 0.0362520914668, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "La Belle Juliette. The discreet luxury of a four-star hotel and the charm of an address that visitors and Parisians will give to their most demanding, cultured friends. In the pure Parisian tradition of Saint-Germain-des-Prés, the hotel is guided by a modern vision of romanticism and urban conviviality. Exceptional service with particular attention to hospitality, guests’ well-being, calm and tranquility… all in the heart of bustling Saint Germain. Corinne and Pascal Moncelli, the owners of the hotel, have decided to breathe new life into an establishment that had been left to abandon on the rue du Cherche-Midi by telling the story – or rather stories – of a famous historical personality. This star of her time lived in the 19th century, frequented all the intellectuals and politicians of the era, was blessed with exceptional beauty, had an extraordinary love life and – above all – excelled in the art of receiving. The popular literary salon that she organised from the tender age of 15 attracted the greatest minds of the time and continued until her death, age 72! It is Juliette Recamier – famously known as La Belle Juliette – who gives her name to this new hotel."}