{"user_rating": 2.5, "review_count": 267, "name": "Hotel Debret", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Debret could not be in a better location in Copacabana. I could see the beach from my room, an outstanding view, without mentioning the breakfast in the top floor. Staff is very friendly, the problem is that you need them more than you would like. The hotel building looks to be an old apartment building, with small rooms, old furnishing and mostly everything requiring some restoration.It is clean, breakfast is good enough. It looks overpriced, but in fact, almost everything in Copacabana is overpriced. It has triple rooms, which is good if in family vacations.", "title": "It could be much better, deserves some restoration", "user": "Pianta", "date": "June 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 164995638}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Location very good basically a block off Cococaban a Beach. Nice view from breakfast restaurant. But the rest is poor. We stayed in 3 different rooms. In the \"suite\" you could sleep without noise. (Non Carnival season) Bedding,poor, bed, poor, room decor awful, elevator situation, outdated. Great restaurant on 1st floor but not the hotel.Shower needs constant attention. No shower curtains. hot water, hooray.Size TINY.", "title": "One good thing, but thats it", "user": "osborncats", "date": "May 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 160752376}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "it is situated on Copacabana beach which is handy for travel to other beaches and all the attractions. There is no car parking which was a real pain as I had to find a space in the side street and keep the parking tickets up to date as well as pay the street minders over night. The hotel itself was ok but in need of a bit of an update. The desk people were friendly and informative but the door staff did not lift a finger to help with the bags or even open the door for which i guess they are employed to do so. One guy was on his mobile for the entire length of out stay. We only had breakfast which was good. We did not eat at the restaurant an the first floor as we ate out. it was a shame they did not utilize the top floor breakfast room as a night time bar as the views were excellent form there. It was an ok hotel but you pay for the location and not the service.There is no pool or fitness room at this hotel.", "title": "Hotel Debret - Rio de Janeiro", "user": "Frank M", "date": "March 31, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 156188371}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I stayed one week, 3th floor room was fine . Staff speak english, spanish and portuguese, were very nice. They do have a restaurant Brasileirihno or something like that just in the corner first floor, Good food. You can walk to Ipanema Beach location is perfect. Def. i will back soon. Me quede una semana en el 3th piso el cuarto estuvo ok. El staff habla ingles, español y portuguese y fueron muy amables, tienen un restaurant Brasileirhno o algo asi en toda la esquina en el primer piso, puedes caminar a Ipanema Playa la ubicacion es perfecta definitivamente espero regresar pronto.", "title": "Great Location!", "user": "Jehnson J", "date": "March 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155282883}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "There is no reason to stay at this hotel apart from the amazing location. It is perfectly positioned at the south end of copacabana right on avenue atlantica. The view from our room on the 8th floor of the pavement, copacabana beach and sugarloaf mountain was worth the price.", "title": "Location, location, location!!!", "helpfulness": 2, "user": "TrekBear", "date": "September 22, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 140919948}], "location": {"country": "Brazil", "continent": "South America", "city": "Rio de Janeiro"}, "stars": 3, "variance": {"poor": 61, "average": 102, "very good": 56, "terrible": 40, "excellent": 8}, "aka": "Debret Hotel Rio De Janeiro", "slim_ranking": 0.794117647059}