{"user_rating": 5.0, "review_count": 1746, "name": "Hotel Al Ponte Mocenigo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Nice and quiet rooms. Excellent service and the Hotel is well located. I'll be beck and recommend it to friends.", "title": "Very Nice", "helpfulness": 2, "user": "serrov", "date": "March 13, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 7155253}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed at the Hotel Al Ponte Mocenigo for 4 nights in August 2006.", "title": "Excellent - worth a stay", "helpfulness": 12, "user": "lupuscanis", "date": "March 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7011825, "likes": {"liked": "— Price for value"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Taking into account the TripAdvisor revisions, we made our decision to stay at this accommodation. We preferred the double superior room with a small balcony overlooking the channel (room No. 5). Booking that specific room was no problem at all. We immediately received the booking confirmation.", "title": "Superb", "helpfulness": 1, "user": "Chuzz", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6925136, "likes": {"liked": "— beautiful rooms, pleasant staff", "disliked": "— pillows a little hard"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Getting to the hotel is pretty easy if you arrive at Marco Polo Airport. There are several possibilities to get to Venice from that location. We took the ALILAGUNA boat service to join in the special atmosphere aligned with water-governed cities like Venice.", "title": "hotel perfection!", "helpfulness": 2, "user": "SurreySilversurfer", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6919880, "likes": {"liked": "— Room decorated Italian style and bathroom ensuite which was a bonus", "disliked": "— Just a bit gloomy as small windows"}}, {"rating": 5.0, "title": "Loved it!", "text": "Approaching Venice via Murano, Lido and San Marco is worth a try. We enjoyed it very much. Even though changing to the vaporetto at San Marco we arrived pretty early at Al Ponte Mocenigo.", "helpfulness": 10, "user": "Buggalugs_07", "date": "March 5, 2007", "id": 6916382}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled with family", "text": "You will not be disapointed. I stayed here just after christmas and Al Ponte Mocinego helped make it an absolutely wonderful experience. The hotel is small, the kind of place where they greet you by name and it feels less like a hotel and more like your'e staying in someone's home (a gorgeously decorated and appointed one at that) and since its tucked away off the beaten track you get a small taste of what venice is really like, small wonderful trattorias down seemingly mundane alley's locals chatting and shopping, you feel like you're the only tourist in the city. I am not exagerating when I say you will not find another hotel like this in venice", "title": "I get the warm and fuzzies", "helpfulness": 1, "user": "Savannah2Manhatten", "date": "July 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8245670, "likes": {"liked": "— Rooms and Staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We chose to stay in Hotel Al Ponte Mocenigo for 3 nights of our honeymoon this July and were very pleased. The hotel was very pretty, quaint, and well kept. The inn keepers were very friendly and helpful. The room was beautiful and had a private little balcony with flowers on it overlooking the canal (room 5). The bathroom was like new and both the bedroom and bathroom were very clean. They offered unlimited free wireless internet in the rooms (we brought our own laptop). The breakfast in the morning was simple but nice (fresh rolls and pastries, fresh fruit, cereal, hot coffee, juice). It was about a 10-15 minute walk to the Rialto Bridge and another 10 minutes or so to St. Mark's Square. It was close enough to the main attractions to walk but far enough away to get away from the crowds. There is a vaparetto stop only a few minutes walk from the hotel which made things very easy. I would definitely recommend this hotel to others staying in Venice.", "title": "Quaint little hotel", "helpfulness": 3, "user": "JenRen", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8234514, "likes": {"liked": "— very friendly people that worked there", "disliked": "— a little hard to find at first"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We loved this hotel. It is a beautifully decorated, impeccably clean, wonderful little spot located in a quiet neigborhood. Walter and Sandro were gracious hosts and I am still dreaming about our delicious breakfasts in the outdoor courtyard. We stayed in the newly opened annex, just down the alley from the main hotel entrance and it was quiet, well air-conditioned, and the room rivaled any 5 star hotel I have stayed in. The hotel is located about 10-15 minutes walk from St. Marks square, but one minute from the San Stae vaporetto stop. The walk to St. Marks square is very scenic, through the fruit and vegetable market and over the Rialto bridge. This hotel is an absolute gem and I can't recommend it enough.", "title": "Loved it!", "helpfulness": 1, "user": "Beckclan", "date": "July 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 8224892}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Ponte Al Mocenigo is a gorgeous hotel in a very convenient location.", "title": "A true Venetian treasure", "helpfulness": 2, "user": "misslarsson", "date": "July 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8221839, "likes": {"liked": "— The rooms, the ambiance, the location", "disliked": "— Leaving..."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The rooms are beautifully decorated, with silk on the walls, italian marble bathrooms and heavy wood furniture. Our room didn't have much of a view, but rather faced a quite genuine narrow venetian alleyway, which I personally found quite charming.", "title": "Much deserved rating", "helpfulness": 1, "user": "travellingred", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8205999, "likes": {"liked": "— Everthing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Great place to stay. Extremely friendly staff who are eager to help in every way. The front desk folks were very informative and gave us excellent details when explaining directions and how things worked in Venice. Our room was beautiful. Very spacious, well decorated and clean. Also loved the free wifi!", "title": "Easy Review to Write!", "helpfulness": 2, "user": "nire107", "date": "March 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 60043242}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Excellent breakfast - really enjoyed the friendly breakfast attendants and how they would personally prepare each persons coffee, cappuccino etc. My husband has specific dietary needs (celiac disease) which I had informed the hotel of before our arrival. Our first day at breakfast, they had gluten free products that they had gone out and purchased specifically for him. He was very pleased.", "title": "Wonderfully Friendly Hotel", "helpfulness": 1, "user": "markwarren3", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59950219}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The location is a bit out of the way from the normal tourist locations, but we enjoyed this since the tourist locations seemed crowded and noisy. We used the water taxi to get around and this hotel is VERY close to that taxi stop so it was perfect. Not to mention the quirky entrance to the hotel on a tiny street between two large buildings. We got a kick out of coming and going on this tiny little street. It definitely added to the Venice experience.", "title": "Charming, Hospitable, Great Breakfast, & Cash Discount", "helpfulness": 1, "user": "weluvspg", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59792103}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This hotel is exceptionally good value and its staff are extremely friendly and helpful. Our stay was very comfortable and relaxed and the hotel though not pretentious is certainly well above the normal 2 star offerings. The rooms made us feel like we were staying in a small venetian palace.", "title": "Beautiful hotel, beautiful city", "helpfulness": 2, "user": "mcnsmith", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58930756}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The Hotel is well maintained and the bathrooms immaculate. Breakfast is continental style but plenty of it.", "title": "Quiet and Peaceful", "helpfulness": 2, "user": "roasties", "date": "March 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 58840244}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "This location in Venice was perfect - the rooms were gorgeous (we stayed on the first floor), the courtyard was superb, the location was far enough yet close enough to the touristy areas! The staff were very helpful and supportive in finding places to eat, giving directions, showing us how to get to where we needed/wanted to be (either the islands or how to get back to the airport) - this was an absolutely wonderful experience and we'd highly recommend it to others!", "title": "Loved it!", "helpfulness": 1, "user": "Alybyzrp", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8360953, "likes": {"liked": "— We loved it all!", "disliked": "— Absolutely nothing bad to report...."}}, {"rating": 5.0, "title": "A great hotel.", "text": "Our four-night stay here was great, from Sandro's friendly greeting when we arrived to our last conversation on the morning we left. He helped us find our way, recommended two fine restaurants (the one 50 steps down the street is not to be missed), and answered all of our many questions. We found the hotel easily with his instructions.", "helpfulness": 2, "user": "GDumont", "date": "August 6, 2007", "id": 8358359}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "We highly recommend the hotel.", "title": "Beautiful little hotel", "helpfulness": 5, "user": "madmilly", "date": "August 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8355637, "likes": {"liked": "— The cleanliness and location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Alf and Lily", "title": "Just what you want from Venice", "helpfulness": 2, "user": "Middle-aged-man45", "date": "August 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8281831, "likes": {"liked": "— The Charm", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Winnipeg, Canada", "title": "Perfect Choice", "helpfulness": 1, "user": "jdmiler", "date": "August 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8271784}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Like many, we found this hotel on Tripadvisor and booked based on the reviews. The hotel exceeded our expectations. It is an easy trip from the train station, away from the crowds, but close to the sights. The building is several hundred years old but the room--second floor with a balcony, ask for it--was beautiful, antique furnishings but a big, modern bathroom. We found the air conditioning to be good, even during a warmer than usual May. I looked at several other rooms and they were even larger and as nice. The owners are great, very helpful with directions. We ate breakfast in the courtyard every morning which was delightful. I checked around and this was a very good rate for Venice. Considering the quality of the hotel it is a real bargain.", "title": "Fantastic hotel, bargain price", "helpfulness": 1, "user": "DreadPirateMo", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8114858, "likes": {"liked": "— Authentic ancient Venice but modern conveniences.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "we are 6 adults who spent 4 nights here in june. the location is very good. it is right off the st.stae vaporetto stop. there are two sets of directions given. the easiest way with luggage is to get off by the church. go down the street to the right of the church as you are facing the church. within 100 yards or less you will come to the first alley on the right. there is a sign with the hotels name on the building at the corner about 10 feet high. turn into the alley and the entrance is about 2/3 down the alley to the right. the other way in involves a bridge and steps. the hotel rooms are large , clean and with a large bath room. we had a triple , single and double and everyone was happy with their rooms. the included breakfast is continental but includes warm croissants , cereal, juice (the blood orange is very good) ,hot chocolate and fresh fruit. it is served in a nice little courtyard. the owners are very helpful and recommended three restaurents that we enjoyed. the favorite was on a bridge and called ponte monegio (or something like that) it was by a canal and you could watch the gondollas go right by your table. more important the food was very good and reasonable. one other restarent specialized in non meat dishes (zuccia) and it was very good and reasonable. all three restaurents were close and in local neighborhoods with few tourists.(mostly locals) . the hotel is in a non touristy area and is quiet at night. we saw both murano (great shops and much prettier town than i expected) and burano(very beautiful with all the houses brilliantly painted in bright colors.) both islands ware less crowded that venice and had many shops. go to st marcos at night to see the church and dodges palace. instrumental groups with vocalist compete at different restaurents for customers. music is great as is athmosphere. beware food/drinks are high but great experience even if you just want to walk around. hotel is in good location for water bus and to walk to all of venice. the owners were great price is one of best in town. double 135 euro triple 155 euros single 100 euros. if staying longer than 2 days get 3 day water pass . it includes trip to islands but not to airport. we took bus (30 minutes 2 euros)", "title": "great location", "helpfulness": 3, "user": "robertbellbrook", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8100742, "likes": {"liked": "— location , help from owners , breakfast , size of rooms", "disliked": "— not much of a view but for venice it was great deal"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I was a bit nervous since I booked this hotel for our family ( 2 adults and a 14 & 16 year old) completely based upon the reviews on this website. We arrived via private water taxi from a long plane ride. It was a few feet from the Grand Canal. The location is fabulous. The hotel was just as described-spotless and fresh-the inner courtyard was very quaint and we enjoyed a great breakfast there every morning-The hotel is located off St. Mark's Square which we found to be a benefit fto get away from some of the other tourists. A very nice walk to the square through the small shops-lovely- The owners were very helpful and guided us to many local restaurants. I would definitely stay here again - my family really enjoyed this hotel- Trip Advisors reviews were right on the mark! Never mind that the rates were great (and included breakfast). A great deal!", "title": "Just as good as everyone says!!", "helpfulness": 3, "user": "kwajgirl", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8075976, "likes": {"liked": "— The great value", "disliked": "— No pool"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Don't let the 2 star rating fool you – this little gem of a hotel has many of the amenities, atmosphere, client service and location of many 3 and 4 star hotels, at a bargain of a price. We chose this hotel solely on all of the positive reviews we found here on Tripadvisor.com. Here are our observations after our 5 night stay:", "title": "Excellent Hotel - believe the reviews!", "helpfulness": 4, "user": "Cycletourist", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8057775}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "-The location is excellent, right near the St. Stae vaporeto station and an easy walk to the Rialto Bridge area. We will take quiet over a view any day and the quiet surrounding neighborhood made this a peaceful place to stay.", "title": "The owners of this hotel are of the reasons i loved venice!", "helpfulness": 5, "user": "AmericanGirl27", "date": "July 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8057062, "likes": {"liked": "— price, location (off beaten path), OWNERS!, breakfast", "disliked": "— air condition was not like it is in the US! that was my only complalint... everything else was amazing."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I spent hours researching hotels throughout Italy, and we were pleased with all my choices. Without doubt, Al Ponte Mocenigo was the most impressive of all our locations. I initially read about it in Rick Steve's Italy. Then I checked TripAdvisor, and that confirmed my choice. At the time, it was listed as #1 in Venice.", "title": "The BEST!", "helpfulness": 1, "user": "jRoQuincy", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8205980, "likes": {"liked": "— the quality of the accomodations", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I loved the quiet location, the beautiful room (we stayed in the annex and looked out at the street below), the great breakfast, and the friendly staff. I could not imagine staying in the midst of the crowds in the heart of the tourist section. I would recommend this hotel without reservation to anyone. I loved Venice and this hotel was one of the reasons!", "title": "Excellent Choice!!!", "helpfulness": 1, "user": "ebusby", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8133917, "likes": {"liked": "— welcoming atmosphere", "disliked": "— the blow dryer in the bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I stayed at the Hotel Al Ponte Mocenigo from July 2 through July 6. It was our first time in Venice and we could not have made a better choice! The room was beautiful - even my 10 year old loved the room. We loved having breakfast in the courtyard every morning. The desk is staffed 24/7 with people who are willing and able to assist you with whatever you need - reservations, advice, ... I traveled alone with my 2 children - ages 16 and 10 and always felt safe and relaxed. Venice is a wonderful city. One of the best things about the hotel is the location - the vaporetto stop is just steps away, but you are so removed from the crowds at San Marco and the Rialto that it is very peaceful.", "title": "Ah Venice..................!", "helpfulness": 1, "user": "Blu-iTT", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8121110, "likes": {"liked": "— Good decor and clean"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "You can contact the hotel directly to book and they will make all of the arrangements through email. They were very helpful with my many questions before I even arrived!", "title": "A center of calm in a crazy city", "helpfulness": 1, "user": "tsmayda", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8116813, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I agree with a previous reviewer on several points: try Al Nonno Ristoro for a great meal and you should take the vaporetto to Murano, it really is beautiful. Another restaurant worth a try (and a nice walk) is Al Ponte del Megio - you can sit outside right next to a small canal. Another great restaurant choice: Taverna San Trovaso - near Academia - they actually have two restaurants right near each other, good food and atmosphere.", "title": "Fantastic Hotel", "user": "Fred10Sheffield", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8115986, "likes": {"liked": "— The staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Excellent hotel in a good location at the San Stae river stop.", "title": "Great Place to Stay", "helpfulness": 1, "user": "AJBGeelong", "date": "July 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18031337, "likes": {"liked": "— Comfortable, clean and good location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We are a family of four with children aged 17 and 14. We stayed in the annex which was beautifully decorated, very comfortable and spotless.", "title": "Lovely accomodations", "helpfulness": 1, "user": "Virginiaphd", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 17912321, "likes": {"liked": "— decor and cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Sandro and Walter were wonderful and very helpful with all our requests.", "title": "Favorite hotel in Italy!!!", "user": "soondix", "date": "July 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17893213}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I would highly recommend this hotel to anyone looking for accomodation in Venice. Excellent value for money.", "title": "Everything is true a venetian gem with great owners", "user": "NicknGina", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17847957, "likes": {"liked": "— great decor. Style and flair", "disliked": "— leaving it!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "The room and furnishings were gorgeous and decorated with the flair of Venice. The bath was beautiful and new. Everyone who worked there was congenial and helpful. We'd stay again in a heartbeat.", "title": "Hotels like this are rare", "helpfulness": 2, "user": "Hosta_La_Vista", "date": "July 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17569307, "likes": {"liked": "— Location and Price", "disliked": "— Very Little"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "Hotel al Ponte Mocenigo was just as nice as everyone else has said--a delightful little historic hotel with lots of \"personality\" and exceptional service. We paid a little extra for a \"canal view room\" so that we would have a King-size bed and larger bathroom--which we thought was still a bargain by \"Venice standards.\" The room was comfortable and very quiet and certainly felt \"very Venetian\" with lovely antique furnishings and a Murano glass chandelier. The bathroom appeared to have been recently updated and had a full-size bathtub, great towel warmer, and nice toiletries. The hair dryer was rather unique but \"served the purpose.\" We were served a delightful complimentary breakfast each morning of freshly baked rolls, cereal, fruit, yogurt, juice, and wonderful espresso or capuccino each morning by the \"breakfast ladies.\" The location of the hotel was great, with the walkway into the hotel probably less than 50 yards from the Grand Canal at the San Stae vaporetto stop. We were glad that we'd been warned that the sign marking the place to turn into the hotel was \"tiny\" or we probably would have missed it. We asked one of the other guests there what they recommended that we see as \"first-time visitors,\" and they said to \"just get lost\" and enjoy the neighborhoods and sights of Venice. We found beautiful squares and amazing churches, MANY unique bridges, and plenty of interesting shops and sidewalk cafes by just aimlessly walking in the area surrounding the hotel. Venice is small enough that we were still only 20 minutes or so away from Saint Mark's Square or any other part of Venice that we cared to visit. We found many areas to purchase Murano jewelry (with competitve prices to Murano itself), wonderful leather goods, and amazing pizza and gelato. The staff at the hotel were so accomodating and friendly--we felt more like we were staying in the home of a friend than in a hotel in a foreign country. We would definitely go back to Hotel al Ponte Mocenigo if we're lucky enough to get to return to Venice!", "title": "The perfect introduction to Venice!", "helpfulness": 3, "user": "kathyw71", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56327789}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "A lovely little hotel, fair enough away from the busy tourist areas, however close enough to walk to the Rialto, San Marco Square and all the other must see places. The hotel is small, around 10 rooms, fantastically decorated to venetian style and the bathroom was as good as any other 4 star hotel we have stayed in. Breakfast was adequate - breads, cereals fresh fruit and coffee of your choice. I would recommend this hotel to anyone travelling to Venice.", "title": "A great little hotel", "helpfulness": 2, "user": "Around_the_World_165", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 55590616}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "This place exceeded all my expectations, and is so charming. The rooms are spotless and really nice and huge compared to any other rooms I stayed in. Staff are friendly and helpful. A nice breakfast is provided. Overall excellent value for money. I payed much more in other places of Europe and Italy that didn't even compare. The only downside to this place is that there's no computer to use with Internet, but there's an Internet cafe nearby so it's not really a big issue.", "title": "Best place I stayed in all of Europe", "helpfulness": 2, "user": "SSAN21", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55058983}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "I was in Venice for a romantic week-end with my boyfriend and we stayed at this hotel for 3 days. We had the room 8 on the first floor, it was absolutely beautiful, big room, all red, very high ceiling, the bathroom was really clean.", "title": "Hidden gem in Venice, perfect location, excellent price", "helpfulness": 3, "user": "Pitiniaou", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 54987623}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The breakfast is included in the price and if you pay cash you have a 6% reduction.", "title": "A great deal in Venice", "helpfulness": 1, "user": "JAG458", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 54746789}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "This small hotel exceeded our expectations. The owner is on site every day and is personable and very helpful. Our room was lovely with a tiny balcony overlooking a narrow canal. Room was also large and nicely decorated. The only drawback in the bathroom is the narrow panel that serves as a shower curtain and is not adequate to contain spray from taking a shower. The bathroom was quite large and very new.", "title": "A real gem!", "user": "Giotto'sparents", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6635268, "likes": {"liked": "— Friendly staff, location, lovely rooms", "disliked": "— Breakfast area"}}, {"rating": 5.0, "title": "Excellent service with a personal touch", "text": "We were there in December so the weather was chilly, otherwise the outdoor courtyard would have been very nice. The tiny eating area just adjacent to the front desk does not really offer enough space for all hotel guests so some mornings we ate in \"shifts\". The staff is so nice and the cappuccino so wonderful, that nobody seemed to mind. The owner also has plans for expanding this public area of the hotel and we can't wait to go back to see the results.", "helpfulness": 3, "user": "telie13", "date": "January 21, 2007", "id": 6633926}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The location couldn't have been more convenient and directions for entering from the \"back door\" were helpful and easy to follow. It is a VERY short walk from the Vaporetto stop. It's in a very quiet area of Venice which we greatly appreciated, even during the low season (still many, many tourists).", "title": "Loved the Al Ponte Mocenigo", "helpfulness": 2, "user": "fva17", "date": "January 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6622421, "likes": {"liked": "— Place, bedroom, staff", "disliked": "— none"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We'd stay here again in a heart beat!", "title": "Great value. beware night guard", "helpfulness": 6, "user": "Tonguetwister", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6599574}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "This was the first place we stayed in Italy, and it was a lovely place with warm friendly people, wonderful service, and beautiful accomodations. The rooms were spacious, well appointed, and spotless, an excellent value for the money. I still get cravings for the breakfast. While being less extensive than usual hotel breakfasts in the U.S., every item was excellent, instead of having more of mediocre offerings like most US hotels. The staff were helpful and friendly, and went out of their way to make sure we had a good time, they even upgraded our room for two nights at no cost. I don't know what the previous reviewer's complaint was with the night watchman, he couldn't have been more friendly to us. I will be back to Venice, and wouldn't consider staying anywhere else.", "title": "its everything it says it is", "helpfulness": 3, "user": "WAGRAIN", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6599543}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Stayed here for three nights in mid December. Perfect, spacious room and bathroom. Great shower. Good breakfast. Sandro and Walter were very helpful and friendly. Wonderful time of year for Venice, no crowds, great weather, easy to pretend to be a local. Good location. Close to vaporetto stop.", "title": "Perfect Place", "helpfulness": 6, "user": "swanfall", "date": "January 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6570930, "likes": {"liked": "— Quaint, clean, friendly owners.", "disliked": "— Stay here!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Believe what you read! Don't hesitate to book here. I couldn't wait to get home to write a wonderful review about this quaint hotel with services rivalling 5 star qualities. Since they have FREE internet access, I'm able to write this review. Even if you do not have your own computer, they (Walter, one of the owners and his staff) are happy to supply you with their laptop. The breakfast was more than sufficent, the first breakfast in Italy that actually made me full! (And we've been in Italy for over two weeks already.) The pictures are accurrate, and it could be hard to find if you miss the little sign when you exit the vaporetto, but that is part of the fun. Have a good spirit when looking for the VERY narrow street to the back door. The bathroom is very nice. The bed was comfortable. The shower was big..for european standards. The toilet paper is even soft! And everything is super clean. The staff is the most accomodating and helpful. Truly the BEST place to stay in all of Italy. It looks far from everything on the map, but we wandered the streets and managed to wander right into The Rialto Bridge and even to St. Mark's square in very little time. We really wish we could have stayed longer. I LOVE this hotel!", "title": "Must Stay Here!", "helpfulness": 12, "user": "siida", "date": "January 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6565102, "likes": {"liked": "— Everything! The service was impecable", "disliked": "— Nothing!"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I must say we were a little disappointed with our trip to this hotel. We have just returned from a three night stay in Venice and they were only able to squeeze us in on our last night. The other two nights we stayed at the Residence Corte Grimaldi (currently no. 3 on tripadvisor!) and that was far, far superior for both quality and location.", "title": "A little bit disappointed", "helpfulness": 27, "user": "claire-martin", "date": "December 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 6490716, "likes": {"liked": "— Try to avoid Room 7"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I was very excited about coming to this hotel having read all the reviews on the website. However, after having a whole apartment to ourselves at the Grimaldi with two bathrooms, a wonderful picturesque balcony and a huge bedroom - we were so disappointed to get such a tiny room at the Al Ponte Mochenigo. We stayed in Room 7 which had a great, clean bathroom and nice furnishings but it felt very dark and dingy. Our room overlooked the alley outside and you could almost touch the buildings opposite. We were also woken by workmen at 8am apparently working in the alley.", "title": "An exquisite gem", "helpfulness": 8, "user": "TanjaC", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6472914, "likes": {"liked": "— The Venetian interior deco", "disliked": "— Having to leave!"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "That said, the breakfast was fine, the staff were friendly and the whole place was very clean. I did manage to see inside one or two of the other bedrooms and they looked lovely. So I guess we were just unlucky with the room.", "title": "Beautiful hotel", "helpfulness": 5, "user": "bappo", "date": "December 13, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6436638, "likes": {"liked": "— accomodations and staff", "disliked": "— be aware that the vaporetto stop is just around the corner."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "This place was the BEST B&B and BEST place we stayed in over two weeks. The rooms were clean - ceiling were at least 20 feet tall, and", "title": "Wonderful Secret B&B", "helpfulness": 5, "user": "DeeThom", "date": "April 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7294551, "likes": {"liked": "— The quiet off the beaten path scene", "disliked": "— The tiny hallway you walk down to get there."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "bathrooms were very clean. The best part, is that you would never know it was there, unless you went down that \"little\" alley way - - -- yup - -- it's down there, and well worth the wait. Walter was a perfect host, the cuppocino, and breakfast was wonderful too.", "title": "A wonderful stay", "helpfulness": 3, "user": "RuthLeicester", "date": "April 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7284934, "likes": {"liked": "— Friendly staff, great room", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We chose this hotel based on tripadvisor recommendations, and we were delighted with it - we could not afford it in high season, but it was substantially discounted in January.", "title": "Please, don't ever change!", "helpfulness": 7, "user": "Marcia_Teles", "date": "April 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7265886}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The staff were friendly and welcoming, our room was marvellous - we're usually budget travellers, so the facilities here were completely luxurious - pristine, elegant and comfortable, incredibly spacious.", "title": "Lovely little hotel with lots", "helpfulness": 19, "user": "SLMaidenhead", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7254237, "likes": {"liked": "— Clean beautifully decorated rooms and friendly staff"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We were even impressed with the breakfast - we usually avoid hotel breakfasts in Italy and eat at a bar, but we got decent espresso and warm pastries.", "title": "Loved this hotel", "helpfulness": 5, "user": "bateacher", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7247108, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "title": "If you get the right room this is a gem", "text": "Having done my research I was delighted to be able to book 2 rooms for the weekend of 26 January 07. We arrived at Treviso Airport at 8.40 pm and reached the hotel by 9.45 pm without difficulty.The hotel location is excellent. It is near to the Vaporetta stop and within near walking distance to Rialto. We had rooms 5 and 8 which were excellent,warm,spotlessly clean and beautifully decorated. Sandro and Walter take great pride in their hotel and go to every effort to make their guest feel welcome.They were happy to make restaurant reservations for us and to share their knowledge with us.They certainly added to our very enjoyable weekend.I have no reservations in recommending this hotel and I will look forward to returning.", "helpfulness": 5, "user": "blath", "date": "January 29, 2007", "id": 6714071}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We researched extensively through Tripadvisor & as such were", "title": "Don't even think of staying anywhere else", "helpfulness": 1, "user": "PAX12", "date": "January 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6710702, "likes": {"liked": "— The style & furnishings, & a shower I could stand under without stooping", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "guided by the comments re this Hotel. You could not ask for better! Great service, awesome rooms, fantastic location, great value.", "title": "Hidden Gem", "helpfulness": 4, "user": "fawnio", "date": "January 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6710552, "likes": {"liked": "— Rooms and Breakfast. Oh and amazing staff!", "disliked": "— having to leave"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Our thanks to Walter & Sandro for helping to make our stay in Venice truly memorable.", "title": "beautiful rooms, great location", "helpfulness": 5, "user": "fernga", "date": "January 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6647920, "likes": {"liked": "— amazing rooms", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "If you are visting Venice then this is the place to stay.", "title": "Didn't want to leave!", "helpfulness": 4, "user": "Jane13", "date": "January 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6641707, "likes": {"liked": "— Everything!", "disliked": "— Everything was great!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Walter & Sandro - THANK YOU SO MUCH for making our stay such a wondeful one! We came to Venice for our Honeymoon in May07, picking-up on Al Ponte Mocenigo from the Trip Advisor reviews. We contacted the Hotel directly and booked, and from the 1st contact from them have experienced nothing but superb service, hospitality and brilliant communication. This Hotel is 2-star, yet the service exceeds that of many 5-star hotels. We are delighted to have 'hit' upon this gem in Venice, and are already planning our return. Thank you again Walter & Sandro for making our special time so memorable. Paul & Alison, Nottingham, England.", "title": "Absolutely Delightful! - Believe the Reviews", "helpfulness": 3, "user": "Paul_and_Alison", "date": "May 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7656411, "likes": {"liked": "— Service, Location & Value for Money", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Lovely small hotel", "text": "We stayed here in April 2007 for 3 nights. Our room was very nice and fairly quiet. The bathroom was a decent size and spotless.", "helpfulness": 6, "user": "M Turner", "date": "May 8, 2007", "id": 7566534}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The hotel is pretty small (ten rooms I think) which suited us. It has a very pleasant courtyard where you can have breakfast if the weather's ok. Luckily for us it was warm when we were there.", "title": "Make a reservation, but with reservations", "helpfulness": 11, "user": "mrsg55", "date": "May 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7543388, "likes": {"liked": "— walter and sandro, cleanliness", "disliked": "— disparity of room sizes"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The location is reasonably central - about 5-10 minute walk from the Rialto bridge. It's down a small side street but still very close to the Grand Canal. To be honset I thought it was better staying here than somewhere more central given how busy Venice is. I think we had the best of both worlds - not too far from the main sights but still quiet.", "title": "Believe the Hype", "helpfulness": 5, "user": "LizaIreland", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7368396, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "There are some good local restaurants nearby which I would recommend rather than going somehwere more on the beaten track. Just ask the staff for recommendations.", "title": "A Great Find!", "helpfulness": 13, "user": "eric85", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7332557, "likes": {"liked": "— Staff, location"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "I was the leader of a group of 10 girls who stayed in Al Ponte Mocenigo for 2 nights in March, 2010. We found the hotel to be extremely clean, had Venetian charm, and was run by very friendly and dependable owners, Walter and Sandro. Once we learned the route to the Rialto Bridge, negotiating the narrow streets of the city was easy. Walter and Sandro gave us suggestions of unusual Venetian events, such as the Opera performed live in a Venetian Palace overlooking the Grand Canal, of which we would have had no knowledge. Sandro's wife is a tour guide and can offer wonderful tours of the city, such as the night tour of St. Mark's with interior lit mosaics. The owners also conncected us to Destination Venice, an extremely reliable tour and transfer agency, whose services to us were invaluable. I would highly recommend this charming small hotel to anyone who is interested in exploring Venice. Thank you to Al Ponte Mocenigo for a memorable visit.", "title": "Intimate Charm", "helpfulness": 2, "user": "TravelerLooseAbroad", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 58827159}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Helen Loch", "title": "Great Stay", "user": "hotelcasci", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58780112}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Gainesville, Texas", "title": "Lovely little hotel", "user": "Kat500", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 58380596}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We stayed in the annex around the corner from the main hotel. Room was comfortable and had a view of the street below. Friendly, helpful staff. Good breakfast. Use of the Al Ponte's boots and umbrella came in handy with the snow and rain. Conveniently located, just obtain a \"pass\" which you can purchase on arrival (we took 72 hours for our 3 night stay) and access to transport is cheaper. Avoid eating and shopping close to main attractions, it's more expensive and take note of the \"tourist menus\" where all extras are at an additional cost, look for restaurants frequented by the locals. It's quite simple to do a walking tour of Venice on your own, just obtain a map and explore.", "title": "Wonderful hotel!", "user": "Lisa F", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58068907}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Loved this hotel, the staff & owner were so friendly and helpful. It's in a great position, away from the crowds and 2mins fron the San Stae vaporetta stop. Easy to get to from the airport,, bus to Piazzle Roma then 4 stops on the vaporetta & a 2/3 minute walk, perfect! The bed was very firm, but that was fine, the pillows were even firmer! a bit too hard for me. All in all we had a great time in Venice in spite of the snow!", "title": "Lovely Property", "user": "LindaLee50", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57842401}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "My wife and I stayed at this hotel for two nights in May 2006. Our room and bathroom were very nice, and spotlessly clean, though some Americans may have considered them small. We met only one of the hotel's owners, and had a very good impression of him. Frankly, all of the favorable comments in these reviews seem well-founded. My only addition is that the hotel is a short (and picturesque) walk to the vaparetto station. (A vaparetto is Venice's equivalent of a city bus.) The vaparetto is cheap, fun, and easy to use, even if you don't speak Italian, but watch the signs so that you don't miss your stop. The vaparetto can take you to Saint Mark's Square, to the Gritti Palace for a super-expensive dinner, or anyplace else in Venice. In short, Hotel Al Ponte Mocenigo is terrific.", "title": "great place, fine location", "helpfulness": 3, "user": "JSMountVernon", "date": "February 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6780523}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "Had a really great stay at this hotel, the owners Walter and Sandro kept the place in top condition and where very helpful", "title": "Great place to stay", "helpfulness": 7, "user": "pat1252", "date": "February 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6774375, "likes": {"liked": "— The quality of the rooms", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "The reviews say it all.", "text": "Lovely big bedroom and new bathroom.", "helpfulness": 5, "user": "shamrocker74", "date": "February 6, 2007", "id": 6749489}, {"rating": 5.0, "title": "The reviews win out!", "text": "Small bar and breakfast area but you could have your breakfast delivered to your door at no extra cost.", "helpfulness": 4, "user": "Cathy14", "date": "February 3, 2007", "id": 6737328}, {"rating": 5.0, "title": "Great start to a honeymoon", "text": "The water bus is a 4 min walk and the centre a 14 min walk.", "helpfulness": 1, "user": "sudsnyc", "date": "January 30, 2007", "id": 6717689}, {"rating": 5.0, "title": "Al Ponte Mocenigo delivers again", "text": "Yet another happy customer. Stayed here for 4 nights from 22 nd March. Staff extremely friendly, great location just 100 metres from San Stae Vaporatta stop yet very quiet. We stayed in a Superior Double (No 5) Bathroom was lovely, and large bedroom had one view over courtyard the other over small canal. Plumbing and electrics, sometimes dodgy in Hotels all modern and top rate. Only minor issue was bed was on the firm side, but after 2 days and some Italian Pinot Grigo never noticed anymore! Breakfast Continental style but more than enough to set up for day and always served with a smile. Walter and Sando gave excellent recommendations where to eat all within walking distance and will include details in the forum section.", "helpfulness": 2, "user": "Matty07uk", "date": "March 26, 2007", "id": 7226871}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We will come back to Venice and will definitely look to stay here again.", "title": "Simply wonderful", "helpfulness": 1, "user": "kt9", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7192956, "likes": {"liked": "— Quiet"}}, {"rating": 5.0, "title": "Highly Recommend", "text": "Al Ponte Mocenigo would have to be the best place I have stayed. I would defiantly go back and recommend it to everybody going to Venice. The service was fabulous and friendly. The rooms were so beautifully decorated and looked after. Breakfast was a lovely start to the day. Location was great, close to train station and public transport. Venice is such a wonderful place and staying at this small intimate hotel made it even more special.", "helpfulness": 3, "user": "Ckthomas00", "date": "March 18, 2007", "id": 7186923}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed one night pre-cruise at Hotel Al Ponte Mocenigo. We arrived early (9:00 am) to Marco Polo Airport and took the bus for $12 euro to the Piazza Roma. From there, we took the vaporatto to the St. Stea stop (about 3 stops from the Piazza), walked over one bridge and you are there. Lucikly, a nice local couple helped us find the entrance, as the sign is really small.", "title": "Excellent!", "user": "Ronda123", "date": "March 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7186442}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Walter was very welcoming and our room was ready within 15 minutes even though we arrived very early. We stayed on the second floor and had a balcony overlooking the canal. The room was very clean and nice - huge bathroom for Europe. The bed was a bit hard, but still comfortable. The bathroom had a hair dryer for the ladies; however the air was not hot - more warm. I accidently burned the plastic on my curling iron by using an adapter and plugging it into the 220v outlet - so beware women! The 115v outlet works just fine for most small appliances.", "title": "Small hotel away from the city center", "helpfulness": 5, "user": "KMG410", "date": "March 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7185433, "likes": {"liked": "— Very pretty hotel", "disliked": "— Far away from the city center"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "This was our first time staying in Venice, we had only been for day trips before, and selected the hotel based on the reviews on Tripadviser. We were thrilled with our choice and so glad we didn't go for a hotel nearer St Marks. It is so convienient for exploring all of Venice and we feel you really do get a different feel to the city then if you had booked a more touristy hotel. The rooms are beautiful and large, the annexe is lovely and we would actually choose to stay there next time we visit. The staff are charming , friendly and cannot be more helpfull.", "title": "Just perfect!", "helpfulness": 4, "user": "TREFANEL", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22755077, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Magnifico Moncenigo!", "text": "All in all a gem of a hotel , a real find, we will never stay anywhere else , just loved it!!", "helpfulness": 5, "user": "thornbird45", "date": "December 13, 2008", "id": 22694209, "likes": {"liked": "— It's effortlessly cool", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "You'll know the score about Al Ponte Moncenigo from the other TA reviews - the customer service is of the highest order (from all the staff), the hotel feels intimate and cozy and the rooms are tasteful decorated. It's ideally located being conveniently located for all the major sights (literally 1 minute walk from the San Stae vaporetto stop, 10 mins from the Rialto and 20 from St Marks) but at the same time in an area that's quiet and not too touristy. It's thoroughly deserving of the TA awards that it's won.", "title": "Great hotel", "helpfulness": 3, "user": "libtravel", "date": "December 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22560513}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Top tips", "title": "Great Hotel!!!", "helpfulness": 2, "user": "beb111", "date": "December 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22506981}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "Restaurants - Al Nono Rissorto (nr San Cassano) - Very popular with Venetians which tells its own story. Decent service and really excellent food, the higlights of which where the salmon gnochi and the spaghetti with mussels and clams. Very reasonably priced for the quality of the food that you get. If you want a decent cheap Pizzeria try Ae Oche", "title": "Would recommend this hotel to anyone", "helpfulness": 2, "user": "mum48londonSW", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22414727, "likes": {"liked": "— Luxurious for the price", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed here for 3 nights recently, and found the hotel to be very clean, the staff friendly and helpful and the location good.", "title": "Nice hotel, lovely staff, but perhaps overated?", "helpfulness": 1, "user": "poet123", "date": "April 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 60649152}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Our room was large enough, but had a view out onto a blank wall/ almost adjoining house. The dark decor meant we had to have the lights on at all times, and for a longer stay I fear this could have proved a tad depressing. The bathroom was spotlessly clean, modern and functional, however, the wall hung hairdrier was useless for blow drying your hair, as it could not be regulated, nor manipulated very well. Ladies take note, you will need to bring your own.", "title": "If you visit Venice, stay here.", "helpfulness": 2, "user": "RobertJP", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60441066}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The small courtyard where breakfast was served was nice, but perhaps not as nice as it appears in the pictures on the website. Basically, you sit on garden furniture under a plastic garden awning, it is heated with patio heaters on cooler days. You can also sit out there at night and have a drink after you return from dinner.", "title": "A Gem", "helpfulness": 2, "user": "Carnevale", "date": "April 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60238868}, {"rating": 4.0, "title": "Great hotel which lived up to its name", "text": "Breakfast was filled croissants, cereals, bread rolls, juices and tea/coffee. perfectly adequate but nothing out of the ordinary, and perhaps not quite living upto the expectation generated by some of the glowing reviews on this site.", "helpfulness": 2, "user": "D0ra_The_Expl0rer", "date": "April 1, 2010", "id": 60136500}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "I feel a bit like I am unmasking the Emporer in the Emporer's New Clothes story.", "title": "The perfect city break hotel!", "user": "PaulLang", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60100139}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I have visited Venice ten times and mainly stayed in four star hotels and above.Even before the dollar took its precipitous drop,I was curious about this hotel because of its No.1 ranking on tripadvisor and the laudatory remarks made by numerous travel publications. I could never get a room,even six months in advance,so I booked a room directly through the hotel and was finally able to obtain one. The hotel did not disappoint! It is immaculately clean,well furnished in the Venetian tradition with an extremely large,marble bathroom.The room,by the way,is huge by Venetian standards--and much bigger than the standard rooms in the beautiful five stars along the Grand Canal.The owners are wonderful,warm Venetians with old world charm and civility(even though they are young) !The location is superb---as when you first come in to Venice from either the railstation or the car park,simply get on the correct vaporetto,stay on for two or three stops,get off at San Stae and within two minutes you are at the hotel.The only downside is no elevator so if your mobility is lmited ask for a ground floor room.The breakfast is ample and of excellent quality--cappucino is well prepared.The entire staff is warm and welcoming.The neighborhood is authentic Venice--you will really enjoy the ambiance away from touristic San Marco.", "title": "A Gem that Deserves Its Top Rating", "helpfulness": 3, "user": "Lily L W", "date": "July 5, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 17566375, "likes": {"liked": "— The quality of the accomodations given the price", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Stayed here for three nights in June 2008, 2 adults and 2 teenagers in the annex rooms, second (third) floor. An absolutely beautiful place, clean and new with real Venetian decor (go to the Ca'Rezzonico museum and see the same style furniture you have in your room!). Breakfast was very good featuring home made apple croissants. I am a super light sleeper and on the first night heard noises from the private residence above our room - Walter and Sandro at the front desk contacted owner of the building the next day and immediately resolved the issue, they were super nice and helpful. Not hard to walk to this hotel from the train station - save some money on the overpriced vaporetto tickets and head there on foot.", "title": "A Beautiful Place in a Very Good Location", "helpfulness": 1, "user": "Al_Q2007", "date": "July 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17564922, "likes": {"liked": "— Clean and new furnishings", "disliked": "— Some adjacent room/residence noise"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We really enjoyed our stay here. This is an old building that has been completely upgraded with modern decor and fixtures. Close to the vaporatto and restaurants but not a crowded area.", "title": "Great Location", "helpfulness": 2, "user": "49erbacker", "date": "July 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17516721, "likes": {"liked": "— Seemed so new", "disliked": "— a few stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Great little breakfast in nice setting. Helpful hosts. We would stay there again!", "title": "A place to call home in Venice", "helpfulness": 1, "user": "MTJTraveller", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17264555, "likes": {"liked": "— Quiet room, great airconditioning on such hot Venice days!", "disliked": "— Water taxi driver would not pick up at hotel as canal was too narrow...bummer!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "My daughter and I had a wonderful stay at the Ponte Mocenigo this week. The location is convenient via vaparetto and walking to/from was really quite easy and enjoyable. It was located in a quite neighborhood, far from the maddening crowd which was perfect for us.", "title": "Better than Home", "user": "keypeds", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17233783, "likes": {"liked": "— Villa like atmosphere ,with personal staff type service", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We had a delightful 4 day stay at the Al Ponte Mocenigo in Venice at the end of June. The location is perfect, a very short walk from the San Stae vaporetto stop and one can walk everywhere from the hotel. We had a large room in the annex which was lovely and clean with all modern amenities. We ate in the courtyard of the hotel itself just around the corner from the annex entrance. Breakfast was bountiful with fresh fruit, croissants, cheese, etc. and the serving staff were so pleasant. Sandro and Walter recommended several restaurants nearby and we were delighted with all of them. The area is so quiet and we would go back to the same hotel on a return to Venice. It is a short ride or a walk to San Marco, an area we would certainly not stay in. It's just too busy. One can walk everywhere from our charming hotel and walk we did. We chose the hotel through other reviews we read on Trip Advisor and we were certainly glad we did.", "title": "excellent small hotel", "helpfulness": 1, "user": "Kedzie", "date": "July 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18436448, "likes": {"liked": "— The friendliness of the staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Kedzie", "title": "Fantastico!!", "helpfulness": 1, "user": "XOXOMcSorley", "date": "July 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18256362, "likes": {"liked": "— Everything!", "disliked": "— Not one thing!!!"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I LOVED this hotel!!", "title": "Easy to Find, Good Rate", "helpfulness": 4, "user": "johnrd216", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 18099022, "likes": {"liked": "— Value", "disliked": "— Room #3"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We booked two rooms: A quadruple and a triple, which are a rare find in Europe, especially at this price. We booked 16 months in advance, so the anticipation was incredibly high based on all the previous reviews we'd read.", "title": "Quiet Excellence!", "helpfulness": 3, "user": "LoneWolf153", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18087958, "likes": {"liked": "— The location and staff", "disliked": "— Room was very Olive green - not my favourite colour but others may like it!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "It did not disappoint. Granted, the hotel is off the beaten path in Venice, but that is perfect. It is close to a vaporetto stop and really very convenient.", "title": "Perfect Spot in Venice", "helpfulness": 2, "user": "ms328", "date": "July 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18035377, "likes": {"liked": "— Hotel Room and Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "This hotel is a typical European hotel. It seems very cramped but it is not once you realize it has everything you need. It is in a great location (walking distance from everything). The rooms are rich in colour but you have every emenity you need. They are very clean. You have to remember you are in tight quarters anywhere in Venice. This hotel has a lovely breakfast terrace with wonderful food. You eat and get right on your way. There are no lounge areas here. You can walk everywhere or take the valporetta. Remember to eat at the restaurants off the beaten path. They have wonderful food and 1/4 of the price. If you are looking for sun and beach for a day, go to Lido. It's awesome.", "title": "lovely", "user": "BarrieBarrie", "date": "July 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8266099, "likes": {"liked": "— the location"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "This hotel is wonderfully tucked away in a quiet location. If you want peace you'll find it here.", "title": "Far From the Madding Crowd", "user": "spg888", "date": "November 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22236622, "likes": {"liked": "— Excellent location, quiet and very clean", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "Saying that, you are still very close to the vaporetto stop, 1 minute I'd say, and only a 15 or 20 minute walk to the tourist hub of St Mark's Square.", "title": "Perfect.", "helpfulness": 1, "user": "campseat", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22168905, "likes": {"liked": "— Value in an expensive city.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The host that we saw most of, Walter, couldn't have done more to make us feel at home. Nothing was too much trouble. He is a genuinely nice man and his English is excellent.", "title": "What a lovely hotel", "user": "biztravellerBC", "date": "November 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 22073743, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008", "text": "We stayed in room 6. It was gorgeous. I've never seen ceilings so high in a bedroom! It was also very clean. There was adequate bedding and a modern heating system. There was a good selection of channels on the TV.", "title": "Absolutely wonderful!", "user": "vitaminbee", "date": "November 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21992496, "likes": {"liked": "— Friendliness of staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The bathroom was also very modern and exceptionally clean. Lovely soft towels and a very effective shower. There was a bath too.", "title": "We loved this hotel!", "user": "kela2", "date": "November 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 21950534}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We recently went on a European trip that included France, Venice, and Germany and ultimately stayed in a 4 different hotels. None of them came CLOSE to the Hotel Al Ponte Mocenigo in making an American family feel welcome.", "title": "Are you being Served? If You're An American in Venice - Yes!", "helpfulness": 1, "user": "PuterDude", "date": "August 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 18935933, "likes": {"liked": "— The respect shown to the guests", "disliked": "— We only got to spend two nights because they were booked the other two."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Highlights:", "title": "A very welcome experience", "helpfulness": 1, "user": "muttybok", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18673881, "likes": {"liked": "— Quiet, peaceful and very, very friendly!!", "disliked": "— Can't think of anything negative."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Free wireless Internet. It didn't work initially due to room location so they PROVIDED an Ethernet cable and a power outlet converter so I could wire straight in. What a welcome bonus. So many hotels in Europe say they offer High Speed Internet but when you get there you find out it's often not free (closer to $30 per day) and often only in common areas.", "title": "great little hotel", "user": "Aly55", "date": "August 5, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 18636149}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The courtyard. Very quaint, clean and quiet. Pigeon free. Don't laugh, in Venice this is an accomplishment. The food is rather pedestrian for breakfast, but the staff is wonderful, friendly and attentive.", "title": "Hidden Gem", "helpfulness": 1, "user": "crooksy", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18599745, "likes": {"liked": "— The location and helpfulness of the staff", "disliked": "— The hard beds"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The owners. They are happy to converse at length with the guests and give well considered advice on what to see, where to park, and just as important, what NOT to do or where not to get ripped off.", "title": "Great hotel with a great location", "helpfulness": 2, "user": "JDCharlotte", "date": "August 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18573030, "likes": {"liked": "— It's location - close by everything but away from the touristy stuff", "disliked": "— Nothing, it was great!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "I have been putting this off - I don't want everyone to know about this amazing little hotel almost in the heart of Venice. Travelled with a friend and booked this hotel after reading Trip Advisor Reviews - rooms were well decorated and spotlessly clean. The breakfasts were great - not a full English but then we were in Venice and did not expect it. When our 72 hour pass ran out we walked and it was not any more than 10 - 15 mins to St Marks- unfortunately something in Venice always catches your eye and you have to stop and look so it is impossible to be accurate with timings. We became very brave and took the traghetto across the canal - great fun and so cheap. This was my third time in Venice and it is somewhere that I will always return to - I just love its magic!!", "title": "super hotel", "helpfulness": 2, "user": "SisterMargaret", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 22316941, "likes": {"liked": "— convenience to vaporetto and cleanliness", "disliked": "— cannot think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "I can't think of anything about Hotel Mocenigo that could have been done better. It's located about 100ms from San Stae vaporetto stop so very central. The rooms are beautifully appointed, clean and comfortable. Breakfast is generous and delicious. Everyone who works there is helpful and pleasant. Walter, one of the owners I think, could not be more helpful. He's full of good information re local restaurants, itineraries, bus times etc etc- and generous with his time.", "title": "Excellent! excellent!! excellent!!!", "helpfulness": 2, "user": "sumacLondon", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22313411, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "One of my top two hotels ever.", "title": "Venice the First Time ... But Not the Last!", "helpfulness": 1, "user": "maidinitaly", "date": "November 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22293064, "likes": {"liked": "— High standard of accommodation, service and cleanliness.", "disliked": "— No bar or communal space (pretty courtyard but too cold in November)."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I'll be recommending Hotel Mocenigo to everyone.", "title": "Secluded and individual", "helpfulness": 1, "user": "NickLz", "date": "November 29, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 22288149, "likes": {"liked": "— The staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Our 2-day visit was made more enjoyable by staying at this pretty hotel tucked away in a quiet neghbourhood but with the S. Stae vaporetto stop less than a minute's walk away (15 minute ride to S. Marco). Or, just a 10 minute walk through pretty lanes leads to Rialto and S. Marco. All the staff were friendly and helpful and most spoke excellent Engish. Good sized, well-appointed rooms and bathrooms were spotlessly clean (as we were a party of 9 we all had a good look around each others' rooms! ) Very well priced for such a high standard of accommodation. Staying at the Al Ponte Mocenigo enhanced my first ever visit to Venice and when I return I shall book in again!", "title": "Getting Off the Beaten Path in Venice", "user": "roadwarriorz", "date": "November 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 22274136, "likes": {"liked": "— Spacious, well-decorated, comfortable, off the beaten track", "disliked": "— Power only works when you're in your room, partial shower door"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We stayed here for 3 nights for our honeymoon after finding it on TripAdvisor. The hotel definently lives up to its reviews.", "title": "Gorgeous hotel", "helpfulness": 2, "user": "GlasgowLauraG", "date": "January 3, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23225339, "likes": {"liked": "— The gorgeous rooms and location", "disliked": "— NA"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The rooms are beautifully decorated, the bathrooms are well equipped and the staff are very friendly and efficient.", "title": "Nice place tucked away in a Venetian alley", "helpfulness": 2, "user": "asearchforreason", "date": "January 1, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23166667, "likes": {"liked": "— good price, nicely appointed", "disliked": "— breakfast selection was limited"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "A breakfast was served in the morning of rolls, croissants, fruit, etc and was more than enough to fill you up till lunch time.", "title": "Pleasantly Surprised", "helpfulness": 3, "user": "misswing", "date": "December 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23107606, "likes": {"liked": "— service and location", "disliked": "— hairdryer in bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The location of the hotel was ideal - a 10 minute stroll to St Marks square but in a quiet area away from the more touristy areas. There are a couple of restaurants and bars around the corner that served delicious food. The water taxi stop was also just outside and handy for travelling to/from the airport.", "title": "Perfect city hotel, exceptional value.", "helpfulness": 3, "user": "roundtheworldneil", "date": "December 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23102083, "likes": {"liked": "— The room quality", "disliked": "— Leaving it"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We are already planning our next trip to Venice and will definently stay at the Al Ponte Mocenigo.", "title": "Wow! #1", "helpfulness": 5, "user": "brokeguy", "date": "December 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22788368, "likes": {"liked": "— Everything"}}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 2, "variance": {"poor": 5, "average": 24, "very good": 230, "terrible": 2, "excellent": 1485}, "aka": "Al Ponte Mocenigo Venice", "slim_ranking": 0.0131233595801, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}