{"user_rating": 4.0, "review_count": 245, "name": "Hotel Palace Royal", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "The smell of chlorine from the central indoor pool tends to let its presence known. The atrium rooms overlook the pool, more traditional ones the surrounding streets. Two days on Quebec is enough to see it. The hotel is in a good location a couple of blocks fgom the parliament and 15 min walk from the station.", "title": "Quirky Quebec hotel", "helpfulness": 1, "user": "EdMcC", "date": "August 8, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 171391285}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We spent 4 days there at the end of July and found the location just perfect, just outside the old city on the Rue St Jean. Everything was a maximum of 15 walk away. The Hotel is under renovation and in general is in good condition.", "title": "Excellent Location, close to the Old City", "helpfulness": 1, "user": "Brian E", "date": "August 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170336462}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had a suite on the 3rd floor and found it spacious, comfortable and with all the necessary amenities. However it could have done with a serious touch up as it was looking a little tired. All suited overlook the atrium pool and have a small balcony. We were a bit too close to the action and could touched the bathers heads!", "title": "Vive Le Hotel Palace Royal (Old Quebec)", "helpfulness": 1, "user": "KikiC2013", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170218620}, {"rating": 1.0, "stay_parameters": "Stayed July 2013", "text": "Noise can be an issue you need to be careful with room selection if you want peace and quiet. The daytime noise from the pool especially with all the kids playing - can be a nuisance and as a result we never the used the balcony. Having said that, many balconies were constantly in use so some must find this attractive. In winter it would probably be quite quaint. On the other side we were far enough away from the Place D'Youville and its nightly music.", "title": "Dangerous - AND a waste of money.", "helpfulness": 2, "user": "Arynn", "date": "July 25, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 169014773}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "The service ranged from top drawer to total disinterest but overall was quite good. For example when we first asked how we could purchase Celine Dion tickets, we were told to look it up on the internet! On the next day we tried again and that concierge walked us outside and pointed out a ticket vendor down the road", "title": "Great location for old Quebec city", "helpfulness": 1, "user": "anh_toronto_10", "date": "July 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 167659995}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "This hotel is great. The location is perfect with the beautiful Place D'Youville outside. During winter with the snow and iceskating it is picture postcard perfect.", "title": "Fantastic!", "user": "Ms_ShuttergirlfromOz", "date": "January 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 150803545}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had a family room that was incredibly spacious. It was beautifully decorated and the beds were super comfy. The staff at checkin were very helpful and we liked that there was a little store downstairs with the basics if you needed them.", "title": "Well located in Old Quebec City", "user": "LuckyPierre_11", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150395966}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The location of the hotel is great for easy access to old town and lots of nice places to eat.", "title": "Great location, service & room", "helpfulness": 1, "user": "Langroch", "date": "January 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149218884}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My only complaint was nobody came to clean our room for nearly 4 days, which I thought was incredibly strange. We only had someone come once I rang and complained.", "title": "Really BAD Service", "user": "isabro198111", "date": "January 8, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 149214512}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I would still very much recommend this hotel, our room was beautiful and the location was perfect.", "title": "Not Satisfied", "user": "Theitinerants", "date": "January 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 148993144}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I was visiting Quebec City on a school trip just last week. Our hotel was changed from the Delta last minute and I am glad it was!!! This hotel was beautiful. We had 4 people to a room and it fit us very well. Very clean. Location is fantastic as you are in close proximity to mostly everything you want to see. I had a fantastic view of the wall Saint- Louis and I know for a fact that the views from the other rooms were pretty good too. I stayed in a suite and I have to say that the rooms were as fantastic as shown on the website, which for most hotels isn't the case. We had breakfast there one morning and it was one of the best breakfasts I had over the entire course of the trip and we had breakfast at some pretty sophisticated places (e.g.. the parliament building). There was only 2 complaints that I had; the lights in the bedroom were not working- but that was fixed shortly after we arrived, and the room was fairly cold. However the heating issues of the room were not reported by our school. I'm sure it were, the staff would have been as diligent as proven before. Overall, this was an amazing hotel. This on top of the beautiful city of Quebec, and I would have gladly extended my stay. If I were to visit Quebec City again I would definitely choose here to stay and I strongly encourage everyone looking for a hotel to choose here!!!", "title": "A True Palace", "helpfulness": 1, "user": "travelgirl9956", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164321578}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "My husband and I stayed one night in a suite with a balcony overlooking the pool. We've been to Quebec City many times and have stayed in a variety of locations but this one was one of the best. The room was ready for our early check in and the front desk allowed us to check out late the next day. Our king sized bed on a platform was very comfortable and the suite was spacious and well equipped with mini fridge and microwave. Our package included supper and breakfast at Le Beffroi. Both meals were delicious and the service was excellent. The location is perfect for walking anywhere in the city.", "title": "Very comfortable stay", "helpfulness": 1, "user": "764Kim", "date": "April 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158506014}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I stayed at this hotel few times and even sent people to the Palace Royal in Quebec City at very good price for the quality of the rooms, pool, fitness center and the great diner place called Le Beffroi Steak house. The location is great since you are in the old Quebec and near all the events and good restaurants in town. Just by walking you go to St-Jean Street to the terrace Dufferin passing in front of nice souvenir shops next to the Chateau Frontenac the most photographed hotel in the world with a very nice view of the St-Laurence River and the historic sites like Les Plaines d'Abraham. The people working in the hotel are very proud to help you to make your stay enjoyable.", "title": "In Quebec City, a place to enjoy", "helpfulness": 2, "user": "plusplus1", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156695838}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The stay at hotel Palace Royal was just wonderful. Although we had booked a room for just three days, but the place impressed us so much that we extended our stay for one more day. All the staff members are great at their services. They all are efficient, humble and polite people. That yummy breakfast, which had plenty of choices, was one of my favorite meals. The rooms are big, clean, and very fresh and bathrooms were also well-maintained. No leakage anywhere, room service was available all the time. No complaints. A lovely Place!", "title": "Mesmerizing experience", "helpfulness": 1, "user": "surendra14789", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154739336}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The hotel is close to all attractions, lots of restaurants and shopping. The rooms are clean, service is perfect. The indoor pool was a blast for the children. However, parking is little pricey. Overall, very nice hotel. I would highly recommend it.", "title": "Winter Vacation in Quebec", "helpfulness": 1, "user": "ZK1997", "date": "February 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152902502}, {"rating": 3.0, "stay_parameters": "Stayed July 2013", "text": "I am in room 307. I am the one that you didnt agree with regarding being in construction zone. I have seen many travelling issues but when :-) a general manager tells me that he puts me into a construction zone to accomodate me (floor 5th original room was 506) I can tell you that you are on the top list to being the worst hotel manager in North of america. Then you tell me that you dont like how I talk ?! The only think that I wanted was a room out side of the construction zone I dont need your excuses ! I paid $500 For two nights !!!", "title": "Mr general manager", "helpfulness": 2, "user": "rew345", "date": "July 12, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 167335841}, {"rating": 4.0, "title": "Well placed to visit the \"Old Town\"", "text": "Tourists, floor 5th has some sort of major piping issues. Stay away from floor 4th, 5th and 6th. They will be noisy! Floor 5th will be filty and dirty.", "user": "A TripAdvisor user", "date": "July 12, 2013", "id": 167289859}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Good luck during the renovation.", "title": "Wonderful stay at the Palace!", "user": "Sadie242", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166901383}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The second of three hotels I stayed in during my trip, from which I was able to do the tourist bit. The hotel has the same feeling about it as the Quebec Plaza (same hotel chain), but it is bigger.", "title": "Very Expensive and Noisy", "helpfulness": 1, "user": "ShouthShore", "date": "July 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 166556907}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Breakfast choices are OK and they are tasty.", "title": "Outstanding hotel at the entrance of Old Quebec City", "user": "Jmesis", "date": "July 6, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 166518150}], "location": {"country": "Canada", "city": "Quebec City"}, "variance": {"poor": 12, "average": 32, "very good": 91, "terrible": 6, "excellent": 104}, "aka": "Palace Royal Hotel", "slim_ranking": 0.408163265306}