{"user_rating": 4.5, "review_count": 142, "name": "Hotel St Clair", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We spent 4 nights at the St. Clair Beach Resort and would have loved to have stayed longer. We were in room 105 which was a signature suite 1-bedroom apartment which comfortably fit us and our two small children (one in a cot and one in a portable crib). My parents traveled with us and stayed in another room but spent more time in ours because of the setup and the view. It was huge and faced the St. Clair beach. We spent so many nights watching the surfers come in and the waves crashing. It was such a relaxing experience. The staff was lovely and accomodating to our needs. We travel to NZ every two years to visit family and we won't stay any where else now that we've been to the St. Clair! Also, make sure to try the Starfish Cafe just down the street. Lovely for breakfast, lunch or dinner.", "title": "Amazing View at a Reasonable Price!", "helpfulness": 1, "user": "Kiwis_wife", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124915383}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Located right on the ocean our room had great views of the sea and the promenade to the south. Another reviewer has commented on the sound of the sea, but while we were there with a massive storm and high tides, had no problems at all with noise and slept fine. The staff we very good and helpful. The restaurant is excellent with very professional staff and very good food. The room was a little pricy for the level of fit out, but it was still a good sized room with lounge, table and chairs. Would definitely stay there again.", "title": "Very Nice Accomadation", "helpfulness": 1, "user": "Wayne R", "date": "February 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124776577}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "This property is located in South Dunedin and by the waterfront, which is most scenic. It is also only a short drive from Dunedin Airport, Dunedin city centre and the Otago Peninsula. St Clair neighborhood is definitely not student town grubby. A short walk away is a couple of nice cafes, spa, and an outdoor heated pool just by the sea.", "title": "Home away from Home", "helpfulness": 1, "user": "wonol030", "date": "February 15, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124639317}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Every room has its own ensuite, couch and kitchenette. The smaller rooms do not have cooktops but has a small fridge and microwave at least. There is a restaurant on the ground floor of the resort with views of the sea, and they do provide 24 hour room service. There is limited but free carparking underground. Otherwise, offstreet car parking is also free of charge.", "title": "very good accommodation", "helpfulness": 1, "user": "ctr_9", "date": "February 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124602732}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Public transportation to town centre is just behind the property on Victoria Road.", "title": "Fawlty towers in Dunedin?", "user": "julznz", "date": "February 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 124272531}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed here in January 2011 for two nights and it was wonderful!", "title": "Favourite accommodation from our NZ trip", "helpfulness": 1, "user": "lindafrompotch", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117686550}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "Our kind of hotel with wonderful appointed rooms, great views and a stunning restaurant.", "title": "Very nice hotel but why at St Clair?", "user": "Dughlas", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 116147080}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We thought Dunedin is a wonderful city and really enjoyed our time here.", "title": "Almost", "user": "tantallon3", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 1.0}, "id": 115940895}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Will definitely recommend this hotel and hope to stay here again", "title": "Great spot right on the beach.", "helpfulness": 1, "user": "DanO68", "date": "July 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 115403431}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "St Clair is a seaside suburb which has that run down feel of some English seaside towns. So why build a modern, multi story hotel here? The rooms are comfortable and spacious but like many places in Dunedin it is expensive.", "title": "Nice location but confused delivery", "user": "jj711", "date": "May 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 110474638}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed the first night in Room 207, facing the sea. The room was supposed to be a double but in reality it is only a single. One armchair no shelves or storage space in the bathroom, a small single wardrobe, very cramped for the price. Facing the sea crashing in it was like trying to sleep on an aeroplane with engine noise. We complained and were moved to a much quieter and larger room 102. No view, cheaper and much larger dining table,2 carver chairs, sofa, armchair, shower,bath,shelves, cupboards,double wardrobe, vastly superior room. Wi-fi $15/hour, free in Dunedin town centre. Underground secure parking, lift to all floors. Once we had moved to room 102 our opinion of the St Clair improved. We ate in one night at the hotel restaurant Pier 24. The food, when it finally arrived after 50 minutes was excellent. Eventually we were asked if we would like coffee and deserts. The waiter only brought one pudding and eventually and we had to wait another 10 minutes for the second pudding to appear. From previous reports I'm sure we were victims of a run of bad luck. Not the birthday treat my wife expected.", "title": "Seafront location (noisey)", "user": "LudoBradford", "date": "January 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 123651130}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The hotel has a wonderful restaurant. We stayey for 4 nights over Xmas. While the weather was hot bring a wetsuit if you have any intention of going into the sea. The surf is fantastic and the beach is not crowded.", "title": "A wonderful location", "helpfulness": 1, "user": "Ian136", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122154590}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "we have stayed here about three times and each time it has been great. The first time the room was not ocean front but still very nice. this last time we had a small hiccup over the room offer and the price that was quoted. Not a problem ! The Owner contacted us and we had a very nice converstion and all was sorted. He even offered us breakfast on the house.Spend the extra money and wake up only about 14 mteres from the water and lovely morning sun pouring in.The beds are really comfortable and everything beautifully clean and well cared for.One suggestion ,in 2 of the rooms we were in the T.Vs face the seating so abit of a challange to watch tv from your bed.all they need is the money spent on swivel brackets put behind them.(Not a huge cost ) I quess I will have to mention a slight neg ( hate to do this but companys can learn from them) The Lass we dealt with at Reception was rather cold and spoke to me as if I was a child and kept saying I have told you that there was no other rooms available which I already had accepted that .so perhaps the owners could give some lessons on how to handle people.im sure shes a lovely person but dont forget the customer is the person who is paying for them to exist..My husband and I are in our sixtys and have been lucky enough to tohave done alot of travel. This resort is a very special little place that makes you feel like you are on holiday even though you are in the city because of its postion. we look forward to going again and again when we have to do business in Dunedin. Oh also dont forget to take some nice walking shoes so you can wake up and have a lovely walk along the ocean front or on the beach when the tide is out. ENJOY !!", "title": "wake upt to the beauty of the beach almost in the room", "user": "gaylene62", "date": "December 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121804387}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We really enjoyed our two nights here recently. It was at the end of long tour of the south island and some questionable accommodations. I was so happy to pull up to a beautifully modern hotel with glass balconies, overlooking the beaches of Dunedin. Added bonus to our stay was the free pass to the local salt water pool, which our children loved.", "title": "Modern and clean, lovely location", "helpfulness": 2, "user": "kfheller", "date": "December 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 121375963}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Only a couple minor negatives about this hotel. It is very loud and it was quite hot in our room. We had to sleep with the windows open because there was no air conditioning. The sound of the ocean is quite intense and there is a significant amount of street noise. Difficult when trying to get two preschoolers to bed. Otherwise, a great stay!", "title": "A hidden gem", "helpfulness": 2, "user": "wrighty2012", "date": "September 13, 2011", "detail_rating": {"location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118051602}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We had room 401 which had a view all a long the beach, away from the elevator and had a bath, in addition to the walk-in shower. The bed was extremely comfortable and had 3 levels of heating, the bath had an instant heating: appreciated add-ons in a place that might be quite chilly. We went for a walk on the 3.4 km long beach: strong wind, heavy sun, intensive light, quite an adventure. Not to be missed: a dinner at Pier 94. We loved the Cauliflower soup and the Tortelloni filled with roasted pumpkin. My wife would love to have the recipee, but that's likely the Chef's secret...", "title": "Lovely!", "helpfulness": 1, "user": "Travellersfromswitzerland", "date": "March 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126372363}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "We did a one nighter here and it was everything we were hoping for. Good service, room, facilities and great view and location. A veritable south English hotel experience set on the prom with a good feel. Thoroughly recommend it.", "title": "Great place to stay", "helpfulness": 1, "user": "Whittakb", "date": "March 16, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 126190827}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed for 3 nights. An excellent modern hotel with great views along the beach. Can't rate the staff high enough.", "title": "Great beach views on edge of Dunedin", "helpfulness": 1, "user": "HauntedHospital", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125706684}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "A few miles out from the city centre on the beach front, ideal if you have transport. The self serve breakfast just hit the mark. Rooms large and well equipped and good decorative order.", "title": "Gem with an ocean view", "helpfulness": 1, "user": "lmd15", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125457726}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We stayed at the St. Clair in February with our daughter and her family. We were in a standard room that didn't have the sweeping view that our daughter and her family had in the 1-bedroom suite but it was still a wonderful view. We did not notice any noise at all in our unit or in our daughters. The staff was helpful, delivering a paper each morning.The staff at the front desk gave us passes to the salt water pool nearby and beach towels as well. They even gave us towels when we took our grandsons to the Moana pool. There is a park just around the corner that the children enjoyed. This hotel is out of the city center, but that is what we were looking for on this visit. We would stay there again.", "title": "Brilliant. Everything you need and a good place to relax.", "helpfulness": 1, "user": "Rebecca L", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125369640}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 0, "average": 9, "very good": 40, "terrible": 3, "excellent": 90}, "aka": "St Clair Beach Hotel Dunedin", "slim_ranking": 0.148148148148, "description": "Hotel St Clair is perched directly above the white sands of St Clair Beach and represents Dunedin's finest beachfront living. Built with the environment in mind, this boutique hotel offers 26 contemporary rooms - each beautifully designed and furnished to complement the stunning South Pacific Ocean that dominates the views."}