{"user_rating": 4.0, "review_count": 295, "name": "Hotel Charleston", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My mother and I stayed at the Hotel Charleston based on their trip advisor reviews and the reasonable price they offered. We booked a superior room, which was cute, spacious and had a nice view out on to the square. The bathroom was quite large with a bathtub. At first glance it was quite nice.", "title": "Great town-decent hotel", "user": "knitting_danica", "date": "June 12, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 4.0, "value": 3.0, "rooms": 2.0}, "id": 7839153, "likes": {"liked": "— staff", "disliked": "— the beds!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "However, whenever any water was run it sounded like an airplane was landing in the bathroom. Unbelievable.", "title": "Great location, excellent rates & service", "user": "Paola C", "date": "March 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7252320, "likes": {"liked": "— Excellentservice quality & location at very affordable rates.", "disliked": "— Being assigned a room without a mini-bar..."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "My major complaint was that the mattresses were the worst I have experienced in any of my travels. YOu could feel and hear the springs. My mom kept laughing because everytime I moved the entire bed squeaked.", "title": "Great little hotel!", "helpfulness": 2, "user": "Heather9172", "date": "August 7, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5564817, "likes": {"liked": "— The personal touch of a small hotel", "disliked": "— Very slightly too small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed for 5 days in September 2008. The hotel is located within the walled city so conveniently placed for visiting Spoleto. It is a medieval building and our room had a character oak beamed ceiling. It was, however, quite small and the lighting was poor. The staff were extremely friendly and helpful and the hotel and rooms were all clean.", "title": "Friendly and well located", "helpfulness": 1, "user": "wine_searcher", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 20567084}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Good hotel in excellent position. Our room was large with double aspect views which over looked the square, which was nice. The town was quiet when we arrived at 6pm but later on in the evening it was really busy and buzzing with people. Breakfast was on the terrace, there was plenty of choice, fresh friut, bread rolls, meat, cheese and cakes. As much fruit juice and coffee as you could drink. Would stay there again if visiting Spoleto.", "title": "good value", "helpfulness": 1, "user": "minandsash", "date": "August 31, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 19584862}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We booked this hotel through Trip Advisor based on the hotel's reviews and the photos available at the time. Spoleto was intended to be a 'treat' ... yeah right. The hotel was absolutely appalling - the room was hot as hell, miniature in size to the point of not being able to use the mini bar or the television precariously balanced on top of it as we had to move it out of the way to get around the bed, it was at the top of the building with the only window way up high with pigeons nesting on the sill outside, shower opening maybe 8\" wide, dust balls rolling round the floor, moth holes in the bedspread, decor that was completely at odds in terms of colours and to top it all off bed bugs. BE WARNED! The staff at reception did recommend a couple of good restaurants .... and we did go out and find the nice Spoleto, but would have to say the hotel experience we had at the Charleston has put us off ever wanting to stay in the town again", "title": "Ghastly!", "helpfulness": 1, "user": "WellingtonDwarfs", "date": "August 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 18590935, "likes": {"liked": "— Leaving", "disliked": "— Bed bugs"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We stayed here for 2 nights during a week-long stay in Italy. We booked directly with the hotel online and were required to pay in advance by credit card. Upon arrival we checked in with no problems.", "title": "Nice hotel, good location", "helpfulness": 1, "user": "Belcasino", "date": "October 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 10050777, "likes": {"liked": "— Just a nice place - good location, fair price overall", "disliked": "— Just a minor thing, but the breakfast was shocking!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The hotel itself is lovely - in a square in a part of town which isn't too far to walk to the \"centre\" (although Spoleto is pretty tiny, so nowhere's really far away). The communal parts of the hotel were very nice - there's a bar, 2 large lounge aras with squashy leather setees and a computer, presumeably with internet access, papers and magazines are also provided in the lounge areas. There's also an outside terrace area which was very pretty, they have candles on the tables at night and it would be a nice spot in the summer.", "title": "Lovely place", "helpfulness": 2, "user": "ItaliaTraveler", "date": "June 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7849782, "likes": {"liked": "— Spacious room", "disliked": "— Can't think of anything"}}], "location": {"country": "Italy", "region": "Umbria", "continent": "Europe"}, "stars": 3, "variance": {"poor": 12, "average": 33, "very good": 130, "terrible": 8, "excellent": 112}, "aka": "Charleston Hotel Spoleto", "slim_ranking": 0.375, "description": "The newly-renovated Charleston Hotel is run by a team of professional staff who make your satisfaction a priority. Guests are greeted by a warm ambience with a relaxing setting. Housed in a 17th-century building, the Charleston Hotel provides the perfect blend of original architecture and modern comforts. Features include complimentary wireless Internet access, a beautiful terrace, and a library. Character oozes from the wooden beams painted with noble family stems, a lobby piano, and the antique fireplace which provides a cozy glow in the winter months. Combine this with a sauna and a lounge bar, and you have the perfect place to come back to after a day of exploring Spoleto."}