{"user_rating": 4.0, "review_count": 397, "name": "Hotel Continental Oslo", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "I reviewed the Oslo Grand a few weeks ago and said I prefer this hotel - and that is still the case. I haven't stayed here for a while but it is as good as before. Room was a very good size, as was bathroom and everything is fairly modern and to my taste. Nice bath and bed. Only complaint was the one single duvet they gave me and I had to ask for another as it was freezing in the room and I like a big duvet. But they brought it up promptly to me. I didn't eat breakfast as was busy having a lie in! Great location next to the nationaltheater station and the bar was very full with a nice atmosphere when we arrived at 8.30pm. Only gripe is no iron in the room.", "title": "My favourite choice in Oslo", "helpfulness": 1, "user": "ce2-batson", "date": "December 7, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 121478899}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I ate at Ruffino Italian two blocks up the hill with some friends from Oslo and would recommend it for excellent service and food.", "title": "Very good-but could be better", "user": "piucat", "date": "December 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121459844}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "Definitely stay here next time I am in Oslo", "title": "Absolutely delightful old city charm", "user": "businesstraveler036", "date": "November 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 121131702}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "A 4 day (3 night) weekend in Oslo in late November: an excellent, efficient -albeit it not cheap - Flytoget train ride from the Airport to National Theatre station, that turned out to be some 50 m from the Hotel was a good start. Due to the quick transfer, we were rather earlier than anticipated and our room was not yet ready. The Desk Staff took the suitcase and said that we would be told when the room was ready if we stayed in the Bar area. We decided on a warm drink. I asked for a pot of tea and when I requested Darjeeling, I was told that they didn't have any! Not an auspicious start for a so-called 5 Star Hotel.", "title": "Just Lovely", "user": "Coldrach", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121125751}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We had asked, and paid, for a better room and, following advice elsewhere on Trip Advisor, for a room overlooking the \"courtyard\" for some peace and quiet at night (it was). Our room was on the top floor (8th) and some way away from the elevator/lift.The room size was good and the bathroom was larger than many hotel rooms that I have seen!", "title": "Comfortable and convenient", "user": "NeedhamCrowe", "date": "November 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120609438}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Having stayed in many Leading Hotels of the World and Virtuoso properties, I found this hotel relatively unremarkable, though I must commend them on the quality and warmth of the excellent and discrete service provided...the true shining point of the hotel in my mind. I was quite impressed by the number of hotel staff who consistently addressed me by name and were focused on providing a pleasant experience.", "title": "Fine Enough but Hardly a Leader Within Leading Hotels of the World", "helpfulness": 1, "user": "TurtleCreekTraveller", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128328120}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I arrived via the Flytoget train taken to the National Theatre station. There are two exits at the station, so be sure to take the exit for National Theatre, which will place you across from the hotel's entry. At the other exit, the hotel will not be visible.", "title": "Nice place, but wasn't ecstatic", "user": "TcarlGren", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 128269265}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Location is excellent, as the heart of Oslo is relatively compact, a number of museums and restaurants are close at hand, the subway and tram services easy and frequent, and ferry services to the museum island a 5 minute walk from the hotel.", "title": "There is a fine line between antique and rubbish", "user": "SonnyCrock", "date": "March 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 126929994}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Apparently a room renovation project is in progress, as I asked for a renovated room and received one, done to a nice level of detail and with quality materials and textures appropriate to 5-star standards. Molton Brown toiletries were in the bath and housekeeping generously replenished them.", "title": "Elegant And Personal Hotel in Great Location", "user": "Riccardo R", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126781106}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The weaknesses of the property in my mind were the breakfast and the lack of any spa features. I found the breakfast room to be crammed with tables and uninspired, with the buffet choices equally uninspired, with minimal hot foods and a poor and bland pastry selection. Service, as elsewhere, was wonderful, but breakfast was a bland and boring start to the day, and I find that rare for a property in the LHW organization.", "title": "Nice old place, but not worthwhile", "user": "rjw420", "date": "March 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 126504642}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "A really fine location, close to all transport links..a top class hotel...Servers, staff are class...quality throughout the buildind , with fabulous breakfasts....Five stars!!", "title": "Merited five stars", "helpfulness": 1, "user": "tom c", "date": "December 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 122217861}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We spent two nights at this hotel in October 2011.", "title": "Fascinating combination of new and old", "helpfulness": 1, "user": "MarkoSHelsinki", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122117814}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The hotel is perfectly located opposite the National Theater and Airport Express Train station. The fascinating Aker Brygge area and Oslo's main shopping streets are just a short walk away. If you decide to visit the Viking Ship Museum and other interesting museums in the Bygdöy area, the bus stop is just outside the hotel's main entrance.", "title": "Old charm in modern rooms", "helpfulness": 2, "user": "John1970031", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121631063}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We had a recently renovated room facing the inner courtyard. The room was a nice, well thought-out combination of old charm and modern facilities. Please note that it makes a big difference whether you are having a renovated room or the \"original\" room at this hotel, as some reviewers on this site have already made perfectly clear. It is also worth noting that the hotel seems to be in the middle of a renovation project, as our inner courtyard view also included the opportunity to stare at the scaffold right outside the window. However, this did not disturb us at all, as there was nobody working there at the time of our stay.", "title": "Just a great traditional hotel", "user": "AndyHilton", "date": "December 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121617308}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The breakfast at the hotel was top-notch and very substantial, and it was served in a very nice environment on the 2nd floor. The staff at the hotel was extremely friendly and knowledgeable about the things to see and do in Oslo. The cafe/bar in the hotel's lobby area is very popular among locals, so expect to find it challenging to find a table/seat there during the busiest hours.", "title": "Charming hotel", "user": "DSW21", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121594775}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Sadly, our room (518) smelled musty. The bathroom had a slight sewage smell. We arrived too late (and too tired) to complain. Besides, the people at the front desk were so friendly and helpful it would have been difficult to complain to them. Once would also expect bathrobes at this price point, there were none. Norway can be Uber expensive, the Hotel Continental's bar is just that. Pretty indeed but very very expensive. Expected, but wow. Breakfast, included, was generous, lovely and nicely serviced. The staff at the Continental were all professional, friendly and on-their game. Please, send maintenance up to our room and air it out !", "title": "Expected Much Better", "user": "shexbends", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125409626}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "Close to everything but expencive. Location is the only reason for paying the rates they have.", "title": "Good location", "user": "sok", "date": "February 19, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 124805514}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We spent two night at the Continental in Oslo before heading to northern Norway. Arriving after midnight we were warmly greeted and shown to a very comfortable, luxurious but smallish room overlooking an internal courtyard (which ensured we were able to sleep late) The room was well furnished with two large arm chairs, bed, dressing table and desk which made it seem perhaps smaller than it was. However the bathroom was spacious and modern with quality toiletries, bathrobes, separate tub and shower. Our room, a ‘superior double’ came with complimentary fruit basket, chocolates and mineral water and free wifi.", "title": "Classical Comfort in the centre of Oslo", "helpfulness": 1, "user": "Intrepidtoo", "date": "February 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124151303}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "The hotel itself is in an historic building and although the rooms are modern they retain many of the heritage features and decorations in the lobby and public areas. Breakfast was a typical Norweigan selection of cold meats, fish, cheeses, salads, pastries etc. Perfectly adequate but not exceptional. As our departure was early they provided us with coffee, juice, fruit and croissant in the lobby.", "title": "Pluses and minuses", "helpfulness": 2, "user": "elizsil", "date": "February 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124033449}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Adjoining the hotel is the Theatercafeen, a bustling fin de siècle Viennese style bistro with splendid Norwegian dishes, attentive service and a great atmosphere, well worth visiting.", "title": "Good location , rooms a bit old and very vry old fashioned,", "user": "Boyfromla", "date": "February 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 124026965}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Just back from a long weekend in oslo. We got a great deal at the Hotel Continental which was 3 nights for the price of two which made a big differance. When you arrive in Oslo Lufthaven Gardemon you can get a train direct from the airport to 2 mins walk around the corner. But make sure the train Stops at Nationaltheatre. The train we got didnt so had to walk from oslo s ....still only a 10-15 min walk.", "title": "What a Hotel !!", "helpfulness": 2, "user": "corker20", "date": "March 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 126387701}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Check in was really fast and the lady checking us in was really chatty and friendly ( probably helped that we were irish ) She showed us areas we should see in oslo while we were there. I had requested a newly renovated room. This was really nice, huge bed ,2 sinlge duvets which is a good addition!!! and ample room in there althought the bathroom was small but the shower was power full which made up for it.", "title": "Great Location", "user": "pec50", "date": "March 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126350733}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "At night, you could hear noise from the street but you kind of get over that. There was noise from what sounded like water pumps so any time any one used a tap or toilet this noise went off and it sounded like people were moving furniture around. This was only there on the first night.", "title": "Classic Old European Experience", "user": "TripTex", "date": "March 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 126177856}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Check out there was a bit of an issue. The receptionist tried charging us for items from the mini bar that the previous occupants had taken. This came to nearly €30 worth of items, So just be aware to check that every item on the mini bar list is there when you check in to avoid any delay checking out.", "title": "Wow... best hotel in my life", "helpfulness": 2, "user": "cdnviking", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125803869}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The hotel is really easy to reach from the airport, just a short walk from the national theatre train stop. Its possible to walk to most of the City sights from the hotel but if you want to use the tram, bus, metro or train all are very close to the hotel. Oslo is a beautiful city. The only negative thing about the trip was how expensive Oslo is.", "title": "Best business hotel in Oslo", "user": "HedgehogLondon", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125539537}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The hotels in Norway are not rated. I'm staying in Oslo and from my research the only 2 hotels near to a 5 star rating is The Grand Hotel & The Hotel Continental. My advice is to stay at the Grand Hotel. I checked into the Hotel Continental, a Junior Suite, quite pricey and it was very small. When i saw the breakfast buffet, I was disappointed. Hardly nothing to choose from! I booked in for 2 nights and asked for a refund due to me being unhappy with my room and the breakfast, they would not oblige. Some of their staff also have an attitude. I checked out and checked into the Grand Hotel, same price as The Continental. At The Grand Hotel my Junior Suite was 3 times bigger, the breakfast was like a five star breakfast, a lot to choose from and they also have fantastic Spa Facilities. My advise, is stay at the Grand Hotel, same price and better by miles!", "title": "Very Poor", "user": "Raven7861", "date": "February 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 123959873}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "With a lobby that is classy and open, you can meet for tea, or just sit and read.", "title": "Classy hotel in the very middle of Oslo", "user": "Nancy B", "date": "January 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 123884919}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I really like this hotel. The rooms and halls have a air about them, that are better then the other big central hotels, and the ambiance is sort of boutique like. It sits just across from the National Theatre and has the Theatren Cafe attacted to it. That restaurant has very authentic Norwegian dishes done very well. I would say, about the best in town. It has giant arches and a beautiful setting.", "title": "Fabulous service", "helpfulness": 1, "user": "mehrdadnb", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123858127}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "It just feels good in this hotel.", "title": "Great Location", "user": "PROTravelerUK", "date": "January 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 123790303}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I have not stayed there, but have had meetings in the lobby, eaten dozens of times in the restaurant, and have visited the rooms of friends who have stayed there.", "title": "Best 5 star hotel in Oslo", "helpfulness": 1, "user": "KingfisherOslo", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123019077}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed here with our family in June of 2011. This is a great, central location if you are staying in Oslo. It is just a few blocks from the waterfront area where you can catch the ferry to the Brygge area or eat at any number of neat locations. And the subway line is just across the street.", "title": "Classy and convenient in Oslo", "helpfulness": 1, "user": "Highpoints", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122776724}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "The lobby is classic; relaxing and beautiful. We found the staff to be friendly and very helpful. The rooms were spacious, and there were a few options available that made the stay especially convenient for our family. Everything was clean too.", "title": "Excellent", "user": "Bollaspug", "date": "January 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122600649}], "location": {"country": "Norway", "region": "Eastern Norway", "continent": "Europe", "city": "Oslo"}, "stars": 5, "variance": {"poor": 25, "average": 69, "very good": 142, "terrible": 12, "excellent": 149}, "slim_ranking": 0.255813953488}