{"user_rating": 4.0, "review_count": 507, "name": "Hotel Eurostars Maimonides", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This hotel is a great deal, right in the heart of Cordoba and across the street from the Mezquita. The rooms are simple, but clean, and the hotel overall is quite nice. It's a miracle they don't charge more than they do.", "title": "Amazing Value and Location", "user": "robotmuppet", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38290382}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The location is excellent, about 2 meters from the Mesquita with private access road. The rooms are of average size and a bit non-descript however all very clean and well appointed. The lobby is very attractively decorated with an internal courtyard all in Moorish style. Staff all speak excellent english and very professional. There is also internet access in the lobby. This hotel states that it has private parking beneath the hotel, which it does, however just because you book a room it does not mean you will also get a parking space. If they do happen to have an available space you still have to pay extra for it (c. 12.50 euros p/n) however, these are severely limited. We specifically chose this hotel because of parking - which is an absolute nightmare within all of the old Andalucian towns/cities - and were told that it was unavailable. We drove back out over one of the bridges and parked across the river. Reception staff can recommend the best places to find free parking in Cordoba. Despite parking difficulties, this is a great hotel, superb location, great service and very clean. Extra bonus is that they offer online discounts if you book online on the day you intend to arrive.", "title": "Pleasant brief visit.", "user": "Friskies80", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 38152409}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "I stayed at Maimonides with some friends (two double rooms) for one night; breakfast was not included and we didn't ask for it either.", "title": "Good and central", "helpfulness": 2, "user": "paulolisb", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37295032}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "The hotel is very central, just opposite the Mezquita. Access was a bit tricky: the whole area is a pedestrian area, although cars are allowed in if you're a resident or a hotel guest; if you're coming from the Alcazar side, like we were, you need to go all the way around the Mezquita to get to the hotel.", "title": "What an Outstanding Hotel in Cordoba", "user": "MarkWButler5705", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 34711866}, {"rating": 2.0, "title": "A lovely hotel -- but watch out for fraud on check-in", "text": "The hotel has a garage; I advise travellers to request a garage space when booking.", "helpfulness": 3, "user": "Adam+Andrea", "date": "July 12, 2009", "id": 34511900}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Hotel Maimonides could not have a better location, being right on the doorstep of Cordoba's celebrated Mezquita, right in the middle of the historic centre. Everything is within easy walking distance from the hotel, which is by far and away the main benefit. The Mezquita entrance is literally 30 seconds away; the Alcazar is less than 5 minutes walk, and plenty of bars and restaurants are within 2 minutes walk.", "title": "On The Doorstep of the Mezquita", "helpfulness": 1, "user": "zippymonkey", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34446138}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Despite being only a 3* hotel, the reception area is very plush, being decorated in the traditional Moorish style of Cordoba. The reception was friendly, if a little abrupt, and we were able to both check in early and leave our luggage when checking out.", "title": "A lovey hotel in a wonderful location", "helpfulness": 1, "user": "Philippak", "date": "July 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34440732}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Our room was large and comfortable, having all usual amenities including free wi-fi access. Breakfast was adequate, consisting of a small selection of cheeses, hams, eggs and pastries, but if you get the chance, take it in the spectacular central patio area.", "title": "Very enjoyable stay.", "helpfulness": 1, "user": "alltheworld2c", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34267538}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "When in Cordoba, location is everything, especially in the summer when it can get stiflingly hot, so Hotel Maimonides would get our vote every time.", "title": "Great lobby, breakfast, and location - basic rooms.", "helpfulness": 1, "user": "MB6td", "date": "July 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 33776086}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "This was a lovely hotel and we had a room overlooking the mesquita in the old city. It was a 20 min walk from the bus station. Our room was big and comfortable. It was in walking distance to all attactions.", "title": "Great Location, Okay Hotel.", "user": "subterranean", "date": "June 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 33450653}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Nice hotel in an unbeatable location, it is right across the street from the Mezquita! Large rooms with nice bathrooms.", "title": "We were practically IN the Mezquita!!", "user": "JB0", "date": "January 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 53143327}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Pros: The location is the best in Cordoba. The staff is really friendly too. We had an excellent view from our room onto the Mezquita's church tower. The rate was quite reasonable.", "title": "Great location, but okay hotel", "helpfulness": 1, "user": "polyglot", "date": "December 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52109187}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Cons: The breakfast is mediocre and the room decor is really dated.", "title": "good but ...", "helpfulness": 1, "user": "twobeesandtwocees", "date": "December 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 51618787}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Location wise, you're literally smack in front of the mezquita and in the old part of cordoba. Lots of tapas bars and restaurants in the area so food is not a problem. Staff were friendly and rooms are clean. We got room 141 and 140 (smoking rooms) - clean, bright and no smoke smell from previous tenants. Beds are comfortable, not as hard as most european hotels and environment is quiet at night. Don't know whether this is worth mentioning considering we didn't have proof. My sister and I shared room 141 and by the end of our trip, scored a few bite marks and rashes on our bodies. Could've been bed bugs. Planned a 3 day trip and left after a night because we didn't realise how quickly we covered the old sector. If you decide to venture out into the city centre, its 6 - 7 € by taxi.", "title": "Excellent, perfect location, rooms excellent, service excellent, cannot fault it", "user": "MAR-AM-UK", "date": "November 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50275799}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed here for four nights during our tour of Andalucia.", "title": "Great location in an amazing city!", "user": "Tricia60", "date": "November 19, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 49588963, "likes": {"liked": "— Location and free wifi access", "disliked": "— Noise - marble floors everywhere and our room looked onto street (and Mosque!)"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The location is perfect, and it's a very well maintained, decent size hotel. The staff is nice and professional, but the overall feeling I got from the hotel was less personal and more like a well-run business, which is fine, but may not be perfect for a traveler. I'd recommend this hotel to anyone, though, for all its convenience and competency.", "title": "conveniently located, very nice, if a bit less personal", "user": "SeoulSearching", "date": "November 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 49489612}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed here for two days at the beginning of our Andalucia trip. This hotel is located right next to the Cordoba Mesquita and was an easy walk to restaurants, sights, etc. Price was reasonable for about 60ish euros at this time of year for a double room...room was comfortable and clean, with free wi fi. They also have a great view from the roof (which you kind of have to sneak onto through a window). Staff was effective and helpful, and spoke ok english. Our purpose was just to have a place to stay while we explored the city and so it would be hard to imagine having something much better for the value!", "title": "Perfect location next to Mesquita,would stay here again", "user": "ozzyh", "date": "November 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 48752322}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "I chose this hotel based on its location, and it was fantastic for that. The hotel was clean, efficient, and perfectly located, though there were a lot of tour groups in our hotel which made it noisy. The hotel is not especially charming, but it is comfortable. In general, Cordoba as a city is not extraordinarily exciting and probably my least favorite of those visited in Andalucia. While I went in off season and perhaps its more engaging in the warmer months, I recommend Granada and Seville instead. The mezquita is really the only big draw here, and as the hotel was located next to it, it's a fantastic choice for a convenient place to stay.", "title": "Great Location, but not much going on in Cordoba", "user": "browan04", "date": "October 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 47805479}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Very nice, comfortable hotel. The location couldn't be any better right next to the Mezquita and walking distance to everything worth seeing in Cordoba. The hotel lobby and main areas are really beautiful, with a courtyard, fountains, decorated in Moorish style. Very reasonable breakfast buffet, 12 euros. We got a great deal on Expedia during their Europe summer sale. I loved the atmosphere of Cordoba's old city.", "title": "Beautiful hotel, excellent location right next to the Mezquita, walking distance to everything", "user": "ADickson", "date": "October 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 45950523}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The only drawback about the room was that it was a little cramped, but we had a comfortable king sized bed. We also spent all our time outside and only came back to sleep, so it wasn't a problem.", "title": "Good value right opposite the Mezquita", "user": "felicityjg", "date": "September 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 42676200}], "location": {"country": "Spain", "region": "Andalucia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 34, "average": 72, "very good": 238, "terrible": 13, "excellent": 150}, "aka": "Eurostars Maimonides Hotel", "slim_ranking": 0.319444444444}