{"user_rating": 4.0, "review_count": 2271, "name": "Hotel del Coronado", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I have stayed in this hotel four times since the 1980's. If you stay in the main hotel you may be terribly disappointed. But if little things bother you then it will be even worse. I tried to find a wheelchair for a friend at 9:30 one night and there was none available. We had to put her on a luggage cart. I asked for an additional bar of soap, but never got one. There are places in the hotel that smell of garbage. Some of the rooms were designed for servants back in the 1800's but they still offer them at the regular price. I like the ghost -Kate, but she scares some people. All in All unless they get better management that understand how to meet the customer's needs, I would go somewhere else and visit the hotel for a day.", "title": "The del has lost it's charm", "user": "YesAC4858", "date": "October 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 143131979}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I was there for a convention, the place is old and the rooms are very outdated. I suggest staying at the Hilton or Gaslamp District. The place very well located but the overall needs to be revamped. IF you are there for the summer its ok, otherwise avoid it.", "title": "Overrated Overrated and Overrated", "user": "MrCaliAdvisor", "date": "October 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 142929142}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My husband took me to the Hotel Del Coronado for our 32nd Anniversary. We had a wonderful time ! We had Smores on the beach one night, I loved it. We loved the hotel . Marilyn Monroe made a move there. I loved that it was built in 1888. I would truly recommend this hotel and San Diego lots to do.", "title": "Hotel Del Coronado Awesome", "user": "shelliesellers", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142883146}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I first visited this venerable place in 1968 when it was smaller, with only the original Victorian hotel building, and less expensive. Over the years the property has been modernized and enlarged with the addition of buildings, which contain modern and comfortable accommodations, and restaurants. The huge and beautiful Crown Room has been retained and maintained as I remember it 44 years ago. The service is impeccable, the beach one of the most beautiful and clean in the world, and military aircraft fly over the beach, as always. The only complaint is that it is very expensive; it cost $50.00/day just to park your car. Though the restaurants are expensive, they are very good with great service. This is a place for a special occasion. I have returned there several times over the years, and hope to return soon. There is no greater place to walk the California beach.", "title": "A Wonderful Old Hotel, Modernized", "helpfulness": 1, "user": "FLAGSTAFFMAN", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142812532}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "There is ONE elevator so with 700 some odd rooms, you would think they would add another...the staff wasn't that friendly and beware of the $25 resort charge aka internet is NOT really free. If you are in your 20s & 30s I definitely suggest staying in the gaslamp quarter and only visiting Coronado for the day because it's an older crowd and a ghost town at 9pm. Food is also better and more to offer in the gaslamp as well....the rooms are SUPER small too - not a fan for all the hype.", "title": "Worth it for a day and scenery...not the money...", "user": "TGaglione", "date": "October 14, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 142780225}, {"rating": 5.0, "title": "Wonderful Christmas at the Del", "text": "We had a wonderful time at the Del. This hotel holds a dear place in my heart. We had a lovely Christmas Eve dinner in the Sheerwater and then did some shopping at the wonderful shops at the Del. We then got back to our room in time for Elves to come and tuck in our little boy and they even brought him a stocking full of goodies. The whole stay was wonderful and I would recommend this hotel again and again!", "user": "NinnyD", "date": "January 8, 2010", "id": 52947110}, {"rating": 5.0, "title": "Incredibly Accommodating", "text": "Our family stayed at the Del this year over Christmas for the first time and had a wonderful vacation. We stayed 5 nights. Our room was upgraded for a nominal fee. The room and the hotel were beautiful, clean and charming. We had an experience with the hotel's legendary customer service when there was a misunderstanding over our Christmas dinner bill, which the staff resolved immediately, much to our satisfaction, no questions asked.", "user": "12300", "date": "January 8, 2010", "id": 52943716}, {"rating": 3.0, "title": "Not really that impressive", "text": "OK, so its worth a visit, but I wouldn't stay here or spend too much time. The area has much more impressive attractions. We had lunch at their restaurant Sheerwater and visited the facilities. It was so dark inside the hotel... and the staff were a bit snotty when we asked for directions. The restaurant staff were nice and fairly efficient, but not noteworthy. Food was average and very expensive. They were kind enough to validate so we didn't have to pay the $35 to park there.", "helpfulness": 1, "user": "whiteheather99", "date": "January 7, 2010", "id": 52862693}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The beach and beach walk was GORGEOUS. That made the visit worthwhile. Also- if I were to do it again I'd eat at the outdoor bar/cafe rather than the resto. Its closer to the water and more reasonably priced.", "title": "Not a good value", "helpfulness": 2, "user": "Traderfran2001", "date": "January 6, 2010", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 52775016}, {"rating": 5.0, "title": "Delightful!", "text": "I felt that overall there was a huge disconnect between what you are paying and what you are getting. Some examples of ridiculous pricing. $30 at the bar for a glass of so-so cabernet and a small Baileys. $55 for a buffet breakfast for 2 consisting of warmed over food. $400 per night for a hotel room that slopes toward the ocean. This hotel has high end pricing without the high end service. While there are some areas set aside exclusively for guests, in general the hotel is completely overrun with day trippers. The lobby is busier than Grand Central Station and there are long lines for absolutely everything. As one slightly tipsy British tourist commented \" this place is like Disneyland on a bad day\". Demand creates pricing and since this place is a National Monument there will always be plenty of demand but the experience is really not worth the price.", "user": "alydeaz", "date": "January 5, 2010", "id": 52702842}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "SO MUCH HISTORY IN HERE!", "title": "This is an HISTORIC HOTEL OF AMERICA.", "user": "RealBusinessReview", "date": "October 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143522498}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I have enjoyed so much the fact this historic hotel of America is keeping up with great Sunday brunch as well as Saturdays events like arts or performing artists.", "title": "Great experience!", "user": "Fred N", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143452924}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "There is an atmosphere here like at the Chateau Marmont, history and despite the hundreds years Hotel Del is still elegant, classy, in two words I still there !", "title": "visited the hotel and ate on the patio...highs and lows", "user": "lkrocks", "date": "October 22, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0}, "id": 143407982}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The only thing tha I did not like of my stay was the fact that there are too much tourists allowed to walk around the structure, I did a personal trial and entered from main lobby and get access to pool area without any control or requirement of having a card or a badge.", "title": "A Real Iconic Five Star!", "user": "grovebr", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143404709}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Enjoy the patio outside the main floor rooms and dream to be anywhere you like because at Hotel Del you feel you are in a movie !", "title": "Perfection...", "user": "JesseM625", "date": "October 19, 2012", "detail_rating": {"value": 3.0, "location": 4.0, "service": 3.0}, "id": 143187616}, {"rating": 5.0, "title": "Why 19 years?", "text": "Why would a family return to the same hotel multiple times a year for 19 years? A stunningly beautiful building? The best beach on the West Coast? Great choice of activities and restaurants in the area? All are true, but the real reason we go back to the Del is the staff. From the front desk, to the bellmen, to the concierge, to the restaurant staff, to housekeeping, everyone treats us like family. If you want stuffy, stiff, bow down to you service, go elsewhere. We've tried them all in San Diego, very nice hotels, famous names. At those other hotels Mom would always say, \"It's nice, but not it's not the Del.\"", "user": "lvdel", "date": "January 20, 2010", "id": 53945472}, {"rating": 5.0, "title": "Lovely setting and a proud tradition", "text": "Beautiful beach, mild climate, distinctive architecture, excellent food, and a sense of pride among the service staff, manyt of whom have been with the hotel for years, evoke a Continental flavor that is becoming increasingly rare in this country.", "user": "ex-bugonaut", "date": "January 14, 2010", "id": 53494823}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I've been to this hotel several times in the past and recommend it to anyone looking for a fabulous setting!", "title": "One of the Best Hotels in the World", "user": "ToddR", "date": "January 12, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53284104}, {"rating": 5.0, "title": "Beautiful New Year at The Del", "text": "What a wonderful way to spend the new year and our daughter's 17th birthday. Service was impeccable, food was fabulous, and the room was spectacular!", "user": "beachcop1", "date": "January 12, 2010", "id": 53272682}, {"rating": 5.0, "title": "Memory of a Lifetime", "text": "We spent 4 days at The Del during Christmas 2009. It is a perfect place anytime of year but Christmas is a wonderful time to go. The Christmas tree in the lobby is unbelievable. The hotel, itself, is outlined in lights. The ice-skating rink between the hotel and the ocean is so much fun. We splurged and stayed in a full view ocean view room but we've also stayed in a regular room and it was just as much fun. We love history and everywhere you look, there's something interesting to read/see about this historical, amazing hotel. Walking the beach each morning, eating breakfast at the Sheerwater......oh, how I wish I was there now! Can't wait to go back again next Christmas!", "user": "TX83", "date": "January 9, 2010", "id": 53008758}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "After reading so many \"not so great\" reviews, I was ambivalent about staying here. I'm so glad that I did. We had an incredible time and the hotel and location couldn't be nicer.", "title": "Glad I didn't listen to some of these reviews", "helpfulness": 3, "user": "murrayjjmk", "date": "January 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6565090, "likes": {"liked": "— the hotel itself - historic", "disliked": "— the crowded common areas - tourists"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I agree that the $22 fee for activities per day is steep. They should just include it in the price of the room but at least if you know about it ahead of time, you are not surprised. I have stayed in hotels before though where the cost of entering the fitness center is upwards of $20. Also, $20 for parking? Have any of you ever stayed in a hotel in NYC or Boston? You'll pay double that so I was not surprised by the price.", "title": "Loved it!", "user": "lovetotraveloften", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6541547, "likes": {"liked": "— Luxurious rooms, beach front, restaurant", "disliked": "— The special events staff never answered that extention; be sure to speak to the concierge to make plans for any activities on the hotel grounds."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The only thing that I would agree was outrageous was the price of the drinks but they didn't seem to mind that we brought in our own.", "title": "Coronado okay", "helpfulness": 3, "user": "Kimberley-Maree", "date": "January 2, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 6538999, "likes": {"liked": "— The beds were very comfortable", "disliked": "— stay in the victorian section"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Our room was 4103 and I don't think there was a more perfect location for our family of two teenagers. We walked out one door and were right on the walkway to the beach. Another door led out to the pool area...perfect. The room was large and very comfortable. I don't think that staying in the newer building would have been for me. I like the charm of the original building.", "title": "Great hotel...a must stay", "helpfulness": 2, "user": "pickynewyorker", "date": "December 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6452509}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We ate at Tomaso's on Orange ave which was excellent. We also got a family size ceasar and pizza at village pizza that cost $20 for all of us...a real deal. Good pizza.", "title": "Fabulous resort, room and view!", "helpfulness": 6, "user": "SunshineLL", "date": "December 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6446953, "likes": {"liked": "— the location", "disliked": "— cost"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We had a great 3-night stay at Del Coronado. It was helped by booking a '3 nights for the price of two' offer - otherwise would have seemed very expensive! After booking a standard room (direct with the hotel on internet) we were offered the possibility of upgrade to 'partial ocean view' if available at check-in for $25 extra per night. We took this, and were 'accepted' for it at check-in. A great surprise - the room (3508) turned out to be unique, off a main corridor, up a narrow flight of stairs to the top of a little turret right next to the main ballroom roof-cone! It was delightful (one of the staff referred to it as 'the honeymoon suite' - which it isn't really) - a 12-sided room, not very big but adequate, windows on 8 sides with good views, small bathroom, small regular-double size bed. Very quiet and private. No private balcony, but a nice public one (little used by anyone except us to toast the sunset each evening) a little way along 'downstairs' on the 5th floor.", "title": "A unique experience", "helpfulness": 1, "user": "salmoneater", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56155526}, {"rating": 5.0, "title": "Surpassed expectations", "text": "Most dining/drinking at the hotel seems expensive (to us Brits) and low-quality: plastic 'glasses' on the sun deck (why?) and bland food in the Sheerwater. The gas 'fire-pits' are pretty but give no heat, and do you really need all those patio heaters blasting away? (Sunny 70+ day temperatures, even though mid-February. Put a jumper on!)", "user": "devanm", "date": "February 16, 2010", "id": 56119486}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Coronado village is a short walk away, with lots of shops, cafes, restaurants. Forget San Diego.", "title": "If you can afford to splash out, treat yourself to this hotel.", "user": "fiwat123", "date": "February 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 55905468}, {"rating": 5.0, "title": "Hotel Coronado", "text": "My Mother, two sisters and I spent 3 nights at this hotel. We were greeted by the attendant and ushered to the front desk to check in and then, taken to our room. We were treated as if we were the only guests in the hotel. Although the room had a musty smell, it was clean and very charming. We always had enough towels, toiletries and coffee in the morning. The elevator operators always remembered our floor and had most interesting stories about the Del.The property is handicap friendly and all staff went out of their way to accommodate us. Check out went just as smooth and were taken to the airport by the Hotel Shuttle for the price of a cab ride. Dining there is expensive, but there are plenty of restaurants within walking distance. It was truly a wonderful experience and we will go back again.", "user": "ChiaraGorni", "date": "February 13, 2010", "id": 55897011}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "This gracious old lady is well worth the visit. If you can afford to treat yourself - even for a couple of nights - you won't be disappointed. We had a fabulous 4 days with our children - aged 11 & 13 and we all loved it. I wouldn't bother paying extra for a beach front room, the garden view rooms are equally lovely and less noisy as you are not overlooking activities/restaurants etc. Although, my only criticism with the room was that it was near some major air conditioning unit (or something) so it got quite noisy at times. Check re the rooms before you book in and I am sure you will avoid this minor pitfall.", "title": "Great Experience", "user": "napavisitor", "date": "February 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55570245}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Stayed in Ocean Towers. I like how it is away from the traffic of the main area and newer.", "title": "Allright.", "helpfulness": 1, "user": "herndon66", "date": "November 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 144377288}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "There are a lot of eating areas here which are well utilized by the enormous guest number. Tables at patios, on the dock, the restaurants and random areas. I've logged this resort as the sit down and eat place. Then move to another table and do the same thing. Here's the catch: Pricing. I am amazed at an average glass of beer being $8.00, and a simple cheeseburger is $15.00. A guy next to me asked for two lemonades and dropped $15.00. Of course I drank and ate what I wanted because it's vacation and I think the Del folks know that about everyone.", "title": "Vintage America", "user": "Heather L", "date": "November 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144307514}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Strong points are: Sprawled for long walks, clean, great shops, good food, and charm.", "title": "Resting on History", "helpfulness": 1, "user": "tictac24", "date": "October 31, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 144166125}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Weak: Pool, prices, and dated.", "title": "Thank you Mr. John Fulk! He provided the best expierence here at the Del!", "user": "Penguin8569", "date": "October 31, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144165906}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "Highlight: Drinking and watching a late night Navy training on the beach. Yaaaaaaaah.", "title": "The Hotel del Coronado is good for a day trip, too.", "user": "FoodieSanDiego_CA", "date": "October 30, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 144046318}, {"rating": 5.0, "title": "A Perfect Visit!", "text": "We stayed at the del Coronado on a chilly, rainy winter day, and it was magical! The beach is expansive and beautiful. The staff is impeccable. The historical significance of the hotel is charming, and yet the hotel is tastefully updated. The dinner we had at the 1500 restaurant was amazing - each course was perfect, the pasta al dente, the meat tender and sauces delectable, and the wine list is super. If you are in San Diego, at least once in your lifetime!, don't miss a stay at the del Coronado. You won't want to leave!", "user": "AmberViennaVA", "date": "February 3, 2010", "id": 55087668}, {"rating": 5.0, "title": "We couldn't have had a better anniversary weekend", "text": "Since the first time I visited \"The Del\", I wanted to someday stay at this fabulous resort. When my wife asked me to pick a destination for our 30th anniversary, it took me all of one second to grab my computer and start things in action. From my first phone call to the del, everyone was incredibly helpful. All of the arrangements were incredible and the amenities and staff were second to none. When we arrived, we were informed the hotel upgraded us to a suite, there was complimentary wine in our room, and 1500 Ocean made our dining experience very special. The Sunday brunch was fabulous and Florence, our waitress, was very nice. The spa day we had was to \"die for\" and we hardly left the resort the entire weekend. We are back in Chicago still raving to friends and relatives about our special weekend. I hope we can make this a yearly event. If you can get to \"The Del\", do it, you won't regret it!", "helpfulness": 1, "user": "MVHSOCCER", "date": "January 27, 2010", "id": 54500989}, {"rating": 5.0, "title": "Best Hotel so far...............", "text": "With out a doubt the finest hotel that we have ever had the pleasure to visit....Was all that everyone had said and more........The staff is always there to help you in anyway possible.. We would not hesitate to stay there again or suggest it to any of our friends...", "user": "wfsnowbird", "date": "January 25, 2010", "id": 54365248}, {"rating": 5.0, "title": "Old Elegance stiil exists", "text": "We Celebrated our 44th Wedding Anniversary on January 16, 2010.", "user": "danishScottsdale_AZ_", "date": "January 21, 2010", "id": 54064893}, {"rating": 5.0, "title": "Legendary", "text": "The accomodation, Superb Service and attention given was truly equal to", "user": "hectormvegas", "date": "January 21, 2010", "id": 54051577}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "What more is there to say about the Del? Its all been said before. Simply, this is the most fabulous hotel in the whole of the USA. The service is the best, the rooms are magical, the meals are superb, the whole thing is just a wonderful experience. For us, the most romantic thing which we did, was to take a small picnic, plus a bottle of wine, onto the beach so that we could sit and watch the sun setting over Point Loma. As Joe E. Brown says in \" Some like it hot\", Wowee!!", "title": "Fabulous", "helpfulness": 1, "user": "Michael C", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143917372}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Our only small complaint was that a convention was taking place in the hotel whilst we were there and everybody was walking around with grear big silly labels around there necks announcing who they were. Is this necessary, can't they speak for themselves or are they all still at kindergarten level?", "title": "Our favorite hotel in our favorite place!", "user": "CoronadoBound", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143759627}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The Hotel del Coronado is an absolutely beautiful property in an amazing place! The historic building is fantastic, it really feels like you're stepping back in time. The staff and service has always been top notch! Grab a coffee and walk the beach in the morning, you will see dolphins and occasionally seals right off shore! The sand is fantastic with its gold mica reflecting in the sunlight. Even though the temperatures are cool, the sun is very powerful. The military presence adds to the experience. You will enjoy an air and sea show every day. The thunder of F-18's coming in for a landing at the beach is unforgettable. There is no wonder it's the best beach in the U.S. The village of Coronado is a great place to explore. We have enjoyed staying at the del for years. We look forward to seeing the del at Christmas this year.", "title": "Happy Anniversary", "user": "Daniel B", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143730205}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I am a native of San Diego. but never stayed at the Del Coronado. I have been aware of it's reputation for most of my life. I took my wife here for our first anniversary. She was extremely happy. The service and accommodations were superb.", "title": "In San Diego the only place to stay", "user": "Retiredhotelier34391", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143712228}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Only complaints concern the price. When I booked my reservation, I agreed to the upgrade, if available, for a maximum of $85. I was charged $125, and for that I expected to be staying in the original hotel.", "title": "Some Like it; Hot & Fabulous", "user": "Skippy025", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143650628}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I stayed at the Del for 2 nights for a conference and was really happy that my company was picking up the tab. That being said, it's a lovely relaxing hotel with excellent food. The breakfast buffet ($25 with tip) offered everything except lox which I think for that price should have been available. The second day I inquired about the continental and that was more reasonably priced at $15 (with tip). Dinners and lunches were also delicious. The toiletries were generous and linens, etc. of superior quality.", "title": "Great if money is not a problem...", "user": "rtpana", "date": "January 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6634235, "likes": {"liked": "— The Victorian ambiance", "disliked": "— Price"}}, {"rating": 2.0, "title": "Disapointed. What happened to the famouse Hotel Del? I was a fan.", "text": "The best part about the Del is that it is within walking distance of many restaurants and activities while keeping the Victorian feeling very much alive when you walk through it's doors.", "helpfulness": 4, "user": "desiree_mischkind", "date": "January 20, 2007", "id": 6629436}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "THE ROOM:", "title": "The Del was once great", "helpfulness": 4, "user": "coastalgirl86", "date": "January 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6628214, "likes": {"liked": "— i loved our room", "disliked": "— crowded"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I have visited the hotel several times over the years, and it just seems to be getting less interested in pleasing it guests. On my last stay the bed was made nicely, and room look pristine but when the covers were pulled back it was apparent that the bed sheets were dirty and just strightened b ack up instead of changed for new ones. How disgusting is that to have leftover sheets some else has used?", "title": "Be Prepared", "helpfulness": 1, "user": "traveled-7", "date": "January 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6596966, "likes": {"liked": "— Location", "disliked": "— over priced"}}, {"rating": 4.0, "title": "Great breakfast, worth the extra money", "text": "THE SERVICE:", "user": "blondebavarian", "date": "January 11, 2007", "id": 6576672}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "This is a beautiful hotel - and is something to see while you are in the area - but the service leaves a great deal to be desired. The hotel staff are not \"polished\" and could care less if you have to wait for things. Be prepared to wait for check-in, beverages and any sort of service at all.", "title": "Over-rated", "helpfulness": 2, "user": "TX1", "date": "February 23, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 6832117, "likes": {"liked": "— the history of the hotel", "disliked": "— the staff"}}, {"rating": 4.0, "title": "Waking up to the sounds of the beach", "text": "The history of the hotel is charming with great photo opportunities, but the same could be accomplished without actually staying at the facility.", "helpfulness": 4, "user": "Michigan_Traveller72", "date": "February 16, 2007", "id": 6803414}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "One thing that was very nice is the gift shop down stairs - had an inventory of unique gift items.", "title": "Loved The Del!", "helpfulness": 2, "user": "deltastew", "date": "February 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6802655, "likes": {"liked": "— Historic hotel and being right on the beach", "disliked": "— Nothing! I loved it!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My partner was staying at the Del for a work conference, so I joined him for a few days. We got a large corner room in the Oceanview Towers. While most people on here refer to it as the Motel 6 annex, it was actually beautiful inside. The rooms were well decorated and fit the feeling of the beach. My favourite memory of the trip was falling asleep and waking up to the sound of the waves crashing on the beach just yards outside of our room. Coming from Michigan where the temps were 25 below zero, I was thrilled to be able to sleep with the balcony door open!", "title": "Very Swank ,Very Fun...", "helpfulness": 6, "user": "RITravelBug", "date": "January 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6717143}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Food on site was pricy, but when you're eating on an open terrace in February, you're willing to pay $8 for a hamburger. You're not just paying for the food, you're paying for the location. We found the staff to be friendly and helpful. The concièrges are invaluable. Make good use of them, that's what they're there for. They recommended some great restaurants and activities. If I were paying for the trip myself, would I stay there again? Probably not. It's an amazing experience, but beyond what I'd feel comfortable paying.", "title": "Old World Charm", "helpfulness": 2, "user": "LiGe", "date": "January 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 6634583, "likes": {"liked": "— The View.", "disliked": "— Paper thin walls."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "If you have money to splurge and are thinking about visiting San Diego, check out the Hotel Del Coronado. About 20 minutes (depending on traffic) from the San Diego airport this San Diego charm is located not far from the city but it feels like you on your own island. Rooms are nice and spacious rather in the Ocean Tower or in the main building. The restaurants and shops on site are good but rather pricy in some cases. Come experience the magical Hotel Del Coronado for yourself.", "title": "An San Diego Charm", "user": "evvtraveler", "date": "March 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7156514, "likes": {"liked": "— its location", "disliked": "— hotel costs"}}, {"rating": 2.0, "title": "Great to look at; Don't stay.", "text": "My partner and I were looking forward to a quiet, luxurious weekend in San Diego. I tried to get a discounted room at the Del but apparently, they were all booked. So I called. I opted for an ocean view ($490!) because I pictured luxury with waves and surf. What we got instead was a small room with an admittedly ocean view, not worth $500. What we didn't pay for was the dance band that played until 1:30 in the morning 2 floors below us. The sound, especially the base speakers, reverberated in our room for hours. Apparently, old wooden hotels carry sound quite well.", "helpfulness": 2, "user": "sheilaStudioCityCa", "date": "March 12, 2007", "id": 7111834}, {"rating": 4.0, "title": "The Lovely Del", "text": "We called the desk three times and each time we were told that they would go and tell the band to lower their speakers. But it never happened. In the morning, we were both exhausted. We called the front desk and told them we were checking out. We got a little resistance but eventually, they said ok.", "user": "jbgs", "date": "March 6, 2007", "id": 6925314}, {"rating": 5.0, "title": "Del-tastic", "text": "Clearly, this is a conference hotel. People ran up and down the stairs and in the halls. I'm not sure what I expected, but this wasn't it.", "helpfulness": 4, "user": "Soontobegone", "date": "February 23, 2007", "id": 6833583}, {"rating": 3.0, "title": "Great ambiance; not-so-great value", "text": "My advice is, be sure to ask if there are any dances going on in the ballroom before you make a reservation. Frankly, you can get a nicer room in a hotel built for quiet by trying the Omni.", "user": "waynemcc", "date": "February 23, 2007", "id": 6833551}], "location": {"country": "United States", "city": "Coronado"}, "stars": 4, "variance": {"poor": 212, "average": 313, "very good": 581, "terrible": 163, "excellent": 1002}, "aka": "Resort Del Coronado", "slim_ranking": 0.526315789474, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "The legendary Hotel del Coronado is located on 28 oceanfront acres on Coronado Island. Built in 1888 and designated a National Historic Landmark in 1977, The Del continues to maintain its rich history while also offering contemporary conveniences such as unique beachfront dining, an award-winning spa, upscale shopping, recreational activities and the luxurious cottages and villas at Beach Village. The hotel's spectacular setting, impeccable service and award-winning cuisine also makes it the perfect setting for a fairytale wedding."}