{"user_rating": 4.0, "review_count": 734, "name": "Hotel Adriano", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This is our 2nd stay at the Adriano - we first stayed 5 years ago before the hotel was refurbished. It's a great location for seeing everything you need to see in this beautiful city. Rooms are clean and comfortable although we did find ours a little on the warm/stuffy side at night. Huge choice of fabulous places to eat really close by. Try La Campana - a really traditional restaurant serving top quality food and frequented by locals. The hotel can book for you as it does get busy.", "title": "Good hotel in a great location", "user": "PJSSomerset_England", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 89439106}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "amazing location, great rooms and wonderful lobby. Love the art and layout of hotel", "title": "greatest boutique hotel in Rome", "user": "angnowacin", "date": "December 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89437957}, {"rating": 3.0, "stay_parameters": "Stayed December 2010", "text": "In the very heart of the Centro Storico the hotel's location is exceptional. The rooms are OK and things generally work but there is no real life in the hotel. Breakfast is OK but staff hard to find. Reception team never moves from behind the desk and while they will do things did you, you are never sure if is almost too much effort. A good central position and great if you know Rome, or are ready to get out and discover the best city on the planet. Nearby you find everything, the best coffee, pizza, pasta, wine and tourist must-do's .... So it depends what you want really. At the price and given location and the upgraded rooms etc, I would still likely stay again!", "title": "Location cannot be beaten, but otherwise only average, no real service or life to the hotel and staff", "helpfulness": 2, "user": "BiancoBlack", "date": "December 6, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 89137744}, {"rating": 3.0, "stay_parameters": "Stayed November 2010", "text": "Stayed for 4 nights and had booked the hotel based on it's location being very central and close to the pantheon and piazza navona. The location was great and we were able to walk everywhere. We stayed in the boutique wing but the room was quite small although nicely decorated. However during our stay the whole hotel lobby was overtaken by a festive fair that meant we could not use the bar or lounge area and the only available wifi point. This was not advised at time of booking. Also the hotel staff were not friendly and not particularly helpful either.", "title": "Location, location, location", "helpfulness": 1, "user": "JohnP72", "date": "December 5, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 89094836}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I had booked this hotel using mileage points for a three-night stay in November. It proved to be in a good location, i.e. a small side street very near Piazza Spagna (subway), Trevi Fountain, and the Pantheon. There is a good bus connection at the hub at Piazza San Silvestre about a 5-minute walk from the hotel.", "title": "Solid hotel in good location", "user": "wolfhomma", "date": "December 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 89064573}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I was again in this gem hotel in the heart of Rome and this time I had a beautiful room with a terrace.", "title": "always a great stay", "helpfulness": 1, "user": "costantina", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158196982}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The room is spacious and the bathroom is very modern and with all the conforts.", "title": "Enjoyed our stay", "helpfulness": 1, "user": "Barb4579", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157938831}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "They have added a common breakfast table that gives guests the chance to get together and a small gym with Technogym machinaries.", "title": "Perfect Location", "user": "723MikeF", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157537065}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "it's always a great stay, staff is super nice and always willing to help.", "title": "Very nice for business", "user": "taarhaug", "date": "April 12, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 157477459}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We have just returned after spending 5 nights at the Hotel Adriano and we had a great time. The location of the hotel is hard to beat. Two minutes from the Pantheon and within easy walking distance of most of the other sights, we walked everywhere. We had two classic rooms and they were clean and comfortable with good sized bathrooms. My daughter and myself had a room at the front of the hotel on the third floor, there was some street noise at night but it didn't worry us and we slept well. My friend was in room 312 which overlooked an inner courtyard and was very quiet, so it is worth asking if you prefer a quieter room. The public areas of the hotel are attractive with several sitting areas and a bar. The breakfast was really good, cereals,fruit, yogurt, bacon,ham and eggs as well as bread and pastries. Just what you need to set you up for a days walking round Rome. We also found the staff very friendly and helpful, booking taxis and recommending a very good restaurant on the evening that we arrived. We hope to return to Rome and will certainly stay at the Adriano again when we do.", "title": "Very Clean/Modern/Spacious", "helpfulness": 2, "user": "naur1008", "date": "April 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157302588}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We have now stayed twice at Hotel Adriano and will stay again. It’s nicely situated just off the Via Della Scrofa in the middle of what would be a triangle formed by the Mausoleum of Augustus, the Piazza Novona and the Pantheon. Like the Grand Hotel Minerva in Florence, it’s something of a business hotel with a bit of design flair. The public rooms are very design conscious with lots of low, cushiony seating and art objects here and there. The two breakfast rooms are nicely furnished with those kind of chairs they dress in cream denim pinafores for banquets. The included breakfast itself is tasty and has a nice variety of selections. Rooms are spare and design oriented having been recently refurbished. Reviews say that the front desk is inadequately staffed and I would have to agree but if you can get over that, the place is a good deal in the middle of Rome.", "title": "Great Rome location, very nice hotel", "user": "FloridaTravelmum", "date": "December 22, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 90469629}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We loved Hotel Adriano. The location of this hotel is the best, we walked EVERYWHERE in Rome. We stayed in a Double Deluxe room and it was definitely worth the upgrade. Our bed was clean and cozy, the bathroom was completely updated and large. The entire room was huge! We were in Italy for two weeks with two huge suitcases that didn't fit in our Florence Hotel. We had plenty of room at Hotel Adriano. The room was quiet (although not quiet enough to sleep with the windows open, but I\"m not sure if such a place exists in Rome). A full breakfast is available each day and is a good way to start the day. It's not going to be the best meal you have in Italy but it's enough to get you going until lunch. There are two negatives. One, the front desk staff is very unfriendly and not very willing to help. Two, there is wireless internet available but you must pay 10 euro a night to use it in your room. If you have a laptop you can pay 5 euro a night and use it in the lobby area. There is one computer for public use but it's slow and not ideal to use. I would absolutely stay here again and recommend it to anyone going to Rome.", "title": "Stayed here for our honeymoon and would definitely return", "helpfulness": 1, "user": "Elysialc", "date": "December 21, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90407519}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "This hotel is so convenient to all the marvelous sights of central Rome. We could walk everywhere from the Vatican to the Colosseum, and beyond. We enjoyed the evenings in the lobby with a glass of wine. The rooms were small but well equipped. Breakfast each day was excellent with a variety of items served buffet style. I would return here on my next visit to Rome.", "title": "Great location!", "user": "stressfreegolfer", "date": "December 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90171392}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "You can't beat the location and the friendly and helpful staff only adding to the comfort.", "title": "Small, intimate and friendly", "user": "Zotojo", "date": "December 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 90087894}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Even though we are sure that the hotel is placed in a hidden street (like in Harry Potter) it is the perfect place to live if you want to be able to take a evening stroll around Piazza Novona or see the Pantehon at night. The room was nice and clean and breakfast was good. The staff was helpful and the only thing bad to say, is that their internet connection was a bit unstable in your room. But all in all a very good stay at hotel Adriano.", "title": "The perfekt placing if you want to live in the middel of Rome", "user": "Kubstrup", "date": "December 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 89564713}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The hotel is ideally situated for all the main attractions in Rome and we walked everywhere. Despite being right in the centre of Rome it was not particularly noisy apart from the odd car horn in the early morning rush to work.", "title": "Gem of a hotel", "user": "Kevster5664", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 85571573}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The room was quite spacious (for 2 adults and a child of 7) for Rome with a larger than average bathroom (including a jacuzzi bath). The room was refreshed daily with new towels and toiletries.", "title": "Would def stay here again!!!", "user": "mlee05", "date": "October 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84920353}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "All requests we made to the hotel staff were dealt with quickly .", "title": "Lovely hotel but a shame about room service and rude staff.", "helpfulness": 3, "user": "roxyone", "date": "October 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84545191}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The included breakfast was plentiful and delicious. Yes you timed it wrong you may have to wait for a table but no more than a few minutes. But is that not true of most hotels.", "title": "Great Location, No Major Complaints", "user": "jojoinsf", "date": "October 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84118410}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "When I next plan a trip to Rome I would cetainly stay here again as it gets top marks for location, service and friendliness. A charming hotel.", "title": "Great location,Great rooms,Great hotel", "user": "Amandawicklow", "date": "October 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 83101948}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This is our 4th time to Rome and this has been the best hotel we've stayed in. When we arrived we had been allocated a room in the annexe. This is a bit of a pain as it is up the street in an apartment block and occupies the 5th floor. There are 4 keys, some stairs and a tiny elevator to negotiate before you get to your room. The room itself was okay, it had a small balcony with a view over Rome's rooftops.", "title": "Location, Location, Location", "user": "baggo55", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 161399805}, {"rating": 3.0, "title": "Good Time but there's meaning in the \"No\" in Hotel Adria\"no\"", "text": "Breakfast exceeded what I'd expected. There was lots of choice and the excellent staff kept everything topped up. You can even ask for a cappuccino with your breakfast.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "May 16, 2013", "id": 160851906}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The best thing about this hotel (and the reason I'd go back) is it's location. We didn't need to use public transport at all during our stay. Parthenon & Piazza Navona are 5 - 10 minutes slow stroll. Vatican is about 25 -30 minutes and much the same for the Colosseum.", "title": "Good room after a disappointing start", "user": "JoboBalde", "date": "May 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160430110}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "If you want a good cheap meal try Taverna Parione on a street of the same name, it's just off Piazza Navona.", "title": "Awesome Hotel and Location in Rome", "helpfulness": 1, "user": "xympx", "date": "April 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159256181}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "First trip to Rome and I liked where I stayed. Great location within walking distance to great sites: Piazza Navona, Pantheon, Spanish Steps, Vatican, etc. Didn't come close to seeing it all. It was great to be able to walk out the hotel door and not worry about anything because it was a great neighborhood.", "title": "Our second visit to Hotel Adriano", "user": "Kari P", "date": "April 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158764141}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The hotel is in a fantastic location, walking distance to majority of sights and shops, had to get a cab to the Vatican but was only 7 euros. We arrived and were given a pretty poor room which had a crack in the shower base and a handle on cupboard missing, wiring was taped together and pretty dusty with a stain on the bed cover. We complained and were given a better room, it was probably one of the older rooms as they are refurbing the building. The new room we got was very good and breakfast in the hotel was ok but we only had it once as we preferred to get in the fresh air and try the local places. Really a great city to visit and seemed very safe.", "title": "Great location, rooms could be better", "user": "hsdhillon", "date": "November 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 87972880}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hotel was nicer than in the pictures. We have satyed in the deluxe room with terrace and it was very pleasent.", "title": "One of the best locations", "user": "pjoana", "date": "November 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87233762}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "People at the front desk are very nice and the hotel is located in one of the bests places. 5 minutes walking from piazza navona and pantheon and 10 minutes to piazza di spagna.", "title": "Best new find in Rome", "helpfulness": 1, "user": "pfra", "date": "November 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 86520784}, {"rating": 2.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The only bad thing is the \"luxury\" car that picked us up at the airport, supposed to be a BMW or Mercedes or Audi but it was an Opel.", "title": "Great location, appalling standards of service", "helpfulness": 7, "user": "ConradDC", "date": "November 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 86069321}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We have traveled to Rome many times and stayed at different more expensive hotels. Took a chance on this new hotel for an 8 night vacation. We were nervous but now so very pleased we made the change. Hotels location was absolutely fantastic Staff could not have been more pleasant and helpful Breakfast was very good and again staff went out of their way to assist us. Room was very clean not huge but more than adequate Bathroom really big. There was some early morning local noise but after 8am and not offensive. When we mentioned it to staff they een wanted to change our room. FREE INTERNET was an added find. Can not rave enough about this place.", "title": "Perfect Hotel, made for a fantastic holiday in Rome", "user": "KHW_46", "date": "November 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85982361}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We lived on classic room No. 104, held fine clean and there was change towels every day. Large bathroom, quite happy with it, but the noise from the street outside, kept me awake the first 2 nights until I got hold of a pair of earplugs. The room is a bit dark but cozy! there was television, but only Italian channels and CCN, if you wanted to watch movies or listen to music, it costs a lot. There was a bar on the ground floor, but everything was very expensive and was not particularly cozy.", "title": "Good location, but very noisy", "helpfulness": 1, "user": "Anne L", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 156993064}, {"rating": 5.0, "title": "Great hotel and great location", "text": "The breakfast was good with a varied selection. You can order Cappucino or Cafe latte, with the waitresses, which is far better than the ready-made.", "helpfulness": 5, "user": "Toniann B", "date": "April 3, 2013", "id": 156528892}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I just got back from a spring break vacation in Rome,Italy and hotel adriano was an excellent choice! The staff was very friendly and helpful. The hotels location was perfect, walking distance to all major tourist attractions. The breakfast was great and rooms were clean.", "title": "Smack in the middle of everything!", "helpfulness": 1, "user": "LaCatrinaLatina", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156479361}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed for a week and did not use any transportation during that time. Everything you want to see or do in Rome is only a short walk away. The hotel, an old palazzo (palace), is small and tastefully decorated and the staff friendly and helpful. I would definitely recommend this hotel to anyone who is going to Rome. Fresh fruit juice for breakfast is the only thing I can think of that I missed..........I don´t think the juice was fresh and if it was then I´m sorry, but it tasted way too sweet and canned. Go to \"Maccheroni\" Ristorante, close to the hotel, for lunch or dinner. And if you´re not that into Gucci & Prada go for cool clothes at \"Via del Babiuno 167\". Ciao.", "title": "Great location in Rome", "helpfulness": 1, "user": "susieqCal", "date": "March 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155855428}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We were in Rome in July and it was hot. It was always wonderful to return to this lovely hotel very centrally located. The staff was friendly and helpful. Our room was small but very nice. Daughter and husband and children had a \"kid\" friendly room.", "title": "Great Hotel and amazing location", "helpfulness": 1, "user": "emily s", "date": "March 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155400917}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "My friend and I stay here for 4 nights during my birthday. The staff was nice and the room we took was clean and proper- comfortable bed with new bathroom plus good luminosity. The location is wonderful, quiet but convenient. Breakfast was not bad with price we got. Lot of varieties.", "title": "Great location, chic decoration and modern facilities", "user": "Zu Y", "date": "June 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 163678847}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "What i like the most is the internet speed was perfect.", "title": "Perfect hotel in perfect location", "helpfulness": 1, "user": "MariaMazz", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163349601}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We (my husband, my 3 year old daughter and myself) stayed in Hotel Adriano on our recent vacation to Rome. This is a very nice hotel in the perfect location. It is centrally located within walking distance to the Vatican, Trevi Fountain, Piazza Navona and the Spanish Steps. The rooms are nicely decorated and clean. They were very modern and comfortable. The hotel itself is beautifully decorated. I would definitely stay here again, and recommend without hesitation.", "title": "Great location, friendly staff, very comfortable", "user": "Jennifer S", "date": "June 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 162944539}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "For the price and location it's excellent value. The breakfast was very good, the common areas nice and had some character, check-in/out was quick and pleasant, our room was small and rather basic. We couldn't access the WIFI in our room and the shower was strange - it was in our room, rather than in the bathroom. But the bed was comfortable and the location was so good that who wants to spend time in their room anyway? We walked to the Vatican, Spanish Steps, Piazza Navona, Colosseum, etc. There are several excellent restaurants nearby including Obika Mozzarella Bar which is just around the corner.", "title": "Superb Location and Breakfast", "user": "Billy E", "date": "May 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 162359989}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel is in a great location with respect to popular tourist sites, as well as many good restaurants, bars, and shopping areas. The lobby, bar, and common sitting areas were unusually modern for Rome - I would even say eclectic. The included breakfast was superb. The room was comfortable, though the particular room my wife and I had did not have any chairs for sitting - only a desk chair, also no closet, dresser, or wardrobe, and only a set of shelves and a rod of hangers on the side wall of the room. The bathroom was small with shower only. I realize these features depend on room type selected (we chose superior) but I have stayed at similarly priced hotels elsewhere in Rome and gotten more. The WiFi was acceptable - having a fixed userid and password for the entire stay, though not as easy as when there is no password required.", "title": "simply stunning!!", "user": "Lynn1963_13", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162277741}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 3, "variance": {"poor": 37, "average": 75, "very good": 345, "terrible": 9, "excellent": 268}, "aka": "Adriano Hotel Rome", "slim_ranking": 0.148264984227, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Housed in an elegant 17th century building in the historic centre of Rome, Hotel Adriano is very close to the Pantheon, Piazza Navona and the Spanish Steps. It’s just a few steps away from Parliament, the Trevi Fountain and from the most elegant shopping district.It’s the ideal location for anyone staying in the capital on business or pleasure. But it is more than that. It is also a meeting place and a reference point, not only for guests but for locals to promote their events and activities.Managed by the Ricci Family since its establishment more than 40 years ago, the hotel has recently been renovated. With its relaxing and cozy atmosphere, the rooms are a perfect blend of design, tradition and attention to detail, providing both refined elegance and a home away from home.Our guests can enjoy each and every part of our hotel. It’s starts at the reception area, with its large curved Welcome Desk which leads to the bar area and the winter garden. Not to mention the elegant and cozy bedrooms, the breakfast rooms, where rich buffets are served every morning and the well-equipped meeting rooms.Our discrete, professional and friendly staff are constantly working to make our guests feel at home."}