{"user_rating": 4.5, "review_count": 250, "name": "Hotel Sunny Villas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Sunny Villas is beautiful. We did not arrange for transportation, but when we arrived, a staffperson was waiting to carry our luggage to the hotel. It may have been kismet or we were just lucky, but this is a more spectacular feat than you can imagine!", "title": "Exquisite setting in central caldera", "helpfulness": 4, "user": "CTHeather", "date": "December 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6501695, "likes": {"liked": "— Beautiful views, excellent staff", "disliked": "— All the stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "Check in was smooth. Within minutes, we were at the hotel bar enjoying a beer and the gorgeous view of the caldera. We stayed in a standard room the first night and a superior suite subsequent nights. The rooms were both beautiful. Note, these \"cave\" rooms are not for the claustrophobic. Bathrooms are a little dank, but you are in the side of a mountain! The pool is small, but most we saw in Santorini were as well. The vistas from the pool make it all worthwhile.", "title": "Absolutely awesome !", "helpfulness": 3, "user": "Albs", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6180790, "likes": {"liked": "— The view and the service", "disliked": "— Everything was great. But I would not recommend the hotel to people with walking disability as the hotel has some steps (naturally because it's on the face of a cliff)."}}, {"rating": 5.0, "title": "Exceeded all expectations", "text": "Every morning we enjoyed breakfast on the veranda with the local cats. The food was delicious, especially the yogurt with honey. Andreas, the owner is a hard-working, helpful guy. He will tell you where to visit, he will arrange for a car, and he is just a charming nice guy looking to make it a perfect stay for guests. Albi, the bartender/waiter is also a pleasant, helpful person.", "helpfulness": 4, "user": "DragonTales", "date": "October 23, 2006", "id": 6001651}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Santorini is magical. I encourage you to rent a car - explore the beaches, the wineries, sunset at Oia, and the downtown Fira. Sunny Villas is not very close to downtown, but it was a beautiful walk during the day. Sunny Villas is an excellent choice for those looking to stay in a small hotel with exquisite caldera views.", "title": "Fantastic Place to stay. Customer service A+++", "helpfulness": 6, "user": "101travels", "date": "October 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5972518, "likes": {"liked": "— The amazing views of the cauldron.", "disliked": "— The stairs - but what can you expect from a hotel on the cliffs? : )"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "If you are travelling to Santorini, you have to stay at the Sunny villas. I went travelling with a very good friend of mine for six weeks, we stayed at Santorini for only three days but it was just unreal. The view from our balcony/terrace was awesome.... the hotel is right next to the cliff and all you can see when you look out is the ocean and the sky. You can see so far that it seems like the ocean is touching the sky at the end.... The sunset from the balcony is also breathtaking. I'm not really a sunset person but I must say that sunset was magic. We sat there for an hour and a half just looking at the sun goes down.", "title": "Great location, views, service", "helpfulness": 7, "user": "tenten", "date": "October 3, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 5903246, "likes": {"liked": "— views, location,rates", "disliked": "— You can arrange economical transportation from and to port, airport with Andreas through the e mail."}}], "location": {"country": "Greece", "continent": "Europe"}, "stars": 4, "variance": {"poor": 6, "average": 11, "very good": 52, "terrible": 7, "excellent": 174}, "aka": "Hotel Sunny", "slim_ranking": 0.6}