{"user_rating": 4.5, "review_count": 193, "name": "Hotel Lunata", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "The hotel was clean, economical, and in a good location although I will warn you of the noise and the HARD beds. We stayed in the Ophelia Room which faced the garden and the noise on the street was at times unbareable and the beds are harder than a rock. My back still aches!", "title": "Nothing Spectacular", "helpfulness": 6, "user": "srlaries", "date": "June 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5289339}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Our family of four stayed at Hotel Lunata the last two nights of our Mexican vacation. We had been on the road for the past 10 days visiting Tulum and Xcalak, so were looking for a place to wind down. The hotel is beautiful, and I saw at least eight people wandering through the lobby and trying to get information on the hotel -- the way it's decorated really draws people in. I wanted to do some last minute shopping so it was a perfect spot. My husband and I had dinner together at a fantastic Italian rooftop place (Ula Gua?!). The hotel also has a wonderful garden, and don't miss the rooftop, which looks over Ave. 5 and you can get a glimpse of the blue waters of the Caribbean Sea.", "title": "Outstanding hotel!", "helpfulness": 5, "user": "Unisys", "date": "April 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5008336}, {"rating": 5.0, "title": "It was superb!", "text": "I stayed at the Hotel Lunata in Playa del Carmen from March 25th, 2006 until April 1st, 2006. It was nirvana. It is a small boutique hotel with only 10 rooms. My room was on the top floor (climbing all those stairs took some getting used to) and faced the hotel's magnificent garden. When my friend and I arrived at the hotel we were warmly greeted by Monica. (She and Melissa were inspirations and great resources throughout our stay.) When we arrived in our room we were thrilled that it was exactly as had been described. The room is wonderfully appointed. I loved the beamed ceiling, the tiles, the stucco....", "helpfulness": 8, "user": "grandmajanie", "date": "April 11, 2006", "id": 4964319}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "The safe in the closet served well as a place to put valuables. The refrigerator was a good size and kept things cold (unlike so many other hotels in which I have stayed). The air-conditioning worked efficiently. The deck was a pleasant place to relax.", "title": "Wonderful Small Hotel!", "helpfulness": 7, "user": "vegtravel", "date": "March 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4742409}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "The bed was very comfortable. Since the hotel is located right on 5th Avenue it was interesting to sit near the garden in the courtyard and watch people just wander through the arch with great looks of surprise. It really feels like paradise when you enter from the hot, busy street. We did not eat the continental breakfast at the hotel, but a lovely protected area in the garden is designated for the guests to dine. I look forward to my return. It was superb.", "title": "The Good Life", "helpfulness": 5, "user": "Xcalacoco", "date": "March 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4591741}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We just came back from a stay at the Lunata. The people there, Melissa and Monica, were extemely nice and very helpful. The grounds are well kept and the rooms are very clean. We had friends that stayed at a much more expensive hotel and had such bad service they were sorry they didn't stay with us at the Lunata. In fact one couple did change from their hotel to the Lunata. The breakfast is a continental style breakfast with rolls, toast and/or cereal, two juices and coffee - plenty to get you started for the day and if you like a bigger breakfast the staff is always there to help you find a nice place. A free liter of water was supplied to us each day. We were there for a wedding and the staff would always make a point of asking how things were going and how the wedding was. The whole experience was a pleasure and I would definitely go back there again.", "title": "Beautiful setting friendly staff", "helpfulness": 3, "user": "Butcher.T", "date": "November 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6172209}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This is my third visit to PDC and my third year staying at Hotel Lunata. I just can't say enough about this place. The location is great, right on 5th and two blocks from the beach. The hotel and rooms are tastefully decorated and large enough to spread out a weeks worth of clothes and all our scuba gear and not feel cramped, the fridge in the room was also a plus. The real thing that keeps us coming back is the service. Lunata has the most helpful and friendly staff I've ever met. Even though we've only stayed there three times in three years, the staff remembers us and greets us with a smile each time we visit. Thanks again Fabiola, Melissa, and Monica!!", "title": "Can't Wait to Go Back!", "helpfulness": 6, "user": "ESAC", "date": "November 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6138980}, {"rating": 4.0, "title": "Lunata is great", "text": "As a side note, I highly recommend La Soiree on Calle 10, between 5th and ZFM for dinner. This was by far the best meal we have had the three years we've been in PDC. The prices are a little steep, but worth every penny (it also helped that they gave us a free drink with each entree and a free calamari appetizer). Service was excellent as well. There is a music stage, but no band played while we were there. Instead they used a projector to show music videos on the wall behind the stage. Great place!!", "helpfulness": 4, "user": "vicnric", "date": "November 11, 2006", "id": 6105005}, {"rating": 5.0, "title": "Truly a boutique hotel at its finest", "text": "This is our second time staying at the Hotel Lunata. We like it because it is located in the heart of Playa del Carmen but is very quiet. It is a short walk to restaurants, shops, the beach, an ATM and the bus station. It is a small hotel with 10 rooms that are very beautifully appointed. It is kept clean but we found on this trip that the room we stayed in before had some minor repairs that needed tending to. The hot water faucet didn't work and the door to the balcony didn't lock. The faucet was promptly fixed but the lock was looked at and not repaired in the week we were there, however a broom handle was given to us to wedge in the door. Security in this case would not have been an issue considering it was a third floor balcony. We also noticed that the linens have a lot of stains which we didn't notice the time before but other than that they are clean. The staff is excellent, helpful and friendly. They all speak English and have a lot of knowledge of the area. We have enjoyed our stay both times and would go back.", "helpfulness": 5, "user": "brunettegirl_7", "date": "September 26, 2006", "id": 5837409}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We discovered this hotel after we booked ourselves at another hotel. Instantly I fell in love with it and wanted to stay here instead...so we did and it was fabulous. The courtyard is cute and quant, the staff is helpful and friendly and the location is fabulous. I loved the little decorative details like the lights in the foyer and brick details. I didn't find the noise at all an issue even with a room facing the street...and for really light sleepers just bring a set of earplugs and you'll hear absolutely nothing. Fantastic hotel, I highly recommend it.", "title": "Bueno!", "helpfulness": 6, "user": "lf644", "date": "July 2, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5415968}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Some people would probably whine about :", "title": "What a Great place !", "helpfulness": 10, "user": "martyspaulding", "date": "March 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4581442}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "1) It's on a pedestrian-only street, so you have to carry your luggage a block or two to get there.", "title": "Great Value and Location", "helpfulness": 2, "user": "FairfieldDan", "date": "February 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4550060}, {"rating": 1.0, "stay_parameters": "Stayed February 2006", "text": "2) It's on the second, third and fourth floors, so you have to climb a lot of stairs. (No ... there isn't an elevator)", "title": "Below Average", "helpfulness": 8, "user": "_jd1973", "date": "February 23, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 4498870}, {"rating": 5.0, "title": "Playa Jewel", "text": "3) There are lots of restaurants and clubs nearby that are busy til 11pm or so.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "August 23, 2005", "id": 3801537}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "If these three things bother you, then please GO SOMEWHERE ELSE. The all-inclusive fat-lazy-tourist places with no character are just up the street. That way there will be a room next time I want to come back to Lunata!", "title": "Real mexican feeling", "helpfulness": 13, "user": "cibonet", "date": "August 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3751536}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "This was my husband's first trip out of the country and I wanted to make sure this was a good experience for him. When I travel, I want to know I am staying in another country, not waking up in a hotel that could be anywhere in the US. We decided on 6 nights PDC/Hotel Lunata and 3 nights splurging at the Hilton-Cancun in a villa. This was the perfect balance of experiences.", "title": "Que buenisima! What a great little hotel!", "helpfulness": 24, "user": "HarvestMoon", "date": "July 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3661907}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "The Lunata is the most gorgeous small hotel and a wonderful place to experience Mexico. Even my very american \"why-go-to-another-country\" husband loved it. You can't beat the location. Just step out of the door on to the pedestrian street of 5th Ave and everything is right there. The people in PDC are so welcoming and fun to be around. There are so many great restaurants on the Avenida that you will have a hard time trying to choose where to eat.", "title": "Best vacation ever!", "helpfulness": 11, "user": "1formerutahgirl", "date": "May 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3507940}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "The hotel, even though it is small, is lush and oozing with Mexican charm. The room's air conditioning held up great at all times even with 100% humidity almost every day. The employees were very helpful and we always felt safe. We slept in a king room on the street and only had a problem with noise on the first night (we were overly tired from travelling). It really wasn't bad enough to keep us up the other nights.", "title": "Wonderful", "helpfulness": 12, "user": "JohnnyFive5", "date": "April 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3415194}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "We thought the king room was worth it for the wet bar and extra space but everyone should be aware that the \"balcony\" is really just a strip with a rail that is big enough to squeeze one chair sideways. The rooms with true balconies facing the garden were nice but we enjoy people watching so we wanted a street side room.", "title": "Great Hotel", "helpfulness": 11, "user": "Travelerguy3", "date": "March 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3292375}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3, "variance": {"poor": 2, "average": 13, "very good": 55, "terrible": 3, "excellent": 120}, "aka": "Lunata Hotel Playa Del Carmen", "slim_ranking": 0.178571428571, "description": "Hotel Lunata is a charming hacienda-style hotel located on Fifth Avenue´s, the heart and soul of Playa Del Carmen, just steps away from the Mexican Caribbean’s pristine white sand beaches. Centrally located, Hotel Lunata is easy walking distance from everything Playa del Carmen has to offer, including beaches, international restaurants, upscale boutiques, unique artisan shops, Mayan ruins, and bars with live music that ranges from mariachis to reggae.The hotel is a special place reserved for guests that appreciate fine living. Architect Angel Islas has successfully blended traditional Mexican architecture with modern day comforts to create a hotel perfect for the discriminating traveler. The creative use of natural light, river stones, hand painted talavera tiles, and hardwood beams captures the traditional charm of Mexico."}