{"user_rating": 4.0, "review_count": 275, "name": "Hotel Talayot", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We were a little disappoined this time, as we asked well in advance if we could have the same room as last time, but instead we were given another room just near the lift that was niosey! The main entertainment person was no longer there, so that side of things had gone downhill! and the rooms need freshening up! On a brighter note , the staff a very nice, the position of the hotel is great and the meals are very good with a huge choice, This hotel is for older poeple so you dont get noisey kids everywhere, and you will often find nice people to talk to.", "title": "This was our second stay at this hotel.", "helpfulness": 5, "user": "GINGEREnfield", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115522062}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We wanted a chill out time and this was just right for us. Our room was small but with lots of storage and a large bathroom. We had a side sea view room near the front of the hotel so we did get a good view but the low walls between the balconies didn't give much privacy and had there been a different mix of people at the hotel, I'd have been more worried about security. The staff were always friendly and kept the hotel spotless. Food wasn't particularly exciting, but it was hot and plentiful, although I think a vegetarian might struggle with lack of choice.", "title": "Clean, quiet and a brilliant location.", "helpfulness": 4, "user": "cocoonbarbie", "date": "July 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 115493465}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "At the front of the hotel on the first floor, there's a lovely big terrace over looking the sea. In the evening it was a great place to sit with a glass or two of wine. We always managed to get a sunbed around the pool. Lovely quiet area, surrounded by trees. No music being played or aerobics in the pool.", "title": "Great Location", "helpfulness": 13, "user": "holidayman50", "date": "June 23, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 114675821}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The Talayot may come across as a bit old fashioned, but there's nothing wrong with that. We enjoyed our holiday. The location was brilliant with lots of bars and restaurants on the doorstep.", "title": "RESIDENTIAL HOME", "helpfulness": 6, "user": "KAYLEIGH41", "date": "June 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 2.0, "service": 3.0}, "id": 114474418}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "SINGLES BEWARE THOUGH. We spoke to several at the hotel who although they'd paid a single supplement, ended up with a room overlooking an inner space. Very claustrophobic, they said. One lady was in tears and wanted to go home. A couple of them paid extra again to be upgraded to a balcony room. If you want to at least see the sky, make sure you pay for a balcony.", "title": "good 3 star hotel", "helpfulness": 5, "user": "Stephanie7", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114080199}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We have just returned from a weeks stay at the Hotel Talayot in Cala Millor, Majorca and were pleasantly surprised at what we found. After reading some reviews on Trip Advisor we were expecting to be met by a flood of walking frames, wheelchairs and walking sticks. There were maybe more older generation than you would expect to meet in a hotel but plenty of people from all age groups, from 2yrs upwards. We were given a very warm welcome by the staff in reception and then made our way to our room. Our room was larger than a lot of 3 star hotel rooms that we have stayed in around the world and the bathroom was of a generous size. The room was provided with a kettle, cups and saucers and spoons, if we had not taken our own coffee with us we could have purchased some from reception, this goes for tea as well and of course bottled water too. There was a television in the room and some people might complain at the size of it, it was a little small, but we do not go on holiday to sit in our room and watch the T.V., What was nice about the T.V. was that a good number of the channels were in English, which is most unusual for hotels abroad. You could hire a safe for a nominal fee, as well as an iron and ironing board. Our room had what you would call a side sea view but it was still a very good view of the sea, from our large balcony. The room was kept spotlessly clean, the towels were changed when we required them to be and the bed linen was changed once during the week we stayed there. The food was of a very good standard, the breakfast was a good selection of cooked and continental style and the evening meal always had a good range of fish and meat, salads and puddings, not forgeting 2 types of soup. Entertainment was variable,of the 7 nights we were there we thouroughly enjoyed 4 of the evenings. Dave Collins singing and playing his guitar, Dejavou a couple one on keyboard and a lady singer, Fallon a comedy magician and an evening of Flamenco. But as we were in a three star hotel we did not expect international cabaret stars! The indoor swimming pool was nice and warm, the outdoor pool was provided with plenty of sun loungers to go round. One thing the Talayot has got going for it is LOCATION, just 50metres from a flat promenade that stretches for a long way. If you do not fancy a walk along the prom. why not hire one of the bikes, 2 or 4 wheeled, that can take from 2 to 6 people. There are peddle go-karts for the children and also all manner of push along carts for the younger generation. There is a well marked bike lane, so remember to look behind you now and again. I can understand the older generation using the Talayot as they get well fed, well looked after and probably feel right at home, as we did. The staff are very friendly, efficient and most helpful, keep up the good work Talayot, we will be back.", "title": "Great Location, good service, will return", "helpfulness": 17, "user": "mickeyjune", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 112892256}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We knew what to expect from this Hotel, and yes it does have a predomitably older clientele, but I prefer a quieter resort and don't want 'kids clubs' and a heaving modern hotel. We travelled with 4 generations of our family, and all of us enjoyed ourselves. We found the staff to be helpful and friendly, the cleaning was done to an acceptable & unobstrusive standard. The food, as with a lot of places has to be rotated into different meals each day, financially I don't suppose there is any other way it can be done. All the food was hot, fresh and if you didn't like something, there was nothing to stop you going to get something else. I personally like having a set table, and I'm sure if you weren't happy, Gregory would be more than happy to move you. The downside, for me was the entertainment, if you don't like bingo you've had it!! DJ Tony does his best to accomodate everyones musical tastes. Fallon was hilarious, as were a couple of the other acts, but still it needs an overhaul. Can't wait for next year....", "title": "would definately return", "helpfulness": 6, "user": "smurf3010", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 112879406}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "After reading some of these reviews, I wonder if it was the same Hotel! I am a 25 year old female and went to the Talayot with Family.", "title": "Can't wait to go back!", "helpfulness": 6, "user": "RachelB259", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112680044}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The Hotel is a 3 star, and personally i would rate it as 4 star. The staff were amazing, always friendly and helpful. The food was what you would expect, I had no complaints! The cleaners were lovely, always stopping to say \"Hola\" My room was always perfect.", "title": "TALAYOT NURSING HOME", "helpfulness": 7, "user": "ang87", "date": "June 8, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 2.0, "service": 1.0}, "id": 112158272}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The entertainment maybe was the only downside most nights...unless you like Bingo! But there are other places to go near the Hotel!", "title": "every thing is excelent at the hotel talayot", "helpfulness": 5, "user": "bojangles03", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110746662}, {"rating": 5.0, "title": "Ted bovis lives", "text": "I have stayed here before and this time opted for a sea view room,it is well worth the extra.", "user": "rexmundi59", "date": "July 25, 2013", "id": 168955743}, {"rating": 4.0, "title": "Very nice location, can't fault room positioning...", "text": "All corner rooms are double balconies,we had 502 great views,this room has been very stylishly upgraded .", "helpfulness": 1, "user": "Dave N", "date": "July 25, 2013", "id": 168950493}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Rooms are cleaned daily,entertainers do work hard but it is not to my personal taste but that's to be expected as you can't please everyone.", "title": "Brilliant Holiday", "helpfulness": 3, "user": "Gabs855", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168757004}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "The location is first rate and is quiet and good for families. The promenade is flat and ideal for hiring bikes ( from 5€ a day), you can hire segways as well.", "title": "The good & the bad", "helpfulness": 1, "user": "Darryl J", "date": "July 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 168730927}, {"rating": 4.0, "title": "Friendly hotel", "text": "The meals are all buffet and there is not a great variation but I always find something worth a try.", "helpfulness": 3, "user": "JohnB051", "date": "July 23, 2013", "id": 168678149}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "This is our second time got a refurb room on the 4th floor very nice the food as improved since last year and the staff are brilliant . Our only down fall is we come with some neighbour and she as done nothing but moan she as been a neighbour from hell in the end told them to stay away from us the moral of the story don't book a holiday with neighbours . Apart fr that great hotel very good holiday will come back again", "title": "Second holiday here", "helpfulness": 1, "user": "Kevin G", "date": "July 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 168318502}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We stayed at the Talayot between 13th ans 20th July and loved the place. The staff are very friendly and helpful ,whilst the food was great with different choices each day. A good mixture of different age groups who all appeared to mix , my own kids ages 16 and 13 also loved the place and thought that Santi the entertainments organizer was brilliant even the bingo.", "title": "A great holiday", "user": "fusion42", "date": "July 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 168289600}, {"rating": 3.0, "title": "ok if you are not vegetarian", "text": "We wouldn't hesitate to return and had a first floor sea view with a huge balcony .", "helpfulness": 3, "user": "selkiesave", "date": "July 18, 2013", "id": 168097351}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This place has loads of character and charm and is situated between the two resorts of Cala Bona and Cala Millor .", "title": "Perfect traditional hotel", "helpfulness": 2, "user": "Gary G", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168060623}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "All in all a great holiday .", "title": "Good hotel just a little dated", "helpfulness": 2, "user": "AMacklin", "date": "July 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 167914599}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This was our second visit ,this year we had a young child ,teenager & grandmother and we found that there were friends for all ages ,and we thoroughly enjoyed ourselves.", "title": "Still worthwhile ,friendly staff.good food & excellent location", "helpfulness": 2, "user": "WileyCoyote2", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 116569335}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The Reception staff are very friendly ,and do their best to help with all enquiries.", "title": "excellent hotel. Best one in resort", "helpfulness": 3, "user": "mucker1956", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116269760}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The bedrooms are basic ,but have a good hot water supply,fan,electric hair dryer,colour TV with Sky ,BBC 1,ITV 1 and sometimes BBC2/CBBC & all rooms have balcony", "title": "LOCATION,LOCATION,LOCATION", "helpfulness": 6, "user": "lol091", "date": "July 31, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 4.0, "service": 5.0}, "id": 116065686}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Every night there is a Carvery Roast,2 soups,wide cold buffet usually with fresh prawns or poached salmon.Then at least 5 other hot dishes,choice of 4/5 vegetables.", "title": "second visit loved it", "helpfulness": 4, "user": "rogerbarley", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116024937}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The main advantages are the outdoor swimming.pool indoor pool with small jacuzzi & excellent location half way between Cala Bona & Cala Millor.", "title": "Another Great Holiday-Roll On Next Year!", "helpfulness": 6, "user": "186478Marilyn", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115838342}, {"rating": 5.0, "title": "What are people moaning about?", "text": "I was dreading my stay at this hotel after reading the reviews on trip advisor. I had even thought of cancelling the holiday.", "user": "rexmundi59", "date": "August 23, 2011", "id": 117143731}, {"rating": 3.0, "title": "nice hotel ,nice location", "text": "I was really pleasantly surprised at all aspects of the hotel and staff. I thought I'd be walking into a Spanish care home. Yes there elderly guests but the age range was well mixed, the rooms,dining area , pool were kept spotless by the staff . The food was very good.", "user": "thekevster", "date": "August 15, 2011", "id": 116779198}, {"rating": 3.0, "title": "Good Hotel and Good Location but tired!!!", "text": "The tv channels in the room were limited but apart from watching the news on sky or bbc1 I don't come on holiday to watch tv.", "user": "gailh34", "date": "August 14, 2011", "id": 116710190}, {"rating": 5.0, "title": "Back again to our favourite Hotel", "text": "Myself and 13 year old daughter would definitely come here again. The beach was 2 minutes walk from the hotel", "user": "Pabs3K", "date": "August 12, 2011", "id": 116624308}, {"rating": 4.0, "title": "really enjoyed this holiday!", "text": "this hotel is set in a nice position on the front ,the rooms are in need of a bit of brightening up but are comfy with a decent sized bathroom,there is a tv in the room with limited british channels a fridge which is 14 euros a week (rip off),the pool area is small at the back of the hotel with plenty of sunbeds and shaded areas so why do people have to put sun shades up where people are trying to sunbathe,the food in the hotel is very good with full english or continental every morning and a carvery in the evening with plenty of choice of fresh salads and sweets,the entertainment in the evenings wasnt up to much which was a shame because it was nice to sit out on the terrace and have a drink,the staff in this hotel couldnt do enough for you and were very friendly,", "user": "glasgowtechie", "date": "August 12, 2011", "id": 116619527}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I have just returned from my first holiday in Majorca with my husband and friends. June 2013.", "title": "Excellent Hotel", "helpfulness": 5, "user": "Gill651", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 164176935}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We found the Hotel food excellent on par with many cruise ships we have been on. The choice was enormous and everything was hot that needed to be. It was a buffet style but everything was replenished so efficiently that nothing ran out. The staff were all very friendly and welcoming. One small thing was that the soap and shampoo in the room were not replenished when they had gone, it may just have been a fault with our room but we had taken our own. We would all certainly recommend this hotel.", "title": "excellent hotel", "helpfulness": 5, "user": "julie m", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164093964}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This was our first holiday in Majorca, and the Hotel Talayot lived up to its reviews, room was clean, and roomy with ,seaview and balcony,went half board and found the food was excellent, something for everyone, buffett service with plenty of choice, chef cooking during service, so food hot, and fresh. entertainment what we saw was enjoyable, but did not go down every night, wi-fi available, very enjoyable stay,staff frendly and helpful, hotel location very good, sea right outside hotel, walking distance to cala bona and 10 min walk to shops, plenty of cafes, and places to eat, booked again for 2014, p.s kettle in room for making tea/coffee, hotel charges to top up teabags milk etc so take own or pop round to supermarket, also buy drinks at bar and take into dining room rather than waiter service,", "title": "Little gem", "user": "Steve T", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 163999418}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "My wife & I have recently returned a after a 4 night break from The Hotel Talayot in cala millor Majorca & what a little gem of a find. The hotel was spotless & the staff very welcoming & friendly. We were on the 2nd floor overlooking the pool in a lovely position. The bedroom was very spacious & very clean as well as the spacious bathroom. We had read reviews that the hotel was a bit dated but in our opinion the decor was charming with a very warm homely feeling. The food in the hotel we can only describe as excellent & very well prepared &tasty a real credit to the chefs & dining room staff, nothing was too much trouble for them & you were always greeted with a smile. Oh & you are allocated your own table for the duration of your stay so no running around looking for somewhere to sit.The bar prices were very reasonable for a 3 star hotel & I must give a mention to Sante ( the entertainments host) for his wonderful humour, especially when playing bingo, what a scream. Keep up the good work Sante. We had never been to this hotel or resort before, others we spoke to had been returning year after year to the Talayot & we can understand why. On a final note , my wife & I loved cala millor & cala bona & will be returning with my brother & sister- inlaw in September. Well done to all staff in the Talayot. Will definitely return. Steve & Pat Thomas. Warrington, Cheshire.", "title": "First Time", "helpfulness": 6, "user": "mikeholder", "date": "June 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 163808891}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This was my very first holiday in Majorca and I can honestly say I enjoyed every minute, the Hotel was excellent, the staff were very friendly, rooms were clean and comfortable. Didn't think that the air conditioning worked that well though. Food was very good, catering very well to the English taste. Bar was good with prices at a very acceptable level. One little moan, the Hotel info said that the rooms had tea and coffee and a fridge - what it didn't say was that you had a kettle and cups and saucers - you had to buy the tea, milk and sugar, and pay 20 Euro for a key to the fridge (you do get 3 Euro back). You also had to pay the same for a key to the safe.", "title": "Dated Hotel.", "helpfulness": 7, "user": "Alan M", "date": "June 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 163597064}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This hotel has a fantastic location right on the promenade overlooking the sea. The rooms are basic but extremely clean as are all the public areas however the bathrooms could do with a face lift as fittings are old. Swimming pool is not fancy but fine for a swim. The staff are extremely friendly and I loved the cocktails that were available during happy hour. I was a little disappointed with the food as I would have preferred traditional Spanish food but understand the hotel has to cater for all guests so they stuck to food that catered to English taste buds on saying this I always found something to eat as I tended to stick to fish/meat with salad as there was a good variety of salad/ pasta dishes which I enjoyed. I would not hesitate to stay again and would recommend to friends and family. I enjoyed staying at the hotel in the evenings entertainment was ok and I enjoyed just sitting on terrace with a drink if something more lively required there are plenty of bars in resort.", "title": "Fantastic location", "helpfulness": 4, "user": "Lolly150", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 167532018}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "The hotel is clean and basic. The staff were all very helpful and friendly. The entertainment manager tried his best to introduce different activities but was tied by the majority of guests who were older and wanted to play two games of bingo nightly. The outside entertainers who performed after the bingo had the same issues.", "title": "Bingo bingo bingo", "helpfulness": 4, "user": "Chasndave1", "date": "July 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 166482687}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The Thompson rep was helpful although had only one days notice of pick up time.", "title": "Time to Modernise", "helpfulness": 7, "user": "holidayman50", "date": "July 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 166409049}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "This hotel has several good points:", "title": "Fantastic", "helpfulness": 2, "user": "alirat", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165964089}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "1. location near main beach.", "title": "First stay.", "helpfulness": 3, "user": "John K", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165665140}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 9, "average": 36, "very good": 115, "terrible": 3, "excellent": 112}, "aka": "Talayot Hotel Cala Millor", "slim_ranking": 0.213114754098, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}