{"user_rating": 4.0, "review_count": 535, "name": "Hotel Canaletto", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "7 people recently visited Italy. We had 3 rooms: 2 doubles and 1 triple. The Canaletto was difficult to find, but once there we were checked in right away. The double rooms were on the same hall and the triple was on the same floor but further down. After reading reviews here, we expected a slightly more updated hotel. The double rooms were fairly small, but clean and roomy enough to open two suitcases. The bath had modern fixtures. Linens were clean. There was a shortage of outlets and they were difficult to access. We had a street view from the shuttered window. The triple room was quite a surprise. It was a 2 level room with a very large, modern bathroom and a sitting area downstairs, which contained a day bed. Upstairs was a king bed plus a pull out trundle under the main bed. Storage was more than ample and this room had many outlets for rollers, camera chargers, etc. The room looked out on a canal and was very picturesque. We were thankful that this room was available to our party as we used it as a gathering place for the group. Breakfast was adequate with assorted pastries, cereal and juice. The waitresses made an effort to remember our beverage preferences and were very pleasant and accommodating. English was spoken by most hotel employees and the desk person assisted us in arranging for a water taxi to get the group to the train station upon checkout. The dock behind the hotel was being used for garbage pickup so the doorman helped us get our luggage to a nearby dock and also helped load all of our belongings into the water taxi.", "title": "Clean hotel, hard to find", "helpfulness": 3, "user": "swatts1", "date": "January 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6606779, "likes": {"liked": "— The triple room", "disliked": "— No way to control the heat"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "We would return to the Canaletto if looking for a well priced clean hotel. Its location was very good - near to the Rialto Bridge as well as Piazza San Marco. My main complaint was that the hotel was too hot. The only way that we could stay cool was to keep the window open which allowed street noise and a overwhelming woodsmoke smell.", "title": "Venice our favorite - Cannaletto great!", "helpfulness": 3, "user": "SCS-TRIP", "date": "December 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6519633, "likes": {"liked": "— Clean and helpful staff", "disliked": "— Rooms and some of the showers were small"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2004, traveled with family", "text": "We (two families traveling together requiring a double and two tripples) just returned from Italy and the Canaletto was one of the reasons that Venice was our favorite! This little hotel was tucked away, off the main tourist street, but only about half a block to a main street. To reach the hotel we arrived at Venice airport and took the Alilaguna to the San Marco stop. From there it is a short walk of about 3 blocks. Just be sure to get the directions before you go so that you don't have to depend on others for directions. The young woman who checked us in was very helpful with maps, directions to restaurants, transportation information and in general anything that we needed. The rooms were very clean and the bathrooms modern and marble. Each morning we awoke to the wonderful aroma of baking croissants! Breakfast was quite good and the breakfast room attendant was pleasant and always helpful in meeting our needs. The only problem that we had was that there is a major renovation going on next door to the hotel and they worked through the night with loud misic playing for most of the time on one or two of the nights that we were there. On the night without misic it was perfectly quiet and very comfortable. We would definitely stay at the Canaletto again!", "title": "Fantastic Canaletto", "helpfulness": 2, "user": "Skippy_Kangaroo", "date": "December 8, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6347781, "likes": {"liked": "— Style", "disliked": "— Cost"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Very stylish, good location, very nice facilities, the staff were pleasent and an alround good breakfast. We were only planning to stay 2 days in Venice, but considering how amazing it is to see Venice for the first time and staying a very stylish hotel during Carnevale, we just had to stay at least one more day.", "title": "Wow!", "helpfulness": 4, "user": "maljeff", "date": "November 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6181939, "likes": {"liked": "— My room and view!"}}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 21, "average": 77, "very good": 237, "terrible": 12, "excellent": 188}, "slim_ranking": 0.330708661417, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The hotel is situated in the heart of the romantic city of Venice, in a very quiet position just 200m from the beautiful St. Mark’s Square and the famous Rialto Bridge. It is the ideal starting point to set off through the alleys to discover the wonderful monuments and typical shops which hide all the ancient, fascinating mysteries of Venice. The hotel takes its name from the famous Venetian artist, Antonio Canal, who was known as Canaletto. The rooms where the artist used to live (1697-1768) have now become our elegant hotel rooms. A friendly, elegant, romantic and quiet atmosphere furnished in typical 18th century Venetian style, with stucco work, damask, hand lacquered and gilded furniture, Murano glass mirrors and lamps. All rooms are soundproofed and have private bathroom with shower or bath, air conditioning, telephone, Wi-Fi internet access, minibar, sat TV, hair dryer and safe. There are also our superior rooms with views of the canal or the typical square with the well-curb. The elegant public rooms (breakfast room, bar, TV room, internet point and Wi-Fi access) are all decorated with stucco work and the antique smoothed lime finish, and have some lovely reproduction of Canaletto’s works on the walls."}