{"user_rating": 4.5, "review_count": 59, "name": "Hotel El Ganzo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Wow! We're back in San Diego and are still wishing that we were walking up the steps of the El Ganzo being welcomed by the friendly staff.", "title": "Love the El Ganzo!", "user": "SanDiego001", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170519882}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The El Ganzo is a 20-30 minute trip from the airport, piece of cake. This side of Los Cabos is called the East Cape. Certainly much more peaceful than downtown Cabo, and only about a 10 minute drive into San Jose Del Cabo. An earlier review mentioned being \"stuck\" at the hotel and that there isn't anything around....?? They must not have found the amazing Drunken Sailor just down the street. $2 tacos that will know your socks off. So good! Also, there's The Container a short stroll down the bike path, or a 5 minute cab ride. Best dinner! (Breakfast not as good in our opinion) If you want an AMAZING experience book a reservation at Huerta Los Tamarindos. Dinner was surreal.", "title": "Perfect for a relaxing vacation", "user": "cparhonda", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169543529}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This hotel is so ultra cool. All the staff goes out of their way to make sure you're taken care of, but not in an intrusive manner. Each were truly interested in chatting with us....not like at the Hilton where we ended our stay. The difference with the El Ganzo compared to a Hilton is the authentic Mexico charm. If you want tons of screaming kids coupled with a sterile \"this hotel could be in Arizona\" vibe then don't book the Ganzo. If you're looking to completely decompress and unwind, this is the place for you. The rooftop pool was so nice! We also loved the private beach. Best chicken quesadilla's are available at the private beach restaurant. We walked down to the small market (owned by Jesus, nicest guy!) and grabbed a $5 six pack for the beach each day....perfect way to spend a few hours. :)", "title": "El Ganzo Cabo", "helpfulness": 1, "user": "Jesseaf", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169470784}, {"rating": 1.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Also loved the artist vibe around the El Ganzo. Saw Shane Alexander perform along with Mark Rudin, both were awesome!", "title": "Incredibly disappointing", "helpfulness": 2, "user": "Ruthizen", "date": "July 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 168815935}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This is really a special property. Love the El Ganzo and we can't wait for another visit!", "title": "a little bit of heaven..", "user": "kyvars", "date": "July 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168637339}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I really enjoyed my recent stay at this hotel. The location is excellent if you like a peaceful place away from the crowds at Cabos San Luca. The infinity pool at the rooftop is amazing and you can see the marina and watch all the fishing boats that come in the afternoon with their catch.", "title": "Great hotel but breakfast included is a little misleading", "user": "fayewilma", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166555058}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Staffs here also provide great service. I agree with others who commented the food here is overpriced and better to eat at places nearby such as the Drunken Sailor, a few steps down. There are also places nearby that has great food such as Flora's farms and the Container.", "title": "Simply the best!", "helpfulness": 2, "user": "worldtour2000", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166343528}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The only thing I cautioned others who brought a package like I did that included the El Ganzo breakfast. It is really a continental breakfast that include coffee, juice, toasts with jam and a fruit plate. If you want a full breakfast, you will have to pay extra. My package also included the bike rental, which is an added bonus and useful to use as transportation nearby.", "title": "El Ganzo hits and misses", "user": "MicheleLabella", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 165129530}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "I did not use their spa because their sauna room was not in service and the prices are much higher than the places close by.", "title": "All About The Arts", "user": "yodydody", "date": "June 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 163486938}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "I would definitely come back to this hotel again next time I am in the area.", "title": "Unbelievably Perfect Hotel", "helpfulness": 1, "user": "RAMbo314", "date": "June 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162942918}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We hired a boat from the marina for sport fishing, and returned with red snapper to eat. Our boat captain suggested we have the restaurant inside the hotel to cook our fish for lunch, so we did. There is a wonderful outdoor deck with plenty of shade and a great view of the marina. The service was very very good, not slow. Very friendly staff, all smiles, speaking good English. They took some of our fish and grilled it as we requested. Served it with soup and a very tasty salad, plus tortillas of course! They marked down their regular price because we provided the fish, which made it very reasonable for such a fine location and service. They also filled our cooler with ice for no charge.", "title": "Lunch after fishing was great", "helpfulness": 1, "user": "SCTravelerandskier", "date": "May 27, 2013", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0}, "id": 162027829}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We did not stay at this hotel, so my review is only for the restaurant, which I highly recommend!", "title": "Boutique Hotel - Mexican style", "helpfulness": 3, "user": "karavalley", "date": "May 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160593497}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I have just returned from a 3 night stay at this property. You know you have had a great vacation when you are figuring out when you can return.", "title": "New Boutique Hotel on the Marina with Amazing Views", "user": "alv63", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 157360544}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I have stayed at some pretty exclusive luxury $$$$ resorts in Cabo & San Jose but you can't top or beat what we got for our $$ here.", "title": "cold pool. go somewhere else.", "helpfulness": 2, "user": "belfastvi", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 3.0}, "id": 157042566}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The hotel is located at a new marina in Puerto Los Cabos. It is a dirt road leading up to the hotel. I paid extra for transzip to pick us up at the airport. They were waiting for me outside of the terminal has promised with my name nice and bold - no confusion!", "title": "Great design and view", "user": "G-seventeen", "date": "March 31, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156197884}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "It's my last couple of hours at Hotel El Ganzo and I'm already reflecting on my fantastic stay here. When planning this trip, I was immediately impressed by the natural yet modern aesthetic - not too sterile, not too rustic...the perfect balance of the two. Their marketing photos shows a facade of the hotel that is quite modest, but upon entering through it's massive pivoting wood door, you get the impact of how large this 'boutique hotel' really is. Generous open plan rooms, expansive views of the marina, farm tables in the restaurant and a gorgeous rooftop pool, bar and lounge area on which to enjoy stunning sunsets. Being the spa freak that I am, I couldn't believe the size of the spa treatment rooms with shower wet rooms in each, and a jacuzzi area outside. Heaven.", "title": "Design Your Life at El Ganzo", "user": "keryninbali", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177146825}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I was particularly impressed by the clean lines of the architecture and craftsmanship of the materials. It's easy to make a place look handcrafted, but to back that up with quality that will last far past the trendiness of 'modern rustic' is a feat that I think El Ganzo can achieve. I just hope that the art installations that will grow on the hotel's 'blank canvas walls' will not start to overwhelm and compromise the serenity of the rooms themselves.", "title": "Great stay!", "helpfulness": 1, "user": "David S", "date": "August 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175019020}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We enjoyed the water taxi and bike rides to the beach club and the mosaic cactus gardens, paddle boarding around the jetties, dinner at the Container across the marina, showing off long legs in the clear cube jacuzzi, the Kinesis gym at the spa, yoga on the outdoor stage. We especially loved several organic meals at Flora's Farm down the road (NOT TO BE MISSED!!)...which surprisingly rivaled our beloved Portland foodie scene.", "title": "Amazing Hotel - complete luxury experience", "user": "Liz O", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173741535}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Tips: my travel companion came up with the brilliant idea to leave water in the tub to combat the arid A/C air in the rooms at night. I tried to crack my patio door to let in some humidity, but woke up from a particularly attractive mosquito bite to the eye. So bring your favorite non-toxic insect repellent and After Bite...perhaps a future amenity will be a rad El Ganzo fly swatter. I loved the little colorful woven signature geese that greeted us home on our turned down bed after a day in the sun.", "title": "Best place to relax; wonderful boutique hotel", "user": "docbart", "date": "August 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171267711}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "I can always judge my level of enjoyment of any hotel when I can remember and give credit to the people on staff who were friendly, informative and genuinely nice: Jerry (hotel manager), Isaac and Rafael (front desk), Alessandro (spa manager), Yasmin (hostess), Bob (paddle board rentals). Thanks to all of you for your excellent customer service.", "title": "Great for fisherman!", "helpfulness": 1, "user": "CRinVegas", "date": "August 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 170620317}], "location": {"country": "Mexico", "region": "Baja California"}, "stars": 4.5, "variance": {"poor": 1, "average": 4, "very good": 17, "terrible": 3, "excellent": 34}, "aka": "Hotel El Ganzo Los Cabos/San Jose Del Cabo", "slim_ranking": 0.447368421053, "description": "There are lots of hotels in Los Cabos. But none quite like El Ganzo.We’ve created a place that celebrates diversity, creativity, artistry and sustainability. It’s a place where individual expression reins, and guests can indulge and enjoy Los Cabos like never before.Hotel El Ganzo avoids the ordinary. Spa treatments and gourmet cuisine rejuvenate the body, while music and art feed the soul. Visiting artists create their own original sounds in the hotel’s Underground Studio, while live musical performances and curated visual art exhibits treat guests to an insider’s view of the creative mind."}