{"user_rating": 4.0, "review_count": 388, "name": "Hotel Villa Victoria", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Still trying out new hotels during our visits to Nice, the VV turned out a good choice. Nice room (could have been a bit larger), nice reception personell and a nice garden for breakfast and relaxing in the afternoon or after dinner. Breakfast service not more than par.The hotel being quite a mix of international guests gave us the opportunity to talk to a chinese couple on their first trip to France. Very interesting. Nice hotel.", "title": "Great location", "user": "GiroNorway", "date": "July 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 133460844}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I stayed in the Villa Victoria for 3 nights the end of June, 2012. We were in room #110 on the street side. The room was a nice size with a comfortable queen bed and very nice clean bathroom. The storage was addaquite, a closet with a small hanging area, several storage shelves two night stands and a luggage rack. The bathroom had a small wrap around shelve to put toiletries on. There was a second mirror over the desk, a desk chair and two ottomans. The French balcony opened onto a lovely tree lined boulevard. It had double doors that blocked the street noise. The air conditioning actually cooled the room. We have traveled extencively in Europe and this is a real plus for a 3 star Hotel. The room had a hot water pot with tea bags and instant coffee. There was a small refrigerator with 2 complementary bottles of water for your first day. It had room to put several of your own beverages in it. The hotel had adult and other beverages available for a reasonable fee. The Breakfast was a buffet with the traditional french rolls, breakfast pasteries cheese, ham , boiled eggs, cereal, yougart and a basket with oranges and bananas. You had the choice of sitting in a nice dining room or the option of eating in their lovely plant filled garden. They also had 24 hour complementary tea, coffee, and tea cakes in the afternoon. The staff was pleasant and most helpful. The hotel is well located, a 3 minute walk from Avenue Jean Medecin, the location of major department stores. The Old town and outdoor market is a 7 minute walk and Promenade Des Anglais (along the beach) is a 9 minute walk. There were a few cafes available just a block from the hotel. The buses are convenient and reasonable the cost is 1 Euro for one direction and 4 euros for unlimited in one day, but they are crowded. We enjoyed walking down the lovely boulevard in front of the hotel. Loved eating our breakfast in the beautiful shaded garden and was happy it was available early (6:30 am).", "title": "Lovely Hotel", "helpfulness": 4, "user": "Patricia K", "date": "July 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 133256210}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Our two daughters (7yrs and 18months old) loved to play in the garden. A clean and conviniently located hotel with all basic aminities. The room towards the road was not as noisy as mentioned in some of the reviews. It was a good size room for 4 of us. For the breakfast, it would have been nice if they served some hot breakfast and something for the kids; the cakes were lovely though.", "title": "Good hotel, great garden", "helpfulness": 1, "user": "Nimitt", "date": "June 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132283388}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The false fire alarm early in the morning was a bit of a hassle one of the nights we stayed but that is just a coincidence... all in all we would love to come back. There is a huge gang of team here, didn't seem like a very big hotel, so if there were less people we would see the same face on the reception which would give a personalised touch - this is lacking here. Although all of them were quite helpful with basic information.", "title": "Good hotel, Great garden", "helpfulness": 1, "user": "Flucky", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132207645}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My husband and I stayed here for 2 nights in April 2012 - it was the 2nd destination on our honeymoon, and we were delighted with the room after the tiny closet we got in Paris! While the hotel itself is small, the rooms were lovely and the location was excellent as we walked from the train station to the hotel, while the promenade was a brief walk as well.", "title": "nice in nice", "helpfulness": 3, "user": "ucieOT", "date": "June 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132056993}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The hotel was a little old and dirty. The room was not very clean and the decor was outdated and unappealing. The breakfast was good.", "title": "Not the nicest place", "user": "cgcgcg19", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 75347151}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This hotel is in the perfect location for the beach, the old town and many of the beautiful sights Nice has to offer. We booked the hotel for our honeymoon and have thoroughly enjoyed breakfast in the lovely garden as well as perfect weather throughout our stay. The room we had had a street view but noise was not a problem. The only downside was that the air-con did not cool the room sufficiently after the heat of the day, however the hotel provided us with a fan which proved useful. My only criticism of the hotel would be that the 'private' beach' is only a subsidised beach which still costs 14 euros per person per day. There is no bar here but you can buy wine and drink it in the gardens. Overall, this is a great boutique hotel that I would happily come back to again and again.", "title": "Excellent value, beautiful gardens, great location", "user": "Celinebebe", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 71803723}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Thoroughly enjoyed our stay at Hotel Villa Victoria. The staff are very friendly and helpful. Enjoyed the complimentary coffee and pastries in the afternoon. We had a garden facing room which was very clean and quiet in the evening. The location is great not too far from the beach about three blocks away, with a discounted access to private beach/ restaurant.", "title": "Great location, friendly staff, v. clean, close to the beach, restaurants and train station", "user": "LWT888", "date": "July 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 70525190}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The restaurants and bars are not too far away, plus the train station ids close by around 10mins walk. The old town is quite a distance away but a lovely 20mins stroll along the promenade.", "title": "Beautiful Hotel, Nice Ammenities", "user": "DenverMike10", "date": "July 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 70341949}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Highly recommend the Hotel Villa Victoria if want a clean quiet hotel central all amenities. Although there is no hotel pool there is a lovely garden with orange trees. Also free internet access available. They can also arrange a transfer to the airport around 28 euros.", "title": "so so...", "user": "lilAnthony", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 70035161}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We stayed for a week on this, our first visit to Nice, and were very satisfied with the hotel. We chose it for the location which suited us admirably as it was central to everywhere we wanted to go - notably, the old town. The rooms were clean, light and comfortable and the staff were unfailingly helpful and courteous. The reception staff in particular went out of their way to assist us. The fifteen euro breakfast is pricy but we enjoyed it and there are plenty of other handy breakfast locations nearby for the budget conscious. We appreciated the coffee and tea making facilities in the rooms which one expects at home but rarely finds abroad. We also greatly enjoyed being able to have a reviving cup of coffee and a roll when we arrived back in the afternoons.", "title": "Very happy to have chosen Hotel Villa Victoria.", "user": "Theklablue", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 82845963}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Friendly, well-run hotel in a great location within walking distance of most attractions in Nice.", "title": "Exceptional Hotel in the Centre of Nice", "user": "justwannatravel0", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82671211}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Pleasant, helpful staff.", "title": "quiet location, easy to get everywhere", "user": "dacabs", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 82432399}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Rooms were very comfortable, and a good size by French standards. We had a Garden View room, with a small balcony looking out over a wonderful, peaceful garden oasis.", "title": "Worst bed I have ever slept in.", "user": "JetLagged2010", "date": "October 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 82253236}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "A nice touch was the afternoon \"tea\" in the lobby, which consisted of juice, coffee and cake.", "title": "Please, improve the rooms....", "helpfulness": 1, "user": "kuiken", "date": "September 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 80675746}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We agree with previous positive reviews, in keeping with the reason we selected a night here - on the strength of TA reviews, and happy to add to the tally. Nice also to be able to park just in front of the hotel, and the location meant it was quieter than if nearer the seafront area.", "title": "Nice location, comfortable and welcoming", "user": "PeterHarvey", "date": "June 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68960337}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "Service at Hotel Villa Victoria was excellent. My original hotel La Malmaison did not receive my booking reservation that I made through an internet booking company. La Malmaison called Villa Victoria located just a few doors away, and within a matter of minutes, the Victoria was able to accommodate us with the twin room we requested. The room #207 was an interior room,with one queen bed and a single bed. The beds were comfortable, the room large with a large terrace that overlooked the garden and also provided views of other beautiful homes that surrounded the area. The bathroom was large and there was a separate water closet. Plenty of soap, shampoos and towels and a large bathtub that allowed one to stand to actually take a shower without having to hold the shower handle. The hotel had coffee and pastries available during the day; the breakfast was very adequate plus very tasty apple tart. They have one computer for free use in their lobby. The hotel location was perfect-was in a nice location, not busy and not touristy, but close to all the action.I felt very safe in this area. Restaurants were close by and the staff was very helpful in providing recommendations of places to eat, and right on target. I can't think of anything I didn't like about the hotel and would definitely go back. I think it was meant to be...", "title": "good karma must have sent me here for my last few nights in France", "user": "bobbi-bbc", "date": "June 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67297433}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My wife and I stayed in the Villa Victoria Hotel for the last week of May, and once again we were impressed by the comfort, the warm welcome and the smooth efficiency of the place. We had been to the same hotel many times in the past: when it was under different ownership it was somewhat impersonal, but things have improved a good deal. Each room now has tea/coffee making facilities (not at all usual for French hotels), there are widescreen plasma or LCD televisions, and free coffee virtually all day in the lounge area. I would strongly advise any future guests to ask for garden-facing rooms, in order to avoid the noise of continuous traffic along the Boulevard Victor Hugo, and frankly I would avoid the breakfast which is very expensive. You can do just as well for half the price at one of the cafes near or on the Promenade des Anglais. But the hotel itself is absolutely fine: not too many rooms, either, so you never get the feeling that you're simply a small cog in a vast money-making machine.", "title": "VERY COMFORTABLE, CIVILISED AND QUIET", "helpfulness": 1, "user": "TedJohns", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 66585608}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The service was brilliant, rooms were very clean. I didn't know what to expect and I have come away very impressed with this little hotel. Has a private garden which is beautiul for breaky. The arvo there is coffee and pastries available in the lobby free of charge, Thanks for a great stay,", "title": "Execellent all round", "user": "Brissyfamily", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 65747276}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Stayed here during Monaco Grand Prix weekend so rooms more expensive than usual but that is what all the hotels do for this weekend. Paid 180euros for Friday, Saturday and Sunday nights and 140 euros for Monday night. We were upgraded to a Garden room at no extra cost and although the room (109) was small it was fine for sleeping and showering which is all we needed it for. One problem was noise from neighbouring rooms bathrooms. Every time the toilet was flushed it sounded like Niagara Falls and woke me up. Breakfast was on the expensive side at 15 euros per person for a buffet continental. Easy walking distance to train station, sea front and shopping areas.", "title": "Good location, friendly staff.", "user": "Birchdene", "date": "May 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 64791255}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed here for 4 nights in June. We had asked for a garden room as we wanted a quiet room. The view over the garden was lovely and the room very nice but really quite small. Good air con and the tea making facilities were appreciated. The free coffee and cakes in the afternoon were also a nice touch. The best thing by far though was the garden. Perfect for an aperitif or a night cap ! We didn't have breakfast but went down to Cafe Fleur in rue de France for a great breakfast for only 6 euros. The hotel is in a very good location. 5 mins to the promenade and a 15 minute pleasant stroll to the Old Town. Handy for the tram and very handy for the bus to / from the airport. Will stay here again when we return to Nice.", "title": "Good hotel with fabulous garden", "helpfulness": 2, "user": "Eryngium", "date": "June 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131920574}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Yes, the hotel was clean, the staff and friendly, and the afternoon tea/coffee and cakes were lovely, yet the extremely small size of our room makes it impossible to rate it higher. Not only was the room tiny, but it didn't even come with a chair that had a back on it--a four-legged stool was the all that came with the room. Even the in-room coffee maker came only with decaf, for the hotel was out of regular coffee during our stay. The bathroom was the saving grace, for it was probably as large as the sleeping quarters and quite clean and modern. The hotel's location was also more than adequate, being quite close to the sea and numerous restaurants and shops. For 15 euros, the breakfast was more than disappointing, for hot food was not available.", "title": "Very small room in a nice hotel", "helpfulness": 2, "user": "pjlv07b", "date": "June 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 131639412}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed in this hotel, chose a twin bedded room on the garden side including breakfast. The room was comfortable and clean and looked out on an apricot tree. The location was perfect for us--a nice walk to the Place Massena and Old Town, train station and seaside promenade. Breakfast was in the garden, lots of choices and a pleasant staff to help and clean the tables. In the afternoon, the hotel put out pastries with a pod coffee machine and one could help oneself and we did when we returned. We found numerous streets filled with charming and less expensive little restaurants within a few blocks of the hotel and went to a different restaurant each night (not in the more touristy areas with identical menus). All in all, a very satisfactory place to stay.", "title": "Airy hotel with a few extras", "helpfulness": 3, "user": "RobynFrance", "date": "June 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131328427}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Just stayed here for 3 nights whilst attending the Monaco GP. It was booked as part of a Thomas Cook package. The Hotel is well placed for the railway station, about a 10 minute walk and is also only about 5 minutes walk to the sea front and another 10 to the old town. Transfer from airport was about 20 mins.The area it is in is OK but not somewhere with anything to interest the visitor. Inside the reception, corridors and lift are presentable if not particularly stylish. Our room was a twin on the front and was clean, comfortable, with a good shower, TV and air-con but was not what I would call stylish or contemporary.", "title": "Fantastic garden", "helpfulness": 2, "user": "Fuzzbadge", "date": "May 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130801279}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The star of this hotel is the lovely garden to the rear, where we had breakfast. It is a real treat, with orange trees, jasmine etc. Breakfast is standard continental - nice bread and pastries, and they do a nice apple tart. There is also toast and cereals and savoury options (salami, cheese and something suspiciously like pork pie).", "title": "Very Good But Not Great", "helpfulness": 2, "user": "kanda84", "date": "May 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 129934538}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "This hotel has an excellent location by a quiet street. We had a room facing the garden and it was very peaceful - the garden is beautiful and we could enjoy the breakfast there every morning. The staff was very helpful, gave good recommendations for restaurants etc. The only minus is that the price for the breakfast was a bit expensive, it was all self service.", "title": "Perfect", "helpfulness": 2, "user": "VersoFinland", "date": "May 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129844981}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My wife and I spent 7 nights in this hotel in April/May 2012.", "title": "Charming Hotel, Would Stay Again", "helpfulness": 3, "user": "bobdibest", "date": "May 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129637156}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "On arrival our first impression was excellent, the hotel has a modern reception area with very friendly reception staff. There is also a sitting area with book lending library, and the hotel provides pastries and cake free of charge during the afternoon as well as use of the Nespresso Coffee Machine – a nice touch. Wifi is also provided free of charge and there is also a computer in reception for use too.", "title": "Lovely hotel", "user": "vlb1979", "date": "May 8, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 129595795}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Our room was garden view on the second floor. It was more spacious than I’d expected with a proper double bed (not two singles pushed together which is fairly common in European hotels), sitting area, fridge (with 2 bottles of water provided free of charge by the hotel) and tea/coffee facilities. The bathroom was large enough and clean, although the décor was a little old fashioned which let the room down a little. We also had a small balcony overlooking the garden.", "title": "Highly recommended - would stay here again!", "helpfulness": 3, "user": "newbornbliss", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129575581}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "The air conditioning in the room wasn’t brilliant either and we had to sleep with the balcony doors open to keep the room cool.", "title": "It's an average rating for me", "helpfulness": 1, "user": "TheTravellingGabo", "date": "April 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 127668707}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I recently stayed at the Villa Victoria and found it to be a bit of a Bait & Switch. The website makes it look really nice, as does the neighborhood and the reception and garden. However, the room was shabby and outdated, with dirty carpet. The headboards were cheap cut-out plywood. We had booked 3 nights, but were so disappointed with the hotel that we switched to Le Meridien for the remaining 2 nights. We were so glad, because for not much more per night, we were able to stay at a clean, updated hotel with a Mediterranean view.", "title": "Lovely Reception/Garden, Shabby Room", "user": "crossranch", "date": "September 20, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 80366584}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "I will give credit where credit is due, however, and say that the garden, of which we had a view from the shabby room, is lovely, and the breakfast we had there was delicious. It's really a shame, because the Villa Victoria would be my kind of place if the rooms were better.", "title": "Better than expected", "user": "Aerotrip", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 79625055}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Hotel was in a nice quiet location. Receptionist on arrival was welcoming and provided a map of the local area.", "title": "great relaxation", "user": "eurotrippers", "date": "September 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 79525645}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The rooms were clean and better than I had expected for a 3 star hotel and ours faced the garden which would have reduced any street noise. Breakfast was very good and included in our booking and eating out on the terrace was ideal. There was not a huge selection but the croissants, fresh bread, fruit etc was enjoyable. It was also nice in late afternoon returning to the hotel and helping yourself to coffee and pastries (possibly remaining from breakfast time) and as it was hot also chilled juice and taking them into the garden to relax.", "title": "Not a nice place to stay in", "user": "TravellerLondon26", "date": "September 8, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 78831814}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "Nearby restaurant Davia is worth a visit for a good value meal and Luc Salsedo for a special and relatively expensive dinner. For Luc Salsedo you have to pre-book.", "title": "Lovely hotel", "helpfulness": 2, "user": "Nicholson", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78007830}, {"rating": 4.0, "title": "Good location, excellent service", "text": "We stayed for 3 nights and couldnt have been happier. The room was clean, spacious and well furnished. The location was great that despite travelling with two little children, we managed to visit the promenade and beaches several times (few minutes walk) and also travel to nearby places (monaco, sandy beach at villefranche) etc as the hotel was close to public tranport. The staff at the reception was very friendly ( was glad to help us when we wanted to microwave some baby food late in the night). They also had a guide to public transport at their desk which is handy for the tourists. We would definitely recommend this hotel.", "user": "Sivakami B", "date": "April 8, 2012", "id": 127453372}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This is a brilliant hotel. Once again we booked a long way out to get the best deal we could and it is costing us a lot less than the room tariff at present. We arrived very early from Vienna at 9:00am and were given the option of looking at a room that was already made up over looking the courtyard. It was perfect. The room was beautiful with large double opening doors and shutter windows. The breakfasts were nice. Decent continental breakfast with lots of variety. The hotel staff are lovely and very helpful. They speak English which made things easier for us. I would definitely stay here again. You are only about 10 minutes walk from the beach front and there is a major supermarket nearby. The restaurants in the immediate area rate favorably on Trip Advisor if you want to avoid the mayhem of the beach front area.", "title": "Gem of a hotel in the heart of Nice", "helpfulness": 1, "user": "CraigandTania", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 122775241}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "This place met all of our needs and did not cost a fortune. Breakfasts were plentiful.", "title": "Perfect place to stay!", "helpfulness": 1, "user": "Theonlileonie", "date": "January 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122446942}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The location was great with just a short five minutes to the shops and restaurants.", "title": "Good base for exploring Nice", "helpfulness": 1, "user": "Footloose76", "date": "January 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122404590}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "The hotel looked typically what I thought a hotel in Nice would look- shutters and balconys. The garden was a lovely place to eat breakfast. I would love to return.", "title": "Situated on a tree lined street, this quant, French hotel is a real find", "user": "IlliterateFoodCritic", "date": "November 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120882722}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 44, "very good": 178, "terrible": 5, "excellent": 158}, "aka": "Victoria Hotel Nice", "slim_ranking": 0.037558685446, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}