{"user_rating": 4.5, "review_count": 241, "name": "Hotel Silberhorn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "This hotel was very nice and we had a wonderful view. We stayed at the hotel for three nights. It was very close to the train station. Our balcony looked out to one of the many waterfalls in the valley. It was a very peaceful and relaxing stay. We look forward to returning to this great hotel.", "title": "Great time at a beautiful place", "helpfulness": 1, "user": "lokar_a", "date": "April 26, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105702153}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "My husband and I just returned from a brief 4 day visit to the Jungfrau area. We wanted to see as much as we could so decided to stay in Lauterbrunnen that way we could tackle Murren, Gimmelwald, and Schilthorn one day; returning to our hotel in Lauterbrunnen then Wengen, Jungfrau another day, and Grindelwald yet another. The Silberhorn was perfectly located about 1/2 block from the train station in Lauterbrunnen. We ended up getting a room that had an extra living/TV room (we had not expected). We also had a garden area outside with a table. The bathroom had a shower and a bathtub! The breakfast (came with the cost of the room) was superb with eggs and sausage as well as the regular fruits, breads, cereals and expresso/kaffe machine. It was the best experience we have had in a long time and we travel quite a bit. The people were extremely warm and welcoming. I highly recommend this hotel. Be sure you do not confuse this with the Silberhorn Hotel in Wengen (Best Western). We arrived there (Wengen) only to find out that it was the wrong Silberhorn!", "title": "Best experience in a long time!", "helpfulness": 2, "user": "drhale50", "date": "April 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102483295}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "It was the second time we were in Hotel Silberhorn (first time september 2009).", "title": "Excellent family hotel with great location and great food.", "helpfulness": 1, "user": "9000Gent", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 97430285}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We were again very satisfied with as well the (superior) room, the kindness of the owner- family and the staff.", "title": "The Very Best place to stay on top of Europe", "helpfulness": 1, "user": "Benjamin077", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 94150189}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We choose this hotel because it is just in front of the Jungfraubahn station, the fact that they have a private parking place and the magnificent view from the balcony. So, location is sublime.", "title": "Unforgettable views of the valley!", "user": "lisalycmh", "date": "January 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 92603493}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We landed up in Lauturbrunnen late in the afternoon and after a short trudge up a steep walk (with luggage can be a pain) from the railway station we reached this charming hotel just above the station.A faultless checkin and mercifully assistance from a young chap got our suitcases up to the top floor room.There is no elevator.", "title": "fantastic location,great room,simply loved it......", "helpfulness": 1, "user": "IndiaRavi", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 113563010}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We had asked for a top floor corner room on the basis of an early review we had read in Trip Advisor and it was well worth the climb up the flight of stairs every time.A largish (by European standard) sleeping area and a separate sitting room with an attached private balcony sitout overlooking the valley and the Jungrau in the distance.,,,,,oh! what a fantastic view.", "title": "We made the right choice with the Silberhorn", "helpfulness": 3, "user": "triplenickel", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111023872}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "The service is excellent especially the practical assistance that is available from the lovely young lady that mans the front desk (a pity I have forgotten her name...thank you Ma'm for everything). The restaurant is well laid out and the breakfast wholesome.", "title": "Liked everything about this place.", "helpfulness": 2, "user": "ontnel", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 107716704}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "All in all a great stay....", "title": "Good, but expensive", "helpfulness": 1, "user": "AWSK", "date": "May 6, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 107169316}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We booked our hotel en route during our trip, being as it wasn't quite high season yet, and we were completely pleased with this hotel! They put us on the 3rd floor (no lift), perhaps since we appeared able to make the trip, and we had a fabulous corner room with balcony and views of the waterfall, the valley and the cogwheel train that chugged up and down to Wengen and the Jungfrau regularly throughout the day. Very nice accommodations, terrific staff, perfectly clean and welcoming. They even put out breakfast for us in the lobby at 6:30 AM so we could eat before catching the first train to the top of the Jungfrau, which was very kind. Their regular breakfast is awesome, which we got to experience the other 2 days. We would stay there again, no doubt. As far as dinner, we preferred the dinner at the Hotel Oberland, a short walk up the street, but dinner was good here as well.", "title": "A nice stay", "helpfulness": 1, "user": "shirotan", "date": "April 30, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 106171744}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Friendly staff, excellent food, good double room. It was our second visit to the hotel and we wil look forward to returning in the future.", "title": "Excellent Hotel", "user": "Barbara40", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84727949}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Alfred & Barbara Milton", "title": "Really enjoyed our stay of 4 nights", "user": "JB1105", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84591428}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Kent England", "title": "Excellent hotel and restaurant", "user": "hsvet", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83002433}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Wonderful place to stay. The staff was wonderful, the room was perfect (with great balcony), and the food delicious! I would recommend this hotel to anyone.", "title": "Loved Hotel Silberhorn!", "user": "jenterloo", "date": "October 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 82245451}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I stayed 3 nights here, but there was so much to do in the area I left early morning and returned late evening every day. I ate in the restaurant for breakfasts, which were in the cost of the hotel room, and one lunch, and the food was great. I had a great room with a great view. The bed was softer than at the other hotels I stayed at in Switzerland, which was good. The room was modern and clean, as was the hotel. The people were very friendly.", "title": "don't stay here if you are single woman, they treat you with disrepect", "helpfulness": 2, "user": "skibub", "date": "September 5, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 78344004}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "My wife and I stayed here 2 nights in July: wished it had been longer. For the same (high) price as hotels in other Swiss cities, this one was extraordinary: large (by European hotel standards) comfortable bedroom, huge bathroom, AND a nice sitting room with couch, TV etc. Balcony overlooking the valley with the Eiger,Jungfrau etc mountains visible. We were in an end unit, right next to the cable car operation (keep that bathroom shade drawn!), but never heard a thing from the bedroom. It's also across from, and visible from, the train station: 3 minute walk. Staff was extremely helpful, friendly (e.g. advice about which mountain peak might be clear, which walks to take); breakfast buffet outstanding. We ate dinner in the hotel restaurant: also very good. It's hard to talk about \"value\" in Switzerland, since everything is so expensive to begin with, but this hotel was the best value we found. You can stay more cheaply in this town, but not better, I'd say.", "title": "Fantastic Hotel", "helpfulness": 1, "user": "Genings", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116281573}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "we had been to this area before so we wanted to stay in a different town so we chose hee in lauterbrunnen. the hotel is great, spacey with the seperate sitting area and the balconey that ran the length of the room. it is a rough hike up the hill , but once there ,even thou we were on the 3rd fllor the young man took our luggage up to the room. the view was great as stated in an earlier review. we also ate at the olberland hotel and meal was very good. we took the cog up to murren, which is where we had stayed before and hiked down to gimmiewald. the next day went to the resturant at top of mt. where 007 did his movie. had a nice day then hiked from murren to first train station on rt. and then caught train rest of way down. must say our ages so you'll understand why we didn't hike all the way i'm 68 and husband is 71. but, we still enjoy doing what we can i also would like to thank the young lady at the fron desk from friendly and helpful would certainly stay there if in the area again", "title": "great views", "user": "wendyLakeland_fl", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116112082}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We especially liked this hotel because it is a block up from the main street, and is quieter, more private, and pastoral than many of the other hotels right on the main road going through town. We had rooms 26 and 27 in the main building, both with balconies and to-die-for views of the valley and Staubach falls. The corner room also had a view across the valley of hillside farms and Wengen high up on the valley wall. (There are some rooms in side buildings which might not have similar views and ambiance). The hotel is close to the train station (a steep walk up) and close to the cable station to Grutschalp. (The cable car is totally silent as it goes up and down). The hotel has a nice combination of rustic style and comfort, very friendly helpful staff, free computer/internet use, a nice garden, and clean, well appointed rooms. Breakfast was very good and comprehensive in a beautiful room. The dining room has glass walls with fantastic views. The restaurant is one of the better and more expensive restaurants in a town not known for great restaurants overall. The fish dishes and salads were very good, but we’ve had much better rosti elsewhere in Switzerland. The rosti, as in other LB restaurants, seemed greasy, salty and not crisp. The Veal Zurich seemed to have an artificial taste of bullion, and not the best we’ve had elsewhere. We ate in the restaurant one night to enjoy the food and more elegant ambiance, but chose to eat elsewhere at reduced prices on other nights.", "title": "We're Glad we Chose the Silberhorn", "user": "Somerset", "date": "July 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 115873698}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We were glad we chose Lauterbrunnen as a base, as it is central for lifts to hikes and sights on both sides of the valley. There was also plenty to do, e.g., extended walking in the valley, when the higher elevations (Wengen, Murren, and Jungfrau) were fogged in.", "title": "not the best hospitality in Lauterbrunnen", "helpfulness": 3, "user": "ATBN", "date": "July 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 115603569}, {"rating": 3.0, "title": "thanks again", "text": "Rick Steves says this hotel manages to feel family run despite its size. So not true. A feeling of warmth and genuine hospitality is exactly what is missing at this hotel. I chose here after having enjoyed my previous stays in other hotels in the area, mainly because I wanted my wife, who was having her first visit to the vally, to experience the best on offer. This was a mistake. she was taken aback at the cold reception during check in and never felt truly comfortable (they told us that the room was not ready although it was past check in time at 3:00 pm. we were not offered an explanation or an apology. instead, we were told flat out to come back later. when I asked when 'later' was, the receptionist simply shrugged!!). We ended up not even having one dinner at the hotel restaurant, against our previous plans. We will not return.", "helpfulness": 4, "user": "SeraDiver", "date": "July 11, 2011", "id": 115237156}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 9, "average": 23, "very good": 70, "terrible": 2, "excellent": 137}, "aka": "Minotel Lauterbrunnen", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}