{"user_rating": 4.0, "review_count": 588, "name": "Hotel Leifur Eiriksson", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "arived about 4 pm and were put in a ground floor room near reception the room was basic but clean and very comfortable beds. Breakfast was served until 9:30 on the last morning we were at 5 am but they still put some breakfast out.Great location 5 minutes walk to city centre most iclanders speak better english than we do and are extremely friendly and helpful.Plenty of places to eat and drink for every price range.", "title": "Clean basic and most of all friendly", "user": "vwdevondave", "date": "March 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 153430518}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "We arrived late at night, reception staff were quick to get us booked in and very friendly. This hotel is good value for money, rooms are cleaned daily and towels replaced, plenty of hot water in the shower, so no complaints at all. Yes some of the rooms/bathrooms are small but on a short 4 night break we knew we wouldn't be spending much time at the hotel - the location of Leifur Eiriksson is great, a few minutes walk to restaurants coffee shops etc. There's 24 hour free tea coffee hot chocolate squash and water in the reception area. We booked our trips to Northern Lights, Blue Lagoon and Golden Circle through the hotel - all very organised and on time. We were in the main building and emailed in advance to ask for 2nd floor rooms facing the church which we got. No it's not boasting 5 star amenities but I would certainly go back there again. Breakfast is good - the waffle maker is brilliant.", "title": "4 NIGHT BREAK IN REYKJAVIK", "user": "alanjones72", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 153061118}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Really not much on offer apart from a small but clean and nice enough room.", "title": "Good nights sleep, but pretty basic", "user": "Thomas2000040", "date": "February 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 152560069}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Provided a good nights sleep, but don't expect any services or ammenities at all apart from a room and a shower. Great location with only a few minutes walk to all downtown restaurants and bars, though.", "title": "Basic but great location", "helpfulness": 1, "user": "blenks66", "date": "February 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152451154}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "This hotel is basic but clean, friendly staff, lots of options for breakfast, and hot drinks available 24/7. We had a room at the front overlooking the church in the main building. We also had a small 'lounge area' with chairs and wardrobe which was great. Everything was clean and the room met all basic needs. Free wifi was a bonus too. It's in a perfect location, just a few minutes walk from the centre of town, far away enough to be out of the way of the weekend frivolities and noise if you are not into that sort of thing, but close enough not to be a pain to get out and do anything. Would definitely stay again.", "title": "Friendly and relaxing atmosphere, extremely clean", "user": "Catherine H", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152438751}, {"rating": 2.0, "stay_parameters": "Stayed March 2013", "text": "Staying for 3 nights. In annexe across road from main hotel which means putting on several layers just to breakfast or use wi-fi. Wi-fi in annexe absolutely useless, OK in hotel if you can lock into Vodafone hotspot.", "title": "Budget hotel that makes Travelodge look luxurious.", "helpfulness": 1, "user": "nataliatiyad", "date": "March 10, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 154145541}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Rooms small, ensuite wet room minuscule. Exceedingly basic(eg no hair dryers in room, borrow from reception for each use), 14 inch CRT screen well away from bed. English news channel and BBC 1 (but no sound on that channel). Single beds only in room despite request for double so be prepared for room restructuring!", "title": "Great Location but couldn't swing a cat!", "user": "CathB1952", "date": "March 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 154104433}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Breakfast passable, coffee good but only available in breakfast room, not bedroom.", "title": "Small & friendly", "user": "DAZZER82", "date": "March 5, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 153783606}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Reception tried to be very helpful in sorting one if many errors by Reykjavik Excursions( a company to be avoided if possible as their organisation of events is a shambles in our experience in a superjeep booking and a Northern Lights tour).", "title": "Brilliant but basic", "user": "Suzanne310", "date": "March 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 153767125}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Avoid this hotel if possible because there are better just as well located in Reykjavik for the same or less cost.", "title": "Basic but great location", "user": "Jennifer-Kent", "date": "March 4, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 153713843}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "This was the worst hotel I have stayed at in over 30 years' travelling. Our e-mail request for a room in the main building was confirmed but was lost when we arrived, so we were left by the front door, apparently forgotten until someone finally gave us a key to a room on the fourth floor. This proved desperately disappointing. The room was basic in the extreme, nothing provided that wasn't nailed down, certainly no 'finishing touches'. The beds (2 twins despite the double room booking) were tiny; I am 5'3\" and a size 12 but the bed felt child-sized. The duvet barely covered the bed. The bedding, once white, was grey with age and sported old stains. The mattress was soft and the pillow filling had totally disintegrated, neither providing any support. The room was very tired, the wiring looked ominous and the bedside light was broken (and remained so despite our requests).", "title": "Not a hotel, more a youth hostel", "helpfulness": 3, "user": "susiep36", "date": "March 4, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 153707706}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The shower was tiny - barely 18\" deep, with a shower curtain that wrapped itself around you. (I saw no sign of fresh shower curtains in the maids' IKEA bags of bedding.) There was nowhere to put toiletries whilst in the shower, no bathmat and the towels were old and thin.", "title": "Good hotel for visiting the Hallsgrimskirkja and Reykjavik old town", "helpfulness": 1, "user": "john_jane_carver", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153519938}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Breakfast was very basic and uninspiring. No fresh coffee or juice, just some undrinkable squash. Bread, meat, cheese and cereals were of UK supermarket basics quality. Everything was self-serve and clear your own tables.", "title": "Great little hotel in a brill location", "user": "Robert D", "date": "March 2, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 153510928}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The staff were cold and impersonal, verging on surly and reception was always undermanned. They booked our tours, but every booking went wrong and they scrabbled to sort things at the last minute. After returning from our Northern Lights tour after 1 a.m. we were woken by a telephone call before 7 a.m. by someone at reception asking if we were on a tour that day at 9 a.m. We were not. And later they could offer no explanation as to why our sleep had been disturbed in this way, and were quite unconcerned.", "title": "Amazing location BUT small room", "user": "Husain K", "date": "March 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 153475467}, {"rating": 4.0, "title": "Great location", "text": "On our last night we had no towels, the floor was dirty and the beds had not been made. We had to ask twice for towels and it was clear they didn't believe we were missing them.", "user": "exYorkie148", "date": "March 1, 2013", "id": 153467944}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Arrived on 12th night which is celebrated by the locals setting off fireworks, just like the 4th of July except that everything here is on a small scale which is one of the attractions of coming to this island. Stayed in room 213 which is in the annex on the other side of the road to the main hotel with little traffic between them. The room was warm,clean,modern and a fair size for two people with a comfortable bed, just above street level facing the impressive Hallgrimur's Church on top of the highest hill but with easy gradients.", "title": "Excellent Staff", "helpfulness": 1, "user": "thatmanrobert", "date": "February 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152438444}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The breakfast area in the main hotel was small and easily crowded with one toaster and a waffle maker, go easy with the ladle to avoid unnecessary spillage. Its true that the coffee from a machine is available all day but the taste made me look for local alternatives which were more enjoyable.", "title": "Excellent location", "user": "rosemaryWales", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152358234}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The staff were always helpful, spoke good English and on one occasion must have thought I was mad when I asked why all the post boxes in the area where closed when a little more thought would have made me realize that the openings were only big enough when raised to accept postcards and single letters in contrast to London post-boxes which have much larger permanent openings!", "title": "Three nights in Reykjavik", "user": "JPL2010", "date": "February 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 152356670}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "These people know how to provide service by going the extra mile like when we asked for the TV to be replaced when the sound level for the BBC channel became almost non-existent which was readily and cheerfully dealt with. Above all I was hugely impressed with their honestly and speed of response when my partner left a ring in the room which was found, taken to reception and transported to the local coach station all within an hour of checking out and then handed over as we were boarding the coach to the airport. This really was commendable and made our holiday even more memorable. A truly big thank you to you guys.", "title": "Nice little find", "user": "pjdlon", "date": "February 16, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 152286733}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "This hotel is ideally situated right in the centre (most of the chain hotels are well outside). The rooms are very basic and we certainly had the world's smallest bathroom! However,everything was spotlessly clean.", "title": "Excellent, excellent, excellent.", "user": "Chrisdoherty", "date": "February 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 152249343}], "location": {"country": "Iceland", "region": "Capital Region", "continent": "Europe"}, "stars": 3, "variance": {"poor": 41, "average": 106, "very good": 261, "terrible": 20, "excellent": 160}, "aka": "Leifur Eiriksson Hotel", "slim_ranking": 0.56862745098, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 5.0}, "description": "We are a 3 star family run hotel located in the centre of Reykjavik city opposite the famous Hallgrims Church .Our Hotel is in a quiet part of Reykjavik city and offer free parking opposite our Hotel .We offer 50 rooms all with private bathroom facilites and free wi fi internet connection ."}