{"user_rating": 4.5, "review_count": 251, "name": "Hotel Madeline", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Wonderful boutique hotel in Mountain Village. Great location, very nice amenities, clean, superb service from the moment you arrive. Nice, quiet. Room on small size, but nice large bathroom, terrific, large shower. Pet friendly. Intimate lobby.", "title": "Fabulous", "user": "Hobar", "date": "November 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145174116}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "During our recent 3 week road trip around Colorado, my husband and I spent 3 incredible nights at Hotel Madeline. I had pre booked and payed for the nights and must say that Trip Advisor and the Hotels website are accurate.", "title": "Heavenly Experience", "helpfulness": 3, "user": "Aussiesrus", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144053622}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "We stayed during the \"off\" season and were not disappointed.", "title": "Very Nice", "user": "John K", "date": "October 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143766701}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "From the moment we drove up to the main entrance where there were some renovations happening, the staff were apologetic, attentive and extremely helpful. The check in was seamless and we were shown to our room and given a personalised tour.", "title": "Wonderful stay", "user": "jarucker", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143723878}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The room was spacious and spotless, with a delightful view of the surrounding mountains and right down the valley to the airstrip. Magnificent outlook!", "title": "Beautiful Telluride", "helpfulness": 2, "user": "Alltheplacesillgo", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142606724}, {"rating": 1.0, "title": "the hotel is owned by the bank", "text": "If you are expecting a hotel on the level of the Four Seasons or Ritz Carlton, this hotel is not for you. Sure, it is convenient in the Mountain Village and the beds are quite comfortable but it is like a cave. It is one of the darkest hotels in a ski location that we have ever experienced. Does not take advantage of the Colorado sunshine. Most of the staff is very nice but on the whole, they are trying to get this hotel up to speed so a big company will buy it from the Swedish Bank. We found a disconnect between the facility and where it should be in terms of its potential as a luxury hotel in such a resort as Telluride. Pretty much, the hotel is over its head at this point in its hotel life. Wait until it is bought out by a big management chain so they can work out the kinks in the most professional manner. It has potential but is not there yet!", "helpfulness": 3, "user": "beta A", "date": "December 29, 2012", "id": 148321980}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "We stayed at the Hotel Madeline on a business trip to Telluride and could not have been happier. We arrived during the off season without a reservation and with our dog in tow. The front desk staff was happy to accommodate us with a great rate and generous pet policy. Unlike other hotels, we were permitted to leave our pup in the room while we ventured out to enjoy dinner. After checking in, we were shown to our spacious room by one of the front desk attendants. The room was fantastic with a nice view of the plaza. Our bathroom was complete with a large soaking tub, ample shower and Molton Brown toiletries. Also, the room was stocked with plush towels, robes, slippers and amazing bedding.", "title": "Absolutely lovely!", "user": "GDeneuve", "date": "December 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148320609}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "After a wonderful nights rest in an extremely comfortable bed, we ordered our complementary continental breakfast. A few moments later, a beautiful cart arrived at our door with pastries, yogurt, granola, fresh fruit, great coffee and fresh juice.", "title": "Fantastic Christmas stay", "user": "Monzini28", "date": "December 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148222231}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had great service and a luxurious, comfortable room in a perfect location. Hotel Madeline is everything a 4 star hotel should be and we can't wait to return.", "title": "Tip Top Venue", "user": "srdbigd", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147744270}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Loved this hotel. The rooms were huge, the bed so comfortable and the staff so nice and helpful.", "title": "Absolutely the Best", "helpfulness": 1, "user": "Kevin G", "date": "November 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146182883}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "Telluride has to be the nicest place I have been skiing. I haven't been too many places, Beaver Creek, Vail, Jackson Hole..... This is by far the best of them. Hard to get to, but so worth it.", "title": "Great place, great hotel!", "helpfulness": 1, "user": "panajoe81", "date": "January 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149506273}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Hotel was awesome. I know that sometimes things can't go smoothly and when we arrived our room wasn't ready. We got there at 3 pm, our room was ready at 4:30! I was a little disappointed but I received a letter from the manager to my room which I believe is what service is about. It was a great gesture and made me like the hotel even more.", "title": "Great experience over Christmas week!", "user": "Becky M", "date": "January 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149293160}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Stayed at the only 4 bedroom condo the hotel has, amazing condo, all the rooms are very similar in size so nobody feels as if they were left out. 2 of the rooms have balconies!", "title": "Very good value and excellent location.", "user": "Peggy K", "date": "January 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 148835694}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The location cannot be better, I could walk from the lobby about 50 feet to the mountain and go down meadows run! The ski school for kids is a 2 minute walk and the skating rink is right next to the hotel.", "title": "Simply fantastic!", "user": "Itsme2day", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148719980}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The spa could be a bit better, there is no sauna or steam for people who aren't having a massage. The jacuzzi is small where the pool is. I would say this is the only so so place the hotel has.", "title": "Good Family Ski Trip", "user": "Cathy D", "date": "December 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148435589}, {"rating": 3.0, "title": "Over charged credit card", "text": "I recently stayed at hotel Madeline, the rooms and staff were excellent. The problem was checking out. They were very disorganized on our charges made to the room. After leaving, I had an additional $168 charge made to my credit card that had already been paid. I have called 6 times now and no one can figure out the solution to refunding my money. I have left numerous messages with finance, and no call back. Very disappointed with the follow up to this problem.", "helpfulness": 1, "user": "SamandAlMac", "date": "October 5, 2012", "id": 142060856}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "We stayed at the Hotel Madeline during the Telluride Blues & Brews Fest, and it was awesome. Our 3-bedroom, 3 1/2 bath suite with 4 big-screen TVs & 4 balconies was immaculate and had the best amenities from bathrooms to kitchen. Very nice toiletries in the bathrooms which all had double sinks, separate tub & shower, and separate water closet. Turn down service with fine Austrian chocolates. Fridge was stocked with soda & juices. Top-notch kitchen with a Wolf stove, very nice dishes, pans, and utensils. The staff was extremely helpful & friendly - we even got the maids to hula hoop with us. Super close to the gondola. Pool & hot tub were OK. Pool is only 3 feet deep and the hot tub could have been cleaner (too foamy means bacteria). Overall, it was excellent!", "title": "Truly 5-star!", "helpfulness": 1, "user": "rsocha", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141105006}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Hotel Madeline at first appearance is the best of the high end resort hotels. Beautiful with all the amenities one would expect delivered flawlessly. Terrific location steps away from the gondola. What sets this experience apart was the staff. I have travelled extensively to similarly rated hotes but only ever treated as well at one other resort. Not surprisingly it is a sister resort La Posada. The staff were familiar without being disrespectful, attentive without being intrusive. We had two memorable meals at Rev. The servers were excellent and assisted by the wine director who was passionate about pairing the best wine with what the chef was preparing. He was spot on throughout both meals. Beyond delicious. Will be returning again for ski season.", "title": "Beyond a first class resort", "helpfulness": 1, "user": "Kim B", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140492855}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I stayed at Hotel Madeline in July while visiting family. The hotel is top-notch with friendly professional staff and luxurious accommodations. Mountain Village is a free gondola-ride above the town of Telluride and I found that preferable because of the less congestive roads for an early morning run. Hotel Madeline has two restaurants and I ate in “Rev.” It was just opening and I found things on the menu that were inventive and unusual. The staff was attentive and the service prompt. Rev has a fabulous appetizer that includes a very intense and dense cube of watermelon and feta cheese that has been compressed. The contrasting flavors of the watermelon and the cheese are very intense. One morning I had an omelette which was hot, promptly served and delicious. All in all, my stay and my restaurant experiences were great.", "title": "Great stay and meals at Hotel Madeline", "helpfulness": 2, "user": "Betsy M", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 140192666}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Went to Telluride Film Festival over labor day weekend. Hotel Madeline (actually in Mountain Village above Telluride) is a great property. Beautiful inside, beautiful outside. Too busy with festival and all those films to enjoy the spa, etc. Restaurant 'Rev' has super food, great service, different wine list (converted me back to Chardonnay.) Free gondolas from hotel into Telluride. Telluride is a real, small village with sidewalks and streets; Mountain Village is a pedestrian resort property. Would have enjoyed it more if I had been more comfortable in the altitude.", "title": "Film Festival", "helpfulness": 1, "user": "Maureen T", "date": "September 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139840453}], "location": {"country": "United States", "city": "Telluride"}, "stars": 4.5, "variance": {"poor": 6, "average": 8, "very good": 61, "terrible": 3, "excellent": 173}, "slim_ranking": 0.473684210526, "description": "Hotel Madeline Telluride is a refined boutique address located at the heart of Telluride, Colorado's ski mountain. The hotel has 84 guest rooms, 11 suites, and 15 condominiums of sophisticated design, attentive service and the amenities to fully enjoy the invigorating atmosphere of the Rockies. Rev Restaurant is a fine dining room serving farm to talbe mountain chic cuisine that features local and regional ingredients. Smak Bar is a relaxed tavern chic pub serving and imaginative small and large plate menu. The Spa offers transformational treatments focused on healing and rejuvenation. Hotel Madeline Telluride is also well set for intimate weddings and small scale meetings, with 3,000 square feet of function space surrounded by wooded hillsides and majestic, mountain peaks."}