{"user_rating": 4.0, "review_count": 423, "name": "Hotel Mayfair Paris", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We returned last evening from a 5 day stay at the Mayfair Hotel in Paris....We up-graded our room to a Deluxe Double and it was large and lovely...The whole hotel is so well run and CLEAN...We certainly have NO complaints...We enjoyed the breakfasts and they were so adequate we only ate two meals a day...The charming girl serving them was an \"extra\".....The location of the Mayfair is super as it is so close to so many things that you can walk to many places with no problem. It is tucked away on a side street and we never heard any noise ...The beds were comfortable and there was a small terrace off of our room..If you are looking for a lovely place to stay while in Paris, we would highly recommend this hotel..", "title": "Loved the Mayfair Hotel/Location", "helpfulness": 2, "user": "punky1933", "date": "August 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19518622, "likes": {"liked": "— We liked EVERYTHING about the hotel...", "disliked": "— There was nothing we disliked."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We just stayed at Hotel Mayfair last month. We booked a 'Superior room' & requested King bed - we were gifted with an \"upgrade\" when we arrived ,so I am not sure what type of room we had but it was roomy! Very clean, comfortable, elegant decor, relatively quiet (certainly didn't disturb us) for so close to Tulleries amusement park in summer(!) - separate large bathroom w private stool closet, comfy bed... Friendly, intelligent and helpful front desk staff... Cafe ard corner is very good...Souffle Restaurant closeby is very good too! Would stay again & longer - let's just hope the dollar regains it's past value so we can.", "title": "A really pleasant stay at an excellent small hotel.", "helpfulness": 2, "user": "likesagoodhotel", "date": "August 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18648876, "likes": {"liked": "— The comfort and cleanliness.", "disliked": "— I wish everything were less expensive."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We've stayed here twice, both times in late June/early July.", "title": "Love the Hotel Mayfair", "helpfulness": 4, "user": "ggadmin", "date": "August 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 18515046, "likes": {"liked": "— Location", "disliked": "— Had to pay for Internet"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Positives -", "title": "Wonderful hotel in heart of Paris", "helpfulness": 2, "user": "YvetteSydney", "date": "July 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18186191, "likes": {"liked": "— Location", "disliked": "— No kettle in room"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The location is great - half a block off the Rue de Rivoli - very close to the Tuileries Gardens and Concorde Metro Stop, yet tucked away enough to not feel touristy. Also, many restaurants are in walking distance.", "title": "Good Location", "helpfulness": 4, "user": "bessyOrangeCA", "date": "July 14, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 17890719, "likes": {"liked": "— Location", "disliked": "— shower help and upkeep of room"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Just returned from a week stay at the Mayfair. Had a great experience. The staff was extremely friendly and helpful. I was traveling solo and the location was ideal. The hotel was close to everything and easy walking distance to most of the sights. If not the Concord Metro is very close by and a taxi stand.", "title": "Great Location & Great Experience", "helpfulness": 3, "user": "AuntGigi5", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16216691, "likes": {"liked": "— The location was ideal"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "A group of 5 women just returned from Paris in April. Weather was pretty chilly & breezy, but the staff and reception at the Mayfair was great! No \"snooty Parisians\" here -- The location is GREAT! You can walk to the Louvre, Musee D'Orsay, shops on Rue de Rivoli & Rue St. Honore. Hotel rooms are small, but bathrooms were nice & large. Right next door is a great brasserie --called Cafe Imperial--that serves wonderful food at reasonable prices. In fact, we ate there so many times, the staff treated us as \"regulars\" --everyone was very nice to us!", "title": "Chilly April, but warm reception!", "user": "QueenNina", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15513966}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "While in Paris, we used the Hop-on Hop-off tour bus, Batobus, and Cityrama company for a trip to Versailles. I can recommend all of the above. However, we did NOT like the tour we took with ParisVision(another sightseeing company) They left 45 minutes late & pretty much ignored us the whole time.", "title": "Absolutely good choice", "helpfulness": 1, "user": "CzechMerlin", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15165608, "likes": {"liked": "— comfort of the room", "disliked": "— no problem"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "But, we highly recommend Hotel Mayfair--we booked our air & hotel package through Air France .", "title": "Very disappointed", "helpfulness": 5, "user": "samsaidi", "date": "April 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 15009947, "likes": {"liked": "— Location", "disliked": "— Mouldy wallpaper"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "I have just returned from Hotel Mayfair. I have stayed there just one night but I can absolutely recommend it to all. I have taken a superior room because i have been worry about room size but no need to worry about the size. Anyway I guess you dont go to this hotel to spend all day on hotel room. Louvre is walk away, also metro station and Paris has many places to take you away. Hotel room was clean and the staff very kind and helpful. In the morning I have heard some noise from the street but it is not reason to wake you. I think it is good not to take a hotel with windows facing to rue Rivoli, where the traffic is hard. Side streets are much more quiet. In the room everything was like on the hotel pictures, nice elegant furniture, soft carpets, large bathroom. I will gladly return to this hotel again in next visit of Paris.", "title": "Very practical", "helpfulness": 1, "user": "Tawfiq0303", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14836436, "likes": {"liked": "— charming", "disliked": "— no spa"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "A real gem this place. Close to the Rue de Rivoli in a historic building with excellent staff. Our room was perfect and given that the hotel has obviously seen better days it didn't lack in any way.", "title": "Cosy Hotel in an Excellent Location", "user": "HKPlum_Bum", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169201629}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "If you like \"quirky\" then this was provided by the sole lift which certainly was showing it's age and if there was room for improvement then this would be it - but I am sure some people would view it as quaint. It is also the first time in ages that I have had a room with a physical key rather thean a key card - a sign of it's age / timelessness (depending on your view).", "title": "Double Booked", "user": "SJD1965186220", "date": "July 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 168817555}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "In summary both the hotel and the staff have character and given it's location made for an enjoyable stay.", "title": "An Upmarket Three Star", "helpfulness": 2, "user": "Frank B", "date": "July 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 166969401}, {"rating": 4.0, "title": "An interesting hotel - ups and downs", "text": "We booked for 2 nights at the Mayfair Hotel for the weekend of the final stage of the Tour De France. We booked 7 weeks ahead and booked through Expedia. When we arrived at the hotel we were told there was a problem - they did not have a room for us but had found another hotel. When we asked why there was no room when we had paid in full 7 weeks earlier there was a no straight answer, eventually one of the receptionists said the one of their guests had not checked out and after I queried this they then said that the guest was unwell. We were eventually walked to the other hotel by their front of house who proceeded to say that that do not usually double book!! It was pretty obvious that we were been lied to! There was no real apology and we were offered breakfast at the Mayfair as compensation - great get up walk to another hotel breakfast. The hotel looked very nice but I suspect they had someone there who was paying a higher rate than us and were therefore sent to another hotel that we had no choice but to accept. I would not advise booking with this hotel we were treated with no respect at all and they did not care whether were were happy with the alternative offered.", "helpfulness": 2, "user": "gccrab", "date": "June 29, 2013", "id": 165684019}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "As a regular user of TripAdvisor I sometimes find it hard to reconcile different visitor comments about a hotel and the Mayfair is no exception. My wife and I looked at the comments, the rages and the raves, both before we booked and with the benefit of hindsight. In retrospect, while I cannot comment on individual experiences with service or beds etc., it seemed to us that most of the comments we read are accurate enough. Nonetheless, our bottom line with hotels is to ask if would be happy to stay there again and in the case of the Mayfair the answer is yes, warts and all.", "title": "Parisian take on Mayfair", "user": "Christopher K", "date": "June 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 164168800}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We thoroughly enjoyed our stay for ten days and can't wait to go back to the Mayfair Hotel. The staff is absolutely fanastic....they were always helpful, thoughtful and very friendly. Louisa in the breakfast room is just wonderful. I had fallen at the park and when we came back to the hotel, she helped bring me up to our room. She deserves rave reviews. The hotel is located in the best spot for sightseeing as it is close to everything. The Paris Vision tours, especially the on-off tour bus, are great and the office is not far from the hotel. We booked directly through Air France and selected the hotel from their sight. It was reasonably priced for the package. We had a room in the front of the hotel and didn't mind any traffic noises. The room was a nice size and the bathroom was roomy. We loved our stay and really wanted to be here longer. We would recommend the hotel to anyone who wants a great hotel in a great location.", "title": "Wonderful, Wonderful Hotel", "helpfulness": 2, "user": "SCW58", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20225118}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This hotel is close to sights, shopping and restaurants but the hotel itself is just okay. The front desk staff was just okay, the breakfast was not as good as the breakfasts we had had in the other hotels in Europe where we stayed. Room was small, which is fine as we are not in the room much, but the bed wasn't very comfortable. We had a bit of a communication breakdown (we do not speak French) with a cleaning woman. She kept trying to clean our room and we asked for 15 min so we could change clothes but she kept coming in the room. It was a little annoying but that just indicates I should learn a little more French before my next trip!", "title": "Great location, okay hotel", "user": "Patricia B", "date": "June 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 163954917}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This hotel is in a great location. The rooms are attractive. Unfortunately, it was so hot!! The air conditioning is non-existent. When we asked for a fan, a little man behind the desk shook his fist at us. We paid over 6000 bucks to stay here-- had two rooms. Room service was poor-- both the quality of the food and the service. The Internet worked fine in our room but was very spotty in our kids' room, one floor beneath us. They never gave us clean glasses and acted surprised that we would want clean glasses! Not particularly clean in general. All in all cannot recommend and would not stay here again.", "title": "Charming appearance but with issues!", "helpfulness": 1, "user": "Patsy S", "date": "June 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 163889577}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Spent nine nights at the Mayfair in a \"superior\" room on the second floor. Location is excellent allowing us to walk to many sites. Room was relatively large compared to many we have had in Europe, and the bath was large, clean and complete. Bed was large and very comfortable and closet space was adequate. The room was in a quiet area of the floor, no street noise. Breakfast was really a delight. Eggs as you like them served individually to each of us under domed covers; lots of breads, cheeses, fruits, juices and several meats. Table cloths were fresh and the service was excellent, thank you Louise. We hope to return before too long. One small complaint: 10 euro/day for wifi---not accustomed to that in the USA. There were no hidden charges or surprises upon checkout. A charming small hotel.", "title": "Charming, great location, comfortable, great breakfast", "helpfulness": 1, "user": "Charles H", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163764010}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "My family had several rooms at the Hotel Mayfair in Paris: one was OK, one was so-so, and one was unacceptable. Two of the rooms did not have air conditioning available for two of the four nights. If you have a room in the front you will get moderate strret noise which is a problem in the early morning. The mattresses in all the rooms sagged from moderate to severe, and one was covered in a plastic pad. There are no amenities other than shampoo and soap. No bedside light to read by. Housekeeping is spotty: baseboards were filthy and lots of chipped paint everywhere. One gets the sense that hotel management has checked out. Wi-fi worked well and location is great. Breakfast is ridiculously expensive. Difficult to understand why the Mayfair is rated 4 stars. Seems more like 3 to me. Botttom line: you may be satisfied with your room, but I doubt it.", "title": "So So", "helpfulness": 1, "user": "Polarine", "date": "June 4, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 162986832}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My husband and I recently stayed at the Hotel Mayfair - this was our third stay, and as usual we found the hotel perfect for our needs. The staff are friendly (for the most part - this time the man at the front desk was not particularly warm, but he was competent and helpful). The hotel is perfectly located virtually a half block from an entrance to the Tuilleries, and two blocks from the wonderful shops on the Rue St. Honore - we always try to stay in this hotel when we are in Paris....I do wish breakfast was included - the breakfast room is particularly nice - light filled and with a small inner courtyard to brighten it, and I also wish wifi was free as it is in many 4 star hotels.", "title": "Convenient and lovely right bank hotel", "user": "eartoday", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162818451}, {"rating": 4.0, "title": "Good location, BUT...", "text": "You can't beat the location of this hotel, it's small and very typical of Paris. The lobby and common spaces are very nicely decorated, old world style, which is what I enjoy. The rooms small, but clean and tidy, but small is being in Paris.", "user": "Empire1guy", "date": "May 31, 2013", "id": 162500238}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "I don't give this hotel a top rating because while the staff was friendly and helpful, the management needs some help. Who ever runs this place went to management school where they were taught that putting up a sign or making a rule would solve every problem. The hotel has plenty of rules that seem to posted everywhere. At the elevator there is a letter from management explaining why it is difficult to get a cab.", "title": "Nice Hotel, Great Location", "user": "Kathleen D", "date": "May 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161606288}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "I stayed three nights and enjoyed the stay, but honestly, it's Paris, I did not spend a lot of time in the hotel.", "title": "This is a very nice hotel conveniently located", "user": "Muncie_birder", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160304408}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "A friend and I stayed here one night while we were in Paris. The staff was very friendly and helpful. The rooms were large and comfortable. The bathrooms were also quite spacious. The beds were comfortable. All in all, this was a nice hotel I would certainly stay at again.", "title": "It will be hard to leave!", "user": "jojijojo", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159828482}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "The location of this hotel could not be beat. It was literally around the corner from the L'Arc de Triomphe, making everything you could want to do very easily accessible. There were bikes for rent just outside the doors and taxis and the metro steps away. Being so close to the Champs Elysees was both convenient and magical.", "title": "great location, cute hotel", "user": "PRINCEULLAH", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 158576440}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "I never received an email to confirm my reservation.", "title": "Would not stay here again", "helpfulness": 4, "user": "D D", "date": "July 7, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 5.0}, "id": 17626907, "likes": {"liked": "— Location", "disliked": "— Rude front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel is in a good safe location.", "title": "Great Experience", "helpfulness": 3, "user": "xx_miss_piggy_xx", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17414341, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "Bathroom was good size.", "title": "Delightfully charming hotel", "helpfulness": 2, "user": "Scotty082", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17284315, "likes": {"liked": "— Comfortable and spotlessly clean", "disliked": "— Nothing really, it was all great"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "Shower was dreadful.", "title": "WONDERFUL hotel!!", "helpfulness": 2, "user": "Love8098", "date": "May 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16375787, "likes": {"liked": "— The amazing staff and quality of hotel", "disliked": "— Can't think of anything :)"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "This is my second stay at the Mayfair Hotel. I am glad to be back.", "title": "Hotel Mayfair is home away from home", "user": "Bryan H", "date": "April 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157828185}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The staff is wonderful.", "title": "Fifth time at the Hotel Mayfair", "helpfulness": 1, "user": "Charlyn B", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157504321}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The location is great. Very close to the metro station and Champs Élysées.", "title": "Mayfair simply superb.", "helpfulness": 1, "user": "Crownie", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155749224}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The rooms have old style charm and elegance.", "title": "A small hotel in nice location for shopping", "helpfulness": 2, "user": "MarinaDelRey335", "date": "February 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153258379}, {"rating": 4.0, "stay_parameters": "Stayed March 2012", "text": "The breakfast is a fantastic. I had the best ham omelet and capachino that I have ever had in my life. And wonderful service.", "title": "Great location but limited amenities", "helpfulness": 2, "user": "skiff", "date": "February 25, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 153087321}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We did a trip around Europe with my wife. Stayed at the Mayfair in Paris, and we had a great time there.", "title": "thanks for the reviews. Great place to stay in Paris !", "helpfulness": 1, "user": "HKKW", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14518989, "likes": {"liked": "— friendly staff and geographical location", "disliked": "— no view"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Just like we pictured a hotel in Paris. Typical old Parisian style, but with all the modern facilities.", "title": "a business trip to remember", "user": "kevinkl", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14511686, "likes": {"liked": "— its location and staff", "disliked": "— no pool"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The location is amazing. You are right in the heart of Paris and within walking distance of everything you need to see.", "title": "so romantic !", "helpfulness": 1, "user": "Singaling", "date": "March 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14355082, "likes": {"liked": "— friendliness of staff + ideally located", "disliked": "— not much"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "The staff was very friendly. Too bad they don't have a pool, but anyway so many things to see in Paris we wouldn;t have spent a minute in it !", "title": "Nice small hotel", "user": "Lucas-Italy", "date": "March 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14279187}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I was in Paris last week for business. I stayed at the Mayfair. It felt like I was on vacation ! The hotel is amazingly well located, right in the heart of Paris. So no question about visiting after work, as yo just have to step out the front gate.", "title": "Thank you Mayfair Paris!", "helpfulness": 1, "user": "MemberLondonCity", "date": "February 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13923995}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "For my 21st birthday my boyfriend took me to Paris. I was thrilled at the thought, however slightly apprehensive as he had booked the whole holiday himself.", "title": "Good choice", "helpfulness": 2, "user": "stevencphg", "date": "May 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16361728, "likes": {"liked": "— Th staff"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 15, "average": 57, "very good": 117, "terrible": 17, "excellent": 217}, "aka": "Mayfair Hotel Paris", "slim_ranking": 0.209704406023, "description": "Ideally located in the fashion & business area of Paris; within walking distance of the Louvre, Place de la Concorde, Place Vendôme, Opéra and the Champs-Élysées; the Hotel Mayfair Paris is an elegant boutique hotel offering 40 rooms, 7 junior suites and a business meeting room suitable for 12. Member of the Preferred Hotel Group selection, its decoration combines harmonious colours and luxurious fabrics that define the essence of this French style home. The Hotel Mayfair Paris is a perfect illustration of French hospitality at its very best, providing a very attentive and personalised service."}