{"user_rating": 3.5, "review_count": 236, "name": "Hotel Haveli Jodhpur", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Stayed here Dec 06 and paid Rs850. Found it an excellent hotel, friendly staff and very helpful. First place in India to give me a map of the surrounding alleys, sights etc.", "title": "excellent", "helpfulness": 2, "user": "Captain_Caveman", "date": "January 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6551947, "likes": {"liked": "— just a great place to stay", "disliked": "— not much of a view from our room"}}, {"rating": 5.0, "title": "The best hotel so far", "text": "Rooms were spacious and clean. Hot water also.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "April 13, 2005", "id": 3355047}], "location": {"country": "India", "region": "Rajasthan", "continent": "Asia", "city": "Jodhpur"}, "stars": 2.5, "variance": {"poor": 28, "average": 50, "very good": 82, "terrible": 22, "excellent": 54}, "slim_ranking": 0.353846153846, "description": "Hotel Haveli is a heritage Hotel Offering Personalized Services and Attention in detail that makes the Welcome Warm and Stay Unforgettable.The Rooms have attached Bathrooms with Running Hot and Cold Water. The Heritage rooms ,Deluxe and Standard rooms have attached bathrooms with hot and cold shower. Spotlessly clean, traditional rooms have nice and comfortable antique beds. 24 Luxurious rooms, each decorated with an eye for traditional details and historical themes of Rajasthan. Each stay will be memorable because of its serene, soothing and salubrious atmosphere.Hotel Haveli Restaurant ( \"JHAROKHA\"......The Window ) offers ultimate Food and Dinning Services. The Magnificent and Majestic View of the Mehrangarh Fort and the Blue City add to the Appeal of the Hotel. The Environment becomes Live and Entertaining during Nights with exotic food and the lights up on the Fort adds a Romantic Climax. Also the traditional folk dance & musices attracks everybody's interest to spent the evening on the Roof Top Restaurant even to the non boarder guest.FREE entry for EVERY evening.Hotel Haveli Jodhpur has an in house Boutique with a finest collection of handicraft items, traditional jewelery, cloths, hand wooven carpets etc., for its Guests and outside visitors and is known to be called as a \"Boutique Hotel in Jodhpur\" amongst all the foreigner tourists."}