{"user_rating": 4.5, "review_count": 545, "name": "Hotel Violino d'Oro", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Spent 3 days at this hotel in September.. Service- poor and rude. Room- Small and cramped. Staff- smoking on Terrace adjoining ours all day. Breakfast was so crowded everrything get's spilled and so uncomfortable. Internet was broken on arrival and we were told it would be out for the length of our stay.. 3 nights! Go to Venice... it was amazing.. avoid this Hotel!!", "title": "Venice is ridiculous and marvelous!! Skip Hotel Violino d'Oro!", "helpfulness": 2, "user": "jlhrox", "date": "November 2, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 85725524}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The front desk staff was wonderful. They had many great suggestions as far as food and water taxis, ferry schedules. In fact I found them for informative than the local TI. (Also more friendly)", "title": "Excellent Location, Excellent Service, Good Value", "user": "mdiver08", "date": "October 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 84046733}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Hotel is in a good location - next to a canal and relatively close to the water taxi. The staff are polite but not overly friendly. The room was tiny and rather tatty. The dining room was run down and breakfast was mediocre. Reasonable value for money. Numerous restaurants all within walking distance.", "title": "Average hotel in a good location", "user": "susie0607", "date": "October 11, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 82953495}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "From the moment we stepped into the lovely reception area the staff were immediately welcoming & professional, attending to our check-in promptly & efficiently. The room was quite magnificent, on a corner overlooking the little square as well as directly over the Moise Canal. It was like stepping back to the 17th century with chandeliers, brocade window drapes and big comfortable bed. The bathroom was spacious & immaculate, and both room & bathroom were attended to each day. The excitement of sight & sound out of the floor to ceiling windows from the gondola station below could also be effectively blocked out by closing the windows & shutters if you wanted to sleep. Thank you Violino D'Oro and staff - Luca, Romina and Claudie for making our last 3 days in Venice so memorable. We will be back!", "title": "I was transported into the middle of a living theatre.", "user": "Country_girl00", "date": "October 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82912763}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Best Hotel i n Venice, forget the rest. There is a sense of hospitality in this hotel that I did not see in the other hotels we stayed at. Thank you Juanito (owner ) for making us feel at home....Pedro y Damiana (Medico Pediatra de Miami)", "title": "Best kept Secret in Venice !!!!!!!!!!!", "user": "pedrocreimon", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82077097}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "This hotel has good location..its not too far from San Marco water bus stop, and just next to it is the gondola ride..close to shops too...", "title": "good hotel with good location", "user": "v_liany", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77442767}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Apparently the hotel has 2 building so we got the room in the other building bit at the back. Staff was friendly..Pictures in booking.com dont represent our room, or perhaps they only put down pics on the expensive room? Overall its good..though not cheap at all, but then all hotel in Venice are expensive..", "title": "Exceeded expectations", "user": "carlafp", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 74896117}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Recently stayed at the hotel with family and friends. It was recommended by a local who served as our guide for Venice. The staff was helpful and warm, the rooms clean and beautifully decorated (ours was bit tight, but the kids room was large) and breakfast buffet was ample and delicious.", "title": "Great Hotel, great staff, great location", "user": "mookie3", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74516276}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "This is a wonderful hotel. We had requested a room to accommodate a family of 4 (with teens) -- and our room was very spacious and comfortable (including great air conditioning). Just a short walk to St. Mark's square. The breakfast was included, and had lots to offer including lots of fresh fruit, yogurt, breads, and cereal. The hotel was also offering a free water taxi to Murano -- which is a great deal. The staff was very friendly and professional.", "title": "Great location, comfortable, good value.", "user": "homey123", "date": "July 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71710204}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "We stayed 2 nights at this hotel and were very pleased with our choice. Just a few minutes walk to Piazza San Marco so very well located - the same distance from the vaporetto stop. Hotel was clean with good sized rooms and the staff were friendly and helpful. Would definitely stay again and recommend to any one wanting a not too expensive option in Venice.", "title": "Great location and value", "user": "ChiantiSoul", "date": "July 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71272610}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "This was our third stay at the Violino d'Oro and it will probably be our last. The hotel was newly renovated on our first stop. It’s gotten a bit frayed since then. The rooms are small, dark and filled with the heavy damask drapes and stuffed furniture so common to Venice everywhere. Don’t get me wrong, it’s still an ok and relatively reasonable place to stay in the San Marco area of Venice. It’s right across a small canal with gondoliers from the Bauer Grunewald, a very chi chi upper bracket place on the square of the San Moise church. The primary problem is its proximity to the Piazza San Marco. And the gondola station right along side it doesn’t help at all. Truly at one point we had to elbow our way through a Japanese tour group standing three or four deep haggling with the gondoliers for prices on their gondola rides. If you’ve been to Venice more than once, you don’t need that kind of hassle. Better to stay on the Dorsoduro and pick up some tiny slivers of neighborhood life and some peace and quiet but without it feeling dead. I think we’ll return to the Ca Pisani there next time. Hereafter I would recommend the Violino d'Oro only to first time visitors to Venice who want to be near the main tourist attractions and especially the Piazza San Marco.", "title": "Better for first-timers", "user": "FloridaTravelmum", "date": "December 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 90334666}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We chose this hotel after checking out many htls in Venice on the web and we were not disappointed. We stayed fr one night at this htl which was a lovely experience. Fantastic location, St Mark's sq just a few minutes away, opportunity fr window shopping. Breakfast was more or less a CB but quite sufficient. Great staff, clean rooms (in the main building). Over all a great hotel and we will definitely be back....", "title": "Lovely experience", "user": "Siddh123", "date": "December 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90010983}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We booked Hotel Violino D'Oro based on the reviews on TripAdvisor and the great location. Everything was as expected -- great location, small but clean rooms, friendly and helpful staff. We were pleased with our stay and enjoyed the bonus water taxi trip to Murano (included with our stay). Would definitely recommend! One small thing to be aware of -- we stayed in one of the rooms facing the small piazza in front of the hotel where there is also a stop for gondolas. It can get a little noisy -- but with the window closed it was ok.", "title": "Great location, perfect for a couple of nights", "user": "jessieclaire", "date": "November 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 87819668}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Perfect location BUT never accept the annex : no lift but steep and narrow stairs, One could hear the phone conversations in the next room ...and the sex in the room near my children'room who learned a lot ! The girl at the reception also lied when affirming that I asked for the annex when I told her that I didn't like my room.", "title": "only quality:location", "helpfulness": 5, "user": "pasquier2", "date": "November 13, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 86945445}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "It rained and we had to walk every time to our room getting soaked . They called our floor a first floor: in front of the roof across the very narrow street.The breakfast room is really small with 2 people tables and very ordinary choice.My \" double room\" for one person didn't include a seat even a chair.I hated every minute of those five days.", "title": "PERFECT LOCATION in Venice", "user": "01Boomer", "date": "November 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 85981502}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Violino d'oro is a excellent hotel for a quick stay in Venice (or even an extended stay)... The location could not be better (just 100 yards or so to the Piazza San Marco) - the staff is friendly and the rooms are very nice. The complimentary breakfast is beyond compare and the surroundings are quintessentially Venetian. I would recommend this to anyone who is looking for a relaxed, comfortable stay in Venice.", "title": "Excellent Hotel in an Excellent Location", "helpfulness": 1, "user": "adecicco", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66617032}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "Perfectly located and easy walking distance to all the major spots. Breakfast was the stock standard fare. I had a single room which was next to an outdoor area so didnt have a particularly good nights sleep as some guests decieded to have an improptu smoke and drinks session. Not good when all you really want to do is sleep! Nevertheless the room was clean, and comfortably furnished. Service could of been a little better as well - not sure if it was lacking due to the number of guests.", "title": "Top location", "helpfulness": 2, "user": "AussieDaydreamer", "date": "May 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 65501628}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This hotel is a perfect location in Venice. Venice is small, so we even walked to Rialto from this location, but you mainly want to be in this area so you can't beat this hotel at this price. We are not budget travelers, but we aren't luxury travelers either. We also don't use the hotel for much other than sleeping, so I don't need a super fancy room. Our room was adequate. Maybe a little on the small side, but still, perfect for sleeping. Our room looked out onto the little square in front. It got a little noisy at times, but the windows are great and we slept fine with no disturbance once we closed it. The bathroom was a bit small. Not that much of a problem until we used the shower. Couldn't do much but stand in the shower. But we were only there for three nights, so it didn't bother me much (and I take quick showers anyway).", "title": "Location, value and staff are top notch here", "helpfulness": 2, "user": "CitBree", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65386225}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "The breakfast was GREAT. You can eat a big meal here in the morning to fuel you for the day. Fruit, cereal, croissants, breads, meats, cheeses, yogurts. I wish you could take some with you as you'd surely save money on snacks with all they provide. Also, the staff let us get some stuff at 5am though they don't technically open for breakfast until 7am.", "title": "Welcoming, clean, relaxed atmosphere - perfect!", "user": "MinnoDorset", "date": "May 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 64923492}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Speaking of the staff, they were GREAT. Never once did we experience anyone here that were rude to us for not speaking Italian too well or asking dumb questions (which we certainly did). These people know what customer service is about.", "title": "Worthy of it Praises", "user": "vaudeville", "date": "April 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60672830}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 12, "average": 39, "very good": 216, "terrible": 4, "excellent": 274}, "aka": "Hotel Violino d Oro", "slim_ranking": 0.165354330709, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}