{"user_rating": 3.0, "review_count": 471, "name": "Hotel Metropolis", "reviews": [{"rating": 2.0, "title": "very misleading!", "text": "Self-described as a boutique/personality hotel - \"a place where you will feel like you entered paradise\" ... Actually you might after just walking in from one of the worst areas of San Francisco: Tenderloin! But who would know after reading the description of their \"perfect and centric location\". The hotel is surrounded by homeless people and drug addicts. Sirens go by continuously. Hard to sleep. You feel unsafe even getting to your room. Also there were no security guards to be found at the entrance nor lobby (a must in a place like this).", "helpfulness": 7, "user": "A TripAdvisor user", "date": "May 12, 2005", "id": 3468150}, {"rating": 3.0, "title": "Just stay in the Midwest...", "text": "I'm quite surprised at the reviews.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 9, 2005", "id": 3890861}, {"rating": 4.0, "title": "PLEASE - DO NOT WORRY! HOTEL IS FINE!", "text": "Yes, the location could be better. But the hotel is located in a very urban city. If you're \"shocked\" by the location, then you're not suited for San Francisco at all. Their motto \"Left is Right\" is in fact correct. One block to the left and you're in the middle of Union Square. The hotel is also located right next to a BART/MUNI station.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 17, 2005", "id": 3781846}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "The staff was excellent. There were a few problems (credit card, dirty room, check-out time) but they were very polite in clearing those up. Every staff member was just great.", "title": "what a mistake", "helpfulness": 2, "user": "runnergirl78", "date": "August 10, 2005", "detail_rating": {"cleanliness": 3.0, "rooms": 3.0, "service": 1.0}, "id": 3752163}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "The bottom line is, the hotel is good for the money. It is right next to Union Square, the design is unoffensive, and the staff is more than helpful. I paid around $99/night and felt the price was right. I doubt anyone could find a better hotel in the city for that. Next time I'll just pay for a more upscale hotel, but I don't regret staying at the Metropolis.", "title": "not a bad base... but it could be better!", "helpfulness": 3, "user": "Dr_Ed", "date": "July 21, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3690591}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "If a few homeless people scare you, just stay in Hicksville.", "title": "Extremely misleading hotel information!!!", "helpfulness": 3, "user": "R.CityWestRoyale", "date": "July 11, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3657157}, {"rating": 3.0, "title": "Pleasant, but noisy", "text": "We spent 3 nights at metropolis Hotel. It's a good location (near Union Square) to visit San Francisco. The service was friendly : we had free internet, free coffee in the morning, and free californian wine at the end of the afternoon. The room was clean but noisy and the window didn't close very well. That's right there were many homeless people in this street, but we did not feel unsafe. No problem if you come back to the hotel before the night.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 15, 2005", "id": 4024448}, {"rating": 1.0, "title": "Worst Hotel I've ever stayed in", "text": "I didn't book this hotel but did one of their \"sister\" hotels. The hotel I booked over-booked and moved me to Metropolis. What a nightmare! I had a corner room Mason and Turk and listened to people yelling all night and heaven forebid if I looked out the window after 5 PM. The view was homeless after homeless urinating on the building across the street. No wonder the sidewalks were wet in the AM they had to hose them off every morning from all the urine. Not only will I never stay here again I will never book a room with Personality Hotels. Staff was very nice and helpful, hotel was a dive.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 1, 2005", "id": 3982425}, {"rating": 2.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "I read some of the other reviews for Metropolis and I would say they are generally accurate. I do strongly disagree with those who say the staff is unfriendly. I've been here four days, and each time I enter or exit the building, someone says hello and smiles. Even the cleaning staff is friendly and helpful. Maybe the staff was nasty some time ago, but it simply is not the case today.", "title": "Bums everywhere-but a good location and nice staff", "helpfulness": 4, "user": "mypitboss", "date": "September 29, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 5.0}, "id": 3947700}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "That said, there are some problems I had with this hotel:", "title": "Great Hotel - very nice rooms - would stay again", "helpfulness": 4, "user": "wrejennywren", "date": "September 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3924532}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "-BUMS EVERYWHERE. The entry to the hotel opens up to a street with the highest concentration of bums I have ever seen in San Francisco. And these aren't your typical \"gimme a quarter\" bums. These are the nasty, insane, yelling kooks. Of course, it's only a very short walk to the much safer Market Street. However, make a wrong turn at night on Turk Street (the actual street the hotel entrance is on--it is not on Mason), and you will have, at best, a scary experience. That probably won't happen, though, as they seem to have a doorman out there at night to keep you from doing just that.", "title": "Spend more and go North", "helpfulness": 1, "user": "SGHRET", "date": "September 19, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 2.0}, "id": 3914840}, {"rating": 1.0, "stay_parameters": "Stayed February 2006", "text": "First of all, let me start off by saying WOW. Me and a couple friends stayed here during Feb, and we were all excited. Our hopes of a fun time came crashing down as we saw the Hotel. At first we thought we had made a mistake, because the website gives you the feeling that this is a real nice clean hotel. It is the biggest front i have ever seen. This hotel is in the most wretched location ever possible. I come from Los Angeles and thought our Homeless problems were bad until i looked outside my broken window. During my 2 nights stay, i think i saw about 2 bums getting arrested at different times, and some guys getting in a fight. Plus the staff may \"SEEM\" friendly, but they forget everything you say the moment after you say it. I had SPECIFICALLY REQUESTED that all bills be paid in cash and he ENSURED me that NOTHING will be charged and gave me a nice fake smile. Then when i check out Sunday morning,he hands me a receipt to what had been charged on to the card. Needless to say I hope this hotel runs out of business, because they are nothing but scam artists charging us for such poor rooms.", "title": "Wow.. They really fooled me.. RUN AWAY !", "helpfulness": 4, "user": "kohrientrips", "date": "March 20, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4694832}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "This hotel's front entrance is on Turk St., not Mason. For those of you from out of town, the Tenderloin area of San Francisco is where the drugies, wino's and homeless congregate. This hotel is located at the beginning of that section. My wife and I stayed there Friday and Saturday night. Our room on the fifth floor faced Mason St. This hotel has no regular fire exit and our room was the designated exit for our floor. All the rooms on our floor had cards to get into the room, ours had a key. If the fire alarm went off the lock would automaticly unlock and people would use our room as the fire escape exit. The room had no regular heater. but we were supplied with a small portible heater. The noise from outside kept me up until 1AM, it was quiter Saturday night. The only good thing about the room was the bathtub which was very deep. The toilet was right against the wall and your legs bumped the tp. My wife and myself are both left handed and there was absolutly no room.", "title": "Tenderloin Hotel", "helpfulness": 3, "user": "bar20", "date": "March 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 4604206}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Even though the price was cheap for a SF hotel,", "title": "Good value for money", "helpfulness": 3, "user": "docajenk", "date": "March 11, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4600193}, {"rating": 2.0, "title": "LIVE AT THE 7-11!", "text": "I would not stay there ever again.", "helpfulness": 3, "user": "DarlynPearl", "date": "January 13, 2006", "id": 4351680}, {"rating": 1.0, "title": "Crack Hotel!", "text": "We stayed here for one night and found it to be good value for money. The hotel is not located in a particularly nice area, but the centre of town is 2 minutes walk. Hotel staff were very friendly and helpful. We changed the room due the first room being very small, the secret is to ask for a room with two beds and these are a good size and the beds are both doubles. Also ask for a high floor out the back of the hotel and you will hear very little noise. Rooms are comfortable and have been recently refurbished. Free wine reception on Fridays and Saturdays, worth going.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "December 27, 2005", "id": 4305425}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 2.5, "variance": {"poor": 68, "average": 119, "very good": 154, "terrible": 64, "excellent": 66}, "aka": "Metropolis Hotel San Francisco", "slim_ranking": 0.651063829787, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 3.0}, "description": "Hotel Metropolis embodies the quintessential urban hotel experience and offers a unique perspective on the grit and beauty of city life. This non-smoking boutique hotel features 105-rooms among ten stories of a historical building located in the heart of downtown San Francisco.The convenient location provides quick access to many of San Francisco's top attractions and destinations. The hotel is located just one-block from Westfield San Francisco Shopping Centre and Cable Cars that will take you to Fisherman's Wharf and Pier 39. Three blocks away are Union Square and Moscone Convention Center. The Hotel Metropolis is well suited for vacationers, families, convention goers and business travelers alike."}