{"user_rating": 5.0, "review_count": 1781, "name": "Hotel ICON", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Having just arrived from the Hyatt regency in Sha Tin, the staff at the Icon were fantastic to begin with. My wife checked in whilst I was at a pub watching the rugby. When I arrived to greet my wife at the lobby, all staff were so fantastically pleasant it really just made my afternoon. That's not where the surprises needed either.", "title": "Impressive to say the least", "helpfulness": 1, "user": "Fernando B", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167450466}, {"rating": 5.0, "title": "Simply perfect!", "text": "The hotel is beautifully designed. Being an architect, i can appreciate the feel of a great quality hotel and this was definitely one of them. The frameless view at the end of the corridor when approaching your room was a sneak preview of what was to come. Although the room is smallish, the layout and setup is superb. The bed is positioned with full view of this spectacular harbour which glistens with neon lights in the night, and settles amongst mountainsides in the day. Wow. The tv is positioned perfectly for a layback with a number of channels from around the world (including the afl!). The bathroom is beautifully designed with a great looking sink bowl and sharp fittings. The bath has a flat glass panel tv for relaxing with a glass of wine and some sport. Lets not forget the free mini bar either!", "user": "Cunelot", "date": "July 13, 2013", "id": 167420465}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This place is a must for anyone looking for a fresh vibe in the city. Its cool, beautiful and plush. Definitely will be back in our travels sometime.", "title": "Great hotel, busy area, lovely rooms and amazing pool", "user": "Ifigenia D", "date": "July 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167404923}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Nice modern and design atmosphere and ambience, people always smiling and friendly. The hotel is in a very good position for Kowloon visiting and shopping. Perhaps the restaurant's menu is not very rich but anyway good. Fitness room and swimming pool wanderful! I recommend it ! Andrea", "title": "From delight to disappointment", "helpfulness": 4, "user": "J-Tita", "date": "July 13, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 167384676}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I spent 2 nights in june and i absolutely loved it. i had a room with a harbour view. you just cant get enough! very clean with modern furniture. the bed was awesome, the bathroom very modern with great products. room service was excellent, fast check in and check out, people always smilling and willing to help you. i have chosen it because of the ranking in Trip advisor and i was very happy with my choice. highly reccomend it!", "title": "Very good- full stop", "user": "Kevin O", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167343599}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I will not regret the choice I made for hotel ICON, it is an amazing experience. It starts with the flawless free shuttle bus from Kowloon train station to the hotel and the very friendly and personal assistance at check in. The hotel is very tastefully decorated, the rooms are not large but very uselful and have great walk in bathroom with beautiful mirror-TV's in the bath area, fantastic. There is a vert stylish outdoor pool overlooking HK harbour and the HK skyline, too bad is was only open until 21:30....", "title": "Excellent choice. Everything flawless", "user": "tjp1994", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168405794}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Reception downstairs is rather crowdy so I suggest you pay a bit extra for the Club room, so you can use the topfloor bar and lounge area with free drinks. And yes, the mini bar in the room is free", "title": "A memorable stay with 5-star service", "helpfulness": 1, "user": "Alan S", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168403952}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "A gem of a hotel in Kowloon. Many of the staff are being trained in hospitality, and the service is impeccable. From the modern, comfortable room design to the first-rate service to the extra touches (complimentary mini-bar, frequent shuttles to the MTR), my stay at the Icon was so enjoyable, I extended from 7 nights to 11 nights. Top-notch restaurants and bars - especially Above and Beyond with a stunning view of the HK harbor. Everything you want for an enjoyable, memorable hotel stay - special thanks to the most helpful and genuinely friendly staff, from the knowledgeable concierge staff, to the accommodating front desk staff, to the thorough and friendly housekeeping. Highly recommended - you won't be disappointed.", "title": "Faultless", "user": "DKLMHOwens", "date": "July 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168243688}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "We are on our final day of a six day stay at the Hotel Icon . As a family of 5 with three teens in tow we splashed out and had a club 65 suite and adjoining room and would highly recommend it .", "title": "Great in all ways, but 4,6 and not 5.", "helpfulness": 1, "user": "Z-brox", "date": "July 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168129176}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Everything from the seamless check in to the thoughtful and inspiring design of the rooms was wonderful . The most", "title": "impressive stay", "helpfulness": 1, "user": "vtlmp", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167804029}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "stayed with my spouse. admired the design both in room and in lobby and pool area. location average. i would recommend it for couples and businessmen rather than families. a little overpriced. but still worth it.", "title": "state of the art design - breathtaking", "helpfulness": 2, "user": "yakir1", "date": "July 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 167781410}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "As I choose my hotels from trip advisor reviews, I thought it was only fair to write one. I am a fussy customer so for me to give it a 5*, really does say something. This hotel is NEW, clean and modern. The rooms are well fit out and the rain shower is simply devine! We stayed in the harbour view and worth the extra $. The stand out has to be the amazing breakfast. It had its own bakery, deli, asian stand, omelette stand etc etc,.Too much to eat really. The cafe downstairs is great for both a quick coffee and/or lunch. Just loved the pasta and european influence. I didnt expect this in Hong Kong and I was pleasantly surprised.", "title": "A+ in every way", "helpfulness": 1, "user": "Vicki S", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167610456}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The concierge was fantastic!!!! Great staff always willing to help. Organised taxi/interpreter for us at short notice. You can even get an express visa to china if not pre-organised, provided you pay the fee and are happy for them to take your visa for a day. We ordered the car service to pick us up from the airport, but we didnt realise you needed to go to a booth and that it costs extra to have someone wait for you upon exiting. This was a tad annoying but next time recommend you pay extra to organise this (desk not that far but for first timers, suggest pay the extra). Upon arrival to check in at the hotel, we were greeted and taken directly up to our room to check in. We didnt expect this, but everything was explained and our questions were even followed up the following morning with a map and directions.", "title": "Me and my son loved it", "user": "OneWorldAtTheTime", "date": "July 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167591622}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Easy to get to hotel in a taxi, however always good to ask for the taxi driver to take you through the new tunnel that costs HK$50 for toll but worth it (as compared to HK$20 for old tunnel that gets busy). Beware if you are on HK side it is virtually impossible to get a cab to the Kowloon side (Hotel icon is on Kowloon side). Taxi drivers pretend they dont speak english and make excuses around 4ish, and it may take 6-7 cabs to get you to where you want to go. They are not even persuaded with extra tips.", "title": "Spacious room in Hong Kong", "helpfulness": 1, "user": "ahju", "date": "July 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167513016}, {"rating": 5.0, "title": "great hotel with nice, professional staff", "text": "Would stay there again. Great experience", "user": "lisach", "date": "July 13, 2013", "id": 167458497}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I was part of a group of ten attending the annual partners meeting for our network. It was partly business and largely social. Needed a place to relax, let some refreshing stay help us discover new ideas and bring about change. Icon, provided the perfect background, with a comfortable stay, excellent hospitality and more importantly, their concern and equal treatment to each member of our large business leader group was truly a learning and cherishing experience. Each member of the staff was great and the Angsana just adds to the surprise it created for us.", "title": "ICON: truly stands out to its name", "helpfulness": 1, "user": "srarun", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167304426}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Earlier stays of mine in hotels of Hong Kong for business proved extremely cold, but this one is good for business, eating in TSS and also business on the Wan Chai. Truly stand testimony to its name, an ICON in HK.", "title": "Brilliant", "user": "Pedroorange", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167302434}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "OK, so it was the end of our honeymoon and they treated us well..... but Hotel ICON was great.", "title": "excellent hotel", "user": "Mike271955", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 167298189}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "We stayed 5 nights in an ICON38 room - the layout was excellent with a big bed presiding over an expansive view of Hong Kong harbour. Free minibar (replenished daily) and more slippers and toiletries than you can poke a stick at.", "title": "Very hi-tech", "helpfulness": 1, "user": "842Anne", "date": "July 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 167265421}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The hotel location is not the most central in Kowloon but is not even 5 minutes walk from the station, and there is a free shuttle into Kowloon centre.", "title": "Amazing quality hotel with friendly efficient service", "user": "Parks190k", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167205223}], "location": {"country": "China", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 10, "average": 39, "very good": 253, "terrible": 8, "excellent": 1471}, "aka": "Hotel ICON Hong Kong", "slim_ranking": 0.0054347826087, "description": "A hotel unlike any other. Welcome to a different world. Hotel ICON is a unique hotel designed by celebrated architects Terence Conran, Rocco Yim and William Lim. Breathtaking open public spaces, a striking vertical garden by Patrick Blanc, a grand sweeping staircase, innovative guest rooms and three vibrant dining spaces radiate contemporary style. We offer our guests traditional Asian hospitality, with all its courteous and attentive qualities – but in a refreshingly modern, stylish and international environment."}