{"user_rating": 4.0, "review_count": 184, "name": "Hotel Melia Ponce", "reviews": [{"rating": 3.0, "title": "Maj Oscar Palermo -- US Army", "text": "I always stay at this hotel. I was borned in Ponce 40 years ago. The hotel management is great.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 22, 2005", "id": 4044047}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "Right on the main square. Room was a bit cramped, which was not helped by the fact that the bathroom door swung into the bedroom towards the bed. Still, a decent value considering the location, charming old-world ambiance and free internet.", "title": "Can't beat the location", "helpfulness": 1, "user": "lunettes_noires", "date": "January 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4354168}, {"rating": 5.0, "title": "pleasant melia hotel on the square", "text": "ponce is an old town about 75 miles and a 90 minute drive from san juan, with several tolls. it has many art nouveau and art deco buildings and homes, some of which are in the process of being restored. there is a lovely art museum with a small but excellent european collection, including a pre-raphealite room, and currently an excellent frida kahlo exhibit that travelled from moma in nyc, an excellent history museum and adjacent music museum in art nouveau style,etc--take the guided english, free tours.", "helpfulness": 2, "user": "artnuvo", "date": "December 31, 2005", "id": 4313413}, {"rating": 5.0, "title": "Wonderful staff", "text": "we stayed for two nights at the melia hotel on and off the plaza-family owned for a century, with the \"newer\" pre-(1960's added rooms) in better shape than some of the the other rooms. the double bedded rooms in the newer section which face the inner courtyard are the equivalent of a 2 star hotel-clean, basic, air conditioned decent sleepable beds, and a small bathroom. the staff and the front desk are very pleasant, friendly, and helpful. marks at the melia is a well-known 4 star restaurant on the island. the melia has a small pool which makes you fell like you are continents aw ay and not in a charming city.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 19, 2005", "id": 4251584}, {"rating": 4.0, "title": "A very reasonable place to stay in Ponce", "text": "if modern is your desire, 4-5 miles out of the city and a 15 minute drive to the city, are the hilton or holiday inn which could be in anywhere usa.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 2, 2005", "id": 4158868}, {"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "good traditional criollo and other food is in easy walking distance on isabel street-including don juan lunch buffet for $5, acafe topmpy for inepensive criollo fare, portos, a nautical design interio with pasta, a grill, and excellent pizza with a semi-baked mozarrella topping and shrimp (very large and good for 2 at $15), vegetables, etc, el rincon for argnetine/steak and other food, very large portions at $18-23 entrees, and fusion which we did not eat at but is on the order of el rincon in price. the wonderful chef's creation is 2 blocks from the square with lunchtime 3-course meals at $6, including a soda.", "title": "great location", "helpfulness": 3, "user": "big0wolf", "date": "November 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4123323}], "location": {"country": "Caribbean", "city": "Ponce"}, "variance": {"poor": 17, "average": 32, "very good": 76, "terrible": 8, "excellent": 51}, "aka": "Melia Hotel Ponce", "slim_ranking": 0.428571428571, "description": "At the heart of the City. The Hotel Meliá is an iconic landmark of timeless elegance and ageless beauty located at the vital center of Ponce Historical District. Surrounded by a vibrant and diverse ecosystem of: museums, monuments, shops, restaurants, cafes and art galleries, the Historical District is an extension of the Meliá urban experience.While we embrace our heritage, the Hotel Meliá offers modern amenities such as air conditioning, cable TV and wireless internet access in our rooms. Pool, bistro and business center in the hotel. Conference rooms and venues available for rent, pets welcomed."}