{"user_rating": 3.5, "review_count": 75, "name": "Hotel Salak The Heritage", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled solo", "text": "Not expecting to book into an 'upper class' hotel, when I arrived in Bogor, this was recommended to me. I am glad I listened to that advice. The hotel is just opposite from the gardens, although the gated entrance was a far cry from there (unless I missed one of the gates). The staff on reception were a little bemused to see an unwashed, unshaved, sweaty, dusty traveller grace their presence in such a beautiful hotel, but the price was right. Not cheap, but not expensive. Unfortunatley, there was either a wedding or a photo shoot in progress that day, so I didn't use the pool. Really quite liked the room. Internet room was a box of a room, with old computers, but staff were helpful. Travel agent on site couldn't really answer any questions I had, but tried to help. Overally a nice place in a good location.", "title": "Lovely location", "helpfulness": 1, "user": "wanderingbedu", "date": "February 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13440276, "likes": {"liked": "— The comfort", "disliked": "— The hassle of getting there from Jakarta"}}, {"rating": 2.0, "title": "Great building but could improve.", "text": "This is the Raffles of Bogor. Lovely building frontage. Stayed three nights there. The first night had a room in the old wing and the toilet couldn't flush. Then got moved the next night to the wing behind and rooms were comfortable but clean. The breakfast was quite poor for a hotel this day and age. It wasn't asian nor european so could have improved on that.", "user": "gabchong", "date": "November 29, 2007", "id": 11135541}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This hotel retains some of its Dutch colonial style and is right across from the presidential palace and the botanical gardens (Bogor's main attractions).", "title": "Colonial Style", "helpfulness": 4, "user": "Raymond W", "date": "August 12, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 5602596, "likes": {"liked": "— The location and colonial syle", "disliked": "— The breakfast"}}, {"rating": 3.0, "title": "OK", "text": "On our visit we were pleasently suprised by both the room and the hotel in general. The rooms are large and have everything you could need and the garden courtyard has a good size (but chilly) pool.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 11, 2005", "id": 4006259}], "location": {"country": "Indonesia", "region": "Java", "continent": "Asia"}, "variance": {"poor": 2, "average": 18, "very good": 32, "terrible": 5, "excellent": 18}, "aka": "Salak The Heritage Bogor", "slim_ranking": 0.129032258065, "description": "Welcome to Hotel Salak The Heritage. Hotel Salak The Heritage is the most ideal place for business meetings or conventions. It is located in the heart of Bogor City, in front of Bogor Presidential Palace and few steps from Botanical Garden, culinary and tourist attractions, and it only takes 5 minutes from Jagorawi exit toll gates and CBD area. The hotel is also a pleasant place for families who want to spend their holiday in Bogor or in its surrounding highland areas.The hotel was built in 1856 during the Dutch colonial era with the name of Bellevue Dibbets. In September 1998, the hotel was refurbished and reopened with modern colonial style featuring 120 luxurious rooms and 12 exclusive meeting rooms. The hotel is completed with modern facilities such as Free Wifi, Room Internet Access, Internet Corner, Online Travel, Online Shopping, Air Conditioner, Hot water, and others."}