{"user_rating": 4.0, "review_count": 63, "name": "Hotel Petit", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We only stayed two nights here, I wish it had been longer! The owners of this hotel are quite pleasant and they seem genuinely interested in your happiness. We were in room 153, my husband, myself and our 3 year old. There was a pullout sofa, but our son ended up sleeping between us in the bed, and it worked out. The room was clean. The area was great, we could walk all over Skagen, to the beach, to town, and the harbor. The breakfast offered at Hotel Petit was very good. Many choices. A lot of teas to choose from, bagged and loose leaf. Fresh fruit. Cereal and cold cuts and yogurt, breads, like I said lots to choose from. I loved the town of Skagen, lots of shops to see and the harbor was pretty with lots of restaurants to choose from. I hope we can return to Skagen some day and spend more time there.", "title": "Skagen visit", "user": "lola72", "date": "September 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177451487}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I had booked a triple room, assuming it would be a good-sized room. It was VERY small, to the extent that my mom, daughter and I had limited area to open and especially store luggage.", "title": "Small room, but a pleasant visit", "user": "OutofLuck", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 175013491}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The staff was great, the breakfast was superb and the location was perfect - a few blocks to the museum on one side and a few blocks to dining on the other.", "title": "As expected from reviews Tripadvisor", "user": "Lizzy264", "date": "August 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170446342}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Very good location near everything, clean and nice hotel. Fresh and good breakfast. Nice staff/Family, belive it is important where you get your room, we had our room in the 1st floor with a veranda, some noise from streets outside, but not a problem. No parking was available when arriving, we had to park the car near by, 2-3 minutes walk.", "title": "Lovely Danish Hotel", "user": "JRPATTE", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141191006}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "A perfect location near the train station and centrally located to explore all of Skagen. The hotel was very clean and the beds very comfortable. We stayed in a triple room in the main section of the hotel for two nights. The breakfast offered a wide range of hot and cold items, with plenty of fresh fruit.", "title": "Nice hotel with good location in the city center", "user": "samuul", "date": "July 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135751762}], "location": {"country": "Denmark", "region": "Jutland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 4, "average": 14, "very good": 26, "terrible": 0, "excellent": 19}, "aka": "Petit Hotel Skagen", "slim_ranking": 0.5, "description": "Hotel Petit is a cozy family owned hotel, located in the center of Skagen and with private parking (at charge). All rooms are newly refurbished in 2007 and 2008 taking inspiration by the sea, the sky and the light of Skagen. The rooms feature a bathroom with shower and color TV with international channels. Free wireless Internet access in the rooms and public areas. The whole hotel is no smoking."}