{"user_rating": 4.0, "review_count": 178, "name": "Hotel U Capu Biancu", "reviews": [{"rating": 5.0, "title": "simply stunning", "text": "Frankly this hotel is amazing. The negative reviews of this hotel neglect to mention some very important points. The view from the hotel is absolutely breathtaking, the food is superb , the staff are friendly and courteous and the private beach is great . Also, our room was beautifully decorated . The road to the hotel can be a bit daunting, but most of the roads in corsica are like this, as the island seems unspoilt by tourism (and I hope will stay that way). Capu biancu is a slice of heaven and I would thouroughly reccommend it", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 3, 2005", "id": 3631486}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "We just returned from Corsica, and I am reading the latest review on Hotel Capu Biancu. Yes, I agree with these people from Great Britain. It is a shame to have given 4 stars to such a place. We arrived there late in the afternoon with the intention of staying a few days and left before dinner time. Peeling paint on the doors, distastefull decoration, awful smells, small rooms, the place was so unattractive. The \"road\" to arrive there is a challenging trail for four wheel drive vehicules, and to make a long story short, there is absolutely nothing positive to say about this hotel.", "title": "Hotel Capu Biancu : Awful, don't go there", "helpfulness": 14, "user": "vajrasattva", "date": "June 15, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3558267}, {"rating": 1.0, "title": "Don't go there", "text": "When we first found the website for this 4 star hotel near Bonifacio in Southern Corsica we thought it would be the perfect place to stay for a few days. The first problem was the road to get there, when you book they don't mention the fact that the hotel is situated off unmade roads. In fact the last 5km is all unmade or partially made roads and it takes approx 20mins to traverse this section, with the largest pot-holes we have ever seen. Maybe okay in a taxi but not you own car or a hire car!", "helpfulness": 31, "user": "A TripAdvisor user", "date": "June 7, 2005", "id": 3535482}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Having read all the reviews on the U Capu Biancu Hotel I wondered what to expect. I have to say I have been left with the view that Tripadvisor generally exists for people who want a moan. The hotel is superb, the drive down through the maquis( yes, part of the road is unmade but only about 25% of the length) makes a really nice approach to the hotel. On arrival at the reception we were shown around all the facilities with everything explained whilst in the meantime our baggage was taken from our car and put in to our bedroom. The view from our balcony was across the bay and although the room could be classed as small by US standards by european standards it is good. The whole hotel has been designed with the idea of totally relaxing you. The restaurant has both an outdoor and indoor area and you can choose where you would like to eat. We had half board which meant there was a limited choice two starters,two main ( one meat,one fish ) and two desserts. The variety is good though and the quality of food first class. The A la carte menu is expensive as is the food in the beach restaurant but well worth it The swimming pool is a real bonus with lots of imagination gone in to the design, with a good number of sun loungers. The private beach is a little disappointing as Corsica has some great white sandy beaches, unfortunately the hotel beach is a made up of shingle but once in the water it is great for snorkeling with lots of fish swimming around. The hotel offers a boat service (at a small cost) to take you inaccessible beaches. There ia a great white sandy beach just around the next headland north of the hotel.The hotel staff were excellent, all could speak English, which given my level of French was good, were friendly and attentive. The hotel is expensive but as with most things you get what you pay for and all the guests I spoke to thought the hotel was exceptional so forget the bank balance anf go ahead and spoil yourself.", "title": "A real oasis", "user": "Tyke69", "date": "July 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8130318, "likes": {"liked": "— The location and the relaxed atmosphere", "disliked": "— The shingle beach"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "PS you even get a bath robe", "title": "Beautiful Rustic Retreat", "helpfulness": 7, "user": "Arabella35", "date": "August 21, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 5630773, "likes": {"liked": "— Well Decorated & Comfortable - Very Rustic!", "disliked": "— The price!"}}, {"rating": 2.0, "title": "Booking problems", "text": "Having read the few mixed reviews on this hotel I was actually dreading turning up for our week's stay at the beginning of August and was beginning to wonder whether the fabulous website was a case of artisitic license - this is not the case - it's a really lovely hotel.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "April 18, 2006", "id": 4986290}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "We were prepared for the dirt-track road (11 mins in a small hire car, not the 20 mins previously recorded) and the reports are correct, it's very pot-holey, but I also agree that this is part of the charm of the place. On arrival I was a bit concerned about some building which appeared to be taking place to the left of the hotel but this was the last we saw/heard of it. Our check-in was efficient and friendly - most of the staff speak excellent English although we did try to speak in French as much as possible - and after a welcome cocktail in the bar, we were taken to our room. We had booked the least expensive room type with a maquis view so weren't expecting much but were delighted with our room. Decorated in a modern mediterranean style, it was small but comfortable enough for two people (and we did have a bit of a sea-view from our balcony).", "title": "4 star hotel with 3 star hotel service - do not go there", "helpfulness": 17, "user": "Globby", "date": "November 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4147833}, {"rating": 5.0, "title": "Boutique.", "text": "For sunbathing, you can either go to the stunning pool which overlooks the coast or down to the beach (about 2 mins down a steep-ish slope). The loungers by the pool are a little more comfortable than on the beach, but with the clearest sea I have seen in years in the med, it's hard not to spend all your time down there. Yes, the beach is pebbly and makes for a rather undignified entrance into the sea, but it's worth it!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "September 19, 2005", "id": 3914927}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We've just returned from our honeymoon in Corsica the latter part of which included a 4 day stay at the Capu Biancu. Due to the massive disappointment of the experience I feel compelled to pass on my thoughts.", "title": "Rip off - Avoid!", "helpfulness": 7, "user": "Dom-n-Lin", "date": "September 22, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 20289079, "likes": {"liked": "— In most cases, the staff were friendly", "disliked": "— The exhorbitant prices of absolutely everything"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Firstly, the good points: The hotel has a nice pool, good lobby and the staff were, in the main, quite friendly.", "title": "Isolated!", "helpfulness": 2, "user": "Paulrud", "date": "September 22, 2008", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 20285868, "likes": {"liked": "— The view out from the bar and the waiting staff where nice", "disliked": "— Everything in between"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Now onto the bad points:", "title": "Modern, Magnificent, Majestic", "helpfulness": 1, "user": "StanleyIreland", "date": "August 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18709051, "likes": {"liked": "— Views", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007", "text": "Our room was small, poorly decorated (like a TV makeover attempt at an authentic seaside scene) and in a bad state of repair - the paintwork and tiles were chipped, the shower head was wobbly, plus the hairdryer was poor, there was no full length mirror and there were only about half of the available TV channels working on the TV. The phone had been ripped out of the wall by a previous guest which took 2 days for the hotel to fix.", "title": "stunning location, dreadful hotel", "helpfulness": 3, "user": "Tmanx", "date": "April 18, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 15117503}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "In addition, the toiletries in the room were fairly sparse (just shampoo/gel and soap) which were not replenished when they ran out.", "title": "go for the location", "user": "Christine053", "date": "September 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8607353, "likes": {"liked": "— location and quiet", "disliked": "— lack of vegetarian menu"}}], "location": {"country": "France", "continent": "Europe"}, "stars": 4.5, "variance": {"poor": 9, "average": 15, "very good": 44, "terrible": 14, "excellent": 96}, "aka": "u Capu Biancu Corsica", "slim_ranking": 0.208333333333, "description": "Nestling at the water’s edge, at the end of a small 1.2 km earth track on the north bank of the Gulf of Santa Manza, facing the rising run."}