{"user_rating": 3.0, "review_count": 70, "name": "Hotel Lido", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "At the end of a few months in Europe I stayed at Hotel Lido. I thoroughly reviewed all the hotels I stayed at in Europe on TripAdvisor and all were excellent except for this one. The location is good enough; Geneva is a small town, easily walkable and this hotel is near the train station and you can walk to the other side of the city in about 5-10 minutes. Geneva is relatively clean and feels safe so I didn't have any concerns with the neighborhood, although I saw cuter areas as I walked throughout the city. The receptionists were helpful and spoke English well. However, the hotel rooms are very rundown and feel pretty dirty. They are small with tiny bathrooms with old fixtures. My room did have a cable TV w/ remote. I had a small twin bed. The hotel did offer a continental breakfast which was stale and not appealing at all. I paid about $127 and think this is WAY too much to pay for such a rundown hotel room.", "title": "Really run-down hotel", "helpfulness": 5, "user": "lolomojo", "date": "May 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 7721595, "likes": {"liked": "— Geneva is a small town so the hotel is within walking distance to most sights", "disliked": "— The rooms were small and rundown."}}, {"rating": 4.0, "title": "Good for the money", "text": "The hotel is centrally located. The rooms are clean and quiet. Stayed there twice after skiing in France, on the way home to the US, and was able to get some good rest. Everything there is to see in Geneva is within a 20-30 minute walk. Dont expect luxury, but a hundred twenty bucks for a triple room is not bad for for a central location in Switerland.", "helpfulness": 7, "user": "Ski-in-out", "date": "February 22, 2007", "id": 6828480}, {"rating": 3.0, "title": "Excellent value for money - Great location", "text": "Considering how expensive Geneva is and having searched the web for something within my budget I was extremely happy with my choice - Its basic, but clean and good and helpful staff. The location is perfect - close to the train station, buses, trams and just a short walk from the Lake. Round the corner from the great Café de Paris. The other big plus was that the hotel gave me a free public transport pass for the duration of my stay - a great saving.", "helpfulness": 7, "user": "claris", "date": "February 16, 2007", "id": 6800507}, {"rating": 1.0, "title": "Be cautious about Charges", "text": "The Hotel Lido is quick to put charges on your credit card and very unwilling to remove those that are incorrect.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "October 22, 2004", "id": 2772271}, {"rating": 2.0, "title": "Mediocre", "text": "My husband and I stayed here in July 2004. The hotel is a short walk from the train station (which was convenient for us), and the staff spoke perfect English, but the place majorly lacked charm and appeal. The room was clean and had a nice big window, but the bed was lumpy and the toilet was the worst we had in Switzerland. I found the hallways and stairwells to be dark and depressing. One of the strangest things was the uniformed mannequins in the lobby and breakfast room - very bizarre.", "helpfulness": 9, "user": "gengrace", "date": "August 25, 2004", "id": 2492714}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 2, "variance": {"poor": 11, "average": 24, "very good": 26, "terrible": 4, "excellent": 5}, "aka": "Lido Hotel Geneva", "slim_ranking": 0.528846153846}