{"user_rating": 4.0, "review_count": 262, "name": "Hotel Budir", "reviews": [{"rating": 5.0, "title": "a magical place", "text": "I would say that the Snaefellsnes peninsula is one of the most beautiful places in the world, and this hotel is the place to see it from. I was there in the early summer for my honeymoon, and for that I had a perfect time. It is important to realize that the area is quite remote and desolate, and this is very much the appeal. The hotel is the major landmark, and if you are going to a hotel in the area, I think besides one exception, this is it. Our room was clean, simple and elegant with a stunning view of the Snaefellsjokull glacier (this is room *23*) but if you have made trek to the peninsula, you will spend your best time outside. There are various hiking paths that will take you out through lava flows, past burned out volcanoes and to the amazing cliffs of Hellnar, eventually to the Snaefellsnes national park. The hotel takes its scenery seriously, and is laid out for you to enjoy the view, inside and out.", "helpfulness": 2, "user": "moodshift", "date": "September 14, 2008", "id": 20078877, "likes": {"liked": "— location location location", "disliked": "— like any hotel in Iceland, it is quite expensive (especially after factoring in dinner) but otherwise as nice as any hotel in the country, but probably much more beautiful"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "The staff of course is friendly and very accommodating, and the restaurant serves haute cuisine. I have to say though, it is landscapes and the clouds spilling over the mountains that I remember foremost.", "title": "Superb country hotel in exquisite natural setting", "helpfulness": 3, "user": "Vivianite", "date": "August 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19468583, "likes": {"liked": "— The natural beauty of its setting", "disliked": "— I liked everything about it!"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The Hotel Budir is located in a nature preserve on the coastline of wild, gorgeous, dramatic western Iceland. Beautifully designed and well-maintained, with pretty public and private rooms, the hotel is a fantastic destination for nature lovers and comfort seekers alike. Some guest rooms have a glacier view, others overlook a majestic coastline studded by volcanic mountains, while still other rooms, such as the one we stayed in, have near views of a tidal estuary and long views of waterfalls and gorges across a lava field.", "title": "OK Hotel - Disappointing Dinner", "helpfulness": 1, "user": "AlwaysOnTheAirplane", "date": "June 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 16574847, "likes": {"liked": "— Location", "disliked": "— Food"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The weather during our late August stay changed from minute to minute---with rain and sun colliding at a rapid clip. We saw more rainbows in the sky above and around Hotel Budir in two days than I had seen in all my years before our visit!", "title": "stunning location", "helpfulness": 2, "user": "naptraveler", "date": "May 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 16253834, "likes": {"liked": "— stunning views", "disliked": "— bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband and I were both impressed with the hotel and restaurant staff, who were helpful and friendly in a quiet and non-intrusive way.", "title": "Excellent hotel in a fabulous location", "helpfulness": 2, "user": "sirius99", "date": "April 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15481959, "likes": {"liked": "— The location and the overall decoration of the hotel", "disliked": "— Nothing to complain"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We want to stay at Budir for three nights in September 2009, so we asked for a reservation through the request form at Budir´s Homepage. But we received no reply after several tries. Lousy service for a so-called high-end etablisement. ;-((", "title": "The sound silence", "helpfulness": 1, "user": "loewenherzblut", "date": "February 7, 2009", "detail_rating": {"value": 3.0}, "id": 24352566, "likes": {"liked": "— reservation"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "My husband and I met at a dinner one evening and it was love at first sight. So we decided to plan a wedding.", "title": "Amazing Amazing Amazing- we got married there!", "helpfulness": 2, "user": "lolalfondon", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23969955, "likes": {"liked": "— The food, the wine, the service, the rooms, the location, close to Blue Lagoon"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "At the time, he was living in London and I was living in New York, which made planning a bit complicated, but a fun challenge nonetheless.", "title": "Most Unusual. Dreamy.", "helpfulness": 1, "user": "THECLEVERADVISOR", "date": "January 1, 2009", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23155478}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "In a nutshell, in three months, we planned a 3-day wedding in remote Iceland with 30 friends and family, and we got married in a tiny church that was a 10 second walk from this hotel (we found the church first, then discovered the hotel was close by).", "title": "Stunning, and very atmospheric", "helpfulness": 1, "user": "cobwebsinthecloset", "date": "December 27, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 23039311, "likes": {"liked": "— location", "disliked": "— lack of staff"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "And we couldn't have done ANY of this without Ulfar, the hotel's manager. He was amazing and helpful and the sweetest person ever (and his staff were the same).", "title": "amazing hotel set in a stunning location", "user": "jane13CheshireUk", "date": "October 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21382435, "likes": {"liked": "— position and ambiance sense of peace and close to the elements", "disliked": "— treacherous journey to get there in the winter"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "Iceland is a beautiful and fascinating country but it will never win any praise for its levels of service and its no surprise that the Budir ticks all these boxes. Its not that the service was outstandingly bad in any way, it just seemed that the bare minimum is kept to, which is fine in a 2 or 3-star property, but considering the hype around this hotel and the prices paid to stay and to eat, this hotel could certainly do a lot better, particularly the smaller touches.", "title": "Nice hotel and location but is it really worth the price ?", "helpfulness": 2, "user": "Casualist", "date": "December 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11459692, "likes": {"liked": "— Location, nice design of rooms, sea food, DVD player in room", "disliked": "— Poor value for money, poor cleanliness, 3-star service and 6-star prices"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "For example, why have a bar area with great views over the surrounding countryside when the tables are left covered with full ashtrays and half-empty beer glasses ? Why arrange the parking so that the first impressions when arriving by car are of kitchen bins and kitchen staff on cigarette breaks ?", "title": "Icelandic Wedding", "user": "phileeep", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10889396, "likes": {"liked": "— The tasteful furnishings - all complemented each other very well!", "disliked": "— The noisy doors to the rooms."}}, {"rating": 5.0, "title": "Fantistic Location,Lovely Food", "text": "The room itself was pleasant and large, plus points for the DVD player and retro-Edwardian bath fixtures, including a huge tub. Minus points for the fact that it was at ground level and next door to the entrance so everyone coming and going could have a peek through the windows.", "helpfulness": 1, "user": "GandC_UK", "date": "November 18, 2007", "id": 10889682}, {"rating": 2.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The restaurant provided good food, certainly the local seafood banquet was huge and excellent quality, but did my wallet suffer or what ? I realise that Iceland isn't the cheapest place to visit and that Budir is marketed towards the higher spending visitors, but in excess of 300 Euros for a meal + wine for 2 people does seem a bit steep. Certainly there's nowhere else to go to nearby and the hotel makes the most of its captive market.", "title": "Overrated", "user": "JezandStacy", "date": "October 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 10374734, "likes": {"liked": "— Restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Overall a nice location, nice rooms, nice food. The question is whether they are justified by the price. The hotel just needs to provide that missing 15%.", "title": "Best location", "helpfulness": 1, "user": "OlivierReykjavik", "date": "September 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8752282, "likes": {"liked": "— The views", "disliked": "— The parking lot"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Stayed 2 nights. Lovely setting, great walks, nice building but food and service were awful. When we arrived there were teenagers sat outside the hotel in a cabin opposite playing very loud electric guitar, this continued for hours. We then endured the food which they couldn't even cook properly yet cost £100 for starter and main (we declined dessert), we ate at a petrol station the next night - this was more appealing. But by far the worst thing was the double standards, the hotel guests were told that they cannot not make any noise after 11pm, however it was OK for the hotel to hold a party until gone 2am! Something which kept the majority of guests awake half the night. I won't be wasting my money here again.", "title": "Nice Setting but they need to get their priorities straight.", "helpfulness": 1, "user": "woodymark2", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 31207315}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Myself and husband stayed here, and whilst you cant fault the location and setting, or the hotel, the service and food is much to be desired!", "title": "OK if you want a great hotel with overpriced small portions of food!", "helpfulness": 1, "user": "shubanacadie", "date": "April 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 4.0}, "id": 29074395}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "Our Experience;", "title": "Amazing ...", "helpfulness": 1, "user": "brennan1", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28266804}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "After treking around for a day you want a good meal, however this wasnt what was avaliable! After looking at the menu, there was very little choice. A 5 course set menu of lamb and fish for 8000kr each (which we didnt opt for as we saw it being served on another table) or approx 4000-5000kr for a main meal (mainly different types of fish) if I can remember correctly.", "title": "Unbelievable romantic getaway, truely breathtaking scenery.", "helpfulness": 2, "user": "its-all-about-travel", "date": "April 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28064436}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I ordered the 'fish plate' which consisted of a large plate (approx 30cm x 30cm) a lot of sauce zig zagged across it, and 3 tiny pieces of fish placed in the middle with a baby carrot on top. The fish was bland or really 'soggy'. I didnt touch the 'soggy' fish and had about a mouthfull of the other fish and pushed the plate to the side! Other half had lamb, which he said was ok, but was gone within a few mouthfulls and not worth the money paid for it.", "title": "Unbelievable scenery", "helpfulness": 2, "user": "mkbmkb", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 25518580}], "location": {"country": "Iceland", "region": "West Region", "continent": "Europe", "city": "Budir"}, "variance": {"poor": 22, "average": 24, "very good": 75, "terrible": 6, "excellent": 135}, "aka": "Budir Hotel Stykkishólmur", "slim_ranking": 1.0, "description": "Hotel Budir is undoubtedly one of the most beautiful countryside hotels in Iceland, just a short drive from Iceland’s capital city, Reykjavik. The hotel sits in a lava field on the westernmost tip of the Snaefellsnes peninsula, in the western region of Iceland.Due to the hotel’s location, guests have an impressive view of the breathtaking Snaefellsjokull glacier and the Budir-estuary which meanders into the vast Faxafloi-Bay where a number of seals reside.Over the winter time its cozy sitting by the fireplace having hot chocolate and enjoying the amazing northern lights Aurora borealis just outside the hotel.Hotel Budir’s restaurant, arguably one of the most romantic restaurants in Iceland, has been referred to as \"The Mecca of Icelandic cooking\", due to its unique and delightful cuisine. The restaurant’s menu is seasonal and takes advantage of fresh local produce like seafood and fish from neighbouring villages such as Stykkisholmur, Olafsvik and Borgarnes.The hotel also organises and hosts a number of weddings, all of which are unique and tailor made with the wedding couple or their representatives. Many of the weddings ceremonies are conducted in the little church close to Hotel Budir or in the hotel reception; it is even possible to get married on the golden sand beach close to the hotel.In addition, the hotel also offers facilities for meetings and small-to-medium sized conferences thus making it ideal for business-meetings or conferences with colleagues.Hotel Budir has it all, a world-class service, fine food and drink and luxurious rooms, making it ideal for get-togethers with friends and family, or a romantic weekend with a loved one – all of which can be enjoyed in an indescribably beautiful environment."}