{"user_rating": 4.0, "review_count": 1542, "name": "Hotel Riu Playa Turquesa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed at this resort the first week of April, 2012. For the months leading up to the trip, I can say I read the reviews on this site religiously, so the few bad things that we found really didn't come as a surprise.", "title": "Perfect Family Vacation", "helpfulness": 6, "user": "FanOfSummer", "date": "April 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127684004}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Check in went quickly; we arrived late at night, and were greeted with a waitress with drinks. We had a drink in the lobby bar, and were then taken to our rooms by the golf cart. Yes, the carts are everywhere, and they do travel very quickly. When you hear one coming, get on the grass and let it pass.", "title": "Loved it", "helpfulness": 9, "user": "Tembec", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127532045}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Our room was spotless for our entire trip. Complaints for the room: zero hot water. I'll never take hot water for granted again. We spoke to other travellers who didn't have the same issue, so it's the luck of the draw I guess. We were in the 340's for rooms. I did mention it at the front desk, but they didn't say anything about it. Our fridge wasn't restocked with beer without complaint at the front desk, and we didn't receive all the rum we were supposed to receive. No big deal on the beer or rum, but the water was a disappointment.", "title": "TIPS for Cuba", "helpfulness": 4, "user": "nettienterry", "date": "April 9, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127514483}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The grounds are beautiful. There are a lot of stairs, but you can always take a path to get where you want to go. I'd never travel here with a stroller, it would be miserable. The pools are clean, as is the beach. We held our chairs every morning, otherwise we'd never get chairs near shade or an umbrella.", "title": "Fantastic family vacation!", "helpfulness": 8, "user": "kbric", "date": "April 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127430759}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The food... not gourmet, but we didn't go hungry. Next time I'd bring more snacks. Breakfast was a challenge, unless you like omelets. I do, however my family does not. Spoons are virtually impossible to find; sometimes they are by the soup, sometimes by the ice cream station. Lunch, we found the pasta to be a good choice, and most times the same for supper. We did enjoy the beach grill, and the 24 hour snack bar. Tourists do need to relax when it comes to the food; the doors would open, and people would run like they were on-fire to get to one of the grill stations first. I was behind a young 20 something girl who seems to think she's better than everyone/everything, who was screaming to her mother about what a review she'd be posting on Trip Advisor about how the rolls were hard. Get over yourself, and decide if it's worth complaining about before you complain about it. The poor workers slaving, yes, slaving, over our omelets, pasta, etc, have to work in that heat for hours, with little thanks. I will say however, it seems that the buffet area is mismanaged. They ran out of plates, didn't have things ready when they opened (drinks, utensils, etc), and then the workers have to take the brunt of the complaints.", "title": "Well, Where do i start.......", "helpfulness": 7, "user": "welltravelledReading", "date": "April 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 127403384}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Recently returned from my stay at this hotel and was there for 2 weeks, or should I say 2 weeks of hell. If your into eating cold food, with birds sitting in trays of food at breakfast and lunch and the staff doing nothing about it at all then this is the place for you. The place is absolutely swarming with birds who also dive at you when you are eating and you cannot leave any food unattended. The staff have got no idea of food hygiene.", "title": "Definitely not a 4 star hotel", "helpfulness": 5, "user": "CMR8", "date": "May 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 108851926}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The food was really poor, hardly any fresh vegetables or fruit. Considering this is a 4 star hotel I could hardly believe that they expected you to eat tinned fruit cocktail and tinned vegetables.", "title": "Wasn't sure at first but would definitely go back now", "helpfulness": 4, "user": "boyes31", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 108680237}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "One morning at breakfast they had run out of fresh juice, butter and bread for toast and on one occassion there wasnt any plates. Considering this hotel was nearly empty during the entire lengh of my stay I was totally amazed at the apparent lack of food.", "title": "Ignore every single bad review you have read.. absolute paradise!!! PLEASE READ", "helpfulness": 8, "user": "shaboody", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 108635088}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I have travelled to many destinations world wide and can honestly say this is the most let down holiday Ive ever had.", "title": "Some photos of Dougie and Dan @ Don Bartolos", "helpfulness": 1, "user": "ringettemom001", "date": "May 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 108384708}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The entertainment was also very poor apparently as there was hardly anyone at the hotel a member of the entertainment team advised, no guests no money!! Something you really want to hear when you are on holiday.", "title": "Amazing views (around the hotel) and Amazing People (Animation)", "helpfulness": 1, "user": "M-S-Crockett", "date": "May 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 108359535}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed at the hotel for 2 weeks in May 2011 with another couple. On reading the reviews before departing we were a little nervous about over crowding, noise etc but were so surprised when we arrived.", "title": "Great time and great hotel", "helpfulness": 5, "user": "chrisandhayley555", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 111468098}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Hotel - lovely and clean and the rooms were great (although could hear a little noise but not much). Restaurants were brilliant and had lots of choice. We went to the chefs bistro twice (paid 10 pesos each extra) and was well worth the money it was fantastic. Bar areas were nice and always somewhere to sit. Staff were so accomodating and when there wasn't any wine they would ensure more was brought to the bar. I can't say enough about the bar staff they were fantastic.", "title": "loved it wonderfull people going back soon as possible", "helpfulness": 2, "user": "ianbuchanan21", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 111456170}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Pools - we normally get up early when we have been away previously to secure sun beds etc but there was none of that when we went. It was lovely and quiet and you could take your pick of where you wanted to sunbathe.", "title": "Had a great time at the begining", "helpfulness": 1, "user": "happygreek", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111352316}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "The hotel was quite quiet when we went which meant we didn't have to queue for anything and there were plenty of staff.", "title": "Playa Turquesa is the best in Holguín", "helpfulness": 7, "user": "yosma29", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110988179}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "In summary would return for another 2 week holiday without a doubt, loved it and would recommend to anyone of my friends.", "title": "What a wonderful place!!", "helpfulness": 1, "user": "NickHeather", "date": "June 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 110949363}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Stayed from Feb 17- Feb 24. Had a great time at this resort! Room was very nice. Lots of walking but good exercise! Food was ok, there was always something to eat. Last night went to the Grill Restaurant and ordered the Shrimp. Food was not hot. A few days after returning home I got sick, found out I received E. Coli. Pay attention to what you eat and make sure that everything is very hot when you get it. Recommended excursion: Catamaran with the Dolphin swim $120 Canadian full day one. You get to go snorkelling, swim with dolphins, open bar on boat as well as get lunch at the island where you swim with the dolphins and open bar there as well!", "title": "Awesome hotel, food was ok", "helpfulness": 1, "user": "mwtravelor", "date": "April 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127949314}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We returned to this Lovely Slice of Heaven, for our Third time..April4-11/2012.. We travelled with My Sister and Her Husband, this was their second Visit. Nothing what so ever to complain about. Travelled with Canjet, very nice. Small meal, wine, cute movies..Arrival, very fast, We were met with cool drinks, wisked off to our rooms, within 1/2 hour.. Rooms, very clean, but... I had e-mailed Yusimi@guest services, 4 times, requesting a favorite room location..Did not get this..No hardship.. We simply asked , politely, to be moved, and 3 days later, We were finally settled! Block 400, very quiet, very close, King Bed..Thank you Lovely Elena @ Guest Services..Being our third Time, We were invited to a lovely Meal at the Beach resto, met some Great Repeat Guests, had an amazing Meal..Fun times! Also The Cameleon Dinner was awesome..We felt spoiled!Because our week was short, we chose to not book any of the alacartes..Been There, Done That. Ate more than enough at the Buffet!... We participated in the Lovely \"Repeat guests Tree Planting Ceremony\" and were Humbled.. Yusimi is an amazing lady, and I think She feels sad, that this resort will be changing hands, very soon..She, and all of the lovely Staff, are very unsure , how things will continue, in regards to all the amazing Repeat Guests, who return, year after Year..Will Riu continue this very Amazing Ceremony? Only Time will tell..Unfortunately, this week, we ended up witnessing over-crowding, long, lines, for Food, ect.People Rationing Bacon?...lol...I Kid You Not!!... No beach towels, even a lack of towels for our room, for a few days.. Running out of Certain drinks, wine, catsup, ect.(Such Hardships..lol).People should look at what they paid for this slice of Paridise,.perhaps, they should look at a Cruise, next time?...Still, We heard many Snide comments......I do not blame the Resort, they were sent a plane load of unexpected guests, do to over-booking at the Blau Coste Verde..Which, in turn lead to the long, long lines at every food station, ect..Than, at the end of our week, the Torrential rains! OH My, but We survived, We did not Starve, We were Happy to be there, if only for a short time..I am sure there will be many Negative reviews, coming, but trust Me, This week was out of the ordinary, and I am sure Things will only improve, with Time..I cannot wait to return, someday, to see The improvements, and to see Yusimi, and Her lovely Staff, carrying on as Usual.. Under the Riu management.", "title": "Our Lovely Blue Sky Holiday at the Serinas Playa Turquesa<3", "helpfulness": 2, "user": "kaiserOntario", "date": "April 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127897641}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "We stayed at the SPT from April 4-11th, 2 adults and 2 kids (7 and 11).", "title": "A beautiful place", "helpfulness": 3, "user": "kimberly1177", "date": "April 14, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 127859856}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Check-in was quick, despite 2 buses arriving at the same time. A golf cart took us and our bags to our room within 1/2 hour of arrival. I had emailed a few times ahead to request a room in the 400-500 block, but didn't receive a reply and we were given room 320. At first it seemed a bit far away from everything, but we found paths in the hills that got us everywhere much faster. The room was clean, basic. The fridge was stocked daily. They did seem to run out of clean towels for a couple of days but we brought our own from home as a back-up so no big deal for us.", "title": "Lovely time in Cuba", "helpfulness": 5, "user": "elvismum", "date": "April 12, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127722542}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The grounds were beautiful. Lovely landscaping, and the pools were gorgeous. Towel game in play-- toward the end of the week the hotel was full and if you wanted a chair, you had to get there early to save one. It was a bit annoying to see towels on chairs that weren't used for hours while others had to do without.", "title": "Amazing Vacation", "helpfulness": 4, "user": "Shirls10", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127700600}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Having just arrived back in blighty, i have noticed a big difference in not only the weather but the people. Upon arrival in Cuba we were nearly knocked out by the heat, this place is hot, people we met were friendly and helpful and not at all pushy. At the resort we were very pleased to find we had a large family room with a cot as requested, next door were our friends who also had kids and they were also pleased -both having ground floor apartments in the 400's meant we were central to everything. We understood that there had been a bit of a lack of rain - 3 and half months so everything wasn't as green as expected, however, still a beautiful place and who wants rain anyway! As this wasnt peak season we reaped the benefits of not having to queue for sunbeds, food or drink, the kids were more than happy in the pools or at the beach - our 2 year old son took a particular liking to Yan Ellis who couldn't have done more with mini disco, dancing, and generally making us feel extremely welcome and relaxed. Although it wasn't busy the 'Animation' team worked hard to get people involved, Johan, who looks like a basketball star cannot go unnoticed, he is a big guy and always on the microphone around the pool doing dance classes or aqua aerobics. A special mention also to the ladies making the Omelettes, Smoothies and Pasta (sorry i didn't get your names) but lovely people and also to Yamir our waiter who was a top guy, really friendly, likes his football and always made sure we had a good table and plenty to drink. The only downside i can mention are the miserable staff in the shop who have either just been told they have days to live or need to take a serious look at their attitude - we were spending money and it was a real shame. Best advice take a thermos flask type drinks holder to keep beer cold as plastic cups are so small when around the pool.", "title": "Lovely people, great pools and staff", "helpfulness": 5, "user": "Ned08", "date": "June 1, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 110901219}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "This hotel was fantastic! It was really relaxing and took alot off my shoulders. Everything met to my fullest expectations. The pools , people , and food were very good. The Disco was probably my favorite thing to do while i was there for the nightlife. The service was unbelievable! very talented bartenders down at the poolbar who could juggle. I wish i remember their names , but i do know one was a champion in cuba for juggling. I do remember \" Ivan \" who was the bartender in the lobby. He was very professional but entertaining at the same time! He was a very good bartender. Im definately comming back next year , and cant wait either! see you there!! :)", "title": "Best experience of my life.", "helpfulness": 4, "user": "robinatkinson", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110730993}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The only bad experience we had is theft!", "title": "Staff steals :( Lock all valuables in safe!!!!", "helpfulness": 6, "user": "aNewMom", "date": "May 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 110559150}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "On the first day a full bottle of the sunscreen lotion disappeared. We didn’t want to make a big deal out of it.", "title": "Beautiful beach, people and pools......", "helpfulness": 7, "user": "Jentabent", "date": "May 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 110432995}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "On the last day 2 pairs of designers’ sunglasses were stolen from the bag in the locked room. A prescription pair of sunglasses cost $550, another one - $250.", "title": "The best of all", "helpfulness": 4, "user": "lyneybee", "date": "May 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 110007071}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Check-In:", "title": "You Get What You Pay For - The long and SHORT of SPT!", "helpfulness": 4, "user": "terre-neuvienne", "date": "April 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 128187510}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Was a scramble with two bus loads of people vying to be first at the desk. There were no complimentary beverages to welcome us or people to greet us as we got off the bus. The staff on the front desk worked fast to get guests their keys and have them on the way to their rooms. Since we arrived at night and did not know the lay-out of the resort, we were forced to wait for the golf carts to bring us to our rooms. There were two or three running (*one was parked by the lobby the entire week), so it was a wait. When we finally had our turn, the cart was so loaded down with luggage and people, the driver took a turn too fast, and one of my hard-shell suitcases fell off onto the stone sidewalk. Needless to say, it was damaged quite a bit. The driver stopped, picked it up, shrugged it off and jumped back aboard the cart without so much as a word to any of us. That was our first and last ride on the golf carts – not that we never tried to get a ride after that first day, but there were so few that it was virtually impossible throughout the week. Upon check-out, one guest told me that he had waited an hour for the golf cart to come get him after having requested a ride at the front desk. He decided to hike his bags to the lobby himself – no small feat considering all the stairs! He wasn’t impressed …", "title": "Our 3rd time at Turquesa, and it just gets better and better!", "helpfulness": 4, "user": "Highlandermic", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128182532}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Rooms:", "title": "Vacation at Sirenis Playa Turquesa", "helpfulness": 2, "user": "Keith R", "date": "April 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128168502}, {"rating": 2.0, "stay_parameters": "Stayed April 2012", "text": "We were in 755, and a friend was in 656. Both of these rooms were spacious, on the second floor with super-high ceilings, lovely balconies and were very clean. The maid we had was super. The beds are well-worn, however, and need replacing – hard with lots of springs. The bathroom was clean with lots of toilet paper, and we never ran out of hot water. We had no trouble using the safe to store our money and passports, and nothing was ever taken or out of place when we were gone. We had no bugs at all in 755, but our friend in 656 battled bugs the whole week we were there.", "title": "Spend the extra and go somewhere else", "helpfulness": 7, "user": "virago96", "date": "April 18, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 128141565}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "**The other couple we travelled with was assigned room 171 – avoid this room at all costs! There was no toilet seat or cover on the toilet in the bathroom, no vanity (just a plain sink attached to the wall), no hair dryer and two very small beds that when pushed together wouldn’t even make a double. It was insulting after having paid so much to come to this resort to be given a room like that. Three days later, they were given a room in the 500’s which was far better – and 3 small bottles of rum as an apology.", "title": "Big let down!", "helpfulness": 3, "user": "mxshellylynn", "date": "April 18, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 128138192}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "terrible only caters for canadians staff ignored us when wanting drinks at our table gave up waiting so tried to help our selves and were shooed off saved up for dream holiday and got a nightmare just terrible thats all i can say", "title": "terrible", "helpfulness": 1, "user": "k k", "date": "April 17, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 128061808}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This is the shortest review I have ever written as I cannot think of anything negative to say about this hotel. It is a wonderful place.", "title": "Just truly fabulous", "helpfulness": 5, "user": "RosslynT", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128016662}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The only thing I feel the need to stress is that this hotel is not at all suitable for people with limited mobility, as there are lots of steps everywhere.", "title": "Can't wait to go back ,i love it there", "helpfulness": 1, "user": "Beachl0ver67", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128004551}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "But all in all it was a fabulous place, with fabulous staff in a fabulous location. It was my best holiday ever and I would happliy return here :)", "title": "What a nightmare!", "helpfulness": 3, "user": "louise t", "date": "April 16, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 128003348}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed from April 6th till April 13th,2012 with a group of girls from Nova Scotia. This was my third time at this resort and i love it ,can;t say enough good about it . The Cuban people are so friendly and would bend over backwards to make sure your stay was wonderful. It was like going home to my family and i will miss them very much.The beach was great ,loved the a la caret dinners and the drinks were plentiful. If you like to snorkel then this is the place to go as they have a great reef just off the beach that you can walk out to or take a paddle boat out and jump off to snorkel.There is nothing to complain about at this resort except for rude tourists who treat the Cuban people like dirt ,I was not happy to see how the British treated the workers who would do anything for anyone .Over all awesome place to go and will be going back again next year to the same place to see our Cuban friends .", "title": "Beautiful views", "helpfulness": 1, "user": "cujocatHamilton", "date": "April 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127981350}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Let me begin by stating that Holguin DOES NOT COMPARE TO VARADERO. If you are looking for a great beach Holguin is not where you will find it. The quality of the hotels in Holguin are superb and are all beautiful (more so than those in Varadero) however if a great beach is what you want on your vacation, Holguin does not have it.", "title": "Beach DOES NOT Compare to Varadero, Only Go to Holguin for the Cuban People.", "helpfulness": 3, "user": "GREENQUEEN08", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 109732664}, {"rating": 1.0, "title": "There' s a Rat in the kitchen", "text": "Hotel: With that said upfront, all in all, the Sirenas Playa Turquesa hotel was a good one. The best thing the hotel has to offer is its landscapes and gardens. They are well kept and gorgeous. The accomodations themselves are very comfortable and cleanly. The only downside to the hotel is that it is located approx. 1hr and 10 mins. from the airport which can be stressful when you have travelled for several hours on a plane.", "helpfulness": 7, "user": "lowtongirl", "date": "May 19, 2011", "id": 108985946}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Staff: The Staff is incredible and friendly and I must give a shout out to YANELIS! She is the best entertainer I have met thus far in my yearly travels for the past 20 years. If you have booked the Sirenas hotel be sure to look for the lady with the RED hair! She will make your stay an enjoyable one...no doubt about it! Other members worth mentioning are Susanne or Susie, Lilly, Daniel and Donny. There are all fabulous people who are always willing to make your stay at the Sirenas the best it ca possibly be.", "title": "SOLID 4 *, FREINDLY STAFF, NO PROBLEMS WITH ANYTHING", "helpfulness": 4, "user": "HotplateOntario", "date": "May 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 108948326}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Food: The food is not superb but acceptable for Cuban standards. The Pizza at the beach bar is amazing and the burgers at the twenty four hour grill are to die for. The buffets and A-la-carts are mediocre. I kept eating bread, chicken/beef and rice from the buffets and A-la-Carts. If you are not a picky eater you will definitely find something to your liking.", "title": "Love Cuba!!!!!!!!!!!", "helpfulness": 5, "user": "bguimond", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108936436}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "Beach: BEWARE OF POISONOUS FISH!!!! I travelled with friends and on the 2nd last day of out trip one of our girlfriends stepped on what is known as a scorpion fish and we had to take her to the doctor for immediate attention. Her foot began to swell and became very red. She was in a great deal of pain and needed a shot to relieve the pain. She healed quickly thankfully and the Cuban doctor was very helpful and knowledgeable. The Doctor did tell us that the Beach was infested with thousands of poison fish due to the coral reef. There is plenty of seeweed, coral reef, and rocks in this beach and it does not compare to the soft, clean sand of Varadero.", "title": "Awesome, enjoyable and relaxing vacation", "helpfulness": 9, "user": "noramsmith", "date": "May 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 108865040}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 92, "average": 241, "very good": 678, "terrible": 56, "excellent": 475}, "aka": "Sirenis Playa Turquesa Hotel", "slim_ranking": 0.444444444444, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}