{"user_rating": 4.5, "review_count": 752, "name": "Hotel St Moritz Queenstown - MGallery Collection", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "If we hadn't eaten dinner in the hotel then this rating would have been worse - the restaurant is reasonably priced, the food is excellent, and the staff are a delight.", "title": "A big disappointment", "helpfulness": 1, "user": "Anon0", "date": "May 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 16365445, "likes": {"liked": "— Restaurant", "disliked": "— Ongoing hotel renovation was inconvenient"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008", "text": "The hotel itself however was a disappointment. They were in the middle of a renovation programme at the time and had no leisure facilities on site (although the nearby sister hotel's facilities was available but required a taxi journey) and we were woken up by construction noises before 9am. There was also an issue with out of date hotel info in the rooms - the parking charges were confirmed in the hotel info as $5 per day but the staff tried to argue that this was now $10 a day but the literature hadn't been updated. We were successful in getting the $5 a day rate but it's not really the sort of argument that you'd expect to have in a hotel of this quality that should know better!", "title": "Not up to scratch", "user": "mkh1", "date": "May 21, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 16266326}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "In hindsight, I wished I'd have booked somewhere else - this was part of our 'once in a lifetime' honeymoon trip around New Zealand and we were very disappointed with the hotel.", "title": "What a let down", "helpfulness": 1, "user": "Phil-Somerset", "date": "April 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 15177537, "likes": {"liked": "— Size of room", "disliked": "— Everything else"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Stayed two nights at the Mercure Grand Hotel St Moritz in Queenstown on 1st and 2nd May 2008. Very disappointed considering the amount we paid for a lakeview twin room. Value for money was certainly not there - staff were helpful but the room was not inviting or up to the standard we expected. Room was verging on small, beds were adequate but pillows good. The bathroom looked a little tired and lacklustre. We expected much more for the money we paid. The added car parking cost was again rather a little rich considering the tariff paid already ( no way would you use the internet or pay $26 per head for breakfast!). Queenstown is an interesting place , much more advanced than my last visit in 2002. When there is snow falling and the Remakables are dusted white it really is spectacular. A pity the hotel was not the same!", "title": "Take a cab to another hotel to use their jacuzzi?!", "helpfulness": 1, "user": "sheeponahill", "date": "April 16, 2008", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 3.0, "rooms": 3.0}, "id": 15069999, "likes": {"liked": "— Nothing", "disliked": "— renovation of health club/jacuzzi"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The first impression as you drive up is one of it being a bit special. That lasts 10 seconds until you walk in the front door and realise there are 8 steps down to the lobby, and no ramp, and no-one to help with the bags. From that bad start it got worse, as there were 3 steps up inside our room! After a full day travelling lugging bags around is not ideal.", "title": "Very Nice Hotel", "user": "Wright-Brighton-MI", "date": "April 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 14966955, "likes": {"liked": "— Staff", "disliked": "— Price of breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "On arrival the valet was there to park the car & take our luggage straight away. Check-in was a breeze & we upgraded our 1 bedroom suite to a water view for only $30.00NZD per night extra. It was worth it the view over the lake was great. Hotel is immaculately clean & decor very classy but comfortable. I alike this to staying in the Swiss Alps, it has the feel of Switzerland, relaxing. Bed & pillows were awesome & room was huge with lounge area,separate bedroom,large bathroom with shower & bath. Shower was hot & great pressure. Kitchen & washing machine & dryer was great to have in room. We didn't have breakfast at the hotel, but had a three course dinner there & it was by far the best value & best food we had on our trip to New Zealand. Staff were very attentive & friendly.", "title": "Loved It!!!", "user": "tanyatia", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14821857, "likes": {"liked": "— the feel of being in the swiss alps & how relaxing it was", "disliked": "— No inroom safes & noise from other rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Hotel is within walking distance to town, but be prepared for the huge hill up to the hotel it is a killer. Especially after a big meal & a few too many drinks, it was the last thing we wanted to have to trek up home each night.", "title": "Pure Perfection", "user": "Sally_H4", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14674293, "likes": {"liked": "— Fantastic service, quality furnishings and bedding, very clean and tidy", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Internet was fast & easy to use.", "title": "Lives up to its name", "helpfulness": 1, "user": "reserved19", "date": "March 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14215028, "likes": {"liked": "— everything", "disliked": "— not a lot!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We loved it at the ST Moritz.", "title": "Fabulous Lake View", "user": "JAM60", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14074129, "likes": {"liked": "— Lake View and quality of rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "Only couple of things that did annoy us but by far the good outweighs this is, that you can hear everything from the rooms next door,running the bath, talking etc & there are no in room safes which we found odd.", "title": "Heads up for the staff", "user": "HedonistLondon", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13974021}, {"rating": 1.0, "title": "Avoid Rooms to the Street at all Costs", "text": "Don't get me wrong - this is a nice hotel, and our room size was very generous, and all-in-all the facilities were ok maintained. However, if you are after sleep - forget the rooms to the street. Traffic on the street is not the main problem here, as it is fairly moderate at night. But the driveway to the hotel is in kind of a gully, with one wall to the road (which is considerably above hotel entrance level) and the other wall being the exterior of the hotel. To make things worse, they put a roof on top of that. The driveway doubles as the valet parking area. There was an enormous amount of car door clapping and starting engines during the night, not to mention groups of people coming back from a night out in town. Since there is no air condition, the windows need to be open (they are single glazed, so there is not a huge difference anyway). The acoustic feeling was like staying in a very busy parking garage. Even though we did not pay the same as for a lake view room, we still forked out way too much money for not being able to sleep at all.", "helpfulness": 2, "user": "RuaMaRima", "date": "February 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 4.0}, "id": 13893134}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "There were some major points in favour of this hotel, but a few against. It was a great location, we had a lovely view, although given the fact that we had booked a superior room with lake view I think we should have been on a higher floor. The room was enormous, and really cosy and homely, we even had a little kitchen. Balcony was a standing balcony only. We loved our room, but it had a few problems like the heating not working, the pay per view tv was broken, the washing machine was very strange indeed, though it was nice to have one. They are very concerned with being like a hip modern new york hotel here, and the service falls short because of it. They need to be a little less familiar, and more formal. I know that sounds bad, when we were trying to get things fixed they were quite offhand. Food was mediocre at best. All in all, it was really nice, Queenstown, though stunningly beautiful, isn't exactly the gourmet capital of the world, and I'm not really sure how many 'nice' hotels there are, so this is a good choice.", "title": "huge room", "user": "dublinyogi", "date": "February 15, 2008", "detail_rating": {"cleanliness": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 13568382}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "My wife and I stayted at the St. Moritz for two nights in November 07. I got a great deal via advance purchase directly through the Mercure hotel website. I can say that out of all the hotels we've stayed at world wide, the standards at the St. Moritz are ver high. The furnishings were very luxurious, comfy beds, cotton robes, etc. If this was Aspen, you'd likely pay 3-4 times more per night. Unfortunately we didn't have a room with a lake view, but can't really complain as the rooms were large and I would say around 400 sq ft...maybe it was a junior suite. The hotel is situated on a hill by the center of town. Every night we walked to town for dinner. The staff were also very attentive, as a matter of fact, I would say that the level of service by the staff at the St. Moritz are even better than other high-end luxury hotels (i.e. Ritz Carlton Maui). I remember upon arrival at the hotel, the valet notified the front desk via headset. By the time I got to the front desk (300 feet away!), the concierge had my info up with keys waiting....now thats service.", "title": "Beautiful hotel and a great value", "user": "lucyethel", "date": "February 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13220505, "likes": {"liked": "— Level of service, value, high standards", "disliked": "— Would've been over the top if you had the lake view"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My wife and 2 children recently stayed here for 2 nights in a 1 BR apartment/suite. The hotel is first class and has a European feel with a lovely view of the lake from the restaurant. Not all rooms overlook the lake. Our apartment was excellent but lacked a lot of light. It faced to the rear but this was not an issue. The quality of our room was to a high standard with a pull out sofa. There were no sheets on the sofa upon arrival but this was remedied. There was a mini kitchen and full dining table. Lovely large bathroom. The room was quite hot for some reason but not unpleasant. Restaurant excellent overall. Underground parking for $10 per night. The location is a short stroll from the town centre and an even shorter stroll from the lake frontage and a small beach. Would definetely return. Highy recommended.Check in and out efficient and desk staff friendly and helpfull. waiter staff in Restaurant very good.", "title": "Lovely experience", "user": "munjarra", "date": "February 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13218381, "likes": {"liked": "— Lovely ambience and overall nice hotel", "disliked": "— rooms quite hot"}}, {"rating": 4.0, "title": "Really Good", "text": "This hotel is of very high standard. We booked our room on the hotel website and got a really good advance purchase deal making it a real bargain. Our room wasn't in the best position as it overlooked the drive and footpath that guests use to exit the hotel. But we didn't really care as the room was huge with an amazingly comfortable bed, all mod cons and lovely bathroom. We had a glass of champagne on the balcony terrace of the hotel bar before heading into town. The views over the lake are wonderful. The hotel is located on a steep hill though so be careful if you have mobility problems.", "user": "Massingberd", "date": "February 1, 2008", "id": 13165632}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "This hotel is great. It is close to the centre of town, has great views, is beautifully furnished, has friendly and efficient staff, has a free spa and offers a reasonably priced breakfast. We stayed in the hotel on two occasions - once in an apartment and the second time a mountain view room. The apartment was amazing with a lounge, kitchen (with laundry), very comfortable bed and garden. The mountain view room was also good save that we were on the 7th (attic) floor and it got hot in the middle of Summer. There is no air-conditioning, which is surprising for a hotel of this standard.", "title": "Strongly Recommended", "helpfulness": 1, "user": "Caz_11", "date": "January 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12484477, "likes": {"liked": "— Location", "disliked": "— Room got a little hot"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We enjoyed our stay over the Christmas period in the St Moritz. We had to change our room once (we asked for a lake view suite, which we had, but it didn't have a balcony like all the others did - if you want a balcony be specific, your paying for it ! we got chnaged without a problem, bout found the reception staff aloof.", "title": "A lovley Christmas in Queenstown", "user": "MrH", "date": "January 9, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12479394, "likes": {"liked": "— the view, comfort of the room, the little touches", "disliked": "— the hill, the need to change our room and the aloof nature of some reception staff"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007", "text": "Car parking is an issue and its probbaly best to use the conceirge service - those guys worked their butts off moving cars, hauling luggage...my hats go off to them they worked bloody hard. The one time we need our car out quickly they did it - we were more than happy with their service.", "title": "Nice, Clean, Comfortable Hotel", "user": "Southern_Gal_AL", "date": "January 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12447046}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "We licked the little touches to, our son got a little card of free things in the hotal (a fluffy, a baloon etc) and a little St Moritz bear...this was a nice touch, he also had a little card from santa and the hotel got him a tittle present, again a nice touch.", "title": "Super hotel", "user": "GlobetrotterSurrey", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12323049}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The rooms are well appointed, clean and the bed very comfortable.", "title": "Gorgeous Hotel in a stunning setting", "user": "Cleggy", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12187892, "likes": {"liked": "— views from hotel", "disliked": "— hill walk up to it although kept us fit after lovely meals in town"}}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 18, "average": 69, "very good": 233, "terrible": 13, "excellent": 419}, "aka": "St Moritz Queenstown Hotel Queenstown", "slim_ranking": 0.311475409836, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Defined by a warm spirit and distinctive style that embodies the spirit of Queenstown. Blending understated luxury with warmth, and genuine hospitality, Hotel St Moritz is superbly located in town and has panoramic lake and mountain views. Offering traditional Guest Rooms, One or Two Bedroom Alpine Suites, each room cleverly blends timeless classics with modern essentials to ensure refined comfort. Dine in Lombardi - a relaxed ambience, offering an array of dining styles and spaces."}