{"user_rating": 4.5, "review_count": 419, "name": "Hotel La Perle", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "My husband and I just returned froma 4 night stay at the Hotel La Perle (May 14-18th, 2007). We paid $185 euro per night for a superior double room facing the courtyard. Though the room is small, as most rooms in this price range are in Paris, it was quite clean and the location was great. It's located on a very quaint street with boutiques, restaurants, pubs and creperies. On a side note, there is a wonderful little Italian pizza place across the street from the hotel (Pizza Positano) that serves authentic Neapolitan pizza nd pasta. Delicious! We ate there twice. Good shopping in the surrounding areas and walking distance to many key sights. About a 15 min. walk to Notre Dame and 5-10 min. walk to Luxembourg Gardens, St. Sulpice, etc.", "title": "Good stay at the Hotel La Perle for the Price Range", "user": "OC_Traveler27", "date": "May 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7655910, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "The staff is very helpful and friendly. Our only complaint would be that the walls are very, very thin and you can hear everything going on in the hallways or in the room next to you. You can't hear any street noise from the room which is quite nice but we were woken up fairly early (6 or 7 a.m.) on several mornings either by the guests in the next room or by maids cleaning, couldn't quite tell.", "title": "Fantastic location & decent value for Paris, but still disappointing", "user": "IPGHK", "date": "May 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 7607990, "likes": {"liked": "— Location", "disliked": "— Feeling of being poorly run, terrible shower, thin walls, inadequate computer facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "For the price range and location, I would recommend it. The area has a lot of character and overall, we enjoyed our stay there.", "title": "Great Stay at Hotel La Perle", "helpfulness": 3, "user": "IdahoMaryB", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7584322}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I stayed here for 5 nights in early May, as part of my continuing search for a decent hotel for single travellers (i.e. small room acceptable) under EUR150/night near St Germain. Though I got a great price (for Paris) on the hotel website, I was still disappointed in the overall quality of the hotel & would definitively not return.", "title": "Great location", "helpfulness": 1, "user": "CottageCruisers", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7564623, "likes": {"liked": "— Good size room & quality appointments", "disliked": "— minor noise from adjacent bathroom on a couple of occasions"}}, {"rating": 5.0, "title": "Recommended hotel in Paris!", "text": "Pros: Absolutely fantastic location, within a 10 min walk of 3 metro lines, great restaurants/bars/cafes, shopping, 20 mins to major museums & the right bank. Room was of decent size & kept very clean, no smoking odors. Most of staff helpful & friendly. Quick check-in/out procedure.", "helpfulness": 2, "user": "TravellerFromLondon", "date": "May 2, 2007", "id": 7540210}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I have been to Paris many times. My girlfriend and I went together for the first time in August of 2006 and stayed for 6 nights. It was truly a wonderful experience. Our room was facing the courtyard area, which we requested so that we wouldn't have to deal with any street noise. Turns out that the street it's on, Rue des Canettes, is tiny and very quiet. They have a small bar/restaurant that has about 6 tables and is very cute and efficient. The room was on the small side, but totally functional and very comfortable: small flat-screen cable TV hanging on the wall, two big French door windows, hair dryer installed in the bathroom wall. The hotel is immaculately well-kept and the staff was very friendly and happy to help us with directions or making restaurant reservations for us. It is in the midst of a great neighborhood for shops and cafes around St. Germain-des-Pres. I would highly recommend this gem and look forward to returning.", "title": "A Left Bank Gem!", "helpfulness": 1, "user": "Chatwin70", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7292128, "likes": {"liked": "— Location", "disliked": "— Rooms are on the small side."}}, {"rating": 5.0, "title": "La Perle Hotel", "text": "My husband and I stayed at La Perle for four nights in March and we would like to recommend it to travellers. We had read the reviews and found them to be accurate and helpful in our decision to stay there. The location was excellent and the room was very good. The only problem was the use of two beds pushed together and single doonas for a double bed . The bathroom was very good and everything was clean. the staff were helpful and friendly. We had a wonderful stay for our first trip to Paris.", "helpfulness": 3, "user": "Lynnie2pockets", "date": "April 7, 2007", "id": 7291838}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "L. Stevens Australia", "title": "Excellent choice, very well located", "helpfulness": 3, "user": "flozano", "date": "April 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7284389}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 8, "average": 25, "very good": 162, "terrible": 1, "excellent": 223}, "aka": "La Perle Hotel", "slim_ranking": 0.0725041829336}