{"user_rating": 4.5, "review_count": 293, "name": "Hotel Sorella CITYCENTRE", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We arrived late and was unable to find the hotel right off, no sign,but when we found it an employee was on the way out, he escorted us in, took us to the desk and made sure we were checked in. The rooms are large and spacious, clean and beautiful. We also had a very nice continental breakfast , no meat, delicious fruit. Employees were all great and we had a great experience with bartenders in bistro bar on the first floor , I def would go there again. You won't be disappointed!!!", "title": "Great stay at the Sorella", "helpfulness": 1, "user": "lexusmama", "date": "March 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 125693649}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "This is a modern, trendy, comfortable hotel situated in a shopping/dining/entertainment complex about a half hour from downtown Houston. Once you have exhausted the local stores (it is a good selection of smallish trendy shops), not sure what else there is to do. It has that artificial feel of something that has been constructed to appear very cool. Major service issue was that the 2-bedded room I had booked through hotel website, and paid for fully in advance, was given away and we were stuck on the third floor within easy earshot of booming music that went on well past midnight. Staff was apologetic and paid for dinner (and town car to the airport, after I asked), but, in my mind, just not good enough. Overbooking is just not cool, and when I lose sleep and can't function properly the next day, there is just no way I can be happy with my stay. Bistro Alex, adjoining the hotel, was very good.", "title": "Trendy hotel, great restaurant, odd location", "user": "entrad", "date": "February 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 125335522}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Arrived after a long flight to a very friendly welcome at the Sorella. I was very impressed with the decor - both in the atrium and in the room. Very stylish and comfortable room, one of the best I've stayed at in a while. Decent self-service breakfast in the morning if you need to head out, and the location of the hotel so close to so many bars and restaurants really make it a find in a city like Houston. Free WiFi really adds to the whole package - this is an ideal business hotel on the Energy Corridor. Valet service quite steeply priced however. Will definitely be returning if I'm back in town.", "title": "Stylish hotel in a good location", "user": "PostmanPat1", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125309108}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This was by far the best stay at a hotel that my family and I have ever had. The people were very friendly and the food was outstanding. The sleeping rooms were very nice and the beds are the most comfortable I have ever slept on in a hotel. My family and I will be coming back to this hotel.", "title": "Exceptional Sray", "user": "Ron N", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125247291}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I have stayed at the Sorella many times in the last two years and was never disappointed. It has a modern feel, is surrounded by some good restaurants and price-wise on par with e.g. the Marriott Energy Corridor which is close by. for the same, price, however, you get an individual hotel experience instead of a chain-one. Something I prefer. The breakfast pastries are delicious and free and I like that. Highly recommended.", "title": "Nice place and great pastries", "user": "Garak", "date": "February 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125107571}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Stayed here for five nights. Had never heard of the hotel or CityCentre which is not anywhere near downtown Houston. Turned out to be a modern, well appointed hotel with some lovely features including crisp, cleanly designed, well maintained, fairly large guestrooms and lovely public spaces. Breakfast is an upscale cold buffet of quality fresh fruit, croissants and other pastries, boxed cereals, yogurt, juice and coffee, all served in a beautiful lobby seating area. Walk to all sorts of restaurant and shops that are right outside the hotel door. Self park in a nearby covered garage is convenient. Only drawbacks - the hotel promised transportation within a 5 mile radius and then seemed to favor business groups over individuals. Also no real concierge on staff.", "title": "Lovely hotel", "user": "carefultraveler51", "date": "February 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124975335}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Great location near shopping and great places to catch a lunch, dinner or live music.", "title": "Hidden treasure", "user": "harley1234", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124938189}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Loved the rooms. Only down fall was the low lighting in the room and bathroom which", "title": "Excellent hotel, nice area and great food", "user": "Quendall", "date": "February 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 124901277}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "made putting on makeup a bit challenging. All else was great! LOVED the bed, sheets and pillows. Great lounge in the corner of room made for hanging out place with friends.", "title": "The Best Houston has to offer!", "user": "steve c", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124714029}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Staff very helpful, great breakfast and many areas for relaxing after dinner, meeting for work.", "title": "Great hotel", "user": "Warings", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124505000}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Citycentre is a lovely destination but our Easter stay was marred by excess noise from outside (concert on the green) on our first night and noisy wedding parties (3) in the hall on our second night. Yes, we had requested and paid a bit more for a quiet room to no avail. We even changed rooms on the second day. Were sorry that we were moved to such a lively floor! Loved the area, restaurants and shopping. To avoid the noise, we'd only stay there again during the week.", "title": "Noise Alert", "user": "vptravels", "date": "April 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 128442443}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I was recommended this hotel because it is near the Energy Corridor where I have meetings and it has restaurants and shops within walking distance, which is unusual and safer than other hotels in Houston.", "title": "Patchy service", "helpfulness": 2, "user": "Keithbz", "date": "April 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127409168}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "It is a little difficult to find (if you drive) even with satnav because it doesn't have a drive up front door/reception. Instead you need to park on the third floor of a public parking garage and drag your bags to the hotel.", "title": "Trendy and noisy", "user": "SplodgeInternational", "date": "April 1, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 127099980}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "If like me you live in Asia and are used to service then this is a bit of a drag (pun intended).", "title": "Swanky Party Scene", "user": "Austin2009", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126975861}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Which brings me to the patchy service.", "title": "Wonderful Stay, we'll be back!", "helpfulness": 1, "user": "texasgirl1969", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126640336}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Looked forward to our stay after reading all the wonderful reviews on tripadvisor. I have mobility issue and handicap parking here is horrible. We could not find any marked spaces near hotel entrance, only near the theatre entrance as they share the parking garage. Hint: head to level 3 of garage to directly access level 2 (lobby) of the hotel. Encountered housekeeping issues as there were green stains on sheets which had to be changed. The following day we did not receive housekeeping service and by 5:00 had to request service twice. The front desk staff apologized and we were suprised when a bottle of wine arrived with apologies for the inconvenience. The continental breakfast is average and the lounge was suprisingly dirty both mornings we ate there. The furniture in corridor leading to lobby is shabby. Bathroom is very small and cleaning was spotty. On a positive note, the location of hotel is near great restaurants, shopping, spa and movie theatre. My husband loved the sectional in room where he could stretch out. Bed was comfortable. However, I would not choose to stay at this property again.", "title": "Disappointing stay at Sorella", "helpfulness": 1, "user": "Kalia07", "date": "March 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 126305633}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The hotel is beautiful and the service was fabulous. We sat and looked out over the courtyard and watched the awesome fire pits. The hotel is located in an area where you never have to leave the property. The restaurant Alex's brunch was amazing. There is a movie theatre, stores and spa all within walking distance. This place rocks.", "title": "fabulous trip", "helpfulness": 1, "user": "L0ri_V_12", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126093036}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "From the time we drove up to the Hotel Sorella to the time we had to leave the staff was amazing. As i checked my family in i was greeted by a gentelman named Marcus who intoduced himself as the Front Office Manager he was great. After we arrived in are room he called up to ask if the room was what we wanted and if he could help with a list of local events or anything else (outstanding service). We at brunch on Sunday (food was great) in the resturant and were approached several times by George who i think was another manager. It's seems everytime we turned around some staff member was offering us help and most of the time it was a manager. With this type of service and a staff that cares about it's guest so much it will be NO MORE Four Seasons but Hotel Sorella everytime i go to Houston. My family thanks you for the wonderful time, we will be back.", "title": "Best Hotel in Houston", "helpfulness": 1, "user": "Bobby V", "date": "March 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126091931}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We got to Hotel Sorella close to 10p (blame Houston traffic) and the hotel employees were just as friendly as if we had arrived early in the afternoon. Definitely not your typical hotel room: dark laminate hardwood floors, very modern design aesthetic, super comfy bed and linens, plus a lounge area in the corner of the room. Loved the CityCentre area and being able to walk to a nice variety of restaurants and shops. Felt very safe walking around after dark. Loved the self-park feature and that you're in a covered garage, not having to shell out the bucks for valet. Only downfalls: Agree with the other reviewers noting that the rooms are rather dark. No overhead lighting. The continental breakfast was also lacking for late sleepers so make sure you get there early. For the proximity to the city and the cost (VERY nice military discount), we will definitely recommend to friends who make the trip over to Houston.", "title": "Worth the stay for the price and proximity", "user": "happyTXtraveler728", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125955402}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Modern hotel in upcoming trendy area. Very safe neighbourhood - visited many times for upmarket shopping during my time in Houston. Now returning on a regular basis from abroad this is hotel is top of my list for short stays. Nearest alternative - also very good, is the Westin at Memorial City - slightly better connected for a full US-Mall shopping experience.", "title": "Great Location in Houston", "user": "Antiblackberry", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125789380}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 6, "average": 29, "very good": 89, "terrible": 10, "excellent": 159}, "slim_ranking": 0.10158013544, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Located near Houston's Energy corridor and the Westchase district, in West Houston’s CITYCENTRE development, Hotel Sorella CITYCENTRE is a sophisticated modern boutique hotel. Ideally located, and within steps of sophisticated retailers, dining, entertainment and nightlife and nearby outdoor adventure in the form of jogging trails, biking paths, parks and recreation. Hotel Sorella offers 244 guest-rooms, suites and Penthouse suites. Hotel Sorella offers luxury and sophistication and is the perfect choice for for a romantic getaway, a short or extended business trip, or a group or conference."}