{"user_rating": 4.0, "review_count": 141, "name": "Hotel Keilir", "reviews": [{"rating": 5.0, "title": "friendly and very helpfull staff.", "text": "I had a very nice evening in keflavik. it has to offer a very lifely nightlife. The hotel has a great staff and they where very helpfull and friendly .", "user": "ebbinnn", "date": "May 6, 2009", "id": 29484574}, {"rating": 5.0, "title": "very personal, affordable, well located... great!", "text": "this hotel has great personal service that goes beyond the normal duty of a hotel staff. everything is new and trendy but classic still. the price is very reasonable and its located as downtown as it gets. i can recommend it fully to groups or individuals, no matter the purpose of your visit.", "user": "ReykjavikBenedikt", "date": "May 6, 2009", "id": 29448947}, {"rating": 5.0, "title": "likely the most personable stay in iceland and great location!", "text": "I had the pleasure of staying at Hotel Keilir in Keflavik last week and as I promised the lady at the front desk, if I enjoyed my stay I would post something on Trip Advisor on their behalf.", "user": "chirish77", "date": "March 13, 2009", "id": 26089041}, {"rating": 2.0, "title": "an unusual hotel", "text": "Hotel Keilir is owned and run by a family who really care about their hotel and their guests. Everything is very modern and chic, the rooms starkly white and well lit. The room my friend and I stayed in had 4 beds and was plenty spacious. It also had a balcony overlooking the main street, and the location of the hotel is right smack in the middle of the town. We were there on a Thursday and got to witness the actual runtur, which is so incredibly quirky and funny to behold. The same cars full of kids just driving back and forth continuously, kind of like cruising the strip, but at a considerably fast pace.", "user": "Astrid2000", "date": "October 17, 2008", "id": 20972259}, {"rating": 5.0, "title": "Oasis for weary travellers", "text": "The hotel is right across the street from Paddy's, where everybody seemed to be piling into who wasn't engrossed in the driving back and forth. After drinking Thule and taking shots of Brennivin and Opal (which I think is a horrendous mixture between Jagermeister and Listerine) on the balcony, we hopped across the street to check out the local scene. A homely Irish pub, they were having trivia night, and every single question involved American pop culture. Some cute local girls invited us to join them in their booth and they translated what the announcer was saying so that we could help. Witnessing the Islanders guess at the trivia was a trip, I suppose I'm somewhat glad that my impression that people in Iceland watch a ton of American TV was partially wrong. The prize for winning each round was a six pack of beer and for winning all three rounds was a case of Heinekin. Luckily, it was the weekend before Beer Day so beers were half off.", "user": "carolDunoon", "date": "October 1, 2008", "id": 20527284}, {"rating": 4.0, "title": "Exactly what we needed", "text": "This hotel is excellent for airport convenience. It's 5 minutes from the airport, cheaper than most, very nice and clean. Friendly owner. Also has a little artistic flair in the lobby. Easy to book on line. A hair dryer would have been nice, but overall it was exactly what we needed.", "user": "jeanellen9", "date": "June 23, 2010", "id": 68483660}, {"rating": 3.0, "title": "Kedvesseg, segiteni akaras...", "text": "Ket ejszakat toltottem naluk. Jo helyen van, szep, tiszta es a tulajdonos mindent megtett, hogy semmiben ne legyen hianyom!!", "user": "EmiliaEszter", "date": "May 26, 2010", "id": 65381492}, {"rating": 5.0, "title": "Iceland and the Volcano!", "text": "Az arat viszont kicsit sokallottam...", "user": "Salfordians", "date": "May 17, 2010", "id": 64382807}, {"rating": 1.0, "title": "Could not even do the reservation", "text": "We flew out to Iceland for a 3 night stay the day after the volcano started playing up. It looked spectacular from the plane but little did we know it would keep us there for a further 4 days. Icelandair put us up in this hotel for 1 night only but we had to stay on. The hotel is very clean and pretty much what you'd expect from a no fuss airport hotel. The price was really good for Iceland as well - just as well,as we had to pay the extra nights!", "user": "Grep_spa", "date": "August 30, 2009", "id": 39248988}, {"rating": 3.0, "title": "pretty bland", "text": "Bryndis and her family were excellent and really helpful in trying to get us home (much more help than the British government!) nothing was too much trouble for them", "user": "PAMomanddaughter", "date": "August 20, 2009", "id": 38288351}, {"rating": 5.0, "title": "Lovely place, great service", "text": "We enjoyed our stay at this small keflavik hotel on the main street of the town. We had originally intended to stay here only one night before our flight, but decided to add a night as a base for reykjavik as well. It worked out well for us, it's only 30-40 minutes from the city on an excellent road. 15 minutes drive from the blue lagoon.", "user": "pwurple", "date": "August 1, 2009", "id": 36409622}, {"rating": 3.0, "title": "Comfortable and convenient for the airport", "text": "The staff are really nice, helped us out with our online flight check-in (printing the boarding passes), booked taxis, very friendly and had loads of advice about the area. The rooms are clean, a bit plain, all white. Good showers, tiled bathroom. Help yourself buffet breakfast, with toaster available too. Standard continental breakfast, hot bacon was also available.", "user": "Alsacienne", "date": "July 25, 2009", "id": 35771112}, {"rating": 3.0, "title": "Expensive", "text": "Parking is available across the street. There is a restaurant next door, supermarket up the street, and some bars outside too. View from our window was of the sea.", "user": "eMCZa", "date": "July 24, 2009", "id": 35630865}, {"rating": 5.0, "title": "Great Place, Great View, Great Service!", "text": "Taxi to the airport cost 1800kr (around 10euro?), and saved us a days rental of around 130 euro, as we dropped off the rental car the night before our flight.", "user": "rkuchins", "date": "July 9, 2009", "id": 34334788}, {"rating": 5.0, "title": "Bryndis made us feel so welcome.", "text": "Curtains are semi-blackout, so decent sleep. Twin beds again (seems to be the norm in iceland) but there are doubles available in some rooms here when we asked, they just had been taken by other people first. Fair enough, we were looking for a last-minute room at 10pm.", "user": "Joy050", "date": "July 4, 2009", "id": 33886265}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "After several weeks backpacking through the untamed expanses of Iceland, we spent our last night at Hotel Keiler. Its location a few short minutes from the Keflavik airport was ideal, and the price was noticeably more affordable compared to the alternatives in the area. We booked our room via email one evening while we traveled and were met with a response and confirmation the next day.", "title": "A Wonderful Respite", "user": "JourneyingSpirit", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20323306, "likes": {"liked": "— Hospitality and location"}}, {"rating": 5.0, "title": "AMAZING HOSPITALITY + beautiful clean, new hotel", "text": "Our journey took us across the entire ring road of Iceland, as well as deeply into the Interior and West Fjords. After becoming quite familiar with the customs and personalities of Icelanders, we found the owners of Hotel Keiler to be enormously hospitable. While many bed and breakfast, hostel, and campsite owners throughout Iceland seemed to treat their endeavors as a formal business and little else, the owners of Hotel Keiler seemed to make it their personal goal to be open, friendly, and eager to share stories and conversation.", "user": "jggold", "date": "August 17, 2008", "id": 19053707}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Our room was quite pleasant, with a large comfortable bed and spacious bathroom. The room was very clean and well lit via an expanse of large windows which stretched across the entire south wall, several of which opened wide to provide a comfortable breeze of cool fresh air as we slept. The location of the hotel in downtown Keflavik was also quite convenient, as the town's restaurants and markets were within short walking distance.", "title": "Very good hotel, owners were fantastic", "helpfulness": 1, "user": "thethreeofus41", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17666856, "likes": {"liked": "— Clean and warm. Snugly beds.", "disliked": "— Can't think of anything"}}, {"rating": 4.0, "title": "Family Run Hotel", "text": "In addition to their good spirits, the owners of Hotel Keiler were quick to go out of their way to make our stay a positive experience. As an example, our flight was scheduled to leave at about 6:30 in the morning, meaning we had to leave the hotel at around 5 AM. While most hotels would simply say we were out of luck as far as breakfast goes, the owners of Hotel Keiler went out of their way to set up an Icelandic breakfast of cereals, meats, cheeses, breads, and fruits exclusively for our departure, even though it meant a very early morning for them. In a country where even a small sandwich can run 700 ISK, this service alone was immensely appreciated.", "user": "SSTravelling", "date": "April 17, 2008", "id": 15111013}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "After weeks of traveling across Iceland and staying in all manner of places from hotels to houses to campsites to hostels, we can honestly say that our stay in Hotel Keiler was one of our most pleasureable, particularly as a comfortable and affordable final night before departing the country in the early morning. We highly recommend it as a marvelous and hospitable hotel, and one of the closest available to Keflavik airport. Truly a wonderful experience.", "title": "Greatest hotel ever", "helpfulness": 3, "user": "ostur", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11609355}], "location": {}, "stars": 3, "variance": {"poor": 12, "average": 27, "very good": 34, "terrible": 6, "excellent": 62}, "aka": "Keilir Hotel Keflavík", "slim_ranking": 0.6, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Hotel Keilir is a brand new luxury hotel in the heart of Reykjanesbaer. Located on the city's main streat, Hafnargata, shopping and other amenities are within easy walking distance and Keflavik International Airport is just a 5-minute drive away. Hotel Keilir is a fantastic place to serve as your base of exploration for Iceland, especially for passengers looking to make the most of a shorter stopover in Iceland. The view from Hotel Keilir is unique both from the street and oceanside. There are a number of quality restaurants in the vicinity and the Blue Lagoon spa and resort is just 15 minutes away. Reykjavik is 40 minutes by bus or car."}