{"user_rating": 4.5, "review_count": 515, "name": "Hotel Ceilidh-Donia", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The rooms of this hotel are exactly what you would expect from a European Inn, small but cozy and comfortable. The bathroom is spotless and the shower was perfect. The proprietors of the establishment are always there to help and the breakfast in the morning is quintessential Scottish and just what you need before your day in Edinburgh. This hotel is about a 20 minute walk from the royal mile, however we enjoyed the walk each day and night because you get a glimpse of the city away from the touristy areas. Also there is a bus around the corner if you don’t feel like walking. Great stay overall.", "title": "A must stay while in Edinburgh", "user": "topgun151", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 109455098}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This was our first stay at the hotel, booked mainly because of favourable reviews on Tripadvisor and we were not disappointed. We were met with a friendly and informative welcome and our room was spacious, very clean, and comfortable, and the power shower was amazing, especially as we were staying in Edinburgh to run the Marathon! The hotel, while not in the centre of the city, is conveniently located, about 10mins bus ride (or £6ish taxi fare) to North Bridge/ 25 mins walk to Holyrood Park. The breakfasts were delicious and nothing was too much trouble for the owners or any staff member we encountered, including a packed breakfast waiting for us downstairs on our very-early departure. Oh, and the two docile resident dogs were adorable. Would definitely stay again!", "title": "Highly recommended.", "helpfulness": 1, "user": "JonesTheSteam_77", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 109454174}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We chose this hotel on the basis of favourable comments on tripadvisor and were not disappointed. As well as enjoying excellent hospitality we were also impressed with the care that is taken to ensure guests are given information that will help them get the best out of their visit. It is close to frequent buses that go to Waverley/Princes St (don't even think about driving) and we were given a map that also shows the best restaurants within walking distance. We slept well during our visit and enjoyed the wide choice at breakfast. If we return to Edinburgh in the future we will stay here again.", "title": "Everything we hoped for", "user": "terryjones52", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 109301364}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Arrived in Edinburgh on Friday 29th April 2011 to be met by joint owner Annette who provided a very helpful fact sheet in relation to transport, local resturants and information about Hotel. The room was nicely decorated and very clean with excellent power shower. Breakfast was excellent and all the staff very friendly. Met Max other proprietor in evening and again very helpful and well coming. Would have no hesitation in recommending this hotel.", "title": "Excellent small friendly Hotel", "user": "apple032", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 108993436}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The Ceilidh-Donia is a 1800s row house converted to a small hotel. The owners Max and Annette are awesome. They are hands-on and very attentive. The rooms are super clean and up to date (all renovated within the last couple of years). Our bathroom was spotless. There is no elevator, so you will need to be able to navigate stairs. Note: There is a dog on the premises. I think there are only 12-18 rooms. There is wireless access, but the reception is not great. There is a free, public computer and printer. There is a restaurant on the ground floor for guests only. They are open for breakfast and dinner only. They have a VERY GOOD continental breakfast (pastries, yogurt, cold cereal, juices, fruit, etc) for free and full service (heavy breakfast) for charge if you prefer. The location is very quiet as they are in a residential neighborhood in south Edinburgh. The hotel is NOT walking distance to downtown, but it is 200 meters from the bus stop (super easy to use - 8 minute bus ride to the central district). They are within 500 meters of Prestonfield Golf Course. There is a nice little lounge where you can relax and talk to other guests. Parking and traffic is terrible in Edinburgh, and parking at the hotel is quite difficult as well (no off-street parking). Consider not renting a car and taking the Airlink bus to central Edinburgh (Waverly Station) and then cab or local bus (30, 33, 14) to the hotel. You can get everywhere in Edinburgh with public transportation and the city is small, so taxi cost is not crazy either.", "title": "Super small boutique hotel with easy access to downtown and great owners", "helpfulness": 1, "user": "chuckwagon1", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108922056}, {"rating": 3.0, "stay_parameters": "Stayed May 2011", "text": "We booked a room with 2 twin beds. However, the room was at attic and was extremely small. The bathroom could barely fit a person. I thought maybe it was Edinburgh standard. However, we moved to another B&B half block away few days later but it was an excellent spacious well maintained room. So i didn't feel I got my money worth with this hotel.", "title": "You can get better room at the same price in the same neighborhood.", "user": "Ikatfloral", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 112330240}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My elderley Father and I stayed for 3 nights. The rooms were very well decorated and comfortable. Breakfast was very relaxed with plenty of choice and the dining room was very nice. The weather was lovely and we were able to sit out on the decking one evening which was very pleasant. We have previously used the Premier Inn in Edinburgh but would certainly not consider going back there (for more money and no breakfast) after finding this little gem. Parking was never a problem and I took the bus into Princes Street one morning with no difficulty at all ( 2 mins walk to the bus stop and 10 mins ride into town). The stairs are quite tricky if you are a little unsteady on your feet but ground floor rooms are available.", "title": "Very comfortable, friendly small hotel-hope to visit again", "user": "ClaireB66", "date": "June 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 111932972}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I stayed here while attending a conference at the John McIntyre conference centre at the University. The hotel is perfectly located for the conference centre - it's a lovely short walk away.", "title": "Lovely hotel", "user": "em_from_london", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 110931300}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This hotel is cozy and welcoming- a lovely little place to stay. The owners are warm and generous, and the hotel is an excellent value. The bed was comfortable and the room met all of my needs. There was free wifi and the breakfast was good and plentiful. I loved the dozing sheepdogs in the front hall.", "title": "\"Plenty of room at the Hotel Ceilidh-Donia...\"", "helpfulness": 1, "user": "aliasbcc", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110569136}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Highly recommended!", "title": "Very nice hotel", "user": "Neil L", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110154030}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Not your typical hotel. A B&B located in a very quiet neighborhood. It is nice to see the smallest comforts from home such as wash cloths. It is very cozy with its own bar and dining room with a good breakfast. It has a lobby with DVD's, books and TV. It is located about 7 minutes from town by car and one block away you can take a bus that will get you there in 15 minutes. Do not hesitate to book this B&B.", "title": "It's the little things...", "user": "kmason5727", "date": "June 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114909854}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Me and my boyfriend stayed for two nights, we drove up and were very pleased with the free parking outside. Annette made us feel very welcome and provided us with information about buses and restaurants etc.", "title": "Absolutely loved it, we'll be back!!!", "user": "Sammy1982-12", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114741322}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "The room was lovely and clean and the shower was great, the boost setting was fantastic!!! I loved the fact that we had facilities in the room to make tea, coffee and hot chocolate (the buscuits were lovely too). It was in a fab location, we walked into Edindburgh which only took about 20 minutes.", "title": "Really special friendly hotel", "user": "B_Family_2+2", "date": "June 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 114729873}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "There's was lots of choice at breakfast and it was delicious, great way to start the day.", "title": "Excellent Hotel", "helpfulness": 1, "user": "SueGWorcester", "date": "June 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 114688675}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "We got to meet the dogs too :).", "title": "Best experience in many years of travel", "helpfulness": 1, "user": "Robin_morgan99", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113902055}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We had a fantastic stay at the Hotel Ceilidh-Donia, the place really felt like home. We really liked everything about the hotel; all our needs were catered to. The owners Max and Annette were lovely; they were really friendly and very helpful. If we went back to Edinburgh we would definitely stay there again.", "title": "One of the best hotels I have ever stayed in, we would definitely go back.", "user": "LuLu-Witch", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113900012}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "The hotel was very clean and well furnished, the rooms were a good size, the bed was comfortable and the shower was fantastic. Breakfast was gorgeous with a good selection of quality food to suit all tastes. There is a little decked area overlooking a nice garden and water feature where on a nice day you can sit outside to eat your breakfast.", "title": "Warm and friendly", "user": "therearenonames", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 113004051}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The only improvement I could suggest would be a 5th fish that isn't as lazy as the others! ;-)", "title": "This was the perfect place for a couple of tired travelers!!", "helpfulness": 1, "user": "651Arn", "date": "June 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112796632}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The hotel doesn't have a lift so if you struggle with stairs like me you would be better asking for a lower floor; fortunately I was aware of this before I booked so I wasn't caught out.", "title": "A lifesaver! stay at this hotel!", "helpfulness": 1, "user": "douglaspatterson88", "date": "June 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112641656}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The location of the hotel is nice too, it's in a peaceful area but at the same time it's close to the centre of Edinburgh. It cost us on average £8 in a taxi from our hotel to Princes Street but there are several bus stops nearby if you would prefer to take the bus.", "title": "Too pricy for a non hospitality and an unconsiderate small room", "helpfulness": 2, "user": "diptirishkesh", "date": "June 9, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 1.0, "service": 1.0}, "id": 112401601}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 3, "average": 17, "very good": 136, "terrible": 5, "excellent": 354}, "aka": "Ceilidh Donia Hotel Edinburgh", "slim_ranking": 0.0205479452055, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "A warm Scottish welcome awaits at the Hotel Ceilidh-donia, Edinburgh. Hotel Ceilidh-Donia Edinburgh offers great value three star accommodation when visiting Edinburgh, the historic capital city of Scotland. Max and Annette Preston, together with their children Hayley and Struan, invite you to enjoy your holiday, City break or business trip in Edinburgh at the Hotel Ceilidh-donia with full facility accommodation."}