{"user_rating": 4.0, "review_count": 515, "name": "Hotel Verta by Rhombus", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Spent a Saturday night at this hotel after getting a decent discounted bed and breakfast rate online (£110). Having read some of the reviews we were a little apprehensive, but by and large it was a decent stay. Check in was smooth and the concierge offered to take our bags to the room. That was helpful as when we got to the room the card wouldn't open it. so the concierge let us in and then went to sort it out. One of the nicest aspects is the fact that everything is new and shiny. We enjoyed the pool and spa facilities, with the stainless steel bottomed hydrotherapy pool and fabulous sauna and steam room. Although we opted for a city view room, they allocated us a room with a partial river view which was good. And as the building is circular the room was a nice shape rather than the usual corporate box. Massive TV in the room plus one in the bathroom! Couldn't quite work out the lighting in the room, and we did find it a tad hot even though we had turned it down to 17 celcius. Bed was massive and really comfortable. Had a drink in the bar but only looked at the prices afterwards - £8 for a glass of rose wine, although this was slightly eased by the fact they knocked 25 percent off as we were staying at the hotel. Breakfast was pretty good - we enjoyed the relaxed atmosphere in the bar area, although some of the food was just lukewarm rather than piping hot. Drawbacks? Well, it is true the hotel is bit far from the centre. We got a cab from Clapham Common tube and it was about £15 a pop each way. And both times we ordered a private hire cab from the hotel the drivers didn't really have much of a clue where they were going. The first time we were going to the London Studios at the South Bank complex, which is pretty well known, and the driver had to phone his office and in the end I had to go online on my mobile and give him a postcode. And the service, while OK, was a bit hesitant. Every member of staff seemed a bit unsure of themselves and a bit nervous. It was almost as if they were still in training with no previous experience. Overall though, taking into account the facilities, it was good value as we'd have paid at least £150 more per night for the equivalent in the centre of London.", "title": "Pretty good for the price", "helpfulness": 1, "user": "Peejdj", "date": "December 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 147080704}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I studied the reviews and pictures on trip advisor and made a decision to book this hotel after extensive research.", "title": "A complete disaster, 0 star service.", "helpfulness": 8, "user": "Deehop87", "date": "December 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 146967384}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I had tickets for \"Warhorse\" fifth anniversary, so a special night was awaiting us.", "title": "Luxury London hotel but not at London Prices.", "user": "julesbirdie", "date": "December 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 146952909}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Upon check-in at 3pm we were informed that the room was not ready....no big deal. The receptionist asked us if we were happy to wait in the bar and we would be informed when our room was ready. No problem. In the meantime the receptionist told us that there was some complication over our reservation and that we had booked 2 rooms.(Receptionist getting stroppy.)", "title": "Not 5 star", "user": "Bonniegirl", "date": "December 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 146785346}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had NOT reserved 2 rooms. I had booked through Trivago and had an invoice and a hotel voucher for 1 room.", "title": "Room for improvement", "user": "ben m", "date": "December 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 146743428}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Nice well appointed hotel, food not great, sent it back after waiting 45 min and it came back just warm!! Nice people not organised and lack fun, staff dont make eye contact and seem programmed or untrained in hotel management and service, but very nice people.", "title": "nice place", "user": "tmcd1", "date": "December 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 146652243}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Will give it another chance see how its picked up.", "title": "Low price, but you get what you pay for; and not Five Star", "helpfulness": 2, "user": "RunningSteve", "date": "December 2, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 146648934}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Helicopters landing are exciting back drop to the bar.", "title": "Not quite as good as last time", "user": "Maskells1", "date": "December 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 146633551}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "This is a very reasonably priced hotel. It is comfortable and pleasant and offers a range of services. It claims it's a five star, and has some of the facilities of a five star (24 hour cooked room service meals, valet parking, and a spa), but lacks a restaurant, and lacks the quality fittings and general service and customer care one would expect. While offering value for money hotel rooms, this has to be considered against some of the draw backs. The location is remote from public transport and amenities, but can be managed. You would do well to bring your car, but park it in the streets nearby, such as near York Gardens, rather than pay the £25 a day to park in the hotel. Be aware that the street the hotel is on is not attractive - it's a former industrial site that is being developed, and walking around can be a little awkward, especially as cars will park on the pavement blocking the entrance to the hotel. However, the hotel itself, while having a modest entrance which is difficult to pick out, is pleasant enough once you are inside.", "title": "Fabulous hotel but allow time to get about", "user": "JemmaB", "date": "November 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 146512236}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The customer service, though, needs working on. The staff are pleasant people and are very well meaning. They want to please, but most simply appear not to have had the training or experience to provide the quality service they and you would want. I had been concerned when writing to the hotel beforehand to confirm if my booking included valet parking. The reply was poorly written and contained several spelling errors, but - worse - was unclear on the rate. On asking for clarity, I got a different reply, so I was left unsure if an overnight parking stay costs £25 or £50. On arriving at reception there were three staff at the desk. Two looked up at us, then returned to the person they were dealing with, the third was busy with paper work. We were not greeted or acknowledged or smiled at. We waited a considerable time. At least five minutes. With three staff at the desk, and only person in front of us, this seemed odd. When a receptionist was free I offered my receipt from LastMinute which gave details of my booking. The receptionist said she didn't need it, and just asked for my name. Fine. The booking in took some time, which I assume was due to the receptionist being new. She then had to turn her back on us to go get our room card from a different room. This appears to be standard procedure. Whoever designed the booking in system didn't seem to be considering the impact this has on customer service. It takes a while. And you have been abandoned before the welcoming process has been completed. Anyway, fair enough. We were informed where our room was, where the lifts were, and where breakfast was - in the bar. I checked that. Yes, in the bar. I asked if there were proper tables and chairs in the bar. Yes, was the reply. We weren't offered assistance with our bags. We didn't want assistance, but for four star quality - let alone five, such an offer should be made. We had paid extra for a river view. Our room looked at the building opposite. Back to reception. Still three people behind the desk, two staff dealing with three quests checking in, third doing paper work. A porter noticed we had returned to reception with our bags, and asked if we needed assistance. We explained we had the wrong room. He asked us to wait. So again we waited. Finally got to see a receptionist who took a while to check our details. The check in software they are using must be slow or inefficient. We were offered a corner room. It didn't sound ideal. I asked if there was anything better, but that's all they had. So we got a room with mostly a view of the opposite building, but also, just about, a view of the river. Having just checked, this is not what they call a River View Room, so I will be complaining.", "title": "Nice but.....", "user": "TestConsultant", "date": "November 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 146459289}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "So you walk into the room and the first impression is good. It's big with a nice looking bed, clean, comfortable and all that palaver. Contemporary too. Modern, without being cold (no danger of it being cold - more on that in a moment). Big telly above the bath too - exciting. cool. Da da da. So all should've been good.", "title": "Too hot....", "user": "Conniwot", "date": "November 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 146411099}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "But here's the problem. You can't sleep. It's just too hot in the room and there's no way of regulating the temperature. Oh come on mate, I hear you thinking, what about the air con. Simple. It didn't work. Nor did the telly and you'd need a degree in electrical engineering to work the room's ridiculous ambient lighting. So we didn't sleep, we couldn't work the lights and the telly in the bath remained an enigma.", "title": "Lovely Hotel, Good Location, Great View", "helpfulness": 1, "user": "Deborah B", "date": "November 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 146371175}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "A hotel that could've been good was completely and utterly awful. Other than the valet parking; nice fellow who I forgot to tip - sorry.", "title": "LOVED IT!!", "user": "imlivid", "date": "November 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 146326819}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This was a lovely surprise for my birthday from my husband.At first I was a little surprised at the location as it seemed more industrial but you forget that once you're in there. When we first arrived our room wasn't ready and they very happily offered an upgrade. The room was lovely, clean, warm and with a fantastic view of the London Helipad! The room was quadruple glazed so you don't hear the Helicopters at all, we thoroughly enjoyed watching when they landed and took off!", "title": "Brilliant Hotel, Poor Location", "user": "TrevorYorkshire", "date": "November 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 1.0}, "id": 146245011}, {"rating": 2.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The Spa was great as was the bar. The restaurant was closed when we were there which was a shame but didn't spoil the evening. Food was lovely and the Cosmopolitans should definitely be tried ;-)", "title": "Lost its 5 star touch", "user": "Workaholic055", "date": "November 26, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 146211244}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Enjoyed the stay so much. Fantastic room overlooking the helipad and the Thames. There is only a faint hum from the helicopters which is an achievement as they are incredibly loud when you are near them outside. Great watching them come in and out, both at day and sometimes early evening in the dark.", "title": "Really good", "helpfulness": 1, "user": "andrew1211", "date": "November 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 146003091}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "The room was first rate. Various light settings/switches which took some getting used to causing me to turn them all off plunging my girlfriend into darkness when she was in the bathroom! Huge plasma TV, lovely comfy bed although I prefer my pillows a bit firmer. Tea and coffee facilities, bath robes, slippers, quiet air-con, free bottles of water all included. Bathroom top class. Great shower, big bath, lots of Molten Brown toiletries etc always replenished. There is even a TV at the end of the bath, first time had one of those, although the picture quality isn't so good when you are laid full out in the bath!", "title": "Great escape", "user": "kj0", "date": "November 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 145818028}, {"rating": 5.0, "title": "Well worth a visit", "text": "Spa area was lovely with a small but fab pool with different jacuzzi and jet things in there. Tropical showers, sauna, steam room, foot massagers etc. At one point I had the whole place to myself.", "user": "Breezylouisee", "date": "November 18, 2012", "id": 145688464}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Breakfast, which we had included, was nice enough and again a nice setting on a sunny morning against the backdrop of the Thames. Wouldn't be worth it though if you were paying for it separately. Service not bad, but a bit patchy on the second day.", "title": "Best hotel we've stayed in!", "user": "LeneBudd", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145679887}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We booked in full knowledge of its location and previous comments on here but we didn't find it too bad. Yes if you are constantly in a rush and need to be places on time then maybe somewhere more central would be better. However if you are more chilled and can afford to take your time with buses and a bit of walking then the affordable price of the hotel for the quality you receive more than outweighs any negatives about its relatively remote location. It's a 15 minute walk to Clapham Junction although there is no tube there, just the mainline station where you can get a short connection to Victoria and Waterloo. We took the bus, a short walk away on the main road. We were never waiting more than a few minutes and it took about 15 minutes to reach Victoria for onward connections. The bus numbers are 170 and 44 both very regular. obviously you need an Oyster card to make it economical. We also used the shuttle to Sloane Square on both mornings, which you book in advance, and we had no problem with this. We then walked to the museum area from there.", "title": "Fantastic Stay", "user": "ghamilton23", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145665294}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 20, "average": 60, "very good": 173, "terrible": 19, "excellent": 243}, "aka": "Hotel Verta By Rhombus London, England", "slim_ranking": 0.224907063197, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 3.5}, "description": "Located on the south of the River Thames, adjacent to the London Heliport and within easy reach of Chelsea and Sloane Square; Hotel Verta by Rhombus provides the perfect destination when visiting the capital. From panoramic views of the River Thames, the intimate ambience and the very modern facilities, Hotel Verta by Rhombus has become London's most exclusive 'Hidden Gem'.The hotel's design, inspired by the Halcyon days of aviation, combines timeless elegance and the lobby is a striking double height atrium with a signature sweeping staircase up to the mezzanine level. All of the 70 bedrooms are fully furnished in a classic modern style, each with original artwork and the finest bespoke fittings.All day dining is available in the elegant Ambrosia located on the mezzanine level. A glamorous, fun and contemporary bistro/bar perfect for meeting friends and family for afternoon tea, informal meetings and after work drinks. As dusk falls, Champagne is the signature drink and guests can dine whilst admiring the views.The two level subterranean SPA Verta offering an innovative sanarium, heated loungers, steam room, sauna, gym and signature spa treatments, sets Hotel Verta by Rhombus apart from any London Hotel.Settings don't come much more inspiring than this, with the majority of our hotel meeting room facilities in London, featuring panoramic views of the River Thames and the London Heliport. Features include floor-to-ceiling windows and flexible inter-connecting options, when it comes to keeping you in touch; we have state-of-the-art audio-visual and telecommunications equipment, as well as wireless throughout. Hotel Verta by Rhombus offers 7 Meeting Rooms for between 12 to 200 delegates.Hotel Verta by Rhombus is the most wonderful, unique and romantic London hotel location in which to hold your wedding. For this very special occasion, we will enchant you with its addictive atmosphere and seductive environment, providing you and your guests with a magical wedding experience. The romance of Hotel Verta by Rhombus is beyond compare and has everything to make your wedding experience unique - superb cuisine, magnificent settings, meticulous and personalised service. The individuality of each couple is reflected in the smallest and most important details. Hotel Verta by Rhombus is licensed for civil wedding and civil partnership ceremonies with a dedicated Wedding Co-ordinator to help you organise the finer details of your special day."}