{"user_rating": 4.0, "review_count": 498, "name": "Hotel Monte Carlo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "I've recently returned from a very enjoyable 3-night stay at the Hotel Monte Carlo in Paris. I highly recommend this little gem of a hotel to anyone seeking affordable accommodation, excellent customer service, and a perfectly located base while visiting Paris.", "title": "Wonderful Stay at Hotel Monte Carlo", "helpfulness": 32, "user": "CanuckTraveller07", "date": "October 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10190722, "likes": {"liked": "— Cozy environment, very clean, friendly staff, excellent location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "I was lucky enough to get a room in the back corner of the top floor of the hotel, so street noise was not an issue at all - extremely quiet. I had a double bed, with no ensuite facilities, for €70 per night. The rooms are quite small (and, unfortunately, not very soundproof) but the size of the room - and the rich, warm colours that the entire hotel is decorated in - only adds to the charm of this hotel. The cat motif is everywhere in the hotel (which I loved); it's a shame the cats are no longer in residence. There was always fresh towels and sheets provided, and a pleasant, fresh scent would prevail after the room had been cleaned. The room itself had everything needed during a visit - telephone, heater, flat-screen TV, in-room sink (with shampoo & shower gel provided), and a safe where you could lock your valuables away and not worry about them being stolen. This is, however, a very safe hotel as is the general area around it. The shared facilities were always fairly busy but the shower & toilet was kept extremely clean; I heard housekeeping cleaning them at various points throughout the day. The bed in my room was incredibly comfortable and you seemed to sink in, yet be firmly supported.", "title": "I would stay here again!", "helpfulness": 27, "user": "sarah095", "date": "October 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10165027}, {"rating": 2.0, "title": "Dazed and Confused", "text": "The staff at the hotel are very firm about check-in time - they will not allow you to check in prior to 15:00, but if you do arrive early they will hold your luggage at Reception while you explore Paris until check in time. A cold buffet-style breakfast is provided each morning, which is absolutely delicious. I did feel, though, that €9 is a little steep in price but there is a wide variety of food and plenty of it. You can get a cheaper breakfast in the area around the hotel, but it will be Continental. There is a very small lift in the hotel, which is good as the stairs are very steep and winding (just be prepared for the sudden stop of the elevator when it comes to your floor!). For those traveling with laptop computers there is free in-house WiFi, but you need to bring your laptop to the lobby in order to connect.", "helpfulness": 1, "user": "Anna_von_M", "date": "October 18, 2007", "id": 10107796}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The location of the Hotel Monte Carlo is perfect - many of the main areas/sites of Paris are walkable from the hotel. The hotel is very close to the Grands Boulevards Metro station and is a close walk to Gare du Nord and the Opera, where you can catch the Roissy bus to/from Charles de Galle airport for €8.50.", "title": "Great Experience and Friendly, Clean Hotel", "helpfulness": 31, "user": "traveler581", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10090393}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "All in all, a great stay at the Hotel Monte Carlo in Paris. The staff are very pleasant and helpful, and Thomas (the owner/manager) always made fantastic efforts to ensure everything was perfect for the duration of my stay. Highly recommended!!", "title": "I would recommend it to a friend!", "helpfulness": 33, "user": "calderara", "date": "October 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10069923, "likes": {"liked": "— location, good service"}}, {"rating": 5.0, "title": "A home away from home in Paris", "text": "This is a wonderful small hotel in an excellent location, close to the Opera Garnier and Grand Boulevards. I stayed here for seven nights in november this year. The hospitality and courtesy from the staff was superb,welcoming and nothing was too much trouble. They put their guests first and it was a home away from home. A very busy noisy street but with the double glazing on the windows, it was no problem. Rooms vary in size so best to inquire which would suit your needs best. Some have ensuite and some without bathroom which is in the hallway. The street has a number of good cafes plus a small night market and the metro Peletier is only a five minute walk away. Thanks to Thomas and his staff, I will definitely stay there again next time in Paris.", "user": "kiwikidNewZealand", "date": "December 19, 2007", "id": 11681164}, {"rating": 5.0, "title": "Loved it !", "text": "My mother and I spent 4 days here and loved it! Our room was on the second floor with the windows overlook to street but this was not at all a problem. It was quiet ! The room had a desk, good firm bed, safe box, good hot shower, clean sheets and towels: the principle things for a hotel room. For us the most important was location. The hotel is situated within a walking distance to the Opera and main shopping centers and till the avenue Champs Elysse, it is 15 min by metro and it is a direct line. We found it very convienient!", "user": "SaraandAnna", "date": "December 13, 2007", "id": 11527459}, {"rating": 3.0, "title": "Good Hotel", "text": "All the days we were out visitig Paris, small parisian cafes , galleries and restraunts, so we had no time to watch TV. Lobby person who greeted us was very helpful and friendly. He gave us a map and pointing out the attractions we shouldn't miss in the area. Staff is courteous and efficnient. We would definetly return here!", "user": "FMAM", "date": "December 12, 2007", "id": 11497905}, {"rating": 5.0, "title": "Perfect location and cosy hotel!", "text": "I booked this according to the reviews is TA", "user": "il0veparis", "date": "December 7, 2007", "id": 11294375}, {"rating": 3.0, "title": "OK but I can't see why it has all these rave reviews", "text": "The positive aspects are that the hotel is near restaurants, bakeries and a small supermarket.", "user": "Writerwriter", "date": "December 4, 2007", "id": 11247062}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Spent one night at this hotel and thought it was excellent. All was really clean, staff friendly and efficient . I arrived expecting to share bathroom but found to my surprise all was ensuite! A lucky break.. Location is really good - within walking distance of Gare St Lazare and Gare du Nord and easy to reach from metro. Would definitely stay there again.", "title": "Great value", "helpfulness": 27, "user": "Alimac04", "date": "September 4, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8653845}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Stayed in the hotel for 3 nights in August. Its situated between 3 metro stations so its pretty easy to reach from wherever you are apart from the airport (CDG) which is slightly trickier.", "title": "a nice find", "helpfulness": 26, "user": "bing1978", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8380691, "likes": {"liked": "— location, price, staff", "disliked": "— room AC not great"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "To start with the reception is always staffed and they always greet you when you arrive with a smile. All the staff we met spoke good English and were very helpful. We never ate there at the hotel so I cannot comment on that.", "title": "It took two visits to make a great find.", "helpfulness": 6, "user": "GandT16", "date": "August 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 8365798, "likes": {"liked": "— The proximity to great food, Montmartre and the reception.", "disliked": "— The bathroom and the very warm room."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "The room was a-bit odd and looked as though it had been two rooms some time ago but this wouldn’t be a problem. The bed was nice; a lot of closet space and bath room was also very nice.", "title": "Fabulous Hotel, great neighbourhood", "helpfulness": 26, "user": "Laura_go_go", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8359983, "likes": {"liked": "— Location and the amazing decor - very original", "disliked": "— There was a very small common area but no-one seemed to congregate here - but other than that I didn't dislike anything"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the Hotel Monte Carlo for 3 nights all up, broken in the middle by an out of town stay. Our first room was the one next to the elevator, so it seemed that the room lost space because of this. The decor was very nice and the french doors opened to the front street, which we loved.", "title": "Will happily go back", "helpfulness": 24, "user": "Lesley M", "date": "August 5, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8355979}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Very average hotel despite the reviews. The people working at the hotel were friendly. but the rooms were really really small, the bathroom was kind of dirty, with a small shower with a mildew covered shower curtain that hugged you everytime you had a shower. Plus it got really really hot at night with the heat, and you had to open up the windows which faced a dirty little area between the buildings. The hotel serves its purpose if you are out all day and only come back to sleep, which is what we were looking for. My main problem with this hotel was that the bathroom was not clean when we went in.", "title": "Avg hotel despite rave reviews", "helpfulness": 1, "user": "fh1234", "date": "January 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 12863508, "likes": {"liked": "— location", "disliked": "— rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I love Paris and I come rather often. This time I came to see my parisian friends and stayed at hotel Monte Carlo for 5 nights. It was a realy nice stay. On my arrival I was greeted very warmly with a smile that in Paris is a rare thing. The room was clean and warm ( it was rather cold outside) and the daily room service women were very polite, asking me if I wished my room to be cleaned. They did not disturb without need. I felt very comfortable there.", "title": "Loved this hotel!", "helpfulness": 8, "user": "HelenD020", "date": "January 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12846024, "likes": {"liked": "— everything"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "There is no need to tell that the location is perfect. A lot of touristic places of interest are situated nearby. But as for me, I prefer to explore the steets with a lot of small pretty boutiques and to take a creamy coffee in tipically parisian bistros and cafes.", "title": "Great Location, Friendly Staff, Clean rooms", "helpfulness": 7, "user": "ravina", "date": "January 15, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 12630408, "likes": {"liked": "— the room was comfortable", "disliked": "— the price was a bit steep for our purposes as we just needed a bed and would have been better off at a hostel."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I appraciated a lot all the staff.", "title": "Comfortable, convenient and good value", "helpfulness": 11, "user": "Ainol-Razman", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12350961, "likes": {"liked": "— location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "I will stay here again and I will recommend it to others.", "title": "Absolutely great stay!", "helpfulness": 17, "user": "Travellers095", "date": "December 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11941298}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Earlier this month I had a four night stay at this hotel and it was a brilliant find.", "title": "Great Value, great location, great staff", "helpfulness": 26, "user": "Shazzy1", "date": "September 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8852040, "likes": {"liked": "— Hellpfulness and frendlyness of staff"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007", "text": "The staff were really friendly and helpful from the moment we arrived til the day we left.", "title": "Definitely stay here again!", "helpfulness": 27, "user": "neuehaff", "date": "September 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8827389}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We were a bit concerned having booked a room without bathroom facilities but the shared facilites were immaculate. There is only four floors to the hotel and a max of ten rooms per floor, some of which had their own facilities. We also had maid service every day. Our room faced the back and was very peaceful!", "title": "Charming hotel in a great location", "helpfulness": 29, "user": "victorylehmann", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8718910}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Would deff. stay here again!", "title": "I am recommending this hotel to everyone", "helpfulness": 32, "user": "Canada14", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8662793}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Before booking we have checked the reviews , and agree that this is a good-value well-located hotel for Paris sightseeing. It is situated at the centre of Paris and so you could practically walk to any famous/popular parts of the city. It's less than a 10 minute walk to the Opera house, and 20 minute walk to Louvre. The metro is a 2 minute walk from the hotel.", "title": "Excellent Value", "helpfulness": 28, "user": "Wanderingwardy", "date": "September 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 8661961}, {"rating": 5.0, "title": "Great hotel!", "text": "I have stayed in this hotel just for 2 days and I would be glad to stay more but I had to leave Paris to continue my business trip.", "user": "franco037", "date": "October 28, 2007", "id": 10400370}, {"rating": 5.0, "title": "We will be back for New Year’s holiday!", "text": "If I tell that my stay was great, the hotel was clean anb breakfast was good, I would just repeat the opinions of others.", "user": "happytravellers90", "date": "October 25, 2007", "id": 10319825}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "We were looking for a nice hotel in a cenral part of Paris, not far from subway and we choosed Hotel Monte Carlo in the Opera area. It was a good choice. No regret, only good things to tell.", "title": "Beautiful and friendly hotel!", "helpfulness": 23, "user": "Danna074", "date": "November 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10939559}, {"rating": 5.0, "stay_parameters": "Stayed November 2007", "text": "First of all the hotel is very well located near the opera house, big shopping centers and nice restaurants.", "title": "a very good hotel!", "helpfulness": 28, "user": "Chjenny", "date": "November 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10638779, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Good, quiet room. The heater was hot and there was a lot hot water in shower. Daily room service.", "title": "clean and friendly", "helpfulness": 27, "user": "itsumo_no", "date": "October 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10479715, "likes": {"liked": "— clean!", "disliked": "— nothing"}}, {"rating": 2.0, "title": "Friendly and helpful staff", "text": "The room is small, but was very clean. Our room also had a bathroom which was small, but nice and clean. You may want to make sure that your room has a bathroom before you book (if that matters to you). The interior walls are a little thin, but not bad. The window to the street blocks out almost all of the street noise, which was very nice. We really didn't have an issue with noise at all.", "user": "etravel2007", "date": "October 10, 2007", "id": 10062128}, {"rating": 3.0, "title": "Clean anf friendly", "text": "Paris is a great city and we loved it. I would definitely stay at the Monte Carlo again!", "user": "StingrayLincolnUK", "date": "October 9, 2007", "id": 10060742}, {"rating": 5.0, "title": "If ever in Paris I will stay there again!", "text": "In Paris there are millions of hotels but to find a good one could be a problem! It was not my first visit to Paris but it was the first time I have stayed in this hotel. Hotel Monte Carlo is a true gem in the heart of Paris.", "user": "levitt", "date": "September 29, 2007", "id": 10017275}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 2, "variance": {"poor": 16, "average": 64, "very good": 201, "terrible": 8, "excellent": 209}, "aka": "Monte Carlo Paris", "slim_ranking": 0.200780814278, "description": "The hotel Monte Carlo in Paris benefits a central location in the 9th area of Paris between The Opera Garnier, Montmartre and Grands Boulevards. The most famous monuments and museums like The Eiffel Tower, Museum of Louvre, Notre Dame de Paris or L'Arc de Triumph are accessible easily by subway. Three subway stops \"Le Peletier\", \"Grands Boulevards\" and \"Notre Dame de Lorette\" are near the hotel and permit to visit all Paris. The nearest museums and monuments are Museum Grévin, L'Opera Garnier, Basilique Sacré-Coeur as well as grands magasins Galeries La Fayette et Printemps for shopping. The area of the hotel is a lively place with lots of antique stores as well as the auction house \"Drouot\", parisian cafes, restaurants, bars and the famous restaurant \"Bouillon Chartier\", supermakets and a small traditional market Cadet. The hotel interior was created by the designer Sofi Bollack-Klarwein. The hotel is a cosy place, done with love and taste where the owners welcome the guests."}