{"user_rating": 3.0, "review_count": 85, "name": "Hotel des Deux Continents", "reviews": [{"rating": 4.0, "title": "Location, location!", "text": "Stayed here for five nights mid February. Though the room was quite small, we did not spend a lot of time in the room so it was not an issue. Staff could not have been any more friendly, even after we shorted the electrical system by plugging in a hair dryer. Best of all is the location! All the major sites are within easy walking distance from the hotel and within a five block area of the hotel are many small shops and restaurants. Definitely opt for a larger room.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "February 20, 2004", "id": 1662810}, {"rating": 4.0, "title": "Keep coming back", "text": "I regularly go to Paris for business (1-4 times a year), and I often stay here. It's not a business hotel at all, but that's fine with me.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "December 21, 2003", "id": 1525750}, {"rating": 4.0, "title": "Great location", "text": "It's cozy and comfortable, small and quaint (without being too quaint), and affordable given the location. I always try to get one the rooms on the top floor facing the street (rue Jacob) because they have little balconies and you look out and see La Grande Arche at La Defence and the top of the Notre Dame steeple. Ask for one of those rooms well in advance of your trip. Don't bother with the hotel breakfast -- there are a plethora of cafes up on Boulevard St. Germain with the same or better price plus you'll get to watch the Paris street scene.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 23, 2003", "id": 1420374}, {"rating": 2.0, "title": "not a big fan of this hotel", "text": "The main drawbacks of the hotel are that most of the rooms are very small and if your room isn't facing rue Jacob, you have a view of the nondescript interior courtyard. The other drawback, at least for me, is that the area is mobbed with tourists. So I tend not to stay there during summer months.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "October 14, 2003", "id": 1386813}, {"rating": 4.0, "title": "Fabulous experience at Deux Continents", "text": "On the other hand, it's a great place to stay if you're in Paris in early June during the Fete de la Musique, when for one evening there are free street performances all over Paris of all kinds of music. In a tiny plaza in a little street near the hotel, wonderful opera singers perform each year during the festival. Have you ever stood right next to an opera singer while they're singing? If you don't appreciate opera, you will after this. I know this is a distraction from the hotel review, but the other place to go during the Fete de la Musique is the place de Vosges over in the Marais, where they hand out lyric sheets of French songs and everyone sings along ala campfire sing-alongs. You learn the melody after the first verse and then sing along with everyone else.", "helpfulness": 5, "user": "A.Jude", "date": "October 5, 2003", "id": 1375927}, {"rating": 4.0, "title": "Location, Location", "text": "Location is pretty much the selling point of this hotel -- right in the best part of the left bank. Near art galleries, new and used bookstores, Paul the baker, etc. Rooms are reasonably priced but extremely small. Staff is friendly and helpful. Avoid the hotel's breakfasts -- they are expensive and the coffee is like dish water.", "helpfulness": 10, "user": "thanford", "date": "September 11, 2004", "id": 2523967}, {"rating": 3.0, "stay_parameters": "Stayed October 2002", "text": "I first stayed at the Deux Continents in 1957, before St. Germain had become impossibly chic. 4 flights up, and the john in the hall.", "title": "good location", "helpfulness": 10, "user": "Jordy", "date": "July 13, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2294056}, {"rating": 3.0, "title": "Just returned from staying 5 nights...", "text": "Two years ago, wanting to remember time past, I stayed there again. Of course it was completely re-done.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "June 27, 2004", "id": 2225157}, {"rating": 4.0, "title": "Great location!", "text": "The interior room I had was tastefully decorated, but rather small and no particular view. The bathroom was clean and gleaming, but the WC quite cramped. Sitting and leaning forward on the toilet, my head touched the door. No need to elaboate. The location is good, and it's near the Place Furstemberg, one of my most favorite places.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 23, 2004", "id": 2218131}, {"rating": 4.0, "title": "Great location, friendly folk, average room", "text": "It's not within my budget, but it was very Proustian to remember the left bank and loves past, but in the future I know I can do better with my limited funds and will stay elsewhere.", "helpfulness": 6, "user": "gene4655", "date": "June 1, 2004", "id": 2142530}, {"rating": 4.0, "stay_parameters": "Stayed July 2002", "text": "If you are going to Paris . . . why stay in a Holiday Inn? This is the quinessential 6th Arrondissmont Paris Hotel! Minus the oh-so-common 'French' Attitude. The staff is marvelous! They made recommendations on restaurant selections, when to visit the 'busy' sites, and what metro line to take. We are so impressed that We've stayed here 3 times! The hotel's clientele tends to be European rather than American, so the breakfast room is filled with the chatter of all different languages!", "title": "So very French", "helpfulness": 5, "user": "KimberlyfromTenn", "date": "July 23, 2003", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 1144132}, {"rating": 4.0, "title": "Quaint, Comfortable & Convenient", "text": "Enchanting! The small rooms are adequate - not expansive; The tiny elevator is charmingly French! The 3* value is great - we've stayed in 4*s that were not as nice or as great a bargain! So convienent to major sites, great eats and the Metro! Don't let the word get out! Just keep this our secret Paris hotel!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 14, 2003", "id": 1136023}, {"rating": 4.0, "title": "A lovely experience", "text": "Our familiy had two rooms for four nights in June 2003. The hotel was very reasonably priced for Paris, and the location was perfect - in St. Germaine near cafe's, the De Buci market and two metro lines. The rooms were clean and quiet, a bit on the small side but not bad for Europe. The staff was very friendly and willing to help with any of our requests. Highly recommended!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 18, 2003", "id": 1099810}, {"rating": 4.0, "title": "Very Satisfied!", "text": "I stayed here with my Mother. We had a decent sized room 15sq. meters. Decor was nothing to rave about but, slightly charming and very comfortable....nice modern bathroom with all around shelves for our toiletries. Good closets and lots of drawers. We don't travel light. Unfortunately, there was no safe in the room, so we kept valuables at front desk. Breakfast was delivered to room within minutes of our request. Front desk staff was extremely cordial and helpful.", "helpfulness": 1, "user": "ritabryant", "date": "January 21, 2003", "id": 841432}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "variance": {"poor": 14, "average": 22, "very good": 33, "terrible": 8, "excellent": 8}, "aka": "Des Deux Continents Paris", "slim_ranking": 0.636363636364}