{"user_rating": 3.5, "review_count": 71, "name": "Hotel Eclipse", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I loved this place!! It was truly a home away from home. The staff were very attentive to the few idosyncrocies that occurred during my nine day stay - nothing major though, and the biiggest issue was no hot water but it wasn't even for a full day and the maintenance folks were there to fix it.", "title": "Great home away from home if you're not doing all-inclusive!!", "user": "johnny_tt", "date": "August 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 18884712, "likes": {"liked": "— Location!", "disliked": "— That I had to leave."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The rooftop deck and common areas were a real treat, as was having wireless internet throughout the hotel.", "title": "Website is deceiving!", "helpfulness": 1, "user": "babachi", "date": "July 27, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 18321900}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled solo", "text": "I can't wait to go back!! I'm sure its even better now as they were adding some new rooms when I was there. Amazing location if you want to take in the town of Playa.", "title": "My Home Away From Home", "helpfulness": 2, "user": "Pennylane155", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16753264}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The website for this hotel is COMPLETELY deceiving. We stayed in a \"grand eclipse suite\", which looked nothing like the photo. The room was very small, the toilet didn't flush, the sliding door on the balcony didn't lock, and the safe key was missing. We had read that breakfast was included, but we never saw it. On the evening we checked out, we were given the tickets for breakfast in a restaurant. We had already been there 3 days but were never given or informed about tickets and breakfast being off the premises.", "title": "We'll Be Back!", "user": "JoanieBlon", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16644931, "likes": {"liked": "— Comfortable bed, cold AC and balcony overlooking the street ~ also lovely jungle type courtyard!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "The hotel is very close to the shopping and restaurant area on 5th street, which is a plus, although you can hear the noise from the nearby disco, as the walls are very thin.", "title": "Very nice and clean place with terrible management", "helpfulness": 1, "user": "NikMosy", "date": "April 27, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15407341, "likes": {"liked": "— Central Location - Clean Rooms - Price", "disliked": "— The Manager"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I stayed here two nights and really liked this hotel itself. The room was huge, very clean and a great rate, $90 night. We had a balcony, as well as access to the jungle courtyard. The only complaint is the noise from the clubs a block away made it very difficult to sleep. If you're a light to medium sleeper, I would suggest finding a place further away from the clubs (Blue Parrot, etc.) Well, to be honest...I'm not sure which was worse, the women next door loudly complaining about the noise all night or the music itself. ;)", "title": "Cool hotel, good service and clean rooms...not for light sleepers.", "helpfulness": 3, "user": "tripsfromaustin", "date": "February 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 2.0}, "id": 98440733}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Our trip was 7 days long, around Yucatan. We stay at Eclipse for our first night, and it was very good night! After some days visiting Merida, Tulum, etc, we return to Eclipse, because it was the best place where we stay for all trip. Guys from reception Alehandro and Pedro are very helpful and friendly!", "title": "Best place to stay!", "helpfulness": 1, "user": "IvarsLV", "date": "February 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57265701}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled solo", "text": "The noise, starting at about 10 pm and escalated til about 4 am, most evenings I would imagine, ( I was there for two nights in the early week). This is now a mexican disco district, with lots of deep thumping riffs etc. etc. Go for it if this is your cup of tea.", "title": "Sleeping in a disco.", "helpfulness": 3, "user": "andymanca", "date": "February 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 56436511}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed at the Hotel Eclipse for eight days this past spring and found it wonderful. The staff Pedro, Alex, Roccio and the owner Peter treated us like family. One of them were always at reception to answer any questions, give advice, or just to chat with. Truth is I cant wait to go back.", "title": "Cant wait to go back", "user": "Drc183", "date": "January 23, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54160659}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Tequila Barrel was delish, the beds were comfortable and the housekeeper kept our room neat as a pin each and every day.", "title": "Service yes, hotel no", "helpfulness": 2, "user": "rbandy1", "date": "July 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 4.0, "rooms": 1.0}, "id": 35424814}, {"rating": 1.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I'm sure this used to be a nice little place. Very quaint, nothing fancy and a good location....before the clubs moved in. There are literally six open air bar/clubs beginning two doors down. They blast the music so loud, each trying to outdo the other, the windows in our room vibrated. My mistake, as I didn't check tripadvisor before securing a room here. We left after only two nights. Just couldn't take it and will never return. Don't be fooled into thinking the rooms off the road are more quiet. The music seems to echo and travel around the courtyard of this place. It's ruined this place, unless you like staying up until 5:30am, which is when the music and noise stopped.", "title": "No sleep until 5:30am at this place.", "helpfulness": 4, "user": "Knows", "date": "January 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 122473874}, {"rating": 1.0, "title": "Baite-and-Switch \"Sleeping in a Disco\" I should have read TripAdvisor!", "text": "Well part of it was my own fault not reading TripAdvisor! The title \"Sleeping in a Disco\" is right on. I arrived at midnight and all clubs were already in full swing. These clubs are right down the street and are one of the few ones opened till 4am. Immediately when I got here I was welcomed warm heartedly and told that noise would not be an issue they have double paned widows and then provided with ear plugs and instructed on how to use these. What brought me to the place was the location and also the style of the room, the Robinson Crusoe look. Well I got a different room a much bigger one but not want I had initially in mind. Another thing was the price, I was told that there is an extra 6% charge if I use my credit card. This was not indicated properly on the site, only if I pay cash will I not have this issue. The room was nice, staff very friendly, but if I had read TripAdvisor I would have picked up not only the noise issue each and every night of my 7 day stay but also the other complaints made about the sheets and mattress. In addition the bathroom sink had severe issues where the faucet was shorter then the basin making water leak all over the counter and difficult to place your hands under the faucet to get access to water.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 21, 2011", "id": 121947793}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I am totally not happy with the place. When one goes on vacation you expect that what you pay for is clearly stated, any pictures that show the room your are booking is exactly or closely follow with what you choose up front and and that any extra charges or fees are clearly indicated. If this is not the case and they can not meet this then the hotel should let you know up front so you can make the right decisions up front and not have to deal with them on the spot during ones stay.", "title": "Quaint but not quiet", "helpfulness": 5, "user": "vacationsrforus", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 106030280}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Well it is what it is!", "title": "I really wanted to like this hotel...", "helpfulness": 4, "user": "cateringgirl3", "date": "March 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 101119693}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I will definitely come back to Playa but their won't be an eclipse in mind! :)", "title": "Where do I start???", "helpfulness": 8, "user": "SunKisstManitoba", "date": "March 16, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 2.0}, "id": 100432059}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Small quiet hotel in the perfect spot. Close to 5th Avenue but once the air conditioning was on we couldn't hear a thing. These suites were spotless, the housekeeping is great. If you are looking for a place with character and not a boring hotel this is definately it. The staff are very friendly, and the cafe beside the hotel is great and the prices were very good. There is a little pottery shop just up the block with some fantastic stuff. The hotel is very central to everything, if you are looking to save money, Walmart is not far and you have a little kitchen in your unit, beers are cheap at the little store beside the eclipse. Thank you to everyone at the Eclipse and the Cafe for making our visit to Mexico so fantastic. We will see you again! If you are a diver there are 3 outfits within a block.", "title": "Excellent!", "user": "aliandgreg", "date": "May 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29675409}, {"rating": 4.0, "stay_parameters": "Stayed March 2009", "text": "My son & I just returned from sending a week in Playa. After resreaching small hotels in Playa I settled on The Eclipse. I did not make a reservation just walked in. The staff is friendly and very helpful, the rooms were cleaned daily, the beds were comfortable and there was plently of hot water. Coffee and filtered water were availalbe in the court yard and breakfast coupons were availble upon request. The place is beautiful and charming and I throughly enjoyed my staff. The gate locks at 11:00pm and security staff are present so if you have a late check in you would have to make arrangements.", "title": "Loved It great location", "user": "artful99", "date": "March 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26125532}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Can't wait to go back.", "title": "Good Price, Nice Place, Nice personnel", "user": "Kilster", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26092120}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "My only complaint was the noise from the clubs on Friday night, but with the windows closed and AC on this seems to help.", "title": "Great Price / Service", "helpfulness": 1, "user": "CamAutSantiago", "date": "January 8, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23391089}, {"rating": 2.0, "stay_parameters": "Stayed February 2008", "text": "Booked 4 days with my girlfriend in a Robinson Crusoe \"suite\". It's a small room with 2 floors, you can see more on their website. The place was clean, nice with lot of vegetation and places to relax, quiet and very close to all the tourism spots (One street south of 5th Avenue). It has wireless internet included so I could check my emails in the morning before going out. that was a huge plus. Included breakfest was to a restaurant near by on 5th called Tequila Barriles. The breakfast was very good. My room also included 1 Palapa and 2 chairs at the beach club \"Playa Mamitas\".", "title": "Nice Hotel with Bad Management", "helpfulness": 1, "user": "glenandlori", "date": "January 4, 2009", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 23248635, "likes": {"liked": "— Location", "disliked": "— Management"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "variance": {"poor": 9, "average": 9, "very good": 22, "terrible": 7, "excellent": 24}, "aka": "Eclipse Hotel Playa Del Carmen", "slim_ranking": 0.612244897959, "description": "The Eclipse Hotel is located in Playa del Carmen, 35 miles south of Cancun, Mexico.Set amid imposing royal palms, coconut trees and lush gardens, the Eclipse Hotel is a very beautiful and comfortable 19 room hotel.The Eclipse Hotel is located in Playa del Carmen's most privileged location, in the very heart of town, on First Avenue, between the beach and Fifth Avenue (close to the action, so young people looking for night life will find it the best option). The beach loungers, hammocks and umbrellas on the white sand beach and Fifth Avenue Pedestrian Walkway are just 30 yards away, just around the corner.All our units have air conditioning, ceiling fan, wireless internet, private bathrooms with hot and cold water. Most rooms have kitchenettes, hammocks, refrigerators, cable TV (+50 channels), balconies or private terraces. All our guests get free use of beach club facilities (lounge chairs, umbrellas, showers and restrooms). A large bottle of purified water (20lts.), is replenished on a \"as needed\" basis in our reception so you can refill your empty bottles of water anytime for free. Rooms are cleaned on a daily basis. We provide our guests with fresh towels and clean sheets daily.More than just accomodations.."}