{"user_rating": 4.5, "review_count": 62, "name": "Hotel Hansablick Garni", "reviews": [{"rating": 4.0, "title": "Home away from Home", "text": "Sorry to be so late with this review. I stayed at the Hotel Hansablick for 5 days at the beginning of September 2007. I loved this hotel. It is located inside of a still existing apartment complex , so one feels like one is not really a tourist, but lives in a residential neighborhood. This neighborhood is called Tiergarten, which is located between the Tiergarten and the Spree River. A short walk across the street and you are on the banks of the Spree River, where there are lovely trails to walk. The walking trails along the river will lead you all the way to many attractions. The hotel is also convenient to public transportation (the S Bahn and the U-Bahn). The staff is very friendly; after the second day they remembered that I liked two pitchers of coffee instead of one with my breakfast. The coffee they made was very good, by the way. The breakfast buffet was very diverse. Always plenty of food and a large variety of items. My room was huge; I had a balcony with a view of the Spree river. The rooms have high ceilings and original art. Ladies: THEY HAVE A MAKE-UP MIRROR -- big plus. They also have a nice little cart in the bathroom which fit all of your personal items very nicely. The room was cleaned well. They have a computer in the lobby for all guests to use for free. I'm probably forgetting something, but here it is, for now. I would definitely return to this hotel when in Berlin. Berlin is awesome, by the way. Definitely worth a visit (my 5 days were way too short -- will return for more next time.)", "helpfulness": 2, "user": "Kokko", "date": "November 20, 2007", "id": 10948397}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I was a little disappointed with my room at the Hansablick Hotel--there was something spare and dormitory-like about it, and one of our beds was pretty uncomfortable--but there were a number of good things about the hotel. The breakfast was lavish, and served in two lovely rooms, with a view over the canal. The staff was extremely friendly and helpful, and the rooms, although plain, had some of those little touches that budget hotels can lack--box of tissue, shower cap, hairdryer. The building is located very near the ubahn (Tiergarten stop; it's just a few blocks walk)--you can see the hotel sign as you go by on the train. The actual street the hotel is on is pretty, and our room had a view over the tree-lined canal, but some of the surrounding blocks are graffittied and don't feel absolutely safe, so I would use caution at night. I got the impression a lot of students live in that area, but it was quiet at night.", "title": "low-budget but friendly", "user": "Christine_U", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 10772982, "likes": {"liked": "— pretty breakfast room, and nice staff", "disliked": "— uncomfortable mattress (one bed in our room; the other was fine)"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "The hotel is in a converted apartment house which must have been very fancy at one time--the marbled entryway has the remains of stucco scrollwork all over the ceiling, and the vestigial elevator is charming to look at, although it doesn't work anymore.", "title": "Great Find in Berlin!", "helpfulness": 3, "user": "TFlyer", "date": "September 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8820857, "likes": {"liked": "— great value without being cheap at all", "disliked": "— single bed"}}], "location": {"country": "Germany", "continent": "Europe"}, "variance": {"poor": 0, "average": 4, "very good": 29, "terrible": 0, "excellent": 29}, "aka": "Hansablick Garni Hotel", "slim_ranking": 0.0885885885886}