{"user_rating": 4.5, "review_count": 133, "name": "Hotel Saint Shermin", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Stayed here for four nights recently and confirm recent reviews - shazam10's experience was entirely consistent with mine. My room was large, recently and very well decorated (as is entire pension), spotlessly clean and well-equipped; the bed was comfortable; staff were friendly. As others have said, older, less complimentary, reviews and photographs here can safely be ignored.", "title": "Quiet, stylish, comfortable, convenient and well-priced.", "helpfulness": 1, "user": "John987654321", "date": "April 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 129025413}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "The building is just outside the \"ring\" that circles the Innerstadt, but barely 200m from Karlsplatz, one of the transport hubs of Vienna. Stefansdom, the centre of the city, is a short walk. There are plenty of everyday shops and many restaurants and bars in the immediate vicinity (Wieden).", "title": "Excellent location, price and room", "helpfulness": 2, "user": "shazam10", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127374959}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This property will suit most travellers, but not all, for the reasons that shazam10 mentions - primarily because it occupies the first floor of the building with access via stairs; it is staffed only during certain hours. Less significant potential drawbacks include (apparently) no air conditioning (summer in Vienna can be warm), a rather small and crowded breakfast room, and some rooms have no view (the windows of my room were silvered, and when opened only revealed the air-conditioning system of an adjacent building).", "title": "Quirky, Charming Hotel in a Great Location", "user": "mjbrautigam", "date": "April 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127072077}], "location": {"country": "Austria", "continent": "Europe"}, "stars": 4, "variance": {"poor": 2, "average": 3, "very good": 41, "terrible": 0, "excellent": 87}, "aka": "Shermin Hotel Vienna", "slim_ranking": 0.0490463215259, "description": "The stylish, family-run Hotel Shermin offers modern accommodation in the centre of Vienna, just a 5-minute walk from the Karlsplatz Underground Station. The daily breakfast buffet includes traditional Viennese coffee. Free Wi-Fi is available.The spacious, individually furnished rooms come with a private bathroom, minibar, seating area, and a flat-screen TV. Room themes include Viennese sights such as the Augarten Park or the Lainzer Zoo's Hermes Villa, which was once the hunting residence of the imperial family.The Shermin Hotel has a convenient and quiet location close to the State Opera and St. Charles Church. The Kärntner Straße shopping area is just a short walk away."}