{"user_rating": 4.5, "review_count": 713, "name": "Hotel Domus Praetoria", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "We stayed at the Hotel Domus Praetoria in Rome on two separate occasions in September, 2006. We stayed in the same room each time. It was clean, modern, quiet and well-appointed. Our bathroom was large, bright and clean. The location is wonderful: within easy walking distance to Roma Termini train station and the metro. It's also within walking distance of a number of attractions. I plan to stay there again in March and highly recommend it to others.", "title": "Wonderful Hotel", "helpfulness": 1, "user": "Becky M", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5938366, "likes": {"liked": "— Modern, clean room and great bathroom.", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "booked this after reading the previous reviews and it certainly lived up to it's reputation. Customer service is excellent and the room was big and clean. Our window overlooked the street where a there was a busy little market in the morning but the double glazing keeps the noise out. we picked up some nice fruit there in the morning after the breakfast from the cafe opposite. Yes, the immediate area around the station isn't the prettiest, it has the usual fake bag vendors and local drunks like a lot of cities but there's no real danger there and the street they are on is fine, in fact I'm sure they're next to a police station. We walked past the hotel at first as there's no obvious sign (if you're coming from the Termini it's the last building on the left at the bottom of the street) definitely worth all the praise and their award", "title": "believe the hype", "user": "nowonmai", "date": "October 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5934448, "likes": {"liked": "— cleanliness, location, customer service", "disliked": "— make their location a bit more obvious"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We took the recommendation of Trip Advisor on this hotel and we were not disappointed. We were allocated their biggest room and we felt like royals! Our room was enormous with high ceilings, entry hall and spacious bathroom (no bath just shower). The room had cold air con and a mini fridge which was great. The floor was a lovely polished timber and the room had a very Roman romantic feel to it. The bathroom was clean, well appointed and relatively modern. The hotel was a bit tricky to find - they are not allowed large street signage, so you need to look for the numbers and then a large timber door. The lift is shared by other tenants in the building and when we tried to leave in the morning the cleaning lady had left the lift door adjar downstairs so the lift wouldn't move to collect us - so we had to take the stairs. Other than that, there are no problems. The hotel was quiet and close to some lovely casual eateries - although we found dining outside meant putting up with a strong drain/garbage smell....I guess that's Rome. It was a short walk from the Termini station and there is a police station on the same street so it feels very safe. The only negatives would be that although we had a small credit-card-like room key with no identifying details on it, the man on the desk insisted we leave this with him when we left the hotel. Also, breakfast is just a voucher at a cafe across the road. When we were there, they did not speak English so I couldn't ask for something other than coffee (which I can't drink) but I am not sure they served anything else anyway. The food was simply a choice of one pastry - nice for a snack but not if you want more for breakfast. Not a big deal though, you can always go elsewhere for breakfast if you know not to expect much.", "title": "a real gem", "helpfulness": 5, "user": "Jen&Mike", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5901859, "likes": {"liked": "— the enormous room was total luxury", "disliked": "— no breakfast or food facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "As this was the last hotel we stayed in on a 7 night trip around Europe we were hoping for a great hotel, which, thanks to these reviews, we got.", "title": "Everything Good", "helpfulness": 4, "user": "beauxl2002", "date": "September 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5883530}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Following just a two minute walk from the Termini (through an area which isn`t really that bad at all) we arrived at the hotel which is marked only by a plaque.", "title": "Great budget hotel", "helpfulness": 4, "user": "Kitbit", "date": "September 25, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 5834270, "likes": {"liked": "— Location near to Termini"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I believe I am somewhat objective and an experienced world traveller . I cannot understand why this is rated in the top ten . I disagree and this is the first time in doing so since I have found tripadvisor more than helpful in the past and for subsequent properties . The main train station area is very seedy and not all that fun to navigate to get to this hotel. Yes, this hotel's location is good if you are using the train station as a launching point. The staff is extremely kind and helpful but the rooms are very basic. One thing that is missing for the rooms (we stayed twice at this hotel overlooking the street and the second time, the back courtyard) was that overrall, there wasn't that much light so the place was not too cheery. The price is right for what you get but next time I am in Rome, I will look for a hotel with a better location and with a better atmosphere knowing that I will have to pay more.", "title": "Overrated but adequate", "helpfulness": 5, "user": "calmkey", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 5982719, "likes": {"liked": "— Helpful staff", "disliked": "— Location and overall atmosphere"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "great staff, great location (near Roma Termini), and a really nice room for an incredibly reasonable price. would recommend it without hesitation....", "title": "amazing deal", "helpfulness": 1, "user": "joeyhelmet", "date": "October 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5969314}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Have just read a review of this hotel 'Don't understand the Hype\" Well to be honest I don't understand this review.", "title": "Enjoyed every moment", "helpfulness": 2, "user": "toptopcat", "date": "October 16, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5959894, "likes": {"liked": "— the room", "disliked": "— no tea and coffee"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "We arrived in Rome with no real expectations other than a clean comfortable room and bathroom. We had a very pleasant surprise. The Domus Pretoria was situated very close to the Termini which for our purpose is what we wanted. The railway station wasn't the place we were going to sleep or were the corners of streets where ladies of the night visit.", "title": "Don't understand the hype", "helpfulness": 11, "user": "blowstar", "date": "October 12, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 5945013, "likes": {"liked": "— The room was large and clean", "disliked": "— Stasi - like security on the front desk"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Our room was excellent and we were more than happy. All the brothers were extremely polite and helpful. The room was large and very comfortable, the sheets and linen very clean as was all the amenities. We both liked the idea of the little cafe over the road to get our breakfast, it was great to be part of the 'local' scene, so was the market which was open outside the hotel each morning, and surprisingly no noise from the room, due to the double glazing.", "title": "Great Little Hotel - Unique Character - Freindly Staff", "user": "Holtyboy", "date": "October 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5938733, "likes": {"liked": "— Look for the brass plaque on the wall !"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "We had a three night stay at Domus Praetoria, 10th-13th July in order to attend a friend's wedding in Rome. No complaints whatsoever, which is great for me as I am a hard girl to please! To reiterate other reviewers comments, the hotel is in a perfect location, it really isn't threatening (we returned by foot at 2.45am after the wedding with no bother at all), it's spotlessly clean, well furnished, great value & the Praetoria brothers are wonderful.", "title": "FAB!", "helpfulness": 9, "user": "Dellywelly", "date": "August 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5709858, "likes": {"liked": "— Location, owners & cleanliness.", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "In disagreement with other reviewers comments, our air conditioning unit worked perfectly, we always had hot water, even after our late night out and the café bar across the road was fantastic. I was pleased that the breakfast is served from 6am-11am as this allowed us to have a lie in the morning after the wedding, but still grab a gorgeous pastry & cappuccino before our early flight departure the following morning. The café is so reasonable too, an espresso is only €0.60! Another spend-thrift tip for all visitors to Rome during the oppressively hot summer months. Buy a bottle of water cheaply each morning in a café & refill it as required at the many drinking fountains scattered around the city, clean, fresh, cold water on tap!", "title": "Friendly staff, convenient location, good value.", "helpfulness": 6, "user": "Almendarez", "date": "August 23, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5702334}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "In short, Rome is a wonderful place we intend to visit again & Domus Praetoria is a wonderful hotel we'll definately return to & have recommended to friends.", "title": "Nice Room, Poor Location", "helpfulness": 4, "user": "VinceM", "date": "August 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 1.0, "rooms": 4.0}, "id": 5629086, "likes": {"liked": "— Room", "disliked": "— Location"}}, {"rating": 5.0, "title": "Loved the room", "text": "P.S. Arrived on the day the triumphant Italian team returned to Rome & saw them by chance on an open top bus - no three hour wait at Circus Maximus for us, it was a real highlight of the trip!", "helpfulness": 8, "user": "JR010", "date": "August 20, 2006", "id": 5627634}, {"rating": 5.0, "title": "Nice and quiet", "text": "Although I was initially concerned about staying near the Termini train station, my friend and I chose to stay at the Domus Praetoria based on user reviews on TripAdvisor and Venere. It was a good choice and I would likely stay there again during a future trip to Rome. The location proved to be excellent for the arrival from the FCO airport (an express train runs from the airport to the Termini station and is 1/5 the price of a cab) and then taking the Eurostar to other cities. Termini is also a metro stop, so we took the train to most sites and found this to be an extremely easy and affordable way to get around the city. The hotel is a mere 3 blocks from the station, but be advised to look for the name of the hotel on the doorbell list as there is no sign. The staff (Massimo, Fabio and Antonio) was extremely friendly and helpful (and spoke excellent English). As I waited for the room to be ready, Fabio went over the “must sees” and how to get there. He then carried my bags up the 4 flights of stairs since the elevator was on the fritz (it was fixed later that day). The room was blissfully cool in the blazing late July heat (thanks to individually controlled AC). Room and bathroom were much bigger than expected. Both were clean and had the standard amenities. The included breakfast is a croissant/pastry and coffee at the bar across the street (standing only). Though not exactly filling, the service was courteous and fast and one could easily go out to the open air market on Milazzo and buy fruit to complete the meal. The open air market also offers items ranging from undies to lemon zesters, providing a fun, cool local experience. Overall, great stay and well priced.", "helpfulness": 3, "user": "MTSEYMOUR", "date": "August 14, 2006", "id": 5607727}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I can see why this hotel is a Trip Advisor Reader's Choice. We stayed at this hotel for 1 night at the end of a cruise and thought it was great. It was obviously refurbished recently and looks very new. The bathroom was large and beautifully tiled. The bed was in a lovely mirrored dresser unit and was very comfortable. The room and lobby were very clean. The location is 4 blocks from the Termini station so is easily accessible to the train. The gentlemen at the desk were helpful and even let us use the computer to check our email when we asked the location of the nearest internet cafe. Breakfast is a voucher for a bakery across the street until they finish their own restaurant. The only downside is a bit of confusion with the buzzer to get in and out of the building, and the floor where the rooms are located, but it was easily rectified. We stayed at another hotel before the cruise that cost more and we didn't like as much.", "title": "Excellent Well-priced Hotel in Rome", "helpfulness": 7, "user": "CherylAS", "date": "September 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5825986}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed here for three nights in total durring a two week holiday travelling through Italy and found it to be perfect for our needs.", "title": "Perfect for exploring", "helpfulness": 10, "user": "JezT", "date": "August 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5729684}, {"rating": 5.0, "title": "It's all true", "text": "The location is ideal for those travelling by train and 5mins walk arounfdthe corner you can catch one of the regular coaches to out of town airports such as ciampino - only takes 30mins.", "helpfulness": 11, "user": "shawnvice", "date": "August 29, 2006", "id": 5723314}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The rooms were clean and spacious, the brothers very helpful and the hotel is in a fine location for exploring the city and jumping on the metro. Granted it is a bit of a treck to the Trevi etc but it didn't bother us. Taxi to Piazza Navano (best for restaurants and bars) averaged 8euro. The area is fine and just like any other surrounding a main train terminal so don't let it put you off.", "title": "More than a hotel--a stay with friends", "helpfulness": 13, "user": "Stephen K", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5718237, "likes": {"liked": "— Small, warm and friendly.", "disliked": "— Not fancy (if your ego needs that) but super"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We would definately return.", "title": "Loved Domus Praetoria", "helpfulness": 8, "user": "Maltezer", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5713258, "likes": {"liked": "— Room facilities, value, proximity to station, hotel security features"}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 2, "variance": {"poor": 11, "average": 39, "very good": 270, "terrible": 4, "excellent": 389}, "aka": "Domus Praetoria Rome", "slim_ranking": 0.0866141732283, "description": "In the center of Rome, few minutes walk from the Termini station and well located for visiting the main sights. All rooms with private bathroom, free Wi-fi and all modern comforts."}