{"user_rating": 4.0, "review_count": 345, "name": "Hotel Corona D'Italia", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "This hotel has an excellent location in relation to the sites and only 5 mins from the railway station.", "title": "Great Location", "helpfulness": 1, "user": "jab58", "date": "December 1, 2006", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6313292, "likes": {"liked": "— location", "disliked": "— hot water could be a problem at times"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "Friendly and helpful staff are also a plus.", "title": "Nice hotel", "helpfulness": 7, "user": "bellabacioo", "date": "June 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5301414}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The breakfast is also substantial and at no extra cost.", "title": "Loved it! Can't wait to come back!", "helpfulness": 5, "user": "mariasolis1", "date": "May 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5047868}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "The hotel is very nice it is in a great local just about 5 mins walking to the duomo, 30 seconds to the marcato centrale. The home is very clean and quite nice. The staff is also extremely friendly. The train station is about a 5 min walk to the hotel you just need to walk up nazionale the side stree mcdonalds is one. They have wirelss internet in the hotel for a small fee, or you can go to the piazza that teh marcato centrale is in and use the internet there i use Sky internet (i live here now and people at sky are very friendly, the place is much cleaner then other places). The hotel has a nice size breakfast. I must say the hotel is very nice.", "title": "Super", "helpfulness": 5, "user": "Triptrav", "date": "February 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4523550}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "Wonderful stay! Super friendly folks in a beautiful room and extremely convenient location. Their breakfast was filling in the American sense, not super fancy but it was free and filling if you are used to eating a hearty breakfast in the morning. They were super sweet and allowed us to keep our bags there past outr stay and it was only a hop, skip and a jump to the train station. My bofriend just recently went back to do some business there and was upgraded for free into a larger bed! The Maitre 'D was a gem and I truly felt I was staying at a grand place. I also recommend a wonder restaurant near by called \"Palo de Oro\" (literally \"golden balls\"), good wonderful food!", "title": "Super hotel in a great location.", "helpfulness": 5, "user": "Grove-21", "date": "February 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4440929}, {"rating": 3.0, "title": "Cant say I loved it", "text": "The location, as mentioned already, is the best thing about this hotel. It is literally within walking distance of the train so it saves the hassel of taxi rides, transfers, etc.", "user": "MissTravelAlot", "date": "May 31, 2007", "id": 7726083}, {"rating": 4.0, "title": "Excellent Location and Amenities", "text": "Its on a very dirty, busy road.", "user": "gmanssa", "date": "May 31, 2007", "id": 7725925}, {"rating": 4.0, "title": "Great for the price", "text": "The hotel lobby is not very nice.", "user": "NewYorkNYtravels", "date": "May 15, 2007", "id": 7625797}, {"rating": 4.0, "title": "Location of Hotel Corona D'Italia, Florence", "text": "The staff are helpful.", "user": "lovesusvi", "date": "March 11, 2007", "id": 7011892}, {"rating": 4.0, "title": "Great for a 2-Star", "text": "Breakfast selection is the worst we had over our two month trip.", "user": "HPower", "date": "February 22, 2007", "id": 6829425}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "The sheets were stiff and rough, the staff not very helpful or courteous, and the room very noisy. It is worth it to speak up, though, because at first they gave us a room with 2 single beds on the first floor, even though we reserved a double room. We said something, and they moved us to a bigger room with a King bed and bigger bathroom on the 3rd floor. We still heard noise from the maids pushing their carts around on the tile floors in the hallway early in the morning (the hallways and rooms were not carpeted). The breakfast was mediocre, called a “buffet breakfast” with no hot food, some weird-looking cold cuts, cheeses, pastries, yogurt and some fruit. We found no hot water if we tried to shower around 8:30 in the morning, but it was fine if we showered later in the day. The best thing about our hotel was the location, which was a five-minute walk from the train station, right near the Mercato Centrale (central marketplace, like a flea-market with indoor food vendors), and 10 minutes from the Duomo.", "title": "You get what you pay for", "helpfulness": 6, "user": "jen611", "date": "January 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 4353033}, {"rating": 2.0, "title": "Never Again!", "text": "We stayed in this hotel for two nights. Note to all travelers: Do NOT stay in this hotel if you plan to drive yourselves to Florence! We called the hotel THREE times on our cell phone for directions to the hotel from major landmarks within Florence. Each time, we were told that the directions were \"too confusing\" to explain. We spent FOUR hours driving around Florence and asking strangers for help before finding the hotel. If we had not had pre-paid reservations, we would have given up! Once we arrived at the hotel, we were told we had to pay 23 euro per day to park in a garage (or have our car towed from the street) even though we were told there was free parking when we made our reservation. The front desk staff was most unhelpful, slightly rude, and uninterested in helping tourists (we were not the only people, nor the only nationality, having trouble). Upon arrival, we were told we \"had\" to wait for the bellhop to escort us to our room (we had one suitcase, our room was on the second floor, and there was an elevator). We waited almost 10 minutes for the bellhop to come and though we tried to say several times during those 10 minutes that we could find our room ourselves, we were always told that we must wait. The room was of a good size but sparsely decorated. One of the larger bathrooms we had on our trip. The room was very clean and despite being located on a very busy street, little noise could be heard in the room. Location was fair, a fifteen or twenty minute walk to the Duomo. We would not recommend this hotel to car travelers or to travelers who are looking to stay in upscale hotels. The more modest price of this hotel is not worth the problems we had with it. Take our advice, spend a little more, and stay in a nicer hotel!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 17, 2005", "id": 4247817}, {"rating": 5.0, "title": "Excellent !", "text": "Do not let the anonymous outside appearance deceive you ! I stayed here recently for 6 days and I was very not disappointed. The room and bathroom were big and immaculately clean. The staff were very kind and helpful. Also, the hotel is close to the railway station which was very useful and also within walking distance to all the major sights. I would definitely recommend this hotel, you will not be disappointed.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 15, 2005", "id": 4243612}, {"rating": 4.0, "title": "Loved the corona d'italia", "text": "Stayed here recentley with my best friend and it was great. The room and bathroom was spacious and luxurious. The windows had modern double glazing so had no noise at all. On our trip we also stayed in Rome and Venice and it was the best hotel out of all 3. It was bigger then most italian rooms and instead of a small cubicle that you usually get, it was a bath and shower. Everything was clean and they even folded my clothes for me!!! The staff were very curtious and helpful. They recommended a great restaurant, which was the greatest food I have ever tasted, called Za Za. It is close to the station which was very useful and also walking distance to all the major sights. I would deffinatley recommend this hotel, you will not be disappointed.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "November 22, 2005", "id": 4138101}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 14, "average": 89, "very good": 172, "terrible": 3, "excellent": 67}, "aka": "Hotel Corona d Italia", "slim_ranking": 0.426406926407, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Hotel Corona d’Italia 3 stars in Florence is set in a three-level, 19th-century palazzo, which features sober and harmonious design, bright and spacious interiors, detailed with marble from Carrara and elegant stucco trim.The hotel staff is available to help guests organize their visit, offering museum reservations, restaurant's suggestions, tours, and guided visits of the city and the Chianti region.The American Bar is ideal for relaxing and planning a visit to the Florence monuments over an espresso or a cocktail, prepared to perfection by our barman.If you desire internet access, the interior of the Hotel Corona d’Italia boasts an efficient Wi-Fi Internet service.Our Breakfast features a delicious buffet, including an extensive variety of cheese, cold cuts, yoghurt, seasonal fruit, fresh pastries and delicious cakes.The hotel also includes the Meeting Hall (max 35 people) for business meetings and work sessions. Upon request, state-of-the-art technical support may be added to the hall's standard devices."}