{"user_rating": 4.0, "review_count": 205, "name": "Hotel Eber Mars", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2006", "text": "The bathroom smelled of sewage. The person who I assume is the owner was very cross towards my children. It is in a location but if I were you, I would definately look elsewhere.", "title": "Bathroom smelled of sewage", "helpfulness": 1, "user": "thefreddys", "date": "December 12, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 6433191, "likes": {"liked": "— The location", "disliked": "— The really putrid smell"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "I loved this place. When you first come in, they give you maps of Paris, and of the metro and will take the time to explain how to get to anywhere you wish to go. Then comes the elevator experience. It turns up to the smallest elevator I have ever been in ever. I got a single courtyard room, which I found to be really nice, especially after a busy day in Paris. It was very quiet, even with the windows open. I loved the feel of the room, very parisian, with wallpapers and pictures of la Tour Eiffel. The bathroom and the toilet were in two seperate \"closet.\" Very cute and tiny! It was also super clean, and well taken cared of by the housekeeper. Oh, and yes, they don't allow you to take fresh food in, the rooms are definitely worth preserving as they are. The neighborhood is one of the best that I have been in, walking after dark felt very safe. I will definitely stay there again.", "title": "100% Charming", "helpfulness": 1, "user": "citta", "date": "December 10, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6357712, "likes": {"liked": "— the neighborhood, clean rooms, charm", "disliked": "— no hairdryer"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "This hotel has a great location, a block or so away from the Eiffel Tower. We loved being so close. The hotel itself has a nice lobby and an elevator you will never forget. It's the size of a coffin- I'm not kidding! You and your bag ride up alone or two smaller people can fit. We stayed at the hotel twice on our trip. Our first room was #61-It was larger and had an in room tub/shower. We went to the wine country and came back to get a smaller room, #64. It was tiny! No in room shower but there was one to use in the hall. The hotel staff was helpful on restaurants. They do have an odd rule that you cannot bring outside food and drinks into your room. I'm not sure how they enforce this though. I'd stay again; it was close to the Metro and the Eiffel Tower!", "title": "Great Location close to Eiffel Tower", "helpfulness": 1, "user": "KCPL", "date": "December 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 6321086}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Possitive: There was a view of the Eiffel tower from my small balcony, and parking was convient. Negitive: From the get go I felt like I got the shaft. I had to wait for about 5 minutes before the man behind the counter would get off the phone to even acknowledge me. He then lectured me on booking the room under my first name not my last. Then informed me that the elevator worked....barely. I was put on the 5th floor and that I would have to take it to to 6th floor and walk down. Mind you too that the elevator was barely big enough to hold me with my backpack on. The room was for 3 people and we had only asked for a double, and at check out they informed me that they had done me a favor by only charging me for a double. Not much of a favor if you ask me. The room was not as nice as one would imagine by looking at the website. If you have 105 euros to spend a night in Paris please don't waste your money at Eber Mars.", "title": "Look else where", "helpfulness": 4, "user": "AmbieGirl", "date": "October 20, 2006", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 5974928, "likes": {"liked": "— Very close to Rue Cler", "disliked": "— The whole experience made me dislike Paris"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled solo", "text": "I will never reccomend this place to anyone and will never stay there again.", "title": "Great Fun and Super Helpful", "user": "sock2me", "date": "October 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5973053, "likes": {"liked": "— The guy at the front desk - SO CUTE!", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "First, the positives: The desk staff are very helpful. Henry gave us tons of info re maps, our options for the Metro, museums, etc. They also speak great English. The hotel is in a super location, very close to Eiffel Tower, Rue Cler restaurants, and a playground, plenty of hot water for showers even when hotel seemed full, and they were very kind to my 7-year-old.", "title": "Friendly & helpful", "user": "DebDeSilva", "date": "October 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5925805, "likes": {"liked": "— Friendly staff, location", "disliked": "— No food in room"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "variance": {"poor": 13, "average": 21, "very good": 77, "terrible": 17, "excellent": 77}, "aka": "Eber Mars Hotel", "slim_ranking": 0.214166201896, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}