{"user_rating": 4.5, "review_count": 710, "name": "Hotel Colomba", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "I recommend this hotel to EVERYONE.", "title": "Fantastic find", "helpfulness": 1, "user": "PickyTravellers", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16264579, "likes": {"liked": "— everything", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "It is very easy to find and well located on a main street 2 min walk from the Duomo.", "title": "Wonderful Small Hotel", "user": "SBA75", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16137091, "likes": {"liked": "— Accommodating hosts and cleanliness of acommodation.", "disliked": "— Size of shower."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "It has a lift.", "title": "Good value for the price", "user": "skymasterztl", "date": "May 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16024746, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "The receptionist was the best we had in all our travels in Italy. Very welcoming and friendly.", "title": "Great Place Very Friendly People", "user": "nestorcecil", "date": "May 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15871113}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The room is very spacious, clean and there is free internet access.", "title": "Just perfect for our family", "user": "Griswalds2", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15504027, "likes": {"liked": "— The owners.", "disliked": "— I do not have any complaints."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "PLEASE don't be put off by the entrance to this fantastic little hotel. Once upstairs (by lift) you will receive the warmest of greetings by the family. Rooms are large, clean and comfortable. The beds are the equal of any 5* hotel. Breakfast is really great with the best coffee (Expresso etc). Had to see a chiropractor (hurt myself lifting our suitcases into the Italian Trains) and the owner, Rosanna went out of her way to find an English speaking one for me. Near all the sites you will want to see in Florence. Highly recommended!", "title": "Fantastic!", "user": "Magere1", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10065122, "likes": {"liked": "— Rooms and friendly service", "disliked": "— Zero"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "A wonderful locaton, 1/2 block from David in the Accademia (3 min walk max) a straight walk 2 blocks from Duomo (4 min walk) and straight on to the Uffizi (8 min walk). Very clean accomadation, beds good slept all night no problems. Rosa makes the place she booked all the things we needed for no charge and goes well beyond anything I have come across before, you name she sorts it out for you, cannot recommend this hotel highly enough.", "title": "A Very Happy Hotel", "user": "screenname2000", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10057135, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007", "text": "Rosanna and her family take the best care of you in this hotel! From the spacious rooms to the wonderful breakfasts, my family was treated like royalty here. The hotel is located by the train station - you can walk to the hotel but we chose to take a cab given our luggage (cab ride was not very expensive). The hotel is also located on a quiet street. Rosanna made dinner reservations for us, and made several recommendations on the various sites in the city. You can't go wrong with this hotel!", "title": "Loved this Hotel!", "helpfulness": 1, "user": "MNHawkeye", "date": "October 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10038954}, {"rating": 5.0, "title": "Like Home", "text": "All the previous reviews are true. The hotel is centrally located, has a wonderful continental breakfast and clean, good sized rooms but the main asset is Rosanna. You feel like you have a family member from Florence. She'll not only help you enjoy your trip by assisting with any of your questions or needs, she makes you feel at home!", "user": "Susan2749", "date": "September 24, 2007", "id": 8885347}, {"rating": 5.0, "title": "Oasis in the City", "text": "What a relief to check into to this highly clean, quiet, and conveniently located hotel after a long trip from California to Florence. This family-owned property meant caring support and help throughout our time there. The breakfast was lovely, and included cappucinos, lattes, etc. Having free internet access during our stay was a real help in letting the folks back home know we'd arrived safely. I would stay here again anytime.", "user": "KayRuth", "date": "September 13, 2007", "id": 8709037}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "Colomba hotel is in a great central position within walking distance to all the major sites. The rooms are clean and quiet. This hotel is run by a very friendly family which made us feel very welcome, they speak excellent English and are very helpful. Would definately come back and stay here again. I would highly recommend this hotel.", "title": "Great central position", "user": "AustralianGirl", "date": "September 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5759803, "likes": {"liked": "— Location", "disliked": "— Book here"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "What a wonderful little hotel just minutes away from the Duomo, Accademia and Uffizi. We were pleased with the spacious, super clean rooms (all of which have remote control air conditioning that kept the rooms comfortable) and excellent service that Rosanna and her family provided (not to mention the nonexistant language barrier, thanks to Rosanna's perfect english!). The breakfast was great (meats, cheese, yogurt, fresh pastries, cereal, cappuccino, etc), there's a comfy sitting area with books and a computer with internet access for guests. My next trip to Florence will be spent at the Colomba...I wouldn't consider staying elsewhere!", "title": "Great location, Fantastic service", "user": "ihugtrees", "date": "August 29, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5724627, "likes": {"liked": "— The owners - Rosanna and family made us feel welcome and were accommodating.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "I can't recommend this place enough! If you're looking for something that's centrally located and run by extremely gracious and generous hosts, this is the place! Michele and Rosana continually went above and beyond the call of duty for us. It felt more like we were staying with friends than in a hotel. Whatever we needed, our hosts made it their mission to help us out. When it looked like my girlfriend would be unable to travel by train, Rosana broke out a map and started charting our route to Cinque Terre. When we asked for a restaurant recommendation, she sent us to a wonderful, family -run restaurant that served us the best lunch we had in all of Italy. I can't remember all the nice things she and her husband did for us, but I do remember feeling that I was making a pest of myself, constantly asking for recommendations or advice. Without fail, she and Michele (not sure if I'm spelling that right) graciously answered our questions, never once making me feel like I'd made a pest of myself.", "title": "Absolutely wonderful!", "helpfulness": 2, "user": "rgb411", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5716876, "likes": {"liked": "— The people", "disliked": "— The bathroom was a little small."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "There were seven of us in my group, and we all found our accomodations to our liking. We had one quad and one triple. The rooms are clean and tidy, the hotel nice and quiet. Never did we feel cramped, nor did we hear even a peep from any of our neighbors. The beds were quite comfortable, and the pillows were perfect. The staff of the hotel are all pleasant and friendly. Breakfast filled our bellies each morning, and espresso/cappucino was available for the asking. I know this much...if I ever go back to Florence, I wouldn't dream of staying anywhere else.", "title": "Great Location", "user": "AEKtraveller", "date": "August 27, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5714078, "likes": {"liked": "— Good room size, very clean, friendly owners/staff", "disliked": "— nothing"}}, {"rating": 4.0, "title": "Nice, small hotel", "text": "Small family run hotel in an excellent location, within walking distance of many of the major attractions. We were three ladies sharing a triple room which was a good size compared to many other European Hotels. Staff were very friendly, English speaking and helpful in their advice of places to visit etc. Typical continental breakfast and plenty of it. I would have no hesitation in recommending it to the independant traveller.", "user": "ctmb-traveller", "date": "August 22, 2006", "id": 5693952}, {"rating": 4.0, "title": "Very nice place to stay", "text": "We just returned from our trip to Italy and we highly recommend the Hotel Colomba. It is ideally located to visit the many sights of Florence and the hotel is clean and comfortable but above all is the hospitality that Rosanna offered was exceptional. She made sure our accomodations were to our liking and offered our small group the use of her breakfast room for a dinner one night. She also made an earlier breakfast the next morning for our group so we would beable to meet our tour guide. Her family made us feel very comfortable and welcomed.", "user": "gwizPennsylvania", "date": "November 7, 2007", "id": 10665417}, {"rating": 5.0, "title": "Great accomodation in the hearth of Florence", "text": "Hotel Colomba is a family run hotel, is located in the elegant Via Cavour few minutes walk from the Duomo and from San Lorenzo.", "user": "iceland22x77", "date": "November 5, 2007", "id": 10615882}, {"rating": 5.0, "title": "Great little place to stay in central Florence", "text": "We were 2 adults and 2 childs, had a room with 2 singles and a double bed, the room was great, large and comfortable, very clean and with new furniture;", "user": "li_coop", "date": "November 2, 2007", "id": 10541426}, {"rating": 4.0, "title": "Great location and value", "text": "the price included a good quality breakfast.", "user": "gre824", "date": "October 23, 2007", "id": 10254556}, {"rating": 3.0, "title": "OK for a short stay.", "text": "The owners were always ready to help and give suggestions.", "user": "morrisminor", "date": "October 23, 2007", "id": 10253315}, {"rating": 5.0, "title": "Great family run hotel!!!", "text": "My husband and I, with our 2 children aged 9 and 13, stayed at Hotel Colomba on 21st and 22nd March 2008. I decided to book this hotel after reading the many positive reviews on tripadvisor. I was definitely satisfied with our stay in this little but very comfortable hotel.", "user": "popi61", "date": "March 24, 2008", "id": 14486113}, {"rating": 4.0, "title": "Florence", "text": "The hotel is located on the 2nd floor of a building in a commercial street (Via Cavour). The location is wonderful, as all the most important sights in Florence are at a walking distance. Lovely restaurants all around.", "user": "smita129", "date": "March 21, 2008", "id": 14433460}, {"rating": 5.0, "title": "Great Value, Location, and Very Helpful", "text": "Our room was spacious for four people, quiet and really clean (my children have allergy problems and so cleanliness is absolutely fundamental for us). Bathroom small but new and clean.", "user": "Rising_Dough", "date": "March 2, 2008", "id": 13990290}, {"rating": 5.0, "title": "Outstanding Hotel", "text": "One the highlights is the kindness and helpfulness of the owners and of Sabina who works for them. They really made us feel comfortable.", "user": "PatMarietta", "date": "March 1, 2008", "id": 13961960}, {"rating": 4.0, "title": "Like staying at a relative's home.", "text": "Breakfast in the morning was good with cereals, bread, fresh fruit, eggs, ham, cheese, pastries, yogurt, jam and fruit juices.", "user": "daleCanada", "date": "February 16, 2008", "id": 13602107}, {"rating": 5.0, "title": "Fantastic Holiday!!! October 2007", "text": "Last October my boyfriend and I decided to go on our first holiday together and spent ages reading through reviews on Trip Advisor before stumbling upon this hotel. It took some persuading to book it but it seemed to be in a central place, great price and just what we looking for. On arrival, it was a small, hidden away hotel but check in was completely pain-free and Rosanna was a fabulous host straight away. Although it was just me and my boyfriend we were given a triple room which was fantastic as it meant extra space and our window had a lovely view over the street and of the Duomo and despite being on a main road, was amazingly quiet at night.", "helpfulness": 1, "user": "bab22", "date": "August 28, 2007", "id": 8523201}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The hotel was right in the heart of Florence, and at the end of the street was the Duomo and the bustling Florence streets. It was easy to find as we came from the train station on arrival, and Rosanna was constantly willing to book attraction tickets for us. One day we decided to travel to Pisa to see the Leaning Tower and she was so helpful explaining to us the way the trains operated and even printed us out a timetable.", "title": "Hotel Colomba was wonderful!", "user": "cincopedia", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8494775}, {"rating": 5.0, "title": "rosanna is a gen", "text": "The continental breakfast included in the room rate was lovely and fresh every morning and kept us full up until the afternoon. Rosanna even fed and watered us on a morning that we were up late and would otherwise have missed the breakfast! We even had a few items from the mini bar in the room and Rosanna didn't charge us but being good people, we paid nevertheless!", "user": "degsville", "date": "August 23, 2007", "id": 8488329}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Over all, a fabulous hotel, in a great location, more than value for money and possibly the best host a hotel could have!!!", "title": "Central location", "helpfulness": 1, "user": "kingstraveller", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 8472436, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007", "text": "Did a two-week European whirlwind tour this summer with wife and three kids (16, 12, and 8). The Hotel Colomba made our two nights in Florence wonderful. The rooms were very nice, very clean...my wife and two daughters were in the suite, which was spacious and comfortable. My oldest daughter also appreciated the easy Internet access. Absolutely no complaints, and if we come back to Florence, this is where we'll stay!", "title": "Simple, clean, and extremely friendly", "helpfulness": 1, "user": "purpleelephant", "date": "August 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8466822, "likes": {"liked": "— The Staff!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "This really is a fantastic, family run hotel. It is spotlessly clean and is run by the most charming and helpful people imaginable. We stayed there in August 2006 and were very happy.", "title": "Fantastic Small Hotel", "helpfulness": 1, "user": "RossandBarb", "date": "August 5, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5560991, "likes": {"liked": "— Cleanliness and attitude of staff", "disliked": "— The entrance and lift"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled with family", "text": "When you arive at this hotel please don't be put off by the slightly strange entrance and lift. Once you are on the second floor of the building and in the hotel itself you will realise that this hotel is really nice. It is friendly, has spotless rooms and an intimate bar and breakfast room. It is in a very good location and only about 5 minutes walk from San Marco, the Duomo and San Lorenzo - dead central. It is on a busy street but we could not hear traffic noise at all from the room.", "title": "Return visit to the Colomba", "helpfulness": 4, "user": "WesternWI", "date": "August 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5558817, "likes": {"liked": "— location", "disliked": "— street entry"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The staff speak good english and put themselves out to be helpful and pleasant.", "title": "Home away from home", "helpfulness": 4, "user": "trip3271", "date": "July 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5524486, "likes": {"liked": "— Friendly atmosphere and cleanliness", "disliked": "— Nonthing."}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "Very good value for money and a very good experience. Highly recommended - we would certainly go back there again.", "title": "Nice Hotel.", "helpfulness": 3, "user": "Franca G", "date": "July 26, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 5512475}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Two years after a first visit (and the first review written about the Colomba) we returned for an overnight, before flights out of town. As 4 adult women (mother, daughter, two friends), we had a quad room, which was plenty spacious for us. Once again, the Colomba was very clean and all was as I had remembered. It is a very well-run small family hotel that enjoys a great location and exceptional customer service. Roseanne was very accommodating, making dinner reservations at a small local restaurant and arranging the cab and wakeup call for our very early departure to the airport the next morning. It is easy to recommend this hotel and I'm glad that the Colomba is enjoying a well-deserved high ranking.", "title": "Great 3 star hotel!!", "helpfulness": 1, "user": "Mottgotts", "date": "July 20, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5488894}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My fiance and I traveled through Itlay through July 6th to July 24th (Rome, Cinque Terre, Florence, Venice, Capri.", "title": "Great 3 star family run hotel", "user": "InternatNewYorks", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8379616}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "We stayed one night in the hotel. It is in the center of Florence and a good value for the money. The breakfast is international and good. The rooms are huge and very clean. Our bathroom was a little small and the squared toilette seats were a little weird. But it might have been just our room.", "title": "Felt like home", "user": "chewpei", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8379221, "likes": {"liked": "— the friendly staff", "disliked": "— the towels"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We were a little concerned that the prices, less than half that of the corporate owned hotels, implied a lower quality experience, but this was not the case. Although this is not a luxury hotel with lots of frills and many staff members, Hotel Columba was a great family run hotel which made our entire family feel very comfortable and supported in our first long trip in Italy. With the dollar so weak right now, everything is extremely expensive in Florence. We were very happy with the choice we made and felt that Hotel Columba offered great value for the money.", "title": "Great Hospitality, Great Location", "helpfulness": 3, "user": "dawnlovessun", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 12891283, "likes": {"liked": "— Location and very friendly hosts", "disliked": "— Beds and thin walls"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "When we arrived, Rosana told us she overbooked and we had to stay at another hotel. She booked us in a 2 star hotel that charged the same price as Hotel Colomba (3 star hotel). I was very disappointed that we got bumped, especially since the reviews on Tripadvisor were so high, and that I was going to be paying the same price for a 2 star hotel. I had alot of options when deciding where I was going to stay in Florence. One of the main reasons I decided to make reservations at Hotel Colomba was b/c of the reviews on Tripadvisor. Furthermore, I made the room reservations through Hotel Colomba's website, not through another 3rd party website, so I don't think there are any excuses. I just wanted to let travellers know that it is possible to get bumped from this hotel.", "title": "Disappointed", "helpfulness": 6, "user": "SoCal101", "date": "September 30, 2006", "detail_rating": {"value": 2.0, "service": 2.0}, "id": 5894441}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We stayed a few night at Hotel Colomba. It is in a great location for a easy walk to most of the major sites. The city of Florence is not too big. The hotel is on a busy street, but inside the room it was quiet. Rosana, the woman who runs the hotel speaks perfect English and is most helpful. She made reservations for the Uffizi and Accademia before we arrived which is the only way to visit these sites. The room was very clean and a nice size for Europe. There are a couple of markets in the neighborhood to pick up some snacks and drinks. For a real treat visit Palazzo Medici at Via Cavour 3. It is not packed with tourists and just down the street from the hotel. You do have to climb some stairs to get to the 2nd floor where the hotel is located. There is an elevator, but it is tiny. The breakfast was nice with lots of choices. The free use of the computer in the hallway made it easy to send e-mails back home. All in all we loved our visit to the beautiful city of Florence!", "title": "Great Deal in Florence", "user": "isoyhappy", "date": "September 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5883397, "likes": {"liked": "— Location", "disliked": "— Make reservations in adance to see the major sites."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Colomba was an excellent base from which to see Florence. It's also close to the main market in Florence - a great place to pick up some lunch items rather than eating in cafes all the time. The hotel was very comfortable and very clean. All of the staff were friendly and helped us in so many ways. Breakfast was plentiful with fresh pastries, fruit, cereal, and basically anything that one could come to expect.", "title": "A Very Happy Landing", "helpfulness": 1, "user": "Roving_Canadians", "date": "September 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5833094, "likes": {"liked": "— A great base for seing Florence", "disliked": "— Nothing major"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My only comment would be that our room looked out into a courtyard through which ran what must have been the exhaust pipe from the local kebab restaurant. A little noisy with the windows open and a constant smell of cooking meat. This room not recommended for vegetarians.", "title": "Great location, very friendly welcome", "helpfulness": 3, "user": "Iandevon", "date": "September 24, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5830681}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Kebabs were good by the way though there's a better place just up the road.", "title": "Excellent choice", "helpfulness": 1, "user": "Bolognese", "date": "September 22, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5825220, "likes": {"liked": "— Staff, breakfasts, location", "disliked": "— Small bathrooms, funny towels"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Agree with other reviews. Ideal location, very friendly and helpful staff and owners and all within a stone's throw of the major sites.", "title": "Perfect location", "helpfulness": 1, "user": "PhilMorgan", "date": "September 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5793826, "likes": {"liked": "— Friendly staff", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "My wife and I stayed at the Colomba Hotel for 10 days and found it to be one of the best 3 star hotels we have seen. It is nicely located to all museums and tourists sites. The rooms are large and clean with working AC and large bathrooms. The breakfast consisted of eggs, meat, fruit, various yogurts/ cereals and wonderful coffee. Best of all the rooms were quiet. Rosanna and her husband assisted us in getting reservations for critical museums and worked to make our stay a pleasant one. Cheers to Rosanna et al.", "title": "Nice Hotel", "helpfulness": 1, "user": "Steve063", "date": "July 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5462789}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "My husband and I stayed at the Colomba in mid-May for four nights and very much enjoyed it. The hotel is extremely well-situated - close to all the major sights, as well as many restaurants and bars. The family that runs the hotel welcomes you like a long lost relative and makes you feel at home. The rooms, while not luxurious, were very clean and quiet and the breakfasts were ample with fantastic coffee every morning. There was no shortage of anything!", "title": "Like Staying with Family", "helpfulness": 1, "user": "EastVillage88", "date": "June 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5412700}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "I highly recommend the Hotel Colomba for anyone looking for a comfortable, welcoming atmosphere in the middle of Florence.", "title": "Worthy of the Praise", "helpfulness": 6, "user": "LatteGuzzler", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5409552}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "All we can do is echo the praise that other reviewers have bestowed upon this wonderful oasis. What an endearing spot! We felt welcome from the moment we arrived via the tiny elevator until the time of our all too soon departure. The other reviews accurately describe the warm and friendly atmosphere of this gem. We would stay at the Colomba again in a heartbeat and strongly encourage all to do the same.", "title": "Hotel Colomba - Best Florence Hotel", "helpfulness": 19, "user": "travelerDetroit_Mi", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5407676}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "We are a family of three and stayed at Hotel Colomba for five nights. We did a lot hotel research prior to our trip, but did not book our tickets until three weeks before. We were not sure what to expect, but were very pleasently surprised with Colomba. In short, this is the best hotel available in Florence that has the complete package, including a great price (most hotels around the area are much more expensive and have the same amenities), amazing location, very friendly and helpful staff and clean, modern rooms that still maintain the quaint feel of Florence.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "June 25, 2006", "id": 5381157}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Location - less then five minutes walk from the Duomo, Accademia and Medici Ricardo Palace (right between the two main artistic and historical attractions of Florence), on the main street in Florence that leads to all the other main attractions like the Duomo, Palazzo Vecchio, the Ufizzi Gallery. Bank and ATM, bus stop and several restaurants rigth downstairs. right accross the street, and the Leonardo DaVinci museum on the bottom floor.", "title": "This Hotel is Perfect", "helpfulness": 11, "user": "El-Bill", "date": "June 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5375829}, {"rating": 5.0, "title": "Hard to Fault", "text": "The pros:", "user": "TonySydneyAustralia", "date": "January 7, 2008", "id": 12415353}, {"rating": 5.0, "title": "Best value in florence", "text": "1) Location, Location, Location", "user": "MannyAdelaide", "date": "January 7, 2008", "id": 12397391}, {"rating": 5.0, "title": "Just like home", "text": "2) The hosts...were fabulous and even invited us to have dinner with the family! They were very good with dinner recommendations, printing train schedules, opening our wine, etc...nothing was too much trouble for them!", "user": "Italoaussie", "date": "January 6, 2008", "id": 12371519}, {"rating": 5.0, "title": "Geat little place", "text": "3) The bathroom was quite nice for an Italian bathroom. The shower was spacious and although the water pressure wasn't great, there was plenty of hot water!", "user": "nana61", "date": "January 1, 2008", "id": 12190814}, {"rating": 5.0, "title": "Home away from home", "text": "My family had a wonderful time in Florence and staying at Hotel Colomba made the experience even sweeter. It is conveniently located to almost everything. We just walked everywhere.", "helpfulness": 4, "user": "JRBSydney", "date": "December 26, 2007", "id": 11965824}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband and I stayed at Hotel Colomba for three nights during the first week of April. We chose this hotel based on the TA reviews, and found it to be as nice as the reviews had promised it to be. The staff was extremely helpful, the hotel was super clean, our room was spacious enough for us, internet was free, breakfast was nice and location was extremely convenient. We would not hesitate to recommend this hotel to others and would stay there again if we had the chance to visit Florence again. By the way, Florence is fantastic!!", "title": "Very Nice Hotel - Great Location", "user": "millermaid", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15114555, "likes": {"liked": "— Location to sites and hotel staff", "disliked": "— Bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "My husband, myself and our teenage son stayed at Hotel Colomba five days during a two week trip and could not be more pleased with our choice. The staff, especially Roseanna and Sabina could not have been more helpful, friendly and accomodating - and this includes the months prior to booking the trip when I would email with questions. They recommended a tour group I was very happy with and could use in Venice, Florence and Rome.", "title": "Excellent Hotel, Great Location", "helpfulness": 1, "user": "Plenilune", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14829732}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Breakfast was plentiful and always fresh. This was the only location where I felt the coffee was hot enough (I know coffee is drunk here lukewarm - I like it piping hot).", "title": "Hotel Columba....A Fine Choice!!!", "helpfulness": 1, "user": "snowdropUk", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14749405, "likes": {"liked": "— lcharming owners and staff and location"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The hotel is centrally located with all sights a short walk away.", "title": "A Wonderful Stay", "helpfulness": 1, "user": "spost", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14645631, "likes": {"liked": "— The location and the fabulous staff", "disliked": "— the small bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Terrific Hotel. Great accomadation and very good customer service by the owners. Highly recommend.", "title": "Terrific Hotel", "user": "justinshenk", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8671230, "likes": {"liked": "— very nice", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I booked this hotel after reading the reviews on Trip Advisor. My family of three was not disappointed. We were forewarned by other reviews that the ground floor entrance was not beautiful, but the hotel itself is lovely. The rooms were spacious, well maintained , meticulously clean, beds very comfortable, great air conditioning , a perfect location in the center of Florence...and at a great price! The hotel owners are extremely gracious and helpful and the free internet is a bonus. Breakfast was fine as well...European style. I would recommend this hotel to anyone who is looking for nice accomodations at a reasonable price point. If you are looking for 5 star opulence then this hotel is not for you. My family is \"picky\" about accomodations and we were extremely pleased with our choice of Hotel Colomba.", "title": "Wonderful hotel in Florence", "helpfulness": 2, "user": "travlinfools", "date": "September 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8669858}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My family and I ( husband and two children ages 12 and 10) spent 6 wonderful days in Florence from the 19th to the 25th of this month. The service was excellent ( no request was too big or too small) and we would not hesitate to recommend it to future travelers. For guests who do not have the luxury of speaking Italian staying in a hotel where you could ask questions in English was very benefiial. The room whilst having basic furnishings was more than adequate- especially when one considers the prices of other hotels in Florence as well as the length of time you really spend in your room ( too many things to do and see so you never are really there). The location was superb - close to the bus and train as well as the major attractions. The breakfast in the morning was an added benefit and it was nice to feel like you had personalized service.We chose this hotel primarily because of the service element and were in no way let down. Only one suggestion to future travelers - if you come by train into the SMN train station - whilst it is 5 minutes away if the streets are clear and you know where you are going we would suggest that if you have luggage take a taxi rather than attempting to walk. Thank you for a wonderful experience. We all rubbed the hog's nose so now we have to return!", "title": "A Home Away From Home", "helpfulness": 2, "user": "SLlovestotravel", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8538623, "likes": {"liked": "— Superior service", "disliked": "— Nothing really"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The Hotel Columba was a joy to stay at. It was wonderful being at a hotel that was family owned. Roseanne and her family along with her staff were just fantastic. Location was great, nice sized clean rooms, my friends and I could not complain about anything except our stay in Florence went by too fast. I would recommend this hotel to anyone and cannot give it enough praise.", "title": "Absolutely wonderful!!!!!!!!", "helpfulness": 6, "user": "Mugsie737", "date": "June 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5371999}, {"rating": 5.0, "title": "The Best Three Star", "text": "Aboslutely perfect in every way, clean, great rooms, great breakfast. Walking distance to all of Florence. The owners are very well versed and provide great advice on food, shopping and the best things to see if you have limited time. They are the kind of people you would invite to stay at your house. A fun and confortable place to stay. Bill Breecher Phoenix, Arizona", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5350854}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "This hotel was so nice, so clean, so close to everything and we loved it here. We were three girls on holiday, so the big spacious room was great for us. Roseanne and her husband and family could not be more gracious and helpful. Breakfast was a good verity and the cappuccino was top notch too. Roseanne got us a wonderful English speaking private driver to take us all over Tuscany for one whole beautiful last day in Italy. PERFECT!!", "title": "The Best!", "helpfulness": 5, "user": "MGBoyer", "date": "June 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5338209}, {"rating": 4.0, "title": "Loved this hotel", "text": "Just returned from a stay the Hotel Colomba and it was great! You absolutely cannot beat the location, within walking distance of most major sites, and sits on a main street with lots of buses. The room was really clean, and surprisingly quiet at night. The best part has to be the family that runs this hotel. The wife, Roseanne lived up to her reputation; she could not have been more welcoming, cheerful, or helpful. She helped us with tickets, directions, and great restaurant suggestions. The free internet access was also a nice touch.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 6, 2006", "id": 5315694}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "We stayed for a couple of nights in early May selecting the hotel based on many favourable reviews. We were not disappointed. A short walk from the station, a ride up in one of the smallest elevators I have seen resulted in us be welcomed to the hotel and shown to our room, a quiet room as we had requested. The room was a good size as was the bathroom with plenty of hot water. Roseanne and her husband were very gracious and recommended two restaurants that we enjoyed with few tourists and mainly Italians, always a good sign.", "title": "What a Great Find!!", "helpfulness": 9, "user": "Kenato", "date": "May 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5232483}, {"rating": 4.0, "title": "Larger than expected", "text": "Judith and Danielle, Sydney, Australia.", "user": "sscalzo", "date": "November 30, 2007", "id": 11164817}, {"rating": 5.0, "title": "Great location and hotel!", "text": "We stayed two nights in total and were pleasantly surprised when we saw the size of the room. We had booked a double and there were two beds...one of which was a queen (maybe king?) size. A nice surprise. The bathroom was a little tinier, but certainly not horrible.", "user": "hoosnelson", "date": "November 19, 2007", "id": 10929036}, {"rating": 3.0, "title": "Second stay, it's okay.", "text": "We did struggle to find the hotel, however. We had written the directions to walk from the train station because it seemed close. The roads in Florence apparently change names every block, so it required us to ask a lot of questions. But the walk back to the train station was much easier!", "user": "doug'n'boston", "date": "November 19, 2007", "id": 10913329}, {"rating": 4.0, "title": "The Colomba experience", "text": "The hotel was centrally located, the staff was really friendly, and the Duomo was also nearby. I would definitely stay again.", "user": "Kevsky", "date": "November 8, 2007", "id": 10699335}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "From a study of the floor plan there were many more rooms in better positions and I would recommend potential guests to request a room away from the breakfast area .", "title": "the privacy of a hotel with the comfort & service of a B&B", "user": "sthom", "date": "October 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10126608, "likes": {"liked": "— the personal service by the owners", "disliked": "— prefer a full bath tub"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Pricewise room rates are reasonable.", "title": "Great family run hotel", "user": "Winfee", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10089419, "likes": {"liked": "— The friendly staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I had read raving reviews regarding this property in Florence and decided to book it. Using instructions and a map from the internet we found the hotel with no problems. Rosanna greated us and she and her family are lovely and willing to assist with anything. The rooms were amazingly large with a very comfortable bed and reasonable sized bathroom. There was cooling in the room which was lovely and also a safe for our travel documents. The breakfast offerred by Hotel Colomba is the best we experienced throughout our whole trip. Eggs, toast, cheeses, proscuitto, made to order coffees (any type you like) and fresh juices. Hotel Colomba is literally within 100m of Galleria dell Accademia where the statue of David is housed and within walking distance to all the other Florence sights however there is a bus stop within 20 metres of the entrance with buses that can take you anywhere. I would recommend this hotel to anyone who is travelling to Florence and with free use of a computer with internet access it was great for emails and downloading photos from my camera.", "title": "Pleasant Suprise", "helpfulness": 3, "user": "Ugly72", "date": "November 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6053808}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "I echo all the positive comments about great location, cleanliness of room, good breakfast, very helpful hosts, reasonable prices, etc. Additionally Rosanne went above and beyond for us. My husband and I had to leave very early in the morning to catch the first train. In our haste, I left my wedding band in our room. Rosanne contacted us as soon as it was found and she mailed it back to me in the US! While it was only a plain silver band, it certainly has tremendous sentimental value. I doubt that another more corporate hotel chain would have troubled themselves. I would highly recommend this family-run hotel.", "title": "Went above and beyond", "helpfulness": 1, "user": "Acork", "date": "November 2, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6044389, "likes": {"liked": "— Very helpful hosts who went above and beyond"}}, {"rating": 2.0, "title": "Dingy rooms, great location", "text": "We were moved to this hotel when the hotel we booked gave away our reservation. We were very disappointed to see the Hotel Colomba as it is very dingy looking, with small bathroom, older looking furniture and tiny lobby. It looked and felt like a dorm room. They even lock up the entrance after 1:30 AM! Luckily we were in by then but what would one do? Our room was directly opposite the front desk about 2 feet from it - which actually felt like an intrusion on our privacy. the room was large and had one double and one single bed (we were two sisters) and was the largest we had in Italy. But there were no rugs and the room felt cold. The bathroom reminded me of those on cruise ships - very tiny - but sufficient. The owner was pleasant and the breakfast was OK. But this hotel lacks any kind of charm. The entrance was awful - you have to go up to the second floor in the tinist elevator ever made, I think. Great location, one block from the Accademia for David and couple of block to the Duomo.", "helpfulness": 1, "user": "vlopresto", "date": "October 27, 2006", "id": 6018941}, {"rating": 3.0, "stay_parameters": "Stayed September 2006", "text": "This hotel is comfortable for European standards and very clean. The location is great, and the staff was very helpful. Breakfast was yummy, and the coffee fantastic. I thought the price was a little high for what you get, but it seems that the prices were high all around Firenze.", "title": "Comfortable place; good location", "helpfulness": 1, "user": "kittymama76", "date": "October 10, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5934515}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We travelled to Florence for a weekend break. The flight went smoothly, we got a great, chatty taxi driver and the weather was glorious.", "title": "We could not fault the Colomba!", "helpfulness": 2, "user": "rentawitch", "date": "October 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5924089, "likes": {"liked": "— comfort and appointments of room, friendliness of owners and staff", "disliked": "— ermmm, nothing? I couldn't stay longer?"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "To find a quadruple room in Florence is not an easy task in the first place.", "title": "Evviva la Colomba !", "user": "Mezzon", "date": "August 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8350941, "likes": {"liked": "— The Atmosphere", "disliked": "— The street outside"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We arrived at Colomba and found an hotel far above our expectations! Not only the location is perfect.", "title": "Hotel and Rosanna were Wonderful", "user": "Mrsdaysie", "date": "July 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8263849, "likes": {"liked": "— Rosanna, the owner", "disliked": "— There was nothing that I didn't like about this hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "This is a family with serviceinstincts beyond anything one can dream of; from serving us an extra early wonderful breakfast ( due to an early morning flight) to mailing us our forgotten keys,wallet and stuff to Sweden! The fantastic Rosanna would not even accept us to pay for package and postage!", "title": "A Great Find!", "user": "PavlosBrazil", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8263218, "likes": {"liked": "— Location and confort", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Throughout the years we have stayed at various places in Florence but this surely beats them all!", "title": "I would certainly return", "user": "gfurla", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8262284}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Vi saremo sempre grati!!", "title": "A little gem", "user": "Catherine2007", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8232196, "likes": {"liked": "— Friendliness of staff and great location", "disliked": "— The lift"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "It is absolutely worth the money. Stay here if you are in Florence for a few days and a little bit on a budget.", "title": "Fantastico!", "helpfulness": 2, "user": "Frilo68", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8376398}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "We stayed here 2 nights in July and enjoyed our quiet and cool room in the bustling city of Florence. We hadn't expected Florence to be so crowded (and were frankly somewhat disappointed in the city that most rave about), but we loved coming back to our room. We had asked for a quiet room and we had one -- we walked through what appeared to be family quarters to get to it on the third floor of the building. The room was the largest we had in a 2 1/2 week trip and the bathroom actually had a shower door! The rest of the trip we were wiping the floor after our showers. The staff was as helpful as other reviewers have all said. We didn't think the walk from the train station was as short as others claim, but they happily called a cab for us the day we left and it was worth the 10E to not trail through the crowded sidewalks with our luggage in the heat of the day. The room was very clean and the breakfast was good. We really enjoyed the variety of fresh fruit each morning. We loved the SKY TV (lots of English channels) and the free internet. The only thing l would change is the towels -- the waffle weave type was scratchy compared to the typical terrycloth.", "title": "Great! Very family friendly! Perfect Location!", "user": "familyltravel", "date": "August 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8367960, "likes": {"liked": "— Location and Helpful Owners", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I stayed at the Colomba for two nights in July with six other guests, two adults and four teen-age girls. I cannot say enough about how much we enjoyed our stay. Signora Rosanna and Signor Michele made sure everything was perfect and it sure was. The two rooms that we had were spotless and the bathrooms sparkled. We had a delicious breakfast every morning, with high quality items, like the fresh pastries and excellent juice selection. The location of this quaint hotel is fantastic, just a short walk to the Duomo, the San Lorenzo market and the Uffizi. The Accademia is just behind the corner from the hotel.", "title": "Excellent Hotel - Location, Room, Staff all great", "user": "CubsWin_8", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8359708, "likes": {"liked": "— Room, Location, Breakfast", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Our recent trip to Florence was again enhanced by staying at this wonderful, centrally located hotel. The refurbished rooms are excellent and the delicious coffee and breakfasts ensured a good start to our day. As always, the family who run the hotel went out of their way to help us, particularly Rosanna for whom nothing seems to be too much trouble. I am delighted to recommend Hotel Columba.", "title": "We keep coming back", "helpfulness": 2, "user": "ColinAndSandra", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6184676}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We stayed at Hotel Columba in the first week of November. We knew this was a family run hotel and knew that it was not a luxury accommodation. We arrived there early morning and our room was not ready. We were very early and didn't expect our room to be ready for a while. Rosanna took our luggage and let us rest in a very nice sitting area. Within an hour of our arrival our room was ready! It was a very nice and CLEAN room and attached washroom. Very very big and spacious for Europe standards. It was in front of the reception and we had heard it could get noisy, but we really wanted to check in and rest. I have to say, we stayed there for 5 nights and only were disturbed by a little bit of noise on the last night. The rest of the time, we didn't even notice that we were in front of the reception. Rosanna and her family were wonderful to us and always made us feel welcome. Something you don't get at many of the 'big' hotels. They also had free internet access and an area with lots of books and magazines. Overall a very nicely organized hotel. The breakfast was wonderful as well. The hotel staff was always very very pleasant.", "title": "Wonderful", "helpfulness": 4, "user": "Omer22", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6162208, "likes": {"liked": "— Clean rooms", "disliked": "— It could use some warmth as far as decor is concerned."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "If you are looking for a great location close to everything, clean and spacious room at a very very reasonable rate, this is the place to stay. I would go back if I ever visit Florence again.", "title": "Wouldn't go back", "helpfulness": 5, "user": "rosysbird", "date": "November 20, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 6156962, "likes": {"liked": "— Location", "disliked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Thank you Rosanna, family and staff. You made our experience very memorable.", "title": "Perfect Location", "helpfulness": 1, "user": "toploc", "date": "November 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6139138, "likes": {"liked": "— friendly homely feel and spacious rooms, excellent location", "disliked": "— stairs and small lift"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Stayed here for 3 nights in September - we were given a room on the 3rd floor, one floor up from the rest of the rooms which we accessed through a fire door then walked through what was, in fact, somebody's sitting room where a teenager was studying a lot of the time then into our room. We found this bizarre.", "title": "Friendly, convenient, and clean!", "helpfulness": 1, "user": "pcleary", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6121622, "likes": {"liked": "— Friendly and clean"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 10, "average": 40, "very good": 178, "terrible": 5, "excellent": 477}, "aka": "Colomba Hotel Florence", "slim_ranking": 0.0695652173913, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Hotel Colomba prefers the familiar look and aims to make travelers feel at home. the hotel staff is well prepared and ready to respond to all the needs of travelers. located in a central area of Florence, this hotel is also famous for its cooking."}