{"user_rating": 4.0, "review_count": 663, "name": "Hotel Deca, Seattle", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I have been staying in this hotel periodically since 2004. It has always been my first choice when I travel to Seattle for my official trip. Helpful staff, free wifi, have one of the most coolest lobby i seen in the northeast. They even have a fire place in the lobby. The rooms are comfortable, clean and most important safe. What else you want for a hotel.... Maybe the only improvement that they need to inprove is the breakfast. Should cater more varity to suit different taste.", "title": "Comfortable, nice and safe...whatelse you want in a hotel", "helpfulness": 2, "user": "wilson_angs2002", "date": "September 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8704415, "likes": {"liked": "— Comfortable and clean", "disliked": "— Breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "I have stayed several times in the University of Washington area. The other hotels (Silver Cloud, University) are not much, and only a little less $$ than the Deca. The Deca has some class. Clearly this is an old building that has been refurbished, and at least on my floor and in my room, this refurbishment was done well.", "title": "Best in the area", "helpfulness": 2, "user": "calvino", "date": "September 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8664818, "likes": {"liked": "— The physical hotel -- nice common area, good bar, classy room.", "disliked": "— No UW-area hotels are very good value."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I think that if I go again I'll stay in Bellevue and drive, rather than going for the local option. But if you want to be within walking distance to the campus, I'll recommend the Deca.", "title": "Unfortunate experience??", "helpfulness": 2, "user": "Gwelly", "date": "September 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 5.0, "location": 2.0}, "id": 8661753, "likes": {"liked": "— Rooms", "disliked": "— Poor PR from front desk"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "Was recommended by a hotelier to stay at the Deca but our experience was not what it should have been. We booked (family of 4) directly with the hotel in Feb 2007 for 3 nights in August. I called in July 2007 to make sure the booking was still good. They had no booking. Re-booked. Before our departure I noticed that my bank account was down two night stay for some dates in July. I called the hotel and discovered they had accidentally charged my credit card for someboby elses stay!! All was refunded - even the currency difference after we complained.", "title": "Nice facility but the staff is...", "helpfulness": 3, "user": "IowaGirl52", "date": "August 6, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8362973, "likes": {"liked": "— the room", "disliked": "— the staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Hotel rooms and lobby are lovely. The walk to the breakfast room is just shabby. More could be done to improve the breakfast. The lifts are a very, very, very slow - mostly occupied by the chambermaids. Other guests also agreed.", "title": "Unparalelled Value!", "helpfulness": 3, "user": "van1207", "date": "July 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8218217, "likes": {"liked": "— Service and value", "disliked": "— No fan in bathroom"}}, {"rating": 1.0, "title": "Rude Front Desk", "text": "Front Desk were all young woman I guessed they worked here part time and were college students. When checking in I felt like I was imposing and they were doing me a favor. After the cold reception I went to my room and though nicely decorated and clean was too small I couldn't walk around the bed without tripping. Don't stay here I would go as far as paying less for a 2 star than stay here again.", "helpfulness": 4, "user": "jetfly", "date": "July 10, 2007", "id": 8092189}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The art deco overhaul of this hotel was nicely done. The outside of the building is still quite blah (but they are apparently working on this) but the interior is complete. Booked the room on Priceline for $79, and received a well-decorated though small corner room with a bizarrely large closet. Rooms come equipped with flat screen TVs, and iPod clock radios (bring your own iPod). Everything was clean and tidy overall. The hotel throws in free parking with your room, so considering the usual hotel parking rates of $20 or more, it's an excellent throw-in. They also include a complimentary continental breakfast served in large room near the lounge. Good basic fixings - hot and cold cereal, toast, bagels, danishes, apples, bananas, coffee, tea. The one drawback may be the university district neighbourhood. There is almost no street life around the hotel, not much in way of shops or restaurants. There's a Tully's in the lobby that closes by 6 pm, a Safeway a few blocks away that's open late, and a movie theatre. But the area is quiet at night, not neccessarily in a good way. There was some police activity one night, and in general, the area doesn't have a great reputation in the city.", "title": "Nicely refurbished", "helpfulness": 3, "user": "stayklassy", "date": "July 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8087327, "likes": {"liked": "— Recently refurbished, free parking and breakfast, short drive from downtown", "disliked": "— Dodgy neighborhood, lifeless area."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Our son just graduated from the University of Washington and we needed a place to put our out of town guests coming to his commencement. We chose this hotel because it is so close to UW, but also is just a few minutes to all the downtown tourist attractions. It was the absolutely perfect choice! The hotel is gorgeous with a large lobby where family members can gather before heading out for the day, and the staff were amazing! Everyone we encountered was so friendly and helpful. My 75 year old parents need a lot of help getting around these days and everyone went out of their way to make sure they were comfortable. One of them even walked with my Dad to the local grocery store a few blocks away because he insisted on walking instead of taking the hotel's shuttle van, because they were worried that he wouldn't be able to carry the bags back by himself! Our family had a total of five rooms, and everyone of them has called me to thank me for choosing Hotel Deca - it will always be our first choice for our out fo town guests from now on.", "title": "Wonderful Staff", "helpfulness": 5, "user": "emptynestersrus", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7974814, "likes": {"liked": "— the staff", "disliked": "— no hot breakfast"}}, {"rating": 1.0, "title": "Superficially Nice, while Actually Quite Poor", "text": "The place felt like a cheap one star hotel masquerading as a nicer hotel with its superficially chic, but cheap-on-closer inspection-art-deco furniture.", "helpfulness": 4, "user": "megabases", "date": "June 19, 2007", "id": 7928853}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I am a middle-aged professional that travels for business at least once a month. Hotel Deca looked like the appropriate place to stay, given its proximity to the University of Washington.", "title": "Let Down!", "helpfulness": 4, "user": "blondy1623", "date": "June 12, 2007", "detail_rating": {"front_desk": 1.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7841026, "likes": {"liked": "— Breakfast", "disliked": "— Front Desk"}}, {"rating": 4.0, "title": "Hip hotel", "text": "Had a pleasant stay at the Hotel Deca in Seattle. Good for business travel-- comfortable chair with desk, helpful staff that was knowledgeable about the Seattle area. I was there for a conference.", "user": "Johosephat", "date": "February 16, 2008", "id": 13598995}, {"rating": 4.0, "title": "Great stay and plan to return", "text": "Had a nice room on one of the top floors in the corner of the building. There are good views available like this one, so I recommend asking about it. There is a downstairs bar/restaurant. Small TVs, though. So if, for example, you are trying to watch the Red Sox in game 2 of the World Series, you should go somewhere else. :-)", "user": "Jruss_in_PA", "date": "January 4, 2008", "id": 12338498}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Swanky lobby with a fireplace (can't remember if real fire) is a good place to lounge around and meet up with a friend.", "title": "Nice place", "user": "MartyMcFly", "date": "December 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 11219903, "likes": {"liked": "— Decor"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "In the University district. Plenty of good food nearby. I would stay here again.", "title": "Nice Surprise", "helpfulness": 2, "user": "MCT672", "date": "November 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 11057067, "likes": {"liked": "— Location, amenities, value, decor, free parking", "disliked": "— Breakfast, small bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "I had a very good stay here. I chose one of their smaller rooms for the price. I loved the tasteful modern decor and the room felt very cozy. The rate included wireless acess, free and easy parking and complimentary b'fast. ( I thought the b'fast was ok, but preferred to get my coffee in the starbucks-like coffee shop right there in the same building. ) My only problem was the heat vent was near the ceiling so upper half of the room was quite a bit warmer than the lower half. Since I was there in Oct/Nov. it was a little cool. Still, I really enjoyed my stay and would definitely stay there again!", "title": "Would definitely stay again", "helpfulness": 1, "user": "Spokane_WATraveler", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10500106, "likes": {"liked": "— Location and parking", "disliked": "— Some repairs needed (remote, light bulbs, drain)"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Props to Priceline for turning me onto this great boutique hotel. I got a great rate on a wonderful hotel in a nice location.", "title": "Deca is a delight!", "user": "KimberlyONE", "date": "October 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10088134, "likes": {"liked": "— Beautiful decor, location and service", "disliked": "— Umm, cramped parking spaces? Nothing really."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "I reserved a room with a king, but when I checked in they didn't have one available. As a result, I was upgraded to a suite with two queen beds. It was a great room and I have zero complaints. Staff is very friendly and quick to respond to any requests; I forgot a toothbrush (doh!) and one was brought to me within minutes.", "title": "Small but nice and clean", "helpfulness": 1, "user": "miss_kat_lover", "date": "October 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10074720}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "Parking, internet access and breakfast are complimentary. The wifi connection is available throughout the hotel, which makes sitting in front of the fireplace in their gorgeous lobby to catch up on work a nice option.", "title": "Loved this HOTEL!", "helpfulness": 1, "user": "enjayflyer", "date": "October 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10055262, "likes": {"liked": "— Funky cool art deco style of the property."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "After reading all the reviews (the good ones and the bad), we decided to stay at the hotel because it's relatively cheap for a 3 stars hotel (around $100 per night on Priceline). Yes, the room is quite small but it is very clean and has all the amenties (big LCD TV, alarm clock radio where you can plug in your iPod, Dvd, comfy bed). The style of the hotel is elegant and I find quite tasteful. While it is not in the heart of Seattle, they do provide a free drop off/pickup shuttle service (which ends at 10PM at night) to the Westin in Downtown. The free breakfast I find was pretty good... bagels, fruit, yogurt, bread, cereal, tea/coffee, etc. I would definitely stay again!", "title": "Interesting renovation, improve room service!", "helpfulness": 1, "user": "cooperllc", "date": "September 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 10016650, "likes": {"liked": "— great bed linens, nice interior", "disliked": "— hallway noise, room service"}}, {"rating": 4.0, "title": "Nice boutique hotel near U.W.", "text": "This was a fabulous hotel in the University district area.", "helpfulness": 2, "user": "drssyoon", "date": "September 20, 2007", "id": 8829241}], "location": {"country": "United States", "city": "Seattle"}, "stars": 3.5, "variance": {"poor": 36, "average": 73, "very good": 221, "terrible": 29, "excellent": 304}, "aka": "Deca Hotel Seattle", "slim_ranking": 0.387096774194, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The 158-room art deco Hotel Deca is located in the heart of Seattle’s University district, a vibrant, growing neighborhood that is home to students, artists, and families. This charming Seattle hotel is located just two blocks from the University of Washington campus, ten minutes from downtown’s bustling shopping district, restaurants and galleries."}