{"user_rating": 4.5, "review_count": 559, "name": "Hotel Odeon Saint-Germain", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "After thirty years of frequent travel to Paris we have found the best hotel we have ever stayed in -- or rather, lived in, for a week. A lovely, elegant yet comfortable decor penetrates everywhere, from the salon at the hotel's entrance (perfect for receiving friend's before an evening on the town), to the salle a manger where a delicious breakfast is available, to the rooms, of which there are maybe two dozen. We had two rooms on the fourth floor, arranged in a sort of suite, because we were four: my wife and I, and our children, 12 and 13. We were extremely comfortable, in every way. Air conditioning was efficient and unobtrusive. Bathrooms were lovely, uncluttered, and immaculate. We were on the street side but the double-pane windows kept it quiet as a Bentley. The staff -- in particular the three young men who rotate at the reception: Brice, Mathieu and Sebastien -- were attentive, extremely courteous and anxious to be of assistance. Though I speak fluent French, I often heard them speak English to other guests and on the phone, and their English is very good and can make Paris a lot more serviceable for those who do not speak French. One evening I asked Mathieu to make a reservation for us and some friends at a restaurant in the neighborhood -- 7 people in all. To my astonishment, he walked to the restaurant, spoke to the owner, and picked out the perfect table for us. Taxis, theatre tickets, tours, packages, recommendations -- I recommend they be relied upon, and I know they relish the opportunity to serve. I must say, also, that we were fortunate to be introduced, one day, to the owners of the hotel -- an exquisite, charming couple whose presence and conversation were a pleasure. They decorated the hotel, they selected the staff, and they have infused the hotel with their taste, knowledge and spirit. And the location? Get on your Google Earth or GPS and take a bird's-eye view. The heart of the heart of Paris: St. Germain-des-Pres, between the gorgeous Luxembourg Gardens two blocks south, the boulevard St. Germain two blocks to the north, and all around a classy neighborhood with a calmly vibrant nightlife, wonderful restaurants, shops and sites -- everything we wanted to do with the children in walking distance. This will henceforth be our home for our yearly trip to Paris. It should be yours.", "title": "Perfect Hotel in the Perfect Location", "user": "Jopebi", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35524427}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "My adult daughter and I spent a week in Paris in June. The hotel Odeon St. Germain was just wonderful. I had booked an executive twin but they upgraded us to a jr. suite at no extra charge. Our room was at the top of a spiral staircase. Very quiet with blackout shades; a plus in the long days of June. The staff was so accommodating with dinner reservations and all. Also, the location is perfect - about 2 blocks from the Odeon metro, walking distance to Notre Dame and the Luxenborg Gardens (our favorite) with lots of cafes nearby. Tip: if you have trouble with stairs ask for a ground level or street facing room. Otherwise there is no way to avoid the narrow spiral staircase for at least some of the rooms.", "title": "An oasis of tranquility and elegance", "helpfulness": 1, "user": "lizg718", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35456676}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "I stayed in this hotel for three nights in mid-July 2009, and I loved it. It is perfectly placed in a quiet street off Boulevard Saint Germain. The staff were excellent. I had asked if I could check in early because I arrived on an overnight transatlantic flight. I arrived and I was let into my room at 9.15am! The room was small but clean and functional, with a very comfortable room. The bathroom was great, with a powerful shower. And the wi-fi worked very well. I could not have been happier.", "title": "Lovely hotel", "helpfulness": 1, "user": "ChelseaRaider", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35413856}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Tiny room. Smelled smoke through the walls. Love St. Germain, but would stay elsewhere next time.", "title": "Great location, but there are hundreds of others to choose from", "helpfulness": 1, "user": "carpediemgypsy", "date": "July 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 34887227}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This is a wonderful hotel. Went off of Tripadvisor reviews, and feel sure I did the right thing. Close to Carrefour Odeon 4 Métro line, Perfect for a morning jog in Luxembourg gardens and on the Isles. Shopping withing walking distance is great - Rue St Sulpice & Blvd St. Germain are both superb, Le Bon Marché is walkable, too. We took three rooms, double, executive, and single; if you can spend a little extra, go for the executive, although all three were great, and spotlessly clean. The beds are on the firm side, which we like. Double-glazed windows, individually controllable a/c. If you rely on internet/email, make sure you bring your computer - I believe they have wireless in the rooms for free. We didn't bring the computer, so had to use the one they had downstairs, which was rather slow and unpredictable (also, that French keyboard...) The buildings's bones are old, so don't expect a Hausmanian grandeur. Breakfast (downstairs or in your room) was optional, and, although not a bargain, still a great idea if you're in a hurry or can't face ordering yet another grand crème/viennoiserie. Very nice, attentive bilingual staff. Would go back in a second!", "title": "Great value and friendly staff", "helpfulness": 1, "user": "George610", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34534459}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I have stayed in Paris several times before, mostly on stopovers between Asia and South America. Of all the hotels, this one had by far the best location - combined with cleanliness, nice rooms and beds and friendliest staff I have found in a Parisien hotel. I honestly can't recomend this hotel enough. Our room was of a good size, on the first (second for non-Europeans) floor. I was worried that there might be some street noise, but Rue St Sulpice is surprisingly quiet. In every direction from the hotel there is something interesting within a few blocks. North you have the Seine and Notre Dame, East is Blvd St Michel - with some excellent bookshops (in English!), South is the Jardin Luxemburg and West is St Sulpice itself. Not the cheapest option - but you won't regret it.", "title": "Great location, great hotel", "helpfulness": 1, "user": "Havelock-Karlson", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37608374}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "This was the second stop on a mother-daughter trip to London, Paris, Rome, and Sorrento. It was our first trip to Paris. The hotel was nice; it looks Parisian from the moment you walk in the door. Great colors! The reception area is small and dark and they have a computer with free internet access. The problem for me was that they had a French keyboard. Found it easier to use the free wi-fi from the room. A very nice breakfast in the mornings. The women who worked the breakfast service were very sweet. The room was adequate for our needs. Great chocolates at turn down and L'occitane products in the little bathroom. Tiny elevator that scared us--use the stairs if you can! Cute shops and lots of cafes nearby..easy walk to Notre Dame and the Metro. We didn't find the staff at the reception desk to be especially helpful. They weren't bad, but didn't go out of their way to help us. They couldn't make change for us...and neither could/would the nearby bank (very convenient!), or crepe place.", "title": "Nice boutique hotel", "helpfulness": 1, "user": "hkcjmc", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 37388148}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "A perfect boutique hotel in the heart of the Latin Quarter...just down the street from the metro and the Rue de Buci which had shops,marketing and cafes all rolled into one. We felt like it was our own apartment with a great room on the first floor. Matthew at the front desk set up the best romantic date ever with a gourmet river cruise with live music and dancing! Staying at the Odeon made all the difference. Merci", "title": "Location location location!!!", "helpfulness": 1, "user": "capecodder14", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37363709}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I had the pleasure of staying at the Odeon Saint-Germain hotel for 9 nights in July. The staff was courteous, polite and accommodating. The hotel is situated on a quiet street with nearby dining and boutique shops. The area that surrounds the hotel is bustling but never touristy. The hotel is also a 5 minute walk to a very reliable and safe metro. The rooms were a good size and graciously appointed. The rooms were also spotless. Housekeeping did an outstanding job each day and when we would return to the room; it would look brand new. The concierge was particularly helpful. We were able to arrange several excursions and met our every request. There were absolutely no issues with the hotel the entire time that we stayed. It was truly a perfect getaway. I would recommend this hotel to anyone. If you are looking for a quaint, family-run hotel that offers superb service in the heart of the 6th arrondisment, then this is your place.", "title": "Perfect Hotel in a Perfect Location", "user": "Daxselle", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36906931}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "This hotel was clean and the staff were helpful and friendly. The breakfast was complete and served by a competent server who was most anxious to please. The management was co-operative with directions to places of interest. This hotel is well-situated and easy to get to any attractions.", "title": "I would stay there again, in a heartbeat!", "helpfulness": 1, "user": "latgreen37", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36424693}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "Booked an executive room but i'm not sure exactly what that word means to them as the room was very small, dark and no view. Beware if you are single as they tend to give you the smallest and worst room possible in the category you've booked. The bathroom and bath products were nice.", "title": "Didn't live up to expectations.", "helpfulness": 1, "user": "AppleEdmonton", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 36403260}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "My daughter and I stayed at this lovely small hotel on our first trip to Paris. The location is just wonderful--close to so many charming cafes and shops. The staff were welcoming and friendly. They helped us make reservations, arranged for taxis and gave directions with a wonderful attitude. Our deluxe room was nice and much larger than I thought it would be based on what I had read about Paris hotels. Our room faced the street and was quiet. We had a wonderful time and would stay here again.", "title": "Great Location, Nice staff", "helpfulness": 1, "user": "fun2travel63", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36122055}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "We used Hotel Odeon based on a favorable reveiw by Frommer. It completely lived up to our expectations. The staff and management are extremely friendly and helpful. Couldn't ask for better service. They were renovated recently and bathrooms are modern. The breakfast (extra charge) is very good and complete and probably reasonable at 14 euros. The hotel computer available to guests is a little balky, so suggest you bring your own laptop, if covenient. The rooms are all wired for computers. The left bank is very convenient to San Sulpice, Invalides, and Notre Dame. There is a metro stop nearby, The Odeon station.", "title": "A delight in Paris", "helpfulness": 1, "user": "ProfessorBob", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 36031030}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We were very well pleased and would use this again.", "title": "Charming ... but dark!", "helpfulness": 2, "user": "chaos", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 35926708}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "A lovely hotel and a very efficient welcome; we'd emailed to say we'd be arriving about midnight and that wasn't a problem at all. We were shown to our room (32) which was decorated with beautiful fabrics and crisp white bedding, the bathroom was small but beautifully fitted and very clean (and also had lovely l'occitaine shower gel & shampoo!) We also had an area to the right of the bottom of the bed, with a table and two chairs which was draped with even more fabric. A lovely spot for breakfast in your bathrobes! The man on reception was able to recommend somewhere nearby we could still get something to eat, which was really helpful.", "title": "A hotel that had everything right", "helpfulness": 1, "user": "ParisParis_france", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35903420}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Decided to spend the extra money after reading glowing reviews on this site.", "title": "Excellent hotel in an excellent location", "helpfulness": 1, "user": "LVSaint", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38814789}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Was not disappointed.", "title": "My hotel in Paris for future visits", "helpfulness": 1, "user": "mmsilva", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38376645}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "A few minutes walk from the useful Odeon Metro stop but far away enough on a fairly peaceful street a steps away from the magnificent St Sulpice church.", "title": "Expect a relaxing stay", "helpfulness": 1, "user": "CesmeTraveller", "date": "August 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 38214316}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Rooms are very tastefully decorated and arranged. Good lighting, nice TV, comfortable bed. Bathroom - excellent. Very classy, great working shower! Free wifi worked perfectly (from 1st floor up).", "title": "Very friendly staff - and great with our two year old.", "helpfulness": 1, "user": "BelJCG", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37794571}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "No trouble with outside noise (there wasn't that much anyway) with extra double glazed full length windows. Walls thick enough to not be troubled by louder guests. No balcony - shame.", "title": "great location but quite overpriced", "user": "helia_bunch", "date": "August 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 37736146}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 15, "average": 42, "very good": 136, "terrible": 2, "excellent": 364}, "aka": "Hotel Odeon Saint Germain", "slim_ranking": 0.0429447852761, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Intimate and very parisian, this hotel was fully renovated by the famous decorator, Jacques Garcia. This hotel offers an exceptional location just a stone's throw away from the church of Saint Sulpice and its delightful square, in the heart of Odeon and Saint-Germain-des-Prés districts."}