{"user_rating": 4.5, "review_count": 594, "name": "Hotel Si Como No", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "Other hotels in the same area also offer the same views or even better (if you are staying in the bottom tier type rooms) for a signicant reduction. There is no TV in the rooms and we thought that would not be a problem but it did matter during our third day while it was raining. I am a world traveller and I believe that this Manuel Antonio area is overpriced and does not offer the warm type beaches one would expect. The national park guided tour is helpful but not as good and what you would see in northern Costa Rica. Overall, this area is too overly developed and the town of Quepos has nothing to offer. Objectively speaking, spend more time in northern Costa Rica, especially the the Arenal area and explore the warmer, friendly waters, and less developed areas of the atlantic coastline unless you are a surfer or an older type.", "title": "overrated and overpriced", "helpfulness": 5, "user": "calmkey", "date": "October 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 4004018}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "We stayed at Si Como No for 2 nights during our stay at Costa Rica. AFTER checking in we were told that one of the resturants and one of the pools ( the one with the view) were closed for the entire month of September! They are renovating and there is some noise during the day. The view from our balcony was amazing but we totally agree with the earlier post about needing a renovation. The room did not smell but the cushions and bedspread were just plain old! It had a small kitchen in our room which was a little stange but ok. I do not think that it was worth the money. The staff was friendly and the food was good at the swim up bar and other resturant. We found the breakfast to be good as well. We went to the beach ourselves, which was great with big waves, nice chairs and umbrella.", "title": "Needs overhaul and 2 areas Closed", "helpfulness": 2, "user": "rowergirl1", "date": "September 22, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3932021}, {"rating": 5.0, "title": "Top Notch", "text": "Be aware that the sun is VERY strong - we went to the water 1st for 10 min. then put on sunscreen - BIG mistake - put it on right away, the sun is really strong, even my tanned husband got burned in 10 min. Overall there are many other places to stay that hopefully would be better.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 27, 2005", "id": 3810994}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I stayed at Hotel Si Como No on the second leg of my honeymoon in November. I enjoyed my stay here. The views are amazing, the staff friendly, and the free breakfast every morning was a great touch. The restaurant, which is basically a big hut, overlooked the ocean and really gives you the \"living in nature\" feel. A huge iguana even showed up next to our table!", "title": "Beautiful Views and Eco-Friendly...if you're into that sort of thing.", "user": "Austher", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16863967, "likes": {"liked": "— Location and Views!", "disliked": "— No television, not much happening after sundown"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our room, I must admit, was nothing special, except for the view from our balcony, which was amazing. It is an eco-friendly lodge, so there was no television. That might be OK for some, but it KILLED me (thankfully there was a sports bar up the road). They do have their own movie theatre downstairs which shows movies that have been on DVD for about a month.", "title": "Good hotel, but it doesn't know what it wants to be", "helpfulness": 2, "user": "megaflip", "date": "June 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16681663, "likes": {"liked": "— The staff and the view", "disliked": "— Being solicited to buy a time share"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The pool area is nice, with one pool for families and the other for singles/adults (with a swim up bar).", "title": "Very nice - pretty much lived up to expectations", "user": "youngsay", "date": "May 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16395328, "likes": {"liked": "— beatiful location", "disliked": "— price"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "They also provide multiple shuttles every day down to the National Forest and beach area, which is a huge plus. An hour of free internet is given to you, which you can access from the hotel store, and you can pay for additional internet time.", "title": "Very Expensive - Well overpriced", "helpfulness": 4, "user": "WorldExplorer35", "date": "May 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 1.0, "location": 1.0, "rooms": 4.0}, "id": 16333996, "likes": {"liked": "— Ocean View, Friendly staff", "disliked": "— Far from the beach (that was our main purpose), ultra expensive for the overall value received"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Overall, very happy with the stay, but keep in mind that once it gets dark, there's not much happening within the hotel. You'll probably have to hike to the neighboring hotels/bars.", "title": "Mixed feelings about this place", "user": "CheckingOneBag", "date": "May 20, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 16249217}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Everything was awesome. The staff was courteous the food was unbelievable. The wildlife was astounding. Being twelve at the time I went I loved the water slide, my cousins and I were sliding down it all day. Actually we were in the rainforest all day. Anyway saw two different sets of monkeys. That is the other thing. When you're there make sure that you go down the street to a restaurant that monkeys often frequent. If you are lucky enough to see them they go into the restaurant takes the food it wants and runs away. The whole display went on for twenty min. They are also very tame, my sister and I even got close enough to take a picture. Also take the Night Hike. It is a little eerie, but you see some amazing wildlife.", "title": "Loved it", "helpfulness": 1, "user": "awesome123123", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16207662}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We had a small but clean room that overlooked the water. Breakfast and staff were excellent. Pretty property, nice pool and nice bar. Shuttle to take us to the beach. highly recommended.", "title": "great hotel", "user": "girltraveler85", "date": "May 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15644897, "likes": {"liked": "— pretty property and nice breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Our family of four stayed in a deluxe suite for several nights in April. Although the suite was near the road (the noise was virtually inaudible, but I'd ask for one further down the hill), it was beautiful and had a stupendous view, with a great balcony . Bathroom was quite large and luxurious. The property is immaculate and the staff was very friendly and helpful. We brought too much sand into the room one day, and after contacting the front desk a housekeeper was at our door in two minutes.", "title": "Terrific hotel, staff, views", "helpfulness": 1, "user": "Marco2008", "date": "April 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15442489}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The kids loved the family pool and water slide. The breakfast buffet was quite good. We ate dinner at the more casual Tico bar near the pool. Food was pretty good -- particularly the mahi mahi -- but I thought the meal was somewhat overpriced. Smoothies at the swim-up bar are good and reasonably-priced. The hotel's in-house movie screening room was fun -- good sound and very comfy.", "title": "Amazing!!!", "helpfulness": 1, "user": "tyegator", "date": "April 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15197925, "likes": {"liked": "— Views and convenient, pleasant restaurant", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I highly recommend this hotel, assuming you can swallow the fairly high cost.", "title": "luxury rooms", "user": "driakm", "date": "April 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15059311, "likes": {"liked": "— Location and resort setting", "disliked": "— spa services overpriced to the experience"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2003", "text": "We spent 5 relaxing & beautiful days at Si Como No for our honeymoon. From the moment we arrived the staff was courtious & friendly. The hotel itself is situated on a hill overlooking the lush rainforest & Pacific ocean. Considering we were visiting during the green (rainy) season we didn't know what to expect.Our room was upgraded upon check-in based on availability & it was a wonderful treat! 3 balconies ranging in size opened up our city minds to the magic of the rainforest. We spent most of our days swimming in the adult pool & sipping fabulous drinks mixed by our favorite & friendly bartender Eric.", "title": "Beautiful Jungle Oasis", "helpfulness": 14, "user": "milica", "date": "August 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3756731}, {"rating": 5.0, "title": "A true jungle experience!", "text": "Keep in mind that you are staying in the rainforest & therefore you will come across various types of wildlife. On a hike through Manuel Antonio National Park we stopped & enjoyed a swim in the Pacific. My only warning would be to watch out for the tide (non-hotel related)-it comes in strong & early-so please be careful when swimming there & go early!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 10, 2005", "id": 3753115}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Excelent hotel - nice pool, good breakfast and pool side food, great location, good for kids, nice views, overall excellent time. make sure to go to the butterfly reserve right across the street - we saw a family of monkeys right after we entered the park. Manuel Antonio tours with a guide are a must and go to the 3rd beach in the park for safest water (nice cove no huge waves) and beautiful beach.", "title": "Great Experience", "helpfulness": 1, "user": "DiverChicago", "date": "April 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14739364}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "It is very rare that a hotel lives up to the hype. We have stayed at other hotels in the area and have always been disappointed. This is a gorgeous hotel that fits in totally with the surrounding area. The rooms are spotless, the air conditioning cold, the water hot - the restaurant was delicious , the staff was extremely nice and accomadating and we actually ate there 3 of the 4 nights that we were there. It is very unusual for us to eat in a hotel restaurant - 10 minutes to Manual Antonio. I would recomend this hotel to families or honeymooners - we cannot wait to return! Please feel free to contact me I would be happy to answer any questions.", "title": "Perfection!", "helpfulness": 1, "user": "flycatcher06", "date": "March 29, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14637556, "likes": {"liked": "— Everything!", "disliked": "— Nothing!"}}, {"rating": 5.0, "title": "Fabulous vacation resort", "text": "What a pleasure to find a resort that does everything right! At $225 a night we got a great suite with a beautiful view of the Pacific Ocean with a little island right off the coast. Spectacular. The A/C worked fine and there were also ceiling fans. Bed was truly king-size and comfortable. Rooms are spread in smaller buildings spread through the richly landscaped property. The included buffet breakfast was superb with made-to-order omelets, great fresh fruit, pancakes, French toast, the works, plus, an endless pot of Costa Rican coffee served by friendly folks who seemed to enjoy their work. An umbrella shaded table between the pool and the ocean was the perfect spot to enjoy it, and then to take a dip before getting into the day. There is a second pool for adults only, both with swim-up bars and hot tub. They show a movie every night - free. You can buy popcorn , M & M's etc. Their fancy restaurant had live guitar and wonderful fresh fish dinners for about $18. They have their own jungle research place across the street, with a fabulous butterfly tent filled with beautiful waterfalls and gardens and, of course, hundreds of lovely butterflies. The 19-minute flight to Quepos from the little Pavos airport on Nature Air was $70 and uneventful, saving a 4-hour drive on curvy 2-lane roads full of slow trucks (we had a driver on the way back, but broke up the trip at the Marriott Los Suenos). Hotel picked us up in Quepos ($10). The only negative part was having to leave.", "helpfulness": 1, "user": "DCtravelfolks", "date": "March 21, 2008", "id": 14426293}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We just returned yesterday and are already planning our next trip back!", "title": "exceptional!", "helpfulness": 1, "user": "ulooz", "date": "March 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14350582, "likes": {"liked": "— the whole experience", "disliked": "— i cant say anything bad- we enjoyed it all- but if I were un able to climb steps i would not recomend it."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "hotel was clean- very secure! they have security guards patroling the grounds and parking 24/7.", "title": "very nice stay", "user": "Melli56566", "date": "March 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 14329308, "likes": {"liked": "— pools and temperature", "disliked": "— can't think of anything"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "Hotel Como Si No is unique in that it has a pool area for families with kids, including a water slide and hot tub. Then, in a completely separate section of the resort, is another pool area for adults with a bar and romantic atmosphere. So families with louder kids (like mine) seemed just as happy as romantic couples. The views are awesome. Location is good, and there are several restaurants within walking distance. The included breakfast is awesome, with full omelette bar, eggs, meat, pancakes, fresh fruit, etc. Rooms seemed a bit small but are clean and air-conditioned. Staff was nice. Theatre showing nightly free movies was surprisingly nice. Cheap Internet bar nearby. Overall, we were very happy.", "title": "Great place for both families and people without families", "user": "Webman", "date": "March 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14222289, "likes": {"liked": "— Suits families as well as couples/childless parties well. Great included breakfast.", "disliked": "— Rooms a bit small."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I was worried at first, given some of the negative reviews. But the hotel room was beautiful and clean, with crisp white linens with a wonderfully soft comforter, a safe for valuables, huge shower, big balcony, and a view to die for.", "title": "Fantiastic! Would stay there again in a heartbeat!", "user": "travel7846", "date": "March 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14216135, "likes": {"liked": "— the adult pool, the room with its comfy, clean bed, and Claro Que Si.", "disliked": "— our room was located just above the kid pool, so we could hear screming kids all day. I'd ask for a different room next time."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The staff were all extremely nice and accommodating; we especially loved our waiter at Claro Que Si - he was the nicest guy ever. The food at both restaurants is fantastic. The breakfast buffet at Rico Tico is huge, with pretty much everything you could ask for, and the macadamia-crusted mahi mahi at Claro Que Si is to die for.", "title": "Nice hotel, cramped room", "user": "Girllamm", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 14081365, "likes": {"liked": "— It's a green hotel!", "disliked": "— cramped room"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Having a separate kids' pool was great - we used the adult pool and enjoyed the much more relaxing, romantic atmosphere. I think I could have happily spent the entire week just lounging around at the hotel and exercising the swim-up bar. Don't buy gifts at the hotel shop, though. It's way more expensive than anywhere else. Go to Quepos or the little shop on the road down to Manuel Antonio beach, or the street vendors in Manuel Antonio.", "title": "LOTS of nature - too much?", "helpfulness": 1, "user": "darkpilot", "date": "March 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 14056379, "likes": {"liked": "— Beautiful natural public areas, environmentally-consciousness, and friendly staff"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "As for things to do, we went on the mangrove kayaking tour and the canopy zip-line tour, and both were great. If you're looking for good cheap eats, there's a casado grill on the beach in Manuel Antonio (actually there's two, but the one closer to the water is better). $5 for choice of meat plus beans, rice, plantains, avocado, potatoes, and salad. It's a ton of food.", "title": "Second Year in Costa Rica", "user": "AtlantaBender", "date": "March 2, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13998341, "likes": {"liked": "— opening up the blinds each morning and seeing the monkeys and the Pacific", "disliked": "— not enough umbrella shade during afternoon sun at adult pool"}}], "location": {"country": "Costa Rica", "continent": "Central America"}, "stars": 3.5, "variance": {"poor": 28, "average": 57, "very good": 169, "terrible": 16, "excellent": 324}, "aka": "Si Como No Hotel", "slim_ranking": 0.30612244898, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Si Como No Resort Spa & Wildlife Refuge is a central-Pacific coast resort in the jungle-covered hills just above Manuel Antonio National Park. It’s barefoot luxury with a pura vida vibe, perfect for families and couples who love the beach, tropical adventures, spa, pools, superb dining and four-star accommodations. This award-winning eco-design nature resort & spa offers its guest its own signature version of \"barefoot luxury.\" Panoramic views are yours to enjoy from beautiful balconies looking down from the most idyllic hilltop in the area. Enjoy nearby beaches, Manuel Antonio National Park and the hotel’s private Wildlife Refuge and Butterfly Atrium, adjacent to the property. Renown for warm, friendly service, guests can choose from two excellent restaurants, guided nature and adventure tours plus shopping, fabulous nightlife and our own private cinema. And for Costa Rica weddings and honeymoons, this is where life memories are made, one tropical sunset at a time."}