{"user_rating": 4.5, "review_count": 808, "name": "Hotel Vintage Park - a Kimpton Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed in Seattlle for 6 nights and loved this hotel. We had a King Premiere room that was very well appointed and quite roomy. The bathrooms are nice but a little on the small side - other than that it was perfect. The bed was quite honestly the most comfortable I have ever slept on. We got the brand and style of matress from them and are buying one for our home - no kidding!", "title": "Great hotel with a great location", "user": "TexasTraveller56", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17709855, "likes": {"liked": "— The central location to everything Seattle has to offer.", "disliked": "— The only thing was the small bathrooms."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The location of this hotel is perfect for seeing all the sights of Seattle. You are a 5-10 minute walk from the piers/waterfront, Pike's Market, the Aquarium, and the monorail to the Seattle Center.", "title": "Pre and Post Cruise", "user": "ron_davidson", "date": "June 24, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 17188450, "likes": {"liked": "— Comfortable beds", "disliked": "— small bathrooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Anytime we are visiting Seattle we will definitely stay here.", "title": "Perfect Place to stay!", "user": "Catcollins", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16991182, "likes": {"liked": "— Quality of bedding/linens", "disliked": "— small rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008", "text": "Booked this hotel on Priceline so did not know what to really expect. We were really surprised. The hotel is really classy, the rooms are small but the beds are excellent. The staff was very friendly and eager to be helpful in anyway they could.", "title": "We love this place", "user": "Qestia", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16876924}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "My sister and I had a sisters trip in Seattle in late May and we booked the Vintage Hotel off of Hotwire for $119 per night. We we very excited it turned out to be the Vintage hotel as we love Kimpton hotels and have also stayed at the Alexis down the street. They are very wonderful boutique hotels with great service, furnishings and full of character. The location was ideal and seemed to be quiet for being in a city. The rooms are on the small side but they are well appointed and are surely relaxing. You get turn down service at request and Aveda spa products in the bathroom. No complaints here-well done!", "title": "Beautiful, quaint and conveniently located", "user": "mrsenano", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16625557}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "I chose this hotel for one reason: the location. It is very centrally located and so much of the city is a reasonable walk away. And anything that's not within walking distance is just a short car or cab ride away.", "title": "Great location, great hotel but...", "helpfulness": 1, "user": "travelman1370", "date": "September 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 20078618, "likes": {"liked": "— The location.", "disliked": "— Lack of storage space and overall cost."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Great things about the hotel: location, location, location. I also enjoyed the afternoon wine tasting. My room was tastefully furnished. The staff were all pleasant. I had requested an upper floor room and was given one, which I really liked; less noise from the street and a bit of a view. The bed was comfortable.", "title": "Agree that hotel is great if you get a deal", "helpfulness": 1, "user": "hundredflowers", "date": "August 31, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 19584084, "likes": {"liked": "— Clean, comfy beds", "disliked": "— $30 parking fee"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Things that were less than great:", "title": "Wonderful location and a great place to stay!", "user": "weddinggirlatlanta", "date": "August 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18745930, "likes": {"liked": "— Fluffy Robes!", "disliked": "— They actrually exzpected you to pay for internet! We needed it to check reservations for sea plane and only source was a paid computer not GOOD!!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The hotel lobby is tiny. If you're looking for a place with an impressive lobby, this isn't it.", "title": "great little place", "user": "magicsmom", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 17848546, "likes": {"liked": "— Wine tasting every evening, helpful staff, comfortable room", "disliked": "— We were very pleased with everything"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The wine tasting: I really enjoyed this but if you're looking for someone to be there to give you in-depth information about the wines, it's hit or miss. One day there was someone from the vineyard who really enjoyed talking about his wines. The next two days it was a hotel staff member who had very little information about the wines she was pouring. To her credit, whenever someone asked a question she didn't know, she'd go find the answer, frequently printing out information for us. A little bit of food is served with the wine (pizza) but if there's a crowd there for the wine tasting you probably won't get any.", "title": "Nice Place for Wine Lovers--Not Families with Children", "user": "Jami13", "date": "July 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 17801396, "likes": {"liked": "— Close to shopping district, tourist attractions", "disliked": "— No children's activities"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "I recently attended a conference in Seattle, and was pleasantly surprised with my hotel selection given it was not in the conference's block of preferred hotels. Hotel Vintage Park was very quiet, in an excellent location, and the room was spectacular. However, I am not sure if it is the area or the individuals, but to me if I am paying $800+ I expect the front desk staff to treat me with respect. Unfortunately, with each contact they seemed very snotty and did not go out of their way at all to be helpful.", "title": "Very Quiet", "user": "DodiLiJV", "date": "March 21, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14435933, "likes": {"liked": "— location", "disliked": "— front desk staff"}}, {"rating": 5.0, "title": "like a fine wine", "text": "We enjoyed a three-night stay at Vintage Park, an old building transformed into vibrant hotel that does not lack for service, amenities and convenience. We arrived just in time for the nightly wine tasting and sampled some wonderful Washington reds and whites along with free pizza from the adjoining restaurant, Tulio's. It's a small hotel and our room was fairly small but everything is clean and comfortable. Vintage Park is located just outside the downtown retail core but walking distance to Pike Place Market along the waterfront and Pioneer Square, the city's old town.", "user": "mkata", "date": "March 6, 2008", "id": 14097607}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Booked two rooms on priceline for a 4 star hotel in downtown Seattle for my husband and myself and our friends for two nights. We paid $120/night. We had a corner room and our friends had a room next to the elevator--and they had a much bigger room and bathroom than we did. So, if possible, try not to get a corner room if you can (rooms ending in 14 are corner rooms).", "title": "Decent Hotel in a Great Location", "helpfulness": 2, "user": "sommervillegirl", "date": "February 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 13794638, "likes": {"liked": "— location", "disliked": "— attitude, concierge not there"}}, {"rating": 4.0, "title": "Hotel Vintage Park", "text": "The bed was comfy, the room was clean, and they have lovely L'Occitane toiletries and funny animal print velour bathrobes in the closet. Heavy drapes block out all the light that facilitates for a good nights' sleep, but not a good view--although we weren't in the rooms for very long. One thing I found frustrating was the fact that the temperature doesn't go below 64 degrees to say, 60 degrees, and I like my room cold. Oh, well, not a really big loss.", "user": "cjlee32", "date": "January 24, 2008", "id": 12951770}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The hotel does have a wine hour (we missed it the first night, but they served two Duck Pond wines the second night). They also served some pizza from the restaurant (Tulio's) in the hotel--the restaurant is Zagat rated. It was pretty funny to hear the concierge pouring the wine tell us the wine was from Washinton when we had just driven past the winery the day before in Oregon and given a couple of bottles of the same wine from our friends (oregon wine).", "title": "Treat yourself to the Vintage Park!", "helpfulness": 1, "user": "seattlemariner", "date": "January 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12773982, "likes": {"liked": "— Almost everything!", "disliked": "— Valet cost"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "I was upgraded. A nice touch for the hotel to send a welcome email to me prior to my visit. I was greeted by a hand written note and cookies. It was roomy and quiet, you can't hear the traffic outside. I will stay here again. I like this hotel better than the sister hotel - Monaco.", "title": "Would stay again", "user": "czbozo", "date": "May 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16531457, "likes": {"liked": "— location", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Rack rates for this hotel are $250-350. At that price I might have been a little disappointed. But we got our room as part of a package deal for about $100/ night. At that price, it is a great hotel.", "title": "good hotel if you get a deal", "helpfulness": 2, "user": "honestyfromMt", "date": "May 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16261749, "likes": {"liked": "— location", "disliked": "— smallish room, a little loud, over-priced valet"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "The rooms are well decorated--quirky but stylish. Our room was a basic king room. It was a little small, but not terrible. We were facing the \"courtyard\" (really just a typical urban building air shaft but significantly perked up with a nice mural of a country scene). This kept down traffic noise, but we were surprised by relatively loud noise in the courtyard every morning. They have quality toilettries (Aveda) and offer lots of things for free (hair dryer, robes, toothpaste, fan, other little things you might forget or not be able to pack). The sheets and bed were very comfortable. Towels were average, pretty soft, but not luxurious. It had the usual over-priced mini-bar. They would have done better to provide a bottle of water and neat local snack for free upon arrival, to fit with the quirky \"we're different and better\" Kimpton hotel chain brand image.", "title": "Impressive decor, comfortable stay", "user": "emememSFbayarea", "date": "April 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14786243}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "They have a free nightly wine reception in the lobby with a local Washington red and white and thin crust pizzas. This was a nice touch. If you like to socialize with other guests, this is a great opportunity to do so. But if you prefer to hang off to the side with your friends, that was fine too. The concierge runs the wine tasting and is very helpful with ideas on restaraunts and things to do.", "title": "Great service! Earth friendly! Wonderful location!", "user": "lrgiles", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14647188, "likes": {"liked": "— Service with a smile!!!!", "disliked": "— No business center with computer to use."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The service was fine. No compliants. But no amazing kudos either. Check in and out were smooth. The valet service was usually pretty prompt, but they did forget to get our car once and we sat around for a while before we realized they were not getting it (note that valet is about $35/day with taxes, not including gratuity. This may be higher than some other hotels, but it was very convenient). We were a little disappointed that we got no upgrade or special treatment since we were on our honeymoon, but maybe that's all one can expect when they come on a budget package! Housekeeping was certaintly adequate. The place was spotless when we arrived. Daily cleaning was thorough. I would have expected turndown service at a place this nice, but we did not get it. I would also recommend they implement in-room coffee makers. There are coffee shops on virtually every corner in Seattle, and free coffee service (via small paper thimbles in the lobby), but in room coffee makers are so convenient.", "title": "Excellent Hotel", "user": "CAR50", "date": "March 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14526040, "likes": {"liked": "— Quiet room", "disliked": "— Nothing--Everything was great"}}], "location": {"country": "United States", "city": "Seattle"}, "stars": 4, "variance": {"poor": 26, "average": 67, "very good": 243, "terrible": 8, "excellent": 464}, "aka": "Hotel Vintage Park", "slim_ranking": 0.150537634409, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Hotel Vintage Park is a 4-diamond boutique hotel in the heart of Seattle, across from the famed Seattle Public Library. Celebrating the excellence of Washington State wines, the Hotel Vintage Park provides deluxe accommodations and exceptional service. Enjoy the nightly wine reception showcasing the region’s finest wines, stop next door for a meal at Tulio or walk to nearby attractions such as Pioneer Square, Pike Place Market and the Seattle Art Museum."}