{"user_rating": 4.5, "review_count": 318, "name": "Hotel Balcony", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Here's the GOOD News; and there's lots of it: GREAT location. Short walk to the Duomo, restaurants. VERY Friendly staff. Room was small, but OK. This is NOT a quiet street. Although it's a one way alley, it's the main route from Via Senese to the Train Station. We had a front room adjacent to the Balcony/Patio. Beacuse it was quite warm in April - the A/C was not turned on - it was necessary to leave the window open. The noise from traffic, sirens, bar patrons was 'very considerable' thru much of the night. And if someone decides to retire to the Patio for a late nite drink immediately outside your window, well....So here's the deal: I WOULD stay there again (because", "title": "Great location. Bring Ear Plugs.", "helpfulness": 1, "user": "TerrifiedOfNYC", "date": "May 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7628180, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "of the price) but, seriously, ear plugs ARE a necessity.", "title": "Great hotel, very well located and very friendly staff", "helpfulness": 1, "user": "froggy92", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7565697, "likes": {"liked": "— location and wellcoming", "disliked": "— no tub, just shower"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006", "text": "We stayed at the Balcony Hotel from April 30th 2007 for 6 nights and had the pleasure to discover a very clean and practical bedroom. The hotel is very well located , in a quiet street, within a short walking distance from the station and the Duomo.", "title": "Happiness is.....Depends on your needs", "helpfulness": 2, "user": "Dreamin'of$$", "date": "October 25, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 3.0}, "id": 6011606, "likes": {"liked": "— Location", "disliked": "— Not clean enough"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "We enjoyed the terrace during our stay, as we could relax there, drinking a capuccino, anytime we felt the need for a rest.", "title": "Practical and bargain-priced", "helpfulness": 8, "user": "baydreams", "date": "August 16, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5615722, "likes": {"liked": "— Bargain price and convenient location", "disliked": "— Breakfast choices are limited"}}, {"rating": 4.0, "title": "Great bang for the buck", "text": "We recommend this hotel, which has everything we needed and a major plus in the extremely friendly welcome we got.", "helpfulness": 7, "user": "FunTravelsLiz", "date": "July 17, 2006", "id": 5478100}, {"rating": 4.0, "title": "great location", "text": "stayed here in april, great location, staff very helpful and pleasant, rooms fine, breakfast a bit basic, but all in all a great stay", "helpfulness": 19, "user": "A TripAdvisor user", "date": "May 30, 2005", "id": 3510737}, {"rating": 2.0, "stay_parameters": "Stayed November 2005", "text": "My boyfriend and I arrived to Florence and checked into Hotel Balcony, which was a terrible experience. First at check in, he told me it would be 5 euro more than when I booked it and I could speak with someone in the morning about it. Furthermore, the lighting was terrible, room was dull, bathroom was almost pitch dark, and the shower was missing a glass door. (I am aware not all showers have doors, but this one was honestly missing). The man at the front desk was not very helpful, but tried by offering us extra towels for the shower. We asked for a difference room, but there were not any available. He told us that we could speak with someone in the morning about the shower problem. We were only in Florence for two nights and wanted to have a nice stay so we left. Also, upon arrival a lady was at the front desk because her key had broke while opening the door so she was holding a piece of a key.", "title": "Left The Night We Arrived", "helpfulness": 1, "user": "Kimberly1881", "date": "December 5, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 4161608}, {"rating": 5.0, "title": "Excellent Value - would stay again", "text": "We bumped into Hotel Accademia which was not too far away but definitely on a street that was well kept up in comparision. The rate for the room was similar to Hotel Balcony and really worth it.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "September 20, 2005", "id": 3925343}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "I booked this hotel for 3 nights in Florence with my Mother and was a bit anxious about how it would be despite the reviews I had read. We were very pleased. The location was perfect with lots of places to eat near by. The room was great and the shower room better than we expected. The staff were very helpful. Our room initially had a double bed but was changed to twin beds with no problem at all. We were given lots of suggestions and help with train timetables. I would highly recommend the balcony for it's fantastic value for money...in a prime location with comfortable beds, clean room and bathroom and very helpful staff. Breakfast was fine and lots of it.", "title": "Good location", "helpfulness": 21, "user": "Laiyee", "date": "September 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3915279}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Had a good experience with this hotel -- it was in a really safe area and I never felt in danger; 5 minute walk from the train station and 15 minute walk (or less) from all of the big tourist sites (Duomo, Uffizi, etc). Also features a rooftop terrace with some tables and chairs, which we used during the evening to relax with a bottle of wine. Clean rooms and a decent breakfast, which had bread, cereal, fruit, cheese, tea/coffee and juice. Staff speaks fluent English, French and Italian (and probably more languages...). Would return!", "title": "nice people!", "helpfulness": 17, "user": "brianderbyengland", "date": "July 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3638162}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "We stayed here (six of us) for 4 days. The terrace is great, epitomising the informality of the hotel. One of us became ill and the staff were brilliant, organising phone calls to the hospital, rearranging hotels in Rome etc. OK, it isn't the Ritz, but I'd definitely revisit - fabulous location, great people and excellent value", "title": "A quiet room in a central location", "helpfulness": 20, "user": "lovriena", "date": "July 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3632093}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "I've been meaning to write this review for a few months now. I attended a conference in Florence last April and needed a reasonably priced hotel in the centre of the city. I found Hotel Balcony on Tripadvisor; the reviews looked good so I decided to stay there. I wasn't disappointed. The hotel is in a great location, near the Duomo. My room was reasonably sized, very clean and in good condition. However, what made the hotel stand out was Franceso, the proprietor -- he's personable, friendly and very helpful; his restaurant recommendations were excellent. Also, the rooftop terrace was quite pleasant with a bit of the Duomo's dome visible from the edge. In April I had the terrace to myself -- a real treat.", "title": "A Big Thumbs Up", "user": "dg74", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20978069, "likes": {"liked": "— Friendly proprietor", "disliked": "— Indifferent breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "I'm a regular visitor to Firenze and have stayed in some pretty mediocre and overpriced hotels. So I've been looking for a place like this for a long time. A truly great little place to stay -- excellent location, clean and comfortable, and cheap as chips. The balcony is a terrific place to unwind and rest your feet and eat yummy food from the Mercato Centrale. And Francesco is quite possibly the loveliest hotel manager ever! The only problem is that the TripAdvisor reviews are so good that I might not be able to get a room in future...", "title": "excellent little budget hotel", "user": "Eltel6", "date": "October 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20826844, "likes": {"liked": "— Francesco", "disliked": "— my bed was a bit hard but that's really a personal taste"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "My mother and I stayed at the hotel Balcony for five nights and have had a great time there. The rooms are perfectly okay and clean, big enough for two persons and the beds and pillows were excellent. Although the stairwells smelled a bit smokey sometimes, the rooms didn't.", "title": "Great place", "user": "Margaretha84", "date": "August 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 19107967, "likes": {"liked": "— Cleaniness, very nice owner, great ambiance, great terrace and view at Duomo, central to the city.", "disliked": "— Sometimes a bit noisy, smokey hallways, shower pressure kind of low in the morning."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The owner of the hotel is very, very kind (and in an honest way!). He is very patiently, willing to give you information about anything and help you with whatever you need. One day I spoke with him about kiwi's and told him how much I like them, the next morning to my surprise he brought a whole bag of kiwi's from the market. He also took special regard to our requirements considering the room.", "title": "Just ok", "user": "gwjosh", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 19095825, "likes": {"liked": "— Francesco", "disliked": "— Uncomfortable bed"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed in a room at the front of the hotel and haven't experienced a lot of noise from the street, instead had a lovely view at the balcony. We did hear our neighbours talking once in a while, but they were really noisy I must say.", "title": "Just what we were looking for", "user": "marnzipan", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18462282, "likes": {"liked": "— Francesco", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The hotel owner is a very helpful person and we are especially grateful to him for helping us. The location is good for sight seeing all the area has to offer. Breakfast was excellent but you might need earplugs if you require a coffee, just joking, it is all good. Room was great, clean and spacious. Balcony has a good view down the street.", "title": "Highly recommend", "user": "aussie53", "date": "October 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10073855, "likes": {"liked": "— great location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The first impression of this hotel: very modest. The second impression: wow, what a terrific location!. If you want good value and a marvellous central location, you will find this hotel fits the bill. It is within short walking distance of high-end fashion shops, the Duomo, the squares and the Station.", "title": "'A' for Location", "helpfulness": 3, "user": "WandaTwo", "date": "October 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 10051477, "likes": {"liked": "— Location", "disliked": "— Lobby"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Our room was plain with no balcony, the bathroom clean and functional. The lobby is very basic, the breakfast is served in an area behind the front desk.", "title": "Recommend the Balcony", "helpfulness": 1, "user": "fenway67", "date": "August 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8347770, "likes": {"liked": "— location and friendly staff"}}, {"rating": 4.0, "title": "great stay, thanks!", "text": "The breakfast was much better than some of the other hotels where we stayed in Italy. The espresso machine works very well, there was fruit and appetizing cereal.", "helpfulness": 2, "user": "helloss", "date": "June 23, 2007", "id": 7969583}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The proprietor is extremely helpful, he aided us with a dinner recommendation and stored our bags after checkout.", "title": "Loved the hotel - very happy", "helpfulness": 1, "user": "Catalina30Dublin", "date": "June 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7845058, "likes": {"liked": "— Service and friendliness", "disliked": "— n/a"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We stayed at the Hotel Balcony for 5 nights, from May 15 checking out on the 20th. It is in a great location in Florence that is a 10 min walk to train and 5 min walk to Duomo and 10-15 to everything else! They provided a good breakfast of cereal, fresh fruit and buns and an automatic expresso/ hot chocolate machine that actually made really good cappucinos! I saw people with young children and they were very helpful and engaged. The room was clean and comfortable and the bathroom was clean except for shower doors that wouldn't clse properly so we had to use towels to clean up water seepage. The staff were excellent and so friendly and helpful that they made up for some problems. The a/c did not work and they did not have another room for us so they apologized and asked if we didn't mind propping our window open at night. It wasn't too warm yet so that was fine except that our room looked out directly onto the huge \"Balcony\" and they allowed it to be open all night. Guests were there drinking wine and enjoying the evening air at midnight and by 12:30am we called down to the front desk and said we can't sleep because of the noise. He came up to double check the A/C and could hear the people and said that it was still TOO EARLY to ask them to leave and I said we just want to sleep and it is not our fault that the A/C does not work. We told him that we had an early booking for the Uffizi at 8:30am and probably alot of the other guests were in Florence to sight see as well. He agreed and said he'd talk to the guests on the Balcony and explain and ask them to try to keep it quiet. It only worked for 30min and they were loud until 2am. The reception guy was nice and asked us how it went in the morning but I said in the end we had to sleep with our window shut so we were uncomfortable but he meant well and it is really the Hotel that sets the policy. I am going to write them a letter and let them know my concerns since they try so hard and seem so friendly trying to make your stay enjoyable. The other thing that is a problem here is that even though there are no smoking signs posted everywhere in the hotel, smoke wafts up and it is pretty strong. You don't smell it in your room but if you are sensitive to it then take this into account. In the end if you want a cheap hotel stay in Florence, this is a good place to stay because they do try their best and it is clean.", "title": "Great Econo Hotel close to sights but beware having room near balcony", "helpfulness": 5, "user": "Taiga", "date": "June 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 2.0, "service": 5.0}, "id": 5296010}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "My wife and I stayed at this Hotel and loved it.Really when you think about it,how much time do you spend in a hotel room whenyou are in Florence.The location was excellent,the Balcony to eat lunch after going to the Market was wonderful,the breakfast at the Hotel was great,the staff are more than helpful.It isnt the Ritz,but it also doesnt cost as much.Go,enjoy !and explore all that there is to see", "title": "Great Location", "helpfulness": 5, "user": "hrpurdy", "date": "May 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5236791}, {"rating": 5.0, "title": "Great little hotel", "text": "Hotel Balcony was a great little one star, ideal for a solo traveller on a budget who is looking for a nice private room. The room whole hotel was very clean, the staff was friendly and the location was great; 5 minutes from the train station, Duomo, Museo Academia etc. The washrooms were great excellent hot water supply and very modern and clean. The staff was more than accomodatind and the breakfast in the morning was much better than I was used to getting (Cereal, fresh bread, fruits and a selection of juices and different italian coffes) I would definitely stay at the Hotel Balcony again.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "December 26, 2005", "id": 4299825}, {"rating": 4.0, "title": "Good little hotel for the price...", "text": "Very helpful staff, decent room and bathroom, close to everything. Breakfast was fine, and included fresh fruit, which is always a bonus. The balcony was very nice, but unfortunately, it was too cold for me to enjoy it. Would recommend this hotel for the price. The only issue was the cigarette smoke that drifted from the downstairs up into the room, but a minor annoyance.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "December 9, 2005", "id": 4222582}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Our stay at the Hotel Balcony was just what we needed; a reasonably priced room within walking distance of all the sites. It afforded us much more. The common balcony was a great place to relax for lunch with a bottle of wine and bread/cheese we bought from the nearby market to discuss our day and our plans for the evening. After dinner, it is a place to socialize with the other guests. There was internet access at a desk on the second floor of the hotel, which was very handy and not much used. The breakfast was more than adequate and included in the price of the room! The owner, Franchesco recently purchased a cappuccino machine that makes several different versions of Italian coffee. Besides pastries he offers yogurt, cereal and fruit. Franchesco was a great host and very informative about his city; the sites as well as where to shop for food, wine and when asked about restaurants, he was an invaluable source. The room we stayed in was adequate... clean but not modernized. There was a refrigerator stocked with sodas, beer and water at reasonable prices. The bathroom was clean and sufficient.", "title": "Clean and Comfortable", "user": "SamsOne", "date": "May 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16371822, "likes": {"liked": "— Location, Staff, Economy", "disliked": "— All was great"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Four of us traveled Italy for 2 weeks. We stayed at Hotel Balcony on a whim and we now feel so lucky to have found it! The hotel is clean, safe and centrally located. The rooms are simple, but cute and clean. The common balcony is a fun place to drink a bottle of wine and socialize. The owner, Francesco, will loan you glasses and even open the bottle for you! He speaks perfect English and helped us out with finding good restaurants and even helped us book our hotel in the next city that we traveled to. This is, by far, the best overall value, for a budget hotel, that I have ever stayed at. Thanks Francesco!", "title": "Great Find!", "user": "Sarahincalifornia", "date": "May 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16183496, "likes": {"liked": "— The owner", "disliked": "— That we had to leave."}}, {"rating": 5.0, "title": "Great FInd, Great location, great owner!", "text": "My daughter and I were spending a week in Italy (Florence and Rome) and wanted a clean, safe, great location and inexpensive hotel. We really found all that and more in the Hotel Balcony.", "user": "psumomFlorida", "date": "May 7, 2008", "id": 15764984}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The owner, Franceso, was so wonderful, from the moment you enter to photos with him when you leave, you feel like you made a friend. Breakfasts were perfect. Rooms; small, but who spends time in the room with all of Florence outside your door!", "title": "Great place to stay", "user": "khath2", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14639420, "likes": {"liked": "— location", "disliked": "— I didnt dislike anything about our stay"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "We highly recommend this little gem of a hotel.", "title": "Great little hotel!", "user": "AmyClaireO", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14599364, "likes": {"liked": "— Location", "disliked": "— A bit hard to find if you don't have a map"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The Balcony offorded the most pleasant stay of my family's recent trip to Italy. It was the perfect match for our modest budget. The interior is reasonably spacious, relatively new and spotlessly clean. The Balcony's location is ideal. We arrived from and departed to Santa Maria Novella Station on foot, with all our luggage, and walked conveniently to every destination in the city.", "title": "Back in a Hearbeat", "user": "Rappen", "date": "March 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14578479, "likes": {"liked": "— location", "disliked": "— coffeemaker out of order"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Not least important in the three days we spent there was the personal attention of our host, Francesco. He seemed always available, always in good spirits and always helpful. He was especially attentive to children, and made our 9-year-old feel perfectly at home.", "title": "Small but very clean, GREAT location.", "user": "alliesun98", "date": "February 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 13235536, "likes": {"liked": "— Location, price", "disliked": "— Tiny bathroom, hallway and common area smelled of cigarette smoke"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "With another opportunity to visit Florence, we would return to the Balcony without a moment's hesitation.", "title": "Excellent location", "user": "Kdgteach", "date": "February 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13198345, "likes": {"liked": "— location", "disliked": "— smoky smell of rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Hotel Balcony was a great little place for us to stay while in Florence. The rooms were small, old, with very tiny bathrooms. We noticed mold on the ceiling, but other than that our room and bathroom were very clean. There is nothing fancy about this little hotel, but the location is great - just a few blocks walk from the train station and a few blocks from the Duomo. Florence, in general, was very walkable.", "title": "nice hotel, friendly staff", "user": "Christine S", "date": "November 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 11013208, "likes": {"liked": "— location", "disliked": "— no screens in windows but none of the hotels we stayed in had them in Italy"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The owners were very friendly and helpful. They stowed our luggage for us and recommended restaurants. I didn't realize that a little breakfast was included in the price of our room, so that was a nice surprise. Breakfast consisted of cold cuts, cheese, pastries and cereal. Very adequate.", "title": "Excellent Experience with Hotel Balcony", "user": "jeanne42", "date": "October 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10390930, "likes": {"liked": "— The service provoded.", "disliked": "— I liked it all."}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 2, "variance": {"poor": 7, "average": 28, "very good": 125, "terrible": 0, "excellent": 158}, "aka": "Balcony Hotel Florence", "slim_ranking": 0.180434782609, "description": "Hotel Balcony is located in the historical centre of Florence, very close to the Church of Santa Maria del Fiore and the Loggia dei Lanzi. The hotel occupies the entire first floor of an elegant and typically Florentine building, furnished in simple and sophisticated style. The common spaces available to guests include a large terrace with a panoramic view, from which it is possible to enjoy views of the spectacular Brunelleschi Dome. Our staff is available to help guests book tickets for museums, exhibitions, concerts and other cultural events, and to help guests organise tours through the Renaissance city and excursions to discover Tuscany and its surrounds. A rich sweet and savoury buffet breakfast, an internet point and a nearby garage with parking agreements, complete the broad range of services offered by Hotel Balcony in Florence."}