{"user_rating": 4.0, "review_count": 381, "name": "Hotel des Alpes", "reviews": [{"rating": 5.0, "title": "Great Family Hotel - Superb", "text": "Nice friendly hotel. It has renovated sparkling rooms which are good sized for small families (2 children). Very conviniently located and has all the buzz outside. Lucerne can be easily patrolled from this. Great value for money.", "helpfulness": 1, "user": "Ravind", "date": "September 18, 2007", "id": 8740746}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Ravind & Vinni", "title": "Great Non-Smoking hotel in Lucerne!", "helpfulness": 1, "user": "TravelAmy", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8655629, "likes": {"liked": "— No Smoking!", "disliked": "— No complaints!"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Sydney, Australia.", "title": "Good location in Lucerne", "helpfulness": 1, "user": "emmamaria", "date": "August 28, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 8524863, "likes": {"liked": "— Position overlooking the Chapel Bridge and lake"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed at the Hotel Des Alpes on July 26 and loved it. First of all, this was the first hotel that we have come across in our travels in Europe that did not allow any smoking on the property. That made the experience so much more enjoyable! The rooms were pretty spacious and clean. The location and views were amazing (Looks right onto the Chapel Bridge). The hotel is about a 5 minute walk from the main train station and is right across from the lake. There is a Starbucks a few spots down for those \"Starbucks Junkies\". The breakfast was nice and was served in a small dining room or out on the patio overlooking the bridge. We ate dinner in their restaurant and had wonderful food. Overall, we loved this hotel and would not hesitate to stay again.", "title": "Yikes, it was hot!", "helpfulness": 6, "user": "newinswiss", "date": "August 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8395878, "likes": {"liked": "— the view and location", "disliked": "— hot rooms, uncomfortable pillows, poor breakfast buffet"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Room had a small balcony and overlooked the Chapel Bridge and towards the lake. Very clean and with tea/coffee making facility. No air conditioning. Reasonable breakfast choice which can be taken on the outside terrace. Parking at the station was quite pricey and was a 10 min. walk away alongside a busy road. Paid for a room with a view but it rained! Hotel was in a good location for restaurants/bars. Lucerne was a much bigger place than we expected, a bit too big for us to want to visit again.", "title": "Fantastic", "helpfulness": 5, "user": "akcMelbourne", "date": "August 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8381205, "likes": {"liked": "— location and scenery from hotel room on the river", "disliked": "— no air conditioning"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The hotel des Alpes was very good. It is in an excellent location for walking about the city. We did not have a river view room and our room on the back overlooked one of the squares of Luzern. The room was large, modern, and comfortable. The breakfast was excellent. If you are using the trains and walking, it is a good bet.", "title": "Good hotel", "user": "Robbed_John", "date": "October 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10039032, "likes": {"liked": "— location and room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "I booked this hotel after reading several reviews in TA. I made notes of the comments. After 4 nights there, I will book with them again if I go back to Luzern. We got room #456 which has 2 doors opening into the balcony. We had the view of the river, the bridge, and the mountain. Wonderful! The room has everything we need. The bathroom is very nice. We got 2 beds pushed together which we don't mind. Actually, I preferred it that way. Reading about the attitude of the staff, I prepared myself for it. Yes, they will not be voted miss congeniality but they talked with me if I addressed them first. This aspect did not bother me since I knew it in advance. We ate at the hotel restaurant 3 times since the food was very good. With short stay like ours, we did not eat the same thing. By the third time, the waitstaff treated us like good friends. The location is perfect for ones who travel by train like us. One rec., go to the top floor of Manor department store, which is about 3-4 blocks from the hotel. They have self service style lunch that is very reasonable. Closed at 3pm, no dinner.", "title": "I was not disappointed", "helpfulness": 4, "user": "ggg5312", "date": "October 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10034430, "likes": {"liked": "— location", "disliked": "— can't think of anything"}}, {"rating": 3.0, "title": "Good place, if the weather's cool", "text": "It was hot when we were there and we had a small child with us. No AC and we had to keep the windows closed so the kid wouldn't venture outside. It was uncomfortable.", "helpfulness": 1, "user": "SurfJogger", "date": "September 29, 2007", "id": 10019328}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "The staff's not real freindly, either.", "title": "wedding", "helpfulness": 1, "user": "jmcSanDiego", "date": "September 27, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10011300, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Otherwise, it's a good place. The location couldn't be better.", "title": "Superb location", "helpfulness": 2, "user": "mgolddoc", "date": "September 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8829565}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "My husband and I stayed at the Hotel des Alpes for 4 nights in June 2007. We picked it based on its location – we were not disappointed. The hotel is in the heart of the old town, along the river and only a short walk from the train station. There are many restaurants nearby to choose from. If you are in Luzern on a Saturday or Tuesday, be sure to check out the outdoor market in the morning. There are stalls on both sides of the river. This is a great place to pick up some picnic foods.", "title": "Fabulous location, Reasonable price", "helpfulness": 3, "user": "nancelita", "date": "July 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8211206, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The room rate is reasonable by Luzern standards and includes a nice breakfast. We found our room to be very clean and unlike some European hotels, the room was a decent size. The bathroom was a little righter but it had recently been renovated. WIFI is available for an additional cost but we were unable to successfully connect from our room – other guests had similar problems. The WIFI does, however, work in the lobby. For those without a laptop, there is a computer in the lobby. Again, there is an additional fee for using it.", "title": "great view - narrow room", "helpfulness": 2, "user": "paul-joyce", "date": "July 18, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 8183314, "likes": {"liked": "— location", "disliked": "— walls needed a redo"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "There is a lot to do in Luzern and the surrounding area. We recommend taking any of the boats. There are cruises ranging from 1 hour to 6 hours. We visited Fortress Furigen, an extraordinary WWII bunker that is now open to the public. This museum is great for people of all ages, including kids. From Luzern, take the boat or train to Staanstad. From the dock or train station, it is about a 20-25 minute walk. The tourist information office at the Luzern train station will have more details on hours of operation, etc.", "title": "Nice room, curt staff", "helpfulness": 2, "user": "Stella", "date": "July 18, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 8182288, "likes": {"liked": "— View", "disliked": "— Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Overall, our stay at the Hotel des Alpes was a good one and we would recommend it.", "title": "Location, location", "helpfulness": 1, "user": "sasanqua", "date": "July 15, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 2.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 8120427, "likes": {"liked": "— location", "disliked": "— The fiery beast at reception"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "This Hotel had some tremendous positives, but also some real negatives. The positives - it was very easily walkable from the train station and the view from our room/porch was terrific. We arrived in the rain, but easily knew where the hotel was because of the location shown on the internet (by the old bridge and water tower). Surprisingly, we met a couple at our last hotel who had stayed here and they told us to enter from the back of the hotel, on the street - and not along the waterway. This was a good help because there were many stairs from the waterway entrance. Our room was somewhat wanting in terms of needing paint and cleaning of the walls - it was also really narrow and the floors uneven (but, you cannot complain about that in a 300 year old hotel - can you?). The bathrooms were very new and immaculate and the mattresses/linens were also new. We have stayed in other old hotels, but the walls needing painting were my biggest complaint - it was dirty. The breakfast was nice - ham, hard boiled pink eggs (that was cute), fruit, bread, coffee - and they had an outside porch - lovely. I would be honest and say that our second day - where we had good weather, made this hotel more appealing. There was another nice looking hotel down the street - hotel des balances...we do not know the price, but I would have checked this out. There was a very perky front desk lady who we loved - she told us where to walk!", "title": "Superb Location, Decent Rooms", "helpfulness": 1, "user": "Prateek R", "date": "July 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8059723}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Before my trip to Switzerland, I read the reviews of this hotel and there were complaints about the entry key system and security concerns. I even hesitated booking this hotel because of this, but found out the information posted about this was not at all accurate. It's a self-serve and system, there's a board by the reception desk that looks like a metal electronic board, in which you insert the room key when leaving the hotel and then remove a smaller key you carry with you which is also the key for the entry door after hours. The key that remains on the board while you're out is self locked, and the only way to remove it is by inserting the other key you have in your hands while you're out and vice-versa. So that's to say the system is very secure and safe, leaving keys at the desk is used widely in Switzerland, so no worry there.", "title": "Loved it!", "helpfulness": 5, "user": "sagelilac", "date": "August 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8362996, "likes": {"liked": "— Location, location, location!", "disliked": "— The food served at breakfasts"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "Our stay in Lucerne was absolutely fabulous. The hotel situated directly on the lake is in a superb location, right across from the Chapel Bridge, walking distance from the train station and right at the begining of Old Town with fabulous restaurants and shops.", "title": "Excellant location", "helpfulness": 3, "user": "monicanaha", "date": "August 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 5.0}, "id": 8355914}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Our double room with a balcony was facing the Chapel Bridge and Mount Pilatus which we visited, it's worth getting a room with a view. Breakfast was ok, kind of limited, just enough to sustain you trough the morning.", "title": "Terrible service", "helpfulness": 3, "user": "Patches07", "date": "July 31, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8269027, "likes": {"liked": "— The room was spacious", "disliked": "— The front desk staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The noise complaints that were mentioned in previous posts just come with the territory with all the bars below the hotel that are along the lake, and Lucerne being the vibrant city that it is, hey. In all truth, our sleep wasn't disturbed by these noises and left our door to the balcony open.", "title": "Location, location, location", "helpfulness": 6, "user": "vegiegirl_7", "date": "July 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8256086, "likes": {"liked": "— Location, views"}}, {"rating": 4.0, "title": "good location, clean, nice hotel, staff was OK", "text": "I suggest if you're going to be in Lucerne, this is the area to be in.", "helpfulness": 1, "user": "chiquita177", "date": "July 23, 2007", "id": 8221560}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 3, "variance": {"poor": 30, "average": 57, "very good": 177, "terrible": 11, "excellent": 106}, "aka": "Des Alpes Hotel", "slim_ranking": 0.360655737705, "detail_rating": {"service": 3.5, "cleanliness": 4.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 5.0}}