{"user_rating": 3.5, "review_count": 682, "name": "Hotel Fusion", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I stayed in hotel fusion for 8 nuits. While my twin room (single bed) was really small, once unpacked, it had everything one may want: very clean, practical bathroom (shower), flat screen tv with dvd player, mini-bar, assortment of snacks and sufficient storage. On the down side, my bedroom window opened onto a wall, but it was ok since not spending too much time in the room anyhow. Location is perfect; as a few minutes from Union Square, shops and restaurants; Bart and tram lines. 10 min tram from Pier 39. Breakfast was ok but unoriginal (bread, coffee, muffin) but there's a great dinner around the corner. The concierge was very helpful in organising bus tours and arranging pick up as well as an airport shuttle service ($15), much cheaper than a taxi. Overall i would recommend the hotel.", "title": "All you need...", "helpfulness": 2, "user": "Rainciel", "date": "July 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8207058, "likes": {"liked": "— location", "disliked": "— size of the room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "This has to be the best hotel in San Fran for its price. I booked this hotel for three friends and myself. Two of my friends decided to book another hotel because they didn't recognize the Fusion name (yes they are hotel snobs). After their first night at the other hotel, the next night they were staying at the Fusion and wished they had never changed. The staff here is incredible. The location is unbeatable (great shopping, restaurants and the best of public transportation practically outside of the door). The price was very sensible. The rooms were small but very clean and neat - almost like a European hotel room. I definitely recommend the Fusion and will be staying there in my future trips to San Fran.", "title": "ABsolutely Wonderful!", "user": "Artsylena", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8118540, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Great place to stay...good 7 day package under 700 for room on the street....a little noisy at night....you might want an inside room less noise and cost less...great location/shopping and etc...buy a 7 day pass for transportaion...you can go anywhere....we did I saw: Golden Gate Bridge, and Park...Persidio, North Beach, Fishermans Wharf, Haight Asbury, Saucilito, and just about every neighborhood in San Francisco. Being from Chicago and a little bias, I thought they should clean up the city. Too many homeless, too many beggars, too much trash. C'mon mayor clean up this place...do not go out at night alone....these homeless are not nice...one lady said she was going to cut me if I did not give her money...I told her to go away or I would kick her [--]....be careful they are Reagans street people and crazy. None like this in Chicago...clean and etc...", "title": "Great Deal", "user": "jimhp900", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8115944, "likes": {"liked": "— Location", "disliked": "— Homeless people around Hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "Hotel was really nice and clean. Staff was also friendly, especially one guy at the front desk. He told us all the cool spots in SF and helped us a lot. The hotel doesn't have a air-condition so the rooms are VERY hot. Location is near Tenderloin which is bad area but everything is fine as long as you don't walk right from the main doors. :)", "title": "Great hotel!", "user": "Nonma", "date": "July 8, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 8078397}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "My wife and I stayed in Hotel Fusion during summer from 3-June-2007 to 17-June-2007. Perfect 2-week stay. The room was always kept clean and tidy, the staff was always friendly and helpful, the shower was strong, no complains from us at all.", "title": "Miss San Francisco", "user": "ianoon", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8024712, "likes": {"liked": "— Location", "disliked": "— None"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife and I are in early 60s from Australia. Booked hotel in conjunction with Extranomical tours. The room was quiet (ask for internal facing) but rather small. Staff and housekeeping v friendly and accommodating. B'fast was help yourself to toast, danish and coffee etc. Fabulous location for touring city, just stones throw from cable car terminus and right in Union sq shopping precinct. Recommended.", "title": "Great hotel in centre of town", "user": "AntonOfOz", "date": "June 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 16889490, "likes": {"liked": "— location", "disliked": "— small room"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "What a little SF gem!", "title": "Great little hotel!", "helpfulness": 1, "user": "kstenger", "date": "June 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16784103, "likes": {"liked": "— Location, proximity to BART", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "I am a Trip Advisor fanatic, so when I was in the planning stages of a long weekend getaway in San Francisco to surprise my husband for his birthday, I spent weeks reading hotel reviews for the downtown SF area. My criteria: affordable and close to BART as we would be relying on public transportation to get around the city. I narrowed my search down to Hotel Fusion but was still a bit nervous about some of the negative reviews I had read on TA regarding thin walls, street noise, etc. and I am very sensitive to unwanted noise. We left the Hotel Fusion thrilled to death.", "title": "Great Hotel for the Price", "helpfulness": 1, "user": "jsguyrus", "date": "June 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16670758, "likes": {"liked": "— Price", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The location of the hotel is ideal. It is one block from the BART station which was unbelievably convenient. It's also very close to the Powell Street cable car station if you're into that. A hint: the lines for the cable cars at the Powell Street station are ridiculous. If you want to ride and don't want to wait, walk up Powell Street 5 or so blocks to the next cable car stop and there is no waiting.", "title": "Great location for short stay, a little bit on the noisy side...", "user": "IVegas", "date": "June 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 16631159, "likes": {"liked": "— location", "disliked": "— noise"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "When I contacted the hotel to book the room, I asked for a king room, and I'm pretty sure that all of these rooms are located on the top (5th) floor.", "title": "Thin walls but otherwise fine.", "user": "ValdPoe", "date": "May 27, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 2.0}, "id": 16435719, "likes": {"liked": "— Stairwells", "disliked": "— Thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "I booked a vacation trip to San Francisco in the middle of September, and I was desperate to find a nice place to rest while visiting. After reading horror stories of hotels in the vicinity, The Fusion stood out from the rest. Since my apartment was being sprayed for bedbugs, the last thing I wanted to see was \"anything\" crawling in my hotel room, other than myself. I was not disappointed.", "title": "The Fusion is the place to stay when in San Fran!", "helpfulness": 1, "user": "enavdv", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10037278}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Fusion was prompt and courteous during check-in, and I was in my room no more than 15 minutes after my arrival. The room I got had a twin bed in it, and was on the 2nd floor. The bed was clean, smelled good, and had clean sheets. That was my first concern. After sitting in the room for about 30-45 minutes, I didn't notice a single thing wrong with it at all, nor did I see anything else in the room with more than two legs.", "title": "Liked the Fusion", "helpfulness": 3, "user": "Bromsgrove", "date": "October 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 10025192}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "If you are staying for more than a couple of days, I would advise putting the \"Do Not Disturb\" sign on the door immediately upon entering the room, and keep it there until check-out, to avoid anything \"mysteriously coming up missing\" in your room. I am just paranoid like that, but believe me, it works!", "title": "We loved Hotel Fusion!", "helpfulness": 2, "user": "CurlyClare", "date": "September 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10015652, "likes": {"liked": "— the friendly staff, the room was top notch and the location was perfect", "disliked": "— Nothing"}}, {"rating": 2.0, "title": "Not a good experience", "text": "Check-out was just as prompt and courteous, but as a note to fellow travelers; please consider doing your own research on where to go and what to do ahead of time, to avoid being disappointed, or disturbing the nice employees at The Fusion. While i'm sure they'd be more than helpful, the internet is the most valuable resource for the out of town traveler. Do yourself a favor, and print up an agenda of where you're going, along with plenty of maps, and you will enjoy yourself 100 times more!!! I love The Fusion, and I will be coming back again.", "user": "nontroppo", "date": "September 27, 2007", "id": 10013098}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Derek Jordan", "title": "Reasonably priced hotel, could be great", "helpfulness": 5, "user": "nguoi_du_lich", "date": "September 13, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8706509, "likes": {"liked": "— Location", "disliked": "— noise at night"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Spent last 2 nights here on our San Francisco trip. My mom & I walked into this hotel to check availability because we could no longer extend our stay in Stratford Hotel. The rates we got for the junior suite is a bit high because there was a Pediatrics' Convention during that time.", "title": "great stay", "helpfulness": 7, "user": "3cia", "date": "January 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12804445, "likes": {"liked": "— location, modern decor of hotel", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "*The junior suite #514 has a desk, cd player, a sofa bed, bedroom, 2 lcd tvs, coffee making facilities, ref, iron & board. This hotel like many SanFran hotels, has no aircon facilities but they gladly provide a Honeywell fan & portable cool air machine upon request. I had to use the fan because my sofa bed area has no window. Room decor is modern which I like. But the bathroom looks pale to me. Maybe because of the lighting. I saw a king deluxe room on the same floor while it was being cleaned. It was huge. Maybe I will ask for that room when I travel with my husband next time. Our room overlooks a courtyard. My mom said she slept well because it is quiet compared to Stratford LOL", "title": "Great Stay at the Fusion", "helpfulness": 2, "user": "AussieGirl79", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12311771, "likes": {"liked": "— Clean rooms, friendly front desk staff, location", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel smells clean. The lobby is small but the decor is modern. Reminds me a bit of home. There is free coffee, tea & hot chocolate the whole day.", "title": "Excellent Hotel for the right traveller!", "helpfulness": 5, "user": "starrynite101", "date": "December 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 12065893, "likes": {"liked": "— It's perfect location and clean contemporary rooms", "disliked": "— the room was pretty small"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "*The breakfast room is on the same floor as we are (5/f). But it was just a small room(507) that you get everything you need - cereal, milk, 2 kinds of juice, regular & decaf coffee, 2 kinds of bread, butter & jams, muffins then eat it in your room. Breakfast is included in the room rate. Adequate enough to start your day. I get mine in my pajamas at 7am. My parents wake up later so I eat alone in the desk of the room. My mom prefers to have her breakfast in Chancellor Hotel because of the eggs benedict.", "title": "Great value Fusion", "helpfulness": 4, "user": "mojac", "date": "December 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11508165, "likes": {"liked": "— Very central location", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "*Staff is friendly & helpful. Celso gladly showed us the suite before we decided to take it. I forgot the other names of the other staff I dealt with during our stay. They are happy with giving me directions, always whipping out a SanFran city map. There was one morning I asked direction for Whole Foods Market store on 4th street and I said I will be taking taxi but the guy in front said it is just walking distance. He even went out of the door to point the street down after Stockton where I should head to.", "title": "Clean, stylish and in a great location, but a few problems", "helpfulness": 2, "user": "jessfm107", "date": "December 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 11486288}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled solo", "text": "I make numerous short trips to San Francisco each year, as it is one of my favorite places on earth, and on this occasion I was only coming for one night, specifically for a concert by the San Francisco Symphony. I wanted a place that was close to Symphony Hall, and was also easily accessed from both the Amtrak Emeryville station and SFO International airport; (this was because I had arrived on the Amtrak California Zephyr and was flying to London the next day, so my flexibility was a bit limited.) Checking on the Booking.com website, and then on TripAdvisor to verify its quality, I found this charming little boutique hotel, within two blocks of the Powell St. BART station and only slightly farther from the concert hall.", "title": "Small, reasonably-priced hotel in great location!", "helpfulness": 3, "user": "maestrolms", "date": "March 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 155371517}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The hotel was charming, with an Oriental motif, somewhat small but comfortable rooms, and a very friendly, helpful staff. A large breakfast buffet was included.in the price, which was extremely reasonable for a downtown SFO hotel. Parking would have cost me an extra $20 per night, but was not a concern on this trip. I will certainly return here on future trips, because of the excellent staff and convenient location!", "title": "Location and price", "helpfulness": 1, "user": "Josh S", "date": "March 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 155166658}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I don't think the location and price can't be beat. Those are usually two important things when considering where to stay at. It is right next to Union Square with shopping and places to eat. The customer service at the front desk was exceptional. The only negative was that the room next to us decided to shower at 2:30 am and woke me up instantly because the shower pipes were right behind the headboard of the bed.", "title": "Only consider if on budget", "helpfulness": 2, "user": "Jigsinsy", "date": "March 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 155007468}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "3 nights including taxes cost me $330, so if you've got $500 plus budget then I wouldn't read the rest of this review and get a better hotel. If you're on a budget then this is a decent place when you take price and location into account. You are 2 minutes away from Powell St BART which makes things very convenient. The room is tiny, but I knew that and you probably know that, so for $330 I thought the size was ok, the bathroom was probably better than I expected, although a couple of flaws, shower curtain for example, but for price, can't really complain. Big plus was a superb air conditioning unit as it got really hot in the room. WiFi free as well.", "title": "Great staff, small but comfortable rooms, and an accessible location", "helpfulness": 4, "user": "delightfulTravlin", "date": "March 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154892166}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The biggest negative was the club they have downstairs, we were on 2nd floor and stayed on a Friday and Sat and it was very loud, so a tip is to request say a 4th or 5th floor room.", "title": "Boutique Hotel!", "helpfulness": 2, "user": "HeidiPurvis", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154440650}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I went with my husband 4 nights to this hotel, and the location is perfect. In the heart of the center. It is very clean also. The only problem is that the rooms are very very small, and the air conditioner makes a loud noise that bother a lot.", "title": "Great Location, but small and noisy", "helpfulness": 1, "user": "Elvira R", "date": "January 8, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 149169122}, {"rating": 3.0, "title": "Mostly good, but weird breakfast experience", "text": "It is good if you are not going to spend a lot of time in the hotel.", "helpfulness": 1, "user": "PolarBear777", "date": "January 6, 2013", "id": 149015739}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "Nice boutique property close to Union Square, but rooms are tiny. Front desk staff were very friendly and helpful.", "title": "Great location and staff", "helpfulness": 1, "user": "ediSusan", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147818514}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Weird experience with breakfast, where the attendant tried to close it down early, then was claiming to multiple guests that the end time had passed. Very rude.", "title": "Great stay!", "helpfulness": 1, "user": "1Shish", "date": "December 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147690885}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I went to San Francisco for a concert at the Warfield. I chose Hotel Fusion because it was easy walking distance from BART and to the theater and had good reviews. The staff at the hotel was cheerful and helpful, even calling my room after check in to make sure all was OK. The room was small but perfect for me as a solo traveler and the price was great for the area ($88 including all taxes). I was most impressed with the security, as a single female. At night I had to show my key card to get into the hotel and then the key card was required to operate the elevator. I would definitely return, especially if the price was that right again. My only complaint - the bed is on a platform with sharp corners which I banged into more than once and have the shin bruises to prove it.", "title": "Great stay at Hotel Fusion", "user": "Sara S", "date": "December 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147467435}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Room: stayed in a King bedroom. It was just the right size and the bed was the most comfortable I've every slept on. The bathroom is a bit small and the sink has no vanity so you got to get creative with spreading out your stuff. The shower is a glass stand in shower that is cool BUT it leaks through the door crack so be prepared to mop that up so you don't slip. There is no air-conditioning which is usually fine for SF but there was a fairly warm day and our room got a bit hot. They do put a fan in the room and we cracked a window at night to keep the air circulating. There is some street noise coming from the hotel but the fan can drown out the sound.", "title": "Great location and incredible SF price!", "helpfulness": 3, "user": "kentuckygirl77", "date": "September 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8682268, "likes": {"liked": "— Location", "disliked": "— Bathroom needs a vanity, needs air conditioning for peak summer sun hours."}}, {"rating": 4.0, "title": "Excellent!", "text": "The location is awesome. Just blocks from Chinatown and Union Square which has the best shopping next to NYC Park Ave. in my opinion.", "helpfulness": 2, "user": "PedroNeves", "date": "September 5, 2007", "id": 8658674}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We rented a car and it is a whopping $25/day to have your car parked. There is very little street parking. We needed the car to travel to wedding events and wine country but one does not need a car to enjoy SF.", "title": "Excellent location, excellent price", "helpfulness": 8, "user": "canuckshot", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8396308, "likes": {"liked": "— great value", "disliked": "— nothin'"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "It is across the street from a great Sushi restaurant that is open until Midnight so go! It was yummy!", "title": "You won't regret trying this hotel", "helpfulness": 2, "user": "travelsmuch", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8380066, "likes": {"liked": "— location and price", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Great Deal!Nice room, but a little bit hot!Staf very nice!Right in the center of SF!", "title": "cramped with good location", "helpfulness": 3, "user": "sixelagogo", "date": "July 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 8260625, "likes": {"liked": "— location", "disliked": "— space"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "This was one time I had to think twice about the experiences that prompt my rating.", "title": "Satisfied...Yeah, Satisfied", "helpfulness": 1, "user": "Dean B", "date": "March 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 153997967}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Room is very clean, but VERY small, especially for two people. The tight quarters were the cause of a trip and fall accident that resulted in multiple lacerations, lots of blood, and a dislocated shoulder. It didn't end my trip, but for the rest of the trip I had to wear bandages on my forehead and nose, couldn't lift my left arm, and had two black eyes. Perfect accessories for a wedding. Don't get me wrong, I'm not blaming the hotel; just saying the tiny room created conditions that resulted in an accident.", "title": "Great location from Union Square and Bart", "helpfulness": 3, "user": "sdotkdotc", "date": "March 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 153427757}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Wifi was good, and there was an ethernet jack. Power was a problem, though - the only outlet that didn't require me to move furnuture was on the other side of the room.", "title": "A Triple Threat -- Excellent Price, Location, and Staff!", "helpfulness": 1, "user": "TurboKickChick", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153329358}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "There were a few annoying things the hotel WAS responsible for - LOUD construction that went on until after six in the evening; nobody knocks on the door to get your attention - they scratch at the door (or something similar that makes almost no noise). The maintenance director the first night, and twice the maid walked in on us because we didn't hear the scratching. The room they serve the Continental breakfast in was too small too. The bagels and pastry were good, but six or eight people at once trying to get food is an accident waiting to happen.", "title": "Great location, friendly staff", "user": "Katho-13", "date": "February 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 153179326}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The hotel a great location, and is walking distance from Chinatown and other attractions. Just don't fail to consider the steep streets when planning to walk.", "title": "Ok but a touch pricey", "helpfulness": 1, "user": "josh-aus", "date": "February 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 152021877}, {"rating": 4.0, "title": "Excellent location, but bring ear plugs!", "text": "My husband and I booked a Queen room with a baby bed for a 1 week stay. Upon arrival - we were put in a teeny,tiny double room with absolutely no room for a baby bed. The front desk people were absolutely excellent in fixing this problem by upgrading us immediately to a king sized room (apparently the qn. rooms were overbooked). Unfortunately the hotel does not have cribs so we had our 22 month old sleeping with us for the entire week. (no explanation given as to why we were promised one when we booked!)", "user": "RobynVancouver_BC", "date": "March 30, 2008", "id": 14649639}, {"rating": 3.0, "title": "Location is great! Good for short stays...", "text": "The location is fantastic as all other reviewers have said. If you are in an outside room the noise can be a bit much (depending on your tolerance for street noises)... garbage trucks every night at 12:30, sirens ALL the time, car alarms etc...We seemed to get used to it by the 4th night and were able to sleep a bit better.", "user": "meli55a", "date": "March 19, 2008", "id": 14381342}, {"rating": 4.0, "title": "excellent location", "text": "Housekeeping is excellent, rooms were immaculate, and service was always friendly and helpful.", "user": "travel_man_hk", "date": "February 19, 2008", "id": 13670318}, {"rating": 3.0, "title": "Unsure about this one", "text": "Breakfast is nothing to get excited about - handy to have something in your stomach before leaving for the day... can't say much more than that!", "user": "tvluk", "date": "February 2, 2008", "id": 13208613}, {"rating": 4.0, "title": "Great location, small rooms", "text": "Overall, I would recommend this hotel for the price and location. I would stay here again as long as I had a room that faced the inside of the building.", "user": "Leeshy19", "date": "January 29, 2008", "id": 13100453}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I was not 100% sure of wether to book this hotel, but as I was on a budget and needed something central in SF I decided to give it a try... location is excellent.. minutes from Union Square, the tram/muni etc rooms are small and soo noisy. I could literally be woken in the morning by next doors alarm going off!!! It was really warm (very noisy aircon) and impossible to open the window as noisy at night. Bedside lamp NOT WORKING and after 3 days, TV was NOT WORKING too.", "title": "great location... thats all!", "user": "scarlettBirmingham", "date": "May 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 15717265}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "The blonde receptionist when checking in was very chatty and warm but only there that 1 day.", "title": "ideal location", "helpfulness": 2, "user": "jamiescooter", "date": "May 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15533218, "likes": {"liked": "— location"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "if budget is a priority this is ok- i would rather save some extra ££ and enjoy my hotel/room a bit more next time. I felt lucky I was out most of day.", "title": "Great location but noisy.", "helpfulness": 1, "user": "traveller33Ireland", "date": "April 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 15163649}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "You can't beat the location of this hotel-2 mins walk from Powell BART station(30 mins direct link from airport)and 2 mins walk from Union Square with every major dept. store-Macy's, Saks, etc-loads of top end shops and a great place to sit and get some free WiFi! You also catch the cable cars up Nob Hill/Russian Hill etc from Powell St and there are loads of places to grab great food nearby. The hotel itself was very clean and my room on 5th floor had no problem with noise from outside or neighbouring rooms-there is no restaurant but they provide toast/croissants etc and coffee/tea/fruit juice self service for free from a room also on 5th floor-pretty handy to take back to your room-especially for single travellers-there is also free use of computers/internet(small charge for printing)on 3rd floor. Room itself very clean-shower was good-LCD tv with DVD player-room pretty small but how much space do you really need!? Only small issue was no air-con-didn't bother me particularly I just left window open constantly and the fan on. San Francisco is great city-loads of brilliant and different ares to see-this hotel provides ideal base to explore all of it by walking or public transport and I paid £35 a night through Expedia-really can't be beaten", "title": "Better than expected!", "helpfulness": 2, "user": "knkuk", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15148147}, {"rating": 5.0, "title": "Hotel Fusion is the place", "text": "My wife and I stayed at the Hotel Fusion 6-22 to 6-25. Expedia had a rating for Fusion of 2 stars. Something is terribly wrong witht the rating format. Fusion staff were very nice and helpful. The cleaning staff were on their job also. The rooms were very clean and nicely furnished and set-up in a contemporary style. The rooms are a bit small but fine for two people. I loved that the window faced Ellis Street and you could here the mood of the city. One of the best things about Fusion was I was one block frm the BART system which can get me anywere around the Bay area, one block from the Trollies, and a couple of blocks from the \"F\" bus line which takes you from the Whorf to downtown and visa versa. Just two blocks away is Weisfield shopping center, you can imagine whats in there! Shuttle service was a breeze to and from the SF airport. The Concierge was incredibly helpful and very knowledgeable. If you plan to visit SF \"I HIGHLY RECOMMEND THE HOTEL FUSION.\" The price is right and you will be happy you did. Feel free to email me for any questions at lincoln44@cox.net.", "user": "Arizona44", "date": "June 26, 2007", "id": 7999384}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Tony R-Phoenix, Arizona", "title": "Great Location, Great Hotel", "user": "kamorgans", "date": "June 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7937457, "likes": {"liked": "— Staff, location, price", "disliked": "— Room had a terrible view"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We stayed at the Hotel Fusion just a few weeks ago and I couldn't recommend it enough. The rooms are on the small side but perfect for couples-- who wants to stay in the room when you're in San Francisco, anyway? It is one block to the cable car turnaround, two blocks to the BART station, and within walking distance of at least a dozen bus stops. It was in a safe location and there is someone on duty 24/7. The front desk staff is super friendly and helpful, especially Mindy. When we wanted a late night meal one night, she immediately got on the phone and called several restaurants for us to make sure their kitchens were still open. The breakfast is quite good, although not hearty (muffins, toast, juice, etc.) There's free internet access in their business center. Basically this hotel gives you everything you need, and nothing you don't.", "title": "The Fusion was a great choice", "user": "sfsmoncton", "date": "June 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7851983}, {"rating": 4.0, "title": "Location, Location, Location", "text": "Stayed at the Fusion from June 9-12. Loved the hotel and the location. Rooms are on the small side, but there are larger ones. The most quiet ones are the ones facing the inside court. The \"continental\" breakfast is minimal, but that is to be expected with the price you pay. Hotel staff is polite and informative. Would not hesitate to stay there again or to recommend it. The best feature? Its location, one block away from Union Square.", "helpfulness": 1, "user": "flaguy", "date": "June 14, 2007", "id": 7849345}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "I got an excellent deal at the Hotel Fusion and spent a week there. They will match any rate you find online so do the research before you call to make reservations. I got a queen bed room for less than $70 per night based on their stay seven days and pay for five promotion.", "title": "Great Hotel, Grast Price", "helpfulness": 3, "user": "Stellaonholiday", "date": "May 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7644958, "likes": {"liked": "— Location & price"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My husband and I stayed at Fusion for 2 nights and loved the location! the staff was very friendly and helpful. since the hotel is located in a busy shopping district, it is advisable to ask for a room that doesn't face the road.", "title": "Excellent location!", "user": "BASK36", "date": "June 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 17286328, "likes": {"liked": "— Location Location Location!", "disliked": "— Breakfast Room"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Stayed here for one night during busy convention event - at $270 a night it was a very poor value for a tiny room with windows sealed shut, clumsy window unit AC for ventilation, no work desk, basic bed and a view of an air shaft. No menus available for places that deliver, no restaurant on site.", "title": "Lilleputian Rooms, basic budget lodging - room 512", "helpfulness": 2, "user": "highlandbride", "date": "February 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 151709771}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Building must have been a YMCA, SRO hotel or a medical faciilty - hallways are wide with lots of glass partitions tht give it a very institutional and cold feel.", "title": "Will definitely be staying here again when I return", "user": "Dean R", "date": "February 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 151660873}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Pluses: refrigerator, partially empty, and downright reasonable snack basket/mini bar prices. Basic starches and free coffee in lounge on 5th floor for breakfast, and staff was very helpful/friendly.", "title": "Excellent value for money", "helpfulness": 1, "user": "LynnWB", "date": "February 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 151242378}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Odd: this is the second SF hotel I have stayed in where staff express concern that I mght have trouble finding a taxi in a city filled with them. Beware racket of door men who claim there are no taxis and then try to convince you need to take a reserved town car that comes with kick backs to the staff.", "title": "Affordable hotel in great location", "helpfulness": 5, "user": "Diane102_12", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150520711}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The hotel is very conveniently located in downtown San Francisco, with shopping incredibly close by, the BART only a few blocks away and Union Square only a few moments walk away. Staff were very friendly, helpful and the rooms were cleaned and in great shape upon our return every evening. Very affordable and appealing to all types of travellers.", "title": "Amazing location and worth the money", "helpfulness": 2, "user": "Nattanuch", "date": "January 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 149741128}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Would recommend this hotel to the budget conscious traveller, who isn’t after anything flashy", "title": "Great place to stay!!", "helpfulness": 2, "user": "Jmay", "date": "January 22, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 3.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12878461, "likes": {"liked": "— Reasonably priced, central location", "disliked": "— Rooms not massive"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008", "text": "The price, decor, location and staff were all excellent! A jewel of a place to stay in the centre of downtown.", "title": "Excellent Hotel - central!", "user": "smokeyrasher", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18337822}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "My friend and I stayed in Hotel Fusion for 9 nights. We didn't expect much only because of the money we had paid. That's why we were really surprised when we arrived to very nice, stylish and clean hotel. Our room was lovely, very clean Japanese-style decorated double room with two beds, flat-screen tv, minibar etc.", "title": "Hotel Fusion, great place to stay", "user": "KittenFin", "date": "July 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18123242, "likes": {"liked": "— Friendly staff, cleanliness of hotel room, location.", "disliked": "— I don't know. I liked everything."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Hotel staff was extremely friendly, polite and helpful. Housekeeping everyday and change of towels and sheets as often as you like.", "title": "Great hotel and location", "user": "Ed_Papazian", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17845594, "likes": {"liked": "— Great locations", "disliked": "— Beggars on the street"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The location of the hotel couldn't be any better. It's in the middle of San Francisco city centre. Loads of shops, department stores, restaurants, coffee houses, bars are right there when you walk out the hotel door.", "title": "Nice hotel and staff, but ear plugs are advised", "user": "smurfy22", "date": "June 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17310871, "likes": {"liked": "— Location", "disliked": "— Outside noise"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "But even if there's a lot of happening in the city all the time during nights too, we slept very well without hearing any noise from the streets.", "title": "Good Hotel, GREAT Location", "helpfulness": 1, "user": "Phil1978", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 17291903}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 3, "variance": {"poor": 55, "average": 158, "very good": 300, "terrible": 31, "excellent": 138}, "aka": "Fusion San Francisco", "slim_ranking": 0.489361702128, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "An elegant fusion of old-world Asian and contemporary American styles, Hotel Fusion is an oasis in the heart of Union Square. Guest rooms are appointed with all brand new furnishings, rich wood accents and feature warm inviting colors. Located steps from major business centers and popular attractions, Hotel Fusion is the perfect choice for leisure and business travelers. Like San Francisco, Hotel Fusion is an ideal blend of culture, class and unparalleled personal service."}