{"user_rating": 4.5, "review_count": 259, "name": "Hotel Spitzweg", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Firstly let me say we enjoyed our one night's stay here. We loved the quirkyness of the place especially the enormous bathroom. Bed was comfortable and we slept well. Location close to the main square is ideal for a visit to Rothenburg. Private car park in back means you can just park on arrival and forget about it until departure.My criticisms would be", "title": "Idiosyncratic but don't let that put you off!", "helpfulness": 1, "user": "disleksik", "date": "July 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72685889}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "1) We arrived mid afternoon but couldn't get in! Place all locked up. After a phone call someone arrived to let us in so it might be wise to phone ahead.", "title": "Delightful", "user": "hartzog", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70554384}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "2) Breakfast, whilst very substantial and of a high quality, was incredibly slow in arriving. I think all we guests arrived in the dining room at about the same time and they just didn't seem able to cope. Couple who sat down just after us were still waiting for their boiled eggs when we left!!", "title": "great place!", "user": "sondralucas", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69810783}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Despite the above, we liked the hotel and would return.", "title": "Wonderful hotel!", "user": "cgl5642", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69769360}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Spent two nights here. Herr Hocher treated us like family. He was very friendly and informative. The room was very nicely furnished, with all 3 beds being comfortable. Breakfast included a wonderful fruit plate. Parking is convenient right behind the hotel. The rooms can be a bit noisy from both inside and outside but it did not detract from the stay.", "title": "Perfect location with excellant service and will return next visit.", "user": "Al_High", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 69726678}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "It was really something to stay in a building that was built in the 1500's! It was very well kept and inviting. Breakfast was unforgettable! Hotel Spitzweg was in a great location for seeing the medieval town.", "title": "Great Experience", "user": "RootsOhioTravelWorld", "date": "June 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68294499}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "p.s. Be sure to call if you'll arrive after 6:00!", "title": "Loved it!", "user": "ccarstens", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65433504}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We had 3 rooms in Hotel Spitzweg for almost a week and loved it. The city of Rothenburg ob der Tauber is fantastic...we all said it was out of a movie set. The location was perfect, the rooms were great, the bathrooms were newly remodeled and the breakfast was delicious. As others have commented, the owner is very charming and helpful. Also mentioned in previous posts, they do not have internet access, laundry facilities or an elevator. We would stay here again and recommend it highly.", "title": "Unforgettable", "user": "WorldFeet", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 64384909}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We've rent a car in Fussen and drove in the Romantic Road to this special town. We've spent the most special night of our travel in Rothenburg ob der Tauber. We loved the Medieval atmosphere of this cozy and charming hotel and its owner. We had a great chat with him during a delicious breakfast (best cheese bread!) and he gave us a book of bavarian recipes. I highly recommend this place for the couples!", "title": "Great value and great location for the inner city!", "helpfulness": 1, "user": "kirbchr", "date": "May 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64221716}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We selected this hotel out of a guidebook and booked at Booking.com. We emailed prior to our arrival to confirm the reservation and had no problems. We wanted to stay inside the walled city to get the feel and were not disappointed. This hotel dates back to the 16th century, so you get the look of an old hotel but with the modern amenities.", "title": "Cozy hotel with character and super friendly owner", "user": "siliwishes", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63868240}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The whole family loved this hotel. The hotel is beautiful and full of character. Our room was spacious (a family suite with 2 bedrooms). The hotel owner is a wonderful host and entertained us over breakfast (which was fantastic!). I highly recommend a stop in Rothenburg if you are doing a German holiday and staying at the Hotel Spitzweg!", "title": "Best hotel experience on our European Holiday", "helpfulness": 1, "user": "Australia555", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59541312}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I stayed there about 2 years ago, and for me it was one of my best experience in a hotel, not because it is a luxury hotel, because it isn't, but because its charming,romantic, unique and it has a wonderful owner staff that helps you anything you need. i loved too the historic building, and what about the breakfast? Just Delicious!! But pay attention, it's a historic building with no lift, so be prepared to climb stairs if your room is not on the ground floor. For me it wasn't a problem because i was envolved by the atmosphere of the hotel that transport you to some centuries ago.", "title": "Charming hotel in a romantic City", "helpfulness": 1, "user": "WORLDSCITIZEN68", "date": "March 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 58586928}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We chose Hotel Spitzweg because of great reviews and were not disappointed. We received a very warm welcome and although we arrived early - about 10am - our room was ready. This was great as we had just flown from Singapore to Frankfurt and then travelled by three separate trains to get to Rothenburg. Our room was large, cosy and comfortable and furnished with lovely folk-art furniture. The bathroom was very large. There was a bath with a hand-shower and so we could stand and have a wash if we preferred. It was only about a 10 min walk from the train station (with luggage). It is located within the Alstadt which is just like it has stepped out of a fairy tale. It is exceedingly beautiful and although caters to tourists does not feel touristy. The market square is only a 5-10 min walk from the hotel. Our tariff included an amazingly huge and hearty breakfast served usually with a chat with Herr Hocher. He is a wonderful host and can suggest great restaurants for dinner. What more can I say - it was great. Also, our son had a real bed and not a roll-away.", "title": "Wouldn't stay anywhere else", "helpfulness": 1, "user": "LAR60", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54875236}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "My two brothers and I stayed here for one night, actually our first night in Germany after flying into Frankfurt. We drove in, and had a little trouble finding the place only because we couldn't read the map of rothenburg. It's smack dab in the middle of the old city, and that part of the reason we had a hard time.", "title": "My Dad and 3 Brothers had a perfect stay here", "helpfulness": 3, "user": "Strigs8", "date": "January 31, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54815082}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We had the family suite, which easily accomodated the 4 of us, and we didn't even use the pull out couch, so one more could have been feasible. Check in was a snap and much to our pleasant surprise, we were told the night watchman tour does run in the winter, but only on Saturdays. We lucked out and hit that as well--well worth it by the way.", "title": "In a town full of character - this hotel has character as well", "helpfulness": 2, "user": "RomanNole", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51635451}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My husband and I recently stayed at Hotel Spitzweg with some friends during a tour of southern Germany's Christmas markets. We only had one night at this lovely hotel, but wish we could have had more. The host is a lovely gentleman who is helpful and friendly. The character of the hotel is warm and authentically Rothenburg (500+ years old). The breakfast was tasteful and one of my favorite on our trip. The parking area out back was extremely helpful. I really recommend staying here, and for more than one night. See Rothenburg and then drive down to Dinklesbuhl the second day (about a half an hour out of town). You will be enchanted with both medieval cities!", "title": "Don't Look Any Further", "helpfulness": 1, "user": "PRRecBooks", "date": "December 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51230106}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "I discovered Hotel Spitzweg on Tripadvisor & the positive reviews did not lead me astray! We had a triple room and it was one of the cutest rooms I’ve ever stayed in. We arrived fairly early (we walked from the train station – 15 minutes & just follow the signs to the city center) and even though there was a bit of a communication mishap between me & the owner regarding the time we’d arrive, our room was still ready for early check-in (and the owner personally showed us to our room – he was so nice!). There were maps at the hotel and the owner showed us places of interest when we checked in so we’d be set for the day. While I am sure they are around in the building, the front desk is often not manned, but you are given a key so you can come and go as you please so it was never an issue. The room was very comfortable with plenty of room for 3 (and unlike other hotels we stayed out the 3rd bed was actually a bed and not a rollaway or a converted couch). The bathroom is spacious, but it did take us a few minutes to figure out how to use the shower (pull up on the lever & then turn the shower on). When we checked in the owner inquired about our departure time and he was kind enough to start breakfast early for us. Breakfast was great - the owner personally made up a meat & cheese platter for us (so huge for 3 people), there were fresh rolls, the usual drinks, and my favorite part – fresh fried eggs that were utterly delicious! The owner also likes to chat with you in the morning and you always feel very welcome in his hotel (he also made sure we took some fresh fruit with us to eat on the train). The hotel is in a great location (although I’m not sure if there is a bad location as long as you are within the walls since everything is in walking distance) with parking behind the building, the medieval wall is nearby, the city center is just a small walk away, and there is even a post office right around the corner so you can mail everyone postcards of the town! While we were able to see everything we wanted (and do plenty of shopping) in one day, the cute hotel (with great service) and lovely town made me want to stay even longer. Just check out my pictures & you’ll see why I wanted to stay!", "title": "A wonderful & picturesque hotel to match the enchanting town!", "helpfulness": 4, "user": "hmparrish", "date": "November 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49907734}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We chose this hotel based on a Rick Steves recommendation. Upon our arrival, the innkeeper was extremely kind and informative. We absolutely LOVED our rooms. We had plenty of room, and even had a small table with four chairs where we could enjoy a cold beer while we rested our feet. There was no elevator, but we only had to go up one flight of stairs. Each morning we were provided with a hearty breakfast and got the chance to chat with the innkeeper in the charming dining room. The hotel was in a perfect location on a quiet street, had parking in the back, and an Internet Cafe a street over. Quite a hidden gem.", "title": "Wonderful, charming hotel", "helpfulness": 3, "user": "uclabruin75", "date": "November 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 49081849}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We planned to stay only one night in Rothenburg on our German driving holiday, but we so enjoyed Hotel Spitzweg that we added a night. While there is probably no bad location within the town walls of Rothenburg, we especially liked this hotels location. The owner is a wonderfully kind and courteous gentleman that sits with the guests each morning at their wonderful included breakfast. The hotel is housed in a building that is many hundreds of years old and your mind wanders with all the history that must have taken place in within the walls. An added benefit is a locked courtyard behind the hotel for parking. We would strongly recommend the Night Watchman's Tour and visiting the City Hall dungeons as well as the climb up the tower.", "title": "Terrific Hotel in Terrific Town", "helpfulness": 4, "user": "StanWashington", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47591971}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Lots of charm in this old hotel...would definitely recommend to anyone. Great location.", "title": "Charming", "user": "Q", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47196266}], "location": {"country": "Germany", "continent": "Europe"}, "variance": {"poor": 3, "average": 6, "very good": 46, "terrible": 2, "excellent": 202}, "slim_ranking": 0.0666666666667, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}