{"user_rating": 3.5, "review_count": 336, "name": "Hotel Tadoussac", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We just returned from a three day stay. Its the best place to stay for whale watching and, all in all, its older but not bad. I've stayed in Four Seasons and dumps, this place is a throwback to hotels in the US in the early sixties. Its clean, the food is OK and its well located with good views.", "title": "Not the Ritz but it Works", "helpfulness": 1, "user": "connorsdad", "date": "August 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 18683948, "likes": {"liked": "— proximity to boats", "disliked": "— older property"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "BIG WARNING- Otis Expeditions", "title": "Old lodge hotel needs a facelift.", "user": "inotrope", "date": "July 5, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 17568940, "likes": {"liked": "— Old, lodge-type style with excellent location", "disliked": "— Incompetent staff"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "While the hotel is ok, the Otis Zodiac expedition we went on was great. HOWEVER, we rescheduled two times because of very bad weather conditions. There was a bad storm and a marine advisory but the operator was still telling people it was OK to go whale watching. No other operator went out in the wind, rain and high seas. The zodiac trip was great on our last (sunny) day. So, if you think the weather is a bit rough use your judgment.", "title": "The Whale watching is super", "helpfulness": 1, "user": "Estatesnut", "date": "September 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 8755900, "likes": {"liked": "— The view of whales from the garden and the room if you get a bay view.", "disliked": "— the shower, temperature was not controllable"}}, {"rating": 4.0, "title": "Old Fashioned Charm", "text": "To their credit Otis allowed us to recschedule twice with no penalty due to the inclement weather.", "helpfulness": 1, "user": "TommyJo", "date": "August 27, 2007", "id": 8517240}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "Relatively well maintained old, wooden hotel of the national park lodge type with excellent view of Tadoussac harbor. Difficulties encountered included brusque receptionist who added $30/night to our internet rate for an uncomfortable cot which was already in the room; musty smell throughout the hotel; poorly maintained recreation room - billiards tables had ripped felt, cues were warped, bridge was broken...;no air-conditioning in the rooms; broken window counterweights - sticks were used to prop open windows; walls between guest rooms are paper thin - every activity of your neighbors could be distincly heard. The biggest complaint was with the whale-watch reservation desk which apparently has a contract with a mediocre company that provided poor naration. This desk allowed us to book a cruise for a foggy morning - we should have been advised to wait until the afternoon when visibility was much better- after all, its a whale-WATCHING experience. We later discovered from the company that we could have booked ourselves and saved 30-50%.", "title": "Overpriced, but the primo experience in Tadoussac", "helpfulness": 4, "user": "Gemma'smum", "date": "August 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 8448022, "likes": {"liked": "— The ease, the views, the whale watching", "disliked": "— cost, begging for tips at every turn, no drink service outside, tired rooms and no ventilation. Need fans!"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My wife and I stayed on the half board package for two nights in early July. The guide book implied that itis just about the only place to stay in Tadoussac, but in fact there are quite a few other options worth checking out before you book. The location is unquestionably great, with a view across the hotel lawn onto the bay. My first advice would be to avoid paying the extra for an ocean view room. The window on our room was so small that unless you walked right up to it you had no idea what the view was, so unless you intend to pull up a chair and sit in your room right next to the window, the \"ocean view\" won't do anything for you. The room was clean and well equipped, but small. It was probably the smallest room we stayed in during three months of travel in Canada. The breakfast and dinner buffets are expensive, but can't be faulted in terms of quantity, and the quality was certainly adequate. Staff at both desk and restaurant were good. The public areas are rather dated, and as the hotel had lots of groups coming and going, they were also noisy and manic. The whole of Tadoussac is set up for whale watching and cruises, so you can book anywhere and the shuttle buses run everywhere, so staying at the Hotel Tadoussac doesn't give you any particular advantage there.There is car parking and internet, although both the internet and TV were fairly poor quality. The hotel does have other dining options, but we didn't try them. So, overall nothing was a big problem, but it was one of the very few places on our Canada trip where I felt slightly ripped off when I checked out.", "title": "Great location, but expensive and showing its age", "user": "golsonic", "date": "July 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 71332624}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "While on an extended stay in Montreal, my husband & I decided to take an overnight side trip driving up the St. Lawrence River to see the sights. We had no definite destination in mind, but hoped to make it as far as Saguenay. After crossing the fjord on the ferry, we found ourselves in Tadoussac and decided to stay there for the night. Since we hadn't done any research on hotels/inns, we just drove around the city to see what was available. We happened upon the Hotel Tadoussac and are very happy that we did! The front desk staff offered us a room with a river view on the 2nd floor. The room was small by modern hotel standards but comfortable. We were able to look down on the lawn and out on the water from our 2 windows. The 2nd floor also has a large community balcony overlooking the lawn and river.", "title": "Charming hotel, beautiful view, friendly staff made our brief stay very enjoyable.", "user": "jadCenTX", "date": "May 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 65260908}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "As other reviewers have described, the hotel lobby certainly had the look and feel of a country inn or lodge. Many comfortable sitting areas were grouped throughout the room and there was even a large table with a jigsaw puzzle. The artwork displayed was in keeping with the local area and the photographs gave a history of the hotel.", "title": "Pretty nice", "helpfulness": 2, "user": "nazz65", "date": "September 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 42378545}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "After taking a stroll down the boardwalk we returned to the hotel to consult the front desk staff about the restaurant. Only 1 restaurant was open during our stay because it was still the hotel's off-season. We were offered a \"package\" that would include both dinner and breakfast, and which would be less expensive than paying the fixed rate for the evening's buffet. The food was very good and the wait staff was very attentive for both our dinner and breakfast.", "title": "Terrible Value for Money", "helpfulness": 4, "user": "seyenepo", "date": "September 9, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 40442354}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We were not able to take the whale-watching cruise on this trip because of our time limitations. We do hope to be able to return to the Hotel Tadoussac for a more extended stay.", "title": "Worse value for price ever experienced", "helpfulness": 1, "user": "Captain_H00K", "date": "August 17, 2009", "detail_rating": {"cleanliness": 3.0, "location": 5.0, "rooms": 1.0}, "id": 37903291}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I went there to stay one night after an online booking. This is a four star category hotel starting at C$204 per night plus applicable taxes, you will end up paying C$232.52 per night.", "title": "Fortunately they cancelled my reservation with no charge.", "user": "WandererBo", "date": "August 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 36909862}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I visited the room, it was dark, damp and too small with one queen-size bed. The bath room was also too small and cramped. Corridor taking us to the assigned room was dark, damp, long and narrow.", "title": "PRETENTIOUS TWO STAR HOTEL CHARGING FIVE STAR PRICES", "helpfulness": 2, "user": "BritishVoyager", "date": "July 31, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 36295935}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "I asked for an upgrade which would start at $240 a night (plus tax $277.67). It was as bad, only with “River View”.", "title": "Charming country inn & kayaking among the whales", "helpfulness": 1, "user": "BoppinRobin", "date": "July 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34935814}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I would strongly advise visitors against paying such a price for this hotel which has a very poor quality/price ration.", "title": "Total Dive", "helpfulness": 1, "user": "pinkladibug1", "date": "May 19, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 30301601}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Most disappointed from word go by untrained unhelpful unsmiling receptionist and tired disinterested valet who could not even help us unload bags from car.", "title": "Nice hotel, good food, but needs a little renovation", "helpfulness": 1, "user": "deeml", "date": "October 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20779125, "likes": {"liked": "— Location and view"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Expensive, tired decor, small rooms with tiny windows. We paid 160$/night for a very mediocre room. There was nothing wrong with it, in fact the service was quite good, it just wasn't worth the hefty price. The hotel itself has nice views over the St. Lawrence river with a nice main lobby and public open space. Don't stay here, just visit it. Otherwise the area is beautiful and it's definitely worth the trip up to Tadoussac!", "title": "Definitely not worth it", "user": "fortunecookies", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 76879631}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "You can't miss the hotel Tadoussac! Gracing the lawns above Tadoussac bay, the view from the hotel is superb. This hotel is very comfortable, decor is 'Victoriana'. We had a garden view room which was quiet although a little on the small side for a family with 2 small children. There wasn't much room to move once the sofa bed and crib were up.", "title": "Excellent location", "user": "Yankybrit", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 76468294}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The breakfast buffet has a wide selection and the restaurant staff are friendly and efficient. The reception staff are also extremely helpful. The hotel was very busy at our visit and the spa was very popular. If you wish to use this I'd advise to book ahead of time.", "title": "Hotel grounds are worth the stay", "user": "Adroit_44", "date": "August 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 76379904}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We ate two evening meals at the hotel's 'Beaupre' as there aren't many restaurants in town catering for children. Food was average. Some of the restaurants in town did look very nice for those travelling without children!", "title": "What a delight! Hotel Tadoussac far exceeded my expectations.", "helpfulness": 1, "user": "NCFamilyGuy", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 74882839}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel is closely associated with Dufor cruises. Personally I think AML cruises has the better boat for viewing with larger windows and more outside deck space. AML cruises also pick up from the hotel although the hotel keep this quiet! Whale watching was fantastic.", "title": "Great location. Friendly , helpful staff.", "user": "naturelovr", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 72309466}], "location": {"country": "Canada", "city": "Tadoussac"}, "stars": 3, "variance": {"poor": 24, "average": 89, "very good": 135, "terrible": 15, "excellent": 73}, "aka": "Hotel Tadoussac Quebec", "slim_ranking": 0.125}