{"user_rating": 4.0, "review_count": 182, "name": "Hotel Punta Del Este", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "I chose this hotel for it's low price and location, as a base and not to stay in the room. The most remarkable thing about this hotel is the incredibly good staff. Always nice, always helpful. Since I had a late departure, they let me use my room for several hours after checkout. The hotel is located close to restaurants and the shopping zone and is just a 10 minute walk to the beach. The rooms are very clean but small. They are okay for 1 person, tolerable for a couple, but rooms with 2 single beds are pretty tight. The room met all my basic requirements: aircon, electronic safe in the room, strong wifi signal. My bed was comfortable and the room had a closet with drawers. Complementary tea is offered in lobby all night. The big downside to this hotel is that walls are quite thin. You really hear everything - coughing, doors closing, toilets flushing - left, right, and above. But for that, the rooms would be very quiet. This is a small urban hotel in an area with little space between buildings, so rooms not facing the street have little or no view. Considering the price, staff, location, and amount of time I spend in a room, the walls and view weren't dealbreakers for me. They should put one computer for guest use in the lobby. There are a few other negatives, hopefully specific only to my room: fuzzy cable TV signal (they probably need to add a signal amplifier in the system) and my shower curtain was too long and needs trimming. I recommend this hotel if you want to be in the center, don't want too spend much, and are able to overlook the thin walls.", "title": "Mostly very good choice, but thin walls", "user": "Massimo1", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122135253}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We needed a place to stay in Mar del Plata and found the hotel online. Its just a short walk to the beach and close to other activities. The rooms are smaller than we are used to in North America but that was fine. Id recommend this hotel to my friends.", "title": "Muy Buien", "user": "ednib", "date": "January 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 93599371}], "location": {"country": "Argentina", "region": "Central Argentina", "continent": "South America"}, "stars": 3.5, "variance": {"poor": 6, "average": 21, "very good": 78, "terrible": 5, "excellent": 72}, "slim_ranking": 0.0204081632653}