{"user_rating": 4.0, "review_count": 33, "name": "Hotel Nutibara", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Great Hotel...very close to the center of town (Plaza Independencia), nice pool, good AC, staff very helpful, excellent breakfast. We had a room toward the back overlooking the pool and it was very quiet. There is an outstanding (better food than 1884, 2/3 the cost) restaurant 1/2 block away...Mi Terra.", "title": "a great small hotel, excellent value", "helpfulness": 1, "user": "Jim213Boston", "date": "February 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24354440}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We stayed at Nutibara in October 2006 for two nights before heading out of the city area. The hotel is centrally located by Plaza Independencia. The hotel staff was VERY nice. I left my phone and ipod in the room and they found it for me two days later! I really appreciated that. Internet access, good breakfast, pool, water pressure, and good 'concierge' type services. I would ask for a room away from the street, that helped. For the price, it was a very good option.", "title": "Nutibara is a cheap and cheerful hotel", "helpfulness": 2, "user": "Julie B", "date": "October 17, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5964988, "likes": {"liked": "— location and staff", "disliked": "— some street noise"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "I paid about 59€ per night at the Nutibara. There were a lot of similarly priced Mendoza hotels I checked on the web, but the Nutibara had the best overall satisfaction and combination of low prices, a great location in a quieter part of the center near the Plaza Independencia, a really good staff, and a nice big pool. Don't book a place in Mendoza in the summer without a pool. It is a hot desert city and there is no place else to swim. Hotels on the Las Heras / San Martin sides of the Plaza are in very busy areas. I was really pleased at how great the staff was. They were friendly, helpful, arranged some of my tours, knew where to find stuff in the city. The Nutibara isn't going to win any awards for luxury or design. It is older. My room was adequate and comfortable, but again, not expensive and it was kept really clean (as was the rest of the hotel). It had aircon and a ceiling fan, a closet with an electronic safe, strong wifi, and cable TV. The shower had plenty of hot water. The bed was pretty good. I didn't like the pillows. They were overstuffed, very hard, and really difficult to sleep on. The other difficiency in the room was the lack of available plug receptacles - becasue the place is old. The only free one for charging anything (phone, laptop, etc.) was in the bathroom. In the lobby, there are 4 computers for guests. Oddly, they use Linux, so it complicates getting certain kinds of work done and there is no Skype on them. Breakfast wasn't much. It was basic: coffee, breads, juice, some cereal, fruit salad and sometimes fruit. Not even boiled eggs. But there are plenty of cafes and restaurants around the area. The fitness room just has cardio equipment, but that's good to have. Mendoza is really nice little city and a pleasure to walk around. Don't worry about finding activities. There's lots to do in the area and plenty of tourist agencies to serve you.", "title": "Not luxury, but low prices, great location, staff, and pool.", "helpfulness": 3, "user": "Massimo1", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 121838712}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The Good: The rooms are clean, quiet, and comfortable. Nice ceiling fans, good hot water, and nicely tiled restrooms. The wi-fi is superfast! The breakfast is plentiful, with huge urns of coffee and milk, as well as cereal and pastries. The bar is well stocked, and the patio area is attractive and shady. The front desk staff is super, friendly, and multi-lingual.", "title": "Nice & Quiet - but there's two sides to the coin", "helpfulness": 2, "user": "StuartandDenese", "date": "November 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120994489}, {"rating": 4.0, "title": "not an obvious choice but a great one!", "text": "The 'Needs Improvement' -- the decor is very dated (late 1960s) with a woefully shabby pool table and gym. When we went to use the gym it was full of the poolside chair cushions...For the price - it needs to be a little better.", "helpfulness": 3, "user": "LeNico1121", "date": "January 9, 2010", "id": 53038744}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "We chose this hotel after walking around town and looking at a few. The price was right, the rooms looked clean and they had a big pool. Turned out to be even better than we thought. The people were SO nice and accommodating, they spoke English enough to get us what we wanted, made reservations for us wherever we needed and could advise us on everything. The rooms aren't super new/modern but very comfortable. The pool was GREAT as its so hot in Mendoza and most places either don't have a pool or they're tiny, but here you can totally lounge poolside. This place has clearly been around a long time and most of the other guests were Spanish speaking. Their included breakfast is basic Argentinian fare - croissants/bread, coffee/tea, also fruit, yogurt, ham/cheese and they'll make an espresso for you. Andrea and Viktor at the front desk were so nice and darling and really made us feel at home. The lobby is very spacious and they have all kinds of stuff like billiards & ping pong, which if you have kids I imagine is a good thing. Location is two blocks from the main Plaza Indpendencia which was great. Their logo is totally old school cool, too. They have wifi, tho it wasn't working the whole time we were there, and also computers to use for free.", "title": "Good value for the price", "user": "TorontoSAtraveller", "date": "September 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 43731404}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "I stayed at the Hotel Nutibara for 5 nights last week. The hotel is simple - but very clean. The rooms are not huge but comfortable and clean. The hotel is downtown Mendoza - very close to main attractions - except the Shopping Centre - but nothing seems to be close to that - about 5 or 6 US dollar cab fare. The staff at the hotel were very kind, very welcoming and very helpful and I traveled alone. The housekeeping and laundry service are both great and the breakfast is plentiful enough. The hotel has several tours available and I would suggest it to anyone. They only downfall - the gym - nothing appeared to work and was very dated but not many people I know go on vacation and exercise - I do. The internet is free in the lobby and the speed is pretty good. I like baths and my room had only a shower but I can't say for the entire hotel.", "title": "excellence in all respects", "helpfulness": 2, "user": "NetherlandsBacchus", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38160655}], "location": {"country": "Argentina", "region": "Cuyo", "continent": "South America"}, "stars": 3, "variance": {"poor": 2, "average": 2, "very good": 21, "terrible": 0, "excellent": 8}, "slim_ranking": 0.406593406593}