{"user_rating": 4.0, "review_count": 693, "name": "Hotel Albuquerque at Old Town", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "After several visits to Albuquerque, we finally stayed in Old Town and were pleasantly surprised by the convenience and comfort delivered by the Hotel Albuquerque. The temps outside were 100+ both days and there was a minor construction project underway in the courtyard but our room was huge and comfortable. We enjoyed the close proximity to the shops and restaurants in Old Town and the quick access to I-40 and the airport. A very pleasant stay and a very nice property we will return to on our next visit!", "title": "Hot Day-Nice Stay", "user": "GOmaha", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163881589}, {"rating": 2.0, "stay_parameters": "Stayed June 2013", "text": "First of all the nicest part of the hotel was the lobby, when I checked in surprise my room wasn't ready,I booked a mini suite and called 48 hours in advance to make sure I could check in early", "title": "Unimpressed", "user": "thebetterjeweler", "date": "June 10, 2013", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 163550587}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I wasn't told upon availability, I was told of course and there was also another unhappy guest who was told the same thing, I was told I could take a standard king instead lets see I had my 6 foot 16 year old son with me and my husband and myself,( I took a mini suite so I could get a rollaway bed) a rollaway bed wouldn't fit (comfortably in a king room) so it would mean three of us in a bed, so we had to wait for a room to be cleaned, which didnt take as long as I thought, the room is set up poorly if you are in bed you can't watch tv because the cabinet is set up at an awkward angle and if you are sitting in the living area you see the side of the tv cabinet not the tv, not that I'm here to watch tv, but the room isn't functional, the tv is one of those old 100 pound zenith clunkers, the bathroom is horribly designed there isn't an a/c vent in there so its always hot and stuffy in there", "title": "Large Room with a Great View and Close to Old Town", "user": "phil1985", "date": "May 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162568616}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "hard to do hair or makeup, there isn't any counter space, oh there is a 3 inch shelf directly above the camode,that really doesn't do it, the mattress had a \"sinkhole\" in the middle and the a/c was so loud it sounded like a 747 jet, it kept us all up, the staff was all very pleasant but most New Mexicans are (I'm a local) I have to mention I currently reside in Las Vegas and have pretty much stayed in every hotel on the strip both in regular and suite rooms its a hobby, its basically holiday in express quality,what I paid here I paid for suits at the Venetian and other nicer hotels, I was really unimpressed, I think it's over hyped and average, for the money it's not worth it,and if I could avoid the early checkout fee (one nights stay) I would leave now,an in room coffee maker, hair dryer and aveda soap shouldn't be selling points,I give it a FAIL.", "title": "Hotel Albuquerque at Old Town", "user": "GarykP", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 162231796}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed here recently for a work conference and was very impressed. The proximity to old town is the best part about it, just a short walk to the shops and park. The room I had was also quite large, with a balcony that had an excellent view of the property. There was some construction going on at the restaurant while I was there, but it caused very little disruption. It's also not terribly far from the downtown area, all in all a great place to stay in Albuquerque.", "title": "Many virtues except that the hotel feels tired and worn", "user": "ishkabibl", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162225887}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "You don't expect a hotel restaurant to be anything special - and you're usually right. However, we stayed at the Hotel Albuquerque on a Sunday night and had a really exceptional dinner at Garduño's Restaurant & Cantina. The blue corn enchiladas and the shrip taos were wonderful, the service was attentive and the house margaritas supurb! It was a great was to conclude a New Mexico vacation.", "title": "Great Restaurant", "user": "MichaelMQ", "date": "May 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 161498804}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "the rooms are fair size , the bathrooms are a little small and don't have much room to put your toiletries, the door to the cabinet holding tv would not open all the way so you needed to prop chair in front of it to keep it open to watch tv. beds where all right but nothing special. they had convention in, so elevators could be a little slow , the gift shop is very expensive but that's like most in hotels. we had appetizers in bar/ restaurant not that good , which is kind of surprising since most all the food we had in New Mexico was very good. one nice thing is it is close to old town.", "title": "old town", "user": "cooks1957", "date": "May 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 161454403}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Attended an all class high school reunion here so had a group rate, which was fairly reasonable in relation to other convention hotels. The rooms are a good size and the beds very comfortable. Each room has a small angled balcony that affords great views of the surrounding area if high enough. The bathroom is a bit small, but there is a nice dressing table area with a good makeup mirror and large mirrored door closet directly outside the bathroom. Unfortunately, the bathroom door opens right into the toilet. A pocket door would be better. Good lighting throughout the entire room. The decor throughout the hotel is Southwestern, which suits its Albuguergue location. The grounds are lovely, with many mature trees and interesting shrubbery. The pool is immense and there is a hot tub, firepit, large provided towels and many comfortable lounges and chairs around the pool. There is also an on grounds chapel with a little separate courtyard and a lovely fountain just outside it and the pool. The main lobby is beautifully quaint, with high beamed ceiling and shiny dark adobe style tile floors. The hotel would be a perfect wedding setting. The only negative was the service time in the cafe. The waitstaff, while trying to be accommodating, seemed overwhelmed at breakfast when they were busy. They were very disorganized, causing an extremely long wait before we received any menus or before they took our orders. Food arrived fairly promptly once we ordered, however. I think a dedicated host or hostess is needed in the cafe to help supervise the operation. Food for our group dinners was good and plentiful on all three nights of our reunion, especially on our last night there. It was a sit down banquet style affair with a very tender steak plus salmon topped with a spicy mango salsa. Steak was cooked perfectly, which is often not the case at convention hotels. All in all a very pleasant place to stay when visiting Albuquerque. A real plus for first time visitors is the hotel's proximity to Albuquerque's quite large and interesting \"Old Town,\" that has lots of nice shops and little restaurants.", "title": "Lovely facility close to Old Town", "user": "metalmomma", "date": "May 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 161163167}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "If you choose to stay here, do not stay in a room with connecting doors, as I was in room 817 that had a connecting door and could hear one of the next door guests clear his throat. Their normal noise level conversations awakened me very early every day.", "title": "Great location, aesthetic and price", "user": "milkshakerrr", "date": "May 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161119242}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stopped at Hotel Albuquerque driving to CO from AZ. It's located right off I-40, so it was REALLY easy to find. It's also really close to Old Town, so we had some fun sightseeing in the morning before we took off for Denver.", "title": "Old Town Albuquerque", "user": "lynwayget", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 160802360}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Just spent the past three days here at a conference. Lovely property for a conference. Nice ballroom for events. Food was EXCELLENT-something nit always connected with large number meals. Staff was friendly and helpful. Rooms comfortable and decorated in southwest motif giving you a true sense of place. Overall a wonderful property for a conference", "title": "Great Conference Destination Hotel", "user": "60933Jill", "date": "May 13, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 160600431}, {"rating": 3.0, "stay_parameters": "Stayed May 2013", "text": "We stayed on a week day and had heard about this hotel from a few friends. I read the review and many said it was a party hotel but when we were there we didn't experience any \" loud drunk people\" . The hotel is very nice but while we were there they were doing renovations and the restaurant was closed and construction work was going on. We had an executive suite so we had a balcony over looking the pool and construction. The room looks like they are re modeling them but not doing a vet good job. The bath tub was old and peeling and so was the paint on the wall. The carpet looked old and dirty and so did the furniture. The best part is the lobby and the pool plus the hot tub!", "title": "Still under renovation!", "user": "SmileyRoswellNM", "date": "May 11, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 160380372}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "This is a very large hotel with friendly staff, comfortable beds, nicely decorated rooms and in a good location. The room I stayed in (214) - a Traditional King - was very large and comfortable, bathroom was good - although it had a view of the carpark. Also there was no fridge, which I would've expected in such a large hotel. During my stay they were renovating the restaurant so there were limited dining options and no room service. But all in all it was a great place to stay.", "title": "Very nice rooms, good location", "helpfulness": 1, "user": "vandegrr", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160361946}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed for a recent conference, hadn't been there for several years. I like the southwest decor and Indian blanket design carpet, even in the guest rooms. It really suits the location. Great service throughout my two night stay, all employees were friendly and greeted me with a smile. Saw some construction in the courtyard; looks like they will be adding a new restaurant soon. I'll stay there again.", "title": "nicely updated hotel", "helpfulness": 1, "user": "LodgeAtSierraBlanca", "date": "May 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160166944}, {"rating": 5.0, "title": "great conference hotel with outstanding customer service", "text": "The Hotel ABQ hosted the New Mexico Governors Conference on Tourism this year and I found it to be one of the best conference sites that I've experienced in New Mexico. The staff is very friendly and helpful, rooms are very clean & comfortable, and the hotel is in a great location in Old Town Albuquerque. When I travel to ABQ on future business trips this will definitely be my hotel of choice!", "helpfulness": 1, "user": "Ruidoso1", "date": "May 7, 2013", "id": 159999568}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I thought I would be a lot more impressed, but I found myself rather underwhelmed throughout the stay.", "title": "Thin Walls, Loud Crowds, and That's All She Wrote", "user": "Patrick F", "date": "May 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162214972}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I grew up in Albuquerque, and it felt weird returning to the place I called home till I was 18 and staying in a hotel. So I reasoned, if it had to be that way, I'd at least stay at a hotel I always wanted to stay at.", "title": "Best housekeeping staff", "user": "All_Around_Mota", "date": "May 28, 2013", "detail_rating": {"service": 5.0}, "id": 162130719}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We arrive Friday night to what looks like a wannabe Vegas. People in club clothes everywhere you look. When we check in, we come to find out that somehow, Hotel Albuquerque is now part of the club scene in Albuquerque. As a result, everywhere you went, there were loud and drunk people. Whatevs.", "title": "Great Hotel Near Old Town Albuquerque", "user": "Micky R", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161858706}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "The other big downside was the service around the hotel. The woman at check in was nice, despite the fact they didn't have the room we requested. We arrived later in the evening, that I get, but we'd had the reservation for months- it was just a little surprising. Each day we were there, it was a struggle to get our room cleaned. Each day, by 3:30 pm, no one had arrived. On the second day, when they showed up, we told them we'd be heading out again and decided to play it safe and ask the front desk to get the room cleaned.", "title": "Perfect first night in NM!", "user": "LillyFred", "date": "May 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 161778364}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "So here's how I'd break it down:", "title": "Friendly staff and excellent accommodations", "user": "MichiganTodd", "date": "May 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 161634826}], "location": {"country": "United States", "city": "Albuquerque"}, "stars": 3.5, "variance": {"poor": 36, "average": 81, "very good": 206, "terrible": 31, "excellent": 339}, "aka": "At Old Town Albuquerque", "slim_ranking": 0.179310344828, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The Hotel Albuquerque offers New Mexican hospitality in with Albuquerque sophistication. Adorned with a historic touch of contemporary furnishings inside its territorial-style exterior, the hotel is a one-of-a-kind experience. Comfort is melded with New Mexican elegance in every one of the 188 guest rooms. The hotel offers restaurants, bars and social venues on the property to satisfy the hungry, the high-class, and the ultra-chic. As a landmark to the city, the hotel sits quaintly in the historic Old Town area, where guests can conveniently walk to several attractions, parks, museums, and shops. After one experience at the Hotel Albuquerque, you’ll feel like calling Albuquerque your home.\"Hotels supporting cultural causes.\""}