{"user_rating": 3.5, "review_count": 211, "name": "Hotel on the Cay", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I just spent six nights in Room 208 at the Hotel on the Cay with my husband and 7 year old and we all loved it. After reading the reviews here, I expected a much less nice room and was pleasantly surprised to find a lovely room with beautiful tiled floors, a nice kitchenette, and a nice balcony with a great view of the ocean. l admit that I don't live in a new house with the luxuries that Americans seem to expect today in their homes, so I may be unusual in my standards, but we were more than comfortable in our room...we loved it. And right outside we had a great beach with convenient snorkeling any time we wanted, a pool that was both elegant and kid friendly, and drink and food service (breakfast and lunch) on a shaded patio with a full view of the beach, so the adults could relax while the kids played in the water. In addition, we appreciated the convenience of the planned activities the hotel offered -- including the fabulous snorkeling with Peter-- and the friendly and helpful on-site watersport business run by Duane and Michele. And any time we wanted we could jump on the ferry and cross the harbor to Christensted to shop, eat, or just wander around to view the great historic buildings. We had a great time and would definitely recommend this hotel, especially to families with kids.", "title": "Better than I expected", "helpfulness": 6, "user": "misoMaryland", "date": "March 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14661393, "likes": {"liked": "— The location", "disliked": "— Wish restaurant was open for dinner"}}, {"rating": 4.0, "title": "Great Place for the Price", "text": "As others have mentioned, the rooms were a bit dated, but who needs an extremely nice room when you are in paradise?", "helpfulness": 2, "user": "Fisher111", "date": "March 15, 2008", "id": 14308664}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "St. Croix was simply an amazing time. You get all of the amenities of the other more \"popular\" islands with the laid back culture of the locals.", "title": "Location nice but not the Ritz", "helpfulness": 2, "user": "DonaldFagen", "date": "March 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 14018910, "likes": {"liked": "— Makes a Carribean vacation affordable and has on-site beach and pool", "disliked": "— Could use upgrading but that might negate first item noted above as prices would rise a lot"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The nightlife was somewhat lacking, but you could always find somewhere to drink and someone to drink with.", "title": "When I can leave D.C. and Move there?!", "helpfulness": 29, "user": "WashingtonDCLocal", "date": "October 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 10406808, "likes": {"liked": "— AWESOME SERVICE", "disliked": "— Roof leaked during Torrential Storms"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We ate at the Avacado Pit every morning for breakfast. Nice staff and great food.", "title": "IMO best deal in the Caribbean", "helpfulness": 6, "user": "SwampGas", "date": "October 17, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 10089798, "likes": {"liked": "— Location", "disliked": "— no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "I just returned from St. Croix and Hotel on the Cay. As a single older woman I was nervous about going, but I’m glad I went. While the hotel is not a 5 star resort, it was comfortable and made me feel safe and secure. The room had two double beds, a ceiling fan as well as air conditioning and a balcony. The kitchenette was well stocked and everything was clean. The full tiled bathroom had a full sized tub and shower. The beach is great complete with a bar/restaurant and all activities can be arranged right at the beach shack there. You can’t beat the proximity to the town of Christiansted, the ferry runs back and forth constantly. I had no problem walking and shopping around the town. The locals and visitors were all friendly and helpful, as were all the hotel staff. I wouldn’t hesitate to go there again.", "title": "Throughly enjoyed the stay", "helpfulness": 4, "user": "TILLY333", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18692135, "likes": {"liked": "— cleanliness, kitchenette, privacy"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The staff was very nice and the view is beautiful. The rooms are due for some updates along with the air conditional. Our rooms was cleaned daily and we had towels. Its not what i am use to but its in the heart of st croix and I was able to get around easy. If they update the rooms and have someone to help with luggage up the stairs it would be a great place to stay.They just need to invest into the property and the rooms and it would be a great place to stay.", "title": "Needs some improvements", "helpfulness": 2, "user": "Peachy_8", "date": "August 4, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 18603826, "likes": {"liked": "— The people was very nice", "disliked": "— The rooms and the stairs"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The Hotel on the Cay is an island in the middle of the Christiansted harbor. Basic rooms, clean, microwave and coffee maker. They will bring you a small frig is you need one (no charge) The beach is clean, has a beach bar, good for snorkeling.There is a pool that is a wonderful place for a quiet swim at night. A boat takes you back and forth to the main street (about 30 second ride). It's not a big, fancy place, but it is definitely a comfortable place. The staff is great!", "title": "Nice Spot, Quiet", "helpfulness": 2, "user": "queban", "date": "June 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 17020091, "likes": {"liked": "— Beach and Pool", "disliked": "— Beach Restaurant closes too early"}}, {"rating": 1.0, "title": "Never Again!", "text": "A total DUMP. We were aware of the dated rooms and read previous reviews, but this place should be closed and gutted and completely renovated. From the restaurant to the lobby to the public areas to the room --$29.95 would have been too much to pay for this hotel. We have stayed at limited service 'Motels' and had nicer accommodations. It is one thing to be dated and another to be a dump. Everything in the room has either been used for 30 years (and looks it) or is broken, rusty, cracked, torn, peeling, or dirty. The shutters on the entry door were broken, half of the kitchen supplies were missing, the mattresses appeared to be from the 1970's, and we couldn't get the tub to drain. Towels for the beach had to be exchanged at the Front Desk. We had the same towels for 3 days - the desk just told us every time-\"maybe tomorrow we will have towels\". Service at the beach restaurant was non-existent. Unless you are a local (which they had plenty of) forget about getting served. They even shipped 30 local kids in one day for lunch. What a surprise that was for a quiet day at the beach. Don't let the 'island' promo fool you. The setting could be beautiful and this place has potential. But it needs ALOT of work. Stay far far away until they renovate or demolish.", "helpfulness": 1, "user": "MarkHouston", "date": "April 8, 2008", "id": 14893449}, {"rating": 3.0, "title": "perfect location", "text": "I returned yesterday /329/2008 after a 7 day stay in St. Croix. This hotel is not the Ritz but it served its purpose for me. First the location is perfect. You are in the heart/hrtbor of Christiansted and you are the only hotel that has a beach (in downtown). The ferry was perfect and runs every 10 mins until midnight and once across the water you can walk, shop, drive etc. Some of the families had children with them but I think that you really need to be a water fanactict to truly enjoy the experience. Food is expensive but good but alcohol which is duty free is dirt cheap. Prices for jewerly can be quite a bit so you may want to shop around before buying those pieces that you can not leave the island without such as the hook bracelet. Also while there be sure to take the island tour with Sweeney - it was a great experience and he can also provide insights to other activities on the island. I plan to return very soon and if I stay for 7 days i will stay at he cay once again. If you decide to stay at another location not located by the harbor/boardwalk you will spend quite a pretty penny in taxis.Overall the hotel is a great value for the location. The rooms have a mini fridge that comes in handy at times. The people are friendly and when they say come again they mean it - i loved the experience.", "helpfulness": 3, "user": "dslim", "date": "March 31, 2008", "id": 14673355}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "What can say, I am a frequent visitor to St. Croix and Hotel on The Cay, and I love it. True, it is a bit dated, the water pressure is low. Now, there is no parking but with a little of creativity you can find a spot up the road from the King Cristian Hotel just past Sonyas.But the location is perfect. Just a 1 minute ferry ride to the Christianstead boardwalk and lots of bars and places to eat.", "title": "My favorite hotel in St. Croix", "helpfulness": 3, "user": "CrucianPirate", "date": "January 30, 2009", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 24031892, "likes": {"liked": "— The location and the staff", "disliked": "— the water pressure"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "It has the ONLY in town beach in Christianstead with a great view of the harbour. The bar has an excellent wait staff with cold drinks and this makes for a perfect day for liming around on the sand. The staff all the way from Sara at the front desk, the maids to the ferry drivers is excellent. You can rent BBQ utensils for $5 and use thire gas grill and have an outdoor BBQ over looking the mainland (the island of St. Crox)They treat you like family with hugs and treats from thier gardens. The restaurant has great food but closes early. A little too early in my opinion. But it is perfect for my late night tradition - a bottle of Cruzan Single Barrel rum on the beach with friends. If you want to be pampered and spoiled go to the Buccaneer. If you want a hotel that is clean, basic with a small refrigerator and a staff that treats you like family, this is the place.", "title": "Already making plans to go back!!!!", "helpfulness": 2, "user": "LIVINFORALILMOMENT", "date": "November 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21658113, "likes": {"liked": "— VERY FRIENDLY", "disliked": "— NOTHING"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "We were weary because of some of the reviews...but DONT LISTEN! We went for our honeymoon july 22-28. We loved it... the hotel needed some work yes, with the running water fountains or whatever and the pool itself...BUT why use the pool when your surrounded by beautiful water? We were there pretty much to sleep. Beautiful views...very clean. THey were there everyday cleaning our room. We snorkeled everyday. Even brought home a hugh conch shell that was right out there in the water. I have nothing but good things to say about st croix as well as hotel on the cay. IF YOUR GOING, def eat at the Bombay Club. Ask for Mikes special drink \"Mikes Mai tai\" and try the chicken picatta. Absolutely delicious. O and Parrots cove CRUZAN CONFUSION. Ahhh were ready to go back. Relax and enjoy the beautiful st croix...remember its just a place to sleep!", "title": "Not what I expected", "user": "IamMeNotYou", "date": "November 7, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 21622438, "likes": {"liked": "— Not Much", "disliked": "— Most everything"}}, {"rating": 3.0, "title": "Visit Tuesday nights for the Cultural Show", "text": "Well where do i start... Ocean view not till they cut down the weeds, NO internet, NO Parking, NO water Pressure for shower, NO/Little Hot water, Air conditioner leaks all over the floor, Lights out all over the place dark walkways. well lets put it this way they need to spend a lot of money and do some MAJOR updates and upgrades. I would NOT recommend this hotel. I think that the Timeshare rooms may be better.", "helpfulness": 1, "user": "ShadestnNashville_TN", "date": "October 4, 2008", "id": 20614160}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "On Tuesday nights head over to Hotel on the Cay which is a resort situated on a small island off Christiansted Harbor, a 2-minute ferry ride from the boardwalk. They may charge you $3.00 for the roundtrip ride if you are not a guest of the hotel. On Tuesday nights they host the Crucian BBQ and Cultural Show. You’ll hear the steal drum band, see the glass walker, fire breather and dancing Mocko Jumbies. I did not eat at the BBQ buffet but it looked and smelled good. It gets busy so if you want to get a table, I would suggest going early. The show is short but it is something fun and different to do.", "title": "No bones to pick here!!!", "helpfulness": 3, "user": "keepyourheadtothesky", "date": "August 23, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 19281687, "likes": {"liked": "— location and central air", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I was a first time STX visitor from June 20 to 26, 2009. When I plan vacations, I expect security, quiet atmosphere, cleanliness, friendly and efficient staff and great location. I found it all at HotC and plan on returning. Highlights of hotel: before my visit the staff was very quick to respond to my e-mails as to what was included in our room (I felt like I was very familiar with the hotel accommodations, and what I needed to take, before I even arrived!), easy internet arrangement (through the hotel) of airport pick-up with local, professional and friendly taxi service. Rudi was waiting for our \"delayed\" arrival and even provided a mini tour of STX as we traveled to hotel, check-in was quick and efficient, safe deposit box is in lobby, beach towels available and plentiful, our 3rd floor efficiency was like living in a tree top home with a gorgeous view of the harbour and the active wildlife, ice machine on each floor, Sunday's informative Weekly Activity review is well worth attending as is Supermarket run that took only an hour at $7 rd. trip/person. Snorkeling around the island was great, especially under the dock, sand is like sifted flour and beach was never crowded, beach chairs and loungers were comfortable, water taxi runs continuously during the day and if you're very fortunate, Freddie will share his garden delights and good conversation, Tuesday night Caribbean buffet was fun, great hotel for accessing Christiansted restaurants, shops, water activities and history and the friendliest people I've ever met. We didn't need to rent a car. We didn't access the hotel's water sports shop but it looked well stocked. I'm not interested in the bar nightlife but it was available just a 90 second boat ride away. Check-out was a breeze, our return trip to airport was arranged by hotel staff and the taxi driver was on time and again shared a wealth of information about STX. This is one of the few islands that I'd like to return to for our next vacation. I have no qualms about recommending Hotel on the Cay and beautiful island of STX. It is the best kept secret in the Caribbean.", "title": "Absolutely Fabulous!!!!", "helpfulness": 3, "user": "jonnie", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34118672}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "I was there for 5 nights and had a great time! Looked over the water every morning with my coffee on the balcony. VERY friendly staff, clean, safe and perfect location. I loved taking the little boat over every night. It was nice to come back and take a quick swim everyday. The best rates on the island fro what you get. Little frig, microwave and toaster oven so you don't have to eat out every meal makes it very economical.", "title": "Location-spectacular", "helpfulness": 4, "user": "curran17", "date": "July 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33827071}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "My sister and I were invited to come to St. Croix to hear Fran Marnier play at the local bars and he suggested we stay at the Hotel on the Cay. It was excellent. Everyone was very friendly - the room had an excellent view and the beach was perfect. If you want a relaxed laid back \"island\" vacation near the restaurants and shopping - I recommend you stay here.", "title": "Best location and beach near Christiansted", "helpfulness": 3, "user": "Travelqueen8882", "date": "March 21, 2009", "detail_rating": {"cleanliness": 4.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 26549804}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Hotel on the Cay in St. Croix is a wonderful place for a reasonably priced vacation in paradise. It is everyone's dream private island. Cruzans are reserved by nature, but they get to know you quickly and give you wonderful friendly service. I really felt looked after. Nice rooms with kitchenette. Comfortable mattresses & clean. The beach is a jewel. I never bothered with the pool. You never have to leave the island except to take the ferry service for dinner in Christiansted unless you prefer to prepare dinner in your room. It is about a 3 minute trip and runs frequently. They also offer terrific tours. Fun entertainment on Tuesdays and Sunday and a weekly grocery store run. You don't need a car! The breakfast/lunch food and drink prices are extremely reasonable as well as delicious! It isn't gourmet but for comfort food it can't be beat. They made the best coleslaw I ever tasted! I wish that it was open for dinner, but with all the boardwalk restaurants so close by, it really didn't matter all that much.", "title": "Wonderful Value, Excellent Staff, Fabulous Location, True Paradise", "helpfulness": 3, "user": "Macspooky", "date": "March 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26117493}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The trip St Croix was the first trip for mself and wife.", "title": "Marriott location Motel 6 room", "helpfulness": 6, "user": "VW2WIN", "date": "February 28, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 25354435, "likes": {"liked": "— LOCATION", "disliked": "— NEED UPDATE"}}], "location": {"country": "Caribbean"}, "stars": 2.5, "variance": {"poor": 28, "average": 45, "very good": 91, "terrible": 14, "excellent": 33}, "aka": "On The Cay Christiansted", "slim_ranking": 0.625, "description": "Step into an atmosphere of casual elegance during your visit to our inviting private island retreat. If your idea of a Caribbean vacation includes unforgettable sunsets, white sand beaches and the simple phrase “no problem,” this is the place for you! Hotel on the Cay offers you the best vacation value in the Caribbean. Located on a private cay in the Caribbean Sea, our 53 room resort provides for an unforgettable vacation experience that is ideal for couples, families and adventure seekers.Here guests can dine at our on-site restaurant, unwind with a refreshing swim in the pool, enjoy water sports at our activity center and explore the historical sights, eateries, shops and entertainment located on the boardwalk just minutes away by private complimentary boat. A quaint, pristine beach overlooks Christiansted Harbor’s beautiful boats, which makes for perfect photos at sunset. As the only beach in downtown Christiansted, you will enjoy swimming and snorkeling the amazing undersea world surrounding the cay.Hotel on the Cay will provide bountiful sunshine, bright turquoise seas teeming with life, refreshing trade winds and a place to lay your head at the end of each memorable day."}