{"user_rating": 4.5, "review_count": 3523, "name": "Howard Johnson Anaheim Hotel and Water Playground", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "After the fabulous reviews here we were expecting more. The room was spacious. One bed was quite nice, the other was uncomfortable and made terrible squeaks every time someone moved. We carefully chose our room to try to avoid the freeway noise, but even being on the pool side of building 2, the noise was BAD. I don't know if it was the freeway or Harbor Blvd, but the loud rumbling of trucks woke me up all night. I am not a light sleeper, and I live under the flight path of a military airport, so I am used to noise, but I slept very poorly the first night. The 2nd night I ran the air all night and that helped somewhat- just a tip!", "title": "Somewhat disappointed", "helpfulness": 5, "user": "JenSDCA", "date": "December 4, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 3.0, "value": 3.0, "rooms": 1.0}, "id": 6333447, "likes": {"liked": "— Location", "disliked": "— Noise"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "The grounds were nice. The first night of our stay, there were strong winds that blew branches and leaves all over. By 10 am, all was swept up, so kudos to the grounds crew. The service was friendly and efficient. I just wish that the room had been quieter and more comfortable so I could give a higher rating, but instead we won't likely return.", "title": "Caution", "helpfulness": 7, "user": "Vasco-da-howl", "date": "December 3, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 6321721, "likes": {"liked": "— Location", "disliked": "— Rude"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "After reading the reviews on this site we made the choice to stay at the Hojo Anaheim. The rating is misleading.", "title": "Hojo great hotel for visiting Disneyland", "helpfulness": 19, "user": "kimmm", "date": "November 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6133811, "likes": {"liked": "— Cleanliness, Great staff and closeness to Disneyland Resort", "disliked": "— turn on refrigerator when you arrive, if you are leaving after visiting Disneyland leave your luggage with hotel while at Disneyland and leave your car in Hojo parking lot"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "This is not a 3 star hotel! This is an economy hotel with hard beds and sheets that burn you if you move too fast. We were improperly charged for a long distance phone call and when I brought it to the attention of the clerk he ignored my query, and said the long distance rates are 'clearly' written in english on the phone. Ouch!", "title": "Travel Agent Opinion", "helpfulness": 11, "user": "AubeeRose", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6122094, "likes": {"liked": "— Location", "disliked": "— No breakfast included"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Over the 1 month we spent travelling through SoCal, this was our least favourite hotel.", "title": "A wonderful place for families!!", "helpfulness": 10, "user": "smileZ's", "date": "November 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6110130}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "I wanted to stay at this hotel based on their website and the reviews I read, raving about the \"gardens\", the jacuzzi and the fireworks poolside. I have to admit, I was a bit disappointed. This hotel was ok, however the \"balcony with a disney view\" was VERY disappointing in that it was a view of a tree and a rooftop, I could not see the fireworks from my blacony as promised. I went down to the pool and was able to \"kind of\" see them between the trees and buildings, while sitting on a wet pool chaise and listening to kids scream in the pool. Oh well, live and learn. I would not book this hotel again on the basis of it's being near Disney as you really can't tell. As for the jacuzzi, I don't know if it was nice as whenever I had a chance to go in it, it was full. I did stick my feet in it for a few minutes one morning and it probably would have been heavenly had I had the chance! The \"gardens\" were little more than well landscaped walkways. As for the room, it was nice, the internet was free and the fridge worked well. I would have preferred having a microwave, but they are not available in the \"disney view\" rooms. I have to say I REALLY enjoyed the little cafe Mimi's on the corner and would definitely recommend making the time to eat ther. (reservations recommended), as they get busy, even on a monday at 10, I needed a reservation. Also if you want to eat outside on the patio, you need to request that too. I want to also add a \"plug\" for Eric the waiter at Mimi's- he was GREAT! Make sure you have a mimosa or hibiscus with your meal!! As far as the walk to Disney, it was easy, the walk to the convention center is a little longer, but not too bad, just wear comfortable shoes! Lots of nearby shops too. All in all, an ok place, better for someone traveling with kids though, than me, a business traveler alone.", "title": "A decent place", "helpfulness": 4, "user": "wellnesscoachjo", "date": "October 26, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 6015711, "likes": {"liked": "— close to downtown Disney, MImi's cafe", "disliked": "— crowded pool and jacuzzi, no fitness center, no microwave,"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "We stayed for 5 nights from October 6th. Rooms are very spacious, our room was in building 1 on the 6th floor with a lovely balcony where we watched the fireworks each night.", "title": "loved itl", "helpfulness": 5, "user": "dodges", "date": "October 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6011878, "likes": {"liked": "— position", "disliked": "— no bell hop, though trolleys provided"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "The rooms are spacious, though the bathroom a little on the small side, the shower was wonderful. Tea and coffee is provided, something that a lot of hotels in America do not do.", "title": "Looking Forward to Returning to the Howard Johnson", "helpfulness": 3, "user": "gonzomoon", "date": "October 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6003190, "likes": {"liked": "— Large comfortable rooms", "disliked": "— Having to come home"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I gaurantee you will not be disappointed with the HJ.", "title": "Very Satisfied!!", "helpfulness": 5, "user": "REvans", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5984985, "likes": {"liked": "— location, cleanliness", "disliked": "— the highways"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "It is a short stroll to Disneyland with plenty of restaurants to choose from along the way, suiting all budgets. Our favourite was Mimmi's directly across the road.", "title": "Home away from Home", "helpfulness": 4, "user": "K-S-4", "date": "October 21, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5981371, "likes": {"liked": "— Cleanliness and safe feeling", "disliked": "— rooms only had double beds"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We have previously stayed at the Disneyland hotel, but for this trip we paid 1200. for airfare for two, park tickets and hotel, Disneyland Hotel was another 600. So off to HOJO. Four nights. When we checked in we were assigned a room overlooking the main pool (our travel agent requested a pool view) and I requested we be away from traffic noise. We were ground floor with two double beds. I was worried about the doubles as my kid always ends up in my bed when we travel, but I have to say the room was really big, and the bed seemed bigger then a usual double. I was worried about pool noise and when I voiced my cocnerns the man who checked us in said they were full for the night (it was a Friday) but if it was a problem to let them know the next day and they would move us.", "title": "Enjoyed HOJO's", "helpfulness": 9, "user": "Abigailsmom", "date": "November 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6079627, "likes": {"liked": "— Large room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "No problem the noise was non-existent when we had the door closed.", "title": "Accommodating.", "helpfulness": 7, "user": "Jaxxsword", "date": "November 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6078356, "likes": {"liked": "— Distance from Disneyland.", "disliked": "— Pools not big enough."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Kid loved the pool. The grounds were nice and we had a great time. The walk was fine, really not any further then the Disneyland hotel.", "title": "The best hotel on our recent trip to the USA", "helpfulness": 8, "user": "Chris C", "date": "November 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 6060255, "likes": {"liked": "— Great staff, Facilities, Huge room.", "disliked": "— Not as close to Disney as I thought."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Loved the gift shop, lots of stuff.", "title": "Nice overall experience", "helpfulness": 9, "user": "hapafour", "date": "October 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6031217, "likes": {"liked": "— The location to the Disneyland Resort", "disliked": "— Room was showing its age"}}, {"rating": 5.0, "title": "Incredible Hotel!", "text": "The room was clean and big, a little \"old\" but then so is the Disneyland, lots of good places to eat close by. Housekeeping was excellent. We would stay there again.", "helpfulness": 13, "user": "M-Sheep", "date": "October 26, 2006", "id": 6016109}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We stayed for 8 nights starting October 01, 2005. My wife and I and 2 daughters (8 and 9), had a fantastic time staying here. The staff was all fantastic, front desk to the maid service. Everyone was great and very accomadating.", "title": "Great family Hotel.", "helpfulness": 4, "user": "traveller007", "date": "October 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4036466}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "OK, now some tips.", "title": "Wonderful stay at the Howard Johnson", "helpfulness": 5, "user": "Laura R", "date": "October 19, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4036447}, {"rating": 2.0, "title": "Noisiest room we've ever had!", "text": "If you want a quiet room make sure you let them know when you book or check in that that is your priority. They have 7 buildings many that can offer a quiet room, we wanted a tower room facing disneyland, but because we booked late and they were full we could not do that for the full 8 nights. We stayed in building 1, I would try and secure a room facing disneland in this building if you can. It would be a lot quieter that the side facing the I5. The best place to watch the fireworks is in the pool area, so don't stress to much about a room with a view of them because you should really go down and watch from the pool anyways. We stayed on the side facing the I5, and I admit the noise was above average, BUT they would have gladly moved me to a quieter room in one of the other buildings, but we liked being on the 7th floor and in building 1 with the gift shop. (at age 8 and 9 pressing the elavator buttons is still a thrill for the kids.) After spending 12 hours at Disney the noise was not enough to keep even me awake, and I sleep light.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 17, 2005", "id": 4029359}, {"rating": 5.0, "title": "Great place to stay", "text": "The walk to Disney is about 7 minutes or so, not bad really. If feels a lot longer after 12 hours at the park though. If walking bothers get an \"ART\" pass as soon as you arrive for the duration of your disney stay and you can shuttle back and forth as much as you want without walking. The HOJO is the first stop for the B shuttle I believe.", "helpfulness": 9, "user": "JPMD", "date": "October 16, 2005", "id": 4026180}, {"rating": 4.0, "title": "Clean and comfortable", "text": "We did walk by about 5 or 6 Motel style accomadations on the walk to Disney every day, they looked clean so we decided to check them out one day to see if they might save us a few steps the next time we go to Disney. In the end while they all looked ok, the HOJO by far had the nicest pool and pool area, and that is a huge plus when travelling with kids. Most of the others where quite small.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 14, 2005", "id": 4022606}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "After lots of looking on the internet we chose the Howard Johnson based on recommendations from friends and travel agent and these reviews.", "title": "Great Choice", "helpfulness": 3, "user": "Kram0523", "date": "November 17, 2003", "detail_rating": {"value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 1490296}, {"rating": 5.0, "title": "Very impressive- great location at a great price!", "text": "Didn't know the area, but were very happy with what we found. The room was bright, large, well equiped and had a nice balcony that we could watch the fire works from. Very clean hotel, well maintained grounds, two pools and a small store and arcade. A great family place. Just a short walk across to Disneyland and Mimi's restaurant across the street was our favourite restraurant in the area. Make sure that you choose a room away from the back of the property as the I5 runs right behind. A great choice, very friendly staff and we will be back.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "November 1, 2003", "id": 1434009}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My Girlfriend and I stayed at the Howard Johnson for 3 nights on our road trip around the USA in Sept 2005. We are in our twenties, so young you may say but our expectations are high. Sept. We Choose the Howard Johnson because when we booked it said it was close to Disney. ( We were revisiting our childhood ) We arrived late for check-in because we stopped along the route at Laguna Beach to see the sunset, which is a must for anyone. It’s amazing!! Anyway, front desk staff were excellent. Friendly, helpful and check-in was smooth. 5 mins later we had our key and we were on our way. When we booked there were only queen rooms left so we had two beds in the room. Cheap because we booked in advance. Best thing. Very nice rooms. Basic rooms but very clean, very very spacious, a balcony with a view of the pool and in the distance you can see Disney. (Ask for a pool view room) and an amazing shower (very clean) especially after a great day out at Disneyland, which is a mere 5 minute work across the street! Comfortable clean bed. Had a great sleep every night. The pool was lovely and clean. There’s plenty of cafes/restaurants in the area for breakfast/dinner. We ate in Mimi’s café. Breakfast was excellent (Small portions thou) but dinner was excellent and excellent large portions. Staying at the Hotel Johnson you get discounted Disney tickets but only a couple of dollars off. We got a 2 Day Park hopper ticket. One day would not have been enough for both parks! Overall an Excellent choice for anyone going to Disney. A Lovely, clean, comfortable hotel. We liked it so much we stayed an extra night and the receptionist was kind enough to keep it at the same rate as when we booked. A good $40 off. Excellent!", "title": "Great Location and great service!", "helpfulness": 6, "user": "Sam B", "date": "October 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4004816}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Genuinely great value for money, especially when compared to the more expensive 'big name' hotels in the area. We stayed for 6 nights, from Sept 22 - 27, 2005.", "title": "Excellent family hotel - book it!", "helpfulness": 18, "user": "SamoaninPerth", "date": "October 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4003670}, {"rating": 4.0, "title": "Great location and superb pool!", "text": "After reading the many postive reviews of this hotel on this site, one of the things that did impress us was that Bill Cleaver, the General Manager, was the only management person we could see, that emailed replies to comments from folks on this site.", "helpfulness": 6, "user": "KiwiKath", "date": "October 7, 2005", "id": 4000320}, {"rating": 5.0, "title": "All the positive reviews are right!", "text": "We emailed him personally, to which he replied straight away, and he then assisted our booking requests. To us, it's was the portend of genuine Customer Service and thus hopefully a good experience and so it proved to be.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 6, 2005", "id": 3996706}, {"rating": 5.0, "title": "Awesome", "text": "Travelling with our 4 sons, we requested 2 adjoining rooms, that had views of the fireworks at night and were booked into rooms 1517 / 1519, in Building 1. They were ideal - at the end of the hall, next to drinks and ice machines, roomy, twin Queen sized beds in both, very clean, well equipped and maintained and attractively decorated. I've stayed in much less appealing hotels for a lot more money, that's for sure.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "October 5, 2005", "id": 3994677}, {"rating": 5.0, "title": "Howard Johnson Hotel & Minnie Restuarant", "text": "My family of 5 stayed for 4 nights at the Howard Johnson in September 2005 and it was fantastic. Check-in staff excellent and very friendly and helpful. The location is great for the time you have at Disneyland, only a short 5 - 7 minute walk. We would go to Disneyland after having breakfast at Minnie's which is across the road from HoJo and then head to Disneyland for the morning. Return to Minnie for lunch and rest then head back for afternoon at Disneyland. We would then return to Minnie's at about 8.30 - 9 o'clock for Dinner. Staff were great and food fantastic. Beware of a place called Millies it is the worst we have ever experienced not only for the food but the service.", "helpfulness": 10, "user": "Sue_Holidays", "date": "November 9, 2005", "id": 4100877}, {"rating": 2.0, "title": "Nice Pool Area", "text": "Overall the hotel was okay. Close to Both Disney parks. Rooms were very small for the five of us. They didn't give us what we booked. Hotel staff at front desk didn't have their stuff together when it came to questions for doing things in the city. Cleaning of rooms wasn't to great. Our daughter got scabbies from the hotel. We had to ask all the time for our sheets to be changed (our baby spit up on them). If we never asked for it to be done it never would. The toilet flusher was very loud and would never flush on the first try. With 5 people in a room and at night was not good. We spent an extra $500 to stay at this hotel as we heard alot of good about it but we were not happy. The best thing about it was the pools, when you are going with kids. Our next trips to Disneyland we will not stay at this hotel again. A tip you don't need to ask for a balcony room for fireworks you can see them from the pools.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 6, 2005", "id": 4090615}, {"rating": 5.0, "title": "Great for our family of Disney fans!!", "text": "I love to plan our Disney trips and this was our first trip to California and Disneyland for it's 50th anniversary celebration. I am a planner...I plan, and plan, and plan!! I read reviews on everything before making reservations and try to talk to people about the best places to stay, etc. I finally decided on HOJO Anaheim because it is one of two \"preferred\" off-site hotels on The Mouse for Less website (and these people know everything DISNEY!). Their other choice was the Anaheim Hilton. HOJO had the best rates and looked great from all I researched online. When we arrived, it was perfect! Nice quaint hotel and very close to the park! We would walk out to the parking lot and there was the Matterhorn right there!! Just a short view down the road was The Tower of Terror! The novelty never wore off - even for me, a mom - every day we were amazed that Disneyland was RIGHT THERE!! The rooms were nice and great for our family of four. Fridge and microwave included so we ate breakfast in the room and saved more money that way. Pool was great, staff was helpful when needing info on tours, tickets, bus system, etc. If I had to complain about one thing it would be the fireworks. Since we are so close to the park, we heard them the first night we were there (being from Kentucky we were four hours ahead California time). They sounded like cannons going off. Though it woke me up, the rest of the family slept through it, LOL! Once we got adjusted to the time though we were never in bed when the fireworks went off. You really can't go wrong with HOJO Anaheim.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "November 6, 2005", "id": 4090167}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We stayed at the Hojo June 9-13. Our room requests were mostly met -- requested specific bldg (4, I think), upper floor, two beds, nonsmoking, pool view. We were on the ground floor but everything else was just as we asked. (also had 2 connecting rooms).", "title": "Hojo was great!", "helpfulness": 16, "user": "DMKArkansas", "date": "November 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4084785}, {"rating": 4.0, "title": "One of the best", "text": "The Hojo was extremely clean. The beds were comfortable, the rooms were quiet, the grounds were very pretty, and the pool was very clean. Every morning a worker cleaned the pool and lounge chairs, etc. even though they looked clean already. The gift shop was stocked with every thing you needed, as said on other reviews. We used the laundry one evening and it worked very well. We enjoyed sitting on the sidewalk watching the monorail go by and the fireworks on the nights we didn't stay in the parks late.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "November 2, 2005", "id": 4081159}, {"rating": 4.0, "title": "HoJo's is fine but hyped - great for price", "text": "We needed to be near Anaheim for business so decided to check out Disney while there, as we were traveling with an almost 2 year old. We were happy to find this affordable gem.", "helpfulness": 22, "user": "BrooklynMaMa", "date": "January 16, 2007", "id": 6604692}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled with family", "text": "We arrived much later then we expected because of fog delays in NYC and were exhausted. We reserved from the Long Beach parking lot. We were switched around back & fourth between reservations & the hotel front desk, which was slightly annoying but we managed to finally reserve. they honored rates we'd seen on the internet, which was around $85 with tax.", "title": "So far it's my favorite Disney area hotel", "helpfulness": 6, "user": "puokgirl", "date": "January 13, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 6590103, "likes": {"liked": "— Clean rooms, nice people, close to Disneyland", "disliked": "— I-5 offramp makes it difficult to get over"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "It was a quick drive from the airport and easy to find. When we arrived, we spent some time trying to figure out what room would be good for us with a child and to avoid the roar from the highway, have space etc.. They put us in one of the low buildings near the front office because it was one of the few with a king not facing the highway. Apparently, all kings face the highway and the rest are doubles. The staff was very accomodating, considering how tired we were. We were starving as well and it was very late. They gave us a menu for a Chinese restaurant nearby and told us we could also go to Denny's & IHOP was 24/7. We ended up ordering from the Chinese place and I have to say it was surprisingly great. One never knows with Chinese but this shocked us it was so delish. We ordered ribs, hot & sour soup and a spicey beef dish. All were exceptional. If I lived here I would order from this place on a regular basis, it was that good.", "title": "Dependable", "helpfulness": 6, "user": "jj428", "date": "January 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6571200, "likes": {"liked": "— location, comfort", "disliked": "— n/a"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Back to the hotel. I had read a good portion of the reviews on tripadvisor and it appears as though the hotel gets many 5-star hype from people who have only posted only a single time to sing the accolades of this particular hotel mentioning on site store, grounds crew & maid service as well as certain rooms facing the highway as good, which seem to be the least desirable upon inspection. This leads me to go \"hmmmm\" and be somewhat suspect that someone may be posting to raise ratings, which was #6 at the time of this writing and one of the reasons we choose the hotel, so keep that in mind.", "title": "Great Family Property", "helpfulness": 10, "user": "Jen1985", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6569544, "likes": {"liked": "— Very handy to Disneyland", "disliked": "— If you were in the back block it was far from reception but not a major problem"}}, {"rating": 3.0, "title": "Pleasantly surprised", "text": "We do feel we got our moneys worth and would return here again. Our main reasons for choosing this hotel were the location, the price, the ratings, the pool, the spa and again the location.", "helpfulness": 13, "user": "TMOMEdmonton", "date": "January 6, 2007", "id": 6560241}, {"rating": 5.0, "title": "Would definitely stay here again", "text": "After booking the Howard Johnson I was concerned that the hotel would not meet our expectations. In fact, it exceeded our expectations and more. The front office staff were both friendly and helpful, the rooms were large and spacious and what I appreciated the most was the cleanliness of the rooms. The only complaint I could think of was the fact that Building 4 has no elevators; and as we were on the second floor, we had to drag our suitcases up and down which was mildly annoying (please note: hotel staff did offer to assist us with our luggage). Aside from that, my husband and I and our two children all found the pool facilities to be top-notch; my son especially enjoyed the pool and the hot tub. Although there were no restaurants within the hotel, we discovered a fabulous restaurant directly across the street from the hotel. Disneyland is a mere 10 minute walk which proved to be enjoyable each and every morning we were there. We will definitely book the Howard Johnson in Anaheim when we return. We are already highly recommending it to all of our friends who are planning a trip to Disneyland. Thank you to the hotel for making our first to Disneyland a memorable one.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "October 30, 2005", "id": 4072336}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "We stayed at the Howard Johnson from Oct. 15-18. We had a party of 7 and had booked 2 rooms each with the premium disney view. I had called and verified the booking 2 days prior to my stay because I had discovered that the hotel was sold out the 1st nt. of our stay and we were paying a considerably lower rate than current rates due to the advance booking we made. I was concerned that since the hotel was sold out and room rates had risen considerably since my booking that my rooms would be given to a higher paying guest. After spending 4 years in the hotel industry I was familiar with the fact the sometimes a guest will be bumped to a different room in order to accomodate a higher paying guest. I was advised during my conversation with the front desk that would not be the case and I did not have to worry. The front desk confirmed that we had booked the premium disney views and was told that at the very least we would see the disney fireworks from our balcony. We planned to spend our first evening of our vacation at the hotel watching the fireworks from our room. Upon arrival we went up to our rooms only to discover that we were looking directly at a brick wall. Not even a pool view. No view at all. Convinced this could be fixed I went to the front desk and explained I booked a premium disney view for both of my rooms and some mistake had been made. I was told I did not book premium disney view rooms and in fact I had booked standard rooms. A premium disney view room is called a \"NQQ1\" and a standard room is a \"NQQ3\". I explained again and they told me \"no you didn't book a premium disney view room.\" I had to run back to my room to get proof of my booking (thank goodness I brought my written confirmation with me) and indeed was able to show them that I had booked a premium disney view (NQQ1) for both rooms. I brought that written confirmation because I was afraid this exact situation would happen due to our room rate being so much lower than their current rates. The gentlemen at the desk looked confused and disappeared into the back to speak w/management. After a while he came out and apologized and said they had made an error however there wasn't anything he could do for the evening as the hotel was sold out. He said the most he could do was offer me the standard room rate as I was still being charged the disney view rate at that time and move me to my correct rooms the next day as the hotel would no longer be sold out. Seeing as how there was nothing else I could do I accepted his offer and we stayed the 1st nt. disappointed by our view of the brick wall. I would much rather have been given the room I orignally booked and pay my original room rate rather than settle for a standard room at the standard rate. We ended up watching fireworks from the pool deck, but not all of our party could do that as we were traveling w/toddlers who were very tired and could not stay up long enough to watch the fireworks therefore some of us stayed in the room while others headed out determined not to let this mix up ruin our evening. The reason I was so frustrated was because I passed up a suite at another hotel at a discount from friends in the hotel industry to have this premium disney view room. I found the hotel clean and the staff friendly. If we had not had a mix up with the rooms our stay would have been perfect. We did get the correct rooms the next day at a discount which was quite generous of the hotel. The distance from the park to the hotel was short and convenient. The premium disney view rooms are spacious and convenient with an extra sink outside the bathroom. Provided you get what you book this is a nice hotel for the price.", "title": "Good stay, despite problems with hotel.", "helpfulness": 8, "user": "jamkjhlove", "date": "October 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 3.0}, "id": 4066510}, {"rating": 5.0, "title": "Pleasant, Caring and Comfortable", "text": "My Husband and I chose Howard Johnson after reading the reviews on here.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 26, 2005", "id": 4054594}, {"rating": 2.0, "title": "Disappointed", "text": "It was the last week of our 3 week holiday in America and a true highlight.", "helpfulness": 7, "user": "sboyd1972", "date": "October 20, 2005", "id": 4040011}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The rooms are comfortable, clean and modern. We loved the balcony and Disney view Fireworks. The pool area was a great place to unwind after a buzy day. The gift shop had everything you could possibly need and as said on here many times the staff wonderful.", "title": "great place to stay", "helpfulness": 2, "user": "sinders", "date": "October 20, 2005", "detail_rating": {"rooms": 4.0}, "id": 4039408}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 124, "average": 376, "very good": 1331, "terrible": 35, "excellent": 1657}, "aka": "Howard Johnson Plaza Hotel And Water Playground - Anaheim / Disneyland Park", "slim_ranking": 0.045045045045, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Just an 8-minute walk from Disneyland Park, this non-smoking family resort hotel features Castaway Cove - A Watery Pirate Playground! With slides, drench bucket, water canons, jacuzzi, toddler's wading pool and more, Castaway Cove is a great place for your whole family to play together! Also nestled within the lush, park-like grounds is the family friendly Garden Pool! With free parking, fridges and internet- HoJo Anaheim is the perfect choice for your family adventure!"}