{"user_rating": 3.0, "review_count": 327, "name": "Howard Johnson Inn-Bartonsville/Poconos Area", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "A disaster. Here's the bad news first. This place has a record for auto breakins, too bad I found this out AFTER my car was broken into. Drivers side window busted in and GPS stolen. Hotel staff's front desk person would not even STAND at the counter to talk to me, she yelled at me from her seat in the back room that it was \"too daym bad, we arent responsible.\" Thats pretty good service huh? Same front desk person admits theres been quite a few breakins. No security solution though. Not a dime off my room rate either.", "title": "Car windows broken. More fun...", "helpfulness": 1, "user": "depper", "date": "May 11, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 2.0, "cleanliness": 2.0, "rooms": 1.0, "location": 1.0}, "id": 15935823}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I had the entire family with me, and my 7 year old daughter and I were afraid to get into the heated pool because they had the AC blowing at full speed it was utterly freezing in the pool room. We stepped in, stepped right out. No dice on the pool.", "title": "A Pleasant Weekend at HO JOS", "helpfulness": 2, "user": "Weekender329", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14677903, "likes": {"liked": "— Large Bed CLEAN!!"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The good news? I got a 3 hours of sleep, somehow, on the rock hard mattress.", "title": "due for a make-over!", "user": "MikeandGayle", "date": "August 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 8439805, "likes": {"liked": "— convenient location", "disliked": "— the Inn is worn and appears due for a remodeling, and the musty smell"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Advice...? Stay anywhere else in the Poconos.", "title": "should have read tripadvisor!!", "user": "roadtripjunkie38", "date": "August 15, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 8431716, "likes": {"liked": "— close to crossings and pocono areas of interest", "disliked": "— noise level"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Howard Johnsons in Bartonsville was a pleasant stay...the room was large and accomodating with all the ammenities such as refrig,microwave,coffee pot,internet,TV.The front desk attendant was VERY PLEASANT and helpful. They have a nice pool and nice lounge and is very convienent to a shopping center across the street with serveral resturants. NO NEED TO BAD RAP HO JOS!!!! We booked there for the weekend rather than pay $200 at the Casino and will do it AGAIN! CLEAN>>>CONVIENENT>>>>REASONABLE>>>>GREAT BED", "title": "Worst Stay Ever", "user": "ognyusa", "date": "August 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 8381178}, {"rating": 5.0, "title": "Exceeded Expectations", "text": "We stayed at this hotel, which was about 10 minutes from the ski resort that we were visiting and we were pleasantly surprised with the hotel, especially in light of other hotels we have stayed at during previous visits. The room was very clean and it smelled good. Bedspreads, curtains and carpet were rather new. Bathroom was nice and clean. Staff was extremely friendly. Location is great, right off I-80 but not on the highway, so that noise is not an issue. There's a shopping center conveniently located across the road with lots of restaurants. We will definitely stay here again and recommend to others.", "user": "helena08", "date": "December 29, 2008", "id": 23075084}, {"rating": 5.0, "title": "Feeling welcome in Bartonsville", "text": "Recently I needed a place to stay following a massive power outage in my part of PA. I didn't know much about the hotels in the area and I wasn't sure how long I'd need a place to stay. In the past I'd stayed at a howard johnson while on business and decided to check for one in my area.", "user": "leah411", "date": "November 4, 2008", "id": 21537026}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The hotel itself was easily accessible from the highway and to my relief had it's own restuarant and heated indoor pool.", "title": "OMG", "user": "PranayamaMama", "date": "August 4, 2008", "detail_rating": {"cleanliness": 1.0, "front_desk": 3.0, "location": 3.0, "value": 1.0, "rooms": 1.0}, "id": 18601816, "likes": {"liked": "— Right off the interstate; across the street from reputable restaurants", "disliked": "— Where do I begin?"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The room I stayed in was clean and the staff friendly. I must admit to feeling pleasantly surprised by the whole experience.", "title": "Fit our needs. What you'd expect.", "user": "DKieffer", "date": "July 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 17664909, "likes": {"liked": "— Location. AC Worked :-)", "disliked": "— Not enough towels, blankets & pillows."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "During the meals I had in the restuarant I enjoyed the food and found the wait staff to be attentive. The menu included a variety of dishes so I didn't get bored by the food. Although I must admit I didn't eat all my meals there. The front desk had menus for other local eateries and offered them when asked.", "title": "Simply Horrible", "helpfulness": 1, "user": "ConcernParent", "date": "June 23, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 3.0, "location": 1.0, "rooms": 1.0}, "id": 17158248, "likes": {"liked": "— not thing", "disliked": "— not thing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We recently went back to the Poconos and stayed at the HoJo's again. Its has been about 3 years since we were in that area last and boy has it changed! The area around the hotel has exploded with developments... lots of new shopping areas and restaurants.", "title": "Back at the HoJo", "helpfulness": 1, "user": "ColombiaRiz", "date": "January 29, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 24007966, "likes": {"liked": "— Nice beds", "disliked": "— Color scheme was a little drab"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "The hotel itself hasn't changed a whole lot. We called the hotel direct, got a great rate and ended up staying for 3 nights. Check-in was a breeze and our room was perfect for us. It was clean and actually the mattresses were pretty good... I think they were pillow top...", "title": "Ski weekend", "helpfulness": 1, "user": "PaTumbleweed", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23981168}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "We didn't eat at the hotel... although they do have some kind of safari themed steakhouse... we did however hang out at the bar one night. They actually had soemwhat of a local crowd there, so it was fun... nice group, and very relaxed atmosphere.", "title": "Unclean & horrible experience", "user": "SAMSNY", "date": "January 26, 2009", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 23913215, "likes": {"liked": "— Un-cleanliness of rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "So if you like to ski, I would definitley recommend going to the Poconos area... they have lots of great options... and i would also definitley recommend staying at the Howard Johnsons... its a great price, great location and the rooms are clean and comfortable.", "title": "Not too bad", "user": "kjd51", "date": "January 20, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 23737774, "likes": {"liked": "— price and not having to leave for bars/restaurants", "disliked": "— no movies for kids on tv, and no elevators"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "We booked 2 adjoining rooms 1 for the kids, 1 for my wife and myself. The reservation was made quickly over the phone. We arrived Friday to 2 very clean rooms with microwaves and fridges, that was real helpful ! We skied all afternoon at Camelback Ski mountain only 10 minutes away. After settling in that evening we had a delicious dinner at the hotel restaurant, the kids went for a swim in the pool and my wife and I spent a cozy evening in their ski lounge that had a beautiful fire place. We all slept like babies, got up on saturday to do it all again. We all had a great time. The young lady at the front desk was so courteous and so very pleasant, she was great with the kids and helped me with directions. I felt compelled to mention this to management and I did. The manger was very appreciative of my comments. All and all we had a great time. I have also sent comments to Howard Johnsons corporate center commending both Nayda, front desk and Faizal the manager. Thank agin for a great time. We'll be back !!", "title": "Keep going, don't stop!!!!!", "helpfulness": 1, "user": "DaveC248", "date": "January 11, 2009", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 23447162}, {"rating": 2.0, "title": "There is a mouse in the house", "text": "WE STAYED HERE FOR A FAMILY REUNION OVER LABOR dAY WEEKEND. After arriving back to HoJos, we met in the lounge for a cocktail. While sitting there a mouse came out of the fireplace and crawled up the wall into another hole. All night long we had dreams of a mouse walking across our beds.", "helpfulness": 1, "user": "ccwebs", "date": "September 19, 2006", "id": 5816713}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Excellent cleaning, front desk service, restaurant, swimming pool, and internet wireless in the rooms, but there are a bunch of workers who come from a construction site that is just across the hotel, apparently lodged in some rooms. You find them seated in the floor or standing up in the corridors, with a leg doubled and supported against the wall, talking and sharing in groups, as if they were in a public park.", "title": "Lack of control in the corridors.", "helpfulness": 2, "user": "GUIME", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "service": 2.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 3.0}, "id": 5561066, "likes": {"liked": "— Restaurant and swimming pool.", "disliked": "— Lack of control in the corridors."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "First impression, the overgrown weeds outside. However the lobby was nice. We booked a room with 2 double beds in case we had one of our kids with us (they were bunking at relative’s timeshare condo). As it turned out none of them wanted to stay with us. My husband & I are used to sleeping in a king, so we each took our own bed. When I pull down the covers of my bed the sheets & blankets STUCK together as they were NOT CLEAN LINENS. I crawled into the other bed with my husband, and we checked out in the morning regardless of our 4 night reservation. The bathroom ceiling had mold on it and the tub hardly drained. The girl at the desk although she was not rude, but nonetheless she was not helpful. She never asked why we were checking out after we told her this was not what we expected from a 3 star AAA rated hotel. She didn't care to hear any further reason. Then they tried to charge us for the remainder of our nights. I don't think so! I would NEVER stay here again, I would sleep in my car first.", "title": "Stay somewhere else!", "helpfulness": 5, "user": "webcoppies", "date": "July 19, 2006", "detail_rating": {"cleanliness": 1.0, "front_desk": 2.0, "rooms": 1.0, "value": 1.0}, "id": 5487396, "likes": {"liked": "— leaving", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "We made reservations over a month in advance after searching for a hotel that included a pool and was close to the Crossings Outlet Mall. We had small children and specifically needed a hotel with a pool. Upon arrival, there was a note taped to the check-in desk stating the pool was not open. The person behind the desk was unfriendly and offered no apologies only stating that if we weren't going to stay another night, to let them know as soon as possible (we were scheudled for 3 nights). After getting to the room (passing sink basins in the hallway that were catching water from a leak in the hallway ceiling), we decided we would definitely not be staying another night. We also got very little sleep because a group had blocked out rooms at the end of the hall and were partying and drinking all night long. We finally did complain and were told \"we were just about to come up there\" (this was at approximately 4am). We should have known watching them carry in cases of beer and misc. alcohol. The only saving grace that deserves a gold star was the clean room. They must have an excellent cleaning staff (although this non-smoking room had a faint smell of cigarettes). We made reservations at the Best Western in Blakeslee, PA almost an equal distance west of the outlet mall as this hotel was east. What a wonderful place - clean, friendly and a pool! This hotel is relatively new and highly recommended over the tired, worn Howard Johnson's. You might also check out the newer Hampton Inn just a few more miles east of the HoJo in Stroudsburg - again, relatively new and I'm sure a nicer stay.", "title": "Choose a different hotel!", "helpfulness": 8, "user": "WearyTravelerPA", "date": "April 19, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4988538}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "I stayed there over Washington's bday weekend. It really looked like the only thing close to Camelback that wasn't terrible and wasn't sold out. It was not cheap--my only complaint was that it was $170! But it was clean, pretty new, the staff were pleasant. Our heater in the room worked fine; I didn't check out the pool so I don't know if it was heated; this seems to be a trend in hotels--keeping the pools too cold. I think if that is so, we should all start complaining!", "title": "would return", "helpfulness": 3, "user": "Tomby", "date": "February 28, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4565512}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 55, "average": 80, "very good": 65, "terrible": 51, "excellent": 76}, "aka": "Howard Johnson Inn-Bartonsville/Poconos Area Hotel Bartonsville", "slim_ranking": 0.5}