{"user_rating": 3.5, "review_count": 506, "name": "Howard Johnson Mystic", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "This hotel is in a great location for sightseeing in mystic and several food options are within walking distance. Unfortunately the hotel is suffering from a serious mold problem. The ceiling in our room had clearly been suffering from mold for some time and despite cleaning efforts in the past mold stains remained. The bathroom also had mold on the wallpaper. Worst of all was the moldy aroma when entering the room. Being summer we could open the outside door for fresh air and get rid of the smell. The hallways also had a moldy smell despite use of dehumidifiers. Otherwise we were happy with our stay.", "title": "Great location but.....", "user": "Oldbuggar", "date": "August 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 172275332}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We just got back from a 3 day, 2 night family getaway to Mystic CT. We chose the Howard Johnson in Mystic because they had a great promo going: when you book 2 nights you get 2 adult tickets to Mystic Aquarium and 2 adult tickets to Mystic Seaport. What a great deal...all we needed to do was pay for our child's ticket to the aquarium!", "title": "Good Spot for Families Staying in Mystic Area", "user": "Lisa R", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171883698}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The location is perfect, near to everything. Right across from Olde Mystic Village and less than 5 minutes from the Aquarium and the Seaport (walking distance). There is a dinner in the same parking lot and a Friendly's too.", "title": "There was no breakfast, only coffee but it was good coffee...", "user": "Katherine Ms S", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171857939}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Our hotel accommodations were more than satisfactory: we had a refrigerator and microwave in our room and the hotel had an indoor pool which was great since it killed time during a rainy period.", "title": "Ends to a Means", "user": "Denise P", "date": "August 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 171517099}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I would recommend this hotel for any family looking to get the most out of their Mystic vacation.", "title": "All staff front desk & cleaning service were very friendly...", "user": "Kathleen F", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171375545}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "I loved this hotel....it had a microwave, fridge, iron, AND wall to ceiling mirrors. The staff was very nice. There were also bikes available to take into town", "title": "Great Hotel!", "user": "FLSeaHag", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 34089295}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We were put off by thie hotel from the moment we attempted to check in. It was after check-in time and our room was not ready. We had to wait for over 1/2 hour before we could get to our room. There were 6 other families who also hadto wait for their rooms. When we did get our room, we found another family checking into it also. We went to the desk and they straightened things out but it was such a hassle after having to wait that it set the whole stay off. The rooms were outdated and dark as well as not well maintained. The pool area was run-down and towels were not available. There are many other hotels in Mystic and I would advise to stay at one of those.", "title": "Poor service and upkeep", "helpfulness": 1, "user": "colinda2004", "date": "July 6, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 34043998}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "I will say for the money we paid, we got what we deserved. The staff at the front desk was very helpful and pleasant. When I booked this hotel, I thought the pictures looked decent. and the rooms so-so. The only thing updated about this hotel is the lobby. The hallways had a really bad odor to it, The rooms were very outdated . The beds were very uncomfortable and pillows were like pancakes! At the time of booking, I requested a room on the parking lot side to avoid the noise from the highway. As you can imagine, they did not have any rooms for me on the\"quiet side\", but it was OK, I never did hear alot of the traffic b/c we had the ac running all night to drown it out. Another reason I booked this hotel was for the indoor pool, the other hotels didn't have indoor heated. It was always empty when we used it and pretty clean. The only other complaint I have are the bed sheets or lack of them. Our beds never had a fitted sheet for the mattress, which means for kids they are always moving around on this gross, dirty ,unprotected mattress.", "title": "You pay for what you get", "user": "redsox1975", "date": "June 3, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 31477235}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I really wanted to save money on a hotel, and chose this one. I thought we got a pretty good deal. Next time I will spend more money for a cleaner, updated hotel and not an INN, that is what the HOJO is .", "title": "Very Basic Howard Johnson", "user": "NewYorkElaina", "date": "April 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 27829198}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "We stayed two nights during spring break to visit Mystic CT. The HOJO was in a very convenient location. Too convenient, you could hear the I-95 traffic at night, woke me once. The hotel was basic, fridge, microwave, good for the kids. The beds were comfy, bad pillows though. There was a smell, not sure what it was, but only in the hall, not the room itself. The indoor pool was really nice and clean. We called the front desk one time, they came right away, which was nice. There was a diner on the property, don't bother with it. That's for another review. But I would recommend Mystic HOJO. I probably would try a different place downtown Mystic though next time. The area attractions do not require a whole day visit, so take your time, and enjoy!!", "title": "Decent place for the price", "helpfulness": 2, "user": "Veritas01", "date": "February 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 25023338}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I travel for buisness and stay in a variety of hotels. I remember HOJO from my childhood and thought I would give it a try. It was great! The room was very clean, loved the fact that the room had a fridge and microwave, free WIFI and the beds were very comfortable. I will be back and hope to find other HOJO's to stay in during my travels.", "title": "HOJO is the way to go!!!", "user": "skihill3", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 51623072}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Pretty good for the price we paid. We didn't hear any disturbances from the highway nor the diner. Beds were firm like others had mentioned, but weren't bad. My only two complaints would be the dry heat and when we first arrived I was putting my bag under the bed and I noticed a small pill that much have been overlooked when the room was cleaned. Other then that it's a good price and in a good location. Also the front desk staff was always extremely kind.", "title": "Good for the price", "user": "cat123x", "date": "November 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 48905969}, {"rating": 1.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "That says it all. I could not sleep and management telling me they tell the diner to be quiet is ridiculous. The frosted windows cover the fact that you are sleeping by a noisy alley. We got a 10% reduction on the bill which is meaningless. Over rated, and over priced. We will never go back here again,", "title": "With a room facing the alley of a loud diner open past 3AM, a NIGHTMARE", "user": "Lomackes", "date": "September 27, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 1.0}, "id": 45062025}, {"rating": 3.0, "stay_parameters": "Stayed June 2009", "text": "The Howard Johnson in Mystic, CT, is a reasonably price hotel in a good location. It’s located on Greenmanville Road, a main street that runs through Mystic and is right off the highway exit, across the street from Mystic Village and surrounded by a number of other chain hotels.", "title": "Good Location, Reasonable Price", "helpfulness": 1, "user": "LFAN", "date": "September 26, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 44816426}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "On checking in to the hotel we were given a folder with a map and brochures for things to do in the area. Shortly after checking in someone called to make sure that everything was okay, which I think is a nice touch and something that, in my experience, few places do.", "title": "never again", "user": "midmiller", "date": "July 16, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 34911059}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "This hotel is very convenient! It's less than 30 seconds from I-95, and a very short walk or drive to the quaint village shops. It's also within minutes of the Mystic Seaport, Mystic Pizza, and the casinos. The staff was very friendly for check-in and check-out. They were genuine about making sure everything was ok, and I also received a call after checking in to ensure things were fine, and they were.", "title": "Decent Hotel", "helpfulness": 1, "user": "rbarry01usa", "date": "January 12, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23498543, "likes": {"liked": "— Location and Service", "disliked": "— Paper Thin Walls"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The hotel does look very dated (except for the lobby), but I didn't feel like it was too grungy or anything. The rooms also look dated, but everything was clean and in working order. My only complaint would be the paper thin walls. I had a rather loud neighbor that woke us up and we could hear her conversation word for word. If it weren't for that, I would've given this a 5/5 instead of a 4/5. This is a great value and worth the price. It'd also be a little better if they offered continental breakfast, but you can't ask for everything!", "title": "Great place for the price and location", "user": "JBro", "date": "December 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23141718, "likes": {"liked": "— Price and location", "disliked": "— Nothing. Great place."}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We just needed a quiet, clean place to sleep while we bustled around with the kids to the aquarium, seaport and other sites in Mystic. This place fit the bill without breaking the bank. The room was clean and the price exceptional. My kids base everything on the pool -- if the hotel has one, if it's clean, etc. -- and they gave it two thumbs up. Maybe no real frills, but in terms of the money it saved us which we then spent elsewhere in Mystic, it's a definite a do-over.", "title": "perfectly happy", "helpfulness": 1, "user": "Cathy214", "date": "September 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 19707844, "likes": {"liked": "— location; clean and basic", "disliked": "— slippery pool deck"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We stayed recently with three other families, and I was worried after reading some of the reviews. Let me say it was completely fine and pleasant for what you'd expect. Cute lobby, with a neat fishtank. The room was clean, updated (bathroom less updated, but spotless and bright), and not musty. They have a clean indoor pool that was the source of lots of fun, though the deck became very slippery. There is a smoking-rooms section (where my parents stayed), but it's very much sealed off from the other rooms. I visited their room, and even that wasn't that bad (and bad-smelling rooms make me freak). Overall, it was very easy to stay there. Not fancy--there were some very old elements (our sliding-glass door), but some unexpected good things, like a \"backyard\" area with a horseshoes pit. Totally fine!", "title": "Excellent place to say", "user": "KJLG", "date": "August 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18946991, "likes": {"liked": "— Customer Service, Tricia was outstanding and made us feel so welcome", "disliked": "— could use a new mattress in the room"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Stayed here Tuesday night and highly recommend it (don't pay attention to the old review from 2006). Our room on the 2nd floor, had 2 queen beds and a jacuzzi. Room was very clean and spacious. Yes, overlooked the parking lot, but so what. Location is just great, only 1/2 mile walk to Old Mystic, don't need to take a car to walk around the entire area. Tricia, the young woman at the desk, just OUTSTANDING. Extremely warm and personable and called the room 1/2 hour after we checked in to make sure everything was o.k. I've stayed in 5 star hotels that don't offer that courtesy. Pool area is excellent. Nice patio off the pool area and the door is kept open, along with windows, to alleviate some of the chlorine smell. Our room was missing a few items (bath towels, kleenex and conditioner) but a call to the desk solved that quickly. Very minor complaint, the mattress is on the older side and probably could stand to be replaced soon. Other than that, excellent value for the money, highly recommend it as a place to stay.", "title": "Yuck!!! This place was not good!", "user": "R0sie13", "date": "August 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 18827878, "likes": {"liked": "— Indoor pool was not too bad", "disliked": "— Room was a pit"}}, {"rating": 4.0, "title": "Pleasant experience", "text": "My Husband & I stayed for 2 nights, basically only got to sleep there, as we were moving our daughter to her new place. For the amount of time we spend at hotel it was pleasant.", "user": "nooccaraa", "date": "May 11, 2010", "id": 63871370}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "The Room was clean, bed was comfortable and it was quiet. Upon checking in we were given a coupon for 10% off at the restaurant next door, that was a nice surprise, used it for breakfast.", "title": "Great Value, Pleasant and Helpful Staff, Comfortable Room", "user": "featherwaitbirdclub", "date": "May 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63239359}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "On our third annual business trip to Mystic, we decided to try this location which turned out to cost a third of the price of the place we had stayed in the year before, and provided us more ammenities and more personable staff. Room was clean, spacious, supplied with refrigerator and microwave and a small safe (a real bonus when traveling on business). Free wifi connection, although not powerful enough to download a movie, was more than adequate for e-mails, etc. If they are not too busy, HOJO's will gladly accept the discount coupons from Roomsaver. The diner attached has a great breakfast menu, friendly service without a long wait. These accomodations are well worth the price.", "title": "Great Place, Great Price", "user": "Lilija", "date": "April 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60597825}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Can't believe I forgot to review this, when we stayed there. We were there in the first week of December, 2009. The rooms were clean, comfortable, and overall nice and affordable. The whirlpool tub is worth the upgrade to me, takes it from a basic room to more of a vacation, at a real bargain. The pool was lovely and well kept, and the location is great. The customer service was great too. Zero complaints, whatsoever. Definitely staying there again. Er, unrelated to the awesome hotel, the diner was poor to mediocre, but that was a whole other review...skip it and walk across the street to Old Mystic Village for food.", "title": "Mystic Aquarium not worth the money.", "user": "onsetfran", "date": "January 20, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 53977194}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Find something else to spend your money on.Mystic Aquarium is way too costly for the exhibits. We did stay at Howard Johnson's Hotel for our weekend and really liked the convenient location. It was very clean and comfortable. If you're looking for some down time, the pool was great! Would definitely stay there again.", "title": "This Hotel is worth the money", "user": "jwwarren", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53715513}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It was clean, but dingy. The (uneven) hallways were not air conditioned, but a humidifier was going. Jacuzzi tub didn't fit right in the bathroom, leaving gaps between the wall and appliances. Just needed some TLC.", "title": "Good location. Needs updating.", "user": "Leaudemiel", "date": "August 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 173145770}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Staff was friendly. Pool overrun with kids/families. Scared our younger kids.", "title": "Very clean", "user": "Allan B", "date": "August 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 172733515}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "It was fine for our purposes, but we probably wouldn't stay here again.", "title": "always a good place to stay", "user": "Kristina M", "date": "August 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 172521451}], "location": {"country": "United States", "city": "Mystic"}, "stars": 2, "variance": {"poor": 36, "average": 107, "very good": 213, "terrible": 28, "excellent": 122}, "aka": "Howard Johnson Mystic Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Coming to Mystic, Connecticut? We have four words for you: go happy. go hojo. Located only minutes away from the best attractions in Mystic (Exit 90 off I-95). Spacious rooms with all the amenities to make you feel at home during your travels: wireless high-speed internet, in-room safes, in-room coffee makers, hairdryers, refrigerators and microwaves. And let’s not forget the indoor heated pool! All you have to do is picked either one king size or two queen size beds. But why stay in your room when you're at Mystic Hojo? - Mystic is located only minutes away from some of the destinations best attractions: Olde Mistick Village (just across the street!), Mystic Seaport (½ mile) Mystic Aquarium ( 5 minute walk), Denison Pequotsepos Nature Center (10 minutes away) and more. In fact, many of our hotel packages include free tickets to some of these venues. And stay in touch with Hojo - Mystic year-round by liking us on Facebook or following us on Twitter!"}