{"user_rating": 3.5, "review_count": 458, "name": "Howard Johnson Hotel Carolina/San Juan", "reviews": [{"rating": 3.0, "title": "Overall okay", "text": "It's like any other Howard Johnson. The rooms are bland but comfortable. There's a fridge, tv, and hairdryer in every room.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 20, 2006", "id": 4990479}, {"rating": 3.0, "title": "Good location, reasonable rates, some improvements needed", "text": "The good:", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 14, 2006", "id": 4973301}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "It is cheaper than the other hotels nearby. (Don't stay at the cheap inns that charge you around $90-$110 a night. They look ghastly.)", "title": "What a dump!!! What hotel did the good reviews stay at???", "helpfulness": 4, "user": "joshua-bwi", "date": "April 6, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4942953}, {"rating": 1.0, "title": "The restaurant was the only good thing about this hotel.", "text": "The pool is clean.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 29, 2006", "id": 4772346}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "The rooms are't too small but don't expect a large room.", "title": "Yuck. You gotta be kidding me...", "helpfulness": 2, "user": "leahmiz", "date": "March 27, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4737308}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "It is a Howard Johnson's in a tropical climate and an expensive area, what did you expect? We paid (AAA) 130 a night (+ $20 taxes). We had room 511. Recommended for types who only want their hotel for bedtime, like being close to the beach and are realistic about the place.", "title": "some good, some so-so, what did you expect?", "helpfulness": 15, "user": "Pasqualinho", "date": "February 15, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 4462772}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The good", "title": "Great location, clean and comfortable", "helpfulness": 5, "user": "BQ74", "date": "January 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4366338}, {"rating": 4.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "1. Five minutes drive to the airport, without the airport sounds (the Courtyard (100$ more a night), Ritz and Hampton Inn (90$ more a night) all border the airport). I am sure the rooms are sound proof, but when you are outside you will hear the jets taking off.", "title": "Small cozy hotel is near everything", "helpfulness": 12, "user": "BETSY B", "date": "January 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4328940}, {"rating": 3.0, "title": "OK stay", "text": "Stayed at this hotel while attending a weddking, and for those purposes it was fine. The room was comfortable and though we were on a smoke-free floor, you could smell smoke. One small elevator to serve 9 floors. (Actually, there is an additional down the short service hall to the right of the main elevator. But the staff have tried to turn this into a srvice elevator by putting up \"repair\" signs, etc. on it. We used it in a pinch, especially at night.) Hotel staff were adequate. Restaurants were slow, even for Puerto Rico standards, but the food was quite good, especially in the 10th floor Italian restaurant -- the view alone is worth the wait!! Took us 30 minutes to get a croissant, coffee, and pre-mixed fuit salad. (One tip: Don't get the complimentary continetal breakfast; instead apply the $2.50 toward a regalar breakfast.) Pool was nice, and beach, across the street was very nice.", "helpfulness": 3, "user": "Dog-man", "date": "June 24, 2006", "id": 5379532}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "My husband and I stayed at Howard Johnson in Isla Verde in March 17-20. We were disappointed as soon as we checked in and saw our room. It was on the lobby floor which may not have been terrible except for the fact that the room was tiny, you could hear everything that was happening outside of the room and worst of all, there were no windows! It was a dark little dungeon. But for the fact that we were only staying 3 nights, I was very close to walking down the street and finding something else. We did ask to change rooms but the staff stated that everything was booked. The staff, by the way, could have been a bit more customer service oriented. They seemed to have attitudes and were not receptive to questions. The service in the hotel restaurant was terrible. The waitstaff were friendly but the service was beyond slow. They don't acknowledge you when you walk in, you have to just guess that you should pick any seat available. The tables were still dirty from prior customers and on one occasion, we waited approx. 30 minutes before anyone even came over to take our order. It was so bad that we complained to the restaurant manager and we weren't the only ones complaining. On the good side, the pool was nice and the beach is conveniently right across the street. The hotel is nicely situated on a relatively busy strip but having visited Old San Juan, I would have rather stayed nearer to there because they seemed to have a much wider and nicer selection of restaurants than where we were and our location seemed better suited for spring breakers. The bus stop to Old San Juan is across the street from the hotel and is approx. 45 mins, it costs about 50 cents. El Yunque is a must see and I would recommend renting a car a driving there as it's a relatively easy drive and was much cheaper than a tour. Our one day car rental was $27 and the visitors center at El Yunque charges about $3.", "title": "Not so great", "helpfulness": 6, "user": "Lark47", "date": "April 20, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 4991503}, {"rating": 3.0, "title": "Great Hotel, But Watch the Location!!!!", "text": "After reviewing all the info, we called the Hotel directly. Booked for the evening of Feb. 11, 2007. We actually didn't even know there was a location in Old San Juan, but certainly would not have wanted to stay there, as we were on our way out of the city the next day. We had confirmed reservations....yet had to pay almost double! Why? On some websites, the phone number for the Old San Juan location is listed for the Isla Verde Hotel! We called, they had a room, and we didn't know there were 2 locations, so we didn't think to ask! Fortunately this location had a room, but they did not believe that the phone number problem was their mistake, so we had to pay the difference. I'm not sure who has caused the problem, but, even here on TripAdvisor, when you hit the bars for info on the Isla Verde HoJo Hotel, you get info on the Old San Juan Hotel.", "helpfulness": 2, "user": "LADB", "date": "February 21, 2007", "id": 6822865}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Room was OK, a bit shabby but as expected. Pool was beautiful. You get a Continental Breakfast, but....if you choose from the menu, you only get $2.00 off your meal. And you then have to pay for your coffee, which would have been part of the free breakfast!", "title": "Excellent service-Howard Johnson-Isle Verde-Carolina PR", "helpfulness": 5, "user": "shell43", "date": "February 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6796216, "likes": {"liked": "— Location", "disliked": "— No outside sitting area after the pool closes at 7pm"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "I can not say enough about the staff at this hotel. They were all wonderful and treated us like gold. Staff made several phone calls for me attempting to set up a fishing charter, called the rental car(Budget)for me, to cancel since they are no longer located at the hotel. Chose 'Charlies car rental' a couple blocks away, instead, cost for 3 days car rental including taxes was 100.00. Night Mgr. Hector Camacho could not have been nicer and has a great crew. The hotel is very clean. The pool was great and never crowded. Located across the street from a gorgeous beach, where chair rentals are 4.00 a day from a gentleman on the beach. Dont understand the complaints about the continental breakfast. You get what you pay for. Included in your stay - Coffee and danish or croissant each morning, or 2.50 toward your breakfast. Restaurant service is slow, yes, but so is everything else in the carribean. We got ours to go, and we were off. Happy hour daily from 6-10pm---3.00 drinks excluding Chevis and Johnnie Walker. Excellent cheap places to eat a few doors down, as well as a Walgreens in walking distance. Charlies car rental a couple blocks away. I would recommend this hotel. It isnt the Marriott, but then again, we werent going to waste our cash on a fancy place ,that we would not be in, but to sleep and shower. Had a rental car for 3 days and we were never charged the parking fee-pleasant surprise.", "title": "Good value", "helpfulness": 7, "user": "bandora", "date": "December 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6334328, "likes": {"liked": "— Cleanliness, comfort, location", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I just wanted a clean a safe room for a weekend trip in San Juan. This hotel delivered that.", "title": "Not bad for the price in Isla Verde area!", "helpfulness": 9, "user": "Nevr2ez", "date": "September 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5882095, "likes": {"liked": "— The location, the price and the staff!", "disliked": "— The free breakfast at the top floor restaurant!"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Second time staying at this hotel. This time my room smelled old and musky, the bathroom was small and you have to pay $7.oo dollars for parking per day. Overall the hotel is OK! It is located across the street from some private apartment building but there is a small pathway that is open to the public so you can go to the beach. The big expensive hotels are within minutes by car. Will not recomend to walk too late at night there is a Irish pub / niteclub that plays hip hop that is not considered safe by the locals even though it is always full and has long lines to get in so it is better to drive, park inside the nicer hotels. DO not do valet the casinos would not over it. This hotel (HJ) is very close to the airport (about 5 minutes drive) but you will still need to be at the airport atleast 3 hours before the flight because even though the natives/locals are extremely nice - the ones at the airport are not. They are disorganized and slow. Make sure you check your bags through the agriculture machine before you even do the line to check in with your airline. Overall, the hotel is Ok for the price compare to the others around that area.", "title": "The Howard Johnson in Isla Verde was OK...", "user": "yessy", "date": "June 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 7752408, "likes": {"liked": "— Location", "disliked": "— the A/c made a weird noise made it hard to sleep"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at the HoJo for one night because we needed a hotel close to the airport. I figured that HoJo would be a safe bet because it's a chain which I thought would have consistent standards of cleanliness. I was wrong.", "title": "Run-down HoJo", "helpfulness": 2, "user": "hardychica", "date": "May 21, 2007", "detail_rating": {"cleanliness": 2.0, "front_desk": 1.0, "location": 3.0, "value": 2.0, "rooms": 2.0}, "id": 7668790}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "First off, when we arrived at the hotel on Saturday evening, there was one man working the front desk and phones. Four people were waiting in line to check in and it took him a good 45 minutes to get through that group of people. The whole time he's answering phones and trying to check people in, his manager is just standing there watching him instead of jumping in and helping.", "title": "Excellent Stay at the HOJO", "helpfulness": 2, "user": "KO75", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7565113, "likes": {"liked": "— Service and Value", "disliked": "— Pool could have been warmer"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "When we finally got our keys the hotel elevators took FOREVER. I mean it was crazy how long you would wait to get into one of those death traps. Unfortunately, the room didn't get much better than that. The hotel is definitely a late 70's/early 80's building that is desperate need of a renovation. I can tolerate ugly decor, but the rooms just were dirty. There were major rust stains all in the shower, the carpet was dirty and it just looked like a lot of band-aid repairs were done to fix problems. Like if you looked at the corners of the bathtubs and sinks you could see large chunks of miscolored caulking added to fix problems. Also, the bathroom was really dark with this one spooky flourescent light that made you feel like you were in the Bates motel.", "title": "We had a good time.", "helpfulness": 5, "user": "Jerseyboy27", "date": "March 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7230831, "likes": {"liked": "— Beach was across the street", "disliked": "— The restaurant is HORRIBLE"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Breakfast wasn't much better. They give you complimentary continental breakfast coupons when you check in. You eat on the top level of the hotel where I thought there would just be a little buffet table with some danishes and milk. But, you sit down, restaurant style and are given a breakfast menu. Just remember that this is not included in the free continental breakfast. Those meals cost more, however you can use your free vouchers for $2 off one of those other breakfast entrees.", "title": "Bad Mojo in HoJo", "helpfulness": 1, "user": "SeattleRican", "date": "February 28, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 6892046, "likes": {"liked": "— Near Beach", "disliked": "— Everything Else"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "2. Right across from the beach (although there are apartments blocking much of the view). The Hampton Inn (which does have a nicer setting), Embassy and the Holiday Inn are a couple of blocks away.", "title": "We weren't dissappointed!", "helpfulness": 9, "user": "LollyCanuck", "date": "December 22, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 4280153}, {"rating": 4.0, "title": "Great Little Hotel in the Middle of Everythingl!!!", "text": "This is a nice, curteous and clean hotel, and conveniently located, too. Old San Juan is just a bus ride away (25 cents) which, you can catch right across the street from the hotel. If you wanna go to the largest and most luxurious shopping mall in the Caribbean, Plaza las Americas, just walk outside the Hotel and catch the bus on the same side of the street!!! The discos and casinos are right there, too. Just ask anyone for directions. Oh, and, a short walk down the street is an internet cafe... $3 for about 20 mts. on the internet! And, a little further down the street, there's a great little restaurant with great food, for about $6 - $10 a meal.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 27, 2005", "id": 4055381}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "I stayed at the HoJo this past week in Isla Verde and I have to say I was pleasantly surprised. Reading the reviews here scared me a bit but I decided to stay there anyway. I stayed there for 4 nights and I had a great time. The hotel was clean, the staff was very friendly and gave me pleanty of advice on how to get to different sites (especially the front desk clerk Maribel, she was very helpful). The room was quite comfortable, it had a king size bed, cable TV (which included channels from NYC and other American cities), a refrigerator, hairdryer, iron/ironing board, desk. I stayed on the 8th floor so I did not really here too much noise at night like some of the other guests complained about in these reviews. The pool area was clean and well kept, although the water in the pool was very cold. The fitness was not great at all, it probably had 4 different machines in there (treadmill, bike, and some weights).", "title": "Very good for the price you pay!", "helpfulness": 12, "user": "Dee78", "date": "April 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3346166}, {"rating": 1.0, "title": "Do not stay here", "text": "The hotel was located in a great spot, it was right accross the street from the beach which some of the other hotels are not (like the Embassy Suites, the Hampton Inn & the Holiday Inn). The hotel was also located near a food mall which included some of the common fast food restaurants (BK, Taco Bell, KFC, Pizza Hut) and also a few local restaurants (PR restaurant, Chinese and a Mexican restaurant). I have to say though I was very dissapointed that I did not find too many restaurants serving typical PR food. It was also close to a Walgreen's, two banks, a supermarket and a CyberNet Cafe. The hotel also offers several tours, I took the one for El Yunque and had a great time.", "helpfulness": 6, "user": "SZ", "date": "March 24, 2005", "id": 3299237}, {"rating": 3.0, "title": "Good for pre night cruise", "text": "I was able to take public transportation to Old San Juan. I took the bus right accross the street from the HoJo, it cost .25 cents and it was about a 45 minute ride. The bus drops you off at the bus terminal in Old San Juan, right accross the street from the Sheraton Hotel.", "helpfulness": 11, "user": "liz1992", "date": "February 26, 2005", "id": 3232547}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "We stayed here one night at the end of our trip simply to have a convenient location to the airport because we had to return a rental car and depart early. The pipes were so noisy we could not sleep at all. If that had not kept us awake, the young people partying nonstop in the hall would have. They were still going at it when we departed at 6am. The prices for drinks on the top floor bar were outrageous. The view isn't much, nor is the bar. We paid less at El Convento. There were additional charges on our bill that I did not understand but I was too sleepy and disoriented at checkout to raise a fuss. I complained mightly in their online survey that was sent to me but have never had a response. The amount of coffee put in the room was half what you receive anywhere else. I guess that was the continental breakfast. There were such incredible waits for the elevator that I was convinced someone was always holding it at some floor.", "title": "Stay 1/30, Then 2/11 to 2/13", "helpfulness": 13, "user": "ekar", "date": "February 23, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 3223102}, {"rating": 4.0, "title": "Excellent hotel for Business Travelers", "text": "We stayed 1 night pre cruise, January. The location was good to get to the cruise port and the price was right. $105.00. 10 minute ride from airport and cruiseport. Check in was quick. No frills hotel. Lobby okay. Coffee in room, frig, hairdryer, iron if needed, ice machine on all floors. I wouldn't recommend more than 1 night here, no way. Could be alot cleaner, but was acceptable. I like spic and span clean. Rooms were just so. Alot of noise heard thru the windows at night as there is a Burger King on the opposite street with a drive thru. The pool area was nice. Restaurant on premises. (looked okay)There's a 7-11 type store next door for drinks & snacks. There is a great oceanfront bar directly across the street. My recommendation is stay her 1 night pre cruise only, check in and then go out across the street for a cocktail or two, walk on the beach, walk into town to one of the best PR restaurants in the strip mall about 10 blocks to the right upon hotel exit. Retire early after a satisfying meal to rest up for the cruise. Check out around 10:30 am and head for the cruise port. Notes: You can see the Water Club hotel when walkiing at night, look for the blue lights. Last chance to get spirits for the cruise is at the cruise port across the street and to the left from Royal Caribbean within the cruiseport complex, Ask the taxi driver. It's easier to pack your bottles in luggage and bring onboard then it is to buy in the ports.", "helpfulness": 9, "user": "bobgnc", "date": "January 31, 2005", "id": 3101082}], "location": {"country": "Caribbean"}, "stars": 2.5, "variance": {"poor": 56, "average": 110, "very good": 138, "terrible": 45, "excellent": 109}, "aka": "Howard Johnson Carolina", "slim_ranking": 0.714285714286}