{"user_rating": 2.0, "review_count": 125, "name": "Howard Johnson Downtown/Opryland", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Having read the earlier reports, I was a little nervous, but my experience proved otherwise.", "title": "Tired property in busy location but clean and good value", "helpfulness": 1, "user": "Aztec_Tripper", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 2.0, "rooms": 4.0}, "id": 15825845, "likes": {"liked": "— Clean, helpful staff, great value", "disliked": "— Busy roadside location"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "First, the downsides: this is an older building that has seen better days. It is located beside a derelict drive thru, on an EXTREMELY busy roadside, with a 4 lane road outside, and beyond that less than 100 yards away is the freeway. The fixtures are very dated, and look distinctly 60s. My door handle was a bit wobbly. Pool looked nice, but who wants to bathe 10 yards from a 4 lane highway?", "title": "If you value your life don't stay here.", "helpfulness": 2, "user": "mcclure2", "date": "May 1, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 15551615, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "However, on the positive side: management appears to be doing its best to keep the place smart, and Christal on Front Desk was very obliging in finding me a room on the back side of the building. This looked out over a disused nightclub (thank goodness it IS disused.) The rooms are VERY spacious, and have a safe, hairdryer and iron, and complimentary newspaper.", "title": "Night on the Twilight Zone.", "helpfulness": 1, "user": "antq", "date": "November 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 10956472}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Within 10 minutes I discovered water - or something - leaking through my ceiling and splashing onto the basin surround and coffee machine. Front desk quickly despatched Mr Fixit (whom I followed upstairs, as I wanted to see what was coming through into my room). Occupants of room above had managed to block their toilet, and were most apologetic. Mr Fixit asked Front Desk to move me to another room (to my relief) and within 5 minutes I was happily unpacking in my new, dry room, which also had the added benefit of fridge and microwave. I give a lot of credit to management when they address a problem quickly and effectively, particularly when the problem has been caused by their guests!", "title": "Avoid this HOJO like the plague", "helpfulness": 1, "user": "Regret_Reservations", "date": "July 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 1.0}, "id": 8065552, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "No other probs: room was clean, night was not too noisy considering location, complimentary breakfast was good, and at under $50 including tax, this has to be very good value.", "title": "Was Very Pleasant", "helpfulness": 1, "user": "tennesseejim", "date": "July 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 5461220}, {"rating": 1.0, "stay_parameters": "Stayed June 2006", "text": "This was our first trip to Nashville, and we wanted to stay cheap b/c it was the week of CMA Fest, so we decided to try Super 8 on Brick Church Pike. What a MISTAKE!", "title": "Run as fast as you can away from this place (and the roaches!)", "helpfulness": 3, "user": "LadyAdmiral99", "date": "June 30, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5414068}, {"rating": 2.0, "title": "Cheap but sad", "text": "We were so tired, we were asleep the first night and didn't notice anything about our room. However, the second night, we were in for a suprise. When my friend took a shower, not only was she getting the water from the shower head, but ALSO from the vent above in the ceiling was leaking water from the room above us. Perhaps it was clean water, or maybe the person's dirty bath water above us...I guess we'll never know and don't really care to.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 6, 2006", "id": 4588654}, {"rating": 2.0, "title": "Cheap hotel for budget minded, but not very clean", "text": "When we were ready to go to bed (had only been in the room 30 min that day) we noticed roaches running around on the carpet, along with some other type of fast insect we couldn't identify. Being girls, we weren't about to spend the night with roaches crawling on us, so we killed all of the bugs we could find within 10 minutes and took them downstairs to management in a cup. We were given money back from 1 night, but not for that evening, even though we didn't sleep there.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 27, 2005", "id": 4066653}], "location": {"country": "United States", "city": "Nashville"}, "stars": 2, "variance": {"poor": 21, "average": 32, "very good": 13, "terrible": 56, "excellent": 3}, "aka": "Howard Johnson Downtown/Opryland Hotel", "slim_ranking": 0.831081081081}