{"user_rating": 4.5, "review_count": 2974, "name": "Hoxton Hotel", "reviews": [{"rating": 4.0, "title": "Nice hotel, not all that great of location", "text": "This hotel was very nice. It had a great restaurant and \"breakfast\" was served daily, fruit, juice and yogurt. The staff was very nice and helpful. Directions to the hotel were very easy to follow from the website. The location isn’t all that great, a little sketchy to walk at night. Restaurants around the hotel were also very good. I would totally recommend this to my friends!", "user": "MESchlegel3", "date": "February 14, 2008", "id": 13561436}, {"rating": 4.0, "title": "Funky and Fun but a couple of niggles....", "text": "Our stay at The Hoxton was one of my Christmas Presents and having read various reviews about it was looking forward to my stay.", "user": "buntyt33", "date": "February 13, 2008", "id": 13529398}, {"rating": 4.0, "title": "Great modern hotel", "text": "The hotel is 5 minutes walk from Old Street Tube Station (Closed at weekends) and 10 minutes from Liverpool Street.", "user": "wee_stephy_baby", "date": "February 11, 2008", "id": 13471263}, {"rating": 5.0, "title": "The best value in London !", "text": "The foyer is welcoming and funky with some stylish touches. The bar/grille was always busy though we ate elsewhere.A very cheery and helpful member of staff checked us in and within 5 minutes we were in our room. Unfortunately the bed etc was unmade so after a brief visit back to reception we secured a room on the fourth floor;which we were told was quiter, but more of that later.", "user": "hemdale", "date": "February 9, 2008", "id": 13406494}, {"rating": 3.0, "title": "Great Value", "text": "The room was very clean with lots of nice touches; plenty of glasswear, corkscrew, bottles of water and even fresh milk for your beverage of choice. Though there was a hairdryer there was no iron and board - they are on the 6th floor. so at busy times get there early! There is also a safe which will take a small laptop.", "user": "TOCCork", "date": "February 6, 2008", "id": 13317803}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "Stayed on a Saturday night on a weekend to London. Hotel is excellently located just 3 stops direct from Euston so really easy to get to. For £99 we had a spacious and modern room with lots of good facilities in this modern and cool hotel. That's the best value I've had in central London for years! The hotel is also ideally located for excellent Hoxton/Shoreditch bars and restaurants and has its own busy bar and grill inside. Being a Saturday night it was a tiny bit noisy as we were on the first floor, but the bed was so comfy we were out like lights!", "title": "Great value and excellent location", "user": "MazCA", "date": "January 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123223842}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Really enjoyed this place, the staff, the facilities the care and attention to detail that had been given was quite extraordinary. We would (will be) staying again. A wonderful experience for our stop over.", "title": "Amazing", "user": "rubio52", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123206181}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "A lively hotel full of positive energy with enthusiastic welcoming staff eager to please. The room is peaceful, comfortable and quiet with a relaxed feel. Have stayed previously and would certainly stay again.", "title": "Maggie A", "helpfulness": 2, "user": "Maggie A", "date": "January 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123199622}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Unfortunately unable to get hot water in the washbasin after 5pm also an unusual drain smell on immediate entry to the room near bathroom but not in the main bedroom. Would not have complained as I felt sure this was a once off and did not detract from our stay but perhaps needs checking out.", "title": "As all hotels should be!", "user": "Reemkay", "date": "January 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 123150597}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "7 minutes from Euston staton by tube, on the east side of London, I would never stay anywhere else! And even though We had to commute 30 minutes by tube to meet up with friends in the west end, it was worth the commute.", "title": "Hotel with a difference", "user": "Andy P", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123146541}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "I have stayed in this hotel about 3 or 4 time before and will stay there again at the end of this month. I am and out of the country a bit because of my work and when I return home for a break I spend a night or two in this hotel as in my home turf in London - Hoxton.", "title": "Hip Hotel in Happening Hoxton", "user": "OluOlu", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108210240}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I can't really fault the hotel! The reception staff are laid back but at the same time friendly and attentive. The Hotel interior is modern but with some tradition touches like the exposed brickwork in the foyer seating area or the huge fire place which is a warm welcome in the winter.", "title": "One of London's finest hotels.", "user": "flamingogirl67", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108114662}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The rooms are bright, clean and hip with all the usual creature comforts. Wired and Wi-fi internet is free!!! I basically never want to eave them room once I have settled in.", "title": "What a great experience", "user": "silverhairedtravelle", "date": "May 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108100149}, {"rating": 4.0, "stay_parameters": "Stayed January 2011", "text": "The also have a great restaurant on the ground which is how, actually I came to discover this hotel in the first place.", "title": "Love the Hoxton hotel", "helpfulness": 2, "user": "dancingqueenuk", "date": "May 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 107927647}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "As I have mentioned before it is my home turf so I am pretty familiar with the area as I go clubbing in Shoreditch and have been to many of excellent restaurants in the areas especially in Hoxton Square (Home, just around the corner is my favourite). The are also quite a few of nice trendy shops in the area for those fashionistas.", "title": "Something rare - a warm, friendly business traveller atmosphere", "user": "eirikvjohnsen", "date": "May 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 107926947}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Myself and my husband just stayed at the Hoxton for 3 nights (Friday to Monday). We paid just over £70 a night for a double room and the rate included a 'Pret Lite Breakfast' which was delivered to the room each morning.", "title": "Great Hotel", "helpfulness": 7, "user": "LJLD", "date": "February 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 6785775}, {"rating": 4.0, "title": "Great Business Hotel", "text": "The area between the tube station and the hotel is fairly run down and a bit dirty (although the area immediatly beyond the hotel is nicer and full of bars and restaurants).", "helpfulness": 4, "user": "EdinburghScotsman", "date": "February 7, 2007", "id": 6752546}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The hotel itself lived up to all of the claims made on it's website the pictures available on the hotel website did actually reflect the room which we stayed in.", "title": "all in all a good stay!", "helpfulness": 8, "user": "dave.f999", "date": "February 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6750352, "likes": {"liked": "— the price and comfort of the rooms, proximity to good restaurants", "disliked": "— internet problems and erratic housekeeping"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "The whole hotel was spotlessly clean and the staff were all polite as well.", "title": "Very chic & stylish", "helpfulness": 2, "user": "NorthWalesNudger", "date": "February 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6748551, "likes": {"liked": "— High standard of the rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We ate breakfast in the 'Grille' restaurant one morning and had dinner in the restaurant on another night of our stay and on both occasions the food and the service was good even though the restaurant was busy.", "title": "Faultless", "user": "Mark-choosy-chappy", "date": "February 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6737747, "likes": {"liked": "— Relaxing environment", "disliked": "— When I had to go home........."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "We stayed at the Hoxton for week at the end of April for a family wedding and loved our stay. The lounge is fun and although I only ate in the restaurant once it was quite nice. Our rooms were fun and clean and there was a clever use of space that I appreciate. The breakfast bags are brilliant! The beds are very comfortable. I loved the area and would recommend this hotel without hesitation.", "title": "Love the Hoxton", "user": "asage", "date": "May 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 107920216}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This hotel really opened my eyes to a new way to visit London, i'll never stay central again, this place is a gem, service was great, free wifi was great, macs in the lobby were a nice touch, great courtyard eating/drinking area, Hoxton Grill was fab, good value and great food, funny and enthusiastic waiting staff.. for the money £89 on a sunday, i can't think of any other place i'd rather stay, would happily pay 150 a night to stay here. The rooms are small, but they are modern, funky and have all the essentials plus a little more, bed is comfortable fridge is cold aircon works, perfectly situated for the nightlife of Shoreditch etc, which was so much fun i'd never bother venturing back to the usual central places again!", "title": "What a fantastic hotel.", "helpfulness": 1, "user": "marksw", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 107872722}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My only gripe would be the room we had was facing the back, not an issue for the money, however there was a lot of noise coming from workers at the building opposite, this could easily be avoided by getting an interior facing room.", "title": "Friendly, trendy, stylish and with a touch of humour", "user": "Netream", "date": "May 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 107775735}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Also free parking on Sundays in the bays outside!", "title": "Great Hotel in a Fun Neighbourhood", "user": "TorontoLeesar", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107734063}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The hotel is very stylish, clean, and staff is very friendly. Having a restaurant downstairs is a big bonus. Breakfast in the restaurant is excellent. Breakfast in a paper bag is genius (though I used it as lunch). I love the touch of humour, like the stupid and boring signs. The huge lobby is great!", "title": "My daughter and I had a great time.", "user": "C_Peralta", "date": "May 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 107668495}, {"rating": 5.0, "title": "Brilliant as always", "text": "I can't say enough good things about this hotel. This is the second time I've stayed at the Hoxton and it was just as great as the first trip.", "user": "FloggerLiverpool", "date": "January 23, 2008", "id": 12919434}, {"rating": 5.0, "title": "The best hotel I've stayed at - anywhere!", "text": "Friendly staff, cool decor, and the bed (and bedding!) are so incredibly comfortable! Very clean rooms. I love the little touches here - the bottle of water in the fridge, the fresh milk for the filter-bag coffee and the breakfast bags.", "user": "Scootagal", "date": "January 23, 2008", "id": 12915510}, {"rating": 4.0, "title": "Excellent area, and great value if you're lucky!", "text": "Keep an eye out on their site for their deals. I stayed two nights for £80 which is such great value for money.", "user": "RachelEastLondon", "date": "January 21, 2008", "id": 12837418}, {"rating": 2.0, "title": "very nice rooms pricey though, restaurant could be better.", "text": "The Hoxton is, in my opinion, the best hotel I’ve ever stayed in! A combination of getting a fantastic price from Superbreak, coupled with a quirky, innovative non-pretentious but very fab hotel made this birthday trip one to remember!", "user": "NajEssex", "date": "January 20, 2008", "id": 12811630}, {"rating": 4.0, "title": "Surely the best value hotel in Central London", "text": "The hotel is situated a few minutes walk from Old Street Station and doesn’t look that interesting from the outside. However, on entering the lobby, you are transported into a mad mix of Scottish baronial, ultra modern and quite a bit kitsch! Giant papier mache eagles in varying states of flight soar above head (sounds tacky but isn’t!) and you’re surrounded by a variety of comfy sofas and designer chairs at either end of the lobby with a roaring fire on each end to top it all off.", "user": "hrs", "date": "January 19, 2008", "id": 12792651}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This was our second time at the Hoxton and it has been as good as the first time. Great value, great location and excellent service", "title": "Excellent", "user": "EGP1973", "date": "January 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123266980}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Great location for the City and trendy bars of Shoreditch this hotel is super clean and comfortable with all the mod cons you need for a pleasant stay. Good food and fast room service at any time. Given it's location it's also very quiet making for a sound night's sleep.", "title": "Super comfy in a great location", "user": "PhillipaFog", "date": "January 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123258380}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Toothbrush and paste and shaving kits can be purchased at a cost of £1 each.", "title": "Great hotel!", "user": "Kate N", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123256237}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Great hotel! The modern executive surroundings and decor make you feel like you are staying in a luxurious place with all of the amenities. I book at this hotel all the time when in London and the staff there are extremely polite, helpful, and eager to please. The bar and restaurant also provide really good service too, but if you feel like adventuring outside of the hotel there is plenty nearby as well. If looking for a place to stay, look no further... you have arrived at your ideal destination with The Hoxton!", "title": "Goodnight.", "user": "beachkandi", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 123251877}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "I've stayed at the Hoxton a number of times and it's always my hotel of choice when in London. Relaxed atmosphere, helpful & friendly staff and great room.", "title": "A fabulous find!", "user": "JamesRMc", "date": "January 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 123243147}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "This is one of the nicest hotels I've stayed in. As mentioned in other reviews the hotel has a very contemporary feel, and has really thought out-of-the-box about what guests want from a night's stay. The shower and bathroom was one of the nicest I've had in a hotel, and the Pret light breakfast really hit the spot - who really wants a full fry up every morning any way!", "title": "A really great London hotel", "user": "Stuart34", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 19102754}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Above that I was really impressed by the resonable prices at the bar and grill. The staff were superb and really friendly. They seemed to really care that we had chosen to stay there. I would highly recommend this hotel, and wouldn't be surprised if it made its way higher up the TripAdvisor list.", "title": "Sign up for the email deals.....what a deal", "helpfulness": 1, "user": "ascouse", "date": "August 18, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "value": 5.0, "rooms": 5.0}, "id": 19068159, "likes": {"liked": "— The price of the room, cleanliness", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Sign up for the emails and you get advance warning of their rooms sales.", "title": "A little gem", "user": "hotelfanLondon", "date": "August 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19067583}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "I tried, but was unsucessul at their £1 rooms so booked on their £29 specials.", "title": "best hotel bathroom ever!", "user": "GarryBNorfolk", "date": "August 16, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 3.0, "value": 5.0, "rooms": 5.0}, "id": 19017834, "likes": {"liked": "— the bathroom", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Boy, what a great surprise, a great hotel, even if we hadn't have gotten the deal we did it's a great hotel. Clean clean rooms. Great friendly informal polite staff. Rooms full of the stuff you need and none of the stuff you don't. I wish all rooms were like this.", "title": "Amazing hotel. Why is it so cheap?!", "helpfulness": 2, "user": "moaksey", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18334699, "likes": {"liked": "— The cost vs quality ratio", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Stayed at the Hoxton Hotel on a Friday night in April 2007. Very welcoming staff on the reception desk. Room small but very well decorated and equipped. Bathroom had no bath, but shower was excellent. Great idea to have free water and fresh milk in the fridge. Good to see a safe in the room too. Particularly liked the idea of having a bottle opener in the room and a guide to bars and restaurants in the surrounding area.", "title": "Excellent value hotel", "helpfulness": 1, "user": "Claire G", "date": "April 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7417620, "likes": {"liked": "— Not feeling ripped off", "disliked": "— Lack of bath"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Unfortunately was not able to sample the hotel's food and drink facilities since I had to meet friends in a different part of London, but I will definitely be back to spend more time in this fantastic hotel.", "title": "Excellent value!!", "helpfulness": 2, "user": "*missnUK*", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7379156, "likes": {"liked": "— The spacious shower!!", "disliked": "— If I had to pick, I guess the immediate surrounding location."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We booked this hotel as a last mintue break in Central London expecting to pay a lot but this hotel offers exceptional value. Our room cost just £59 on the hotels website - This price included a Pret-A-Manger lite breakfast for 2, 2 bottles of mineral water and fresh milk in our mini-fridge, all for free! Free WI-FI access in your room is also an excellent plus as we take our laptop everywhere with us. If you don't have a laptop the hotel also offers a free internet service in the reception area, there are 4 PC's so you are guaranteed that at least 1 will always be free.", "title": "Excellent Hotel", "helpfulness": 3, "user": "CaptDad42", "date": "April 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7351584}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The rooms have the luxury you would expect to be paying £150+ for in Central London. Flat-screen T.V, comfy bed, sofa, desk, hairdryer, mini-fridge and safe. The best part for me, however was the bathroom, particularly the shower which was wonderfully spacious! The rooms and bathrooms are very clean and luxurious looking.", "title": "Fantastic hotel!", "helpfulness": 5, "user": "bryzee86", "date": "April 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7351308, "likes": {"liked": "— free breakfast, comfy, clean, good value, free internet. Pretty much everything.", "disliked": "— Pretty much nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "As with all the others reviews below, we found the staff to be very helpful and polite and we had a quick and easy check-in and check-out.", "title": "Fantastic boutique hotel", "helpfulness": 3, "user": "fazbek", "date": "April 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7338328, "likes": {"disliked": "— Having to get up so early from such a comfy bed"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "Stayed at the Hoxton with a friend for a weekend jaunt to London and absolutely loved the hotel. The decor is very hip and modern without being pretentious. And the prices can't be beat. Our room was decently sized with a very nice, clean bathroom - the shower was to die for (great water volume, pressure, and temperature). I also loved the hotel's philosophy of not nickel and diming you - you aren't charged extra for breakfast, internet access, bottled water, etc. The location of the hotel is not in a conventional tourist area, so if you need to be within walking distance of popular London tourist sights, then this hotel is not for you. But with the Old Street tube stop just a few blocks away, it really is not hard to get to other areas in London quickly.", "title": "Hooray for the Hoxton", "helpfulness": 5, "user": "aller et retour", "date": "March 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7187272, "likes": {"liked": "— Decor, Shower, Price"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We stayed at the Hoxton for £29 (just missing out on the £1 rooms) the Hoxton has a great location 5 minutes from Liverpool Street station, it has a modern lobby , lively bar and excellent restaurant. Our room was spotlessly clean the bathroom had a massive shower,with full sized soap. The room had dark wood furniture , leather headboards and sofa, flat screen TV , free water and fresh milk, all very trendy.", "title": "The Best Value Hotel In London", "helpfulness": 2, "user": "T&LEssex", "date": "March 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7014874}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My boyfriend and I stayed at the Hoxton for two nights last month and LOVED it! The rooms were stylish and comfortable, and the shower was heaven. Even though it seems like a small thing, I really appreciated the free water and milk in the fridge. The hotel provided good tea and coffee, unlike a lot of other places who give you the cheap stuff. We encountered a little bit of noise coming from people outside the hotel (our window was open), but we were so worn out from sightseeing that it really didn't bother us.", "title": "Great hotel- others could learn from the Hoxton!", "helpfulness": 2, "user": "Penguin07", "date": "March 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 7008992, "likes": {"liked": "— Clean, stylish, not a rip off!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "A room here cost us only 10 pounds more than a lot of the fleabag tourist hotels in London. Maybe the Hoxton will raise the bar? I will stay here again without hesitation.", "title": "Fantastic Hotel and a Great Price...", "helpfulness": 2, "user": "MRDuddy", "date": "March 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 6926306, "likes": {"liked": "— Very Stylish...", "disliked": "— Lack of clothes storage in rooms..."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Budget doesn't have to be boring is The Hoxton's philosophy, with its clean contemporary designs and high quality finishes. It opened in September 2006 to rave reviews and has been booked out ever since. The hotel is owned and run by Sinclair Beecham, the founder of Pret A Manger.", "title": "Absolutely Fabulous dahling", "helpfulness": 2, "user": "ChaiT_mmmm", "date": "March 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 6917783, "likes": {"liked": "— Gorgeousness", "disliked": "— Noise from the courtyard"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "this is our third visit to the hotel, and we love it!", "title": "The Hoxton Hotel - Great Eastern Road", "user": "Boutain", "date": "May 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 108438824}, {"rating": 5.0, "title": "Good value contemporary hotel", "text": "woudl highly recommend this hotel, its so painfully central to everything we love doing its great!", "user": "Sarah751", "date": "May 15, 2011", "id": 108359421}, {"rating": 4.0, "title": "Night in London", "text": "if you book enough in advance you can get a double room for around £90 which in London is unheard of, but if you think the low price affects the cutsomer service you'd be very wrong indeed, the staff are super helpful and the service is great, a definite recommendation, it wont be long before we're staying there again", "user": "UKOzEire", "date": "May 15, 2011", "id": 108301748}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "M :)", "title": "Great place to stay, everything you need for a night away", "user": "JoeBaines", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 108280392}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed at the Hoxton for 1 night after spending the night in the Hoxton Bar - which is very lively with yummy canapes!!", "title": "Excellent hotel and great location", "user": "kellyMI", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108222990}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "My 91 year old Dad and I stayed 4 nights at the Hoxton in March. We asked for a quiet room and they were most helpful in placing us on the top floor. The room was clean, bed comfortable, and the room was bigger than a typical London hotel room. The bathroom and shower were terrific. My son lives about 5 minutes from the hotel so it was also very convenient (easy to get cabs). The front desk was staffed by warm, helpful, and friendly employees. The price was also excellent (but the prices vary greatly depending on when you book). We really enjoyed our stay and would definitely stay there again.", "title": "Nice stay at the Hoxton", "user": "Georgespicer", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 108629052}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "When we arrived i thought we might be a little old , \" i'm mid fiftys\" , but from the moment we walked in to reception we were made to feel most welcome, Great rooms, a lovely meal in the Hoxton Grill, and truly excellent service from all the staff .", "title": "great rooms,great food, brilliant staff", "helpfulness": 1, "user": "RWHLiverpool", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108605505}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "We will be back !!!", "title": "Great Hotel, great staff, great place to stay.", "user": "Jue14", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108594057}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "I stayed here on 13th for my birthday, whilst visiting my son in London. The room was at the back of Hotel, on 5th floor, with a great view of London. There were two birthday balloons in my room on arrival which was a lovely surprise and thought. The bed was so comfortable and linen soft and white and clean.The staff were so friendly and could not do enough for me. I loved it and would certainly stay there again and would recommend it to everyone. It is an excellent Hotel. Julie.", "title": "Fantastic", "user": "Gumblina", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108494958}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "A great place to stay and dine.", "title": "Excellent hotel -- resourceful staff and comfortable rooms", "user": "ttraveller", "date": "May 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108483474}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "My partner and I traveled to London in early January to visit family and friends, and to take a bit of a vacation. In between visiting friends and family, we decided to treat ourselves and to stay for 2 nights in London for a bit of sight-seeing and relaxation. We chose to stay in the Shoreditch area of London (near Brick Lane) as based on what we read beforehand, this neighborhood sounded all hip and trendy - and chose to stay at the Hoxton Hotel for these 2 nights, mainly due to the price. The hotel was relatively inexpensive at 150 pounds per night. I know that the conversion rate did not work in our favor (USD) but it was still cheaper compared to other London hotel options. When we arrived, we were surprised at how cool and hip the hotel lobby was. The lobby looked like a lodge with big comfortable couches and chairs - and was quite large - with a bar and restaurant off to one end. The room was average sized - probably as big as any other hotel. The bed was wickedly comfortable, and the the room was quite quiet. Fantastic bathroom and shower. For the price, we were happily and pleasantly surprised.", "title": "Inexpensive, trendy, comfortable and fantastic neighborhood", "user": "bbjj0827", "date": "January 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123462014}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The neighborhood was indeed awesome. Fantastic shopping and eating - we could barely leave the neighborhood to explore other parts of the city. We truly ate well and shop to our hearts content in this area. Amazing graffiti as well (check out photos). I would absolutely return - and will absolutely stay at this hotel again without a doubt.", "title": "Hoxton Hotel", "user": "Livo1978", "date": "January 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 123441555}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Great Hotel - would definitely recommend - cool venue - great restaurant/bar (Hoxton Grill) - good/sylish rooms.........Very Good!", "title": "Another Great Review", "user": "buddhaauthor", "date": "January 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123422083}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Small rooms? Are people joking? Have they never traveled outside The States? I was startled by the size of our room and it was just a standard double. Plus an enormous and fab looking bathroom. Our daughter loved her cot, but could easily have slept in the bed with my wife and I (she's seven).", "title": "Comfortable stay close to the city", "user": "martythesparky", "date": "January 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123390918}, {"rating": 5.0, "title": "Our \"go to\" hotel in London", "text": "View from the window: Banksy street art. That says something pretty cool about Hoxton (and The Hoxton). Minimal but fun breakfast. Nice reception/bar/fireplace scene. Well-priced beverages to take to your room (but there was an off-license right around the corner). Cool walking and shops in the hood. Great experience.", "user": "A TripAdvisor user", "date": "January 21, 2012", "id": 123385972}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Aside from the stylish rooms, the design features and the contemporary feel of the whole place, there is a pleasant attitude that pervades here that makes a big difference.", "title": "Smart nice rooms, great little touches", "helpfulness": 1, "user": "paulieuk", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 17345564, "likes": {"liked": "— Great attitude and modern trendy design", "disliked": "— No iron in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Front desk staff were faultless throughout, and in the lobby lounges, the bar, the internet area and all around, the design and style is both homely and inspired.", "title": "flawless", "user": "rocks8", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17328732, "likes": {"liked": "— style", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The rooms themselves are functional yet attractive and stylish. The bathroom was lovely, and the shower enjoyable and strong.", "title": "Fantasic Hotel", "user": "Rob I", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17225736, "likes": {"liked": "— Style of the hotel", "disliked": "— It's hard to find anything wrong with The Hoxton"}}, {"rating": 5.0, "title": "Great hotel", "text": "Then the hotel breaks with its peers - it charges only 5p per minute to call the USA from your room for example. The card in the bathroom about re-using towels is very refreshing (see my photo) and the free water and milk in the fridge, plus the free breakfast in a bag from Pret a Manger are all lovely touches too.", "user": "SurreyTbt", "date": "June 3, 2008", "id": 16644115}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "If you can grab one of the periodic offers on the hotel's website (100 rooms for £1 and 100 for £29 - we grabbed the latter offer) then it is unbelievable as well as exceptional.", "title": "Very nice hotel!!", "user": "marbeno", "date": "June 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16598316, "likes": {"liked": "— internet access, tea facilities in the room, bathroom, restaurant", "disliked": "— views from windows"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Real all round delight to meet, eat drink, work in big open welcoming ground floor space - and sleep of course as it is a hotel. Rooms not huge but efficient use of space and good size walk in shower area. Hard to fault it - small TV and you might get lost coming out of Old Street tube if you are not familiar with it - Exit 3 is the one you want.", "title": "Hotel which is ideal meeting place, workspace, lively bar area", "user": "CharlieRobertson94", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123349218}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Expected a Stylish hotel (especially for the young and smart), but got more than that: Customeroriented and efficient reception (despite in our case initially giving wrong key), very nice rooms (especially the large bathroom), untraditional thinking (e.g. the suggested minimalistic breakfast), good humor (read the different signs in room!), easy transport (all types nearby) plus cozy and inspiring reception & bar area (with a lot going on round the clock). But the competition at the 110 GBP price tag is hard.", "title": "Great experience", "helpfulness": 1, "user": "AarhusHenning", "date": "January 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123322738}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "Negatives first: I was given a spacious room on the first floor and I could hear the noise from the bar/club downstairs until 1.30 in the morning. It is a cool, young and trendy hotel, but for once(!) I wanted to get some sleep on a saturday night.", "title": "Great hotel - apparently also a great club", "helpfulness": 1, "user": "Hoj300", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123296181}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Positives: everything else. Great bed and bathroom, well working AC (all though a bit noisy..), very friendly staff, good coffee and tea in the room. I loved it.", "title": "We love this hotel", "helpfulness": 1, "user": "george H", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123272628}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "We have stayed here lots of times now. It is ideal for shows etc and saves us getting a late trin back up north. Easy cab or train to most places in London. we have particlarly used it for Sadlers Wells and the West End theatres", "title": "Great area", "user": "Kateme", "date": "January 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 123271009}, {"rating": 4.0, "title": "Excellent London Hotel", "text": "I stayed in The Hoxton in London in January 2008, travelling on business. It is an excellent modern hotel, with superb service, great ameneties, wonderful design. The room was very clean, not very big but nicely decorated, even with a sense of humour (no, really!). Hotel has free internet access, breakfast is included and delivered to your door in the morning. Hotel has its own restaurant, which is apparently trendy at the moment. The Hoxton is a few minutes away from Old Street tube station, so very convenient for the City area (Bank, Liverpool Street Station). Would definitely recommend it to the business travellers. The only minor issue was the noise: my room was facing the street, so it was noisy thoughout the whole night. But other rooms are quieter.", "user": "Zuerich_7", "date": "February 5, 2008", "id": 13295566}, {"rating": 5.0, "title": "top marks to the hoxton", "text": "Just back from the Hoxton with friends where we had a 3 night stay.", "user": "jetsetterLancashire", "date": "February 4, 2008", "id": 13261961}, {"rating": 4.0, "title": "Great Price, Hip Room..comes with dust clouds and breaking glass", "text": "The staff, ambience comfort and food was excellent.", "user": "WTGZ", "date": "January 30, 2008", "id": 13115134}, {"rating": 4.0, "title": "Great interior - but 8 hour power outage!", "text": "Having read a previous report we were not going to eat in the hotel but decided on the last evening to do so. We were sorry", "user": "GinaZ41", "date": "January 27, 2008", "id": 13048076}, {"rating": 5.0, "title": "Well done", "text": "we did not eat earlier as the food and service was excellent.", "user": "lycook", "date": "January 25, 2008", "id": 12969697}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed here while passing through London to meet some friends on Dec 27. We also recommended that they also stay at the Hoxton because we heard good things. The hotel was really wonderful and our friends loved it too.", "title": "We love the Hoxton!", "helpfulness": 1, "user": "poshgirl24", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12663115, "likes": {"liked": "— The service and value", "disliked": "— The food in the restaurant was just ok"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The rooms are somewhat small, but designed well so you don't feel it. Our rate for this night was 59 pounds. The free water bottle and coffee and fresh milk were really nice. The bagged breakfast was also good, just enough to start our day.", "title": "Loved the Hoxton!", "user": "Melbo77", "date": "January 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12660053}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The staff was incredibly friendly and helpful. We organized to meet a bunch of friends for dinner. More people turned up so the hotel staff reserved a few couches for them while we finished dinner. Food was ok, but I think that's how most places in London are. Drinks were also ok, but we were happy to be in such a cool space with such a friendly vibe!", "title": "loved the Hoxton", "user": "italiantraveller1962", "date": "January 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12630640, "likes": {"liked": "— the possibility to stay in a design hotel for cheap", "disliked": "— a small breakfast in included, but non a real one"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007", "text": "We came back to the hotel to stay for New Year's Eve and the hotel staff remembered us. Our room was not as great as the last one because the shower leaked a bit but we still can't fault this place. The rate for NYE was 99 pounds, but we were happy to pay it as this hotel is a real gem in London. We will return each time we travel back to London!", "title": "Very Trendy", "user": "DCTravelman", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 12617444}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I agree with most of the reviews on here, the Hoxton is a great little place to stay. I paid £99, which compared to what you can get for that elsewhere in London was a bargain. Funky, clean, gorgeous soft sheets, comfy bed, amazing bathroom and free water!", "title": "A rare bargain in London", "helpfulness": 1, "user": "craiginnyc", "date": "January 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 12574483, "likes": {"liked": "— great value for price paid", "disliked": "— Closet space is tight-would be challenging for more than one guest or for a long stay"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "During the week, the Hoxton is a fairly pricey (by Canadian standards) business hotel, but on the weekend, prices drop dramatically, making it an affordable tourist hotel and one that’s fun to stay at. We booked a weekend this July and paid about half what it costs to stay here during the week. Check in was fine, our room was away from the weekend noise one finds in this area of London. The rooms are well equipped and comfortable with the kinds of amenities that N.A. travelers are used to such as ironing facilities, real coffee for the coffee makers, and ice machines on the floors.", "title": "Weekend at the Hoxton", "helpfulness": 2, "user": "SilverL", "date": "July 27, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 3.0, "value": 5.0, "rooms": 4.0}, "id": 18322340, "likes": {"liked": "— Atmosphere and weekend price", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Expect lots of weekend nightlife both inside and outside the premises.", "title": "Best choice for younger audience in East London", "helpfulness": 2, "user": "travelwurst", "date": "July 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18208817}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My only quibble was the lack of a reading light. There is a tiny bedside light but it’s not suitable for bedtime reading.", "title": "Great Base from which to visit and enjoy London!", "helpfulness": 1, "user": "Monkey2007", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18058051, "likes": {"liked": "— Quality", "disliked": "— The location is very convenient but be aware Hoxton isn't one of London's more scenic areas"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "We had a very pleasant 3 night stay.", "title": "By far the best option on this side of town!", "helpfulness": 3, "user": "Nina1976", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17419704, "likes": {"liked": "— the vibe, the shower, the free computers", "disliked": "— I can handle the non smoking policy but it would be good to have an ashtray on the street"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The Hoxton is a perfect hotel for East London experience.Book the rooms ahead and u will get weekend deals for 59 pounds up to 99 pounds. the size of the rooms is great for london standards, u get free bees like wifi and a pret breakfast bag with yoghurt and juice.", "title": "Great Hotel well worth a visit", "helpfulness": 1, "user": "tubbies74", "date": "July 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 17391148, "likes": {"liked": "— The quality of the furnishings", "disliked": "— Location late at night!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Stayed over Easter at the Hoxton (booked in advance and get two twin rooms for approx £58 prpn). As I was taking my mother there who is in her 70's I contacted the hotel directly and requested the quietest rooms possible which they were able to do for her. As said in previous posts the area is not the cleanest but it didn't feel unsafe. Tube was a bit unreliable over the weekend due to engineering works but Liverpool street station was only a short walk away and offered a greater choice of lines.", "title": "Faultless service", "helpfulness": 3, "user": "Petunia3791", "date": "April 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7303619, "likes": {"liked": "— The staff", "disliked": "— Noise from the courtyard (ask for rooms overlooking the street)"}}, {"rating": 1.0, "title": "Bumped by the Hoxton", "text": "The hotel is spotlessly clean, excellent value but the main plus for me was the staff. On our first night (Thursday) the bar and restaurant was very noisey as alot of people were celebrating their Friday night early due to Easter. We asked them for suggestions for a quieter restaurants and they were happy to oblige. We did eat in the restaurant on other evenings and found it excellent value for money, lovely food and I do like it when restaurants sell carafes of wine for those evenings when you don't want a full bottle but more than a glass.", "helpfulness": 15, "user": "leebond", "date": "April 3, 2007", "id": 7278355}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "In summary, I think the hotel is perfect for the 20+ age group who are in London for a good weekend. The rest of us can enjoy it as well but may feel a little old on occasion! The staff in this hotel are the nicest I have ever come across and not what one would typically expect for London!", "title": "How Great is the Hoxton Hotel? Read on to find out how Fabulous it is!", "helpfulness": 1, "user": "Lou_Rolls", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7276643, "likes": {"liked": "— Comfort", "disliked": "— Nothing, loved it all"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We were looking forward to a weekend in London with my son and his girlfriend, celebrating his 20th birthday, and booked into the apparently funky Hoxton Hotel, with easy acess to local trendy clubs and bars. Booking 2 weeks before on the hotel website I was a little taken aback to see, after paying £396 in advance, that there was no right of cancellation or possibility of a refund under any circumstances. However, I guess this is a \"budget hotel\".", "title": "Loved The Hoxton", "user": "adk84", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7269471, "likes": {"liked": "— Everything", "disliked": "— Nothing - it was perfect!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I was therefore shocked to find a message on my answerphone 24 hours before arrival saying that there had been a \"computer error\" leading to overbooking and they would find us an alternative hotel. After some difficulty I managed to contact a manager at the hotel, who said that we should not worry as they had booked us into \"an equivalent hotel\", the Thistle Barbican - see appalling reviews on this website and a long way from the trendy bars of Hoxton. They had not tried to phone again, or to email (they had my address from the booking), and if we had not phoned on the Thursday evening we would only have found out on arrival on Friday, with little time to find an alternative. I had the impression that they had simply found someone \"more important\" who needed 2 rooms - there was no other explanation offered as to why we were chosen to be bumped off , and only a half-hearted apology with a promise that they could offer us a booking for another weekend. Eventualy they agreed to a full refund.", "title": "Great hotel", "helpfulness": 4, "user": "julie4", "date": "March 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7231535, "likes": {"liked": "— The clean, comfortable, and contemporary rooms.", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Having read the glowing reviews of the Hoxton we thought it was probably going to be OK but you never can tell...", "title": "Not disappointed", "user": "|Bodster", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0}, "id": 19416881}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Location is good. Old Street is not the most salubrious of areas but much better and busier than it used to be. It's also really central - easy to get into the West End and to the City and there's a lot going on locally too.", "title": "Wow Fantastic hotel", "user": "Cuskie", "date": "August 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19407667, "likes": {"liked": "— Eveything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The check-in was friendly and efficient. We asked for a quiet room and were allocated one at the top, back of the hotel. It was probably as good as it could be given that we were in central London.", "title": "really great hip hotel", "user": "pinkyblue", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19390723, "likes": {"liked": "— Customer Service", "disliked": "— Would have wanted to stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The room - it was as though someone had been listening to all the comments I'd ever made in other hotel rooms and had dealt with them all. The room was spotless, really clean. There was air conditioning but you could open the windows too. The bed was comfy. In addition to tea and coffee, herbal teas, decaffeinated coffee and fresh milk were provided. There was also a little fridge. The walk in shower in the bathroom had two shower heads - a fixed overhead power shower and a moveable 'wand' shower - genius! You also got a bar of Pears soap and the invitation to take it with you so no more wasting those little bars of soap you usually get. Plus v nice Aveda shampoo freebies. The room wasn't enormous but it was perfectly big enough and there was plenty of storage space. The only quibble, if forced to find one, is that I'd agree with a previous comment - better reading lights would be an improvement. But that's the worst thing I could find to say...", "title": "Hoxton is brilliant!", "helpfulness": 1, "user": "abcdmerseyside", "date": "August 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 19346862, "likes": {"liked": "— everything", "disliked": "— view from room,but hey!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The pret lite breakfasts were also a great idea!", "title": "Great Hotel!", "user": "horse_hugger", "date": "August 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 19110835, "likes": {"liked": "— Clean rooms, good location, nice staff", "disliked": "— No negatives to report!!"}}], "location": {}, "stars": 4, "variance": {"poor": 28, "average": 111, "very good": 858, "terrible": 23, "excellent": 1954}, "aka": "Hoxton Hotel London", "slim_ranking": 0.0482822655525, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "East London establishment, the Hoxton Hotel combines destination sleeping, drinking and dining. With 208 stylish rooms, a restaurant serving up classic American run in partnership with the Soho House group, courtyard garden and The Apartment meetings and events space, it¹s pretty easy to see why the Hox rocks..."}