{"user_rating": 4.0, "review_count": 930, "name": "Humphreys Half Moon Inn & Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My husband & I met another couple at the hotel for a 4 night stay. We had a gift certificate for a Casablanca package and they had the same. We were both upgraded to rooms with a view of the concert venue which was wonderful and we didn't even have to ask! We were there for one of the concerts so this was an unexpected surprise. Our friends had some issues that were taken care of by the hotel quickly. Room service was very good on a busy concert night. The hotel is close to everything we wanted to do and to the airport. We all enjoyed our time very much and can't wait to visit again soon.", "title": "We had a great time", "helpfulness": 2, "user": "subcycle", "date": "September 24, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3935837}, {"rating": 2.0, "title": "Not for teenagers", "text": "The hotel was average with an attractive tropical setting. They catered for concert guests rather than their hotel guests.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 23, 2005", "id": 3934545}, {"rating": 5.0, "title": "Half Moon Inn is my new favorite!!", "text": "I was there with my husband and teenage son. On the day of arrival my son had just left his room to enjoy a swim. He was approached by a female member of staff who accused him of breaking a window.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3905475}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "She was rude and attempted to bully him We did not receive an apology or an explaination.", "title": "tropical paradise, friendly staff", "helpfulness": 7, "user": "1traveljunkie", "date": "September 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3894631}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "This spoiled our holiday", "title": "Unique hotel, nice getaway", "helpfulness": 4, "user": "bethrad", "date": "September 9, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3890591}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I stayed for 2 nights at Humphreys after a conference in downtown San Diego, and I had a great time. My room was renovated and very nice, although I only had a view of the parking lot with a little peek of the San Diego skyline. For $85/night I didn't really mind. There was a lot of space, the bathroom was spotless and nicely decorated, and the microwave and mini-fridge were nice touches. All of my interactions with the staff were very positive. The grounds were lovely, and I had a tasty breakfast in the restaurant with pretty views of the marina. I had a rental car which I think makes a stay here a lot nicer, since the public transportation isn't great from what I could tell. This was a nice base to see the sights in the area, but wouldn't be convenient if you want to spend most of your time downtown. It was a perfect change of pace for me since I had stayed in a Gaslamp hotel for the conference, so I got the best of both worlds. I would highly recommend Humphreys, and as a solo woman traveler I felt perfectly comfortable here.", "title": "Hawaiian vibe, nice people", "user": "StJohnFan", "date": "January 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 93083032}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We loved this hotel from the moment we stepped in the lobby! We felt like we were in Hawaii.Our room was beautiful! Not your typical hotel room. It had a huge flat screen TV, wood beamed ceilings, plantation shutters, amongst other great perks! The king bed was awesome, pillow top mattress with an actual down comforter! The closet was huge, bigger then mine at home.The is a coffee maker, refrigerator and microwave on the way to the bathroom, around a corner.", "title": "Make this your play to stay in San Diego!", "user": "holsgig26", "date": "January 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92934171}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "The pool was beautiful and huge! We ate lunch and dinner in the bar, lounge on site. Happy hour all meals and drinks are half off. And believe me it was awesome. There was also a band playing and since we were staying at the hotel there wasn't a cover charge. The view at the restaurant overlooks the marina and is breathtaking.", "title": "Kind of funky--with a lot of charm!", "user": "Petite1Redding", "date": "January 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92619238}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "if you choose to here, you will love it. Plus, if your taking a cruise like we were you can leave your car here for the entire time, no charge! Awesome deal all around!", "title": "Even nicer than expected at the half moon", "user": "Needhamites", "date": "January 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91618600}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "My husband and I were in town with our adult son, his wife and two preschool children. Our suite had to have been around 1,000 square feet which included a living room, kitchen, dining area, large changing area, nice sized bathroom and a bedroom. We also had two patio areas and lawn area. When we return to San Diego we plan on staying here again & telling our business associates, as well. Our suite would have easily accommodated 8 people. With the adjoining lock-off room, it could have been 12 and offered an additional bathroom. The dining table was huge and could easily seat a large family. The only thing missing in the kitchen was an oven. Thanks for a nice stay!", "title": "Mixed Feelings", "user": "shario", "date": "January 2, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 91456265}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Really liked this hotel so different to any other hotel. I noticed one reviewer siad it was noisy with kids, we went in June & it was fairly quiet round the pool.", "title": "Very Unique", "user": "TraxwazNewcatle", "date": "August 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137291530}, {"rating": 3.0, "title": "Don't come if you're looking for peace and quiet!", "text": "Our room was a fairly decent size, nice & clean & cleaned every day.", "user": "MidgetGem1980", "date": "August 13, 2012", "id": 137120985}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Reception area was nice & staff nice & friendly when we checked in.", "title": "San Diego Paradise", "helpfulness": 1, "user": "Mamaj24", "date": "August 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 137076127}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Pool area nice & clean & towels available, there are 2 ducks that wander around the garden area which we named as George & Mildred they were lovely.", "title": "Very overpriced", "user": "Alice G", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 136742596}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The hotel itself is nice, large nicely decorated rooms. The problem is the noise. There are a lot of families here with noisy kids, but this isn't the problem. The problem is the outdoor music venue. Even during the day bands are rehearsing very loudly, so I did not find it at all relaxing. A real shame as we were on honeymoon. The hotel did nothing to make it a special stay for us, the reception staff who checked us in didn't seem to have a clue what she was doing. The restaurant was nice but a little overpriced, my salmon was overcooked and dry, not what I would expect for the price.", "title": "San Diego", "user": "Sandy C", "date": "August 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136495242}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "We booked on the basis of comments in Trip Advisor. We aren't sure why many reviewers are essentially \"tripping over\" each other to provide accolades for this hotel. It has aged. The \"harbour view\" room was on the first floor (but slightly elevated as the receptionist noted). (Between the hotel room and the harbour was the hotel parking lot, a street and a park parking lot, so you are not next to the water). Overall it was not the view we envisioned. The suite design was strange. The bed was located very close to the entrance door, and we had the privilege of overhearing several late night boisterous conversations in the hallway. Indeed the basics are there, a sitting room with a hard sofa bed, clean bathroom, a fairly clean room and a filty outdoor deck. The hotel is of course close to the water and waterfront park.So if you like to go for walks near the ocean it is a good location. However eating options (other than the hotel) are a bit of a walk from the hotel. Overall, if you are in San Diego to see the zoo, sea world and the wild animal park, it is better to find a lower cost hotel with safe clean rooms rather than one that also includes tropical ambience since since you would not likely take much advantage of the grounds the hotel has (for which you pay).", "title": "Overrated", "helpfulness": 4, "user": "dkona", "date": "December 24, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 4299260}, {"rating": 3.0, "title": "Fair not great", "text": "We stayed 2 nights at Humphrey's. Their internet prices are cheaper than if you call direct. Request a second floor room! Our first floor room had very poor soundproofing. There was a family with kids directly above us and the noise was horrible. We called to complain and the front desk said they could'nt do anything or complain until 11PM! On the good side, the location is great if you have a car. The views from the rooms are beautiful. Large pool and hawaiian motif was cute and unique. Skip the restaurant. Breakfast was poor.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 28, 2005", "id": 4148699}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "We spent 5 weeks traveling around the US and for around $140 per night plus taxes this place was the best value for money hotel we stayed at.", "title": "Had a really enjoyable time !!!!", "helpfulness": 5, "user": "Cartman88", "date": "November 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4122981}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We had an early flight and had requested whether a room could be available before the normal check-in time. When we arrived (around 11am) our room was ready.", "title": "great place - but not a roadside room", "helpfulness": 3, "user": "Scotsman", "date": "November 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 4111349}, {"rating": 2.0, "title": "Totally over rated!", "text": "The room was clean and had everything we needed – the bed was very comfortable. The staff were all very helpful particularly with providing information/bookings for local attractions. There is a computer with free internet access in the lobby which was very handy for checking e-mails etc. The location on San Diego Bay is a beautiful spot.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 6, 2005", "id": 4089634}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We chose Humphrey's after using tripadvisor for a quick romantic getaway. We, sadly, got stuck with bad weather and it rained 90% of the time we were there. The bright side is that the room was wonderful. The rooms are VERY Tiki-- You might feel that you are in Hawaii instead of San Diego. We thought the concierge was very helpful. They planned out our evening for us. The grounds at Humphrey's ( though we did not spend too much time on them because of the rain) are beautiful! We peeked into the ampitheater and it looked like a great place to have a concert! We had a very romantic time. It was quiet and peaceful and the grounds and the rooms at Humphrey's really \"take you away\"--if you will.", "title": "Fun Rainy Getaway", "helpfulness": 5, "user": "soccr62949", "date": "July 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3675236}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "My wife and I just stayed here for 2 nights for our 1-year anniversary this past weekend. We were upgraded to a jr. suite for $199 + taxes -- I have an IATA # (if you're a travel agent you know what this is) so don't ask for this rate and expect to get it.", "title": "nice place but a few cautions", "helpfulness": 9, "user": "brendonla", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3658666}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "We stayed in Building B on the ground floor; this building is next to the concert area, so be forewarned that in the summer you probably will hear the concert if you're in this building -- but they're over by 10:30 p.m. Since we drove down from L.A. in the evening and didn't check in until 11 p.m. or so after the concert let out, I had to explain to 2 parking lot attendants that I was a guest checking in and thus I was allowed park near the building our room was in (you're given a lot pass for your windshield upon checkin; I never had a problem finding a space near our room).", "title": "Never Again", "helpfulness": 6, "user": "aly_mali", "date": "July 7, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3645191}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "My wife and I found the suite layout a bit strange: the bed is near the door in one half, a TV and bar area separates the bedroom from the living room that opens onto a porch area with view of the concert site. We would have preferred to have it the other way around with the bed away from the hallway door, but we got used to it by second night.", "title": "One of my most enjoyable weekend getaways", "helpfulness": 4, "user": "UK_to_LA", "date": "June 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3622998}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We checked out the Humphrey's by the Bay lounge/bar and were pleasantly suprised that we didn't have to pay cover since we were staying at the hotel. The crowd verged on the older side, say 40+; my wife and I are late 20s/early 30s. We still had a good time. The management knows when to cut patrons off that are wasted (I have a short fuse when it comes to dealing with drunks bumping in to me). The dance floor was crowded and made for good people watching.", "title": "A Great Place to Stay", "helpfulness": 3, "user": "servok", "date": "June 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3617457}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We spent 6 lovely nights here and were very pleased. The room was comfy and beautifully decorated. It was nice having a small patio to enjoy the evening drink. Everyone was friendly and helpful. Room service was great for late night drinks and chocolate covered strawberries.", "title": "Lovely spot", "user": "Dina P", "date": "August 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 136262656}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We didn't know about the concert hall when we booked. It was a nice surprise, but also the only downer. Specifically trying to park during the concert times. It was frustrating having to struggle to find a parking spot close to the room after paying $10/night for the privilege. They should reserve enough spots for guests and direct concert guests to another lot. One night we had to park down near the restaurant. Granted, it is not that far a walk...restaurant, concert hall, and hotel are all on the same block....but our room was on the opposite end of the row... next to lobby... and there were lots of people around for the concert. So we stopped in at the backstage and had a couple of drinks until the crowd cleared. This was a lovely spot. We enjoyed listening to the band... 52nd Street. Admission is free for guests.", "title": "Nice hotel", "user": "SALeeReview", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 136210904}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The pool is large with lots of seating, plenty of towels, with drinks and food service available.", "title": "Great location; mediocre rooms", "user": "SoCalGirlSouthBay_CA", "date": "August 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 136010064}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We plan on returning. Hopefully getting a room overlooking the water or the concert hall and plan on enjoying the music and the relaxing atmosphere.", "title": "San Diego paradise", "user": "Robert M", "date": "July 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 135775814}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed in this hotel on July 26th and 27th, 2012 and the hotel has beautiful grounds, wonderful pool, nice rooms, and very friendly, helpful staff. Downsides: parking lots are small, with small spaces, and there is a $10/night charge for parking. Many restaurants in the area within walking distance, which is good because on concert nights the hotel restaurant is busy and has a limited menu. Did not go to Sheryl Crow concert which was held the nights we stayed there, but could hear the concert from the pool which was nice. Hotel is in great location, right on walking paths which have beautiful views of the bay. Some rooms face the marina, but our room faced the pool area, which also is a pretty view.", "title": "On our way out of San Diego", "user": "ambientson", "date": "July 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 135690089}, {"rating": 3.0, "stay_parameters": "Stayed August 2005", "text": "We stayed here for 5 nights from 23rd Aug to 28th August and prebooked with Virgin before we left the UK. It should be noted that the rooms allocated to Virgin guests are the standard non view rooms which was fine by us as it would have cost soooo much more for a view room. Also, compared to what the hotel was charging for rooms the Virgin price was a bargain.", "title": "The good outweighs the bad", "helpfulness": 4, "user": "holidaynut!", "date": "September 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3836621}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The hotel looks wonderful. The grounds are as everyone says, beautiful, although the rooms are basic.", "title": "A beautiful hotel", "helpfulness": 4, "user": "Black Queen", "date": "August 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3832342}, {"rating": 3.0, "title": "Decent/But not worth $200 a night.", "text": "The room lighting was a little depressing and the bed linens and towels were rather old and you can hear the toilet flush and shower from the room above as if it is in your own room!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 22, 2005", "id": 3797676}, {"rating": 4.0, "title": "Very picturesque", "text": "However, we quite happily put up with these issues as the hotel does have such a nice, pleasant feel to it.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 20, 2005", "id": 3791760}, {"rating": 2.0, "title": "An OK hotel but no better", "text": "The pool areas atmosphere changed on a daily basis. The day we arrived we got the impression it was a couples resort, everything silent with the odd couple lounging in the sun. However, it wasn't always like that. The hotel hosts weddings and on one of the days the guests were enjoying the pool for a few hours before the service. The pool was packed, lots of drinking,laughing, joking, and American football being played in the pool. We didn't have a problem with this at all. It was a good atmosphere. There is a table tennis by the pool also which the kids loved.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 19, 2005", "id": 3790012}, {"rating": 5.0, "title": "Definately Come Here- you wont be disappointed", "text": "We spent a LONG time searching for a suitable hotel to stay in San Diego to suit the requirements of a family which included a 19year old boy and a 17 year old girl. we wanted somewhere that would accomodate 2 beds and a roll away as the boy and girl did'nt want to share. After reading many reviews from trip advisor members we plumped for humphries in Shelter Island. We stayed in a view suite which just could not have been better suited to our needs. I was apprehensive as the rating was 3 star and we normally stay in 4 star min hotels , but members rated this property so highly we decided to chance it. Accomodation was excellent- a separate room with 2 queen beds- more like double uk, and a separate living area with a really good sleeper sofa which my son used. He loved his own separate space at night with his own tv. just off this room was a very adequate kitchen providing free tea/coffee, popcorn and even kitchen roll. we had a beautiful marble bathroom with 2 vanity units and bath/ shower and bath robes and plentiful towels. Outside the bathroom was a dressing area which was great for drying hair make up etc. Only drawback was there was limited drawer space but we managed. My eldest son and his friend who are staying for the summer in San diego visited us often and we could all sit in the living area and never felt crowded. My husband brought his laptop and we had free internet access which allowed everyone to keep in touch.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 31, 2005", "id": 3724164}, {"rating": 2.0, "stay_parameters": "Stayed July 2003", "text": "Pool area is just beautiful and so green, tropical and luscious. we always got chairs by the pool and it never appeared crowded. Car parking is free and we always got parked in the car park. We found all the staff exceptionally friendly and helpful. Shelter Island is beautiful and you can go for lovely walks along the waterfront and large grass area. Not much beach.", "title": "Disappointing stay", "helpfulness": 5, "user": "Minybear", "date": "July 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 4.0}, "id": 3697493}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "Drawbacks are under 21,s not allowed in bar after 8 pm as there was live music nightly. So this is a great base for relaxing and sightseeing- 10 mins by car to downtown but a car is essential if staying here. We loved our stay here in case you had'nt realised!!", "title": "Disappointing", "helpfulness": 8, "user": "ksgrant", "date": "July 19, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 3682554}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We were very excited to stay at Humphreys Half Moon Bay. We heard some wonderful reviews of this hotel. We were celebrating our 30th anniversary there. We had booked a bay view room with a king bed. Upon arrival we had gotten upgraded to garden view 1 bedroom unit with 2 double beds. Ok celebrating our 30th anniversary in double beds! Was glad for the upgrade but at the same time upset that we didnt get a view room. We come from the desert and wanted to view water! We didnt like the location also due to we overlooked the pool and the pool had parties in there and they were a little loud. Also we did see a wedding there which we couldnt access some areas of the resort so that also was a little frustrating. Also music from the concert shook our room. Lucky for us the concert was over at 10:30pm. We werent near the concert area but the music shook our room. If you had to go out for the evening and had to come in later on. You couldnt park near your room. Also the parking was too tight. Was afraid to hit the other cars beside you. Also the worst thing that happened to us we got $300 worth of jewelery stolen or missing from our room. We did report the theft but nothing came from it. The good thing is we saved $$ on food due to us having a kitchen. At this time we do not plan on going back to Humphreys. We will try another location.", "title": "Loved It!", "helpfulness": 13, "user": "ginger2007", "date": "July 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3678716}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "We stayed here on our first trip to San Diego in July, 2005. At first we were excited. We got upgraded to a waterview room from a gardenview. The room was very nice and well maintained. The cleaning staff was excellent. This was in building B. But the room was so noisy after the concert that we requested to move. They were very helpful and moved us to the other side of the property, back to a gardenview room. The next room was larger which is good but much obviously older. The bathroom wasn't as clean as I would have liked and was dated. The windows were louvered and one didn't even have a crank to open it. There were many things broken in this room. This was in building F. There was a wedding on the premises while we were there and the wedding party was staying right underneath us. They were so loud on thier patio that they woke us up at 3:30 in this morning!", "title": "Lovely location", "helpfulness": 5, "user": "SBMLMK", "date": "July 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3676601}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Humphrey's is a gem. Apparently designed in a Polynesian style a few decades ago, this low-rise hotel has well established jungle-like grounds and sits on a peninsula overlooking a marina and the harbour.", "title": "Tropical, relaxed getaway", "user": "HampshireMim", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 88808781}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "There is a heated outdoor pool and a lovely big warm jacuzzi that is open until late in the evening, is lit and you can sit out looking at the palm trees whatever the weather!", "title": "Enjoyed our stay!", "user": "MissiCAD", "date": "November 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87177510}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "The staff for breakfast gave very good service.", "title": "Very comfortable, excellent location, outstanding service", "user": "unols", "date": "November 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86514851}, {"rating": 5.0, "stay_parameters": "Stayed October 2010", "text": "We stayed here twice and the rooms varied in size and location. Poolside rooms were the best - we got free upgrades as we didn't like the roadside room we had booked as we could hear the (light) traffic. We didn't stay in a marina side room but I would imagine they are best of all. One note of caution in the rooms - the fans in the bathrooms are VERY noisy. We were woken one morning by our 4 neighbours putting on the fan for their morning showers and it was 5am! This is one thing the hotel needs to upgrade. However we were very happy here. It was so relaxing and beautiful and we would definitely stay here again.", "title": "Our favourite of all the California hotels we stayed in on a 2 week trip.", "user": "bentotata", "date": "November 8, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 86347403}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "You need a car to get into the main parts of San Diego (there may be public transport but you certainly can't walk!) and restaurants that you can walk to from here are few.", "title": "OMG!!!! YOU HAVE TO STAY @ HUMPHREYS", "user": "HotSpotzloverz", "date": "November 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85907179}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Stayed several days - outstanding property. Had a renovated unit - unique and comfortable. Grounds make for a nice walk, spent a relaxing days at the pool. Would recommend as a great resort-style destination.", "title": "Outstanding San Diego Value", "user": "PRDuffy", "date": "October 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 85462967}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We stayed here for 3 nights for a wedding last weekend and had a great experience. The only caveat is that we stayed in a renovated room- I think there are other rooms on the property that are not renovated and I don't know if they are that nice- but, the renovated room we had was very trendy and comfortable. We asked for a pack and play for our baby to sleep in at night, and it fit fine into the king room- we still had room for the stroller and our suitcases. There were big screen TVs and comfortable beds with nice linens etc.. It was really a comfortable hotel. The only downside is that it is very close to the airport- Point Loma is anyway, so we could hear a lot of planes taking off and landing which was louder than I expected, but not bad. Also the area is a tad industrial/shipping, but there are cute places to walk to for breakfast. We had breakfast once in the hotel which was very good and also went to the bar.", "title": "Great for the price in San Diego", "user": "lawa306", "date": "October 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 85031200}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Overall a great hotel and I would definitely recommend!", "title": "Excellent Hotel - Can't wait to return", "user": "nick1981", "date": "October 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 85007897}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "We stayed a the half moon inn back in May when the renovations were still being carried out. I requested a renovated room at check in but unfortunately they were fully booked (due to the black crows playing the next night) but they upgraded us to a concert view room FOC. The room was really nice and clean even though it was an unrenovated room!! and it was amazing to look out the window and watch the show for free!!. Parking was easy (does get busy on show nights though) and the location of the hotel was excellent (10 min drive to downtown San Diego). The best thing about this hotel though was the general ambience. The staff were very helpful and the whole place had an almost tropic feel. Would definitely go back and would love to see a renovated room.", "title": "Great rooms and grounds", "user": "sandit10", "date": "October 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 84729084}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "After looking this up on Tripadvisor and finding it had a free airport shuttle, decided would like to stay there the first day of our business trip. So glad we did. I preferred this hotel to the Sheraton which was our paid stay. The bathrooms were nicer and newer and the rooms had a usable fridge and microwave. Loved the patio off our room that looked into the lush gardens. We loved being close to the beach walk as well. Would have loved to have been there for the concert the day we left San Diego. I must say though the breakfast @ their restaurant was great. Lunch was a disappointment. The service and the view and lovliness of the restaurant helped that the sea food we ordered was very poorly done. The shuttle service was excellent and even shuttled us to the Sheraton the next day. The only down side is you would have to take a bus to get to the rapid transit. It would have been very nice to have been shuttled to the trolley system.", "title": "Excellent Time", "user": "TerriHB", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83249959}, {"rating": 4.0, "stay_parameters": "Stayed April 2004", "text": "Everything about this hotel should be great. The position on Shelter Island is truly wonderful with the large yacht harbour. The suite we had was marina-front and spacious.", "title": "Great Position, nice hotel .....but", "helpfulness": 3, "user": "crimson999", "date": "May 8, 2004", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 1888255}, {"rating": 5.0, "title": "Perfect get-a-way location!", "text": "The \"but\" is that everything about the hotel was \"not quite\". The hotel charges luxury prices and everything we experienced was really good.....just not our definition of luxury for $300 a night.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "April 26, 2004", "id": 1839520}, {"rating": 4.0, "title": "great time", "text": "Nothing was particularly wrong and if you are paying $170 a night, you might consider the place fantastic. Nothing at all was wrong, it was just \"not quite\"", "helpfulness": 3, "user": "traveling_mom-Boston", "date": "April 14, 2004", "id": 1784269}, {"rating": 4.0, "title": "great easter weekend", "text": "Do please note that we had a really nice time in wonderful San Diego and the Red Sails restaurant along from the hotel is great", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 13, 2004", "id": 1783369}, {"rating": 5.0, "title": "Wonderful Place to Stay", "text": "My husband and I just returned from a long weekend in San Diego. We stayed at Humphrey's after getting a great vacation package deal on Expedia that included this hotel property. I was hoping the hotel was nice after reading many reviews on this web site. Much to our pleasure, Humphrey's was fabulous! As others have noted, the hotel staff could not have been nicer. The grounds of the hotel are simply beautiful and our room was perfect for us. It is a little \"loud\" there (you could hear folks outside of their rooms at night and wheeled-suitcases were noisy on the pavement) but we were on vacation and didn't let a little late-night noise ruin our mind-set. The pool was terrific (warm pool water, lots of lounge chairs available, outdoor bar open on weekend and hot tub was nice). We had breakfast at Humphrey's Restaurant and liked it much better (larger portions, better quality of food, very-friendly staff) than the breakfast that we had across the street at the Red Sail Inn. We found Humphrey's to be very conveniently located to the airport, restaurants and other locales that we visited (zoo, Gaslamp Quarter, Old Towne, etc.) and it had a beautiful view of the harbor. We would definitely stay at Humphrey's again and would recommend it to others!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 12, 2004", "id": 1774881}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "You all rock Humphreys Half Moon Inn", "title": "Good room, Great atmoshpere", "helpfulness": 2, "user": "CarlsbadTraveler", "date": "September 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3844907}, {"rating": 1.0, "title": "dumpy place", "text": "And a special shout out to my friend who helped me back to my room that night! Room 155......", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 3, 2005", "id": 3841298}, {"rating": 4.0, "title": "A pleasant stay!", "text": "My husband and I searched for many hours trying to find just the right place for a get-a-way. Every time we found a place on the web that sounded great we checked the Trip Advisor website. Each time we changed our mind based on the reviews, Keeping in mind that someone would have to have a truly bad experience to take the time to post a review. We found Humphrey's and mostly good reviews. We found them to be true. We had a jr. suite on the end of a building right next to the concert venue. We saw one concert free. If you don't want noise from that make sure you book on the other end or stay when no concerts are going on. The concert was fun and was over by 10:30 (noise regs.) and tear down and the emptying of people was over in less than an hour. Bedding and bath immaculate. Draperies had a spot here and there, no bigs. Maid sevice wonderful. All staff helpful and polite, we were treated well. We booked through San Diego Chamber of Commerce and got a better deal than anything we could find through Expedia,Hotels.com etc. Ask for a view of their harbor not the outside one all you see is a parking lot and road. Or an inside garden view, Beautiful gounds. Have fun!", "helpfulness": 2, "user": "Pitypooh", "date": "June 30, 2004", "id": 2230819}, {"rating": 5.0, "stay_parameters": "Stayed May 2004", "text": "We staying in an executive suite mid May 2004 with our 2 young children. We were very surprised at how large the room was -around 700 sq feet. The grounds were beautifully maintained and immaculate. Nice heated pool which we swam every afternoon. They also have a small pond with huge koi fish, parrots, and ducks. A big hit with my daughters. The room had a full kitchen, a separate bedroom, and living room with sofa bed. My youngest slept in the crib in the walkin closet/dressing area and it was great for us to have somewhere to retreat to after the kids went to bed at 8:30. Our room had a marina view and that was great too. I agree with another reviewer that the parking lot view is not nice at all. I was worried when we first drove up but after seeing our room and the garden we were very pleased. We booked a great rate through expedia and it was worth the extra money to have the executive suite with the 2 children with all that space! I probably wouldn't stay there during concert season (june-oct) due to higher prices and potential noise. But it looks like a fun place to stay and see a concert if I didn't have my children with me. I will try to stay there again when we go back. San Diego is so much fun!", "title": "Executive Suite - Nice Big Room", "helpfulness": 1, "user": "love_to_travel_2012", "date": "June 11, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2183865}, {"rating": 4.0, "title": "Be very clear on expectations, then be pleased", "text": "After reading your reviews and viewing great website for hotel, we selected this location for a week long pleasure stay base in late May. The jr suite allowed my husband, my mother, and me to be close but not fully together. The hotel is a well kept funky 40 year old Tiki style complex with a great location and a certain style.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "June 9, 2004", "id": 2173643}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "I requested a view of the bay thinking it would be like the website. What I got was a view of the active public road, the public parking lot and channel for San Diego Bay beyond! Oh, and huge fuel tanks for the Coronado navy base couldn't be missed. Not nice. Upon immediate complaint, I was very kindly told we could not move to more scenic quarters until the next day. However, the hotel garnered goodwill by keeping its promise and actually moving all our packed luggage and bags while we were enjoying ourselves elsewhere.", "title": "Great X'mas stay", "helpfulness": 2, "user": "tiger62z", "date": "May 24, 2004", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 2113236}, {"rating": 5.0, "stay_parameters": "Stayed March 2004", "text": "CAUTION: Be specific about what scenic experience you are seeking. Leave the parking lot views to the block groups. It can really distinguish your visit as a good or less than good memory.", "title": "Great for Toddlers", "helpfulness": 1, "user": "Whoodle70", "date": "May 21, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 2105783}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "paid way too much for a 'junior suite' that turned out to be a slightly larger than average hotel room. did have a beautiful view though.", "title": "too expensive", "user": "hsheffield1", "date": "July 28, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 135646689}, {"rating": 4.0, "title": "Lovely location and resort", "text": "no bottled water, no minibar, drinking glasses not replaced when the room cleaned. the second day, the room was still not cleaned by 3:30 pm. parking $10/day extra. at night security guards tell you where not to go because there's a concert going on.", "user": "ShellM18", "date": "July 28, 2012", "id": 135619315}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "the worst part was that the bed was right by the door so you hear every dish from room service in the morning and every door opening and shutting down the hall all night.", "title": "Funky Spot!", "user": "sailormom97", "date": "July 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 135356974}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We spent 2 nights here at the end of a two week holiday and absolutely loved San Diego. The hotel is in Shelter Island and has great views of Downtown San Diego from across the marina. Our room was lovely, clean and we were lucky to get a room which overlooked the concert venue where we got great views of the concert from our balcony (Room 201). The free wifi was good, pool was lovely and the staff were really helpful If you want to visit the world famous San Diego zoo then you can get a discount on tickets by buying them at the hotel and this also helps you beat the queues. It's a taxi or bus ride to get to Downtown or some of the attractions but has such a lovely location it is worth it.", "title": "Loved the location", "helpfulness": 1, "user": "George D", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135332705}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband, 14-yr. old son and I stayed here for 6 nights. It is off the busy streets of San Diego, but just a few minutes from downtown and the airport. We could ride bikes (provided by the hotel) or walk to restaurants and the San Diego Yacht Club. Beautiful view of SD. We mostly went up the coast to Ocean Beach/Mission Beach, which were just 15 minutes away. They also have outdoor concerts and I got to hear Ringo Starr & the All Starr band while sitting in my room! Not everyone would like that, but it's a perk. Check out their concert calendar before you book. They shut down concerts at 10:00 pm, so it isn't a late-night issue. I think it would be fun for couples - there is a good restaurant with live music each night adjacent to the hotel.", "title": "Quaint and cute", "user": "Jessica Y", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 134744052}, {"rating": 2.0, "title": "Underwhelmed", "text": "Overall-- Worth it if you pay under $150 or under $125 a night", "user": "Ginster235", "date": "August 16, 2005", "id": 3778503}, {"rating": 2.0, "title": "Would Not Stay Here Again", "text": "Not worth it if you are paying 200 plus", "user": "pvmkmyer", "date": "August 1, 2005", "id": 3727036}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "We enjoyed our stay in this hotel. It is conveniently located on Shelter Island which is great for evening strolls. The pool was a bit noisy and the restaurant too expensive, but otherwise we were extremely happy with the room.", "title": "Wonderful Hotel", "user": "Agunther", "date": "January 2, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 91447776}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We stayed in one of the oversized garden view suite. The room was a very good size with two 42 inch LCD TV's, a kitchen (albeit with dirty utensils) and comfortable sofa bed. Good points were the room facilities - it had just about everything including large refridgerator, toaster and microwave as well as a stove. Lots of HD TV channels available too.", "title": "Suite was Dirty, Dated, Dark and Dingy", "helpfulness": 1, "user": "worldtrav2011", "date": "January 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 91402935}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "It is clear that the hotel had upgraded certain aspects of the room like the bedding and TV's, but the room remained in poor condition with a hole in the ceiling and a myriad of un-dusted surfaces everywhere, together with mold in the bathroom and a noticeable lack of any decent lighting. Whilst the hotels upgraded rooms may be nice, the suites certainly aren't! Many words come to mind including dark, dated, dingy and dirty.", "title": "Indeed", "user": "Fellowbot", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 90807172}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Add this to the noise from the \"low grade\" guests this place seems to attract and the thin walls allowing us to hear the guy next door shouting in the middle of the night and you get the picture that WE WON'T BE GOING BACK ANYTIME SOON. Not that the hotel seemed to care as they never asked us how our stay was!", "title": "Not for the business traveler", "user": "care1784", "date": "December 9, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 89467618}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "My advice is to book the Bay Club Hotel and Marina next door instead. It has half price parking at $5 a night compared to the $10 fee at Humphreys, much cleaner rooms and a free breakfast to boot.", "title": "Resort feel in a city...pleasantly surprised", "helpfulness": 1, "user": "want2travelm0re", "date": "December 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89379119}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "I took my son on his first trip to California. We stayed one night at Humphrey's and loved it!! The Temptations were playing the night we were there and it was just fabulous. The concert stage was right outside our hotel room door and we could stand right on the deck and watch the entire concert.", "title": "Our new favorite hotel!!", "helpfulness": 2, "user": "devocheez", "date": "November 1, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4078472}, {"rating": 4.0, "title": "A wonderful place to stay", "text": "The staff was very helpful in providing names of good restaurants to eat. We had room service for dinner and the food was good and fresh. The room was very clean and comfortable. Parking was good but we got back to the hotel well before the concert started. As people arrive for the concert, it fills up pretty fast and gets hectic outside the hotel.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 22, 2005", "id": 4043491}, {"rating": 5.0, "title": "Great Pool, great breakfasts", "text": "I would stay here again on our next trip to San Diego.", "helpfulness": 7, "user": "CHJBerkshire", "date": "October 21, 2005", "id": 4042785}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "We spent four nights here and really enjoyed our time here. We are four adults and shared a marina view suite, two of us used the put-you-up sofa which I have to say was not all that comfortable but everything else just made up for that. It was great to wake up and have breakfast on the patio looking at all the yachts just feet away. Didn't use the restaurant but ate at a great place up the road called Fiddlers Green.", "title": "Romantic Getaway", "helpfulness": 4, "user": "evadlt", "date": "October 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3986794}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Shelter Island is a great place to stay and would definitely stay at Humphreys again if we ever get the chance.", "title": "Great Place - Perfect Location", "helpfulness": 7, "user": "mainetoday", "date": "September 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3944236}, {"rating": 2.0, "title": "We won't be back!", "text": "We just got back from San Diego and were very disappointed by this hotel.", "helpfulness": 4, "user": "Vbg", "date": "July 29, 2004", "id": 2331916}, {"rating": 5.0, "title": "Great Hotel!! We loved it", "text": "It seems like being an inn keeper is an after-thought at this hotel. Priority is given to the \"Concerts by the Bay\" that go on several times a week (at least in the summer) inside the cramped outdoors quarters. This means, whether you like it or not, you'll hear the music blaring until 10:30pm (at least) and if you're in building A, you'll be harrassed by the ticket controllers.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 24, 2004", "id": 2318572}, {"rating": 2.0, "stay_parameters": "Stayed July 2004, traveled on business", "text": "Now, when there is no concert, there are weddings, with outdoor music and noisy guests who wake you up at 2am and 4 am by loudly talking outside your door.", "title": "Noisy", "helpfulness": 2, "user": "Nitrobrune", "date": "July 17, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 2304907}, {"rating": 5.0, "title": "This place rocks!", "text": "If this place was cheap, it wouldn't bother me so much, but at $240 w/o tax a night for a junior suite we really felt ripped off.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 13, 2004", "id": 2292485}, {"rating": 5.0, "title": "A break from the ordinary...", "text": "Needless to say we won't be back.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 9, 2004", "id": 2285587}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed here on our last night in CA this summer .What a lovely relaxing place, we did not realise this was a concert venu, however this did not spoil our night here. the pool is lovely with comfy loungers and a warm pool. Room of a high standard .Lovely area, would return again", "title": "Lovely stay", "helpfulness": 1, "user": "UkSand", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 138715894}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "I am from Orange County; my wife and I wanted a two-night getaway to explore San Diego and the many nice places we had heard it has. This ended up being a very nice hotel relatively close to all the places San Diego has to offer. During our stay we visited Downtown, Gaslamp District, Old Town, and La Jolla; we were very happy with the close location of this hotel to all these places(it's all within 10-20 minutes driving distance, depending on traffic).", "title": "Wonderful for a San Diego Getaway!", "user": "MizterLara", "date": "August 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138601349}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "In terms of the hotel itself, the grounds are very well kept; there is lush plant life all around. The room was also very clean and comfortable. It was just what we were looking for: an above average hotel for a decent price.", "title": "Nice landscaping, Rooms need major makeover!", "helpfulness": 2, "user": "chris311Hanalei", "date": "August 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 137949282}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The only negative thing would be that you might end up parking a bit of distance from your room; the hotel has lots of parking(at $10/night), but the spaces close to our room were already occupied when we got there so we had to park on the other side of the hotel.", "title": "Concerts and Hotels don't necessarily mix well", "helpfulness": 1, "user": "Carol B", "date": "August 20, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 137807316}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Overall, however, we were happy with the place, its surroundings, and its location. We would definitely stay here again.", "title": "WORST HOTEL EVER!!! Don't be fooled by the Pics. and Advertisement", "helpfulness": 3, "user": "Alvin M", "date": "August 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 137796794}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 66, "average": 106, "very good": 312, "terrible": 42, "excellent": 404}, "aka": "Humphreys Half Moon Hotel San Diego", "slim_ranking": 0.303703703704, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Complemented by arching palms and gentle ponds are Humphreys’ beautifully appointed guest rooms and suites. Many of our accommodations offer patios or balconies with stunning views of San Diego Bay or the dramatic skyline. All the amenities that you would find at a luxury resort are offered at Humphreys Half Moon Inn and Suites. Thoughtful conveniences include 42” HD flat panel TVs, refrigerators, coffeemakers, hairdryers, iron and boards, pay-per-view movies, in-room safes and free high speed internet."}