{"user_rating": 4.5, "review_count": 214, "name": "Hundred House Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We searched long and hard for a nice hotel in the area and liked the look of this place and the many reviews we found.", "title": "Basil's day off?", "helpfulness": 1, "user": "BigPussyBonpensiero", "date": "July 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 72225726}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The place is quirky and homely and is clearly a family run hotel with little sympathy for the corporate scene. You may not like the décor or combinations that the owners have put together but you can clearly see they have thought carefully about what they have come up with and I'm sure they are happy with it. So for example the toilet roll (tissues) in the en-suite in our bedroom was held in an industrial dispenser, out of place we thought but very functional.", "title": "A True Delight", "user": "wiggy187", "date": "July 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 70934347}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We arrived to be met by a real Manuel, he was on the phone, then he was finishing garnishing a dish and then he decided to greet us. He found our booking and gave us the key, he then tried walking off. I asked which of the many openings led to the bedrooms, he pointed. I then noticed on the counter personalised letters to the guests' from the owning family wishing them a happy stay. I enquired if we were to get one, continuing the conversation-less approach he found ours stapled to the back of our booking in a file and gave it to us.", "title": "The warmest hospitality, the loveliest people and spectacular food", "user": "frygarry", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69575945}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We went to our room, we had been directed the long way round, and is was lovely, well supplied and totally individual, \"antique\" furniture etc. We enjoyed the swing, very amusing.", "title": "Decor needs an update", "user": "Gwybodaeth", "date": "April 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 60384223}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "Having had a terrible journey from London we freshened up and went straight to diner. The booking we had made wasn't in the book. Much discussion between the staff and then they found a table for us. We were shown to an awful, tiny, cramped disgrace of a table stuck in a corner, a total waste of life that should have been thrown away, so small we had to put our bottle of water and wine on a nearby ledge.", "title": "A wonderful experience, beautiful garden, great food & service", "user": "NeilGilroy", "date": "March 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59843312}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We had a family room overlooking the road and the fields beyond. Sadly the room was noisy even through the double glazing. On the plus side the garden is a great place to explore and the food and wine are excellent. The choice of hotels with good food in this area is poor so I would stay here again but try to stay in a room at the back of the hotel.", "title": "Fantastic garden, excellent 'gasto' pub food (great breakfasts) but don't take a room next to the busy 'A' road", "user": "Traveller118", "date": "May 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 29405253}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "nice eclectic rooms, very flowery, nice size restraunt excellent, gardens beautiful", "title": "very nice", "user": "richards61", "date": "April 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 28381738}, {"rating": 4.0, "stay_parameters": "Stayed October 2008", "text": "We enjoyed a one night stay at the Hundred House as a birthday treat for my mother. We both loved the setting, gardens cosy bar and restaurant areas and had a fantastic lunch of bruschetta and a pate for my mum from the starter menu - absolutely delicious! Very close to drive and explore the ironbridge gorge and the blist hill victorian town which was wonderful fun and a memorable birthday experience for my mum on a chilly october day! I had booked a twin room, which had been made up as a double by mistake, but was quickly sorted while we had a drink in the bar. The rooms are very floral lovely for the ladies, and comfortable. The bathroom let it down slightly, although large, the bath shower had a hand held shower head which was good and powerful and hot but did mean the walls got sprayed a bit when washing your hair, and no extractor fan meant condensation dripped down and the floor got wet, also not too keen on the metal wall mounted toilet paper dispenser either but these are minor things for what was a lovely stay. Our evening meal was enjoyable, there was a theme night of game meat on but as this was my mum's birthday it wasn't going to put us off eating there although i'm veggie. Mum had fish anyway from the other menu and loved it, I was a little disappointed on the hot veggie choice and as I'd spied stilton mushrooms wrapped in bacon and asked if this could be cooked without the bacon wrap was told a firm no by the waitress, the soup was very nice however. My main course was disappointing but credit to chef / patron Stuart who came over and asked for feedback and gave my dessert complimentary, and again I s'pose the night was geared up for game. We did have a thoroughly enjoyable stay, would recommend to others, the family have obviously been running successfully for many years, and the pleasant smiles from the younger staff are lovely.", "title": "Very pleasant", "user": "LillyVonSchtupp", "date": "October 26, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 21222786, "likes": {"liked": "— Environment and ambience and most of the food", "disliked": "— Bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Booked through last minute.com (and discovered that we had an amazing bargain by doing so) and were overawed by what we found! The whole experience was magical, room beautiful (and fun!), garden wonderful, food brilliant (we had booked in for B&B but ended up having our evening meal and Sunday lunch there). Staff very helpful ( we were attending a wedding and arrived at 9.20am and they let us use the room from then - I left my mobile and it was posted to me arriving the next day). We said we needed to find an excuse to return and then decided that we didn't need one, we just would!", "title": "Amazing!!", "user": "PollyCambridge", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21101614, "likes": {"liked": "— everything!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We absolutely loved our stay in Hundred House. The gardens created by the owner are truly fabulous, as is the food in the lovely dining room, and , of course the whimsically decorated rooms. There was lots to explore in the surrounding area. If you happen to be in the vicinity, we highly recommend a visit!!", "title": "What a garden!!", "user": "marshsim", "date": "September 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20263074, "likes": {"liked": "— quirky whimsical rooms full of amenities", "disliked": "— stairs!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Just spent a very enjoyable 2 nights at the hotel (room - Anise) over the Bank Holiday weekend. Ideally situated for travelling to Ironbridge and its associated museums (which are easily found, well signposted, just a short drive away) and Bridgnorth.", "title": "Amazing Hotel - Good Value for Money", "user": "Cakesy", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110682619}, {"rating": 5.0, "title": "A fantastic experience in an excellent hotel with exceptional food, staff & facilities", "text": "Room was lovely, very quirky, well equiped, decor was unusual but we loved that, made it a unique room not the standard corporate type room you normally find. Little luxuries such as a cafetiere for coffee, Molton Brown soap/hand lotion. Bathroom was large and modern. They have installed a new digital telephone system for each room and because mobile phone coverage is very hit and miss they only charge normal rates to use the phone (rather than ripping you off like most hotels do these days).", "user": "neecy_11", "date": "May 20, 2011", "id": 109089756}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Gardens are absolutely beautiful, so much work and thought has gone into them and it such a pleasure to explore them on a nice sunny afternoon (loved the hidden teddy bear's picnic). Also lovely herb garden to explore as well.", "title": "Delightful and charming staff", "user": "reg_chandler", "date": "May 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 108599496}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The food is excellent and the hotel's reputation for dining was one of the reasons why we booked here and we certainly weren't disappointed.", "title": "Another great evening of fine dining and comfy beds...", "user": "Page007", "date": "May 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107322179}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Have to mention the staff who work extremely well as a team and are all friendly and efficient, that is quite rare these days, you may get one or two good staff but here they are all excellent.", "title": "Great Food, Great Hospitality & A Great Inn", "user": "Wanderers1958", "date": "April 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103182960}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We have just returned from a fantastic weekend at the Hundred House! What a place and I wanted to share our experience.", "title": "Relaxation at its best...with a charming twist", "helpfulness": 1, "user": "lisasutch1", "date": "February 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96486320}, {"rating": 3.0, "stay_parameters": "Stayed October 2010", "text": "Upon arriving we were greeted with a warm and friendly atmosphere and immediatley felt very welcome. The hotel entrance itself was very quirky and with the log fires burning, very cosy indeed! We were shown to our room through a maze of wonderfully winding corridors up to the top of the hotel. Our room was amazing with a beautiful four poster bed, with a very 'English' feel to it. The room was bright and airy with a lovely ensuite bathroom with bath and shower. The bed was very comfy and sleeping in a four poster made me feel like a Princess for the night!", "title": "Lovely food. Quirky cosy bar, restaurant, reception. Bedrooms though....", "user": "sailorcharlie", "date": "October 31, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 1.0}, "id": 85498965}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We visited the hotels bar and restaurant for our evening meal and were bowled over by the food. The menu was very reasonably priced and the food excellent. The staff were friendly and attentive throughout the evening, nothing was too much trouble. We also stayed for breakfast and lunch which justs shows how much we enjoyed the food!", "title": "A Swinging Time in Shrewsbury", "user": "Ratty-and-Mole", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84771513}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This is a family owned and run hotel which adds to the charm and warmth of the place. Its is a quirky and charming hotel which knocks the socks off the run-of-the-mill corporate chains. I've never seen a swing at the Hilton! I would highly recommend the Hundred House Hotel as a great place to relax and loose yourself in its wonderful cosy charm.", "title": "Unusual but nice", "user": "Nia29", "date": "August 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 77380702}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "Friendly place with delicious food. Barn function room delightful. Afraid we totally freaked out when we saw the bedroom. Think Agatha Christie meets bordello! Hideous dark bedding and poly drapes on a cheap faux four poster bed which creaked and groaned - with no assistance from us I hasten to add. Weird touches ie a cot full of teddies in the corner and strange piece of string with pegs on it over the bath. No real idea of how clean or dirty the room was because it was so dark and gloomy...... and don't get me started on the swing with the dralon upholstered seat! Eughhhhhh! Good thing was that we laughed all evening about the room.... But I slept with one eye open all night because it was so freaky! Recommended for food and a giggle but couldn't wait to get home for a shower.....", "title": "Fantastic, stunning rural location, highly recommended.", "user": "trvlr0001", "date": "August 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 75663918}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We booked our wedding reception at the Hundred House and can honestly say they helped make our day absolutely perfect. From the booking to discussing the menu, to providing a bag of ice for my daughter's bruised ankle (without being asked might I add) this was without doubt the best experience with a venue that I have had. The food was all made from scratch - no shop bought rubbish, locally sourced and excellent. The staff were attentive yet not intrusive and were all friendly. All in all - have your reception here and you really wont be disappointed!", "title": "Perfect Wedding Reception", "user": "HappyBride01", "date": "July 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18315176}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Wonderful Hotel. Very quirky and great to find a place not just decorated to a boring formulas as so many hotels are these days. The food was superb. Our room had a swinging seat in it and was brimming with Antique furniture. The staff were very friendly and efficient. Our trip was made even better by the tour round the delightful herb garden. We will definitely return.", "title": "Wonderful Place", "user": "Sheardie", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17862258, "likes": {"liked": "— Antique original furnishings"}}, {"rating": 1.0, "title": "Don't Mention the Toast", "text": "Without doubt the worst hotel i have ever stayed in in my life. Lager expensive, flat and vinegary. Steak and Kidney pie minute and served with 4 (yes, 4) chips for £11. Very unfriendly owner.", "helpfulness": 4, "user": "lee0161", "date": "March 20, 2008", "id": 14411293}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Arrived down for breakfast and despite the fact that only 3 of the 20 or so tables were taken, i was ordered to move from the table i had chosen and forced to sit in a horrible grimy corner next to some enormous fat smelly guy eating kippers.", "title": "enjoyable stay", "user": "Neathfamily", "date": "February 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13790673, "likes": {"liked": "— good food", "disliked": "— dark corridors to rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "I ordered scrambled egg on toast and was dismayed but not surprised to see one small piece of toast arrive with a tiny dollop of egg on top.", "title": "February by the Fire", "user": "Smithy_Bridgnorth", "date": "February 20, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 13701659}, {"rating": 5.0, "stay_parameters": "Stayed September 2007", "text": "We had our wedding reception at the Hundred House Hotel in September, from our first viewing through to the day after the wedding, the staff couldn't do enough for us or our guests. the venue for the reception was lovely, full of character, well equiped and nothing was too much for the staff, The food was amazing and everything was better than we could have expected.", "title": "Fantastic atmosphere, fantastic staff!!!", "user": "lornaWestMidlands", "date": "December 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11458498}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The gardens make a beautiful back drop for drinks and photos, and it was an added bonus to get to met the resident donkey.", "title": "The perfect wedding reception", "user": "mrshelen", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8472488, "likes": {"liked": "— its so different to anything else!", "disliked": "— nothing!"}}, {"rating": 1.0, "title": "This was the worst hotel we have ever stayed in............anywhere in the world", "text": "The bedrooms were lovely, we occupied all the rooms, and all our guests loved the unique and friendly atmosphere.", "helpfulness": 9, "user": "Carlajane", "date": "December 11, 2006", "id": 6362198}, {"rating": 4.0, "title": "Super family owned hotel", "text": "I would recommend the hundred house hotel to anyone without reservation!", "helpfulness": 1, "user": "francevisitor", "date": "June 19, 2006", "id": 5362089}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Best hotel we have ever stayed in and we have been to hotels around the world. The Hundred House Hotel is full of character and charm with excellent food, superb hospitality, real ales and wonderful beds. The gardens are an added bonus. Overall, this is a uniquely British hotel - no one else in the world can do hotels quit like this!", "title": "Brilliant Hotel", "user": "CliffManchester", "date": "March 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59770988}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This Hotel is amazing with the log fires delightful food what a place to stay. The beds are really comfy and the rooms are very unique.", "title": "Fantastic - a hidden gem", "user": "Milliemo2", "date": "November 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 50097600}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We'd like to say that our outstanding memory of Hundred House was the good food. Unfortunately, it will be the discomfort of the room which lingers.", "title": "Disappointing room; fantastic bar; good food", "user": "shakemeupjudy", "date": "September 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 39597840}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The room was tiny! I had to walk sideways like a crab to get past the radiator to get into bed. We stayed only one night, and I don't think I could have stayed longer in such cramped conditions. This also applied to the bathroom which had no shower and hair washing was quite a feat.", "title": "Very disappointed", "helpfulness": 3, "user": "tamaca", "date": "August 31, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 39376368}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "There was a lot of traffic noise despite the fact that secondary glazing is in place in an attempt to alleviate the problem.", "title": "Great food shame about the main road", "user": "browncrewe", "date": "May 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 1.0, "service": 4.0, "rooms": 3.0}, "id": 29612267}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 19, "very good": 34, "terrible": 8, "excellent": 140}, "aka": "100 House Hotel", "slim_ranking": 0.44, "description": "The Hundred House is a charming, family run hotel at Norton, Telford, situated in rolling countryside close to Shropshire's beautiful Severn Valley, just ten minutes drive from Ironbridge Gorge and its many museums. Throughout, it has drying herbs and flowers grown in the Inn's own garden hanging from the oak beams. Guests are welcome to browse the garden at their leisure and enjoy the variety of unusual sculptures, statues, archways, roses, trees, herbaceous plants and the large working herb garden with over 100 varieties of herbs, providing seasonal supplies to the kitchen. The distinctive bar and restaurant features mellow brick and stained glass with Jacobean wood paneling and cosy open log fires. The hotel has 9 individually decorated bedrooms, most with 4 poster or half tester beds and chandeliers. The bedrooms contain exquisite, hand-picked antique furniture and en suite bathrooms refurbished in 2011, featuring Victoria & Albert baths and rain showers. Many also have the famous Hundred House swing hanging from the oak beams - you won't forget your stay here in a hurry and is ideal for those who like to 'escape the norm'! This quirky decor helped the Hundred House to win a coveted Cesar award for 'utterly enjoyable mild eccentricity'. The Hotel is owned and run by the Phillips family; Head Chef, Stuart, has held two AA Rosettes for 16 years and earned a Michelin Bib Gourmand for his imaginative cuisine. The Hundred House has a fantastic reputation for excellent food and friendly service, making it favourite destination for many local people. Attached to the hotel is Shropshire's only 17th-Century Tithe Barn. Recently refurbished, it is ideal for weddings, christenings, parties, functions, conferences and meetings. The hotel has dedicated event staff to ensure your event is perfect and the best possible day is had by all."}