{"user_rating": 4.0, "review_count": 149, "name": "Hurricane Hotel", "reviews": [{"rating": 5.0, "title": "Unexpected Spanish Find", "text": "The Hotel Hurricane outside of Tarifa, Spain was a great and unexpected find. Located just west of Gibraltar and east of Cadiz, the resort like accomodation was a welcome releive from the overcrowded and touristy noice of the larger Costa del Sol towns. Set on a fairly deserted stretch of beach directly opposite Africa -- you could see the mountains in the distnace during the day and the lights of Tangers at nigth -- the two story hotel features spacious rooms with shared verandas overlooking the tropical gounds or the ocean. Simply being at the point where the Atlantic and Meditaranian meet was a real experience as well.", "user": "CalTexTraveler", "date": "December 21, 2006", "id": 6480019}, {"rating": 3.0, "title": "Just OK", "text": "But back to the property itself. There is a large great room in which the check in desk separates the lounge/restaurant/bar from the front. Behind thee building there is a large pool while off to the side and down a jungel pathway is a \"shack\" serving lunches and drinks. At night, a blazing fire warming those conversing in overstuffed chairs and couches and perhaps awaiting to dine in first class style in a casual gourmet mode with an erxtensive and often experimental menu. Breakfast is equally as good, perhaps werving those most active who intest to spend the day surfing or windsurfing or just exploring the many nearby towns.", "user": "LucySnowe", "date": "October 19, 2006", "id": 5971833}, {"rating": 4.0, "title": "perfect chill", "text": "I have to add that we arrived on a cold and blustery day and departed whan the sun was in full bloom. Unlike so many seaside properties, the Hurricane is equally welcoming under either scenario. Great place!", "user": "hollguer", "date": "April 6, 2006", "id": 4943091}], "location": {}, "stars": 4, "variance": {"poor": 10, "average": 18, "very good": 43, "terrible": 5, "excellent": 73}, "aka": "Hurricane Hotel Tarifa", "slim_ranking": 0.166666666667, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}