{"user_rating": 3.5, "review_count": 862, "name": "Husa Oriente", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "What I'd read about booking rooms in Barcelona far in advance was right.. We booked a room at this hotel because it was one of the few available in the city due to our late booking - 3 weeks before we were to go. In comparison to others we saw, $200 for the night here was not a good value.", "title": "Not worth the money", "helpfulness": 1, "user": "lammejn", "date": "October 31, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 6034952, "likes": {"liked": "— Location and free breakfast buffet", "disliked": "— Hotel staff - didn't even tell us about free breakfast"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "The room itself was below average in furnishings and lighting but the real problem was the reception desk staff. One example was our difficulty with operating the electric monitor in our room. We've traveled extensively in Europe but had never encountered one of these things that requires your room key to turn the lights on AND keep them on. Even with my husband's fairly good Spanish, they couldn't seem to understand that we didn't know how to turn on the lights in our room - I can't believe we were the first guests to have a question about them. It finally took another guest we met in the elevator to show us what to do.", "title": "Check your room first", "user": "Fabricio", "date": "October 13, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 5947730, "likes": {"liked": "— location", "disliked": "— service"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006", "text": "That being said, the breakfast buffet was very good and would be good for groups traveling together.", "title": "What A Shame!", "helpfulness": 1, "user": "MBidel", "date": "October 3, 2006", "detail_rating": {"front_desk": 1.0}, "id": 5902432}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We booked the hotel on internet hoping we would get the room. Hoping, because we first phoned and had been told that there were no rooms free. But on the internet we managed to get one. We made a reservation for the best room so the most expensive one. When we got there the receptionest (he could be more client-friendly) gave us a room you couldnot even turn your back and which was much less than we expected.", "title": "Bit disappointed by Oriente", "helpfulness": 1, "user": "Lucy Demi", "date": "September 23, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 5828754}, {"rating": 1.0, "title": "Beware of Husa Oriente!!!", "text": "We went back to the receptionist but he said that there was no other room available. We wouldnot accept that and after some arguement he suddenly find us another room. This was bigger and more what we expected but not really.", "helpfulness": 10, "user": "Nubiangyrl", "date": "August 31, 2006", "id": 5730785}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "It is a clean hotel without the eye for detailles, a staff that need a better manager and first-receptionist and the rates are too high.", "title": "Very Reasonable", "helpfulness": 1, "user": "Mickwford", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5729153, "likes": {"liked": "— location", "disliked": "— The noise in the morning from garbage trucks."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I have just stayed in this hotel, 20 mins in a taxi from airport. It is in the main street of Las Ramblas surrounded by entertainment.. cannot beat the location. its noisy on a night time .. but i would definately recommend it. Very clean, Very private, no hassle .. an overall excellent hotel.", "title": "very central, very clean", "helpfulness": 1, "user": "donnyroo", "date": "July 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8223827, "likes": {"liked": "— location and cleanliness", "disliked": "— hard beds"}}, {"rating": 4.0, "title": "Excellent location", "text": "Stayed at Husa Oriente from 13-16.7.07 with my two friends. We had a triple room which was very spacious with a huge bathroom. Both the bedroom and bathroom were spotlessly clean. We hadn't booked breakfast so cant comment on the food. The staff were very friendly and helpful and we were able to leave our cases at the hotel until we returned to collect them en route to the airport. The location was great - right on La Rambla so convenient for everything. However - and this was the only downside - the noise in the night from outside was terrible - mostly drunken, noisy folks roaming about which went on til the very early hours, so I would recommend earplugs! Our room was at the rear so I dont know how noisy it would have been at the front! Very enjoyable overall and I would stay there again.", "helpfulness": 2, "user": "Merly21", "date": "July 17, 2007", "id": 8132119}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Right on Las Ramblas, this hotel is conveniently located. If you value quiet, ask for an old room at the back, if you prefer style, ask for a modern room overlooking Las Ramblas. Be forewarned, the revelry continues through the wee hours. If you want both, stay off Las Ramblas. The staff was extremely accommodating, except for one desk clerk that we referred to as \"the burro.\" The rooms were clean and the location was pretty good. We were able to walk to Sagrada Familia as well as the Marina. The primary attraction is that they were able to accommodate a family of four in a quad. The room offerred two twin beds and a pull-out sofa. That having been said, we will stay at another location next time, just to experience another part of the city. The sights, sounds and tastes of Barcelona are wonderful! I encourage you to taste a authentic paella, gazapcho and sangria. Tour La Sagrada Familia (awe inspiring), the Picasso Museum, the Aquarium (for kids), and the gothic center. Viva Barcelona!", "title": "Does in a pinch", "helpfulness": 1, "user": "thebestforless", "date": "June 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 8029999, "likes": {"liked": "— The central location and mostly accommodating staff", "disliked": "— The noise of Las Rambals and the one rude desk clerk"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Excellent location in the middle of everything in Barcelona. Good breakfast and everything was clean and tidy! Spacious room but a lot of noise! Nothing special regarding room decoration.", "title": "Nothing special except the location", "user": "Mariako", "date": "June 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7876664, "likes": {"liked": "— The location", "disliked": "— Room decoration"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "If I visit Barcelona again I may stay somewhere else, just for change!", "title": "No problems, great location.", "user": "Markthemover", "date": "June 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7779730, "likes": {"liked": "— Location", "disliked": "— Poor double glazing for noise reduction."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Apologies for my slightly biased review, but the incredible 65euro a night deal for a room from laterooms was the bargain of a century.", "title": "Get booking now", "helpfulness": 23, "user": "TBeckett100", "date": "May 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3469379}, {"rating": 4.0, "title": "don't belive all you read !", "text": "The hotel room we had was fantastic. It proves cheap rates don't give you the worst room. When booking drop them an email and ask them for a 1st floor room overlooking Las Ramblas. The rooms are newly decorated and furnished to a high standard. I would have paid twice what I did for that room.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 4, 2005", "id": 3438625}, {"rating": 2.0, "title": "Unmet expectations", "text": "My husband and I decided on this hotel because of all the good reviews we read about it and the prime location. When we checked into the room, we realized it was not what we read about at all. We had paid over $250 a night only to find that the room was small and looks unfinished because of the plastering on the ceiling. Telephone was not working. TV was not working. Hot water was inconsistent when showering. There was no hair dryer. I should also mention that we were shocked when someone unlocked and walked into our room. We later learned that the receptionist had made a mistake and assigned the same room twice. That perhaps was an honest mistake on the part of the receptionist and we can accept that. However, when we reported the problems to the front desk, the receptionist was very rude. He was not apologetic at all for all the inconveniences. The gentleman who came to look at the TV and eventually changed the TV, however, was very courteous and helpful. He helped us call the taxi and carry the luggage out on our last day there.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5471316}, {"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "We stayed for one night (24/06/06). The room was at the rear of the hotel so we didn't experience any noise (didn't have a great view though). The key feature of the hotel, \"the Ballroom\" where we thought we would have breakfast was a building site. However, we had breakfast in the other ballroom which was nice. The breakfast is great.", "title": "Very good Location (very friendly Staff)", "helpfulness": 6, "user": "Surfingh2o", "date": "July 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5420089}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Ever though I moaned a bit. The room was large, clean and tidy. I would have no problem recommending this hotel to anyone. A nice friendly hotel in an amazing location.", "title": "Too Noisy", "helpfulness": 2, "user": "RooMontreal_Canada", "date": "May 15, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 5075629}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "My wife and I booked four nights in the hotel and did not enjoy the experience. Although clean and friendly the noise level resulted in no sleep. Rooms on the first floor, right hand side of the building are to be avoided. There are recycling and trash bins outside the windows that are collected in the early hours of the morning. Our windows did not lock properly and provided no barrier to outside noises. On the plus side, the location is excellent.", "title": "Excellent Location", "helpfulness": 6, "user": "Lindy_M_11", "date": "March 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4727305}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "I stayed at The Orient in November 2005 with my husband, it was in an excellent location on the Ramblas. We stayed for a long weekend, didn't have any problems with noise, even though we were overlooking the Ramblas and had a balcony. The hotel was undergoing refurbishment to the rooms at the time and, while our room had not been refurbished, it was extremely clean and the maid visited daily. The breakfast was excellent and it was in an absolutely beautiful balcony room overlooking what was once the ballroom and gave you a taste of the hotel in its glory days! The staff were very helpful and pleasant and booked us a taxi for when we left and stood at the door to await its arrival then carried our bags out for us. I have nothing bad to say about this hotel, would definitely reccommend it and would certainly return. One word of warning.......DO NOT go to the chinese restaurant next door to the Oriente, it could seriously damage your health and spoil your holiday.", "title": "At the Heart of it", "helpfulness": 9, "user": "Alysoneva", "date": "March 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4603423}, {"rating": 4.0, "title": "Perfectly acceptable", "text": "I agree with the last reviewer - and not with the majority of others. The hotel is absolutely fine as a 3*. Clean, well designed rooms (albeit a bit small - but not surprising for the location), comfortable beds, hot shower, stylish furniture and brilliant location. Don't worry about the noise from La Rambla as the double glazing is very effective. Very helpful reception staff who all spoke English to a certain degree and a restaurant and bar in-house.", "helpfulness": 4, "user": "Jimbob72", "date": "February 28, 2007", "id": 6856222}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Would not hesitate to stay here again when in Barcelona.", "title": "Had no problems with this hotel at all", "helpfulness": 8, "user": "Joanne E", "date": "December 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6440178, "likes": {"liked": "— Location", "disliked": "— Could have had tea and coffee making facilities"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "When I first booked this hotel I was dreading arriving after reading the previous results.", "title": "The Worst Hotel Experience of my Life", "user": "JohnnyLegg", "date": "November 6, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6079177, "likes": {"liked": "— This was such a rip off there was absolutely nothing to like", "disliked": "— Totally not handicap available - bad rooms, bad service, bad location - really advertised falsely"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "I don't know where these people were staying who said it was basic, the t.v. didn't work, the shower was broke. People made it sound like a run down hotel.", "title": "Very Basic Hotel (it has beds), Good Location", "user": "Desiato53", "date": "November 3, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 6052121, "likes": {"liked": "— Location", "disliked": "— Hotel"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Written about in some books as being at the seedy end of the Ramblas, I'm not really surprised as some doubtful characters did abound in the off streets nearby in the gathering darkness. My wife nearly got done in the Casca Antic in broad daylight, with a sizeable squirt of tomato ketchup on her back in order to make her open or even put down her handbag - to look for tissues or the like, while being circled by a gang of young men moving like wolves!! However, it was nice to get back to the safety of the hotel with its approachable and supportive staff who had no hesitation in advising and helping us. Initially, we did have a \"matrimonial bed\" in a rather small but silent room, but as we seemed to trip over everything, we asked to be moved to a bigger room, which indeed, did overlook a particularly busy and noisy area with the police vehicle depot next door. No need to ask whether or not they came to life at night.", "title": "A good experience", "helpfulness": 13, "user": "Iwan-Machen", "date": "January 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4359131}, {"rating": 4.0, "title": "Will Stay there again", "text": "We got used to it, however, and even slept well at times in the four nights spent there in plenty of warmth. A decent multiaspect plentiful continental breakfast could be varied on a daily basis, although the lack of human involvement did seem to give the Comedor a bit of a cold atmosphere.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 14, 2006", "id": 4352337}, {"rating": 1.0, "title": "Terrible treatment", "text": "If I wanted to nitpick, I have no doubt that I could moan about a few things, such as no room telephone- I had my mobile: one had to hire a hair drier- deposit returnable: TV was all Spanish- then we're in that country:( I did see Barca and Real Madrid playing, however!!", "helpfulness": 9, "user": "A TripAdvisor user", "date": "January 9, 2006", "id": 4333311}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "But it was clean, warm, comfortable and convenient!!! And ONLY Three Star", "title": "So Noisy!", "helpfulness": 2, "user": "missfifi42", "date": "January 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 2.0}, "id": 4329926}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "Large clean rooms, friendly service, affordable prices, within walking distance of the market, cathederal,port and much more.", "title": "Two twenty something girls in Barcelona!", "helpfulness": 13, "user": "LondonUKDee", "date": "January 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 4329809}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "This hotel was recommended to us for the location and the cleaniness. It was very clean and the location great, but for the price, it wasn't worth the money. Staff was friendly, but not too accommodating. The hotel is still going through renovations on the outside, so you do hear some work going on. It wasn't too bad for us though, because we were there on the weekend and during the feast of St.Jordi. Our room was not situated along the Ramblas, so we didn't hear too much pedestrian noise. The only thing that really bothered me about this hotel was that the shower was small and there was nowhere to put your soap, shampoo, etc.. Also, the screen that closes off the shower does not prevent water from soaking up the bathroom floor. Yes, they do have a hairdryer and it also has a room safe, unlike what others have said previously. The free breakfast buffet was good and plentiful. If I'm ever in Barcelona again, I would defitnitely look into another hotel, if only to experience something different. If you are not going to be spending all of your time in your room, then this is all you'll need.", "title": "Clean and decent hotel", "user": "Dina808", "date": "May 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7539682, "likes": {"liked": "— Location", "disliked": "— The bathroom"}}], "location": {"country": "Spain", "region": "Catalonia", "continent": "Europe"}, "stars": 3, "variance": {"poor": 91, "average": 201, "very good": 346, "terrible": 65, "excellent": 159}, "aka": "Husa Oriente Hotel Barcelona", "slim_ranking": 0.593511450382}