{"user_rating": 3.5, "review_count": 592, "name": "Husa President Park", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Not in the best location - it is about 7 mins' walk North of North Station, so it's in the opposite direction from the main sights and shopping and nightlife. But it's a nice and cozy corner next to a Park, so a good choice if you want to be away from the sounds, but not too far away. A taxi should take €7 to 10 to Grand Palace, or you can walk it in some 30 minutes.", "title": "Decent Hotel in a Quiet corner near Brussels North Station", "user": "sankar", "date": "October 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 143364714}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Rooms are fairly large with free wifi. The Bathroom is a decent size but a little dated, and needed upgradation. Toiletries are very basic (Liquid Soap Dispensers at the sink and the tub/shower). Staff were friendly and helpful, and service standards pretty good throughout.", "title": "Standard large corporate hotel", "user": "TimTWickham", "date": "October 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 143173255}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "However, next time I would probably stay closer to Central Brussels, unless I find a particularly good deal at this hotel.", "title": "I like it", "user": "pothirakh", "date": "October 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 143023562}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "A standard big hotel - long identical corridors of identical rooms, clean, comfortable, efficient. As they were pretty full I was upgraded to a suite free of charge, but the living room just had a small settee and a poorly tuned TV, so fwer channels than the one in my bedroom. Use the free WiFi, not the charged for internet cable. Restaurant/bar serves good evening food from a limited menu though service was a bit slow. Standard big hotel breakfast. Location is a bit out of the center, on the boundary between corporate tower blocks and high density apartment blocks. Best metro stop is Rogier, and then 10 - 15 minutes walk tot he hotel.", "title": "Hotel in office location part of town", "user": "CharlotteLondonT", "date": "October 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 142962205}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "the first impression is this hotel is too far from light and sound ! it stands so lonely and near the police station. The best is FREE WIFI even inside the room! The room is clean ,big enough and friendly staffs .", "title": "best partner if you are in Brussels for work", "user": "EmCu", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142868378}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel is situated near the North Station in the \"business\" and better side of the Station. There is no restaurant, or supermarket that we could identify close to the hotel so you can only rely on the station and of course going to the city center if you want to eat or buy something.", "title": "Average is the word", "user": "Ioana N", "date": "September 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 139930761}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I liked the space of the room and that it had an anteroom with a desk where you can put your laptop when you are working. Everything was clean, well kept, enough space for clothes. There were some small things: towels and lingerie a little worn-out, but clean; bed kept sliding on the flooring, but was comfortable; we had no soap, only 2 in 1 shampoo and body wash, but seemed good quality; we found it difficult that we didn't have fridge and neither a supermarket in the area. We had some issues with our access card, it kept deactivating probably because of being next to the phones... Personnel was nice and helped by storing our luggage after check out. I think it was good value for the money after all.", "title": "Average hotel, dated, away from city center", "user": "Erannn", "date": "September 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 139710703}, {"rating": 3.0, "title": "Good location, tired accommodation & technology", "text": "Very dated hotel. Looks like hotels from the 80's. No a/c, soap dispensers, my room was directly facing the window of another room.... For a hotel with no air condition, this make privacy in your room an issue. Ver slow reception service. Nothing near or around this hotel. Haven't stayed in many other hotels in Brussels, but I'm sure there are better options then this one.", "helpfulness": 1, "user": "PRBloke", "date": "September 4, 2012", "id": 139412623}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Third or fourth time I've stayed here for work, decent price and guaranteed secure parking are two things that bring us back. Unfortunately there's no air conditioning and it's noisy outside.", "title": "Wanted to like it more, but just couldn't", "user": "GioesAbroad", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 139409933}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "What's really let it down this time is the free wifi, which is quite frankly appalling. No signal in the rooms, when you can get a signal, in the lift lobby, you can't log on because there are too many users. And with a poor mobile signal too, lack of connectivity has prevented some important work being done. We've had to go to a bar instead.", "title": "Ageing Hotel, but great value", "user": "WanderingKirklands", "date": "September 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139291268}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Although this hotel isn't in the most exciting area of town (at the end of a long street of offices) it is near the Gare du Nord and only three stops from the Bourse, so very handy for travelling into town. Although the hotel is in a very quiet area with no people around at night, it is right next to a large police station so is still very safe.", "title": "Great value", "user": "HolidayMegan", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 141158062}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The hotel was modern and very clean and tidy. Staff were helpful and the rooms were well decorated. The bed was massive and very comfortable.", "title": "Elegant, superior and exceptional value for money", "user": "Anje20", "date": "September 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141039488}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We didn't visit the bar or restaurant so cannot comment on food, breakfasts, etc.", "title": "Business in Brussels", "user": "Catherine P", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 140840569}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "We stayed here for 2 nights during our trip around Europe, The rooms were extremely spacious. The hotel is beautifully designed with elegant \"president like\" finishes. We had buffet breakfast included and it was excellent. We also ate dinner here both nights as the olympics was on & we wanted to watch it at night from where we were staying. All the entrees, meals, desserts and drinks were exceptional. This place really knows how to cook great food with super fresh ingredients and beautifully presented. The hotel is also in a good location, just enough away from the noise but still walking distance to most things - the bike hire is also about 100 metres down the road which was very handy for us. We would definitely recommend staying here.", "title": "Never again", "user": "The Dude D", "date": "September 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 140807171}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "I arrived at the Husa President Park Hotel direct from a red eye flight from JFK. It was around 10:30 and I desparatley wanted a shower! They told me that they didn't have any rooms available yet, but I must have looked pitiful, so they told me that for 10 EURO per hour I could check it. I jumped on the opportunity and we as very grateful! I ran up to the room and took the most glorious shower ever! The shower heads in the bath are more spectacular than any other European hotel I have stayed in. ( nice rain shower heads! ) The hotel conceirge was very helpful during my stay and the rooms were very adequate. I was very happy with the hotel stay. It's only a 10 minute walk to the Sheraton city center complex and taxi rides are only 15 minutes away to really any where you need to go. The hotel does allow dogs and one morning I heard a small dog barking repeatedly which was annoying.", "title": "good quality for the money", "user": "Elena E", "date": "September 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 140737798}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We stayed at the Husa president Park on a recent trip to Brussels. The hotel was very clean and bright with pleasant staff. Our room was a good size with a big bed even though they were two singles pushed together. The en suite was spotless. There was hairdryer and minibar in the room. There was a kettle supplied to make a hot drink which we appreciated. The only thing was there was only one english teabag supplied all the rest were herbal or coffee.", "title": "Nice hotel, pleasant stay", "user": "sanjoOffaly", "date": "October 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142813004}, {"rating": 3.0, "stay_parameters": "Stayed September 2012", "text": "Breakfast was a good variety, hot and cold with good service.", "title": "Good Hotel nice stay", "user": "Mauricio Z", "date": "October 1, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 141755683}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "We have only one gripe with this stay and that was that there was no residence bar, we had arrived back from a night out, it wasnt late but we were told that the bar was closed, which was disappointing because we had been told that there was no closing time in Brussels.", "title": "Love it!", "user": "Dearana", "date": "September 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141686652}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "However, all said we had a great time, very enjoyable stay.", "title": "Trip to Brussels", "user": "Tabitha M", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141591560}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The hotel it us very nice disigned, it's easy to get there, it's easy to get around, but has almost the same problem of the mayor of the hotels in Eurupe, the rooms to smal, this particular hotel is Spañish company, they do speak Engish and of course Spanish, it's nice Expencive but nice, one thing almost forget, the parking if you are driving you car, just to park it's very very Expencive, but the parking lot it's ok, have fun always!", "title": "First class customer service with a smile and nice rooms at a reasonable cost", "helpfulness": 1, "user": "Island H", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 141471357}], "location": {"country": "Belgium", "continent": "Europe"}, "stars": 4, "variance": {"poor": 66, "average": 156, "very good": 239, "terrible": 34, "excellent": 97}, "aka": "Husa President Park Hotel", "slim_ranking": 0.440414507772, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 3.5, "rooms": 3.5, "location": 3.0}, "description": "Husa President Park is situated in Brussels, a 10-min drive from Brussels Expo and a 5-minute walk from Metro station Rogier. The hotel has wellness facilities and a large garden. Husa Presidential Park is located an 8-minute walk from the Brussels North Station. Grand Place and the Square Brussels Meeting Centre are a 5-minute drive away."}