{"user_rating": 3.5, "review_count": 96, "name": "Hyannis Inn Motel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2001", "text": "This motel is located right in the middle of main street in hyannis. Everything is in walking distance. The only driving you would have to do is to the beach or maybe a whale watch or restaurant in another town. You can walk to the harbor and take a nice Jazz cruise at night. Take the ferry over to Martha's Vineyard or Nantucket for the day. Many, many restaurants and ice cream shops located on main street. There is a small amusement area with a few rides and an arcade for the little ones. A mini-golf for the family. Some good shops to check out. The motel has a indoor pool for any unpleasant weather you may come across. Craigsville beach is very close and one of the nicest in Cape Cod. It is very kid friendly and it has a few small shops and grills right on the beach. It also has a public restroom that is usually very well maintained. I really recommend this motel for a young couple without children who want to be in the middle of everything and not have to drive miles for entertainment. It could be enjoyable for families with young children but the rooms are pretty average with not much to do so they may get bored easily here. You won't go wrong staying here.", "title": "Great location but nothing spectacular", "helpfulness": 7, "user": "MaddVibes", "date": "January 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4387977}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "Pros: This motel is located on Main Street near many shops & restaurants. It is about a 10 minute walk to the Ferries that take you on harbor tours, whale watching or to Nantucket or Martha's Vineyard Islands. Duckmobile Tours & The Kennedy Museum are just down the street. Miniature golf is also nearby. We stayed in a Deluxe room which was very large & clean. There was a comfortable king bed, nightstand, dresser, desk & chair, couch, dining table with 2 chairs, TV & fridge. The closet was large & the bathroom had a heat lamp. Bluebirds Restaurant (breakfast only) & Elbow Room Cocktail Lounge is on the premises. There is an indoor pool behind the office. The ice machine & lots of brochures & booklets which described what to see & do & where to dine in the area along with sample menus from local restaurants were also in a corner of the pool area behind the office. I think the price is appropriate for what you get. The rooms on the 2nd floor have porches.", "title": "Nice Location..Clean, large rooms.", "helpfulness": 6, "user": "bainso", "date": "October 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3986523}, {"rating": 1.0, "stay_parameters": "Stayed September 2005", "text": "Cons: The rooms are very plain. They provide soap but no shampoo, no hair-dryer, no coffee-maker & no clock or radio. When the heat clicked on in the room it was very loud & irritating when we tried to sleep. We could hear the people talking in the room next door until early in the morning...we could make out every word.", "title": "Steer Clear of the Manager", "helpfulness": 6, "user": "Bonzoid", "date": "September 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 1.0}, "id": 3896919}, {"rating": 3.0, "stay_parameters": "Stayed June 2004", "text": "My friend and I recently stayed here. Upon arriving at the hotel, the guy at the main office immediately turned us off. He was rude as soon as we walked in. We were hoping to share the room with two of our other girlfriends since we paid for the deluxe room which has two queen beds and a pull-out sofa. The manager was very direct and informed us, this was not an option, not even if we paid a little extra. So, we asked for our money back, but he refused. So, my girlfriends ended up having to find another place to stay, which was difficult on a Saturday night...very frustrating. After being spoken to quite coldly, we went to our room, which was actually quite nice, very spacious for the maximum number of guests (2) which they allow...", "title": "Not Awful", "helpfulness": 13, "user": "NearPerfect9", "date": "May 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3490809}], "location": {"country": "United States"}, "variance": {"poor": 3, "average": 15, "very good": 36, "terrible": 13, "excellent": 29}, "aka": "Hyannis Hotel Hyannis", "slim_ranking": 0.409090909091, "description": "Located right in the middle of Main Street: Walk to Shops, Restaurants,Harbor & Island Ferries, JFK Museum. Breakfast Restaurant, Cocktail Lounge, Pool & Saunas, Free WIFI, Discounts for AAA,AARP & Military. Clean, Comfortable & Affordable.Deluxe Family rooms & Whirlpool rooms."}