{"user_rating": 3.5, "review_count": 160, "name": "Hyannis Holiday Motel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Stayed here for a girls getaway last week and chose this location because the price for the location was great. $142 w/taxes for a room w/2 dbl beds. We wanted to be right on the harbor since we were taking a ferry the next morning to the Vineyard and it was very convenient for that. We had read reviews and checked out photos so we pretty much knew what to expect. Rooms are pretty basic, with old furnishings, but our beds were relatively comfortable and the room was very clean. The maids were very friendly throughout the property. Plenty of parking during our stay. We asked if we would be able to get an upgrade to a front room since we were there to celebrate our 40th b-days, but were told you can only get an upgrade if you pay extra. Little disappointing as I know most places have no problem doing so at no extra charge if there's vacancy, which there was. We had a balcony that was a little unnerving, and looked out at the back roadway which we saw people doing community service picking up trash. Otherwise, the front of the building has a nicer view, clearly since it faces the harbor. We just sat out in front of a room which we knew was vacant during the evening. There was definitely a funky smell to the room that unfortunately followed my luggage home. I had to leave it out for a night to air out. Ask for a second floor room, as I can see the downstairs hearing every foot step, especially if there were little ones running around. Was good to hit the juice and muffins before walking over to the ferry. All in all, I would definitely stay here again for the price and location.", "title": "Fantastic location, but definitely a motel!", "user": "Sumrtyme1973", "date": "July 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 167984577}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Stayed July 8-11,2013. No change from two tears ago. Still fifties style, no frills. The outstanding point about this property is its cleanliness. Although the the plumbing is old everything works fine, better than some newer motels. We stayed in room #70, second floor with a view of the harbor. Just walk across the street to eat at Spanky's,, get a tour boat or peruse the shops along the harbor. At night you can talk a short walk to the park for a free concert or sit on the balcony and listen to music coming from the patio of the Black Cat Tavern next door. Both indoor and outdoor pools were clean and easily accessible. Light breakfast every morning with cereal, pastries, juice and coffee. Best price in the area.", "title": "Trip to Cape Cod", "user": "Chuck13108", "date": "July 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167948821}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We checked in on July 5th [2013], and the area was packed of course. The room was very simple but adequate. We enjoyed the outdoor pool and the view from the porch. I've stayed here before and will return. It was about $150 a night which isn't bad at all for that location that time of year. The only bad thing is that there was no ice. You had to go to the lobby and get it out of a cooler. There were other large coolers in other parts of the hotel but they were empty. We heard lots of complaints about this. I've never been at a hotel in the United States that didn't have at least 1 ice machine.", "title": "No frills, but great deal.", "user": "Bruce T", "date": "July 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 167826519}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Stayed on Sunday the 8th (after the hotel down a block tried to charge $50.00 extra for unseen charges,AND $15.00 for parking) We stayed here..Very friendly and clean!! Perfect walking distances to the bars!! It reminded me of something from the 60s which I actually liked!! The rooms had a back door with patio sitting area!!", "title": "Perfect for the area!!", "user": "Carol D", "date": "July 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167810086}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We have stayed in Hyannis before at the Cape Codder outside of town so this location was great- right on the harbour for the ferries and a five/ ten minute's stroll to Main Street for all the shops/ restaurants/ bars, etc. Room was fairly basic- no fridge, hair drier and could do with a make-over, but clean, spacious and comfortable. Coffee and pastries are collected from a room on the front to eat in or take back to your room. This is a motel not a hotel but is obviously popular- we stayed over the 4th july weekend period. Ask for a first floor room- these have a little balcony- ours didn't.", "title": "Great harbour location.", "user": "reed4design", "date": "July 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 167291871}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed one night and were sad to see our reserved Water View upgraded room had No View of the Hyannis Port or the sea. It overlooks a very large ferry parking lot. We asked the manager for our reserved water view room and they said ..go outside your room and look from the outside open walkway, where you can see a small glimpse of the port... No view from the rooms!", "title": "Misleading Ads and Short Sheets", "helpfulness": 1, "user": "JC W", "date": "August 10, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 171672471}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The hotel uses does not use fitted bottom sheets but saves money using flat bottom sheets which miss covering the mattress by 6 inches.... This means you sleep on an uncovere mattress!. This is an un-sanitary practice and is disgraceful.", "title": "The place to stay on The Cape when you're on a budget!", "user": "KurzMom", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171173389}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "On the good side, the room was clean and the shower great.", "title": "Weekend Trip", "user": "OFBDF", "date": "July 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169986652}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The property is older and needs some maintenance...", "title": "We would return", "user": "Susan L", "date": "July 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 169367540}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Only stay here if no other place is available... Since this motel is over priced and dishonest.", "title": "2 nights in hyannis", "helpfulness": 1, "user": "josh y", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169321374}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We stayed here for one night in August. It is located right on the harbor. The motel was very clean and a good value for it's location. I would stay here again when staying in Hyannis. Staff was friendly. You can walk to almost everything Hyannis has to offer from this location.", "title": "Great Location. Very Clean Motel. Nothing Extravagant But Nice.", "user": "MaddVibes", "date": "September 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 177449663}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "The location is excellent, you are right near the harbor and Main st. I expected to be close to the beach,but turns out it was a 20 minute walk. It's hard to walk that far with all your beach stuff. It was only a 2 minute drive and 20$ in parking per day. I would have preferred to walk but understood seeing as no hotels were close to Kalmus beach. The room is average,nothing special and clean enough. Skip the breakfast, most stuff is stale and there are tons of better places quite close. I recommend if you are on a budget like we were.", "title": "Great of you're looking for a cheap place in a great location", "user": "CaribbeanQueen2222", "date": "September 16, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 177415519}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Centrally located to downtown Hyannis and harbor. Superb attention to cleanliness. Friendly and attentive staff. Simple amenities AND great value in a vacation area. Spectacular sunset views from deck. Everything one needs for a Hyannis holiday.", "title": "Everything one needs for a Hyannis holiday!", "user": "drbarbar", "date": "September 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 177240343}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed August 6,7,and 8 2013 and found that the Hyannis Harbour area a very lively place and it was handy to be able to walk around the marina and restaurant area without the somewhat hectic parking situation. The ferry docks for Nantucket or Martha's Vineyard are just a few minutes walk and you have the choice of fast or traditional ferries. The fast ones cost more but give you the flexibility of more trip times. The other commenters seem accurate to me but I swung toward the fact that updated rooms in that area were going to be much more expensive. The pastries and coffee and juice are a small breakfast but enough to get you going on your days adventure.", "title": "reasonable considering the good location.", "helpfulness": 3, "user": "tincase", "date": "August 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 171959780}, {"rating": 2.0, "stay_parameters": "Stayed August 2013", "text": "Rooms are outdated and dusty", "title": "You get what you pay for", "user": "BostonianTraveler27", "date": "August 12, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 171876210}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "My Wife and I stayed for our 2nd time over the Fourth of July weekend. We love the \"though back\" style of the hotel and can't figure out how they get their white towels so white. The rooms are beyond clean and the staff are more than helpful. Location is everything and was great during the busy weekend as we were able to walk to everything.", "title": "Why stay anywhere else??", "user": "tshelto000", "date": "July 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 167290587}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Looking forward to a return trip in August and will return often.", "title": "Great location", "user": "EZTravel99", "date": "June 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 165752981}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We have been at the Hyannis Holiday Motel before and enjoyed our second stay. The spacious room comes in handy when traveling with a family. The staff was excellent; the room was cleaned thoroughly every morning. The indoor pool came in handy as our stay was cool and rainy. The location on the harbor with a great coffee shop nearby made up for not having an in-room coffeemaker or microwave.", "title": "Clean, comfortable", "user": "WeeWhiteWabbit", "date": "June 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 165711054}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "This hotel is good for business but I wouldn't put it as my top choice for leisure as its a bit too far from attractions and there isn't much choice for parking in these parts. Also local beaches are mostly private. Hotel was clean and comfortable, bathrooms good looking but not finished fully. Fridges are noisy and AC far too loud for use. Breakfast is not included but the ihop and panera are close by. Hotel is opposite two restaurants but we didn't eat there so I can't comment on the food.", "title": "We couldn't have picked a better hotel!", "helpfulness": 1, "user": "#1GatorFan", "date": "June 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 165377161}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We've never been to Cape Cod, so we had no idea where to stay. We really lucked out when we picked this hotel! It is an older facility and not luxurious, but everything is immaculate, the staff is fabulous, and the location can't be beat!", "title": "Great view of the harbor", "user": "Giaconda", "date": "June 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 165352591}], "location": {"country": "United States"}, "variance": {"poor": 17, "average": 45, "very good": 52, "terrible": 12, "excellent": 34}, "aka": "Hyannis Holiday Hotel Hyannis", "slim_ranking": 0.5, "description": "Our waterfront motel overlooks Hyannis Harbor and is directly across from the Nantucket and Martha's Vineyard Island Ferry boats. Our guests can walk to sandy beaches, restaurants, shops, local attractions and to downtown Hyannis. We are only a short drive away to the Hyannis Whale Watch cruises, Come Explore Cape Cod's Special Treasures."}