{"user_rating": 3.5, "review_count": 981, "name": "Hyatt Regency Atlanta", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I was very pleased about this hotel after reading some of the poor reviews here after I booked it on Priceline. I paid $84 and they gave me a room in the new tower (Radius) after I called and requested that tower and 2 double beds. Unfortunately they only had a queen in that tower so I had to change to the older tower for the 2 beds. The beds were great (seemed updated to me) and there was an iPod clock radio with dock which was a nice feature. The bathroom was a bit the small side, but the room was very spacious. The TV was old, so obviously these aren't the updated rooms, but for $84 it was very nice overall.", "title": "Not bad at all", "helpfulness": 1, "user": "K617L", "date": "August 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 19088773, "likes": {"liked": "— Value for price paid", "disliked": "— overpriced 24 hr market in lobby, and no free wi-fi"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "I did not have time to go to the gym, but it looked very updated, also the pool area was appealing.", "title": "Love, love, love Atlanta and this is a great location", "user": "MalibuStace", "date": "August 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19017529, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "There is a 24 hr market in the hotel if you are desperate, but the prices are ridiculous! There is a Corner Bakery across the street for a quick bite.", "title": "Not this Hyatt", "user": "fairadvisor", "date": "August 12, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 18865724, "likes": {"liked": "— The people who helped us in valet parking is much nicer than the people in front desk.", "disliked": "— Rude front desk personnel and old, dirty room."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Did not take the MARTA since everyone was saying the neighborhood was dicey, but I took the Atlanta link (a van that stops by the hotel twice an hour) for $29 round trip from the airport. That was very convenient!", "title": "Nasty- dirty hotel", "helpfulness": 1, "user": "elliev123", "date": "June 27, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 17296465, "likes": {"liked": "— The staff", "disliked": "— The room"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The staff was also very pleasant. Everyone said hello and was friendly, even just passing you in the hallway.", "title": "Wear earplugs when you flush the toilet!", "helpfulness": 1, "user": "ladyoneone", "date": "June 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 1.0}, "id": 17207416, "likes": {"liked": "— Close to aquarium", "disliked": "— In a very bad part of town"}}, {"rating": 4.0, "title": "Good stay", "text": "We stayed here for our one-year anniversary. Almost everything was perfect - we were upgraded to a suite, our package included breakfast, and we had champagne and strawberries delivered.", "user": "ShooterMcGavin", "date": "December 12, 2008", "id": 22661770}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The only drawback is the Avanzare Steaks restaurant, like most hotel restaurants, it is horribly overpriced - 5 star prices and the food and service are not up -to-par.", "title": "Not much to complain about the Hyatt Regency", "helpfulness": 1, "user": "Drchocolateg", "date": "November 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21490932, "likes": {"liked": "— the gym", "disliked": "— no free internet"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The restaurant that used to be in the top dome of the hotel was much better.", "title": "Priceline price made this a good deal.", "helpfulness": 1, "user": "marknthedark", "date": "September 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 20115577, "likes": {"liked": "— $70 per night on Priceline.", "disliked": "— the rooms are nothing to write home about"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "I stayed here for 3 nights this past week while attending a conference that was held at the facility. I booked my room through the property due to a special rate that was offered to those attending the conference (compared it to online prices and couldn't find a better deal). Parking was by valet and cost $24/night with in and out priviledges. I didn't look for any nearby parking due to the time of night I arrived but I would guess there wasn't much else available due to being located in downtown Atlanta (great location for anyone doing tourist activities). Check in went smoothly except I was placed in a room with a dbl bed instead of the requested king. I was given a voucher for a complimentary breakfast at a restaurant on site and was switched to a room with a king bed the next day which satisfied me. The facility was immaculate and had a great gym. There are several dining choices available on site and the hotel is connected to the food court of a mall. Beyond what I consider pricey parking, there is nothing bad I can say about it.", "title": "They succeeded in continuing to taint my view of their brand", "helpfulness": 2, "user": "ACoolJeweledMoon", "date": "September 16, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 3.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 20106978, "likes": {"liked": "— location", "disliked": "— cleanliness"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008", "text": "This hotel may be the largest in Atlanta. It is rated as a 4 star and I would agree but the rooms are nothing special. The staff were all pleasant and the desk clerk remembered our last name throughout our 4 night stay. The hotel is very well maintained. The location is good for downtown Atlanta, and there were many restaurants nearby. The CNN, Coca-Cola, and Georgia Aquarium tours are all within walking distance. I enjoyed the large outdoor pool but the other tall buildings kept the sun to a minimum even in the middle of the day.", "title": "Big, Old, Loud, Expensive", "helpfulness": 1, "user": "unamatrix08", "date": "September 15, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 20102438}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "I stayed in the International Tower at this hotel for a conference. The rooms nearest the tower corners are very quiet. There are rooms in this tower that are located directly in back of the elevators. I moved from one of these rooms to a corner room as the door chimes and elevator pulley noise were bothersome. A great city location and pricing was reasonable. I used the gym and found it well-equipped and all equipment in very good condition.", "title": "Enjoyed my visit to the Hyatt", "helpfulness": 1, "user": "VisitorBob", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28657118}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "The Hyatt Regency Atlanta is the place to stay in Downtown Atlanta. The hotel is conveniently located to all the great places to see in Atlanta. The Atlanta Trolley stops at this hotel where you can ride and hop on and hop off to some of the best attractions in Atlanta.", "title": "The Place to Stay in Downtown Atlanta", "user": "maximus217", "date": "April 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28526631}, {"rating": 5.0, "stay_parameters": "Stayed February 2009", "text": "The employees in this hotel are very hospitable and courteous. We didn't encounter a single employee who doesn't say hello or smile to you.", "title": "Great Hotel", "user": "Augustatravelers", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28405899}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "We booked a room in the Regency Club, which is located in the 22nd floor in the Atrium Tower. The room has been renovated and large by its own standard. The breakfast in the lounge is above average.", "title": "Great convention hotel", "user": "Foxtrot-BandB", "date": "April 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27766983}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "The fitness room in the hotel is open 24 hours and complete with all equipment you need to have a great workout. There's a pool in the hotel; however, it was not open due to the weather.", "title": "Best Place to stay Downtown", "helpfulness": 1, "user": "mrolfes", "date": "April 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 27251918}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Given the current economy, I figured a Priceline 4-star search would yield something decent in downtown Atlanta since our son is located in nearby Inman Park. We got the Hyatt for $60 per night. From the very start, I was treated well. My gold card status got me upgraded to a king suite without asking. I've never used Priceline before, so I was curious about the treatment I would recieve (a broom closet for the night???). My fears were unrealized. I was treated like the Prince I am. The hotel staff is terrific and the location is excellent. Some complain about the cost of services at the hotel. H-e-l-l-o! Have you ever stayed at a major downtown hotel before??? Yes, you're going to pay $27 a night for parking, $3.50 for a cup of coffee at the little cafe, and $8 if you need a bottle of Pepto from the gift shop. Still, it was a value. Don't even think about walking outside alone at night. But also don't be fearful about staying downtown. The hotel is an oasis and this place is an excellent choice for business or pleasure. Great workout room, too.", "title": "Well Done!", "user": "Reseda", "date": "March 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26968793}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "It is probably a more 'business' hotel than a leisure hotel but it served us well and I think we were upgraded to a fabulous suite room with an extra living area. There was always something going on down stairs in the bar area - ie lots of conferences hosted. Easy to get to from the airport. Metro station right next door. Food court next door as well and only 5-10 minute walk to world of Coke. Most things in Atlanta are on the Metro so it was nice to be so handy to this. HArd Rock Cafe just down the road as well and a superb Bakery across the road.", "title": "Fabulous rooms. Very popular", "helpfulness": 2, "user": "kiwitravelar", "date": "March 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26137882}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "I went to this hotel for a conference and it is a bit pricey. The restaurants are good, but again pricey. The rooms smell funky, kind of old. You can hear all the noise from the BUSY DOWNTOWN business district. It is near the MARTA train, so you can go anywhere from the hotel.", "title": "This hotel needs some renovations, overall good experience.", "user": "niqr", "date": "February 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 3.0}, "id": 25345701}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The Hyatt Regency proved to be an excellent choice for my wife and I for Valentine's Day. Our room in the international tower was spacious, clean, and most of all quiet. We walked to a sushi restaurant about a mile from the hotel for dinner and then took a cab back which saved us from getting the car out of valet parking more than once. Yes, parking is 27.00 but that is fairly normal in the big city. As for being a dangerous part of town, that was overstated in a few reviews. It is Downtown Atlanta and there are a few homeless people scattered about the streets. All in all, a great visit made even better by a comfortable room.", "title": "Wonderful Expereince", "helpfulness": 1, "user": "scteacher", "date": "February 15, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24594445, "likes": {"liked": "— Rooms are spacious and beds are very comfortable. Quiet!!!!!", "disliked": "— Parking"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The lobby is spectacular and the ability to get to the hotel by subway is a great convenience that should not be underestimated. To me, however, the gym is the main selling point - it is probably the best appointed gym I have ever used in a hotel. This balances out the fact that the newly renovated rooms are tiny. When I say 'tiny' I mean smaller than most European hotels. If you like to relax in your room, this is not the hotel for you.", "title": "Not the best", "user": "Happytravellerme", "date": "January 31, 2009", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 24056144, "likes": {"liked": "— The spectacular gym", "disliked": "— Tiny room"}}], "location": {"country": "United States", "city": "Atlanta"}, "stars": 3.5, "variance": {"poor": 95, "average": 189, "very good": 357, "terrible": 52, "excellent": 288}, "aka": "Hyatt Regency Atlanta Hotel Atlanta", "slim_ranking": 0.322916666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located on the legendary Peachtree Street and the heart of downtown Atlanta, Hyatt Regency Atlanta is the premier meeting and convention hotel. The 22-story atrium is an architectural \"first\" that revolutionize hotel design worldwide!"}