{"user_rating": 4.0, "review_count": 602, "name": "Hyatt Place Waikiki Beach", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "only stayed one night but the staff was super friendly at check in and the room was spacious enough for our family of four. Our corner room had great ocean views and it was a quick walk to the beach. Would stay there again. Got a great rate on bookit.com.", "title": "Great deal", "helpfulness": 3, "user": "cherryem", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127322286}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed at this hotel for 2 nights in March. The hotel was very clean, had up-to-date decor, and a good, comfortable bed. Looking out our balcony view we could see Diamond Head. The one down side to the room (#1840) is it is in a corner and sounded like a loud wind tunnel. So, the first night it was hard to sleep as the wind was so loud (also heard 4 ambulances but it was St. Patty's night so that is probably why). The wind tunnel noise was not quite as loud the 2nd night or maybe we were just more tired. The first day my husband spent a long time on the phone as our free room internet service was not working (he was transferred 3 times and they explained that they only had so many numbers available and they had to create a new one for him--we went downstairs to the lobby to use their computers as they couldn't get us set up for at least an hour.) There is a free continental breakfast which is about average for offerings and taste. There is a small pool but no hot tub. There is also an exercise room. The only parking available is valet at $25.00/day. Hotel checkout is at noon and they do not have a separate room you can shower and change in if you have a late flight. We had a 9 p.m. flight so they held our luggage from noon until 5 p.m.; however, we couldn't change or shower there after spending the day at the beach. This aspect was a little unsettling since we are Hyatt Gold Passport members.", "title": "Clean Hotel and Good Proximity to Waikiki Beach Area", "helpfulness": 3, "user": "MN_Travel_Bug_1", "date": "April 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 127299372}, {"rating": 4.0, "title": "Good bang for your buck", "text": "This newly renovated room was specious and well appointed. The staff was pleasant and helpful. Great location, walking distance to beaches, shopping, restaurants, night life. Would definitely stay there again.", "helpfulness": 4, "user": "Hpvd", "date": "April 3, 2012", "id": 127196764}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Room 1731 March 21-25, 2012 AND ENJOYED IT VERY MUCH! Spacious, clean and very comfortable at a fair price, what more can one ask for? Especially enjoyed the good breakfast each morning; that even on very busy days was replenished often so food always fresh and hot.", "title": "Hyatt quality at affordable price", "helpfulness": 4, "user": "LOinOregon", "date": "March 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "location": 4.0, "service": 5.0}, "id": 126888323}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Starbuck's coffee and nice selection of Tazo tea available in the lobby from very early AM and also avail in the breakfast area during service hours. As stated elsewhere Aloha's and greetings were in abundance.", "title": "Family Friendly and Great Staff", "helpfulness": 2, "user": "LookylooVancouver", "date": "March 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126813791}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "As much as I'd like to keep the Hyatt Place Waikiki Beach a secrect, it's too good not to write about. From the minute I arrived, I was greeted with the Aloha Spirit. The Bell person took my luggage, the valet took my car and when I got the front desk the Bell person had already told the Front Desk person who I was. Needless to say, the treatment was First Class. The hotel is renovated from a long standing hotel I'd even stayed at many years ago, however, you'd never know it after the full renovation Hyatt Place did. The facilities are airy, well done and modern. Unlike Hyatt Place properties on the mainland USA, this one is much bigger and much nicer.", "title": "Great New Gem of Waikiki", "user": "Flyintl", "date": "January 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123085301}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The rooms are spacious, the gym very goof for a Waikiki Beach hotel and the location (on the east side of Waikiki near the Honolulu Zoo) is convenient if you drive. It is not right on the beach, but only one block away. It is not a full-service hotel (meaning multiple restaurants, bars, etc), but it does serve breakfast, has a bar and lighter fare selections. The pool is small, but who goes to Hawaii to swim in a pool when the beach is a 3 minute walk away?", "title": "Great for Business, not for Vacation", "helpfulness": 12, "user": "Vicki S", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 122953879}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Best of all, the service is very Hawaiian! I'd recommend this hotel to all.", "title": "The absolute best bang for your dollar in Waikiki", "helpfulness": 6, "user": "KennyToye", "date": "January 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122724733}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "We are loyal Hyatt guests and had a last minute opportunity to spend the week after Christmas in Hawaii. All the Hyatt properties were booked so we were happy to find the newly opened Hyatt Place. We knew it would not have the amenities of a resort and are familiar with the Hyatt Place format. The service was the same Hyatt standard we know and love, however, this Hyatt place is in an urban location with construction, cars and trucks beginning in the early morning hours. It is so noisy that opening the sliding doors is not possible. Loud bangs, the constant beep-beep-beep of trucks backing up and construction equipment did not make for a peaceful vacation stay. If this had been a business stay, it would not have mattered because we would have needed to be up early anyway. Also, the housekeeping staff is extremely noisy. Instead pf placing their carts in front of the rooms, they throw the locks and bang the doors as they go in and out many times. It's quite distracting. The breakfast buffet needs to be re-organized to accommodate a full house. It was difficult to get around people to get food and drink since there was very little space in between the set-up.", "title": "Very comfortable, Beautiful, Exquisit, Friendly Hotel.", "helpfulness": 4, "user": "Cnv56", "date": "January 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 122602952}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "Amazing service. Great rooms. Good food and the best location. Two blocks from the beach, rooms offer ocean and mountain views. The best value in Waikiki. You feel safe and the breakfast is delicious!!!!!!!!!", "title": "Overall great hotel!", "helpfulness": 6, "user": "Musubi4", "date": "January 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122442440}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Of the many hotels I have stayed in Waikiki the Hyatt Place appears to be an extremely good deal. The included breakfast is a little limited in choices but still good and enjoyable by the pool on the third floor deck. The room was clean and full of light. Nice size TV, comfortable desk and corner reading chair. Very small balcony. Nice large shower and free wifi.", "title": "Clean and cofortable, centrally located", "helpfulness": 2, "user": "SashaTozzi", "date": "May 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129665939}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "In the lobby there is a bar with a limited selection of beverages but perfect for a night cap, if needed. The hotel is one block from Waikiki beach, the Zoo, and endless stores and restaurants.", "title": "We liked it!", "helpfulness": 7, "user": "COmamma", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129200845}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Staff was friendly and helpful when needed", "title": "Very Good Hotel, worth the stay!", "helpfulness": 6, "user": "loverlylyllah", "date": "April 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129122838}, {"rating": 4.0, "title": "Nice amenities for the price", "text": "We were there for an eight night stay. Rooms are large, very clean with balconies- over city streets. We were on the Penthouse floor and traffic noise still was easily heard when the door to the balcony was open. The beds were superior in cleanliness and comfort. Lovely lobby area and very friendly staff at desk and elsewhere. Breakfast was a nice surprise, however not enough staff on some busier mornings to keep up with refreshing the food and coffees. One block easy walk to the beach and shoppes. If you are looking for a regular 'Hyatt experince' then stay there, and not at Hyatt Place. However, if you are looking for a clean, very up to date, stylish hotel with good amenities at a good price then stay here.", "helpfulness": 5, "user": "isletripper", "date": "April 27, 2012", "id": 128683720}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "The last time I stayed in Hawaii was at the Fairmount on the big Island. So I was unsure of what to expect staying in the city and a 3 star hotel. I traveled with my boyfriend and we are both in out 30's. We stayed April 23-28.", "title": "Great, but.....", "helpfulness": 6, "user": "JanJanRoe", "date": "April 26, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 128659969}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I was in Honolulu on business and the Hyatt Place was available at a reasonable rate. It is about 3 blocks from Waikiki beach and is a convenient walk to restaurants and shops. The room was well appointed and was quite comfortable, but there isn't a full service restaurant in the hotel. Breakfast was included in my room rate, but the selections were pretty sparse. Rather than a full breakfast buffet, the fare seemed to include some egg and meat sandwiches, cereals, and not much more.", "title": "Good Value and Location", "helpfulness": 2, "user": "joeb1249", "date": "May 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129997882}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "The staff were quite friendly and helpful, although they were usually pretty busy. The hotel was more than adequate for my purposes and I would not hesitate to stay there again.", "title": "Good hotel if you get the right room.", "helpfulness": 1, "user": "travelicious01", "date": "May 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129980354}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I stayed here for 3 nights in a large room with mountain views. Everything about the room was of good quality. We had a small balcony and a large sofa as well as two queen beds, which were incredibly comfy.The breakfast options were varied and it was nice to be able to sit outside although it was quite windy. The hotel is very close to the beach, just one block away, so it's in a perfect spot. Although the work on Waikiki beach wasn't finished while I was there it wasn't a problem, I just walked up a little further. I understand that it is now finished however. When I returned to the hotel the night before flying home for one night we were placed in a room which wasn't as nice as the original room. It was certainly smaller (although still perfectly adequate) and it was on the second floor so it was a bit more noisy (street noise) but having said that I have a lot of trouble sleeping and didn't find it to be problem. There was also work going on at that side of the hotel and when we encountered very loud drilling we did ask to be moved and they said they would gladly move us. The only real problem I had here was when I had an early departure and was to be collected by the Speedishuttle. I called ahead to inform reception that I was expecting them and to make sure they knew my name as I wasn't down on the booking, in case they arrived early. As predicted speedishuttle came early and the hotel did not inform me so when I cam down I had missed the bus and had to wait 40 minutes for another one. This was partly because the manager was very relaxed and said they would arrive and i should just relax and wait, it was only when I spoke to another member of staff that the mistake was realised. I have to say though, once they realised the mistake he was very quick at calling the driver and they came over within 5 minutes to collect me.", "title": "Perfect affordable option", "helpfulness": 1, "user": "PedroMan83", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129941513}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Why pay $400+ for LESS options at another hotel? This hotel is totally remodeled, has an OUTSTANDING breakfast and free wifi for a fraction of the cost of \"nicer\" hotels closer to the beach. The extra 5 minute walk off the beach will not bother you one bit and you will save hundreds during a multiple day trip.", "title": "Glad we picked this hotel!", "helpfulness": 6, "user": "menicksmom", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129724645}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "We've been here for almost a week, leaving tomorrow. I did a last-minute switch from the Hyatt Regency to this newly remodeled Hyatt Place because of price/Hyatt Gold Passport Points, free internet, free breakfast & cheaper parking. Glad I did! We really have enjoyed the hotel & staff. Stayed in a \"City View/Deluxe\" room #1739. The view isn't great (opposite side of the ocean), so all we see are other hotels & apartments & an elementary school. It's sup rising how, on the 17th floor, the noise just echoes. Not faulting the hotel at all, but boy is it noisy in the late hours (delivery trucks, people talking on the streets, sirens). I'm sure Hyatt Regency is noisier with the police station across the street, which is one reason I changed my mind. Breakfast choices here are multiple......2 kinds of hot sandwiches each day (biscuit, egg, bacon, cheese, bagels), french toast or waffles, mixed fruit, cottage cheese & berries, various cereals, granola, yogurt, breads & toasts, muffins, pastries, every juice you can imagine, coffee, tea. If you can't find something to your liking, you've got a problem! Never had a problem finding a seat, but choose close to a wall or it's windy....or use the tray provided in your room to carry breakfast back to your room to eat it at the small table or desk. Small pool and we didn't use it. Walked across to the beach instead. It's just a block. Bought meals often at the Hyatt for about $9 a meal. Very helpful & friendly staff. Always willing to take us to our room when we couldn't get the key to work (need to scan your key to move the elevator or get into guest laundry, workout room, etc). Everything is brand new in this hotel. Comfortable for the 3 of us (2 adults & a 13 year old boy). Shower (no tub) with sink outside toilet area is helpful. Large desk for schoolwork. Hide-a-bed. $12 nightly parking at the Banyan Hotel across the street from Hyatt (diagonally). Cheeseburger in Paradise a block away, Wolfgang Puck's on the corner (all about $10 a meal), ABC store right next door. We made a great hotel pick!", "title": "Great place to stay", "helpfulness": 5, "user": "Fiona B", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129680101}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "I just returned from a stay at Hyatt place.", "title": "Clean room, comfy beds", "helpfulness": 1, "user": "leannBurnsvilleMN", "date": "February 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 124759419}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "My room was clean and the beds were comfy. Shower was great and I really enjoyed the complimentary breakfast and beach towels.", "title": "A WONDERFUL EXPERIENCE!!!", "helpfulness": 1, "user": "nd2spdn", "date": "February 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124416692}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "My only complaint is the unexpected extra fees. You r required to valet park for an additional $25 per day plus tip. My 3 day stay somehow came to over $800. I was quoted $210 a night.", "title": "Much more than expected", "user": "HeyWes", "date": "February 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124389735}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "First of all, I'd like give a big Mahalo to Lynn who checked us in at the front desk. She was very friendly, helpful, and welcomed us like professionals. Check in supposed to be at 3pm but our room was not ready until 430pm because of the hotels first day opening and the hotels WiFi service was down making check-in difficult. So the lobby entertained us which included a bar, 3 hdtv's, and an internet cafe. The room was awesome. Comfortable from top to bottom that included a balcony with a beautiful view of Waikiki Beach. Definitely well worth the extra wait and I recommend everyone to stay here. 5 STARS!!!", "title": "Glad Hyatt got its hands on this place", "helpfulness": 2, "user": "HungryHikerBoulder", "date": "February 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124129385}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Got a good deal for our seven rooms from joining a preferred member club. The rooms were brand new and most rooms got bumped up to ocean or mountain view. Wasn't expecting much from the free breakfast, but loved the made to order breakfast sandwiches, fruits and other breakfast items.", "title": "Excellent!!", "helpfulness": 4, "user": "suazol", "date": "February 1, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123993464}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I normally don't stay at Hyatts since I have no status with them, but based on the excellent reviews here and that it was a brand-new renovated property, I decided to check it out. Stayed 3 nights and was quite impressed and would absolutely stay here again if the price is competitive with the Doubletree, my usual choice in Waikiki.", "title": "Excellent new hotel on Diamond Head side of Waikiki", "helpfulness": 5, "user": "PDXBigGuy", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 125324185}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "PROS:", "title": "Hope this helps", "helpfulness": 2, "user": "MommaT5676", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 125239935}, {"rating": 2.0, "stay_parameters": "Stayed February 2012", "text": "-room: probably the most spacious hotel room in Waikiki I've ever stayed in. The room had a king-size bed and a sitting area with a full sectional sofa + ottoman.", "title": "Beware BED BUGS!", "helpfulness": 19, "user": "LeslieIvonne", "date": "February 24, 2012", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 125123999}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "-TV: 50 inch flat-screen with HD programming! Good # of channels", "title": "Great Room", "user": "MrsBob99", "date": "February 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 125116766}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "-bathroom: large shower (no tub) and toilet in one room; large sink outside", "title": "Very nice, just remodeled", "user": "Rossco814", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124997856}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed here as a quick, low cost room for one night and were we pleasantly suprised on April 20, 2012!!!! Our room was newly renovated and it was wonderful. We flew in on a late flight and were leaving the next morning for Kauai. The front desk staff were extremely pleasant and courteous. They assisted us with our bags and gave us a quick tour as we were escorted to the elevator. We were told our room was just renovated, so we thought this may have happened like in the last few months. However, to our suprise the room was brand new. The room was so new it smelled new. Not like paint and nauseating fumes, but clean and well, new. The bar downstairs had some quick foods to order and they were yummy. We had a mountain view, that I must say was not that mesmorizing, but it was on the 12th floor and not too much street noise penetrated the room.", "title": "Beautiful, new renovations!", "helpfulness": 4, "user": "EllerbyCoup", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 128505373}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Our room had a sleeper sofa, sleeper chair, and two doubles. The beds were SUPER COMFORTABLE!!!The television was huge and the bathroom has a walk-in shower and no tub. The sink and vanity is separate from the toilet and shower. We had breakfast included the next morning and it was wonderful to say it was supposed to be a continental breakfast. There was fresh fruit, pancakes, buscuits with cheese and ham already made, rice with asian toppings and various juices.", "title": "Great Hotel", "helpfulness": 6, "user": "kauai2012", "date": "April 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128306805}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I would definitely stay here again as they were a much better quality than I expected reading earlier reviews.", "title": "Warning: Construction at hotel and beach", "helpfulness": 22, "user": "CalClan", "date": "April 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 127755456}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "We stayed from April 14-18th with our two children, 5 and 2 years old. The breakfast was great, especially with two growing, always hungry kids. We had a room with a Diamond Head view, and directly above the construction. My 5 year old ended up getting very sick, so we spent 90 % of our time in the room Sat-Mon, and the noise was not bad. I was able to spend time reading out on the balcony during the day. The pool/breakfast area was extremely windy, but there is not much you can do about that. The rooms were very nice and clean.", "title": "Excellent location, clean, efficient rooms", "helpfulness": 4, "user": "GlenLivet", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127678333}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The beach is a short walk, my 2 year old did it without a problem every day. Sat and Sun most the beach is open, but on Mon the beach was over crowded and small due to the construction. Also just FYI...8-10 days after a full moon box jelly fish show up in the water off Waikiki Beach (they were there 3 of the 4 days we went to the beach)", "title": "What a wonderful hotel", "helpfulness": 2, "user": "FamilyoffiveEssexUK", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127445176}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Stayed there for three nights. We were upgraded to an ocean view suite fornour honeymoon. All the hotel employees were so friendly and helpful. The restaurants in the hotel were just okay, but since there were so many options right in Honolulu, it wasn't a big deal. The hotel is right on the beach in the center of it, tons of shopping, etc. It's in a pretty busy part of the city so if you don't mind that then you should be happy at this hotel.", "title": "Awesome service!", "helpfulness": 1, "user": "krisquig", "date": "January 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123620458}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed here at the end of our honeymoon for 2 nights and were blown away by the customer service. Complimentary champagne, upgrade to FULL ocean view room and extremely helpful when it came to booking a hospitality suite the day we left. The hotel is in a great location, had a convenient shuttle that took us to airport and Pearl Harbor for much cheaper than a cab. Would definitely recommend!", "title": "great customer service and way better than expected!", "helpfulness": 3, "user": "libxnyer", "date": "January 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123511905}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Got a room at this hotel from an on-line \"you won't know what you're getting 'til you pay up front\" site. The price was more than reasonable so I didn't expect much. But I'd have been happy even if I'd paid quite a bit more. It's not beachfront. A couple of blocks off the main drag in Waikiki. The benefit is peace and economy with proximity to the action. Lobby inviting, designed with a Zen-ish feel. There's an appealing \"galley\" with snacks and drinks, open 24 hours. Business center equipped with good computers and offers free printing. Staff attentive, genial, professional. Room big, clean and stylishly furnished and decorated. Exceptionally nice bathroom. Seemed newly renovated. Street view from second floor window, but who cares with such a lovely room in which to luxuriate. And the best part: the full-length mirror was elongating! It's hard not to fall in love with a room that makes you taller and thinner. Beware $25 valet parking. I was lucky. Valet area was full and the very nice attendant directed me across the street to a $10/day garage. Would recommend this option to all guests with rental cars. Had to leave early and missed the COMPLIMENTARY BREAKFAST. Would book here again in a heartbeat.", "title": "What!", "helpfulness": 6, "user": "Blutus", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123339168}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "I captured a great deal via Hotwire and had received Hyatt Place. I was very pleased as the hotel is newly renovated and has that new fresh smell. The rooms are huge, love the complimentary breakfast, the 24 hour fitness center and everything in walking distance. The staff are also wonderful.", "title": "Great Hotel and Staff", "user": "p51mustangcaf", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123226990}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "This was my first visit.Amazing rooms with all modern facilities and very friendly staff members. The hotel was well connected and serve good food worth trying. The brakfast was complimentary with the room worth trying.", "title": "Great property", "helpfulness": 1, "user": "amit4717", "date": "January 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123126291}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 20, "average": 64, "very good": 274, "terrible": 8, "excellent": 236}, "aka": "Ocean Resort Honolulu", "slim_ranking": 0.277108433735, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Hyatt Place Waikiki Beach is conveniently located on the Diamond Head end of Waikiki and just a 3-minute walk to the golden sands of Waikiki Beach, the 100% smoke-free Hyatt Place Waikiki Beach is a spring board to many activities and attractions for the visitor on the go. Complimentary a.m. Kitchen Skillet™ breakfast available in our Guest Kitchen, featuring freshly prepared breakfast sandwiches, waffles, French toast, pancakes and oatmeal, and Asian specialties. New Gallery Menu, Fresh 24/7 with mouthwatering options including our signature flatbreads & more. Intimate Bakery Cafe serves Starbucks® specialty coffees & teas, premium beers, wines & cocktails. Signature cocktails include: Mai Tai, Pina Coloda or Mojito. Complimentary 24-hour Stay Fit® fitness center with Life Fitness® cardio equipment located on the third floor. Sliding door access to the pool deck. Self parking: $18 daily fee. Valet parking: $28 daily fee."}