{"user_rating": 4.0, "review_count": 1017, "name": "Hyatt Regency Century Plaza", "reviews": [{"rating": 5.0, "title": "Love this Hotel", "text": "Just returned from staying at the Hyatt Regency Century Plaza for a convention July 26-30th. Pricey even at the convention rate but well worth the money. From the time I pulled into the valet parking area until I checked-out the hotel treated us as if we were the most important guests in the hotel.", "helpfulness": 1, "user": "meh7976", "date": "August 4, 2006", "id": 5554828}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "The hotel check-in was great our room wasn't ready but the lady at the desk put a hold on a room with 2 double beds and we were able to check in within the next hour. Our bags were promptly brought to our room by a bell man.", "title": "Not impressed with the Century Plaza", "helpfulness": 7, "user": "Dudega1", "date": "July 1, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 5414431}, {"rating": 5.0, "title": "Loved it!!", "text": "The room was wonderful with down duvet covers a table and two chairs (workstation), bedside chair and stand, mini-bar (which they emptied for a small fee so we could use the refrig.for our picnic supplies), closet with ironing board, safe, bathroom wonderful, and a coffee maker. We also had a nice view of the pool and mall next door. All rooms have sliding patio doors and a balcony. We felt like we were getting the star treatment.", "helpfulness": 3, "user": "calihappygirl07", "date": "June 27, 2006", "id": 5396681}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "The hotel was able to handle a convention of over 1000 people and then turn around the day after and handle a high profile political person staying with them without compromising the convention activities.", "title": "Pricey, but worth it", "helpfulness": 3, "user": "chem_dr", "date": "May 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5045147}, {"rating": 5.0, "title": "Great views, comfy beds", "text": "The hotel was located in a wonderful area 30 minutes from Hollywood, 20-30 minutes from the Grove, 10-15 minutes from Beverly Center, 30 minutes from LAX. I would definately stay here again and recommend it to others.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 7, 2006", "id": 5039391}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Stayed there for a conference. Newly renovated, beautiful property. I stayed in a classic room and it even had a flat screen tv, a beautiful bathroom, and a balcony. the staff at the hotel is also amazing and willing to help. the conceirge was even able to get me tickets to see jay leno.", "title": "One of the Best Hotels in the US", "helpfulness": 3, "user": "Tennis0720", "date": "February 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6746964, "likes": {"liked": "— the rooms and cleanliness", "disliked": "— elevators were slightly slow"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The plaza is as you would expect a 4* US hotel. The bedrooms are large, with Balconies and the beds incredibly comfortable. The hotel has a nice bustling lobby area. The pool area is nice although the gym is currently in a temporary marquee as the new gym is being finished (it looks like it will be a high quality gym) Just across the road is an excellent shopping mall with a really good food court.", "title": "Good quality 4* hotel", "helpfulness": 3, "user": "EEYORETIGGERR", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6635200, "likes": {"liked": "— Comfortable beds", "disliked": "— No evidence of its history"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The one thing I would say this hotel lacks is any evidence of its history, it is just like any other 4* hotel.", "title": "Very Kind Restaurant manager in Breeze from Ireland or Scotland", "helpfulness": 3, "user": "JeanbbFrance", "date": "December 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6527573}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We had an excellent time here at the new Century Plaza Hotel, which is now run by the Hyatt Company - what a change in Service, as we have come here every December from France for a week to do Shopping for Christmas in this area.", "title": "Nicely Renovated Hyatt near Century City/Beverly Hills", "helpfulness": 6, "user": "LeanaD", "date": "December 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6345064, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled solo", "text": "We ate at Breeze each morning and got to know all the staff in Breeze, after a few days the managers got to know us -+I forget hi name + From Ireland, he had a lot of laughs each morning and it was a great highlight to our day.", "title": "A Pleasant LA Hyatt Experience", "helpfulness": 8, "user": "ocGlobetraveler", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6175303, "likes": {"liked": "— Bed Comfort, Hip Decor", "disliked": "— N/A"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "Room are great clean well appointed renovated.", "title": "Valet parking disaster", "helpfulness": 1, "user": "Billy1115", "date": "May 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16448974, "likes": {"liked": "— clean room", "disliked": "— thin walls"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Valet parking is great for $31.00 a day. Let me be clear I don't mind the charge. Some people are so shocked that hotels charge for parking. The valet attendants are lazy. Let me explain how it works. You call down x 2500 for your car. The valets get the car We never had an issue with getting our car. The probem occurs when you drop it off. The Valets never come over to your car they make you get out in the middle of the driveway. They never seem to move the car. The other cars try to squeeze by . This causes traffic jams for other guests as there are 750 room. I can't prove but there ws a slight dent on the driver door of my rental. Luckily I had the rental ins otherwise they would have charged my cc until i contacted my insurance at home.", "title": "Great Hotel", "helpfulness": 1, "user": "mstreds", "date": "May 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16200990, "likes": {"liked": "— Service was top notch and the room was great", "disliked": "— They didnt have the room ready and so we had to check in late"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The staff was excellent and the rooms luxurious. It is a quick walk (yes walk) to the Century City mall and about a 15 min drive to UCLA, WeHo and Beverly Hills. It was a great stay.", "title": "Great hotel - you should stay here!", "helpfulness": 1, "user": "Lola_travel_girl", "date": "May 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16183765, "likes": {"liked": "— Location, comfort, elegance, spaciousness", "disliked": "— I couldn't move the fridge off the shelving unit."}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008", "text": "You may wonder why you should stay in Century City. Firstly, it's a minute or two, literally, from Beverly Hills and it is convenient to Hollywood and Santa Monica. Secondly, it is a two minute walk (yes, I said walk, although you never walk when in LA) from a wonderful shopping mall. Finally, Century City provides you the luxury of Beverly Hills, the safety you need and proximity to major freeways.", "title": "Overpriced in the middle of nowhere", "user": "ma65", "date": "May 13, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 16003450}, {"rating": 4.0, "stay_parameters": "Stayed April 2008", "text": "The rooms are beautiful and spacious – huge closets, deluxe bathrooms, really comfortable beds, state of the art technology.", "title": "solid hotel in good location near Beverly Hills", "user": "kaytchinha", "date": "May 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 15694100}, {"rating": 4.0, "title": "Nice hotel ... but you'll pay $$$ for it", "text": "Overall, the hotel is very nice and has all the amenities of a 4-star hotel ... although the price per night the seemed a little high for what you got ... I guess you're paying for location. I stayed at the Century Plaza for a business trip, so I didn't pay out of my pocket or else I couldn't afford it.", "user": "Karch72", "date": "March 27, 2008", "id": 14574281}, {"rating": 4.0, "title": "Nice Hotel For Business", "text": "The hotel is located in a business section of Century City. There is a Westfield Mall right next door that offers a variety of eating options and shopping. I chose to eat there rather than hopping in a cab and venturing out somewhere.", "user": "danielleflorida", "date": "March 20, 2008", "id": 14408155}, {"rating": 4.0, "title": "Good hotel", "text": "Pros: Comfy beds, modern decor, fairly large room, patios are nice, Starbucks onsite, huge flat screen TVs.", "user": "WebBrown", "date": "March 4, 2008", "id": 14040697}, {"rating": 5.0, "title": "Very Nice Mid-Century Styled Hotel", "text": "Cons: No free exercise facility (need to pay $20 per day to use Equinox next door), very expensive onsite restaurants, no free Wi-Fi, noisy AC in room, a bit of a ride from LAX", "user": "leclaire68", "date": "January 25, 2008", "id": 12992846}, {"rating": 5.0, "title": "Wouldn't hesitate in staying here again", "text": "Stayed here for business - attended a conference held at the hotel. The ballroom/converntion area of the hotel is pretty big and they seemed to service it well. Hotel was overbooked so I got upgraded to a suite on the top floor - level called Penthouse.", "user": "jodie102", "date": "January 22, 2008", "id": 12892694}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This would have been a \"terrible\" rating if not for the wonderful service. I travel frequently for businesses and typically stay in 4-star hotels. I am very reluctant to complain and have never asked to change rooms or anything like that before.", "title": "Excellent service but big problem with outside noise", "helpfulness": 3, "user": "Gyldenhorst", "date": "December 9, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 11403396, "likes": {"liked": "— Great staff", "disliked": "— Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I read the first 50 or so reviews here and didn't see many complaints about noise. My guess is that because we booked last minute and negotiated a lower rate ($199), we were not eligible for a quiet room, or perhaps all the quiet rooms were already taken. If you stay here, make sure that you get a room on a very high floor (PH at least) and that you are not over the bar, the front drive, or the construction site. (Oh, and there is construction on the 19th floor so avoid that as well). And bring earplugs!", "title": "Excellent Service", "helpfulness": 1, "user": "Consultantgal", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 11243579, "likes": {"liked": "— Terrific Service; everyone in the hotel was delightful to deal with", "disliked": "— The room rates are high, but it is a great hotel in a great location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Our cautionary tale: We were given an 8th floor room over the hotel bar's outside area, and on our first night were subject to loud music and rowdy patrons well into the wee hours (this was on a Wednesday night). The manager was extremely sympathetic and moved us to a room on the other side of the hotel, on the 14th floor, after personally inspecting the room himself. He also gave us a 50% discount on the room for the night.", "title": "A constant in a world of change", "helpfulness": 1, "user": "Juninho_pp", "date": "November 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10939752, "likes": {"liked": "— Effortless and casual but styllish also", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007", "text": "This room seemed quieter during the day. When we got back to the hotel around 9pm, we could hear a raucous party with a band in the tent out front. Luckily that ended at 10pm. But when we tried to go to sleep that night, we realized that we were directly above the front driveway and busy intersection -- valets blowing piercing taxi whistles, cars honking, etc. There is also a construction site across the street that is very noisy.", "title": "Ouch -- My conscience hurts", "helpfulness": 2, "user": "gazooby", "date": "November 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 10898664, "likes": {"liked": "— Wow -- that bed", "disliked": "— My conscience hurst"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "Luckily we had brought earplugs or we would not have been able to sleep at all!", "title": "Excellent hotel", "helpfulness": 2, "user": "kateoz", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 10770332}, {"rating": 2.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "I cancelled a Best Western to stay at this hotel and wish now I'd saved my money. I thought I'd treat myself but this hotel is a soulless place and does not match up to other Westin hotels I've stayed in. I had avidly read other reviews on this site and had high expectations that this would be a good place to spend my first night in LA in. Big disappointment. The staff are very workmanlike but you don't feel they are really welcoming you as an individual. I don't expect to pay $25 for car valet parking and have them suggest I take my own bags up to my room. Once there, I was deeply disappointed not to have a bath tub. As it was only a one night stay I couldn't be bothered to complain (as a Starwood Preferred customer) but I was also annoyed not to get a bath robe. It is very convenient for the Century City Mall but that's about it. Staff in The Breeze restaurant were great (never easy for a woman on her own to eat somewhere) but I was relieved to check out at 7am.", "title": "Couldn't wait to get out", "helpfulness": 5, "user": "camdencalling", "date": "May 31, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3512366}, {"rating": 5.0, "title": "Great urban style celebrity hotle", "text": "Stayed at the Westin Century Plaza in LA 2x in April for various business meetings in LA. Loved it two times. I can't help but fall in love with the heavenly bed. Recovered from back surgery about a month ago and was concerned about sleeping in hotel beds, (my bed is custom) and it was a great feel and so comfortable. Slept like a baby.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 13, 2005", "id": 3468790}, {"rating": 5.0, "title": "Everything wonderful!", "text": "Staff was terriffic, valets & bell hops were very nice and helpful. Liked the free Evian from the valet. Washed my windows too...unexpected...and appreciated.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 10, 2005", "id": 3458312}, {"rating": 4.0, "title": "Nice for a weekend", "text": "Checked in , had to wait a little while but got a nice upgrade and comp breakfast. Front desk people were exceptionally pleasant, especially the tall brunnett (couldn't remember name) . Food at Breeze was pleasantly surprising.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "May 9, 2005", "id": 3453244}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "Big treat was the celebrity event I happened to watch from the lobby one evening on my way back. Never saw so many stars in one place. That was really cool. This hotel has a great Hollywood history, as I've learned. Looking forward to bringing the family for summer weekend jaunts.", "title": "Bad news...", "helpfulness": 4, "user": "spt", "date": "April 28, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 3422809}, {"rating": 1.0, "stay_parameters": "Stayed April 2008", "text": "I stayed 6 nights at this hotel recently. It was one of the worst experiences I have had.", "title": "A terrible hotel!", "user": "dbasha", "date": "May 3, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 15620611}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The hotel is, at best, a 4 star hotel, although its prices suggest otherwise. Check-in (at 11.30am) was very slow, with only 2 personnel despite a queue of 10 people. I was then given a very small room. When I called the front desk to ask why, I was put on hold for 25 minutes. I was then told that there were in fact much larger rooms available, and I was moved to one of these rooms. I was not however told that the larger rooms were very warm as the air-conditioning units were small and old (I was helpfully told this by the engineering personnel later). It took 3 complaints for engineering to finally come and let me know that they could not do anything. Having already settled in by then, and with numerous meetings to attend, I reluctantly opted to stay in the room.", "title": "Totally fine hotel", "user": "suitcasegurl", "date": "April 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 15430770, "likes": {"liked": "— The location and having a mall within walking distance", "disliked": "— Nothing sticks out as being particularly bad"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Service throughout the hotel was uniformally slow, and it was clear that the hotel is under-staffed. At the outdoor areas of the lobby bar and the X-bar, it was not uncommon to wait 25 minutes before getting served; this is unacceptable by any standards. Breakfast was also mediocre and was certainly not commensurate with the prices charged.", "title": "Good Place to Stay", "user": "TJ-USA", "date": "April 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 15366161, "likes": {"liked": "— Location - Upscale hotel in an upscale location", "disliked": "— Lack of indoor pool"}}, {"rating": 3.0, "title": "Pamper With Paper", "text": "The door personnel generally tended to ignore people waiting for taxis unless it was brought to their attention that taxis were required. Most suprisingly, considering that this hotel is predominantly a business hotel, the business centre (which was basically a small shop offering limited facilities rather than a proper business centre) was only open limited hours on weekdays, half a day on Saturday and closed on Sunday.", "helpfulness": 1, "user": "guyinca", "date": "April 15, 2008", "id": 15054978}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "On the last day, I checked out at 12pm as required. Since my flight was only at midninght, I asked wheher it would be possible to have shower facilities provided before I left later in the evening (which is a common practice at good business hotels in various countries), but unsurprisingly I was told that they could not offer these facilities.", "title": "Bed Bugs and a little Dirty", "helpfulness": 2, "user": "gooooogirl", "date": "April 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 14815882, "likes": {"liked": "— Nice bathroom & large suite", "disliked": "— Bed bugs, a little dirty"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "Stayed here recently on a business trip. The hotel is quintessential L.A.; even if I had been plopped into this hotel blindfolded, I would've known I was in LA--it's just got that feel. Rooms were large and clean and the \"Heavenly\" bed did not dissapoint. The room service food was exceptional (steak sandwich was best I'd ever had) and delivered quickly. The pool and bar areas also looked very enticing, very \"Hollywood\", although I never used them.", "title": "Classic LA Hotel", "helpfulness": 3, "user": "islington3164", "date": "August 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 3793354}, {"rating": 1.0, "title": "Overpriced and short on service", "text": "Two very minor complaints: 1) service was average, but you pretty much expect that in an impersonal chain hotel, 2) while the hotel is very, very centrally located, the actual location of the building is kind of desolate, as it's surrounded by office buildings and a Mall. Then again, who walks in LA?", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 16, 2005", "id": 3769978}, {"rating": 5.0, "title": "Westin Century is a classic", "text": "I would stay at the Westin with no hesitation and recommend the hotel to anyone in LA on business or pleasure.", "helpfulness": 2, "user": "TravelPort101", "date": "August 13, 2005", "id": 3758973}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "I was excited to stay at this hotel because I love Westin hotels and this was supposed to be a nice place. You can imagine my disappointment when my stay at the Westin Century Plaza Hotel & Spa was nowhere near satisfactory!", "title": "Great, Clean, Well Located Hotel", "helpfulness": 2, "user": "travel79", "date": "August 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3755038}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "In fact, my experience with this hotel was so miserable that I could not wait to check out and go home!!", "title": "Rude Staff", "helpfulness": 7, "user": "ajkyc", "date": "August 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 3727512}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "We spent three nights at this lovely hotel, and had a great stay. However, there is significant construction happening across the street, so if you do not get a room facing the ocean, your view and quiet will be destroyed.", "title": "fine hotel (beware of construction)", "helpfulness": 5, "user": "whateverintexas", "date": "July 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3674541}, {"rating": 1.0, "title": "Disasterous stay", "text": "We had booked two king beds rooms, but, when i said we did not want construction views, we had to get two rooms with two double beds. Supposedly, the king rooms all face the construction--and when I did see into one, it looked nightmarish. ROMANTIC STAYS BEWARE if a large bed is crucial to your enjoyment.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3639004}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "However, our spacious balconies had an excellent view of the hills, west LA, santa monica, and off to the pacific horizon. FANTASTIC for ocean breezes!", "title": "A Great Location and a Fine Stay", "helpfulness": 11, "user": "Clefsdorsf", "date": "June 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3583306}, {"rating": 4.0, "title": "Good hotel", "text": "The check-in process was smooth and friendly, and the valet service is excellent---efficient and fast. The rooms were clean, with comfy beds and nice bathrooms (including double-headed showers and decent (but not super-spacious) bathtubs.) The internet service in-room is very fast, and gives you a genuine 24 hours for 10 dollars. There is wireless in the lobby as well.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 10, 2005", "id": 3542814}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Room service was fast and efficient, and Breeze, the on-site restaurant, is delicious. Many of the items are organic, with free-range and hormone-free meat and veggies grown in their dedicated garden, cooked fresh. It's very pleasant to dine outside on the patio, too.", "title": "Very good hotel", "helpfulness": 5, "user": "amiprice", "date": "June 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3528284}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We booked the room in January 2008 for a stay in July 08. There are four of us. We booked a room with two double beds. We get there and everyone on line to check in was mad. The hotel staff kept apologizing to people. I knew I was in for something. They apparently booked all of the double bed rooms for some cheerleading competition that was going on at their hotel. Because they have a contract with them, they had to bump everyone even though we booked it in January. They told me they could give us a room with one king size bed and send up a cot. We are four adults! Three of us had to squeeze on one bed?? Not going to happen. So one of us slept on the cot, another on a chair and ottoman. They couldn't give us another cot because it was a fire hazard. They also explained to me that the hotel does not guarantee a bed type, the only guarantee a room type. I never heard of that before.", "title": "Not so great", "user": "ttrinchi82", "date": "July 30, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 18431025, "likes": {"liked": "— they gave us a room for free after messing up our reservation", "disliked": "— they messed up our reservation"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Then, when we got to the room and there were no towels at all! Luckily, I was nosey and opened up the doors to a cabinet in the middle of the hallway and saw a bunch of towels. so we took them from there.", "title": "Great Hotel", "user": "george1688", "date": "July 26, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18268824, "likes": {"liked": "— Room & service", "disliked": "— Mini bar"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Then the thick curtain that keeps the sun out was missing! Luckily we were on the side of the building that the sun sets on. They ended up comping us that entire night but still, that was wrong. They only comped us for the night AFTER we called to complain about the curtain.", "title": "Hyatt Disappoints This Time", "user": "AllisonNNH", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 18005807, "likes": {"liked": "— Location", "disliked": "— Cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "I stayed here for 5 nights and everything was perfect. The valet was expensive at $31 per day but it was worth it. The fridge had refreshments and is electronically monitored so i can't put anything in it. The rates were reasonable. The location is brilliant, its a five minutes drive from Beverly Hills and really near to Westfield Century City mall. I'm definitely coming back to this hotel during my next vacation to LA.", "title": "Beautiful, but pricey", "user": "JN2323", "date": "July 15, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 4.0, "location": 5.0, "business": 3.0}, "id": 17919831}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "This was my third stay at the Hyatt in the last year, and while I like the hotel , it disappointed me this time. It is extremely convenient to my firm's LA office which is why I've stayed there, but I think this time was the last.", "title": "Great location", "user": "healinghart", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 17850127, "likes": {"liked": "— Rooms , location, friendly staff", "disliked": "— Parking , paying for internet"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Even though we only stayed one night out of our 9 day trip to California, I would say it was one of the more beautifully decorated ones. We wish we would have stayed here longer.", "title": "Beautiful hotel, great stay", "user": "crystalswa", "date": "July 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17708764, "likes": {"liked": "— the pool area", "disliked": "— paying $31 for parking"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The hotel lobby is breathtaking with the rich warm colors. There were many chairs, couches and places to hang out. My husband used the wireless internet here, while the kids and I \"chilled\" and watched on of the tv's.", "title": "Not bad, not great", "helpfulness": 2, "user": "GailofIowa", "date": "June 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 5.0}, "id": 17127636, "likes": {"liked": "— balconies", "disliked": "— price"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "Our check in was great, we were able to check in at noon, when check in is normally 3pm!", "title": "Hyatt was great with some limitations", "user": "tripper1988", "date": "June 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 17075251}, {"rating": 4.0, "title": "Great hotel", "text": "The parking is a pain, but what are you going to do, it's LA. We paid the $31 with in and out privilages. The valet service is very fast and friendly.", "user": "cjlee32", "date": "June 18, 2008", "id": 17032408}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The pool area is amazing. There is a covered lounge area with a bar. They have a fireplace they lite a night. The pool was an infinity edge pool, and the hot tub was large enough to fit 12. The tanning pools were really cool! They provide towels by the pool and it was open until 10pm, but we were there longer the night we stayed and no one told us to leave.", "title": "Nice hotel, good location, good price", "user": "rakawa", "date": "June 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16759362, "likes": {"liked": "— The room.", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed there for 2 nights, and had 3 rooms for the 6 in our family. Here's the rundown:", "title": "OK - Just Don't Eat in the Restaurant", "helpfulness": 2, "user": "ruchelaya", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12707977, "likes": {"liked": "— Great rooms, cool lobby scene", "disliked": "— Poor service in the restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The good:", "title": "Nice location, ok hotel", "user": "Carla123", "date": "January 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 12551950, "likes": {"liked": "— The location.", "disliked": "— The hotel felt tired."}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007", "text": "1. We're from Illinois and the Fighting Illini were staying there for the Rose Bowl. You can't beat that when you're travelling with teen boys!", "title": "I expected better service...", "user": "Lainey33", "date": "January 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 12366986, "likes": {"liked": "— great views, good location", "disliked": "— poor customer service"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007", "text": "2. The hotel has been redone, and it's really beautiful. The lobby, the grounds (were about to be finished when we were there), the rooms.", "title": "Good hotel/location but needs some improvement", "user": "SKYtrip", "date": "January 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 12329967}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "3. Beds are great.", "title": "Great Overnight in LA", "helpfulness": 1, "user": "ChiTown2", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 12117509, "likes": {"liked": "— Great value, clean and friendly.", "disliked": "— Location requires a car for almost all activities (but it is LA!)"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "We got a decent price from Priceline. The location was great, easy to get to Beverly Hills/the strip, and also to Santa Monica. The concierge service was fantastic--not only called multiple restaurants to get a us a table for a Saturday night, but also made good suggestions and followed up with calls to my cell phone to confirm our plans. Excellent service. The valet price is over the top, but you do have no choice, so just consider it part of the cost. Sign up for the Hyatt Gold Passport (free to do at their website) so you can use the gym for free, otherwise you have to pay some exorbinate fee (again, nickel and dimed). The bed is comfortable and the rooms are a good size. We didn't hear any real hallway noise, though the street noise was present, even on the 12th floor. They obviously put a lot of money into updating what would otherwise be a very dated hotel. We did not eat/drink there, but the lobby had a great vibe and lots of business travelers were having drinks and a good time.", "title": "Not the best Hyatt...but not bad", "helpfulness": 3, "user": "thankstomiles", "date": "May 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5035959}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "Check in was fast after our car was surrounded by Valet Parking guys who aggresively hyped valet by saying it would save me money over self-park. When I got the bill I was shocked, as they added $29 for half day of parking. Add tips, and it came to nearly $35. The first room offered smelled strongly like smokers, but they moved us quickly down the hall to a similar otherwise ample room. The rollaway was delivered quickly, and the only other unpleasant surprise was $13 for a supposed TV movie we did not order. My daughter simply turned on the TV and watched a 1 hr. disney sit-com. If that costs $13 (!), they should be very obvious in disclosing that to guests. They did remove the charge when I politely protested it. The hotel is in the heart of Century City's business district, so no street parking whatsoever -- they kind of \"have you where they want you\" and in my opinion exploit that. Otherwise a decent stay accross from major high-rise construction. Not quite worth the $130 (incl. taxes, etc.) we paid, but we were down to the \"wire\".... I have gotten much better values from Priceline at half or one-third the cost, as nearby as Anaheim Doubletree Suites. Reading other reviews of this Hyatt, a common theme emerges of aggressive charging of extras, which clouds your view of an otherwise nice roomstay in a comfortable bed and bath, etc.", "title": "Nice experience tarnished by all the Gothchas", "helpfulness": 7, "user": "soldearly", "date": "April 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 4955987}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We stayed here for 3 days while visiting LA. The valets were terrific, although the daily price of $29 was a little high. Lounge area was very nice to have a drink and appetizers. The wait staff in the restaurant were superb and had us taste testing different smoothies. The hotel is walking distance to a great mall and movie theater. We ate at a fabulous Italian restaurant called Carmine's on Santa Monica Blvd, a short drive or a long walk from the Hyatt. The beds, pillows and the rollaway bed were first class.", "title": "Great hotel", "helpfulness": 3, "user": "ESCColorado", "date": "April 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4940577}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "I stayed at the Hyatt Century City for 4 days for a business conference. The hotel rooms are spacious as are the bathrooms. My only negative comment about the hotel rooms would be the housekeeping, it took over 45 minutes to get fresh towels one evening and 2 days in a row the bathroom area was not swept or mopped, as there was still plenty of hair on the bathroom floor. When you are paying over $250/night and in LA you expect housekeeping services to be a bit better.", "title": "Great location, nice pool, ok food ....", "helpfulness": 2, "user": "rock412", "date": "March 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4823175}, {"rating": 4.0, "title": "Nice Stay!", "text": "The hotel catering is not good at all, they served the same bellpepper \"goulash\" on 3 different occasions and it gets old fast. If you are going to use the hotel's catering department please taste the food before hand.", "helpfulness": 3, "user": "bridgedol", "date": "March 13, 2006", "id": 4606857}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I worked in the twin towers across the street from the hotel for years. I've eaten there, had meetings there and had company parties there. Recently, I had my first opportunity to stay there (3/4-5) when attending some back to back UCLA events.", "title": "No complaints", "helpfulness": 4, "user": "Onehthony", "date": "March 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3273136}, {"rating": 4.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "The building of the hotel itself is not the newest. The curve of the building is a bit of a throw back to a different era, but only adds to the charm. Ample upgrades have been made. Westin beds are always comfortable and the bathrooms are far from lacking.", "title": "Very comfy!", "helpfulness": 2, "user": "fundatty", "date": "March 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3253858}, {"rating": 4.0, "title": "4 Star Amenities/ 3 Star Service", "text": "The rooms are a bit cozy and I wouldn't recommend more than 2 people staying in one room. There is only one sink in the bathroom (big whoop). There is quite a bit of construction going on with the ABC Entertainment Center across the street being transformed. It wasn't enough to wake me up, but it wasn't silent either. Valet wasn't impressively prompt, but not obnoxiously long a wait, either.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 4, 2005", "id": 3250768}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Stayed at this hotel for 1 night back on October 2 2006, at the end of our 3 month around the world trip.", "title": "Good location, Rooms as new", "helpfulness": 5, "user": "thiakopes", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6027556}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The hotel is going through a major renovation, and check in upgraded us to a newly renovated floor (12th) which was a nice gesture.", "title": "Nice introduction to LA but no pool", "helpfulness": 3, "user": "Desi F", "date": "October 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 6006528, "likes": {"liked": "— I liked the balcony and the view from the balcony", "disliked": "— No Pool!"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "Rooms were very nice, with LCD TV and lovely king size beds.", "title": "Cursed Behemoth", "helpfulness": 7, "user": "Porpex", "date": "September 28, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 5885529, "likes": {"liked": "— the company paid for it", "disliked": "— the fact it is under construction"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Didnt eat at hotel, because generally find them all too pricey but there is a westfield accross the road with some nice restaraunts open at night.", "title": "Star Treatment!", "helpfulness": 2, "user": "barbie1959", "date": "September 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5771837, "likes": {"liked": "— Clean. Large Bathroom!", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Hotel has a Hertz agency located in it, which was handy because we hired a car and drove around mailub, santa monica and beverley hills. The hotel is centrally located which is a major plus.", "title": "Exceptional hotel", "user": "Kravman", "date": "September 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5764700}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "Century Plaza was wonderful. I arrived late and asked to have a colleague able to check into my room for me. WhenI spoke to the front desk to follow up, as soon as I gave my name, without looking at my record, the front desk agent said \"Oh, your colleague has just checked in.\" That is some good service. Throughout my short stay, the front desk offered amazing service.", "title": "Hyatt Century Plaza top-notch", "helpfulness": 1, "user": "Scottas66", "date": "November 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10575883, "likes": {"liked": "— Amazing front desk staff", "disliked": "— mediocre bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "However, the hotel restaurant falls short of expectation. The food alternated between high quality and mediocre, but the service was slow and the staff seemed confused.", "title": "Century Plaza is all Tens", "helpfulness": 1, "user": "DCflyboy", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10502902, "likes": {"liked": "— The overall energy of the hotel with its staff and customers.", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Still one of my favorites", "text": "This is the second time I have stayed at the Century Plaza Hotel -- it used to be a Westin and now is a Hyatt Regency. The experience is a simple all 10's. It is located walking distance from an incredible outdoor mall with great restaurants and shops. The rooms have an excellent view -- the staff are very attentive. The room is well appointed -- simple and clean. There is a buzz and feeling of Southern California energy about this hotel -- people moving through the lobby -- a lobby bar that always has people at it meeting or enjoying. It is a class act and highly recommended.", "helpfulness": 4, "user": "Kamtini", "date": "October 28, 2007", "id": 10410290}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "Centrally located not far from a large number of Los Angeles and Hollywood locations, it is very convenient. Can't say enough good things. Stay here if you have the chance.", "title": "Good Hotel", "helpfulness": 2, "user": "mamababoo", "date": "October 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10301313, "likes": {"liked": "— Very helpful service", "disliked": "— The towels"}}, {"rating": 3.0, "title": "Not a friendly place", "text": "Having stayed at the Hyatt Regency Century Plaza when it was a Westin, I was looking forward to returning again for business this month. It did not disappoint - although there is some wear and tear to the property, it continues to be an excellent choice for the area. It is very conveniently located and the staff is very professional. It is also wonderful to have a Starbucks on the property.", "helpfulness": 6, "user": "OCnative14", "date": "October 24, 2007", "id": 10298273}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 4, "variance": {"poor": 52, "average": 165, "very good": 399, "terrible": 42, "excellent": 359}, "aka": "Hyatt Regency Century Plaza Hotel", "slim_ranking": 0.169871794872, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Surround yourself with contemporary glamour and style at Hyatt Regency Century Plaza. Perfectly situated on the fashionable Westside, adjacent to Beverly Hills, this elegant Los Angeles hotel offers easy access to all the sights of this vibrant city. Set on seven lush acres, with 726 spacious guestrooms, Equinox spa and fitness center, our Los Angeles luxury hotel is a urban retreat in the midst of the city. Discover why The Century Plaza hotel and has been the choice of dignitaries for 40+ years."}