{"user_rating": 3.5, "review_count": 1227, "name": "Hyatt Regency Miami", "reviews": [{"rating": 3.0, "title": "Nice experience", "text": "We just stay there for one day ahead of our cruise trip, it's a nice hotel link to the Knight Convention Center. The MetroMover is right there, walking inside the tunnel without going outside under the heat. A lot of constructions around that area.", "helpfulness": 2, "user": "magtien", "date": "January 27, 2008", "id": 13031356}, {"rating": 1.0, "stay_parameters": "Stayed December 2007", "text": "Hotel staff are very friendly. And when the check-in/out line was long, they immediately add some more staff to help you. However, the room design is a little bit interesting.", "title": "Old 2 star hotel faking it as a 4 star", "helpfulness": 7, "user": "WTMB", "date": "January 5, 2008", "detail_rating": {"cleanliness": 2.0, "rooms": 2.0, "value": 1.0}, "id": 12352247}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "We stayed here one night on Dec. 30th. I wanted a \"special\" night at a 4 star hotel. Well, half the hotel is under renovation and is closed. BTW, this is the half with the ocean view. We tried 3 rooms and all smelled bad. The hotel is dark and depressing. The rooms stink and as others have said they have balconies but they are shut so you get no fresh air. The pool was also closed. If you are looking for a place to sleep for one night and can get a $50 bid on priceline, it might be OK. Otherwise, skip this place.", "title": "Great customer service, hotel is improving with current renovation", "helpfulness": 9, "user": "klarkent", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12337947, "likes": {"liked": "— Newly renovated rooms, centrally located,", "disliked": "— Windows no longer open, room balcony now closed, river smell in hallways"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "I stayed at this hotel 2 years ago, and it was a dump, it needed renovation badly. I just return and I am happy to report the rooms have been nicely renovated. I had a corner room with a view of the Miami River, and all these empty condo towers that now dominate the Miami Sky Line. Rooms now have a nice plasma TV. Hyatt Grand Bed, nice seating area, and are nicely decorated. The meeting areas have also been completed. The Regency Club, Pool Area, and restaurants are currently being worked on as of 12/25/07. Food service is good to great, depends on what you order. There is decent fitness room where you can get a good work out. Customer Service was good to excellent.", "title": "Definitely Not Hyatt Quality or 4 Star at that!", "helpfulness": 3, "user": "lknight26", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 11419853, "likes": {"liked": "— Location to port and friendly front desk staff", "disliked": "— Rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "One thing I really liked was that the Metro Mover is just a short walk through the convention center, which connects to the Miami Metro Rail. South Beach, Coral Gables, and Coconut Grove are just a short drive/cab ride away. The location is centrally located to enjoy all of Miami.", "title": "No Value and Bad Attitude", "helpfulness": 2, "user": "Mercboy", "date": "December 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 11308734, "likes": {"liked": "— Nothing", "disliked": "— Lousy value and staff attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Good price for money, BEST location, within walking distance to Bayside shops which has Hard Rock cafe on the water and shops. Would not eat in hotel restaurant. Not enough food and took 1hour to get our food and we had very hungry kids with us.", "title": "Great Location", "user": "srfrgrl97", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 13834491, "likes": {"liked": "— Location to Cruise Terminal and activities before cruise.", "disliked": "— Food offered within hotel."}}, {"rating": 4.0, "title": "Not bad, but still remodeling.", "text": "My family stayed at the Hyatt Regency Miami for two nights from Feb 9 to Feb 11 of 2008. Our room was kinda of small but was clean and appeared to have just been remodeled. The room had a flat screen tv and all the small amenities. The only problem was that when we got to the hotel you could not get any ice from the ice maker. They were still remodeling part of the hotel and all the ice machines did not work, you had to go the the first floor restaurant to get ice. I complained to the front desk and they gave me a small refrigerator for two nights for free. This was our first time to miami and the bell men and service desk really knew where everything was to see. They gave great directions to all the attractions. Bayside Marketplace was only about 6 blocks away and you can really walk to it during the day. There is a CVS store close to the hotel. At night its not the safest to walk around as there are alot of bums around. I would stay there again once they fully remodel this place. The convention center that is connected to the hotel is pretty old. Self parking is not bad and its only like $12.50 a night.", "user": "bigbob0708", "date": "February 24, 2008", "id": 13799351}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "I won a trip to Miami and this is the hotel my son and I stayed at. It was clean, the staff was friendly and the food was good. The room was big the layout I must admit a bit strange, but I have only one complaint was the valet parking was very expensive, so we parked next door in the parking garage for a lot less.", "title": "Not as bad as I read about..", "helpfulness": 1, "user": "bigdog12771", "date": "February 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13648618}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We booked the Hyatt for the Friday night before our cruise. We got in at about 4 PM and used the electronic kiosk in the lobby and had no trouble at all navigating through the screens. The lobby was very big and airy. The kiosk even printed out our room keys. Our rooms were on the 22nd floor and we over looked the convention center and northern Miami. The sliding glass door was welded shut however it didn't matter to us since we were only staying one night.", "title": "Much better than what I've read from the Reviews here", "helpfulness": 2, "user": "BBuddy", "date": "January 28, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 13072512, "likes": {"liked": "— The bath products and the king size bed", "disliked": "— the welded sliding glass door"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "We stayed in a Regency Club suite on the top floor for one night following a cruise.", "title": "Enjoyed our stay ....", "helpfulness": 6, "user": "Cartman88", "date": "November 17, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4123043}, {"rating": 2.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "We had requested an early check in time and when we showed up at 12pm they advised our room was ready. The room was very nice and having access to the Regency Club area was great for tea/coffee/drinks plus a continental breakfast.", "title": "Not Recommended", "helpfulness": 3, "user": "Peter R", "date": "November 16, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 4122693}, {"rating": 4.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "The location was fairly central and the Bayside Markets were only a 10 min walk.", "title": "Great Experience at the Miami Hyatt!", "helpfulness": 16, "user": "East_coast55", "date": "September 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3975831}, {"rating": 2.0, "title": "Reasonable but safety an issue", "text": "I stayed here for three days on a business trip. Ideal for those who are doing business in the city but not for tourists. Tourists should head to South Beach instead.", "helpfulness": 1, "user": "AK_Dublin", "date": "March 1, 2008", "id": 13968725}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The room was the standard Hyatt fair, nothing to complain about. Nice flatscreen tv. Doors to the balcony did not work however.", "title": "Good stay at the Hyatt", "helpfulness": 1, "user": "Euroguy66", "date": "February 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13915954, "likes": {"liked": "— Fresh smell upon arrival", "disliked": "— bathrooms"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I was in my room during a major power outage and had to desend 22 floors via the stairwell which was scary. I found an emergency exit that was blocked, tied with strong plastic ties. This left me feeling very uncomfortable about the hotels safety in an emergency.", "title": "Loved it!", "user": "Dominidaly", "date": "February 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13874833, "likes": {"liked": "— Food, service, rooms", "disliked": "— Valet parking, expensive"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The Hyatt is in a good location in Miami - close to the port for people going on cruises and just beyond the port is South Beach. The rooms in the Hyatt were setup differently from every other hotel I have been in and were very appealing. The rooms had just been renovated and still had that new smell to them. We were going to use the self checkin but there was nobody else at the checkin desk so just checked in as normal. Staff was friendly and fast at processing check in. The only area that could have used some work was the actual bathrooms. The room was obviously renovated but the actual bathroom had not been touched. The caulking around the bath tub was roughly done and the tiles were slightly greyed due to age. Not a major deal but was a noticeable difference.", "title": "Probably the worse major hotel to stay in Miami", "helpfulness": 2, "user": "PandaExpress", "date": "February 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 13846921, "likes": {"liked": "— Close to the convention center", "disliked": "— Everything else sucked at this place"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The one thing that was the best about this hotel was the fresh smell as soon as you walked in. There was not a trace of stale or humid air and this was a very nice touch.", "title": "Loved the Hyatt Regency", "user": "papasquid", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13845879, "likes": {"liked": "— location", "disliked": "— no negative comments"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "A large, generic American hotel. We had a \"Miami Suite\"-catagory room (No 638) which had a nice view onto Brickell Bridge and the Miami River but, alas, was fairly noisy because of the traffic crossing the metal grid on the bridge and music from passing party-boats. The room is triangular in shape but large and comfortable. The furniture and general interior are kept in beige and brown tones and look quite tired but everything is reasonably clean and functional. Bed and mattress good. Room service reliable. Certain cosmetic items (toothpaste, vanity kit etc.) are complimentary but have to be requested. Bath ok but also has a used look and feel.", "title": "Wear and tear", "user": "virchow", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 159897021}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Flat-screen LG Television, choice of channels not impressive. Furniture: desk and chair, couch, armchair and coffee-table, chest of drawers, large closet in wall, king-size bed, five pillows: nice.", "title": "Not to sound like a broken record but...", "helpfulness": 2, "user": "Lisa G", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 4.0}, "id": 159844341}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Convention facilities are vast and functional. Bring your jacket, like in so many other places around here everything is air-conditioned down to around freezing point.", "title": "Surprised", "helpfulness": 1, "user": "Conrad F", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 159607315}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Breakfast service is very friendly, everybody speaks English and Spanish. The breakfast buffet carries a good variety of warm and cold food, including smoked salmon, fresh fruit and a daily special of egg benedict. Marmalade, jams and honey are imported from Switzerland (the miniature \"Hero\" glass jars). I am Swiss and I like our products but surely it does not make sense to ship these heavily packaged goods across the Atlantic when there MUST be some good Floridian orange marmalade?", "title": "Needs a Renovation or at least a good cleaning....", "helpfulness": 1, "user": "halterp11", "date": "May 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 159514801}, {"rating": 2.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "The gym is fairly small but during our stay there was never any congestion. ATM machine, pool, terrace, sports bar, souvenir shop, health spa all in the main building. There is a business centre too, but internet use is USD 10 for 15 minutes even for hotel guests which is, frankly, ridiculous. Wireless LAN in your room also expensive (1 hour USD 3.95, 1 day USD 10). WiFi should be free in EVERY hotel, but particularly in a business venue like the Mimai Hyatt.", "title": "Hotel is up for fully-fledeged uverhaul", "helpfulness": 1, "user": "Peter S", "date": "May 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 159347406}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "I stayed here for four days at a conference in August. It was the convention hotel, and it's a fine one at that. The staff is helpful and knowledgeable, the rooms are updated and clean, and the restaurants decent. It's connected to Miami's downtown Metro rail system, which connects you to the nearby convention center, the financial district, and the bayfront. There are some decent restaurants one or two Metro stops away, but the hotel isn't very convenient to anything in \"right-next-door\" easy walking distance (except for a neat little ethnic bar and grill next door, where the owner promotes \"Jeb Bush's Favorite...\" specials. Wonderful place and great conversation with the owner! I can't remember the name, but it's the only restaurant that's next door to the hotel.) The hotel (and this bar and grill) front a working waterway, but the Hyatt provides no tables and chairs or other opportunities to sit right outside the hotel and enjoy this amenity. The hotel is a 15-minute cab ride to South Beach, or a 30-minute bus ride on a C or K bus that you can catch three or four blocks from the hotel. I used the bus for the ride over to South Beach, and caught a cab on the way back. There's an Enterprise rental car office on site, which is very useful, except that it closes at 6 p.m. on weeknights and isn't open Sundays. That means you have to pay to park your car overnight ($12 self-park and more in the hotel valet) if you return after hours.", "title": "Nice convention hotel", "helpfulness": 4, "user": "fwtexastraveller", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 8379891, "likes": {"liked": "— Nice convention hotel, convenient to airport and Miami metro rail system", "disliked": "— Too far to Miami Beach."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I stayed at this hotel because I was attending a conference at the Miami Convention Center. The hotel is connected to the convention center, so it's very convenient. However, I spent more time going back and forth to South Beach for business lunches and dinners. A cab ride each way is about $20 - 25.", "title": "Close to the Miami Convention Center", "helpfulness": 2, "user": "CtheGlobe77", "date": "August 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8363531, "likes": {"liked": "— It was close to my convention", "disliked": "— It was far from South Beach."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The hotel itself is average. The rooms are clean, but the decor looks like it could use some updating. There was major construction going on across the street. The noise wasn't too bad, but the view from my hotel room looked out onto the construction site.", "title": "Disappointing Hyatt", "helpfulness": 2, "user": "UKflightattendant", "date": "August 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 8355641, "likes": {"liked": "— Comfortable beds!", "disliked": "— Never-ending construction in the vicinity"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Unless you need to be at the convention center or in downtown Miami I would recommend staying in South Beach.", "title": "Horrible Hotel - Worst Hyatt I've Ever Stayed At", "helpfulness": 3, "user": "georgec456", "date": "July 23, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 8222562, "likes": {"liked": "— It was safe", "disliked": "— Noisy, broken sink, slow check in, weird smell..........................."}}, {"rating": 2.0, "title": "Hyatt reputation tainted", "text": "I haven't stayed at any other Hyatt hotels, and I have to say, the Miami Regency is not a great advertisement for the brand.", "helpfulness": 1, "user": "cubnluvsba", "date": "July 21, 2007", "id": 8212854}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Location.", "title": "Good downtown location, dull dated decor but slept comfortably", "user": "docdot", "date": "May 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 160284173}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Located in downtown just at the beginning of the bridge for Brickell Avenue.", "title": "Didn't Make Me Loyal", "helpfulness": 1, "user": "hapytrainer", "date": "May 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160202619}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "You can easily walk to downtown area and shop very easily although there is not much there and is very quiet at night.", "title": "NOT NICE", "helpfulness": 1, "user": "BWDICKSON", "date": "May 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 1.0}, "id": 160074871}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "From Airport it is about 20 minute drive- if you are driving yourself, Sat navs get quite confused of the location but you will eventually find it.", "title": "Umm...not so much", "user": "EllenRuth63", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 160005298}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "For parking - valet is $31 for 24 hours- it somewhat takes time for the staff to get your car though 10-15 minutes- so ring down in advance rather than turn up in a hurry.", "title": "Very Nice Property With Friendly People", "user": "Bill J", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 159919198}, {"rating": 5.0, "title": "Great Hotel!!!!", "text": "This was our second stay at this hotel, and it did not disappoint!", "user": "Andiamo24", "date": "April 29, 2013", "id": 159204992}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Even though it is busy, the valet, & check-in was prompt and courteous.", "title": "Hotel is outdated, service was good", "helpfulness": 1, "user": "lovetotravelgal45", "date": "April 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 159194755}, {"rating": 4.0, "title": "Nice ore cruise stay", "text": "We were on the concierge level, and our room was spotless, comfortable, very quiet, and had a very restful bed.", "user": "maja651", "date": "April 29, 2013", "id": 159180422}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The snacks were delicious and plentiful. Every employee I came in contact with was very helpful and were not satisfied until I was. Great service!!!!!", "title": "Comfortable but needs updating.", "user": "Tamika G", "date": "April 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 158971880}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Don't let the downtown location scare you, it was convenient to everything, fine restaurants, bayside mall, Miami Beach,", "title": "Best customer service ever", "user": "JennHigh", "date": "April 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158930310}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "I was here for a convention and it is every thing that a typical business hotel is (especially the prices). The renovations seem to be just about done and the previous problems reported in other reviews seem to have been resolved. I personally do not like Miami, but the Hyatt was certainly comfortable for the two days I was there and the staff was certainly attentive.", "title": "A nice business hotel", "helpfulness": 1, "user": "accbiker", "date": "April 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 14813424}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "I had a conference at the Hyatt Miami and after reading the previous posts listed here, I was really nervous about it. Hubby and I stayed and had a wonderful time. The room was comfortable and nice and clean. After a day or two, the bathroom had a weird smell, but overall our stay was great. Smell went away also. Hotel staff is very accommodating and friendly. The MetroMover located right next to the hotel was very convenient. We took it to Bayside and Brickell. Bayside was great for restaurants, shopping, and boat tours. Not so impressed with Brickell as they are still undergoing construction. There were a few restaurants there but not quite ready for visitors. A taxi to South Beach was approx $20 and well worth it. Taxi to Parrot Jungle was about $13. The balcony doors still aren't able to be opened and there is a ton of construction around but our stay wasn't disturbed by any noise. It is a concrete jungle, but it's not as bad as some of the previous posts will have you believe.", "title": "Pleasant Stay at Hyatt Miami", "helpfulness": 1, "user": "mightyquin", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 14500959, "likes": {"liked": "— Free MetroMover", "disliked": "— Could not open balcony"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "A conference my wife attended over a weekend in March '08 was located at this hotel. The renovation construction referenced by other reviewers must be complete. Our room was updated and clean with new furniture and a flat screen TV. The bathroom was also clean. The bed was WONDERFUL. The staff was extremely helpful and willing to please; they exceeded my expectations. The swimming pool is open. Taxi cabs are available onsite 24 hours a day.", "title": "Nice Hotel, Friendly Staff, Undesirable Location", "helpfulness": 2, "user": "Gridfather", "date": "March 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 14362741, "likes": {"liked": "— The bed", "disliked": "— The surrounding neighborhood"}}, {"rating": 2.0, "title": "Won't be back", "text": "Fridays and Saturdays are chaotic as cruise ship passengers are checking in and out prior to cruising.", "helpfulness": 1, "user": "TonyPSP", "date": "March 6, 2008", "id": 14104847}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I ate one meal at the sports bar attached to the lobby. Prices have a hotel premium but are not outlandish. The menu was small but varied. I overheard other guests complaining about the cost of the breakfast buffet ($20) in the restaurant. Many cruise ship passengers had vouchers for breakfast, thus the buffet.", "title": "Substandard Hyatt", "helpfulness": 1, "user": "buzytraveler", "date": "March 4, 2008", "detail_rating": {"business": 3.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 14055490, "likes": {"liked": "— Hyatt Grand Bed", "disliked": "— Not what I expected from a Hyatt. Poor location, poor hotel experience, poor hotel. Staff tries but looks and acts tired. Just like the overall feel of the hotel."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007", "text": "We had a corner room that not only smelled bad but had some sort of strange bugs in it. We only stayed one night and had it been longer would have moved. It is a wonderful palce to stay to be close to everything and the staff is really nice.", "title": "OKAY NOT THE BEST", "helpfulness": 2, "user": "vcassidy", "date": "November 30, 2007", "detail_rating": {"value": 2.0}, "id": 11168887}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "I just spent several nights at the Hyatt Regency Miami for a conference. It was a mostly unpleasant experience. The room had one of the worst, moldy smells I have ever encountered in a hotel, certainly in a Hyatt. I complained to the front desk and they did send someone to check on the A/C (there was moisture on the floor in front of it). There was a little card in my room that maintenance had visited, but I think the room smelled worse after they visited. The odor was pervasive throughout the hotel though, not just in the room. There was construction/renovation underway, but the odor was not one attributable to construction (though two of the days my floor also had pervasive solvent odors).", "title": "What a smell!", "helpfulness": 3, "user": "artstraveler", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 1.0, "value": 3.0, "location": 1.0, "rooms": 1.0}, "id": 10628454, "likes": {"liked": "— The gym", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "In addition, these were some of the worst conference rooms I have experienced - poor lighting, bad sound systems. And for the rooms that had dividers the sound leakage from adjacent meeting rooms was so invasive that it was nearly impossible to concentrate, or hear, what was being presented in the session I was attending.", "title": "No better place", "helpfulness": 2, "user": "jamesunt", "date": "November 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10583357}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "I have stayed in many Hyatts over many, many years of business travel, and this was by far the worst one I have encountered. I seriously considered checking out and finding any hotel I could within the vicinity, but that was a challenge of its own. The Hyatt is completely surrounded by half-completed (and apparently halted) high-rise construction, freeways, and incredibly busy roads. It was virtually impossible to figure out how to walk anywhere from the concrete locked space.", "title": "Great bargain (if you can look past the construction)", "helpfulness": 1, "user": "PierreLaCroix", "date": "October 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10064457, "likes": {"liked": "— Location is ideal!", "disliked": "— The construction (but this will eventually be completed.)"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "That all being said about the facility, I certainly found the staff to responsive, attentive and extremely helpful, up to the standards I would have expected and have experienced in a Hyatt. My experiences were ultimately limited to the front desk and the restaurant and the personnel was great - I commend them. Management on the other hand needs to think seriously about this property. I hope they are making it something worthy of there own staff and that the renovations will cure these ills. Check it out carefully before staying there.", "title": "Disaster! Moist rooms... But fine service, and kudos to staff", "helpfulness": 1, "user": "BetterthanBings", "date": "October 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 2.0}, "id": 10057366, "likes": {"liked": "— The renovated rooms were nice; Staff responded well and appropriately to problems", "disliked": "— Several unlikely events converged, but perhaps it was just fate"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Breakfast is good and fairly reasonable price-wise, with a good selection and a pleasant, efficient staff team. Take advantage of this and fill up for the day!", "title": "OK for the price", "user": "JAD48", "date": "July 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 2.0, "cleanliness": 3.0, "rooms": 2.0, "location": 2.0}, "id": 8182490, "likes": {"liked": "— Bed", "disliked": "— Bathroom"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Smokers - which I am not! - take note: smoking is only permitted in rooms on the 15th floor so if this is important to you, confim and confirm again a room allocation. Because although there are balconies from each room, they are now merely decorative and a rather misleading feature of publicity shots! The hotel is now sealing all balcony doors so you have no access to them, in an attempt to minimise construction noise and reduce in-room humidity. However, this is a shame, as it is nice to be able to pop out for a few minutes or have a drink on the balcony etc. especially in mild temperatures. I see they make no mention of the balconies as a room feature on the website. All I'm saying is, don't let the pictures fool you!", "title": "Not worth the money!", "user": "kelly_ar31", "date": "July 16, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8129998, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I stayed here because of a conference in this hotel. I do not recommend this hotel for anything except business trips or a one night stay to connect with a cruise ship. The hotel is showing its age and while they have renovated the rooms, the bathrooms are still small and show their heritage from a time when bathrooms were a necessity and not considered part of a luxury hotel stay. Our room faced the Bay but because of numerous condos under construction, our view was one of a concrete structure under construction. We could wave to the workers. It was also noisy. The draw bridge has an annoying way of waking you all through the night.", "title": "The Concrete Jungle", "helpfulness": 4, "user": "Peripatetic_Engineer", "date": "May 6, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 7552584, "likes": {"liked": "— Nothing", "disliked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007", "text": "As far as amenities, the pool is small. We never received a morning paper and there is only one restaurant in the hotel. There is no green space around the hotel. It is next to the convention center and everything is concrete.", "title": "Convention Center Hotel", "helpfulness": 1, "user": "joylama", "date": "April 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7430951}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "On the plus side, the food that was provided at the convention dinners was pretty good for buffet food. The chicken and beef was tender and the vegetables tasty.", "title": "Good overnight stop before a cruise", "helpfulness": 5, "user": "navigator", "date": "April 24, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 7429903, "likes": {"liked": "— Convenience to port", "disliked": "— The bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "It will cost $27 for valet overnight parking and a taxi to South Beach is $25 each way.", "title": "room reservation problems", "helpfulness": 2, "user": "hwsdrea", "date": "April 17, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 1.0, "location": 4.0, "value": 2.0, "rooms": 2.0}, "id": 7381989, "likes": {"liked": "— Nothing", "disliked": "— didnt honor reservations even with confirmation number, very noisy, dingy bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "This is a workable business hotel connected the convention center. The rooms are dated (looks like a decade or so since the last redo of the rooms). The views are of a cityscape. Lots of construction & construction noise - starting early, even on the weekends. The nearby drawbridge was also pretty noisy. Bathrooms were dumpy from the decor to the fixtures. While the room was outdated - it was okay. The bathrooms were below standard. Don't think it deserves anything higher than a 2.5 star rating for what it is now", "title": "Dull, unexceptional, with a frown on its face", "helpfulness": 2, "user": "OffTheBeatenPath", "date": "April 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7365503, "likes": {"liked": "— Fitness room", "disliked": "— Service"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We pricelined this hotel when we decided to go in a day early. The hotel, staff, rooms, restaurant - everything was perfect. I will definitely consider this hotel again when cruising out of Miami. There is nothing that was negative about the Hyatt.", "title": "Wonderful experience", "helpfulness": 1, "user": "IRB33785", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161147762}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Hyatt has typically not been at the top of my list, but this stay certainly changed that perception. It's without a doubt a great location in Miami, and perhaps that skews the judgement a bit. But without a doubt the service here is really, really good.", "title": "Better than expected", "helpfulness": 2, "user": "TravelinSteve2013", "date": "May 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 160748026}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Great reception at check in which was swift and efficient; impeccable wait staff at the restaurants; (ask for Amy at Pure Verde); and a good catering service that doesn't quit until you're 100% satisfied.", "title": "Just an average hotel", "user": "Dar G", "date": "May 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 160524760}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Clean rooms with good Wifi signal that doesn't crash so you can get the work done fast and get to the party.", "title": "Short Pleasant Stay", "user": "AsheleB", "date": "May 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 160512877}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "A comfortable bed to sleep well on; a bit firm for me, but to each their own, right?", "title": "Good location", "user": "frenchie70", "date": "May 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 160304669}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "In Miami for a Fencing Tournament. Based on previous reviews I was a little bit worried but our room was moderately nice, although we were", "title": "Pleasantly Surprised", "helpfulness": 3, "user": "fencermom", "date": "July 5, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 2.0}, "id": 8063604, "likes": {"liked": "— Private Dressing quarters.", "disliked": "— Small bathtub"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "gone most of the time. The hotel is currently under remodel. Staff was helpful and always pleasant. Parking is VERY expensive but valet is quick to retrieve your vehicle when you need it. The surrounding vicinity is kind of seedy and there are no places to eat/shop near by. Hotel food is expensive ($12 for just a 6\" round waffle - nothing", "title": "Great place for convention, otherwise average", "helpfulness": 3, "user": "RyryE", "date": "June 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7790738, "likes": {"liked": "— Meeting Rooms and hotel's proximity to downtown", "disliked": "— Food and price of restaurants"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "else) but good. We enjoyed eating in the bar where the food was cheaper. Compared to hotel reviews from other travelers in our party sounds like the Hyatt was a good choice. If needed we would probably stay here again for a short visit.", "title": "Average business hotel", "helpfulness": 1, "user": "PoppyTT", "date": "May 26, 2007", "detail_rating": {"front_desk": 3.0, "value": 3.0, "location": 3.0, "business": 3.0, "rooms": 2.0}, "id": 7701102}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I stayed at the Hyatt for a few nights recently as part of a large seminar held at the property. The set-up for the meetings was excellent, and the staff did a great job of keeping the rooms clean, stocked with water, soda, etc.", "title": "Not recommended", "helpfulness": 2, "user": "Luv2Travel_CMH", "date": "May 23, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 7681926, "likes": {"liked": "— Dirty and Outdated"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "As for the hotel room, I had a nice view from the 21st floor, but it was an average room. The bed was very comfortable, and the room was plenty big, however, it was nothing spectacular.", "title": "Nice Hotel", "helpfulness": 3, "user": "maac56", "date": "May 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7580070}, {"rating": 3.0, "title": "Okay for a Short Stay", "text": "I was in Miami for a night and booked this hotel through priceline. We got a rate of $65. I was nervous about staying at the Hyatt based on mixed reviews.", "helpfulness": 2, "user": "ColombiaRiz", "date": "April 27, 2008", "id": 15413061}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Upon our arrival we were relieved. The room were were assigned was newly renovated, clean and comfortable. Although the room was new, it seemed a bit tacky and lacked coordination.", "title": "disappointed", "helpfulness": 1, "user": "coluv", "date": "April 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 15409761}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "The bathroom was the only part of the room that needed improvement. The bathroom was very institutional.... like a hospital bathroom.", "title": "Fine for conference", "helpfulness": 1, "user": "anATLgirl", "date": "April 8, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 14893831, "likes": {"liked": "— great service", "disliked": "— location"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "For a short stay the hotel fine... but just dont expect a 4-star hotel.", "title": "Not bad for convention hotel...", "helpfulness": 3, "user": "nbell8", "date": "April 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 4.0}, "id": 14851168, "likes": {"liked": "— bed", "disliked": "— nowhere to walk around at night and limited restaurant choices nearby"}}, {"rating": 4.0, "title": "Nice hotel before cruisin'", "text": "Overall, very good customer service from employees. However, we encountered some problems not normally associated with bigger hotels.", "helpfulness": 3, "user": "BeachTeach", "date": "April 6, 2008", "id": 14820664}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We stayed at this hotel one night pre-cruise in September and had a very pleasant experience.", "title": "Had A Great Experience Here", "helpfulness": 1, "user": "promal", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 8720005, "likes": {"liked": "— The beds were very comfortable, staff very professional", "disliked": "— No refrigerator in room and the price of parking was a bit high."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Our check in was quick and efficient. We were checked in by a lovely girl named Marie. We were given room 1610.", "title": "Not impressed, very dissapointing Hyatt.", "user": "EmmanLukesMum", "date": "September 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8696756, "likes": {"liked": "— Location", "disliked": "— Guest Rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The room was very clean. Our room overlooked another building being constructed. We checked in on a Saturday, so construction noise was not a problem. There are renovations going on in the hotel, but the areas being renovated were blocked off at the elevators and there was no renovation noise while we were there.", "title": "Aging hotel, not 4 star", "user": "gobux", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 1.0}, "id": 8521015, "likes": {"liked": "— free people mover to downtown Miami", "disliked": "— cleanliness, very , very dirty"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007", "text": "The room was spacious with a balcony and the balcony door actually opened. However, neither of us stood too long on it - it was a bit scary so high and being so small.", "title": "If you have any choice, don't stay here.", "helpfulness": 1, "user": "njtraveler15", "date": "August 27, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 3.0}, "id": 8518359}, {"rating": 3.0, "title": "Avoid If You Can", "text": "The room had a king size bed with very comfortable bedding. There was enough drawer space, a t.v., desk, closet area and bathroom area behind a wall behind the bed. The room was quiet - we heard no hallway noise at night nor any noise from our neighbors.", "helpfulness": 1, "user": "WestEndAvenue", "date": "August 16, 2007", "id": 8436023}], "location": {"country": "United States", "city": "Miami"}, "stars": 4, "variance": {"poor": 166, "average": 344, "very good": 408, "terrible": 84, "excellent": 225}, "aka": "Hyatt Regency Miami Hotel Miami", "slim_ranking": 0.541984732824, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}