{"user_rating": 3.5, "review_count": 412, "name": "Hyatt Vineyard Creek Hotel and Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Just needed a hotel for a night, received a very good rate on Hotwire, not knowing for sure what hotel we would get.", "title": "Good clean accommodation in wine country", "user": "europa00", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 34043387}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Room was huge, one king bed. Bed was probably made with queen size sheets - the sheets did not cover the entire bed. Very strange, and who is going to call housekeeping when you discover this at midnight? The in-room furniture wasn't very comfortable and too formal - two chairs and a love seat.", "title": "nice hotel but....", "user": "Nasagirl09", "date": "June 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 32468600}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Bathroom was very nice with double sinks, seperate jacuzzi tub and shower. However no bathroom light over shower stall.", "title": "Great Base for the vine valleys", "user": "WestWalesTraveller", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31729818}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Overall nice stay just a few odd things in this nice hotel that could be fixed to make it the best room/hotel in the area.", "title": "A nice little hyatt", "user": "kueric09", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 31515810}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "close to little shopping district and very nice restaurants with artisan breads galore. Stay away from the room service though. mediocre high priced food and they actually served my husbands salmon raw and the bread was so hard and burnt i couldn't even eat it.. nice area but for a hyatt i would have expected someone to help with bags. If i didn't get such a good deal on Travelzoo i probably wouldn't have stayed. The one highlight..get the couples massage and enjoy the Spa.", "title": "Great Hotel, convenient location, wonderful staff!", "user": "parkercouple", "date": "May 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31210745}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Great hotel one block from downtown Santa Rosa, with plenty of free parking and nicely decorated exterior, new bathroom fixtures / granite counters, and decent room decorations. There's a small gym with sauna and outdoor pool/hot tub. Bath towels are older/cheaper bath towels more typically found at a Marriott Courtyard than at a Hyatt. Courteous staff and elegant/safe environment to be in, even at late night. Our room was near the elevator but still was quiet and peaceful. The hotel was gorgeous from outside but not much view from inside the rooms (look out to parking lot or small courtyard, your pick). Overall a great experience if you just want to hang around the Santa Rosa area for a weekend.", "title": "Nice upscale hotel one block from downtown Santa Rosa", "user": "JJLL", "date": "October 29, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 21379169, "likes": {"liked": "— Nice hotel one block from downtown Santa Rosa, exterior decoration, bathroom fixtures, aged-wood room furniture", "disliked": "— Cheap bath towels, worn carpet, not much view from room"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Location: It's right off the highway and not walkable (and quite a drive) to any wineries. Very close to the highway, no views.", "title": "Worst Hyatt I've ever stayed at and not near wineries", "helpfulness": 2, "user": "stevemeg", "date": "October 29, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 21365531, "likes": {"liked": "— restaurant", "disliked": "— location, cleanliness, horrible staff"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Hotel Room: We paid extra for a room with a large separate tub. Upon arrival, we found hair in the tub, the sinks, the shower. Gross. We told the front desk attendant who could have cared less.", "title": "Loved this hotel experience", "user": "solobird", "date": "October 22, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21115552}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "There was a tray with one wine glass on it. We called down to the front desk to see if we could get second. Upon further inspection, the first was used and put back! We called again for a 2nd glass. Took the staff 2 hours to bring it.", "title": "pool delightful, fire pit a dream, and very comfy rooms...to boot", "helpfulness": 1, "user": "sallygatorNewOrleans", "date": "October 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20973640, "likes": {"liked": "— location and price/free parking and ambiance", "disliked": "— lobby bar prices a bit high for happy hour- but then, again, Fridays seem to be different..."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "Carpet was stained. The bedding was old. The couch had stains. Definitely not up to Hyatt standards.", "title": "There has to be better and closer to the vineyards", "user": "quirky76", "date": "October 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 1.0}, "id": 20829859, "likes": {"liked": "— gym and pool", "disliked": "— conceige lack of info and delivery"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The rooms at this hotel are extremely run down and in disrepair. There are dirt spots on all the furniture. Material is actually coming out of the sofa in the room. This hotel is much more akin to a travel lodge or a Ramada Inn. It is not what you think of when Hyatt comes to mind. Unless of course the Hyatt brand has become diluted from selling their name to other companies. When we booked an executive suite we expected something separating the bedroom from the sitting area. Not in this case, it is all one area. I actually felt like crying when after trying to dicuss this with the manager on duty (who was not at all helpful) that this was not what we had in mind or was represented to us. When I showed him all the spots on the furniture, feathers seeping out of the sofa and just plain old ickyness everywhere he said \"that's all we have available\". He moved us to another room after my husband had an allergy attack from the feathers. The next room also had dirt spots and stains all over everything. He basically said \"take it or leave it\". We were stuck since it was a busy Friday night in Wine Country. My husband and I dreaded spending anytime in our room. I will never stay at another Hyatt unless I thoroughly have a verification that it is a decent place. As for this hotel I would say \"buyer beware\". Check out the reviews and comments from other travelers and go there with very low expectations. The last time we were in the area we stayed at The Carneros Inn and absolutely loved it.", "title": "Never Again!", "helpfulness": 1, "user": "lynnefarris", "date": "March 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 26618760}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Our entire family took up 20 rooms here for a wedding weekend. The room I shared with my daughters was small and felt cramped and did not have adequate lighting. The bathroom did not have sufficient mirrors or counter space to accommodate more than 1 person. The bathroom door was a slider which seemed kind of cheesy for a Hyatt. The room rate was very high and yet there was an additional charge for Internet access and for a bottle of water. The service was only average; there were no outstanding staff. We were disappointed in the overall lack of amenities we expect from a high dollar hotel.", "title": "Ordinary hotel", "helpfulness": 1, "user": "nancyinabq", "date": "December 11, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 22643149}, {"rating": 4.0, "stay_parameters": "Stayed September 2008", "text": "Stayed at the Hyatt and thought it was a good, decent hotel. The grounds of the hotel are ok. But realize that you are staying at a hotel, not a resort. The pool area and hot tub are nice. There is a fire pit in the courtyard also. The room itself is nice, but a bit on the small side, narrow actually. The staff was very nice.", "title": "Good hotel", "user": "dannycarlucci", "date": "November 25, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 22166785}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "The location of the hotel is a little out of the way. The historic Railroad Square was really nothing to write home about. A couple of semi-decent restaurants and shops, but way overrated. The hotel is a distance away from wineries. If you are looking for wine tours, you would be better off staying in Sonoma or Napa.", "title": "Ordinary Hyatt in Sonoma Wine Country", "helpfulness": 1, "user": "FlyguyAustin", "date": "November 2, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "business": 3.0, "cleanliness": 5.0, "rooms": 4.0, "location": 3.0}, "id": 21478882, "likes": {"liked": "— Location to wine to Sonoma wine country.", "disliked": "— Service, dark room"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "This is an \"ordinary\" Hyatt. Located between the freeway and railroad tracks, attached to an event center. Service is substandard, I was offered a murphy bed and only on protest got a regular bed. Waited a long time for a replacement light bulb, which, because the room was very dark, mattered. The room was OK, regular TV, small coffee service, average ammenities, and USA today provided free. Wireless service available from T-Mobile, if you have an account it is free, but otherwise you will pay their hourly or daily rates.", "title": "Stay away from this hotel at all costs", "helpfulness": 3, "user": "TexasDoc1", "date": "October 31, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 21424534}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We got a great rate.... less than $85 a night....over the Memorial Weekend! PLUS!! a $50 hotel credit, which we used at the .The remodel is beautiful. We had a Deluxe room. it was nice and large. Very modern. Super clean. Everything was in excellent work order. Staff was very nice. Location, not bad. We were able to get to the where we wanted within a reasonable time. Overall we had a great time.....I almost forgot. the beds were great and the bathroom was a nice size.", "title": "WOW.... love the remodel!!", "user": "kissedbythesuntanner", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 31045741}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Excellent hotel for the price. Rooms are clean, modern, good size, and bathrooms appear to be recently renovated with new fixtures and counter. We even had a had a flat panel tv. The bed was very comfortable and room fairly quiet (our room faced away from Hwy 101). Will definitely return when we are back in the area again.", "title": "Nice hotel!", "user": "a4avant", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30770245}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I stayed for one night at the Hyatt. We live in a neighboring county and had to stay overnight for an event. We found the room to be clean, comfortable, and the bed, especially, to be great. We did not understand the negative reviews about dirty rooms, furniture, etc. I went out for the evening and my husband stayed in. When I returned he stated he had a quiet evening, a good meal at the restaurant. You need a room key to enter the lobby and the elevators, which made me feel safe. We liked the hotel and will return again for an event in October. Only wish we could have stayed longer. Lovely gardens and pool area too!", "title": "Very Nice Hotel", "helpfulness": 1, "user": "nolaleemc", "date": "May 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 29503530}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Stayed over for one night during a Napa road trip so might not have experienced everything. Check in was very quick and flawless. Our room overlooked the courtyard and was very quite. Bathroom was nice and clean with a modern touch. The room was of normal size. I can say that it was a good stay. Room service is reasonably priced. It is however, out of the way for wine country tours. If you plan on visiting the area from this location, it will not be easy. We booked at a rate under 90USD therefore, it was a good deal. I would not stay here if we had to pay more than 100USD though.", "title": "Nothing Wrong", "helpfulness": 1, "user": "Cigarfreak", "date": "April 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 28153723}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Nice places to eat around. We ate at the Syrah Bistro. Nothing great. Over priced for what you get.", "title": "Would not recommend this hotel, very inconvenient for guests", "helpfulness": 1, "user": "JKraz", "date": "March 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 27195128}], "location": {}, "stars": 3.5, "variance": {"poor": 40, "average": 81, "very good": 163, "terrible": 20, "excellent": 108}, "aka": "Hyatt Vineyard Creek Hotel Santa Rosa", "slim_ranking": 0.192307692308, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "3 story boutique hotel with Tuscan-style architecture. Rich wine country colors and oversized furniture gives the feel of comfort and home in the lobby and rooms. Sun drenched courtyards border the meeting rooms, allowing for natural light and patio access on our 14,000 square feet of space. The wisteria covered walking paths are bordered by a 80 foot water wall and 18,000 square feet of open grass space and gardens."}