{"user_rating": 4.5, "review_count": 1085, "name": "Hyatt Regency Denver At Colorado Convention Center", "reviews": [{"rating": 4.0, "title": "A fine hotel.", "text": "I found this hotel to be great. Exceptionally friendly interactions with staff. Fast elevators. Clean, modern rooms. Could never get the wireless to work, but I didn't feel like figuring it out.", "user": "BeachChair", "date": "February 17, 2008", "id": 13634946}, {"rating": 5.0, "title": "Nice place", "text": "This place is new and in a great location. The service was very good. The rooms are large enough to easily accomidate a rollaway.", "user": "bigkent", "date": "February 2, 2008", "id": 13207595}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We spent a weekend at this hotel and were very impressed. The service was excellent and the hotel itself is beautiful. We loved the view from the Altitude Bar on the 27th floor. Our room was spacious and had a decent view of the mountains. The workout room is loaded with new equipment, plus a great view of downtown. There are tons of shops and restaurants within walking distance. We took the Super Shuttle from the airport to the hotel and it picks up every 15 minutes to take you back to the airport ($20 each way).", "title": "very nice hotel", "user": "Kim-KC", "date": "January 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13065269}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "I definitely recommend this hotel to anyone visiting Denver for the first time. As a first time visitor myself, I found the location lovely, amenities superb, and the staff polite and helpful. Upon arrival my boyfriend and I were immediately offered a $20 voucher for any bar/restaurant in the hotel, and a free continental breakfast. Even without the vouchers a trip to the sky-high bar and restaurant for breakfast are well worth it. The rooms and bathrooms are clean and tastefully decorated, and many come with wonderful mountain views! We enjoyed our stay here so much that we booked another night for the very next weekend!!", "title": "Great location, great hotel!", "user": "Milwaukee85", "date": "January 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12894739}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "It was my first time visiting Denver and after reading the reviews I chose the Hyatt Regency. BIG MISTAKE!! One inconvenience after another. First thing I noticed upon enter my room was a HUGE NASTY STAIN ON THE OTOMAN, and a some YELLOW SPOTS ON A PILLOW. I called front desk for a room change, even if it cost more we would've taken it, but the staff could not do anything for me at that time. New Year's Eve was a mess; some staff were EXTREMELY RUDE, but the young employees were the only delightful ones there, even if they had to work on New Year's Eve they stayed nice and friendly. One REALLY RUDE LADY was the one that was checking wristbands for Regency Club Lounge. It felt like she was dicriminating my guest and I and made us go back and forth to get the correct color wristband. Funy thing was my guest and I were going in and out of that Regency Club Lounge many times on that day and the day before, so much the women working up there recognized us, and then to be rudely rejectly on New Year's Eve like the way the RUDE LADY DID, IT TOTALLY RUINED OUR NIGHT AND NEW YEAR'S EVE!!!!!! I feel that I threw away my money by staying at the Hyatt Regency in downtown Denver. I WILL NEVER STAY THERE AGAIN!!!!!", "title": "Beautiful Location, but HORRIBLE SERVICE", "helpfulness": 1, "user": "TJWidjaja", "date": "January 13, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 12586282, "likes": {"liked": "— View from room", "disliked": "— CUSTOMER SERVICE NEEDS A LOT OF HELP"}}, {"rating": 4.0, "title": "A standard Hyatt", "text": "This Hyatt was close to everything but was just OK in amenities. I am a Platnium Gold passport member and expected more. But everything was nice, clean and close.", "user": "perryspires", "date": "February 9, 2010", "id": 55576683}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Let me start this off first by saying that I travel a lot. As a comic, I stay in hotel's regularly, so to say this was the worst treatment I've ever had is a pretty tall order.", "title": "Worst stay at a hotel yet.", "helpfulness": 2, "user": "ben_roy_rock", "date": "January 25, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 54365556}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Stay here if you're not planning on enjoying yourself in any manner. The staff is rude. The management is condescending and rude. If you want to pay $200 to be mistreated, get a dominatrix.", "title": "Service with no smiles", "user": "brianmdr9", "date": "January 2, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 52344118}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "We stayed here New Years Eve to take in downtown Denver having moved from the Grand Hyatt. On the surface this a pretty new hotel and looks great. The bar area is nice as is the Restaurant. The rooms were still very basic Hyatt. Glorified dorm room. Beds were stiff but the rooms had basic necessities.", "title": "Fantastic Stay", "user": "FoodExpurt", "date": "December 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52249919}, {"rating": 5.0, "stay_parameters": "Stayed September 2009", "text": "I probably had one of the worst service experiences of my life at this hotel thanks to a surly bartender named Kristin who took bad American service to an all time low. I could never imagine that anywhere else but a Hyatt that would allow people like this to interact with customers. Its emblamatic of how awful the service industry has become. If you are ok spending 150 bucks to be asbused by hotel employees stay here. We have always liked the Loews in Denver. Much better than Hyatt.", "title": "Great hotel in an excellent location", "user": "mandakini84", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 52052013}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel seemed really nice when you walk into the lobby. Once inside your room, beware of paper thin walls. Can hear everything your neighbors do, so bring ear plugs. I complained to the desk at 3:00 a.m. that the neighbors have tv very loud and I requested a quiet room. They just told me they would send security up. Didn't try to correct my situation. Also beware of expensive garage parking at hotel $21 a night, self park.", "title": "bring ear plugs", "user": "japow", "date": "December 31, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 12174258, "likes": {"liked": "— Peaks Lounge, nice view", "disliked": "— the room with adjoining door"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "We stayed 2 nights at the Hyatt and were extremely pleased. The staff was very helpful and took initiative to meet our needs. The gym was not the typical hotel gym, but more like a regular, full sized gym. The lounges are great, as well as the outdoor hot tub overlooking the city. We will definitely be back on our next trip to Denver.", "title": "Great deal", "user": "SarahFL", "date": "December 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12109878}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The quality of this hotel was very good and as I was attending a conference at the convention center it was ultra convenient. They charged a lot but the conference was busy. The main issue I had was when using the gym they didn't have any locker keys even though lockers were available and left it to me to contact reception. Just poor customer service in the gym.", "title": "Very good hotel, fantastic bar on the higher floors but not perfect", "user": "stuartmo", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 12007205, "likes": {"liked": "— The bar on the 21st floor", "disliked": "— Unhelpful gym staff"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "This is a beautiful hotel very close to the Convention Center. The rates in December were fantastic- under 100 dollars per night. The service and the hotel were fantastic. The only complaint I had was the cost of parking per night - we had two vehicles and it cost 42 dollars per night to park them ---- ouch!", "title": "Fantastic Service and Wonderful Rooms", "user": "keylon", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12000108, "likes": {"liked": "— The location and the views", "disliked": "— the cost of parking 42 per night for two vehicles"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We booked a room at the Hyatt Regency at the last minute, when our travel plans changed, and we couldn't have been happier. Because we happened to be at the hotel at its slowest time (the two weeks before Christmas), the very helpful front desk clerk upgraded us to a \"deluxe\" room on the 33rd floor--with an incredible view across downtown Denver to the mountains. The room was spotless and attractively furnished, with all the typical amenities, and the bellman who helped with our luggage was as nice and friendly as he could be. We also enjoyed having drinks and appetizers in a lounge on the 27th floor, also with a spectacular view of the Rockies.", "title": "Great high-rise hotel", "user": "Historybuff52", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11712214, "likes": {"liked": "— Great service, beautiful facilities", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed here for a night while catching an Avs hockey game. It is perfectly located to all the Denver restaurants and walking distance to Pepsi center. The Hyatt is definitely on top of the game for service. We had a couple of minor room issues and they were handled promptly and properly. The food & drink are on the high end but you pay for convenience. The health club is state of the art, has all the equipment and open 24 hrs, it would have been nice if the pool was also. The hot tub is outside and is big and stainless steel, it was snowing and that was a nice bonus. The only minor problem with the hotel was the light rail it seemed to run every 15 mins and you could hear it's bells on the 27th floor.", "title": "A good new Hyatt hotel", "user": "Pipermurphy", "date": "December 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11337229, "likes": {"liked": "— service", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I stayed here over Thanksgiving for a quick getaway into the city and so I wouldn't have to cook a turkey. The level of service here is excellent. The staff is very attentive and every one of them asked me if there was anything I needed any time we met!", "title": "Great Service, Lousy Food", "helpfulness": 1, "user": "killachilla", "date": "November 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 11081041, "likes": {"liked": "— service", "disliked": "— lousy food"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The first night there were a bunch of wild college students next door to us who were partying at 3am. After calling the front desk to complain, security arrived and promptly evicted them (I gather mine was the second complaint of the night). The next morning the manager even called us to apologize again for the disruption.", "title": "Nice hotel", "helpfulness": 1, "user": "dozingdog", "date": "November 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10827164, "likes": {"liked": "— service", "disliked": "— food from room service"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "We had room service the next morning and it was probably the worst breakfast I've had to suffer through - and all I had was a yogurt parfait and juice! My companion agreed and said the eggs, toast and sausage were equally bad. If you are looking for breakfast, check out Dixon's, that's the best breakfast in downtown Denver! And much more reasonably priced (our room service came to around $50).", "title": "Good facilities for convention center business", "user": "Elsiedog", "date": "November 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 10667739, "likes": {"liked": "— Good bedding", "disliked": "— Alarm clock could not be rest without calling engineering! Have to depend on wake up call."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Valet parking is $25, or I think you can self-park for around $10-15.", "title": "Solid Convention Center choice", "user": "lizicat", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10508571, "likes": {"liked": "— location, great views", "disliked": "— Room could have been cleaner"}}, {"rating": 4.0, "title": "Excellent hotel in a great location", "text": "I stayed here for 1 night with my parents and 4 year old daughter. We came to Denver to see Mary Poppins and loved the show and the hotel. The location is perfect and the hotel is beautiful with great amenities. Comfortable and spacious rooms and was very quiet at night on our floor. Pool, hot tub and workout rooms were nice and we ate a delicious breakfast the next morning (kids under 5 eat free at the buffet). I would definitely stay here again.", "user": "TheVBs", "date": "April 3, 2010", "id": 60274450}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Was here for a conference in March, 2010 and found the hotel to be more than adequate. Front desk staff was very helpful and check-in was a breeze.", "title": "Great Convention Hotel", "helpfulness": 1, "user": "DDatYVR", "date": "March 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 59153013}, {"rating": 5.0, "title": "Great Hotel", "text": "The rooms were clean and spacious. The bathroom, though clean, had granite countertops that I personally think helps hide dust and stains. Additionally, to close the bathroom door, you had to stand by the toilet seat so that there is enough clearance to shut it.", "helpfulness": 1, "user": "burnsy7", "date": "March 21, 2010", "id": 59101166}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Amenities-wise, the gym was very well-equipped and large enough. Going in the morning, you'll need to get there early - about 5:30 a.m. - in order to avoid the line-up for the cardio machines. Conference facilities were great, while most of the food was decent.", "title": "Pretty good, but not clean", "helpfulness": 1, "user": "SJMomNewYork", "date": "March 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 58678861}, {"rating": 3.0, "title": "Construction noise across the street can awaken guests at 3:00 m", "text": "My one gripe with this hotel is that you have to pay $10 for internet access during each 24 hour period. For a business/conference hotel, this seemed more like a money grab because we don't have another choice. If office work needs to be done, you'll have to cough up that money.", "user": "VPMarketing", "date": "February 12, 2010", "id": 55811152}, {"rating": 4.0, "title": "Overall very nice hotel", "text": "Stayed at the Hyatt Regency Denver Convention Center for 2 days on business. Overall I have to say I was very impressed with almost everything about this hotel. All of the staff were professional and helpful. Room service was very prompt and food was great. Room was clean and I had a beautiful view of the mountains (snow covered from recent storm). This hotel is directly across the street from the Convention Center which was my destination each day and was extremely convenient. The only negative was that I could hear the people in the next room talking and coughing so that wasn't desirable. I'm thankful that's all I heard! I would certainly stay here again. They have a wonderful lounge on the 27th floor where you can watch the sunset over the mountains.", "user": "TravelqueenieLodi_CA", "date": "October 29, 2007", "id": 10426231}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband and I stayed here for a very brief 3 day visit to Colorado. We were celebrating our anniversary and let the staff know. They put us on the 31st floor with a premium view of the mountains, and a bottle of champagne was waiting for us! Everyone was was very nice and willing to help. We ate at The Capital Grille, which was the best food I have ever had in my life. Thank you to everyone at this location for such a memorable stay. Next time we're in Denver we will no doubt be staying here. I know this is going to sound weird but we are planning to redo our bathroom, and we loved the way the restrooms on the first floor in the lobby were designed. If anyone wanted to take a picture and post it just so I had a visual refrence I would be forever greatful! The whole hotel is flawlessly decorated.", "title": "Great Stay!", "helpfulness": 1, "user": "StLouisBreazer", "date": "October 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10267656, "likes": {"liked": "— The view and the gorgeous hotel.", "disliked": "— Parking, Charge for internet, not very many breakfast places."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "This stay was very average for the Hyatt. The checking-in process was amazingly easy (all online); however, there was a line almost to the door during the busy times in the afternoon. Obviously, there are some staffing issues that need to be addressed. The hotel is very busy during my stay; there were at least three other meetings besides my own.", "title": "Could have been cleaner, nice location for convention", "helpfulness": 1, "user": "Courtesy_Flush", "date": "October 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 10190886}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled on business", "text": "Room service was quick and friendly, but I have to agree with the other reviewers who state the food is awful. I ate other food provided by the hotel during my meeting and found it to be equally mediocre. On the plus side, the coffee shop does a wonderful latte, and the staff there was excellent.", "title": "great hotel with great service", "helpfulness": 2, "user": "bklynguy", "date": "October 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 10082663}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My room needed a new shower curtain (many rust stains) and the shower vent needed a thorough cleaning (caked with dust). I requested this be done after the first night, but it was never done. We also had to request for tolietries to be replaced which is a huge pet peeve of mine. Why is this so hard for housekeeping staff to do especially when there is a $5 tip sitting next to the empty bottles?", "title": "One of best!", "user": "cchri1p", "date": "October 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10074999, "likes": {"liked": "— Room decor, location, lobby layout", "disliked": "— Fee for internet, no free parking in area"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Great hotel in a convenient location. Stayed here for 3 days on an internet special and had a great time in Denver. The staff were helpful, the restaurant was fine, the room service was OK, housekeeping were helpful and prompt with requests. Unfortunately the pool was closed for maintenance and was then overtaken by the many teenagers staying at the hotel. The hot tub however was great. The Altitude bar was also closed for functions during our stay, which was a shame, since the lobby bar had too much like a sports bar.", "title": "Denver special", "user": "Sydneysider3", "date": "December 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 51774755}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "We had a room on a higher floor which had good district views to the Rockies and was away from the many teenagers who were attending a state Drama comp. The hotel is just around the corner from the main mall which had a free shuttle, vital in the C-14 degree cold and was close to a great deli, Cook's Fresh Market, offering backed goods, salads, soup, lunch and dinner meals, eat in and take away.", "title": "Very Good Hotel in Denver", "user": "ZP83", "date": "December 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 51336596}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I would stay here again, especially with a special rate.", "title": "If you enjoy sleeping in a real bed, avoid this hotel", "helpfulness": 1, "user": "dollink", "date": "December 12, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 2.0, "service": 2.0, "rooms": 1.0}, "id": 51132524}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The first time I ever came to Denver, I stayed at this hotel because I heard about the 16th street mall and how much fun it can be at night time. I was meeting up with some friends of mine for a little fun. I stayed here for four nights and I can say the room I stayed in was excellent and if you can request a corner room because they have the best views especially on the higher floors. The Hyatt really tried hard with this property and did a good job in the design. My only complain was the sheets were a little rough but I guess minor details. The hotel concierge really gave me some good ideas on where to eat and what to do for night life. I ended up staying here again later in november and then in 2008 in april. If you can catch this hotel for a decent rate I would recommend it. However, the only drawbacks are the massive groups that are always coming through here so it is not always quiet however, the rooms are. The rooms are what I believe makes this hotel. Modern, clean, spacious, and simple. This is probably one of the better hotels in Denver. One other note is the top floor maybe one of the best places to go for a drink because it has a spectacular view of the skyline of Denver. I would strongly recommend that anyone who stays at this hotel gets a drink at sunset. It is quite an experience.", "title": "Great Hotel in Denver Downtown", "user": "luigi80", "date": "December 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50955098}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "We booked our room a couple months in advance, yet we arrived to an overbooked hotel and gave us a room with a MURPHY BED. Literally. The bed pulls out of the wall and is essentially a poor quality mattress on a hideous vinyl platform. So much for the \"Hyatt Dream Bed\".", "title": "A True Top-Notch Hotel", "user": "TravelerKC", "date": "December 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50601734}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We were extremely pleased with the Hyatt. The staff was so pleasant and accomodating and the location can't be beat. As previously mentioned you can walk to many good restaurants. The trolley which runs down 16th street runs every five minutes and is free. We took it to Coors stadium for a Rockies game with no hassle.", "title": "Excellent Hotel", "user": "hollywoodChicago", "date": "May 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64920424}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "Recommend a cocktail in the Peaks lounge on the 27th floor for a great view.", "title": "One block from 16th street", "user": "vacationlady1", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 64743494}, {"rating": 5.0, "title": "Very nice hotel with excellent staff", "text": "This hotel is a very nice hotel with attention to detail. I stayed on the 30th floor and had to take a special elevator (second set of elevators) to get to my room. The lobby is huge, with lots of seating. The room is spacious with a flat screen tv, work station, and chair. Granite counter tops in the bathroom with plenty of room to spread out. You have to pay for internet even in the business center. Which was very expensive. When you are on business travel, internet is a must. You can print your boarding pass. The gym was available 24 hours and has the nicest gym that I have seen. You can walk to plenty of places to eat from this hotel.", "helpfulness": 1, "user": "MaloneV", "date": "April 27, 2010", "id": 62589398}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I was very pleasantly surprised by this giant chain hotel. They have added local flavor in their decor, such as the GORGEOUS light fixtures in all of the main areas and large ballrooms and the fantastic rock climber sculpture in the lobby. The lobby bar is open and bright and a natural gathering space. I never had a chance to go up to the Altitude bar/restaurant, but a local friend told me that the view is fantastic. The hotel gym was the best I have experienced, open 24 hours with lots of natural light, the person that designed the gym is clearly a pro. They had every free weight, band, kettle ball, and machine one could want, plus a pool and hot tub. I would stay here again any time for the gym alone! The staff in every part of the hotel is at your service and super helpful and polite. They really go out of their way to ensure you have a good stay. They also had recycling bins in the hotel room, which is a huge plus for me. Normally I am a boutique hotel traveler, so giving this hotel 5 stars is a great surprise!", "title": "Beautiful hotel, could be even better", "helpfulness": 3, "user": "GetTheBestForLess", "date": "April 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 62482642}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "My husband and I stayed at this hotel while he attended a work conference at the Convention Center next door. The location couldn't be better, and the hotel is gorgeous and contemporary. The elevators are quick and effecient, and have this cool tv screen in them that runs video of calming nature scenes, complete with sound (like the dusk pond scene with crickets). Everytime you got on the elevator, there was a different scene, very unique concept that I think I miss! 24 complimentary fitness center was good. Our room was quiet and it was nice in such a tall building to have a window you could crack open for some fresh air. They do have a nice feature in the lobby by the concierge, where there are pcs and printers allowing you to check-in for your flight and print out your boarding pass.", "title": "Nice and roomy, could have used a fridge", "user": "ztagirl", "date": "April 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 62240954}], "location": {"country": "United States", "city": "Denver"}, "stars": 4, "variance": {"poor": 27, "average": 72, "very good": 377, "terrible": 13, "excellent": 596}, "aka": "Hyatt Regency Denver At Colorado Hotel Denver", "slim_ranking": 0.0965517241379, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}