{"user_rating": 4.0, "review_count": 483, "name": "Hyatt Pinon Pointe", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We had a wonderful stay in a one bedroom unit at the Hyatt Pinon Pointe. The staff at the hotel was excellent and anxious to please. The unit was spacious with a very comfortable king-sized bed, terrific water pressure in the shower, a magnificent view of the mountains, and plenty of room to spread out in the living room area and kitchen. The pool area was nice and the exercise facility was amazing. Although there are no restaurants in the hotel as it is actually a time-share condo property, the adjacent mall in the Pinon Pointe shops had a Starbucks, Cold Stone Creamery, a delicious Continental restaurant with live evening music and best of all the Wildflower Cafe for the BEST breakfasts, lunches, light dinners, and snacks. As well as this being a wonderful property, the location cannot be beat. It is walking distance to just about everything. We were required to listen to a presentation on the property but the people were kind, informative and not too pushy. If we were skiers or hikers, this would be an amazing property to invest in.", "title": "Perfect Place", "helpfulness": 5, "user": "mebc", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7708283, "likes": {"liked": "— Location", "disliked": "— No Daily Maid Service"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We stayed here on a timeshare offer and upgraded to a 1 bedrm because the reviews of the studios were bad. The 1 bedrm was really great - we especially loved the very large, fully enclosed private patio, giant jetted tub, and the large kitchen table. The living room is a bit on the small side especially if you're staying with 4 adults but it was perfect for 2 adults and 1 child. You can see the red rocks right from your room and it's a perfect walk to main street sedona shopping. The activity center is great too, especially to check out board games or playing cards if you've forgotten them. All in all, it was a perfect vacation getaway for my husband and I and our little toddler. (they provided high chairs and a pack and play)", "title": "Great Location, Beautiful Resort", "helpfulness": 3, "user": "AZLovetoTravel", "date": "May 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7697232, "likes": {"liked": "— Location", "disliked": "— Parking is sometimes crowded"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "I am a Hyatt Timeshare owner in Key West and this was our first trip to Sedona. As usual the Hyatt did not disappoint. We stayed in a 1-BR unit which included a huge bathroom with seperate shower and jacuzzi, full kitchen with dishwasher and all appliances, pots, pans, and silverware you could need, a lovely dining table, and a comfortable living room with fireplace, DVD, and stereo. Other amenities included a washer/dryer in the unit, and a lovely deck overlooking the pool area and the red rocks beyond.", "title": "Loved the Hyatt Pinon Pointe", "helpfulness": 4, "user": "stoverny", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7683223, "likes": {"liked": "— Beautiful rooms, ideal location", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The units are spacious and tastefully decorated. The location can't be beat - the Hyatt is right smack at the \"Y\", which is the main intersection in the center of town. From there it was a short stroll to the shops of uptown Sedona, the Tlaquepaque shopping center, and many restaurants. The Shops at Pinon Pointe is a small shopping area right next door to the resort, and includes a Starbucks, Coldstone Creamery, and the very nice (and tasty) Wildflower Bread Company.", "title": "Hyatt Pinon Pointe WOW", "helpfulness": 3, "user": "beaniejug", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7288978, "likes": {"liked": "— Sedona is well worth a vist.", "disliked": "— We had to wait for a ethernet cable for our laptop, but they delivered it the next day."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The pool area is a highlight - it is the highest elevation on the property and offers great views of the stunning red rocks on all sides. There's 2 nice hot tubs on the pool deck, and a stand where you can get towels. There's also an adjacent workout room and clubhouse with a big-screen tv and a pool table.", "title": "Loved it", "helpfulness": 1, "user": "jdWisconsin", "date": "January 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6570361, "likes": {"liked": "— The views"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We arrived late,checked in and were given a flashlight to help us find our room. We were unable to so we had to wait for someone to come & to direct us. There was noone to help us with our bags. Our room was down 22 stairs. We were told before check in our suite would be up 5 steps with a beautiful view of Sedona mountains. The studio suite is not a suite. The kitchen(no stove) bed and sofa all are in one room. There is no decoration on the wall. The bathroom is not great. The sheets on the bed were old and scrachy. In the morning we heard our next door neighbors loudly calling each other names. I went to the desk first thing in the morning. They allowed me a refund on our prepaid week. I was thrilled to get away with only paying for one night. We looked for another place to stay. The Hilton at the other end of town was fabulous. We had a suite, with a working fireplace, living room with pull out couch, kitchen area and a great bathroom and shower. The service was great, pool and spa extra special. All for $10 more.", "title": "Terrible", "helpfulness": 5, "user": "sunsurfandsand", "date": "September 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 8700820, "likes": {"liked": "— nothing", "disliked": "— sheets"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "The AC kept shutting off all night even though I set it at 72 and the bed was the most uncomfortable thing I have ever slept on in my life. The sheets also felt like they were out of the package and never washed. We kept waking up every 30 mins because it was that unpleasant.", "title": "Horrible experience", "helpfulness": 3, "user": "cjensen1972", "date": "August 21, 2007", "detail_rating": {"rooms": 1.0, "value": 1.0}, "id": 8464806}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We are a couple from Switzerland.", "title": "Great 1 bed apartment in a beautiful town", "helpfulness": 1, "user": "KCS", "date": "August 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8405826, "likes": {"liked": "— spacious apartment"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We turned up on a Saturday afternoon, with no reservations (the cheapest we had seen on the web was some grotty motel around 70 USD a night) and got a one bed apartment for two nights at about 65USD a night - the price being a timeshare talk", "title": "Nice stay at the Hyatt Pinon Pointe", "helpfulness": 3, "user": "hossmama", "date": "July 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8183649, "likes": {"liked": "— Two bedroom unit - lots of room!", "disliked": "— Noise from parking lot"}}, {"rating": 5.0, "title": "great time in red rock", "text": "The timeshare meeting was actually no problem. No hard sell at all and no longer than 90 mins.", "helpfulness": 1, "user": "huntducks", "date": "July 16, 2007", "id": 8129764}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "After reading some of the less-than-great comments I felt a need to put in my A+ for this resort. Full disclosure: yes, I am a timeshare owner with Hyatt, though not at this location. We couldnt have been more thrilled with our accommodations. After reading noise complaints, we requested, in advance, an upstairs units, and one with a view. It paid off, we had a lovely one bedroom w/ spa tub, views of red rocks on TWO sides of our unit, with a lovely terrace , also with two exposures, and a view of the pool (which could have been noisy but wasn't, this isn't a kid-oriented resort. thankfully...). The kitchen was well stocked, we had all our breakfasts and lunches 'in,' and even a dinner or two. The location is perfect, right at the center of town but also right on the main drag for excursions to the red rocks, Jerome and other area sites. We were ready to book our stay for next year by the time we left. The staff was unfailingly pleasant and helpful when asked, without being pushy or snooty -- just the right balance. I did look at some units and think \"I'm glad we're not 'there'\", so maybe it's partly luck of the draw. But we were 100 percent satisfied.", "title": "THE IDEAL CHOICE, AT LEAST FOR US", "helpfulness": 16, "user": "bklynbiker", "date": "August 12, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5603506, "likes": {"liked": "— the unit and views", "disliked": "— nothing comes to mind. maybe the pool could have been bigger?"}}, {"rating": 5.0, "title": "Great place.....Hyatt great value", "text": "My wife and stayed on 2nf floor. Everything was first class. Pool views are the best in Sedona. We checked out alot of places in Sedona and they have NO view and limited availability. This is the place we will come back to!!!", "helpfulness": 10, "user": "traveling tommy d", "date": "July 16, 2006", "id": 5471628}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We had an opportunity to stay two nights inexpensively for a timeshare presentation. After reading all the poor reviews on the studio suites (which I knew we were staying in), when we arrived I asked to upgrade to a 1 bedroom. For just a few more bucks a night, they upgraded us to a one bedroom on the main level. It was great! King bed, jacuzzi tub in room, full shower, double sink, kitchen, living area, two tv's. And the beautiful scenary you can't beat. If you don't mind what type of room you have a studio would be fine, but we loved the room. I did however not like the late check-in early check-out rules, but all in all beautiful room and great stay in beautiful Sedona.", "title": "Loved the stay...", "helpfulness": 3, "user": "misskc94", "date": "January 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6540880}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "My husband, son (9), and I stayed three nights in a studio Oct 5-8. I read all of the reviews and understood that the studio was small. Yes it is—no doubt about it. However for us and what we needed it was workable. We had a small airbed with us so we did not need to use the sofa bed and that gave us extra space. Our room was very quiet and we did not hear any noise. The pool was small, the hot tub was good. The workout room and clubhouse was great. They had a large screen television, games to play with your children and a nice fire pit where we made smores on night. We were looking for a family weekend to spend quality time and that is what we got. Everything in Sedona closes early and the hotel was no exception. While it was sold out, we hardly saw anyone! If you are looking for nonstop action this is not the place for you. But if you will be seeing the sights in Sedona and need a place to go, it was in a great location. You can walk to Wildflower bread company, Starbucks, and the shops in uptown. Location can’t be beat.", "title": "Enjoyed the stay, but understand what you get", "helpfulness": 6, "user": "leslieinphoenix", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5966293, "likes": {"liked": "— location", "disliked": "— quiet hotel, not much to do"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "On the negative side, they give you Starbucks coffee for the first day but want to charge you $2 a day for it. I said no way that on my reservation it said coffee and I was not going to pay that. There is a microwave, plates, etc, and a small fridge to hold a small amount of drinks and snacks. Bathroom was nice and patio was great. Free internet access if you have a laptop. If you are looking for a clean, pretty place to stay for a quiet weekend this was nice. Just make sure you know what you want.", "title": "Don't stay in a studio suite!", "helpfulness": 1, "user": "Love_Sedona", "date": "September 27, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 5881253, "likes": {"liked": "— location", "disliked": "— noise from adjacent suite"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "For the rate we paid to rent a studio suite, we had expected much more - especially for the Hyatt. The room was not much larger than a ship cabin. The bathroom was nice, as others have commented, but did not make up for the small space. BUT the worst was the NOISE from the adjoining suite. We heard them coming and going as if it was in our room. Kids were running in and out, and we could hear their conversations in the bathroom. We will never stay at this resort again.", "title": "Excellent resort!", "helpfulness": 10, "user": "vaznayak", "date": "September 12, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5795124, "likes": {"liked": "— The Views"}}, {"rating": 5.0, "title": "Loved it!!", "text": "We visited this resort for 3 nights on a timeshare visit. We've stayed at a lot of top resorts around the world, and this is most excellent. The location is central, and yet private enough. The rooms are spacious and well appointed, and the views breathtaking. The one downside is that the activities are on the 'limited' side for a top notch resort - though I guess that's what you get when you're at a relatively small resort compared to some larger ones like the Marriotts, etc.", "helpfulness": 11, "user": "jeez", "date": "August 29, 2006", "id": 5725608}], "location": {"country": "United States", "city": "Sedona"}, "stars": 3.5, "variance": {"poor": 29, "average": 41, "very good": 145, "terrible": 16, "excellent": 252}, "aka": "Hyatt Pinon Pointe Hotel Sedona", "slim_ranking": 0.4, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}}