{"user_rating": 4.0, "review_count": 591, "name": "Hyatt Regency Jacksonville Riverfront", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I had a very pleasant business stay at the Hyatt Riverfront. The room was very clean (when plugging in a charger I noticed how dust free even the lamps were). There were plenty of elevators were fast and never a wait for one. There is an Einstein Bros. Bagel shop on the outside of the hotel for quick breakfasts. The only gripe that I have with this hotel is that they while the offer free Wi-Fi in the lobby, there is an about $15 daily fee to access from your room. Considering what the room rates are, I think this is a rip-off.", "title": "Liked the hotel but want free Wi-Fi in the room", "user": "Steeler_Pens_fan", "date": "November 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186173979}, {"rating": 4.0, "title": "Solid experience", "text": "Good front desk service; rooms are both comfortable and quiet, very good job of cleaning room; nice to be able to walk across the street and be able to stroll along the river...nice restaurants a short walk away. The conference area is convenient and nicely maintained", "user": "ProfTraveler58", "date": "November 27, 2013", "id": 186110746}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "My husband and I love this hotel. We always stop in Jacksonville on our way to South Florida and try to stay at the Hyatt whenever possible. The river views are stunning, and the hotel windows open so you can have the feel of having a balcony. The A/C does turn off when you open the windows, but if the weather permits, the open air feel is worth it! There are several restaurants nearby at Jacksonville Landing, so you can park your car and walk to dinner or shopping. There is a paved path along the river perfect for a walk or run, and you can traverse the Alsop bridge to get views from the other side of the river. Although we've never been to a Jags game, the stadium is close and you can take the water taxi to get there. The only negative I can think of is that there is no free wifi in the hotel rooms. There is free (slow) wifi in the lobby. The employees are professional and kind. We always have a great experience here.", "title": "After multiple stays, still not disappointed! Great hotel!", "user": "Amanda F", "date": "November 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186066600}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This hotel had some wonderful features, including the extremely inviting roof top pool and hot tub, very large conference rooms, conference rooms that are well kept with beautiful chandeliers, plenty of in-house restaurants, and a nice location to the river and the landing.", "title": "Up and Coming Area, but way over-priced for what it is right now", "user": "Zinsman33", "date": "November 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 185912651}, {"rating": 4.0, "title": "Nice location, decent hotel, rooms need updating ", "text": "Overall, the staff was very professional and very friendly. The front staff and concierge need to better understand what transportation is available at the hotel. As I had booked a hotel recommended company to transport me from the airport to the hotel, I spoke with two employees who had never heard of the company I booked with, while trying to arrange a later transport after landing late. I was present for the housekeeping to clean the room on two occasions and I was very impressed on their efficient detail and kindness to ask if I needed anything else. Many staff in the halls asked if I needed assistance on several occasions. Although the front desk staff was very kind and patient, I experienced mistakes on more than one occasion, and had a lot of trouble understanding their explanations due to accent and grammar. I was definitely not happy with their practice of charging my credit card. I have never had a hotel debit my card one time per day for each night. I have had either full amounts at the beginning of my stay or at the end; and typically it has always been at the end of the stay. While this is fine for non-business, this becomes quite the pain, when I have to budget food expenses, hotel stay, travel etc. I am waiting for the authorizations to post, as they accidentally over-charged me. I called the hotel, and they assured me it would be fixed. If not I'll have to go through the fun of calling my bank.", "user": "Blueteej1997", "date": "November 21, 2013", "id": 185414183}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Here for a work conference so didn't get a choice of hotel. Great views and clean rooms. Bathrooms could use some updating and our faucet leaked Not much to do downtown however so taking a cab was pricey to see things. I did use the trolley at the Jacksonville Landing (which was disappointing) to Five points but it only runs 10:30-2:30. Staff was very nice and helpful but if we were to return for fun we choose something closer to the beach.", "title": "Friendly staff", "user": "TaMike87", "date": "November 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 185324347}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I booked one night about one month in advance. Within a week of my arrival I received an email inviting me to check in online. I thought wow, just like the airlines. I assumed it would get me in an express situation where I walk in and get my room key. So I did it indicating (because they asked) that I'd be there about 5pm.", "title": "Hurry up and wait!", "user": "CrosaRoadWarrior", "date": "November 19, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 185237148}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "I arrived at 7pm (tired after a 4 hour drive) and the front desk clerk (who was very nice) said she had to call housekeeping to see if my room was ready. No answer. She called within a few minutes and someone told her they'd go check to see if my room was ready. I was somewhat surprised and thought that was unusual. About 10 minutes later she apologized and said she'd call again and apparently was told they hadn't checked yet or basically, that the room wasn't ready. Meanwhile, another guy walks in after me and they check him in and give him his room key and he goes up.", "title": "Nice hotel, nice location, not sure about value", "user": "cagalindo", "date": "November 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 185144127}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I asked for a supervisor and she came but explained that because my conference was a special block of rooms they had to be sure it was ready. That made no sense to me. Everyone there (who was checking in) was attending a conference. Finally about 20 minutes after I arrived, the supervisor said \"we'll just find you another room with a single king bed; it was because you requested a king bed.\"", "title": "Non-Smoking Rooms on a Smoking floor, not OK.", "user": "Jessica P", "date": "November 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 185097495}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I was happy she found another room, but what was the point of my online check in? I was incredulous. I asked for late check out which they gladly affirmed. But then my door was knocked on at 8:35 a.m. by housekeeping. I didn't answer the door. They came back at about 10:15 and I yelled to them that I had late checkout. They said \"oh, ok.\"", "title": "reliable", "user": "etalius", "date": "November 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 184972837}, {"rating": 3.0, "title": "$4 bottle water, really?", "text": "My room was quiet and comfortable. The hotel is nice and has a nice setting by the river. The lobby offered lemonade in the afternoon which was a nice touch. So I don't get the nickel and dime mentality. The last hotel I was in earlier in the week had free bottled water in the room. And watch out for those room service charges, outrageous!", "user": "Ty B", "date": "November 14, 2013", "id": 184704797}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Recently stayed at the Hyatt Regency Riverfront for a business conference and I can’t say this is what I expect from this class of hotel. Very friendly prompt check-in. Rooms are comfortable but nothing special. No fridge or microwave, no office chair at desk (of course extra charge for HS internet; I brought my own Mi-Fi so I can’t comment on speed or quality of the hotel HS). Amazing to me that there was only a very basic selection of TV channels and there was no HD. Please, you get HD channels at most Hampton or Fairfield Inns and they can’t swing it at a Hyatt Regency? I tried to get hot water at 5PM, and after literally running water for 20 minutes barely luke-warm was all I could get. (This wastes a LOT of water by the way). Hotel restaurants were expensive, no breakfast places within easy walking distance. There are a number of restaurants 2-3 blocks away in the Jacksonville Landing area on the river for lunch or dinner. Get a block off of the waterfront and you have an uncomfortable very empty downtown with panhandlers on nearly every block. No wonder this hotel is so far down in the rankings.", "title": "Hyatt Regency pretty ordinary", "user": "30-StateTraveler", "date": "November 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 184428491}, {"rating": 2.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Stayed for several days while attending a professional conference. I called for a reservation the day after the announced date to begin making reservations, only to be told that all allotted rooms were filled. I asked just how many rooms were set aside for the conference (which registered more than 400 attendees); the lady on the phone refused to provide the information, or any information other than that I would have to pay more than $200 a night to stay in the hotel.", "title": "You can do much better", "user": "sfbinms", "date": "November 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 184419396}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "I realize that some places now charge such extortionate amounts, but I would imagine that for this sort of money the room would be fairly nice. Not even slightly. Beds (two queens -- I had requested a king) were old and worn out. There was no side chair or easy chair in the room at all -- just an office chair at a work desk. No refrigerator or mini-bar of any sort. Water temperature in the shower varied widely without warning; easy to be scalded and/or frozen.", "title": "empty downtown with great view and location", "user": "sgluck1", "date": "November 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184297331}, {"rating": 5.0, "title": "Hyatt Jacksonville", "text": "$15 per night for self parking, on top of the room rates? Inexcusable. Think you'll get free wireless service for such a pricey package? Think again! Upon check-in I asked for a room on the river side; receptionist told me that there is usually an additional fee of $35/night for those rooms, but that she could cut me a deal and let me have it for only $15/night. Lovely. So while I was waiting for my key, the person ten feet away from me requested a room away from the river. Receptionist told him that there was normally a $25/night fee for those rooms, but he could get it for $15/night.", "user": "Paula L", "date": "November 9, 2013", "id": 184200685}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "This hotel had cozy, clean rooms, speedy elevators, and a nice location (though walking as a female alone at night wasn't recommended, there were several transients out and about on the riverfront). I was here for a conference, and goodness did they accommodate for us! The hotel staff, from the valet to room service, front desk to hotel manager, were ALL above and beyond. Incredibly warm and wecloming, I've never experienced people who seem to enjoy their place of employment so much.", "title": "Best hotel staff!", "user": "914RachelH914", "date": "November 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 184199354}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "That being said, it wasn't for the incredible staff, this review would have been knocked down a notch. There are signs on each floor that point to a soda machine- majority of which do not actually have a machine. This is frustrating when you are staying high up, and go floor by floor, only to find a machine that is not even working... The internet is some of the slowest I have ever experienced since the good ol' days of AOL dial-up, so getting work done was not much of an option. The eating options are fairly decent, but you're over it after a day. All three on-site places use the same menu, even the sports bar and the \"nice\" restaurant. Disappointing... But at least the Landing is close by with plenty of options. The pool is beautiful on the roof with a great view, but the hot tub did not have fully functioning jets, and goodness are they strict about kicking you out at closing time!", "title": "Typical Hyatt", "user": "statestreet75", "date": "November 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 184112245}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Clean room, moderate price, near the waterfront - nothing to complain about. Not outstanding in any way but what one would expect from this non-exotic location.", "title": "Very Good Hotel in an Empty Downtown", "user": "Allen W", "date": "November 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 183694464}, {"rating": 4.0, "title": "Outstanding customer service", "text": "Great buffet breakfast highly recommended. Bar scene is so-so.", "user": "Gregory C", "date": "November 3, 2013", "id": 183394744}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Very large, clean and well maintained hotel. Unfortunately, all the good restaurants were across the river. Fortunately the in-house restaurants were very good as was room service. Club Room was excellent with very reasonable drink prices and a nice breakfast selection, but no hot food. The corner Queen Executive room I used for three days was spacious with a good workstation and a sofa. However, not enough outlets and no in-room safe. Meeting room space was extensive with very good and very responsive service.", "title": "On the river!", "user": "Joanie M", "date": "November 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 183304219}], "location": {"country": "United States", "city": "Jacksonville"}, "stars": 3.5, "variance": {"poor": 36, "average": 126, "very good": 232, "terrible": 28, "excellent": 169}, "aka": "Hyatt Regency Jacksonville Riverfront Hotel", "slim_ranking": 0.348484848485, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Experience the essence of the lifestyle and landscape of the real Florida at our Hyatt Regency Jacksonville Riverfront hotel. Set along the St. Johns River within the heart of the city’s business, entertainment and sports districts, our outstanding downtown Jacksonville hotel is adjacent to the Jacksonville Landing, a hotspot for dining & entertainment, and within minutes of famous white sand beaches, championship golf courses, EverBank Field, water sports, museums and arts venues."}