{"user_rating": 4.0, "review_count": 805, "name": "Hyatt Regency Philadelphia at Penn's Landing", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "Booked one night at this hotel via Priceline and called the Hyatt 2 weeks and also two days before my arrival to note room preferences. Upon arrival at 5pm, the front desk attendant rudely noted that she didnt see any record of my calls (or preferences) and also said that we may have to wait \" a few minutes or many hours\". We hoped it would be more like a few minutes since we were headed for a 8pm show in Atlantic City. Room was ready about an hour later. Overall rooms are clean and modern, but service at this hotel is less than stellar - the front desk attendant had no trouble raising her voice in irritation during our check in. If you get a good deal for this hotel (less than $100) then I would say go for it - otherwise, save the money (and frustration) and stay somewhere else.", "title": "Just ok", "user": "travelgrrlusa", "date": "June 1, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 16580295}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I depend on Tripadvisor every time I am going to travel. The reviews are very important to me. So I also like to share my travels as well.", "title": "Some small glitches", "user": "glowwings", "date": "May 27, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 16433699, "likes": {"liked": "— The view from the 18th floor room.", "disliked": "— The first night on the sixth floor."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My son and I were going to a concert at Penn's Landing in Philadelphia this past Memorial Day weekend. We picked the Hyatt because of its close proximity to the Great Plaza where the concert was to be held. We traveled by train from Wilmington and took a cab to the hotel from the 30th Street train station in Phili.", "title": "loved it!", "user": "anon03", "date": "May 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16295102, "likes": {"liked": "— pool scene", "disliked": "— traffic noise from Columbus drive"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled solo", "text": "The hotel is very far from most of the Philadelphia historical sites, but there is a wonderful double decker tour bus service that runs all over the historical area. Once you purchase tickets on the bus, you are free to hop off at any site and pick up the next bus. It was a great service.", "title": "nice place to stay", "user": "ManhattanMonkey", "date": "May 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15884507, "likes": {"liked": "— clean, comfortable room"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel room that we were first given was 602. The hotel is around 20 stories. They advertise a Delaware river or city view from the room. Well, the sixth floor view was looking out on six lanes of traffic over route 95, and also a lovely view of the roof of the restaraunt, complete with many high power fans running.", "title": "Doesn't live up to the hype", "user": "08dctraveler", "date": "May 5, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 15656643}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I rarely write a 5* review - and was hesitant to book this place based on some of the negative TripAdvisor reviews - but this place does everything right. The TripAdvisor reviewers who rate this poorly have it dead wrong. The reason we booked was Hyatt's unbeatable \"Free Night\" promotion, but we were seriously considering booking extra nights regardless of any promotion.", "title": "Everything Right", "helpfulness": 1, "user": "withliberty", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133404119}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Great points:", "title": "Excellent Customer Service and Clean!", "helpfulness": 1, "user": "WhiteGloveUser", "date": "July 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133315271}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "*Location - steps from the water, easy walk to a lot of great restaurants and reasonable walk to the historical sites (better than from Center City/Convention Center locations)", "title": "Very Nice Hotel in Philly", "helpfulness": 1, "user": "Scott077", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133190380}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "*Each concierge took extra steps to try to get to know every customer we saw.", "title": "Good and Bad", "helpfulness": 1, "user": "JimWPPA", "date": "June 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 133138084}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "*Happy Hour special included $2 microbrew drafts and outstanding food values.", "title": "A view with comfort!", "helpfulness": 1, "user": "AnaBaile", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133059256}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Wonderful water view, even from the bathroom!!!! The room was beautiful!!! Modern, bed comfy.I got lost on an executive floor looking for ice and this nice lady, walked me back to my floor just to show me the ice machine, when I mentioned it was my 22nd anniversery, lo and behold, strawberries and bottled water mysteriously appeared in our room. Front desk clerk, klihiia, was so nice and professional from the start, beautiful personality and so helpful. Lawrence Gordon the door man, is so helpful and freindly and we got a second set of strawberries, we think from Lawrence. THANK YOU!!!! Also, I forgot thAT I had requested robe and slippers. The hotel rememberd!!! and sent them them up.The concierge was professional and helped my husband get back in our room after we left our nook. The one complaint I have is housekeeping, the maid was not friendly, and used dirty towels to wipe up the bathroom floor. She was actually on her knees doing that. yuck!! Also for this caliber of a hotel, there should not be dust that you can see on the furniture. Now the pool, ok so I am excited to go to the pool, It did not have the chemical up keep it needed. I did not put my head under water, because the pool was not clean. It really needs more attention. Service is above and beyond, I never heard NO, for any of my requests, and that felt great on our SPECIAL DAY Other then that I will be back again and again. Thank you Hyatt!!!!!", "title": "22nd wedding anniversery. Treated like Royalty", "helpfulness": 2, "user": "RachelWilmington", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132255664}, {"rating": 5.0, "title": "Great hotel", "text": "Everything great. Beautiful room. Inexpensive restaurant. Cool that the safe had a place for charging devices. Not a complaint, but if they really wanted to find something to fix, put a towel rack in the shower area to store towels like most hotels.", "helpfulness": 1, "user": "Juandf023", "date": "June 18, 2012", "id": 132249450}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "great part of Philly with historic sites in walking distance. Perfect place for a business meeting", "title": "great location", "helpfulness": 1, "user": "peterdcpa", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132222579}, {"rating": 4.0, "title": "You Can See New Jersey From the Room", "text": "I attended a conference at this Hyatt in Philadelphia. The meeting space was very nice and the staff was able to flip an entire room in minutes. The layout for the space was perfect - not a lot of walking. The view of the river was very relaxing while we were waiting between sessions. The guest rooms were nice and clean. Overall it was a good stay.", "helpfulness": 1, "user": "Anthony C", "date": "June 17, 2012", "id": 132165460}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I stayed here over the memorial day weekend. It was a very nice hotel. The location was perfect, right on the river! Most of the attractions were within a 5-10 minute walk of the hotel. I really enjoyed the location, it was right outside the city, but close enough so you could go to all of the wonderful places. The room itself was standard for a Hyatt. Minimally decorated and clean. My room was right near the elevators overlooking the Ben Franklin Bridge. Surprisingly, the room was quiet, given its location to the elevator. The hotel restaurant was delicious and the seating overlooked the river. Our room rate included breakfast so we ate here every day. They offered a breakfast buffet or you could order from the menu. All of the food tasted fresh, but service was a little slow between 7-8am.", "title": "Nice Hotel, perfect location", "helpfulness": 1, "user": "Vw2410", "date": "June 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 131883778}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We stayed here 2 nights and through Hotwire got a great deal of $101 per night. The location was on the river, we had a great view, and we were able to walk, with strollers, all through olde city without a problem. The staff was helpful in giving us pointers on where to eat, what to do. We did order room service, the food was awful, but the town has awesome restaurants! The pool is indoors, which was great for my little ones cuz it was cold outside. Would definetly stay here again!", "title": "Loved it...Great deal on Hotwire", "user": "lsj001", "date": "June 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33014276}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "parking is $35 day & internet is $9.99 day.", "title": "Great Location, nice hotel!", "user": "iestokes", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 32884299}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I really enjoyed my stay at the Hyatt Regency. The rooms were very clean and comfortable and the hotel was very nice but the main reason I booked this hotel was for the location. We were going to a concert in Camden, NJ, which was just a short ferry ride away (the ferry terminal is directly behind the hotel). Also, a good sampling of Philadelphia restaurants and nightlife are just a short walk away from the hotel. We were also able to walk to Independence Hall and many of the other historic sites in about 10-15 minutes. I would definitely stay here again.", "title": "Nice, clean, convenient hotel on the water", "user": "SpencerLV", "date": "June 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 31594174}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The Hyatt is on the waterfront at Penn's Landing and is newer/newly renovated and more business and professional-oriented. Rooms seemed to be recently renovated with modern amenities, flatscreen tv's, and upgraded bathrooms. Although we were on the 16th floor, we noticed a lot of traffic noise and it would have been bothersome without earplugs (we had a corner king that faced both the water and I-95).", "title": "A+", "user": "MrWimbley", "date": "May 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30951578}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "The lobby area gets busy and has adequate seating, but is not recommended for relaxing after a long day - there is too much activity and on weekends, a lot of wedding guests going through. We did enjoy the bar in the evening and the restaurant for breakfasts. Food was hotel pricey but good. Internet access was fee based, including in the business center.", "title": "Great views, good rooms", "user": "heb999", "date": "May 10, 2009", "detail_rating": {"cleanliness": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 29691897}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for three nights on a pleasure trip, and got a bargain weekend rate which included free breakfast (three night minimum) and late checkout. The hotel is in a nice location on Penns Landing overlooking the Delaware River, and within a 5-10 minute walk from the historic area and the South Street restaurants and shops. Our standard King Room was what you'd expect from this luxury brand---good-sized, quiet, nice bedding, large flat screen TV, etc. The service level was well above average for a luxury downtown hotel, and all the staff made an attempt to be friendly. The breakfast buffet also exceeded our expectations, with a diverse selection which was more and better than what you normally see in hotel breakfast buffets. Parking was $25/night which is not too bad for Philadelphia. A real plus for this hotel is that it's easy to find and access on an in-and-out basis. You don't have to wind through the crowded city streets, and the parking lot is very large.", "title": "Good Location---Very Nice Hotel", "helpfulness": 1, "user": "lchjr", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131780931}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "With our bargain rate, the hotel was an exceptional value. Four star luxury for a 3-star price (when you take into account the free breakfast, which is a $40 daily value for two people). Without the bargain rate, prices still seem to be in line with other Philadelphia luxury brands. The easily accessible location right on the fringe of downtown is another major plus if you're driving.", "title": "Nice place but too expensive", "user": "Aerestran B", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 131738328}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The room was very nice and the staff extremely friendly. The pool was nice except for the groups of children that their \"adults\" refused to make behave properly and drove my wife and I away two nights of our stay. The bathroom had a heater unit mounted below the window that was putting out heat even on hot sunny days making any time in that room uncomfortable after a few minutes. Parking was outrageously priced. The restaurant in house had good food but the menu was very limited and the coffee shop closed late morning every day making you search to get a cup of coffee, which had been sitting in an urn and stale for a couple hours. Not a good thing when spending the day in and out of meetings.", "title": "Fine traditional expensive hotel- but not worth the price --", "helpfulness": 1, "user": "rgwright1", "date": "June 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131602607}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Had to leave the much nicer and more affordable Independent Hotel to stay here -- This is a typical overpriced hotel in a nice location but you need to have an expense account to afford its amenities. Nice views and clean rooms though.", "title": "Nice place, but not worth the price.", "helpfulness": 3, "user": "smm5628", "date": "June 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 131264037}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We recently stayed here on June 2nd-3rd in a river view room. The room was nice and the bed was very comfortable. The bathroom was stocked fully and only had one issue. One of the lights in the bathroom only worked some of the time. It would shut off and turn back on when it felt like it. Other than that, nothing stood out in a good or bad way.", "title": "Noticeable Improvement;Credit to the team!", "helpfulness": 3, "user": "alreadygone_there", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131260362}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The hotel was OK for a short stay, clean, reasonable walking distance to Old City attractions and restaurants and the blue line subway is OK for getting across town.", "title": "A good hotel but not a great value", "user": "HotelHopper3414", "date": "December 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 89444589}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Hotel is $40/night for self parking and a long haul from hotel with bags so use valet.", "title": "Very mediocre stay, but good meeting facilities", "user": "Shogan77", "date": "December 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 89373284}, {"rating": 1.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The dining room seemed disorganized at breakfast .", "title": "Loudest Stay Every", "user": "maschobs", "date": "December 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 89366558}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "No minibar (not even water!); fridge in room did not work (so could not keep purchased water cold); worst internet connection (both hard wire and wifi) I have ever used - extremely slow!!! Limited hotel services in public areas; very mediocre comfort/interiors; bland rooms; bathrooms in need of modernization. Out of way location. Would not come back.", "title": "Nice hotel good location but a little pricey", "helpfulness": 1, "user": "R-RYD", "date": "November 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86899207}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Facilities for corporate conference/biz meetings were good.", "title": "great views, great location", "helpfulness": 1, "user": "sherman220", "date": "November 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 86121898}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We booked this hotel through Priceline and were at first excited to see our results. Our room was on the 21st floor, breathtaking views and the rooms are decorated nicely; those were the only perks. There are a lot of suites on this floor so unfortunately if you stay there on a Saturday night and expect to get sleep, you are out of luck. My husband and I were awoken by loud voices and singing in the room next to ours, a Presidential Suite. It appeared there were afterparties going on. We called downstairs to reception twice and they said they were sending security up. The level of noise didn't go down until about an hour and a half later. In the morning, I said something to reception and instead of getting a simple apology, I was ignored. I would not stay at this hotel again nor would I recommend it to others.", "title": "Worst Night Sleep I've Ever Had", "helpfulness": 1, "user": "Rachel W", "date": "January 16, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 93237106}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Stayed here for two nights. Beautiful hotel with gorgeous views- our room had a view of both the city and river, overlooking navy shipyard. The rooms are clean and nicely decorated, and the common areas are equally nice and swanky. We did not park here and I'm glad we avoided the insane parking fees. It did feel like we were being nickle-and-dimed here. The downside of higher-end hotels like this is that everyone- from the moment you pull up to the front doors- has their hand out for a tip for extra services that you don't need. The front desk staff didn't seem all that interested in being friendly or going above and beyond; thankfully, we knew our way around the city already and didn't have a lot of questions.", "title": "Nice... but you could probably do better", "user": "tkother", "date": "January 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 92950264}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The hotel is not located in the middle of the action; it's about a 10-15 minute walk to Independance Hall and the like, and there's not a whole lot in the immediate area for breakfast if you don't want to use the hotel restaurant or room service. Mrs K's Koffee Shop, on Chestnut St, is a short walk and AWESOME for a quick, inexpensive, filling breakfast at a counter-service diner.", "title": "Very clean, modernized design. Professional staff", "user": "justrateit", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92340567}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Nice, because we were using points that made this stay much lower than rack-room rates, but you could probably do just as well for less money and find something a little more centrally-located.", "title": "A beautiful view of ships, downtown, and history- quite a value!", "user": "beenane", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 92331768}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We have only one night stay. Overall it was a pleasant stay. I was particularly impressed with its cleanliness and the modernized design throughout.", "title": "Great Place to Experience History and Family Fun", "user": "BVAFam", "date": "January 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91346475}, {"rating": 4.0, "stay_parameters": "Stayed June 2008", "text": "Stayed at this hotel for a wedding over the 4th of July weekend. The rooms were very nicely done with a large bathroom with granite countertops. We had a double room overlooking the river from the side. Rooms were very clean and all the bedding looked new and the beds were pillowtop and comfortable. We requested extra towels because there were four of us and they immediately sent up at least 4 extra sets within 20 min. Everyone was very accommodating at the front desk, concierge and in the restaurant. The only thing we had any complaint with was the breakfast buffet in Keatings restaurant. There was a large selection of breakfast items, but most of the hot food, eggs, pancakes, etc. were only luke warm. For the price of $17.95 + tax and tip the hot items should be hot. All in all though would stay again, as the hotel is within walking distance of Old City with Independence Hall, etc, South Street and many restaurants and pubs, along with being right on the waterfront.", "title": "Very nice stay for a large hotel over the busy july 4th weekend", "user": "clgamm", "date": "July 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17612956, "likes": {"liked": "— Location and cleanliness", "disliked": "— Breakfast buffet was luke warm"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "This hotel is very nice. From pulling up and having the very friendly bellman and valet assist, to help from the front desk, this is a very inviting hotel. It is right on the water, which is great, because you can catch a Ferry right in front that takes you across the water to a concert venue, where we happened to see Pearl Jam. People even brought their own beers on this ferry.", "title": "Great location, right on the water", "user": "joeybagz312", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 17197546, "likes": {"liked": "— The water view", "disliked": "— The food at the restaurant was OK- soup a bit undercooked and anchovies on salad (yuck). Mozzarella sticks were great though."}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled solo", "text": "It was very convenient.", "title": "Great repeat stay at Hyatt @Penn's Landing", "user": "Ms.Me2", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 2.0, "cleanliness": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17103893, "likes": {"liked": "— Location", "disliked": "— rack rate is overpriced for location!"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I loved the water view and being right within walking distance to food, shops, nightlife, and anything else we needed.", "title": "Fantastic Hotel! A+ and recommended although a bit out of the way...", "user": "cheunggo", "date": "June 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 3.0}, "id": 17064153}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "The room was very nicely appointed with a large bathroom.", "title": "Gorgeous view, great experience", "user": "DougCG", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16990451}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We also stayed here during the 4th of July weekend. It was incredibly busy, and yet the hotel staff managed to be extremely helpful and we never got the sense they were overwhelmed or understaffed. The rooms were a good size, clean, and tastefully decorated. The beds and bedding were superb. The hotel was in a good location- very touristy but safe and within walking distance of many of Philadelphia's historic sites.", "title": "Amazing, but pay close attention to the bill!", "user": "krebloggs", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 18084992, "likes": {"liked": "— The rooms and the BEDS", "disliked": "— Overpriced restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "It would have been a perfect stay if not for two things: the overpriced hotel restaurant (we later discovered there were many reasonable places nearby-go to South st!) and the unexpected charges that showed up on the bill when we checked out. While we were told that there would be some additional taxes and fees, our final bill was more than 50% more than the price we booked online and included charges for things we had not used, like valet parking (we had no car). However, when we discussed this with the management, they corrected the bill and all was well. So, as long as you are careful when you check out, it is likely you will have a fantastic time at the Hyatt Penn's Landing.", "title": "Nice Hotel expensive parking", "user": "mbrjmt", "date": "July 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 18078094, "likes": {"liked": "— Very clean nice views and room", "disliked": "— Parking prices and internet cost"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "This hotel is very nice the rooms are nicely decorated and clean the view from our room was great. My two complaints were that we had to pay $24.00 a day to park which we were unaware of until we arrived; we thought we would at least get a discounted rate or something for this reason next time we visit we will probably pick a different hotel. My one other complaint is that we had to pay to use the computers in the business room. We have stayed at many hotels and usually that is a free perk that is provided.", "title": "Good only for business meetings", "user": "frombaritomiami", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 18024577, "likes": {"liked": "— View from the hotel rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "This is a good business hotel with no frills and very little to remember, other than its good position on the water.", "title": "Best location in Philly!", "user": "caribAnn", "date": "July 9, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 17683325, "likes": {"liked": "— The location of the hotel", "disliked": "— expensive drinks"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The lobby is small and without any distinctive feature. Check-in was good and fast. The room is recently renovated, the only good thing was a comfortable bed. Upon entering there was a discarded piece of paper on the floor. The bath is medium-small and toiletries are basic. There is an empty minibar and wireless service in the room is not for free, actually is $10 per day. Just as well, the business center charges the use of the computers by the hour, minimun charge is $5 with printed pages $1 each. There is a large flat screen tv and an I-pod dock radio, however. There is no closet, storage space in the room is within the media cabinet; OK if you are a business traveller for a night, but barely so if you are travelling with family.", "title": "We love this hotel!", "user": "Grace99", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17670169, "likes": {"liked": "— Location", "disliked": "— Internet charge"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "As other reviews have stated, the outside of the hotel is a bit stale, but the location is wonderful, right along the waterfront. The rooms were clean, well decorated and had a beautiful view(I requested a higher up floor with riverview and we got it).", "title": "Nice Place", "user": "melissamccrink", "date": "August 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 19105972, "likes": {"liked": "— location, view", "disliked": "— parking costs"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Overall, we enjoyed the hotel, but found it to be a bit overpriced. We booked through priceline, so I enjoyed what I paid, but I would have been less satisfied had I paid full price. The cost of parking alone for 2 nights was equal 1/2 the cost of the room.", "title": "What a View for the Price", "user": "tigerfoods", "date": "August 17, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 19029224, "likes": {"liked": "— great Philly views", "disliked": "— location/parking"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "So, at a discounted price this hotel is great.", "title": "A great place to stay", "user": "gmari", "date": "August 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 18866871, "likes": {"liked": "— location, comfortable room and bed"}}, {"rating": 4.0, "title": "Solid, not spectacular", "text": "In the past, we have stayed in many hotels in the Downtown Philadelphia area and have to say the Hyatt was Excellent.", "user": "OilIsle", "date": "July 29, 2008", "id": 18400189}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "The room was very clean and spacious. We got an upgrade on the 10th floor with the view of the bridge and the water, no complaints whatsoever. Nice bedding, flat screen tv and overall the property is excellent. I also liked the large window and amount o light in bath.", "title": "Nice Hotel, Great Locatoin", "user": "acruiser", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18118867, "likes": {"liked": "— location to historical sites"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We spent a night in Philly as a last minute get-away. We bid on Priceline and got this hotel at a great rate. The room was very nicely decorated and a good size. The bed was comfortable. There's self parking around the back of the hotel. The pool and gym looked very nice, although we didn't use them. For breakfast, walk across the highway to Mrs's K's on Chestnut.", "title": "A very nice hotel for a quick visit", "user": "mfnyc", "date": "February 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 97729339}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "This hotel is beautiful! It is located right on the water in a great location. What stands out to me the most, the service! The staff were AMAZING! Every person we came in contact with was smiling and happy to assist us! The front desk agents were always working and had an approachable demeanor. They didn't hang around chit chatting when it was quiet (as you see in many places). The bell staff (not sure their official term) were so pleasant, friendly, not stiff and enjoyable. We needed a cab, they got it. We needed directions, they gave them (twice lol).", "title": "I haven't experienced such amazing service in a long time!", "user": "dragonfly570", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 97585910}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We forgot some VERY valuable items in our room. Although the shipping was steep ($27 for very small package) I was still impressed that EVERYTHING was recovered! Impeccable!", "title": "Did the job but expensive parking/internet", "user": "extremepitaman", "date": "February 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97471034}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The rooms smelled SO GOOD and were clean and modern. Same with the hotel. We ate dinner at the restaurant in the hotel and it was surprisingly affordable and you got plenty of food.", "title": "Great location, beautiful room and friendly staff.", "user": "MrsWolf984", "date": "February 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96779922}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I love this hotel! I was pleasantly surprised and would recommend it to anyone (and have) and would love to stay again!", "title": "Extremely average", "user": "nyesq72", "date": "February 14, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 96668439}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "I like the fact that the room I had had a very nice view of the water. It was very nice to be able to llok out at the water at night.", "title": "Beautiful View", "user": "short_girl_70", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46251110}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The staff was very helpful with whatever you needed.", "title": "Beautiful Location and Amazing Staff", "user": "NewYorkSoap", "date": "August 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 38979088}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "When we arrived at the Hotel, the bellman could not have been more courteous, always smiling and assisting us with every need. We were checked into a beautiful Waterfront Room with great views. We dined on the riverside outdoor Terrace with a great server who was very personable and our food was excellent. We stayed two nights and everyone we met could not have been nicer and more accommodating. I will definitely stay here whenever I come to Philadelphia. I would definitely recommend this hotel.", "title": "Expensive, kind of noisy", "user": "dolver", "date": "August 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 36890507}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed on the 8th floor. We were near the elevator and could hear the 'dings' all night! We could also hear other rooms...that certainly wasn't expected of a Hyatt. 9.99/night extra for wi-fi, no cont break. Keatings Grill was good, but pricey. Don't forget to bring extra cash for the $25 night parking!!!", "title": "Stuffy staff, not helpful concierge", "helpfulness": 2, "user": "mynana", "date": "July 25, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0}, "id": 35785311}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Too expensive for what we received. The room was small, not very clean. The place had no restaurants for moderate to high prices and nothing in walking range. That Disney recommends this hotel is puzzling. It is not \"child friendly\" nor is it convenient to the historic places in the city. I was not happy here.", "title": "No Towels, No Quiet, No View...No Return!", "helpfulness": 2, "user": "pinkbird_creates", "date": "July 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 35496539}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "Luckily I got a good deal through price line at around $100 on a Saturday night via a last-minute booking. Otherwise, I would have been more displeased than I am. I called a couple days earlier to check out direct prices, and was told there were plenty of non-smoking rooms available. When I got there, I got stuck in a smoking room and was told that was the only one available, which I found hard to believe at such a large hotel the end of January/beginning of February. The receptionists were not the least bit friendly.", "title": "Overrated; Unwashed towels in bathroom upon check-in", "helpfulness": 1, "user": "CalJackJD", "date": "July 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 35050076}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Upon entering my room, I noticed a hand towel had been used and not replaced with a fresh one, along with a sign on the counter saying towels will not be replaced between guests if they have not been used, to save the environment or something to that effect. I guess the housekeepers didn't realize they'd been used.", "title": "Excellent Hotel - great location", "helpfulness": 1, "user": "friofrio", "date": "July 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34729669}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotel parking is obscenely expensive, over $20. Thankfully, I read a helpful review on price line that told of a $5 or $8 parking lot directly next to the hotel parking garage. Instead of turning right into the garage, you turn left.", "title": "Nice Hotel", "user": "JadedNYer", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 34669484}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The good thing about this hotel is that it's close to many of the attractions, and the view from my room with the bridge over the water was spectacular. I have a feeling I would have enjoyed my stay much more if I was in a non-smoking room. That might be a warning about booking through a discount site where you don't have much of a choice about your room. Still, even considering that, I would not call it a 4 star. More like 3 unless you splurge for the most expensive rooms. My friends stayed at the Marriott, and my room was no better than theirs, and they had free wi-fi while I did not.", "title": "A deal on Hotwire. Not so much at market-value.", "helpfulness": 1, "user": "NewYorkCityTravelAid", "date": "July 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 33681458}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We spent one night at the Hyatt Regency Penn's Landing while spending a day site seeing in Philly. The hotel is nice and the front desk staff was exceptional. We had a great view of the Delaware River from our large comfortable room. The location was ideal for site seeing in the historical area of Philly. There was a charge for internet and parking but in my experience that is standard in 4* hotels in large U.S. cities. If we visit Philly again, I would definitely stay there again.", "title": "Good hotel well placed for attractions", "user": "gearini", "date": "June 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 33086441}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I have stayed at this Hyatt more than 3 times and each time was just as pleasant as the time before. First off, The beds and bedding were so comfortable that I ordered myself the same pillows they use at their hotel. The location was great....It was right at Penns Landing and a short walk to South Street and Society Hill. The food at their restaurants were reasonably priced and they even have a Starbucks for those die hard coffee drinkers. Nice big flat screen tv's and big windows with views of both the water and city. Parking is a little expensive ($25 a night)(especially for a guest) but I guess that is something everyone is doing these days. I parked 2 spots over for $9 a night! I actually live about 21 miles from this hotel but frequent it because of the location and the feel of being on vacation.", "title": "Love this place!", "helpfulness": 1, "user": "babs7262", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133020142}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The hotel is in a central location. It's very beautiful and I had a great room overlooking the Betsy Ross Bridge. The only problem with the hotel is that the highway runs right below the hotel. I was on the 22nd floor and I could hear the traffic from below.", "title": "Beautiful View from my room...", "user": "relaxation-hound", "date": "June 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 132857970}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Very nice rooms, amazing views, only problem is we wanted a quiet swim before bed, we waited until 10:00pm (pool closes @ 12 midnight, why do hotel pools close at all??) anyway @ 10:25pm four women we will loosely refer to as adults arrived with six children under the age of 12 in tow who proceeded to have a very loud (enclosure is concrete so echos badly), very rowdy time, \"cannon balling\" with no regard to people being beneath them, using the emergency floats off the wall as toys, and generally being an undisciplined hoard. Neither the parents nor the two staff members that came up said or did a thing to stop or even \"Tone down\" the activity that bordered on dangerous for all. These activity's should have not been acceptable at any time of day.", "title": "Except for the children...", "user": "Jalav", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 132667700}, {"rating": 4.0, "title": "Perfect location if attending concert across the water", "text": "This was my first visit and it would be only a day. I came to attend Radiohead concert across in Camden at the Susquehanna (sp!) hall and for that, this hotel is perfect! A taxi ride from main station was around $12 to the hotel. The gentleman who greeted me was warm and friendly. Room was not ready I first tried to work in business center, which was small with three workstations and a printer fax. There is no lounge and besides a small convenience store in hotel, there was nowhere else nearby to get drinks/snacks. I was upgraded to the Walt Whitman suite which had a separate living room inluding full sized fridge, microwave, and locked balcony. It also had nice sitting space along w an extra bathroom. I had no complaints about the room but I was underwhelmed. There is nothing outstanding about the decor or the suite itself. It showed some signs of wear, i.e. you could see plaster work on walls where I guess someone had patched a hole. The room was perfectly comfortable, but perfectly sterile. But if you want to attend a concert, this is the perfect location. You walk 2 minutes out of the hotel down to the ock, buy a $7 round trip ticket, and after a 10 minute boat ride, you are there at the Susquehanna. I was offered free internet as a Diamond member and I suppose I would have gotten complimentary breakfast but I left too early the next day.", "helpfulness": 1, "user": "citoyennea", "date": "June 24, 2012", "id": 132664231}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Perfectly satisfactory, though I've found all the Hyatt Regency lobbies I've seen (with the exception of Princeton's) a bit confusing and ill-planned. Good location, I guess, for visiting the Independence Hall complex, by which time you've reached a subway entrance - but it IS a bit of a trek to ANYTHING except the waterfront.", "title": "Certainly superior - but not excellent", "user": "John G", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 132617039}, {"rating": 5.0, "stay_parameters": "Stayed December 2010", "text": "Brought the kids here for a little get away, they enjoyed the pool and room. Went down the street to Dave & Busters, staff was very helpful.", "title": "Great price and views.", "user": "TrippinBilly13", "date": "December 30, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 91123891}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed here Christmas Eve through Monday checkout. Courteous doormen/valet. Hotel is directly on the water - the Delaware River. The $30 self parking option involves 3 different elevators to arrive at your car, it's a long walk. Valet service is $38. The lobby is impressive in appearance. There are 4 elevators. The hallways are classy looking. The large room was superbly decorated in dark tones with a king size bed with grey leather padded head board, large night stands, an immense armoire, a large 32\" LCD screen, a fridge- no minibar, a desk & modern work chair and a large brown leather chair with ottoman. The bed was comfortable with quality linens. The bathroom had a grey/white marble counter top, shower-tub, vanity mirror & Aveda toiletries. Great towels and strong shower pressure. I never saw the pool. I never ate at the restaurant nor the coffee shop. The city view from the sixteenth floor made you breathless. The snow storm we witnessed that weekend was very interesting to see from that viewpoint. The hotel is right on I-95 with easy access to New Jersey & Center City Philadelphia. Minutes south of the hotel by car you'll see a Target, a Walmart, United Artist movie theater and many other national chain stores. Fast food outlets and WAWA are not far away. I would definitely stay here again.", "title": "Great City View Over Christmas Weekend", "helpfulness": 1, "user": "zurak87", "date": "December 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 90928111}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The Hyatt doesn't own the attached parking, they couldn't validate and I had a I known that I'd be spending $25+$5 city parking Tax, I'd never have stayed there.", "title": "Most Expensive Parking @ any hotel EVER!! and I didn't even Valet!?", "user": "WanderSteve", "date": "December 27, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 90805824}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Everything else was normal and reasonable, but this experience was just ridiculous.", "title": "Comfortable hotel w/expensive parking", "user": "Seetraveler", "date": "December 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 89818964}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Nice hotel on Penn's Landing, when driving in it got a bit confusing on the freeways - we missed the exit twice for this hotel and had to slow down to make sure we didn't miss it again. Drove into the historical area of Philly and it's a short drive away. Walking would've probably taken a bit longer (~20min).", "title": "Would stay again even though not in the middle of the action", "user": "teacherhansen", "date": "December 9, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 89456076}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The hotel is next to the river and highway 1-95. I was on a high floor and could still hear all the traffic noise. You can hear every door open and close, every voice in the hall. I walked int my room and stepped on a toe nail, so much for cleanliness. The rooms were dirty, dusty counter tops, TVs, etc. It is a half mile walk to the historic sites or more, plan on takin taxis to get around. The bed, pillows,and towels were OK, but for the hotel price and name you would expect better. The staff was OK. Downown Philadelphia is empty and not safe at night, so plan on staying in. No free intermet.", "title": "DIrty, noisy, and poor location", "user": "MarianaG", "date": "October 28, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 1.0}, "id": 47944585}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed for the weekend at the Hyatt at Penn's Landing. Very nice hotel and love the location. Area looks like the South St Seaport in NYC. Lots to see and do. Hotel was very nice and staff was very helpful and accomodating. Would definitely return.", "title": "Nice hotel & location", "user": "sohkq7", "date": "October 26, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 47767732}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "I generally find Hyatt hotels to be among the best of the large chains, but this hotel does not measure up. The hotel is poorly located away from the city (which does give most rooms good views) but it is about a 10 minute walk to shops and restaurants and you have to cross a very busy 4-lane road to get to anything. The rooms are stylish and modern and the furniture is comfortable, but the rooms are not well maintained (stains on ceiling, damage on walls, mold in bathroom). All of the rooms are sprayed with fragrance which is overwhelming if they have just been cleaned; I nearly vomited when I opened the door to my room and had to move to another room, which was better but the odor was still very noticeable. I will stick to Starwood hotels in the future, their rates are more reasonable and generally a better value. I would recommend the Westin instead, much better location, and similar rates.", "title": "Not a good value", "user": "plasticintruder", "date": "October 21, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 1.0, "service": 3.0, "rooms": 3.0}, "id": 47412442}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "we love this hotel. It is beautiful and on the water. The past 2 years we have gotten awesome deals on priceline. This year we brought our newborn son & got an awesome corner room--said we were upgraded (but I'm sure it's due to crying). We love it here and stop as our halfway point up north. We walked to the liberty bell and all that good stuff. This hotel is great! We'll be back next summer!", "title": "Great Hotel--can walk to it all!", "user": "KER000", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 47057728}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "reservation included duck tour. Arrived at noon, Bellboys were great, desk had tickets ready, took care of scheduling our tour immediately! Room was top notch, had breakfast (included) in hotel--very nice! Great view! Bellman recommended safest & easiest way to walk to South Street! It was just a great choice that I would highly recommend and would go back to in a minute! Staff was super!", "title": "PennsLanding Hyatt great location excellent staff, GREAT deal!", "user": "Artisticwander", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46796533}], "location": {"country": "United States", "city": "Philadelphia"}, "stars": 4, "variance": {"poor": 58, "average": 130, "very good": 332, "terrible": 39, "excellent": 246}, "aka": "Hyatt Regency Philadelphia At Penn`s Landing Hotel", "slim_ranking": 0.428571428571, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Waterfront property. Neo Modernist Highrise."}