{"user_rating": 4.0, "review_count": 1284, "name": "Hyatt Regency Boston", "reviews": [{"rating": 2.0, "title": "Wait until renovations are done", "text": "Just returned from a weekend trip to see the Lion King. The hotel location is convenient to the theater district and the financial district as well as the fanuiel hall area. We stayed in a room that had not yet been upgraded. It was pretty small and the decor generally not what I would expect from a Hyatt. I assume this will probably change when the renovation is complete. It was clean however, and the maids did a good job.", "user": "vtgambler", "date": "February 21, 2005", "id": 3214125}, {"rating": 3.0, "title": "Great bedding if you can get to sleep", "text": "The parking situation is ridiculous. We pulled into the garage at 3:00pm on Friday and left at 5:00pm on Saturday and the charge was $36.00. There is no discount for people staying at the hotel. Fortunately, when we returned we were able to find a spot on the street about 3 blocks away but I suspect this was only because it was late saturday night. Good luck trying to find a spot on a weekday.", "helpfulness": 1, "user": "downmaina", "date": "February 21, 2005", "id": 3213679}, {"rating": 2.0, "title": "Good location but ....", "text": "The restaurant (Avenue One) was very good, both the food and the service.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 15, 2005", "id": 3186543}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "We had one service problem - we requested a corkscrew which they said would be sent right up to our room. It arrived an hour and a half later when we were on our way out.", "title": "Renovated rooms are nice, but still noisy", "user": "pequod", "date": "February 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3185939}, {"rating": 4.0, "title": "Renovated Rooms are Fine", "text": "Feel free to email me if you have any questions.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 8, 2005", "id": 3169843}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "We wanted to see some of the great historical sites in Boston. We wanted to be in a central \"walk only\" location. We wanted a clean, comfortable, \"customer is right\" hotel. We wanted a quiet private room in which to visit with friends and get a quiet night sleep. This hotel delivered on all the above accept the last.", "title": "Very courteous staff and excellent service.", "user": "pjones04", "date": "December 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 50837707}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "The staff was exceptional. The doormen, lobby staff, concierge and dining staff were all professional, customer oriented and made our stay memorable. I recommend using the parking lot just outside the hotel basement entrance. It was $32.00 for 24 hours instead of the hotel's valet parking off-site which was $44.00. Although we did not use our vehicle, we had total access to it. If you are going in and out anytime during the night, use the valet service.", "title": "Couldn't have a better experience", "user": "skye9229", "date": "November 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50136879}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Like I said above, the rooms were very nice but the noise was unbelieveable. We had a two couples next to us who were very loud and truly sounded like they were in our room instead of theirs. The people in the hallway might as well have been in our room too. I heard two females who joined the party brag how they got past the lobby attendants with a false story about leaving their husbands upstairs and forgetting their room keys. I have never been in a hotel where the walls and doors were that thin.", "title": "Paper thin walls at a sky-high rate", "helpfulness": 1, "user": "chacha1976", "date": "November 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 49671605}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "So if you are fortunate and do not have loud neighbors, it's a great package. But if you have loud guests next door and in the hallway, the stay is drastically diminished. Perhaps it could be addressed at check-in. I would recommend this hotel but only with the noise warning. But other than the noise, it is a great hotel.", "title": "Do not pass this property up", "helpfulness": 1, "user": "Jfalkingham", "date": "November 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 49508476}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Staff is unfailingly polite and welcoming at all times. Upon check-in our family was given a delightful complimentary upgrade to a larger corner room which was quite generously sized and very comfortable. I have to single out a front desk manager named Siham who immediately remedied the few minor issues that did surface. We were experiencing some problems staying connected to the in-room wireless internet, and also I wasn't thrilled with the power of the attached bathroom wall hairdryer. The internet charge was promptly removed, we were offered a similar room with an ethernet connection, and a more powerful hair dryer was promptly delivered to our room along with complimentary breakfast vouchers for the whole family. Now that is what I call service. Such a pleasure to have a competant staff ensuring that your stay is pleasurable and hassle free. We will undoubtingly be staying here any time we visit Boston.", "title": "Another Hyatt, another treat.", "user": "john fegan", "date": "November 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49401491}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We checked into this hotel late after arriving in boston, we had pre booked and was given a lovely room over looking the river. Parking was easy. Room was very comfy, I cant say much about the hotel other than that as we lefy around 8am next morning for Stowe, However early morning i needed some info from the main desk, and the night desk man went on the internet and got me the telephone no i wanted. Not sure I wouls stay here if visiting Boston for a extended lengh of time but it was great for a over night stay.", "title": "Great Overnight stay", "user": "UkSand", "date": "January 10, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 53128383}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "My 15 year old son and I just returned from Boston. I was worrried about the comments posted and our visit. I was taking him for his 15th birthday and I wanted everything to be great! The hotel was PERFECT!! It was quite, clean, and above all, the staff was fantastic! Anthony, the Conceirge, was amazing. Amanda at the front desk was helpful and courteous. The rooms were a nice size and very clean. We had breakfast at Avenue One and the service was no. 1. Thank you you Hyatt for making this trip PERFECT!!", "title": "What Noise? Why the bad reviews??", "user": "500PlacestoSee", "date": "January 6, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 52733476}, {"rating": 5.0, "stay_parameters": "Stayed January 2010", "text": "Everything about this place is perfect! It's within walking distance to everything, or a very short cab ride, or the train is steps away... eveything we wanted to see in Boston was so close! The room was so comfortable and very clean. The staff was extremely friendly and accomodating! I really cannot say enough good about this hotel!", "title": "Perfect location!", "user": "yffracs", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52579027}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "very nice hotel. nice staff, nice beds, very good location", "title": "good experience", "user": "JMX2016", "date": "January 3, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 52494142}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "on the less good side : i stayed for 2 nights. you have the \"privacy\" sign to hang on the door but no \"service needed\" sign. i left my room at 1pm removing the \"privacy\" from my door. when i came back at 8pm, my room was not done. this is IMO unnacceptable for a Hyatt. the wi-fi cost also 9,99$ per 24h, not too expensive but i would expect to have free wi-fi in hotels like Hyatt. free wi-fi is one of the most important item i look when i book an hotel. didn't chose to stay there myself, my company did.", "title": "Good location and comfortable rooms", "user": "Vicki C", "date": "December 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 52256516}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "The room we had on 17th floor was very large with pretty city views. The hotel has easy access to Macy's, Chinatown and metro station. The concierge staff is so helpful and friendly. It has a computer next to the concierge where you can print the boarding pass in advance, which is really handy. We enjoyed our stay there.", "title": "Nice hotel with very helpful staff", "user": "s930", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 52136745}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We stayed over the holidays.. What an awful mistake to stay at the Hyatt Regency Boston. The room service food was just plain bland tasteless raw chicken.. The chicken sandwich about the only decent item on the hotel menus unless you specify burn the chicken cook it throughly it will come raw cold and white with sprinkle black pepper and to top if off kinda expensive two chicken sandiwh with one clam chouder soup about $50 .. The only good thing is the Breakfast in the restaurant the food is fresh and for $5 extra you can have it cooked in front of you egg whites, pancakes. etc.", "title": "Horrible Restaurant. Undercook white meat gross", "user": "kiki825", "date": "December 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 51855878}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "If you ever in Columbus , Ohio The Hyatt in capital is the best of its kind. The Regency room serves fresh fruits, crossants. you name it they have it.. The rooms at the Columbus Hyatt are so spacious .. It is a shame to even be compare this the Boston Hyatt.", "title": "Solid 4 star", "user": "LorenzSingapore", "date": "December 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 51661087}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Its a solid 4 star. Heavenly bed, warm atmosphere and sleek & chic room decor.", "title": "A Grand Hotel", "helpfulness": 1, "user": "TexasLacey", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51254340}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "Overnight self parking is $32 at adjacent carpark (not owned by hotel). Central parking in e vicinity is about e same price.", "title": "great location and nice price", "user": "spartan14", "date": "December 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50892750}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We decided on this hotel for our planned overnight in Boston, Friday night into Saturday. We wanted to be in Boston proper and this was a great location and for $89 a night with my wife's travel agent's discount the price was right.", "title": "Overall a Positive Experience", "user": "tedlor32", "date": "November 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 49303508}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We arrived and went straight to the $38 a night valet parking, a lot of dough but really worth ot overall. You drive underground and park, you walk right in and take the elevator to the lobby on the 3rd floor. While some criticize the having to take two elevators, it didn't bother us. It seemed to flow just fine, and provides some separation from the bustling streets.", "title": "Difficult to review", "user": "nycthing", "date": "November 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 48718003}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "The best part of the stay for us was the staff. They were all great, warm and friendly. Paul remembered our names the next morning and was great with our 16 month old son.", "title": "was probably nice at some point, now a bit tired and smells odd", "user": "businesstrvlr20", "date": "November 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 48372263}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The room was nice, a standard room, pretty small as you would expect but not bad for a big city hotel. I would say the room has been partially updated. The bed and decor was updated for sure. iPod dock on the alarm clock was a nice touch. The rest of the room, not so much. The tub yelled out 1980, but it gave a great shower. The hotel web site says \"robes in every room\" which was not true. It also says \"flat screen tv's in every room.\" This is only partially true. The screen is flat, but it is still a large TV that would have been state of the art in 1993. Only 24 channels on the TV, not including Hyatt promo stuff.", "title": "Good quality big-box hotel, no surprises", "helpfulness": 1, "user": "hoboesque", "date": "October 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 47452166}, {"rating": 5.0, "title": "Best Management and Customer Relations Experienced Anywhere!", "text": "Minibar was one of those \"sensor\" types where if you take anything out, you are charged for it. High prices, $4.50 for bottled Dasini water and soared from there.", "user": "Overlandparkers", "date": "October 21, 2009", "id": 47416601}, {"rating": 1.0, "title": "Not my cup of tea......", "text": "My friend and myself stayed at this Hotel October 15-19th. I was very disappointed in the hotel. You had to use 2 separate elevators to get to the ground floor. The information packet said the hotel had a jacuzzi and public internet acces, neither which was true. The pool was on the 6th floor and you had to take 3 flights of stairs to get to it. The walls and doors where very thin. Early in the morning you could hear the breakfast carts rolling down the hall and it would wake us up. The drinks at the bar were way too expensive. There wasn't anything close by to do except for Centerfolds. If you wanted to watch a movie it was $12. The TV was small. We checked our bags on the first day with the doorman and we didn't get our bags until and hour later. The only highlight of the hotel was the consiere service. They gave out great directions and free passes to Centerfolds.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 22, 2004", "id": 2778921}, {"rating": 4.0, "title": "Pretty good, for a GREAT Price", "text": "We booked this hotel on Priceline and got it for $42/night. Our room was pretty good, not tiny, clean and the King-bed was pretty cushy. This hotel is close to a T-station, Chinatown and about 10+ minutes walking distance to Fanueille Hall. It's a good location if you want to be near the \"touristy\" areas. We heard they're remodeling in November 2004, so it should be even nicer for a great bargain! Staff was friendly and helpful. We had a nice view of downtown. If we go to Boston again, I wouldn't mind staying here again.", "user": "A TripAdvisor user", "date": "October 11, 2004", "id": 2696745}, {"rating": 4.0, "title": "Nice Room Great Deal from Hotwire", "text": "I rented via Hotwire. Under $100 unbelievable for this good location. Room was real nice too.", "user": "Visalia11", "date": "September 18, 2004", "id": 2583014}, {"rating": 5.0, "title": "Loved the place", "text": "All the historical sites are nearby, the Boston Green too. Subway was convient for our trip to Fenway. Good restraunts are nearby (China town too). I felt comfortable in the neighborhood.", "user": "boogs1", "date": "September 15, 2004", "id": 2575345}, {"rating": 3.0, "stay_parameters": "Stayed September 2004", "text": "We parked at the neaby movie parking which saved a few bucks.", "title": "Not great for business travelers...", "user": "punky21", "date": "September 15, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 2575337}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "I will make this short but helpful. I would not pay full price for this hotel! However, if you get it for a deal on hotwire or priceline do not worry. The rooms are nice and clean and the staff is friendly. The bed was great and so were the blankets. On the negative side the maid took a pair of my pants and they wanted to charge me to send them to me (that was resolved). Also, the room ran out of hot water which makes for a not so fun shower. The location is good but be prepared to pay a high price for parking!!", "title": "Fine If You Price Line", "helpfulness": 2, "user": "StellaBoBella", "date": "January 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 3000557}, {"rating": 1.0, "title": "Don't stay here!", "text": "Bring back the Swiss! This Hyatt is definately not up to par with all the other Hyatt's we've stayed in across the North East. Unless you get a rate of $50 or less off priceline, forget this hotel. The service is awful, the bell staff is rude if you can find them, the walls are thin, and the bathrooms are just horrible. We've stayed in Best Westerns that were nicer than this!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 7, 2005", "id": 2986746}, {"rating": 1.0, "title": "This is a Hyatt?", "text": "Spent New Year's weekend in this Hyatt pretender. Read on, agh!", "helpfulness": 2, "user": "Isolated", "date": "January 2, 2005", "id": 2970928}, {"rating": 3.0, "title": "OK for the price we paid - Not upgraded", "text": "No rooms renovated, ignore the blurb on the web site. Toilet paper", "helpfulness": 4, "user": "dtcec", "date": "December 9, 2004", "id": 2874356}, {"rating": 3.0, "title": "Hyatt-Not Worth the Money", "text": "not replenished, ditto kleenex. Tacky dispensers for shower soap,", "user": "A TripAdvisor user", "date": "November 22, 2004", "id": 2840621}, {"rating": 5.0, "title": "Very nice hotel with friendly professional staff", "text": "My wife and I stayed here for 5 nights in late October 2004. We have stayed in at least 5 different nice hotels in Downtown Boston and this one is the BEST so far. The location is centrally located for business or leisure activities. Ordering Breakfast in the hotel's restaurant is a must. It was very fresh and made of the highest quality ingredients. The staff was very attentive, friendly and had a \"willing to do whatever it takes\" attitude, especially the housekeeping department. The Neutrogena body amenities in the bathroom were conveniently placed and well stocked. This hotel knows how to treat their guests and goes out of their way to make sure that your stay is a pleasant service oriented one. We will return here on our next trip.", "helpfulness": 1, "user": "Erik M", "date": "November 16, 2004", "id": 2828733}, {"rating": 4.0, "stay_parameters": "Stayed November 2004", "text": "My husband and I spent a night at the Hyatt recently. We found that all of the staff we encountered were very helpful, friendly, and professional. The room decor is very pleasant, neutral and comfortable. The bathroom left something to be desired though - it could have been a Holiday Inn bathroom with slightly better wall paper. I understand that they are undergoing a major renovation so I imagine that the peeling wallpaper and old tub won't be a problem in the future. As other folks mentioned, the walls are on the thin side and about 2:00am the person next to us had their TV up quite loud (we'd just arrived and were getting ready for bed). We called down to the front desk to see what could be done and a moment after we hung up the phone rang in the room next to ours and the TV was turned down immediately. At least it's nice to know that they take guest requests seriously. Overall we enjoyed the hotel but we would probably stay somewhere else next time just to sample the other hotels in Boston. As many other people mentioned, we booked the Hyatt through Priceline - $121 - we probably could have gone much lower and certainly will try that next time.", "title": "Pleasant", "user": "whitneyji", "date": "November 13, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 2822892}, {"rating": 3.0, "title": "Not my cup of tea", "text": "Centerfolds is a strip bar in the red light district. Boston abounds with many venues around and near this hotel. Fenuil Hall, Quincy Market, the Freedom Trail, Parks, and other venus worth seeing and doing. I disagree with your assesment of this hotel. If it took 1 hour for you luggage to arrive, did you take the time and call anyone after 15 minutes had elapsed. I have stayed at many Hyatt hotels, I find this assesment to be completly out of focus. Having stayed overinght many times at this location, I have never been woken up by food service carts rolling by, nor the 'thin walls\" as the author stated. Perhaps a pair of earplugs would be helpful. On the contrary, I have found the rooms to be clean, beds were comfortable, and the only noise that I head was fire trucks going by one time. As for the location, sure its downtown, but it is central to most places to go. I and my wife have attended concerts in the park until 11PM and have never had a problem walking back, or for that matter, walking to chinatown late at nite for a bite to eat. For the $12 USD you have to pay tor a movie, nextime watch HBO for free or go to the Lowe's Cinima around the corner and pay more.", "helpfulness": 1, "user": "SteveRBoston", "date": "November 6, 2004", "id": 2810866}, {"rating": 4.0, "title": "Lovely hotel, location slightly dodgy", "text": "We stayed here from 22 - 25 October for $100 a night via Hotwire and found it very good and excellent value. Our room was large and very comfortable. The desk staff, concierge and chambermaid were all friendly and helpful.", "user": "kayess00", "date": "November 1, 2004", "id": 2799282}, {"rating": 4.0, "title": "Very good stay", "text": "A highlight for us was the wonderful breakfast buffet in the hotel restaurant (very ambient, lots of light wood, colourful modern art and soft jazz). For $15 ($7 per child) you can fuel up on cereals (including a deliciously creamy, fruity Bircher porridge), fresh fruit salad, bagels, smoked salmon, cold meats, pastries, eggs, bacon, sausages, french toast, pancakes - I could go on and on - we made it our main meal of the day!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 25, 2004", "id": 2784067}], "location": {"country": "United States", "city": "Boston"}, "stars": 4, "variance": {"poor": 95, "average": 263, "very good": 521, "terrible": 40, "excellent": 365}, "aka": "Hyatt Regency Boston Hotel Boston", "slim_ranking": 0.675324675325, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located in the heart of Boston and just steps from Boston Common, Faneuil Hall, the Theatre District, and Newbury Street, Hyatt Regency Boston suits the needs of both business and leisure travelers. From our luxuriously appointed guestrooms featuring the signature Hyatt Grand Beds, to Avenue One restaurant serving up power lunches, after dinner drinks and pre-theatre meals, you will experience the ultimate in comfort and style. Ambiance, warmth, and sophistication are just a few of the words that describe our Four Diamond, luxury hotel."}