{"user_rating": 3.5, "review_count": 1206, "name": "Hyatt Regency Washington on Capitol Hill", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "This hotel is a moderately priced full service hotel. Our room was on the small side with a king size bed, desk, and lounge chair, but was adequate and functional. Service is good, the room was clean and the lobby area is configured in an unusual but interesting way. The hotel is located two blocks from the capitol, and about three blocks from Union Station (Amtrak) where there is also a Metro station. A buffet breakfast was very good if not a bit pricey, but not inordinately so for DC. I would stay at this hotel again and recommend it to business or pleasure travelers to Washington DC.", "title": "A Good Hotel in a Good DC Location", "user": "HAD232", "date": "October 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119646475}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "In my mind, I expect Hyatt hotels to be a cut above most, not all, others. Well, this Hyatt Regency is a decent hotel. The lobby is large and open and my room was fairly decent, a somewhat modern styling, but not super impressive. The rooms & hotel were overall quite clean. I got a really good deal through hotwire.com and the price was so hard to beat I really shouldn't complain, but I'm basing this review on the fact that they market themselves as a 4-star hotel. I wouldn't quite put them at 4, maybe a 3. I wouldn't put it near the quality or accommodations of any of The W hotels.", "title": "Decent, but questionable neighborhood", "helpfulness": 2, "user": "Tat3r", "date": "October 23, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 3.0}, "id": 119641217}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Then there is the issue of location. It is near the capitol building, but that is it for the pluses. The hotel is located on the far east side of the mall area, so you will be walking a lot. Additionally, about one block west is some sort of \"projects\" facility, which attracts many of the type of people that make you nervous to walk by during the day, let alone at night. It was VERY ghetto, but out was only that block, the rest was fine and none of the ghetto cats ever approached me or even talked to me.", "title": "Nice, but overpriced, hotel in a convenient location.", "user": "DrKatieRN", "date": "October 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 119474759}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Not sure I would go to this hotel again, as there are better locations (speaking in terms of geographically & neighborhood). Plus, like other supposed \"4-star\" hotels, wifi internet is not free. I find this more than annoying since hotels like Holiday Inn Express provide it free along with some crack cocaine they call cinnamon rolls :-). And they are way cheaper than a Hyatt, so it doesn't make sense. Not to mention, this particular Hyatt is barely a notch above an HIE (definitely not a full star). (Note: I'm aware the lobby and full restaurant & bar would raise the Hyatt's rating, but I'm basing this on what YOU will think, not the rating \"official\".", "title": "Terrible location, despite convenience of Union Station", "helpfulness": 1, "user": "izzyd121", "date": "October 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 1.0}, "id": 119450299}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I stayed here for a professional conference. All events: sessions, meetings, & receptions were here. The rooms were small and dark, but clean. The lobby is an escalator ride from the front door. It is inconvenient. There is one wheelchair elevator, off the beaten path, and not convenient. Food was fair at best. The ballroom was spacious and there were adequate restrooms. Overall, there is no flair nor special feeling at this Hyatt.", "title": "Be afraid.....be very afraid", "helpfulness": 2, "user": "georgeandgracie46", "date": "October 16, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119368507}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "This hotel has a great location. You step out the front door and the Capital buildings are only 2 blocks away. All the major sites are within walking distance. That location, along with its conference facilities are its selling points. The conference rooms were well-appointed with comfortable seating, AV facilities and air circulation.", "title": "Disappointing versus expectations and location", "helpfulness": 1, "user": "The_Lewis", "date": "November 14, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 120591042}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Beyond that, there wasn’t much to recommend the hotel if I’d been holidaying and paying for the room. The arrival experience and ongoing service from the doormen and bell hops was lack lustre at best. No one opened the car doors, we weren’t greeted and luggage was left unattended (very disconcerting - luggage cart just abandoned by door staff while we checked in). Same experience on check out. The in-room experience wasn’t much better. We had a tired fourth floor room that didn’t even have a safe. The bathroom was marble, but lacked shelf space and there were no bath robes. It was clean, but there were obvious signs of damage to the walls, bathroom fixtures and woodwork.", "title": "No way 4 Star! Horrible stay!", "helpfulness": 1, "user": "TravelGirl4228", "date": "November 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 120586245}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Was super disappointed in this hotel. Stayed for only one night. I think almost $250 w/tax (Mid November) Room was small with a view of nothing. The toilet barely flushed. We bought a few sodas to take to our room and surprise....there was no refrigerator. Even in the cheapest of hotels you at least get a mini-fridge. They put us right next to the elevator so all we heard was dinging all night not to mention doors slamming all night oh and had to have security called at 4AM due to a party in the room next door. The next morning, 2 hours before checkout housekeeping walked into our room with barely any knock (I didnt hear anything) and my fiance and I were barely dressed. I did complain to the front desk clerk and he was gracious enough to refund the vallet fee. However when I tried to leave with my car the girl in the vallet booth harrassed me that I didnt pay. I explained to her that the charge was removed and she was nasty. Would never stay there again!", "title": "Great experience again at the Hyatt Regency Capitol Hill", "user": "Amanda H", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120586150}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed here for the second time in a row and again enjoyed great customer service. Staff went over and above to help me with business related needs (needing to print a document after hours - Thanks Erica Guity - and needing to borrow a computer for a presentation - Thanks, John). The food at the conference was also excellent. Rooms are clean and have nice touches like tile/glass shower and comfortable beds. The location is great - just blocks from the Capitol and Union Station. The only downside on this stay was that my room didn't have a bath tub (but others do), and the hotel itself is fairly mainstream (corporate) in terms of ambience. But I would definitely stay here again and recommend it to others.", "title": "Bed not so comfy, Far from downtown area", "user": "travelergo", "date": "November 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 120580192}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Stayed here recently for a conference. Far from downtown area and very close to the union train station. King Bed was not comfy and had a wood platform frame which I banged into getting out of bed everyday as the mattress was set low inside the frame. Bed was hard and pillows with no support. Only one plug outside bathroom that worked to charge my cell phone. Bathroom has a glass shelf which made it difficult to put my toiletries up on. Not much room. Don't bother with the hairdryer for much power. Bring your own. Positives included alot of lights in the room. Fluffy luxury towels. Love the soft cottonelle toilet paper and the kleenex tissues. Staff was friendly and accomodating. Would I stay here again? not for a personal trip and only unless I had to for business. I recommend the Article One restaurant (chicken noodle soup, Rib eye steak with french fries) as their food was delicious.", "title": "Great Staff, Good Location, OK rooms", "user": "spotdog", "date": "November 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120554470}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed at the Hyatt Regency for two nights in November 2011 while attending a conference. The hotel is just about 4-5 blocks from Union Station, so is very convenient if you come in on the train as I did. No need to take a taxi! Always a pleasant place to stroll, with wonderful views of the Capitol along the way.", "title": "Convenient location, conference food just OK", "user": "CKF", "date": "November 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120509158}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Check in was quick and efficient. The room was basic but adequate and I did make use of the in-room wi-fi ($10.99 per 24 hours). I could hear quite a bit of outside noise, both in the hallway and from the street traffic below. However, it did not prevent me from sleeping.", "title": "Great location for travelers", "user": "mymysmema", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120435625}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I had all three meals provided for me at the hotel during this conference. While dinner was good and lunch was average, the breakfast was especially disappointing. There was no toast, no bagels, and my scrambled eggs were cold (ick!). There were several kinds of danishes and some muffins, along with juice and coffee. Perhaps the food in the main restaurant for non-conference guests is better.", "title": "Nice location, not many perks", "user": "xiphoid76", "date": "November 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120347062}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "All the employees were very helpful and quite friendly. The concierge suggested a sandwich place nearby for a quick bite (The West Wing) which fit our needs perfectly.", "title": "Great location, mediocre room", "helpfulness": 1, "user": "oahulady66", "date": "November 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 3.0, "service": 5.0, "rooms": 2.0}, "id": 120311012}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "Check out was easy using the kiosk in the lobby. I tried to check out using the TV/video option in the room, but it did not work.", "title": "Watch 9th floor west side, mold smell, but otherwise ok", "user": "Airpharm", "date": "November 4, 2011", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 120181544}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This is a Hyatt....you can trust the basic quality of the room design and beds, clean (enough) bathrooms and amenities. Attention to detail is lacking, however. For instance, the space between the bedside table and the wall was filled with dust bunnies (clinging to the wall). Obviously, it had not been dusted for a very long time. I'm not normally too picky about hotel cleanliness, but this surprised me. For the cost and the brand name, I expected better.", "title": "Reliable with some warts in DC", "user": "LVBackus", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119970341}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "On another quality note, the walls are thin. Television noise as well as alarm clocks and bathroom noise from neighboring rooms was enough to wake me.", "title": "Good hotel, they handled a large function well", "helpfulness": 1, "user": "JoKnits", "date": "October 31, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 119967555}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Location was perfect for me since I was taking the train. The hotel is a quick two to three blocks from Union Station. Nice location, but not as many restaurants as I would have liked within walking distance.", "title": "If you enjoy airport atmosphere and want to be close to the Capitol, stay here!", "helpfulness": 1, "user": "swisscheck", "date": "October 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119938839}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Service was professional and friendly. The layout of the hotel made navigating the various meeting spaces a bit difficult, however, and signage was poor. All in all, though, if you're an adventurous do-it-yourself type, it's manageable.", "title": "Average hotel, great location", "helpfulness": 1, "user": "ushma", "date": "October 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 119902816}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I attended a large meeting here with multiple catered events. I was very impressed at how well they handled everything, with excellent food and bar service.", "title": "Convenient; Professional", "user": "Rstlocal", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119656430}], "location": {"country": "United States", "city": "Washington DC"}, "stars": 3.5, "variance": {"poor": 107, "average": 299, "very good": 467, "terrible": 54, "excellent": 279}, "aka": "Hyatt Regency Washington On Capitol Hill Hotel", "slim_ranking": 0.627906976744, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Occupying a full city block in the heart of Capitol Hill, 2 blocks from the U.S. Capitol and Union Station;walking distance to national and cultural attractions, restaurants and theaters. The hotel features a contemporary atrium lobby, restaurant and lounge - Article One-American Grill."}