{"user_rating": 4.0, "review_count": 423, "name": "Hyatt Regency Greenwich", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The recent remodel shows that Hyatt gets their guests. Rooms have lots of lighting, including mini-directional lights in the headboard, plenty of electrical outlets, including in headboard too & clean lines in all furniture. Easy in/easy out - front desk was friendly & supportive with our needs. Well located - 10 min to Old Greenwich, 7 min to the Whole Foods. Easy to recommend you stay there.", "title": "Delivers as promised", "user": "DianneM92", "date": "April 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127210621}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The kids loved the pool and eating in the atrium restaurant, felt like the rainforest to them. Room was perfect size for a young family of 4. We had a living social deal which included brunch which was a great deal! Beds were comfy and our view of the atrium was fun.", "title": "Very nice place, great for kids", "helpfulness": 1, "user": "sweeney1121", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 126781389}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I loved this hotel. When I was inside the atrium it felt like I was in the Keys. The rooms surround the atrium which is pretty much a greenhouse that has a bar and restaurant. The room was large with great views of the atrium, so I had natural light, and very quiet.", "title": "Perfect Stay", "user": "VailErika", "date": "March 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126682758}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The meeting space is also very nice, and I was so pleases with the food presentation for our meeting - it was a clever idea.", "title": "Hyatt Regency Greenwich - most recommended", "user": "pereiragaynelle", "date": "March 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126479155}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "I had dinner at the Gazebo Bar so I could watch some March Madness and the food was excellent, they had a great liquor selection, and the nut mix they give you, so much better than the standard. I had to watch myself with the nut mix.", "title": "A for effort C for execution", "user": "sweetta557", "date": "March 17, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 126222472}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "As we checked in, Steve, at the desk gave us all kinds of friendly advice. He told us about the 2 neighboring towns, as well as things to do in our leisure time.", "title": "Such nice employees", "user": "hisim", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127563312}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The other folks we ran into were just as helpful.", "title": "Hyatt Greenwich major issue to address", "helpfulness": 2, "user": "LL12", "date": "April 9, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 127537824}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The room was large, but sounds from the hall carried through the walls. Comfortable bed, nice amenities, and very expensive restaurant prices. Too high for us.", "title": "Pleasant stay, room service prices outrageous", "user": "pyrha", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127524769}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The hotel is beautiful,but needs some tweaking. Make the breakfast more wallet friendly, like the staff! Get more pressure in the shower, and don't charge for parking.", "title": "First stay since 'renovation'", "helpfulness": 1, "user": "outbackgirl25", "date": "April 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127426511}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I really like the recent renovations here and a decent overall place to stay, except for the most important factor.... getting SLEEP! This is the WORST hotel I've ever stayed in noise wise!. There is absolutely NO insulation from the hotel guest room door. The doors slam shut when they close, so you hear EVERY door slam at all hours. Guests do not seem to be mindful of this. When people talk in the hallways, you can hear the conversations. I've stayed here several times for business and EVERY time I do not get rest here. My last visit wised up to bring ear plugs- which did NOT help! I got woken up ALL night, and early morning from very noisy guests in halls, doors slamming and housekeeping vacuuming. I like this location and hope the hotel does address this serious problem. Must say, customer service at this property lacks. I've called from my room with other issues which were not addresses. For one, the heat in the rooms are turned off. On 3 separate stays the heat would not get warm, blew cool air. I know it's the hotel probably trying to save money and it's centrally controlled. I've had maintenance coming up 3 times for one room and didn't ever get the temperature warm. So the heaters are not broken. THREE stays of a COLD ROOM, and NO sleep. The rate was excellent, but is it worth it in the end?! HORRIBLE!!!!", "title": "Always a good stay", "user": "Hopsing-NH", "date": "April 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127257091}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We stayed at the Hyatt Regency Greenwich this weekend and were so pleasantly surprised. I had read many reviews of how it is under renovation, etc. Upon arriving I was so pleasantly surprised - the lobby was grand and bustling with beautifully dramatic bamboo and greenery filling the atrium. Our room (2 doubles on the 3rd floor) overlooked the atrium, the beds were so comfortable, the rooms were spotless, the bath products were white ginger scented, everything was new and sparkling. We enjoyed dinner with our kids in the bar area and you are surrounded by running water and lush landscape leaving you feeling like you are in a tropical resort - not Greenwich, CT! The kids loved the pool and gym area which were both impressive and above average. Although the hotel seemed full we were never bothered by any noise from other rooms or guests in the hallways. Our AAA rate included the elaborate breakfast buffet which was outstanding (and the service at the restaurant was remarkable). We chose to stay in Greenwich only as a stop over on the way into NYC but were so impressed by this hotel that we would consider making the trip again for a mini-vacation in Greenwich.", "title": "such a surprise", "user": "kaseinsy", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124972738}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Thanks to the remodeling of the rooms and spaces, this is a nice place to stay. The walls are little thin as its pretty easy to hear the noise outside in the hallways but the rooms were comfy and new. I had a Business Plan reservation which includes daily Internet and the breakfast buffet. The food was acceptable with the breakfast buffet quite good. Typical nice Hyatt workout room. Self parking is $10 per day, which was a bit much.", "title": "Nice remodel", "helpfulness": 1, "user": "gopoets", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 124522296}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "In all, I would return to stay here again in the future.", "title": "A bad night at the/for the hotel...", "helpfulness": 1, "user": "CryingMan", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123850977}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "A stay at a hotel (or even a restaurant) is always a snapshot... a property may actually be excellent or solidly good... but on any particular night thing can go sour. That happens for lots of reasons (maybe a pipe bursts). On the night I just spent at this Hyatt Regency, it was the particular mix they had of guests who were attending various functions. The property is beautiful and a welcoming business-type hotel. Reception was friendly but a bit distracted (the two receptionists were actually counting cash spread all over the counter - I thought that odd). I was asked if I wanted a room close to the elevator. I responded that I wanted a king-size bed in a very quiet room. I was told that a recently-renovated room on the top floor would be perfect. Card-key in hand I trundled to the 4th floor room 4042... quite a distance from the elevator (good start!). The room was clean and nicely appointed... quite large and comfy. Ten minutes after arriving in the room, another couple was trying to enter. They had been checked into the same room by the reception staff (remember I said Reception was distracted?). I called down and reported the SNAFU. I received another call a few minutes later apologizing and acknowledging the error. Now, at about twenty minutes in the room the noise began. Teenagers running, traipsing, marching, ambling back-and-forth down the l-o-n-g hallway... unable (as teenagers are) to modulate their voices. The hotel, it turns out, was overrun with them. This went on all the way until I left the hotel to conduct my business at 5 PM. I returned to the hotel at 10 :30 PM and there were, if one can believe it, MORE teenagers than before... all attending one of the various functions. The hotel and halls remained noisy until midnight. I would otherwise give this property a good or excellent rating... but because of the snapshot of that night... it get an average rating.", "title": "Very nice hotel", "user": "Tarae3", "date": "January 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123450507}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed here on a business trip. The staff was friendly (although it was hard to understand them as not many spoke English very well) and the rooms were very clean. Although it was quite pricey, it was a nice relaxing stay.", "title": "BEAUTIFUL HOTEL !!!", "user": "Elliott97", "date": "January 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123414933}, {"rating": 3.0, "stay_parameters": "Stayed March 2012", "text": "Its not a Grand Hyatt but they've upgraded here recently. Better room set up. Employees are not service focused and food choices very limited but the rooms were clean and comfortable. I'm top level in Hyatt loyalty program but they put me way away from elevators and didn't offer the normal status perks such as club, breakfast, free Internet. Room keys were keyed wrong the first time requiring a return trip downstairs. But again, clean rooms!", "title": "It's ok. Clean and remodeled but still dated", "user": "TEXKEYSTONE", "date": "March 13, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 126071249}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Its a shame they did not take the opportunity to improve the service along with the facilities to restore this one great hotel to its former glory. Yes the rooms are nicer, but it was *well* overdue, and it just puts it on par with other hotels in the area, nothing special. The front desk however continues to be cronically understaffed. The GoldPassport program does not work at all, despite being a frequent guest I have never been able to get points credited to my account, I always have to call GoldPassport to get them manually posted. However the sales people seem to be well aware of all my information given all the marketing they do to me, though this does not translate into any operational improvements. The regency club, though redone, has had the quality of offerings severly reduced, and the workout facilities remain relatively small for the size of the property and the fact that there seem to be community members there as well. Last but not least, if there is an event going on and they are leaving the parking lot at the same time you are, plan on at least 20-30 minutes to leave the parking lot due to their inability to handle large traffice volume. Parking always seems to be an issue here with all the events they have.", "title": "Yes rooms are nice, staff and service still lags", "user": "epg_01", "date": "March 11, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 125951205}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We have stayed here many times and truly appreciate the care and atrention shiwn in the room renovations. There are still some plumbing problems, with tub water taking quite awhile to drain. The staff is very friendly and accomodating, and the rooms and beds are very comfortable. My only real complaint is that there is a bit of nickle-and-diming going on, i.e.,! hidden charges. There is a charge for wi-fi as well as self parking in the hotel parking lot. That seemed excessive to me for a full service hotel.", "title": "Nice renovation but too many hidden charges", "helpfulness": 3, "user": "Florimond", "date": "March 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125591810}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The hotel recently completed their major renovation and it looks fantastic! Everything is wonderful and the staff, from the general manager, Tom Delaney, on to the servers are so very proud of the \"new\" look.", "title": "Renovated, and better than ever.", "user": "Bill L", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125517275}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The King guestrooms are spacious with a nice work area. I've stayed in several of this type and they are all quiet, regardless of their location in the hotel. One thing I really like is the availability of fresh coffee by the elevators (including copies of the NY Times, even on Sunday!)", "title": "Fantastic renovation, shame the customer service doesn't accompany it.", "helpfulness": 1, "user": "Jess E", "date": "February 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125187122}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "We stayed here this past weekend for one night. We were in town to catch a train from Stamford to Grand Central. The hotel staff was friendly and attentive. The hotel has rooms facing the atrium and rooms facing the exterior. We received a room facing the atrium which had a great view of the gardens and palm trees. The hotel is in Old Greenwich on the border of Stamford. IT is a quick 10min drive to downtown Greenwich with great shops and restaurants. We will return next time we come to the city.", "title": "Awesome Weekend Stay!", "user": "Jc103", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181138812}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Stayed over a Friday evening with family and had a great time. Would do it again under the AAA rate (included bkfast for 2, kids under 12 eat free). Rooms were clean and comfortable. Pool was nice size.", "title": "Nice Weekend Stay", "user": "partyoffiveCt", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 181004518}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Did not order room service because it was limited selection and expensive. Right down the street was Bobby's BBQ and took out from there (do not miss it, really happy with our food). $10 parking fee is ridiculous.", "title": "Beautiful Hotel, Impersonal Staff", "user": "boudecca", "date": "October 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 180828945}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Had problem with reservations but was able to resolve easily. Must have been given the room furthest away from the elevator, seriously long walk. It almost felt like being in the shining because the corridor was soooo long. ask for room near elevator or no more than half way down the hallway.", "title": "BEST stay of our 5 weeks in USA", "user": "beachsideguy99", "date": "October 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180740991}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "First, Hyatt Regency Greenwich is not actually in Greenwich. It is located in Old Greenwich on the border of a pretty gritty downtown Stamford neighborhood in the old Conde Nast printing facility. If you are coming here thinking you will be close to Greenwich, I recommend checking out other options.", "title": "Loved our stay!", "user": "carrie_tim", "date": "October 10, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180535163}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "A group of us were headed down for the weekend for the Greenwich Food & Wine Festival. We were already paying a pretty penny for the tickets so wanted an affordable but nice accommodation. We looked in nearby Stamford but didn't want to be with being in the city. The other accommodations in Greenwich were pricey so Hyatt was a good compromise. I was a little hesitant after reading the reviews on TripAdvisor because cleanliness is the most important thing when staying in a hotel. This hotel is close to the highway and HUGE!!!! Parking is in the back and when we arrived late at night we were only able to park quite far from the building. Not a problem for us but could be for some folks. As I mentioned the hotel is HUGE and has multiple function halls a center bar and any amenity you may need. The best part of the hotel is the lobby. It's beautiful with a waterfal/stream and trees planted in the middle. I don't know why more hotels don't try to bring the outside in. Our room was located on the 4th floor and it felt like it took forever to get there. BUT, once we were in the room I was pleased with the accommodation. Everything was CLEAN and the bed was VERY comfortable. The esthetics of the room were pleasing, but you can definitely tell this is a high volume hotel. I found no stray hairs, dust bunnies and everything was working fine. The Hyatt does have a restaurant on premise but we did not visit as it was closed when we returned at 11pm. The bar does serve food until midnight. It was OK, the best part was being able to sit at the bar and listen to the stream trickle along while gazing at the trees in the lobby. We splurged and got breakfast in bed and it was delicious and such a treat. I would definitely stay at this hotel again, it was absolutely better than I thought it was going to be and I would say I definitely enjoyed my stay.", "title": "Better than I was thinking.....", "user": "Nicole C", "date": "October 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180494324}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Stayed for one night. The room is in need of an update. The bathroom was not clean. I was too grossed out that I didn't even bother showering. Wouldn't stay there again. Brunch buffet was good though ($50 per person).", "title": "Rooms need updating", "user": "NYC405", "date": "October 9, 2013", "detail_rating": {"cleanliness": 2.0, "rooms": 3.0}, "id": 180356643}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "nice property; great atrium. complete breakfast buffet and coffee on every floor. nice pool/steam room. right offf exit 5 on the highway. close to stamford shopping / theatres and feels better than staying in a downtown area.", "title": "elegant hotel", "user": "billggg", "date": "October 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180266984}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "I stayed here for 3 nights while in town for a family event. My room was on the 4th floor with windows facing the front of the hotel. My room was very modern and stylish and had great quality furniture and decor. The property had some really nice and thoughtful touches like providing small snacks (different everyday) and beverage by the check in area; coffee station by the elevator each morning (although it got a little messy and empty by late morning during weekends) and 2 large bottles of Aquafina water in your room every day. My only suggestion would be that the lighting in the rooms could be improved.", "title": "Thoughtful hotel", "user": "zzzzzzgirl", "date": "October 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180262684}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My boyfriend and I stayed here for one night before we left for Miami. Lived in CT all my life and never stayed here. We usually stay at the hilton in stamford when we book on hotwire but this time got the hyatt. The hotel has beautiful lobby and the rooms are nice. The hotel is huge. Got lost walking to our room a few times. Compared to the hilton bathroom I thought this one was a little small. Service was good. Overall good one night stay", "title": "nice hotel", "user": "dfos4293", "date": "October 4, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "rooms": 5.0, "service": 3.0}, "id": 179737467}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "I stayed here instead of our normal hotel as a friend wanted to use points. I can say I really enjoyed this property. The shuttle to the Stamford station makes it great for a day trip to NYC. Be sure to get the weekend package rate with the free breakfast, The buffet breakfast is excellent and the service outstanding. This will be my new Stamford area hotel.", "title": "Really enjoyed the service and the property", "user": "Highclasslowrent", "date": "October 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 182720131}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "Given the limited choices in the area this hotel is filled with business travellers. It is an older style Hyatt with the large center atrium. The rooms are clean and recently updated. However, they are quite noisy. I was able to hear full conversations througgh the walls and the loud toilet flushing of all my neighbors. The beds and pillows were quite hard and not what i normally expect from a Hyatt. The restaurant was closed during my stay so had to eat in the packed bar", "title": "Nothing special", "user": "Avid_Travelerz", "date": "October 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 182626425}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I stayed here for business meetings for two nights in October. The rooms were very nice and clean, the bed comfortable. the staff were nice and helpful. we conducted our meetings in the hotel meeting rooms and they were spacious and comfortable. I also used the fitness room where the equpment was up to date and worked well. The lobby in the hotel is amazing with trees and water, giving a tropical feel. My second floor room did not have much of a view but that did not bother me too much. I asked for a room without down pillows or blankets due to my allergies and got an allergy friendly room but two of the pillows still had feathers, I put them in the corner and was fine but someone more severly allergic may have a problem, if you are allergic check each and every pillow.", "title": "Wonderful hotel", "user": "HFriedman", "date": "October 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182301097}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I and my wife recently stayed at this hotel to attend a friends near-by wedding. I was impressed by the staff, the reception and concierge help, and the interior, which was surprisingly pretty.(if predictably corporate). One caution, our room required quite a long walk from the elevator, a tough trip on two replacement hips. We were advised to stay away from the apparently noisy atrium rooms, which i think was too cautious, because at 11:00pm, it was pretty quiet on a Saturday night.", "title": "Very well run.", "user": "cycle11", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 182016648}, {"rating": 5.0, "title": "Trip to Greenwich", "text": "A fine property, which I would recommend for events or a trip to the \"Stanwich\" area.", "user": "MJC991", "date": "October 22, 2013", "id": 182002979}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We are long time Hyatt Gold Passport members and have enjoyed many lovely stays in Hyatt properties around the world. This particular property is one of the best that we have encountered in the US. The property is lovely and well maintained, the food service and amenities are very good but what sets this hotel apart from other Hyatt properties is the staff. Everyone we encountered, without exception, seemed to be personally dedicated to making sure our stay was exceeding expectations. From the valet drive to the front desk (Pam was very helpful) to wait staff to the housekeeping staff, everyone was smiling, energetic, asked if they could be of help. Thanks for making our long weekend very memorable.", "title": "Not your ordinary Hyatt experience", "helpfulness": 1, "user": "travelfunaddicts", "date": "October 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181950166}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Rooms are nice size with adequate space for clothing . A discreetly placed mini-fridge and a digital preset radio/ipod dock enhance it. Nice sized TV but more channels would be desirable.", "title": "very pleasant hotel, very good value", "user": "philnomore", "date": "October 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 181938843}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "No coffee maker but complimentary coffee/tea on each floor and in the lobby make up for it.", "title": "Awesome value though lacking a little charm", "user": "Bret F", "date": "October 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181743470}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "Treats are available during the day near the reception desk. We were even given complimentary champagne when we checked in. Also in the lobby are complimentary morning pastries and newspapers ( including weekend). The lobby is a huge and gorgeous atrium with a pond and many very comfortable chairs.", "title": "Very comfortable, friendly, but expensive breakfast", "user": "BerkhamstedJules", "date": "October 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 181733426}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "First thing's first: This hotel is incredible value. There aren't many options w/i Greenwich itself, and this one is a solid option with very reasonable rates. It's also well-located, right off the highway, nearby just about anything , you'd need -- gas, groceries, fast-food, restaurants, Dunkin Donuts. Heck, I was here for a wedding and needed a belt, and thankfully there was a mall not more than 15 minutes up the road. What a relief.", "title": "Weekend Retreat", "user": "tzvi a", "date": "October 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 181681600}], "location": {"country": "United States", "city": "Old Greenwich"}, "stars": 3.5, "variance": {"poor": 44, "average": 73, "very good": 145, "terrible": 21, "excellent": 140}, "aka": "Hyatt Regency Greenwich Hotel", "slim_ranking": 1.0, "description": "Conveniently located less than 5 minutes from the Stamford Business District and train station and 20 minutes from White Plains, NY. Easy access off I-95, Exit 5. Only 45 minutes by train from Manhattan. Complimentary shuttle service available within a five-mile radius. All guest rooms are wired for high-speed & T-Mobile wireless internet access. Surrender to the Hyatt Grand Bed – featuring luxurious goose down pillows, triple sheeting, a thick down blanket - all piled atop a Sealy Posturepedic pillow top mattress. Check-in or out with a simple touch of a screen using the Express Check-in Kiosk. Retrieve flight information and boarding pass using the Hyatt Fast Board technology. Enjoy our Stay Fit @ Hyatt program at the fitness center featuring Life Fitness cardio and strengthening machines with individual flat screen TVs, as well as an indoor pool, steam room and whirlpool. Satisfy your appetite for breakfast, lunch and dinner at Winfield’s Restaurant winner of the Best Sunday Brunch by Greenwich Magazine. Relax in the Gazebo Bar for a specialty cocktail and a light fare menu. Or enjoy the ultimate in convenience when you dine in the comfort of your own room with our extensive Room Service menu. Restore your spirits after a workout with a power drink or snack at our Hyatt Stay Fit Gym."}