{"user_rating": 4.0, "review_count": 1286, "name": "Hyatt Regency St. Louis at The Arch", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My husband and I headed to St Louis for a concert at the Pagent and stayed at the Hyatt downtown. I bid on the room and got it for a great deal. The hotel is in a great location, but hotel parking is expensive! We self-parked for a 1/6 of the price. Room was clean and I loved the modern decor. We didn't check out anything in the hotel, so I can't rate the gym, dining, etc, but I would stay here again.", "title": "Great hotel and location!", "user": "Lecia J", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142891742}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Found this hotel to be a nice hotel in the heart of St Louis. Would stay again. Front desk staff were very helpful with many staff ready to assist in any way. Clean rooms, nice bathrooms and great location for views and getting around downtown attractions.", "title": "Hyatt nice hotel with many amenities", "user": "Mary71478", "date": "October 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142795210}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I was here for a conference and the place has seen better days. The room I was in had a musty aroma which i thought might also have had a bit of smoke in it. The housekeepers tried to cover it up with some cleaning product that smelled like what rental car companies use when they want to cover up bad odors. The room was small but the bed was comfortable. I wouldn't stay here again if i was back in the area.", "title": "good location but worn and stinky", "user": "Loves2TravelALOT_11", "date": "October 13, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 142720232}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The hotel is well located but does not come close to its rating. It is average at best. No turndown service. In room coffee was not replaced on second day. Valet parking but not retrieval. There is no pool. A good sports bar is about all that is special at this property.", "title": "Don't expect much.", "user": "John T", "date": "October 13, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 142715807}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Perhaps a bit drab looking but at the end of the day does the trick with quiet comfortable room and bed, helpful staff, and adequate amenities. Decent food and beverage selection with a sports bar and grill, steak house, Starbucks all in the hotel, so no complaints other than the hotel itself doesn't have much eye appeal in my opinion.", "title": "Comfortable Downtown Hotel", "user": "jdr27", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 142599873}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This hotel is right across from the Arch and within walking distance to downtown attractions such as the baseball and football stadiums. I found ALL of the staff at this hotel to be very accomodating and courteous. The two (of three) restaurants that I visited in the hotel (Brewhouse and Ruth's Criss) were very good. There is also a Starbucks in the lobby. The fitness facility was spacious and well equipped.", "title": "Very Good Overall", "user": "Cpacad", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141867053}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I thought my room, which I think was a basic room with King bed, was a little small as was the bathroom, but it was plenty adequate for me alone, and I think would be ok for 2 people, though the bathroom would be tough to accomodate 2.", "title": "Can't beat the location for a ball game and service was great", "user": "poodleone", "date": "October 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141826912}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "All in all, it is a place I would definitely stay in again.", "title": "Hyatt Appreciation", "user": "M Diane K", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 141771749}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I had bid $50 on Priceline and won the Hyatt Regency for the last home game of the Cardinals season. Could not have benn more pleased with the hotel and staff. Valet parking was quite easy and check in was personable and problem free. I called a few days ahead of time and asked for king bed and high floor- both requests were granted. Our room on the 15th floor was quiet, clean and overlooked the Arch. We had a few driks in the bar after the game and service there was quick and attentative. After a very comfortable nights sleep, we checked out on the television. Concerierge pointed us in the right direction and we walked a few blocks to the 8th and Pine metro station for a train to the airport. For the price, location and service level, I would definitely stay here again.", "title": "The Perfect Place to Stay in St. Louis!", "user": "DeniseR4", "date": "October 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141732139}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "I recently stayed at the Hyatt/St. Louis for a travel convention. We enjoyed the central location and the streamlne efficiency of checking in to checking our bags, etc.. Everything was close from Starbucks to a variety of restaurants. The staff was helpful and very courteous.", "title": "Good value in St Louis", "user": "virtualtravelcoach", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141672084}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My husband and I went to St. Louis to begin a few days of relaxing for our anniversary. I booked this hotel on priceline and got a really good rate. I read all the trip advisor reviews and knew I had made the right choice. I would have booked it for two nites but my husband didn't want me to because he thought what if we werent happy there and were stuck so I figured if we liked it we would jump on priceline the next morning and book it again. Anyway, when we arrived to check in, I told the desk clerk that it was our 20th anniversary and asked if we could have a view of the arch, he responded that it would be a 30$ upgrade! I told him to forget it and what ever room he put us in would be just fine. I inquired about internet, also an upgrade. I can't remember right now what the 3rd upgrade was for, but it was something that you would assume came included. Anyway, no smiles, no greeters, no \"happy anniversary\" nothing. I felt like a number in this hotel and not one of the employees in the lobby acknowledged our presence. Sure, it was a nice room and all, but customer service is where its at. I worked for one of the best hotel chains in the world for over 7 yrs and customer service was their highest priority and it showed. ( I worked for the Ritz Carlton, Amelia Island) So, just comparing, I would have rather stayed at a lesser hotel and enjoyed great customer service than staying at this hotel and being snubbed right at the door. Needless to say, the next morning we checked out and went to another, and let me just say, the next hotel blew the hyatt out of the water with thier customer service. Sorry Hyatt, you just didn't make the cut. (my husbands birthday is in Dec and I am hoping to stay at the 2nd hotel because of the customer service we recieved!)", "title": "Nice hotel, poor customer service", "user": "cabogal66", "date": "October 7, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142180815}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Pluses:", "title": "Very solid big city quality, fabulous view and proximity to Gateway Arch", "user": "Woci", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142100968}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "- friendly staff, from front desk to restaurant waiters to conference organizers", "title": "One of the Best of downtown St. Louis", "user": "frankoma", "date": "October 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142006533}, {"rating": 4.0, "stay_parameters": "Stayed July 2012", "text": "- good quality room service food, half hour delivery guaranteed", "title": "Genuine American hotel", "user": "Eva H", "date": "October 3, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 141915516}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "- excellent breakfast buffet with many food choices", "title": "Great location and room", "user": "asturias2905", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 141879548}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Got the \"anti-allergy\" room, and I was very impressed. Clean and very comfortable with a lovely and large shower stall. Beautiful view of the Arch and downtown St. Louis as well as the Old Cathedral. Bed was super comfortable and I wish I could have brought it home with me. Great service all around.", "title": "Respire Room", "user": "TracyRochester_NY", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142598244}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "The people at this hotel were just awesome from start to finish. From the random housekeeper who graciously greeted us in the hallway to Mike in the Regency Lounge who was beyond exemplary (great local tips too) everyone wearing the Hyatt logo was professional and top notch. Our bellman rocked.", "title": "Truly exceptional hotel experience", "user": "HowardMemphis", "date": "October 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142526564}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "We got a great deal on a junior suite that became the perfect home for our family of four for a few days.", "title": "Great Downtown Hotel", "user": "AJFlorida", "date": "October 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142470236}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "The view of the arch from the Regency Lounge gives one a real sense of scale for that monument. Worth seeing.", "title": "Pricelined it for under $50/night, so it was a great place for a great price, and we will be back!", "user": "GoodIntenders", "date": "October 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 142261204}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "At checkout we had problem in that our promo room rate was not reflected on the bill. Fortunately we ha our confirmation email on my wife's phone. Once confirmed the staff fixed it immediately, and they were pleasant throughout. But keep your confirmation!", "title": "Great stay every time", "user": "travelfriendspr", "date": "October 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142252617}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 71, "average": 169, "very good": 435, "terrible": 38, "excellent": 573}, "aka": "Hyatt Regency St. Louis At The Arch Hotel Saint Louis", "slim_ranking": 0.162601626016, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "St. Louis Riverfront Hotel Experience uncompromising hospitality in a prime setting at Hyatt Regency St. Louis at The Arch. Steps from the famous Arch, our exemplary St. Louis hotel blends world-class service with an unparalleled location. With easy access to all of the city’s sights, our downtown hotel in St. Louis is an outstanding choice for every visitor. Select our expansive facilities - the area's premier event spaces - to host impressive business conferences, formal galas or family celebrations. Take in a game at a nearby stadium, catch a Broadway-style show, tempt Lady Luck at a casino, or simply relax in our inviting accommodations. Discover \"The Hyatt Touch\" at our welcoming St. Louis Missouri hotel."}