{"user_rating": 4.5, "review_count": 85, "name": "HYATT house Chicago/Naperville/Warrenville", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We stayed at the Hyatt House for an extended period last year during my husband's prostate cancer treatments. The experience was very positive. The service and amenities of this property make it a great place - all of which have been expressed in previous review. I am writing this review because I want people to know that the good service is not a fluke. We have returned twice for checkups in the past year, and each time are treated like returning family! When I call to make the reservation, they remember who I am, inquire how we are, etc. What great customer service!", "title": "They Treat You Like Family", "helpfulness": 1, "user": "gee_ess61", "date": "January 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150963854}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We typically like to stay place in suites or a condo when we travel. This was more like a mini-condo type, but extremely clean and well organized. One main reason we choose this place is because it's just a short drive to the city. We prefer not to be downtown due to higher rates on much smaller rooms and the parking fees and internet fees (in some instances).", "title": "A condo experience away from home", "user": "ChulitaTravelChica", "date": "January 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150138430}, {"rating": 5.0, "title": "Great experience!", "text": "The bedroom was closed off with a fairly large bathroom. One point to note, there could have been more hooks/places to hang towels and robes. That was a bit limited. The closet was located inside the bathroom. The bedroom was a descent size, but a bit cramped with additional luggage stored due the closet not having enough room for both of us.", "user": "Amy M", "date": "January 7, 2013", "id": 149130289}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The kitchen did not have a mini stove with an oven. For some reason, we neglected to get clarity prior to our arrival, because we thought that it was fully functional. Perhaps due the full refrigerator, we assumed that it included a complete stove. The range reminded me of hot plates, because it didn't evenly heat. We attempted to cook breakfast and it was a challenge. If we ever stayed again, we would definitely forego this activity. However, there is more than enough room in the frig to store items and one is able to heat up any leftovers in the microwave. Also, there is a Super Target not too far from the hotel for food shopping purposes.", "title": "O la la lovely!", "user": "jennyky1", "date": "December 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146937890}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "The living room area came with a small sectional sofa that was fairly comfortable. There was a lot of room to lounge and even play Wii with appropriate space.", "title": "SO LOUD", "helpfulness": 3, "user": "Michelle G", "date": "November 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 145775136}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "We always try to stay at Hyatt House when we travel to Naperville area. Very inviting, clean hotel. Great value for the amenities. Really good when we stay for several days - king 1 bedroom larger thant first apartment out of college!", "title": "Our home away from home", "helpfulness": 1, "user": "WillySpr", "date": "September 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 139519028}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We stayed in the Hyatt House's 2 bedroom, 2 bathroom suite when in town for a family wedding. It was wonderful. We (my husband and I and our three adult children) were all very comfortable. Our dog was accommodated. Breakfast was fantastic. The weekend price was very reasonable. It is spacious, clean, comfortably furnished. The front desk staff was excellent. Couldn't ask for more.", "title": "Great Space away from home", "user": "Karen A", "date": "September 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139375414}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Recently, we had the pleasure of spending 4 nights in the Chicago area and were extremely pleased with our stay. The hotel itself appears to be fairly new and very modern. Our room was on the 5th floor and was super quiet, clean, and comfortable. We had a king suite and everything was super clean and in new condition, from the fully equiped kitchen, to the sectional sofa and bedding. The only critical thing I can say about the place was that the breakfasts were kind of bland and boring. But hey, it's free so no big deal. We enjoyed staying here, and because of the cleanliness and the modern decor, this will be our hotel of choice when in the Naperville area.", "title": "Nice place. Our new hotel of choice.", "user": "kreskyhr", "date": "August 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 137890473}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Spend the night with my family as we were on our way to Cleveland. Very nice facility. Only issue was that the evening meal & breakfast were poorly maintained in the last hour of serving. Room was well maintained and desk staff helpful in locating a place to eat.", "title": "Worth the stop", "user": "Scotty M", "date": "August 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137500158}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This is a little island of paradise away from the craziness! We are so happy we found this hotel. It is stylish, very modern, and well-appointed beyond expectations. It is also comfortable, roomy, and exceedingly clean. My only little complaint was the breakfast which was a little too blah. I think they could kick it up a notch by adding in some granola or muesli cereal and offer a variety of fresh fruit. The regular old boxed stuff is all that was available--the kind with added sugar. The scrambled eggs were odd tasting. The other food was rather tasteless. We opted to go to another place for breakfast a couple of times. Other than that I have no issue with this! The front desk personnel were very helpful and friendly, and everything in our room was super!!", "title": "Fantastic hotel", "user": "Bastmuse", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136693889}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Travel a lot and usually select suites with a seperate bedroom from living area..generally Staybridge or Homewood Suites. Visiting daughter and decided to try this hotel. Very nice. Room 124 - 1 bedroom suite - $119 Per night (one of the best rates we've gotten for this type of suite). Good area - comfortable bed - all the amenities in the room - comfortable area to play with the lap top - nice staff - and decent breakfast buffet. Absolutely will stay here again.", "title": "Very nice and reasonable rates", "helpfulness": 1, "user": "KJW2011", "date": "June 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132175630}, {"rating": 5.0, "title": "Brand new and fresh hotel in naperville area", "text": "We had a great stay there, hotel is very fresh and quiet, the room was big and clean, the bed was very comfortable. Small kitchen and a full size refregiator was very nice. Big restroom had enough space for two adults. The location was very close to I-88 and it was very easy to get to all places in Naperville.", "helpfulness": 1, "user": "Coralville87", "date": "June 17, 2012", "id": 132137073}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Great rooms...we utilized two of the two bedroom suites for our girls volleyball team and the rooms were very clean and spacious...plenty of room for the girls to spread out. Nice to have breakfast each morning...they did rotate the main entries over 3 or 4 different selections (we were there for 5 nights). In-room kitchens had all the amenities you could possibly need, full size fridge, dishwasher, etc. Staff was always cheerful and accomodating...even providing items we needed on the last day that we forgot to purchase for our subsequent travels. Will definitely stay here again the next time we come up for a tournament!", "title": "Great stay for our volleyball team!", "helpfulness": 1, "user": "Jeff A", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131937595}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "This has become my \"go to\" place when working in Naperville! All rooms are suites with kitchen, living room, and two tv's. Got upgraded to a two room suite that had two bathrooms and bedrooms. Hotel is very clean, and includes free breakfast and evening meal with free beer and wine included. Close to other restaurants as well. Outside patio with grills and fire pit a plus. Although I go there on business trips, I will definitely return for a family trip to Chicago. You can easily park and catch the Metra into Chicago and have a lovely hotel to return to for a much cheaper rate than you would pay o. Downtown Chicago! Nice pool and fitness center too.", "title": "Great Stay!", "helpfulness": 2, "user": "Bertha55", "date": "June 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 131937374}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I highly recommend this hotel!", "title": "Amazing!!!", "helpfulness": 1, "user": "MLFsmiles13", "date": "June 3, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "rooms": 5.0, "value": 5.0}, "id": 131230552}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "This is an awesome property. I love the staff, I loved the rooms and I loved the location. I definitely recommend this hotel and plan to stay next time I am in the area. I guarantee that you will enjoy it.", "title": "AWESOMENESS!!!", "user": "businesstraveler212", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135336917}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "My family and I (4 adults and 2 kids) recently stayed at the Hyatt House. We stayed in a 2 bedroom suite. The suite was very clean and tidy, the staff was courteous at check in and were always glad to help when we approached them with questions. It was nice to have the breakfast included but wish that there was more variety. The kids loved the pool and I loved it too as it was very clean and not to busy. In all we have no complaints and would stay at this hotel again.", "title": "Exceeded expectations", "user": "ClaudBR", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 134916667}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My family and I stayed in this hotel for about a month in early 2011. The rooms were great (our 3-year-old was so excited to have his own king-sized bed), full-size kitchen with dining table that comfortably seated all of us, nice pool, snack times every weekday afternoon. The staff were always very friendly, especially when I locked the keys out of my running car one morning in the dead of winter. Everything was very modern and clean. My only issue was (at least at that time) there were no dressers in the bedrooms! Plenty of storage space in the kitchen, but no place to put clothes in the bedrooms. OK for a one-night stay, difficult for a month with three people. I recommend this highly to anyone who needs a long-term stay in the area.", "title": "Great long-term hotel for families", "helpfulness": 1, "user": "oneoverbeta", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133915994}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Everything was five-star! The room was very clean, comfortable, modern & spacious! The staff were upbeat and helpful! The breakfast was exceptional like going out to a very high class restaurant.Fresh everything. We had a dog and there were plenty of places to run her! Would stay there again in a heart beat!!", "title": "Fabulous!!!", "helpfulness": 1, "user": "J. R", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133765382}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Not only is the Hyatt House customer service EXEMPLARY, the property is beautiful! And, so pet friendly! Our puppy LOVED it! I've traveled extensively for work and pleasure for more than 20 years. I'm VERY particular about location, service, amenities and property condition. The Hyatt House, Warrenville, Illinois is spotlessly clean; you wouldn't even know it's a pet-friendly property!", "title": "OUTSTANDING Property and Service!", "helpfulness": 1, "user": "mom2maddie", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133074529}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 2, "average": 8, "very good": 19, "terrible": 3, "excellent": 53}, "aka": "Hyatt House Chicago / Naperville / Warrenville Hotel", "slim_ranking": 0.5}