{"user_rating": 4.0, "review_count": 900, "name": "Hyatt Regency San Antonio", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Hotel room was comfortable, environment was conducive and quiet but parking was expensive and on some nights difficult to find parking space and we were compelled to opt for valet parking. On one of the days, our room was not cleaned and beds were not made. We had to pay daily for high speed internet service and long distance call charges were ridiculously high.", "title": "Great hotel, not so great services", "user": "Jay_OMcKinney_Texas", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 34146651}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "You can't beat the location of this hotel, right on the Riverwalk with the Alamo just steps away, but it certainly didn't live up to its price tag. For almost $200 a night, we were stuck with two double beds when we were told over the phone they would be queen beds. Come to find out the hotel doesn't have rooms with two queen beds. The room was quite small. The beds were very hard and uncomfortable. The bathroom was nice, but small. No mini-fridge in the room, only a mini-bar where you automatically get charged if you move anything to put your leftovers or drinks in it.", "title": "Great location, but that's about it", "helpfulness": 1, "user": "SunshineHouston14", "date": "June 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 33004140}, {"rating": 5.0, "title": "Better Than it has to Be.....", "text": "I really felt like were were nickle and dimed to death. The room was not inexpensive, but we had to pay $30 a day for valet parking, $10 a day for Internet (what??? Charging for Internet?? This isn't Europe!!), $18 per person from the breakfast buffet.", "user": "Easy123", "date": "June 23, 2009", "id": 32937060}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "There are much nicer hotels on the Riverwalk. They may not be as well located, but they are certainly nicer, more comfortable and offer more emmenities.", "title": "Great location.", "user": "CaroleCass", "date": "June 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32502211}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "I can't say enough about the place. The Staff was really nice and the rooms were cold and very quiet and clean. I love triple sheets with the soft goose down pillows and a dark cold room to rest and get away for some good snoozing and R&R overall. The Riverwalk is out the elevator doors on one side and the Alamo is out the other. Phil Collins stays here to visit the Alamo as this is his new love in life these days, so you might see him...! One could spend weeks learning from its ruins and History told on that Day...", "title": "Absolutely perfect!", "helpfulness": 1, "user": "061910g", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32282889}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "When in San Antonio you can't miss the Riverwalk and what's better than a hotel where the River runs through the lobby? We've stayed here several times and you really cannot beat the location. On one side is the Riverwalk and the other side is the Alamo. Service is great and the rooms are clean and recently remodeled. Will stay here again.", "title": "Can't beat the location", "helpfulness": 1, "user": "vlfair", "date": "October 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45608408}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband and I went to San Antonio for our sons graduation from officers training. My husband suggested staying on the riverwalk because of its beauty and of course so we could tour the Alamo. We reserved a riverwalk view and were not disappointed. What a view day or night! The rate was $219/night but the view was worth it. The room was very nice, well appointed and clean. The staff were very nice and accomodating. We arrived quite early but were aloud to check in with no extra fees.", "title": "Very nice Riverwalk Tour", "user": "Marki2517", "date": "September 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45336603}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "There is a sky deck with a pool and a hot tub. Everyone should visit even if you don't want to swim. The view is spectacular especially at night. The pool itself is very tiny and not heated so was very cold. The hot tub was above ground and was hard to get in and out of, however, after a day of site seeing the hot tub was very relaxing to sit in.", "title": "Excellent location!", "user": "where2nxtmac", "date": "September 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 42488864}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The hotel does have a restaurant as well as a bar but we did not go to either as there is so many places right outside the back door. The lobby as well as the downstairs is spectacular with it's indoor/outdoor river. This hotel is amazing!", "title": "Good location but very noisy", "user": "LadyTravelsOften", "date": "August 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 37964176}, {"rating": 5.0, "title": "Excellent choice for a Vacation Destination", "text": "The Riverwalk is truly beautiful and very busy at night. So if you aren't a crowd person go out during the day. Two places you must eat if going to the Riverwalk are Boudros. The guacamole is made fresh at your table and should not be missed. And also the Texas, Land and Cattle. If you like Sirloin, try their signature smoke sirloin. Ummm, ummm, good!", "user": "qued99", "date": "August 17, 2009", "id": 37891044}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "This place is clean and has nice size rooms. Unfortunately, my room overlooked an indoor atrium with views into other people's rooms. I felt like I had no privacy when I opened my drapes, and if it weren't for the roomy size of the room, I would have felt claustrophobic and as if I were in a cave. I enjoy sunlight and didn't get any staying here. The restaurant was nice, but the lounge left a little to be desired. Very tiny bar area. And, $11 for 16 minutes of Internet was highway robbery! There is absolutely no excuse for that pricey of a service. The staff was very helpful and their service was excellent.", "title": "Nice but Expensive Internet and Bad Views", "user": "Irishgirl21N", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37878018}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The location right on the riverwalk is the best. The property is a little dated and could use a general overhaul. It is typical Hyatt which isn't bad but is a bit of a cold environment that is very 60ish. I had a very ordinary room, but comfortable. Hallway sound easily filtrated into the room. There was some inconsistancy on the part of service provided by the staff.", "title": "Location, location, location", "user": "calflyer80", "date": "August 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 37847856}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The British Pub onsite was very unfriendly and seemed very uninterested in service. I was told it was seperate from the hotel, in which case, I will not hold the hotel accountable.", "title": "Fantastic service, great view and location", "helpfulness": 1, "user": "GD2004", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37107628}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I have made several businesstrips to San Antonio and have found it to be rather over hyped. The riverwalk is really not a big deal and I would hardly call it a river. But, if you feel the need to be on the \"river\". The Hyatt is the place to stay and you should find it comfortable and well served.", "title": "*Excellent* location, ambience, service, price, rooms, and food", "user": "momtomonkeys", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35042120}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This is a very nice hotel with well laid out, good size rooms and fantastic alamo view. It's right on river walk. The staff could not be nicer. We had a stopped sink, which after two tries to repair it we just said let it go. To make up for this, they gave us fruit and cheese plate, wine, breakfast the next day and a discount. They were so incredibly nice and apologetic. I have never seen anyone treat a problem both so seriously and so generously. Loved the leather chair. Loved the view, the food (room service salads) was excellent as was breakfast buffet. As to parking, not as difficult to self park as I feared and sure the parking fee was awfully high but its no different anywhere on riverwalk (altho why that is so i don't know - its hardly nyc). my only less that stellar comment is that the pool on the roof is smaller than it looks on the hotel website, and tends to get very overcrowded.", "title": "July 4th stay at Hyatt", "user": "coloradosummer", "date": "July 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 34273780}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I live in San Antonio and I took my children (ages 8 and 12) to the Hyatt for two night on April 23 & 24 for Fiesta (an annual celebration in San Antonio). Being a teacher, I got a rate of $112 a night. The hotel was great. I had not been in it for several years but it looked as though it had been updated. Nice lobby and check in was a breeze. We got a room on the 5th floor and from the room we could see about the top third of the Alamo. Some rooms have an alternate view of the Riverwalk. Room as clean and very nice. Beds were comfortable. Only slight negative with room is bathroom was VERY small. Only one person at a time could be in it and when the bathroom door is being opened, there is only literally about half an inch between the door and the toilet. We ate the buffet breakfast at the hotel restaurant, Chaps. Nice but a bit pricy - $18.95 a person. Nothing fancy. Took kids to the pool. Hotel website says it is heated. It is not. Plus, it is very, very small. Hotel is great location. Everything is in walking distance. Also, just FYI - in the lowest level of the hotel there is a british restaurant/bar called Mad Dogs. I took my kids there for hamburgers. Big mistake. Goodness - the waitresses were dressed as if they worked at a strip joint. EVERYTHING was hanging out. Looked very tacky. They make Hooters waitresses look like nuns. However, overall, good hotel and very friendly staff.", "title": "Locals Playing Tourists at Great Hotel", "helpfulness": 3, "user": "AlamoCityLady", "date": "April 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29099898}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "They Hyatt on the Riverwalk was wonderful. The location, room, restaurant and the entertainment at the Landing was the icing on the cake. It made for a perfect vacation.", "title": "Perfection on the River Walk", "helpfulness": 1, "user": "SJM6", "date": "April 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28620033}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Great location on the riverwalk and located directly in front of The Alamo! Great staff and overall a great place to stay.", "title": "Location, Location, Location!", "user": "RoofingAdvantage", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28507740}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "My best friend and I stayed at Hyatt Regency for a girls getaway for three nights. We read many reviews about the noise and asking for a higher floor and better view, but regardless of all that we took a room on the 2nd floor near the elevator. We really had no problems with noise as the hotel did not seem that busy, you could hear voices in the hall, but that was expected. Rooms were clean, housekeeping was wonderful as I contracted pink eye while there, I asked them to come change the sheets on both beds and they did within 30 minutes!", "title": "Great girls vacation!", "helpfulness": 1, "user": "mellyjo00", "date": "April 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 28106763}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "We only ate at the hotel once in the 3 days we stayed, and we had the buffet breakfast... It was OK- not great, not terrible.... and pricey, I believe it was 18.00 per person.", "title": "Everything I needed in a hotel", "helpfulness": 1, "user": "PharmaTraveller", "date": "April 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 27999305}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 4, "variance": {"poor": 37, "average": 102, "very good": 312, "terrible": 32, "excellent": 417}, "aka": "Hyatt Regency San Antonio Hotel San Antonio", "slim_ranking": 0.0948275862069, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Experience the heart of the Riverwalk at Hyatt Regency San Antonio. We are the only San Antonio Riverwalk hotel directly overlooking the historic Alamo and on the Riverwalk, connecting two of San Antonio's top destinations through our 16 story atrium lobby. Be the center of our attention while you are in the center of the action taking advantage of our unequaled location in the heart of dining and entertainment venues surrounding our Riverwalk hotel."}