{"user_rating": 3.5, "review_count": 385, "name": "Hyatt Regency Santa Clara", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We attended a relative's wedding in Santa Clara. We chose the Hyatt because they had a promotion. Everything about the hotel was beautiful. The front desk employees were courteous and helpful. The fitness center was well-equipped. The only thing I wished they had was free wireless Internet connection,", "title": "Beautiful hotel with excellent customer services.", "user": "lindagriffin", "date": "October 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46341800}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Stayed at the Hyatt Regency Santa Clara last night, not too impressed, will not be back. I'm confused why would a hotel in the heart of Silicon Valley with high tech titans such as Yahoo, Google, Cisco System down the street have poor internet service. The T-mobile hot spot was, ok to slow, low bandwidth, took for ever from some sites to load. Spent 30 minutes on the phone with CS to try to get it to work faster, no luck. Front Desk was no help at all, gave me the deer in the headlights look, they were ZERO help. BTW brand new MacBook Pro no problems at any hotel, airport, coffee shop, etc. Was unable to get my work done at this \"business hotel?\", so I checked out went to a Hyatt Place in Fremont where the wireless service worked like a charm. Dear Hyatt if your going to have a hotel in the high tech capital of the world it should provide top of the line, hassle free internet service. You front desk also need to be trained on how to help guest when they are having trouble with a service IN YOUR HOTEL, they should not just stand there and give you the I dunno what to do look. One of the worst Hyatt's for business.", "title": "I would expect more for a Silicon Valley Buisness Hotel", "helpfulness": 2, "user": "klarkent", "date": "October 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 45815217}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I just completed my third stay (and fourth week) at this hotel this year. I like it because it's close to my office, the service is good and always very friendly, the rooms are well-appointed, stylish, comfortable and clean, and it's hyatt-predictability all-around. i find the lack of food options an issue and the 'fresca' restaurant is below average; hoewver, the room service is good and fast (try to cobb salad which I can highly recommend for a solo dinner in the room). The hotel could use a good coffee bar. What i don't like about the hotel is the parking situation -- often the front lot fills up and you have to park in the back convention center parking structure. Also, when there are large conventions, the hotel really fills up and the elevators get very, very slow as a result. But, overall would definitely recommend the hotel if you need to stay in the Santa Clara area; I'll be staying there again.", "title": "Comfortable Business hotel", "user": "atrejseeratleve", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 40522331}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We stayed here one night on our honeymoon when we were attending a concert at Shoreline Amptheater. I mentioned upon check in that this was our honeymoon and noticed, when we arrived at our room, that they had put us in a corner room with a nice view. Room was huge, spotlessly clean, and the bed extremely comfortable.", "title": "fantastic hotel!", "helpfulness": 1, "user": "desertgirlmel", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38015468}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "A great nearby discovery was Rivermark Plaza, located about 2-3 miles away from the hotel. Lots of different reasonably priced restaurants, at least one bank, and a Safeway. I'd definately recommend stopping here if you want food other than what the hotel has to offer.", "title": "Nice business hotel, Full of conventioners", "user": "novicevacationer7", "date": "August 2, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 36511490}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "This was a generally good stay with no major problems. Somewhat overpriced considering the area. Beautifully decorated and elegant architecture.", "title": "Good stay. Luxurious Rooms. Enjoyable stay. Overpriced however.", "user": "somelikeithotEL", "date": "March 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 58165768}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The best quality of this Hyatt is the staff. Every single person was friendly, helpful, professional. The next best quality of this hotel is the proximity to the Santa Clara Convention Center.", "title": "Mixed Review", "user": "delledge", "date": "February 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 56924269}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "From there, certain aspects of this hotel begin to decline. For a convention hotel serving a large convention center, more restaurants should be on site. I was surprised that only one, small sit down restaurant is there, plus a lobby bar with limited food service hours. Our convention was fairly small, yet there was always a 25-45 minute wait for the restaurant for lunch and dinner. Other than this hotel and a neighboring Hilton, the next closest restaurants require transportation.", "title": "Great for events at the convention center.", "user": "URBANLUVER9", "date": "January 23, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 54144190}, {"rating": 5.0, "title": "Wonderful", "text": "As for the room, mine was spacious and the room temperature was easy to make comfortable. The shower was great and bed was pretty good, but not the best I have ever experienced. TV remote was partially not functioning. Walls to hallway and neighboring rooms are thin. I found the sound from both sources uncomfortable, so I had to use my portable sound soother to help block door slamming, coughing, conversations, etc.", "user": "mherpich", "date": "January 14, 2010", "id": 53489160}, {"rating": 3.0, "title": "great location but not the westin anymore", "text": "Upon arrival, I found a few strands of hair in the shower, yet all other aspects of the room seemed clean. The soap, shampoo, and lotion products were quite perfumy for my conservative tastes, so I had to walk to a convenience store (5 min walk) to purchase my own.", "user": "skhemka", "date": "December 5, 2009", "id": 50664835}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "My wife and I stayed two nights here for a convention. It has been recently remodeled, with the lobby featuring attractive wood paneling, and kiosks so that you may print out your boarding passes prior to departing for the airport. The hotel sits adjacent to the Santa Clara Convention Center and Tech Mart, across the street from Great America, and close to many leading internet company headquarters and the 101 highway. It is also convenient to the VTA trolley system.", "title": "Generic convention hotel", "user": "volvo99", "date": "April 7, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 14860511}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Rooms are spacious and walls seem to capture sound well. However, the departure route from San Jose International Airport goes right over the hotel. In accordance with comments regarding the recent renovations, the new sinks look just like the sinks at the pier that fisherman clean their catch with, and the spigot to the right wastes countertop space.", "title": "Wonderful Stay - the staff is exceptional!!", "user": "Cali2", "date": "March 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 14642366, "likes": {"liked": "— The Staff was absolutely wonderful - very friendly and very helpful. Rooms were spotless", "disliked": "— Not enough restaurants in the area"}}, {"rating": 4.0, "title": "Recommended", "text": "We loved this hotel. We had to be in the area for business and it worked perfectly. The rooms were large and clean and the staff was outstanding. The only negative for us were the lack of restaurants in the area. There were some - but not many. We still would highly recommend this hotel.", "user": "LolaMaria", "date": "March 24, 2008", "id": 14492478}, {"rating": 2.0, "stay_parameters": "Stayed February 2008", "text": "I stayed for 3 nights while on business. I was very pleased with the quality of the room and the service. I was alarmed when I first saw the decor of the hallways -- it seemed outdated. But the lobby is great, and the room was very comfortable and modern. The room service menu is decent and the breakfast at Tresca was good, although a bit pricey.", "title": "I expected better for the money", "helpfulness": 2, "user": "DaveJAustralia", "date": "February 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 13924368}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My only complaint (not just with this hotel, but with all Hyatts) is that you have to pay to access the Internet. Oh, and I had reserved a king room, but they were out (what's the point of the reservation, then? Maybe it was because I used the AAA rate).", "title": "Great deal off of Priceline", "user": "alekea", "date": "February 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13605658, "likes": {"liked": "— comfort, location and price", "disliked": "— I only spent one night there."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "I stayed here because I was going to a conference at the convention center. It was extremely convenient and I could walk back to my room for the 30 minute breaks we had, which was nice. The staff was very accommodating and helpful when I had questions or special requests. The alarm clocks have docks for plugging in your iPod (I thought that was neat).", "title": "Comfy bed, good location", "user": "LCoolWatr", "date": "November 17, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 49417111}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I ate at the lobby bar most evenings. Service was average, food was pretty good. I ordered room service for breakfast every morning and they were always 5 minutes early (good in my opinion).", "title": "Good business hotel", "user": "ExpTravellerOulu", "date": "November 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49128927}, {"rating": 4.0, "title": "Good conference hotel", "text": "Internet access is $10/day. Not outrageous, but I know other hotels offer free wifi, and for a hotel that caters to business travelers, it would be a really nice bonus if it were free.", "user": "cstreit2000", "date": "November 11, 2009", "id": 48958069}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I used the gym all three days I stayed here. Each cardo machine has its own TV so you don't have to stare at the blank walls while you work out. There are a few weight machines and an area for stretching. They also give you a workout towel and cool water.", "title": "Modern, Very Comfortable beds and everything we needed.", "user": "Foxden", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48859022}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The down sides: the doors to the rooms are extremely noisy, so make sure you have ear plugs! I'm a pretty heavy sleeper, but every morning starting at around 6, there were doors slamming shut every 5 minutes and it woke me up the first morning. There were also some dirty spots in the bathroom, a small stain on the bed spread and one of the bases of the nightstands was broken and cracking. In my opinion, those are small things that should not have been there, so I bumped the Cleanliness score down one. Other than that, the room was clean.", "title": "poor service", "helpfulness": 2, "user": "dennis42066", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 47839822}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I stayed here for 3 nights for a recent business trip to the area. I've stayed here before and always had a good experience. The hotel caters to business travelers as its core customers.", "title": "Very nice hotel for the business traveler", "user": "ibeplato", "date": "February 12, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13511104, "likes": {"liked": "— Location, excellent fitness center and breakfast buffet", "disliked": "— No safe in the room, no mini-bar"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I stayed here for a weeklong conference at the adjacent, attached Santa Clara Convention Center in mid April.", "title": "Good convention hotel with bad wired Internet", "user": "codelemur", "date": "April 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 61817015}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "As convention center hotels go, it's pretty standard. Rooms are functionally appointed. TV has about 30 stations, including HBO. There's a business center in the lobby where you can print boarding passes and such. Parking is FREE, which is a major plus and may be the first convention center hotel in years I've encountered with free parking. This might be due to nothing really being in the immediate vicinity of the hotel in regards to food or shopping. Either way, if you don't want to drive, VTA light rail has a stop right in front of the hotel.", "title": "Solid, but small", "helpfulness": 2, "user": "talent_guy", "date": "April 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 60122302}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The hotel restaurant is average, but VERY expensive ($18 for a breakfast buffet? Really?). The bar has a good selection of beers and liquors, but could use more waitstaff during big events.", "title": "Top Notch Santa Clara Accomodations", "user": "HoopyKat", "date": "March 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 59978247}, {"rating": 5.0, "title": "Excellent", "text": "The one frustrating thing I found is that the wired hotel Internet (not the wireless, which is administered by T-mobile) blocks ALL ports EXCEPT 80 and 443. This means NO email, VPN, SSH, or anything else not web-based. And they don't tell you about this before you buy, so I ended up with a week's worth of crippled Internet access with no way to get a refund. For $12.95 a day, this is kind of a ripoff, so consider yourself warned. If you need to do anything useful on the Internet while at this hotel, use the wireless.", "user": "scott285", "date": "March 16, 2010", "id": 58773146}, {"rating": 5.0, "title": "Beautiful big rooms :-)", "text": "Huge conference hotel with nice lobby area. Rooms are on the small side and minimally furnished, as if they thought smaller furniture would make the rooms seem larger. No coat closet -- a u-shaped bar with hangers instead. Marriott and Hilton also on same road -- all about the same but Hyatt is furthest from the freeway.", "user": "Heiko K", "date": "March 12, 2010", "id": 58396349}], "location": {"country": "United States", "city": "Santa Clara"}, "stars": 4, "variance": {"poor": 30, "average": 90, "very good": 146, "terrible": 17, "excellent": 102}, "aka": "Hyatt Regency Santa Clara Hotel Santa Clara", "slim_ranking": 0.272727272727, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Hyatt Regency Santa Clara combines luxury and service with a premier location. Our newly renovated Santa Clara hotel accommodations feature the Hyatt Grand Bed, high-speed Internet access, deluxe amenities and sweeping views. A selection of inviting restaurants offers a variety of cuisine, from classic American to Sushi. Take advantage of extensive meeting facilities and 24-hour business center to make every stay at this Hyatt hotel in Santa Clara a success. With its unmatched service and ideal location - connected to the Convention Center, in the heart of the Silicon Valley and near the Great America Theme Park - you'll discover why we are the premier choice among Santa Clara, California hotels."}