{"user_rating": 3.5, "review_count": 448, "name": "Hyatt Regency Bethesda", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I recently stayed at the Hyatt Regency while visiting D.C. and Philadelphia and got a great deal on Hotwire.", "title": "Great Hyatt Regency experience (as usual!)", "helpfulness": 1, "user": "coolcaesar", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20359577, "likes": {"liked": "— Clean, comfortable accommodations, good value for the money", "disliked": "— Expensive parking"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The room offered the typical Hyatt Regency experience, meaning that it was perfect---totally quiet and clean and pleasant in every way and with no funny odors. The hotel literally sits on top of the Metro station and also features a huge underground parking garage. Although the rooms are all accessed from hallways running around the vast central atrium (typical of Hyatts), there's no echoes so when in the room you don't hear any noise through the door coming from the lobby down below. The check in and check out process was quick and efficient. Furthermore, like much of suburban Maryland, Bethesda is much safer than D.C. itself and there are many people out and about on the streets well into the night.", "title": "Next time, I'll stay in DC", "user": "MetsFaninPhilly", "date": "September 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 19840457, "likes": {"liked": "— Rooms are big", "disliked": "— Rooms are old and frayed"}}, {"rating": 5.0, "title": "Real Deal Holyfield", "text": "Now the downsides, which are minor. The first one, as other reviewers have noted, is that they charge you for parking and they charge even more if you want to go in and out. This wasn't an issue for me because I stayed only one night and I took care of everything I needed to take care of before checking in.", "user": "wahoo59", "date": "May 20, 2008", "id": 16224779}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The second one is that there's not much of a view, but then the entire Washington, D.C. area doesn't have much of a skyline to begin with.", "title": "Ok Stay at the Hyatt Regency Bethesda", "helpfulness": 1, "user": "bethke14", "date": "May 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16033655}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The third one is that there's not much to do in Bethesda. This wasn't an issue for me because I was driving around the D.C./Baltimore corridor and I deliberately chose a hotel in the Bethesda area to save money (as opposed to the more expensive hotels in the urban core). But if you're not renting a car and your main purpose is to see D.C., you might get tired of riding back and forth on the Metro train.", "title": "Excellent Choice for a D.C. trip", "user": "cbce1pjb", "date": "May 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15608644, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "This business hotel is in the heart of Bethesda and on the metro line. There are great restaurants and shops just walking distance away, and even a Safeway and CVS right across the street. It is the noisiest hotel; the walls are paper thin. You can hear your neighbors talking and the showers running bright and early in the morning and I mean 5 am on Sunday. The hotel rooms are centered around the lobby and up: so guess what you hear the lobby parties and traffic. The hotel has not aged well, has old TVs, no HBO, and is dirty. The beds sag, linens are mediocre, and towels are tolerable.", "title": "Noisy, Dirty, and Old", "helpfulness": 2, "user": "MarianaG", "date": "July 12, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 34570914}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I am a Hyatt member and was told I could check in 11 am on a Saturday and there were lots of rooms. I even called the night before. Get here at noon and was told that there were no rooms. I had to tell them about my conversation with the front desk the night before and WOW I got a room.", "title": "NOT 100% smoke-free!!", "helpfulness": 1, "user": "malawimike", "date": "June 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33331057}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "I was here for a week-long work meeting with about 400 people. The hotel billed itself as smoke-free, yet I kept smelling smoke in my room all week. I though it was coming from the stairwell near my room, assuming it was from employees sneaking smokes in the stairwell to avoid the nasty weather outside. The last night it was so bad I got up in the middle of the night and went out of my room in my underwear to see if someone was in the hallway smoking. On checkout, I complained to the front desk. The man apologized and said I was right next t one of the 5 smoking rooms in the hotel. This really angered me, as we (the hosts of the meeting) were told it was smoke free. I was not given any compensation, but did receive the apology. Doubt I will stay there again because of this incident", "title": "Much Better Than Last Time", "user": "jkaz0000", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32650182}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Everything else: meeting rooms, housekeeping, cleanliness, etc. were as would be expected. Business center computers were so slow they were not worthy of the time it took to go to the top floor to use them.", "title": "Perfect location for NIH visitors but not aging gracefully", "helpfulness": 3, "user": "MDDad", "date": "June 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 32418989}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Sorry for the late review. I stayed here in May 2008 for two nights. It was MUCH better than the first time I stayed here. Everything was perfect. I used the fitness room this time and found it well equipped for a hotel. I don't have any complaints on this visit. I would definitely recommend this hotel. I look forward to visiting again.", "title": "Great buy", "helpfulness": 1, "user": "Hotwireuser", "date": "April 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27694726}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This was the hotel that we chose for our wedding. In terms of pricing and arranging a wedding package, the hotel was really decent. They dropped the price significantly over the weekend that our wedding guests would be in town, making for a very affordable stay for our guests.", "title": "Decent Hotel, Poor Attention To Detail", "helpfulness": 2, "user": "neimanmarxist", "date": "January 14, 2009", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 23557044, "likes": {"liked": "— beautiful terrace", "disliked": "— inconsiderate and disorganized staff."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "However, the hotel routinely bungled a number of matters. The worst was that they woke me up at six a.m. on the morning of my wedding- I was *exhausted* from all the festivities- to make inquiries about what time the masseuse should be coming to my room- i had booked a massage for 10 a.m. on the day of the wedding.", "title": "Nice place", "user": "MichiganFloyd", "date": "October 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 21176275, "likes": {"liked": "— proximity to the Metro station", "disliked": "— internet fee and access"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "They woke me UP! AT SIX A.M.! to confirm the details of this spa service. I was furious. I couldn't get back to sleep, and it was just not a great way to start the day. I was more tired than I would have been otherwise thanks to this hotel's inconsiderate staff.", "title": "Good hotel, close to metro", "user": "davidmartinomalley", "date": "October 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 20736385, "likes": {"liked": "— Proximity to Metro", "disliked": "— Pool / fitness center (under renovation at the time)"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Oh, and then the masseuse never showed up.", "title": "Great Stay at the Hyatt Regency", "helpfulness": 2, "user": "nbparents", "date": "October 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20561303, "likes": {"liked": "— The metro stops at the hotel!", "disliked": "— that I had to pay for underground parking, but its relatively cheap in comparison to others. $10"}}, {"rating": 5.0, "title": "So fresh and so clean clean!", "text": "So i called and pictched a fit. I got 2 nights for free, so they were trying to atone for the error, but seriously. We managed to rent out 100 + rooms for them for our wedding, and they couldn't desist from phoning me re. details of a service I booked through them at SIX O'CLOCK in the morning on the day of my wedding? ridiculous. In that regard, the property is fairly poorly managed. Also, they gave my BFF a pretty crappy room . They let her switch until she got one she liked, though.", "user": "VannaRae", "date": "October 1, 2008", "id": 20536743}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "This property was very disappointing. It was more of a low grade conference hotel than anything else. Rooms smelled badly (we had to switch rooms because the first one gave us headaches), they were dark, with ugly badly maintained furniture. Breakfast was served with plastic cutlery and plastic cups. The location next to the metro was practical though. Next time I’ll choose one of the better options in the city center, even if we have family living near this property.", "title": "Don't get too high expectation", "helpfulness": 1, "user": "latinafrica", "date": "March 24, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 26736778}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The Hyatt Regency Bethesda is clearly a hotel directed at business travelers.", "title": "Can't believe they charge for internet!", "helpfulness": 1, "user": "londonfog45", "date": "February 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 25236936}, {"rating": 1.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "However, they charge $10/day for s-l-o-w Internet access in your room.", "title": "Who would have guessed?", "helpfulness": 5, "user": "Kemeko", "date": "February 26, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 25210463}, {"rating": 5.0, "title": "Excellent location", "text": "Not even the discount hotel chains charge for Internet anymore!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 24, 2009", "id": 25060260}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "The decor in the rooms is fine...your average hotel look. However, the heating unit in the room was ancient and so noisy that it kept me up a good part of the night.", "title": "Can't beat the convenience.", "helpfulness": 1, "user": "NavyDawg", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 23973604}], "location": {"country": "United States", "city": "Bethesda"}, "stars": 3.5, "variance": {"poor": 65, "average": 141, "very good": 147, "terrible": 21, "excellent": 74}, "aka": "Hyatt Regency Bethesda Hotel Bethesda", "slim_ranking": 0.666666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "A beautiful 12-story atrium welcomes guests to 390 luxurious guestrooms and suites, located directly above the Metro Red Line's Bethesda stop, just 6 miles from the White House. Hyatt Regency Bethesda is located in the heart of downtown Bethesda, one of the most renowned communities in the Washington, D.C. metropolitan area. Bethesda is well known as a lively chic destination with over 200 ethnic restaurants, boutiques, local art galleries and trendy hot spots, all within walking distance of the hotel. Bethesda is also home to many associations and corporations, such as The National Institutes of Health (NIH) and the National Naval Medical Center. Hyatt Regency Bethesda is also nearby Suburban Hospital, Lockheed Martin, Chevy Chase Bank Headquarters, and Clark Construction."}