{"user_rating": 4.5, "review_count": 444, "name": "Hyatt Place Seattle/Downtown", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I'm a Hyatt fan - many happy stays at many Hyatts over many years. Stayed at a Hyatt Place in Boise recently and had a great stay. This Seattle stay was one of my few significant Hyatt disappointments. Part of the problem is the location: it is apparently a hot spot for large family gatherings headed to the Seattle Center, so there are mobs of people and lots of noise. (Room noise was not a problem, however.) One of two elevators was out, so most rides were with a full crew of people who had to wait too long and weren't happy. The complimentary breakfast was a complete disaster: we arrived 30 minutes before it ended and there was, literally, no food except for a few grapefruit slices (the other two fruits bowls were empty), half a bowl of cereal (the other five cereal dispensers were completely empty), and some milk. Bagels appeared after about five minutes. Dirty dishes on lots of tables because the area for leaving them was full. I then talked to someone who appeared to be in charge who gave me a list of reasons why the situation was such a mess (\"things get really busy in the last half hour\" and \"we only opened a month ago\" etc.) , but nothing changed except that he filled some cereal dispensers. Parking is incredibly confusing: guests end up in the parking garage explaining to each other how to get in and out. And the room closet is a complete mystery: it is tiny, you can't really reach half of it, and it is not even as deep as a normal hanger, so you can't slide the door closed without turning the hanging clothes sideways. (No exaggeration.) The air conditioner is about 1 1/2 feet from the bottom end of the bed and you can't divert the air flow. (Good luck figuring out the thermostat, too.) We highly recommend the Hyatt Regency Bellevue -- not downtown Seattle, but always excellent service and comfort with prices comparable to this Hyatt Place and lower than the other two Seattle Hyatts. .", "title": "Hectic and disorganized", "helpfulness": 3, "user": "hcajones", "date": "July 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 72472130}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "What a nice place! Nice clean. bright rooms, good internet and breakfast. We walked to Pikes Place Market and Capitol Hill easily. A great location. Secure $10 a night parking. We definitely will return!!", "title": "Wonderful", "user": "yachtchefKeyLargo", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71843494}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We decided to stay at Hyatt Place because it was a lot cheaper the the other 2 hyatt hotels. We knew right away why it was so cheap, because it automaticly gives you 1 king bed but we needed 2 queen so we emailed them and asked for a room with 2 queen beds like a month before! Then when we checked in the lady told us that you have a 1 king and a pull out bed then we showed here the email printed out and she said that there was no 2 queen beds left!!!So we took the 1 king room!!!The lady gave us FREE parking because of what happened and when we got to our room you could totaly see the Space Needle!!! The night's sleep was sooooo nosie the fire engines all night long!!! The comp. breakfast was ok not to much to choose from if you wanted some eggs or bacon you had to pay!!!! Well it was very close to the Space Needle plus it hade a FREE computer center plus a snack bar but you had to pay there!!!! Over all it was a pretty good for a 1 night's stay!!!", "title": "A little nosie but nice and clean!!", "helpfulness": 1, "user": "Canada024", "date": "July 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 71356031}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "This is a brand new place within walking distance of the Space Needle and the monorail. The staff were pleasant and helpful, especially with regard to directions to nearby places to see and eat. Our room was perfect, and bigger than we expected. Everything in this hotel is new and clean. There is a small indoor pool, which my kids enjoyed. Wifi is free and there are also free computers to use in the lobby. Parking is nextdoor in a parking garage which connects to the hotel underground and is shared by a condo complex. It cost us $10 per day, which is actually much cheaper than other hotels in the area.", "title": "Great new place to stay in Seattle!", "helpfulness": 2, "user": "psycprof97", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71252555}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "There is a continental breakfast each morning, which is adequate but you can pay to upgrade if needed. We ate what was included with the room because the upgrade for eggs, bacon, and other hot foods were rather expensive. Speaking of food, the frontdesk maintains a small snack area with desserts, drinks, and the like, which are nice but somewhat costly. A cheaper alternative is to walk across the street to the new Walgreens and buy something there.", "title": "Brand New, Great Location, Would Stay Again", "helpfulness": 1, "user": "thegov", "date": "July 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70409753}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I will start with the positives: This is a brand new hotel so the rooms are in excellent condition. The beds are comfy and the room has a nice large flat screen television. It is within walking distance to the Space Needle. The staff was very nice. The gym was excellent. The negatives: The breakfast is one of the worst continental breakfasts of any hotel I have stayed in. They could use another toaster and they were constantly out of everything and it was a very limited selection. The pool was freezing; mainly children were in it because the adults all felt it was way too cold. I guess they are trying to go on this plan where people check themselves in but it does not really work. People still come to the desk and the front desk employee is supposed to be a cook and front desk person so the waits were long at the front desk. Our keys would not work to the elevators and doors four different times so this wait at the front desk was very inconvenient. You would wait at the desk for them to be heating up cinnamon rolls for another guest. (Part of their job) This would be acceptable at a budget hotel, but not somewhere that is nearly $200 per night. Hopefully, in time they will work out their quirks. Normally, I would have given them a much lower rating but the staffs there is very nice and so were the rooms but be prepared for the negatives I mentioned.", "title": "Very nice rooms and staff, breakfast poor, some problems", "helpfulness": 1, "user": "GTechMom", "date": "July 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69833876}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We stayed in a mini suite with a sitting area and view of Puget Sound and the Space Needle that was tastefully decorated with a good choice of colors. The bed was comfortable and the bath had a great walk-in shower. We couldn't hear any noise from outside and had a terrific night's sleep. The have a very friendly staff, large lobby, and dining area, While they don't have room service, you can order food 24 hours a day and pick it up from the lobby area. The downsides are that the staff are still learning about the hotel, the windows don't open, the free breakfast is nothing special, and the location is a bit far from downtown cultural attractions and sport stadiums.", "title": "New and quiet place to stay next to Seattle Center", "user": "Louise55555", "date": "June 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 67137988}], "location": {"country": "United States", "city": "Seattle"}, "stars": 3, "variance": {"poor": 9, "average": 43, "very good": 138, "terrible": 4, "excellent": 250}, "aka": "Hyatt Place Seattle/Downtown Hotel Seattle", "slim_ranking": 0.182795698925, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}