{"user_rating": 4.0, "review_count": 820, "name": "Hyatt Regency Chesapeake Bay Golf Resort, Spa & Marina", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "The resort was very nice and the outdoor walkways and pool areas were very relaxing and beautiful. The rooms were modern and comfortable. Overall, a great place to stay.", "title": "Beautiful location", "user": "Louisville-Lindsay", "date": "July 9, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 34336858}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Took the kids for an end of school year weekend and husband for a Father's Day retreat. We had a great time. The hotel was well kept and the staff friendly and helpful. What I would have done differently - parked ourselves - really not a far walk; had dinner at Blue Point Provisioning both nights - a great meal; had a spa treatment; stayed longer. What we liked: husband and son loved the golf course, kids loved the pools including the Dive In Movie at night, the mini golf, the nature; we all loved diner at the Blue Point, the room, the grounds.", "title": "Great Weekend", "user": "jbg123", "date": "June 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 32879168}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "I spent a Humiliating weekend at this resort with my wife over Memorial Day weekend. Completely rude staff that are accusatory and the hotel was in shambles the first weekend of the summer. Completely pathetic response on behalf of Hyatt Guest Relations and a true mark of pathetic Customer Relations. Exactly why Hyatt will never be a premiere hotel chain. Their empowerment program is a complete joke and just a front that basically someone can bring you a paper if you would like. Never go here!!!!", "title": "Horrible experience-Empowerment Program is a joke.", "helpfulness": 1, "user": "ashanna1", "date": "June 18, 2009", "detail_rating": {"cleanliness": 3.0, "location": 1.0, "value": 1.0, "rooms": 2.0}, "id": 32619735}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "My wife and two kids (ages 13 and 10) and I came here for a family getaway, and we were delighted at all the features that kept all of us entertained. The kids both enjoyed the dive-in movie, miniature golf, the pools (the 13-year-old was fond of the hot tub), the ping-pong and air hockey tables, making smores in the evening at the outdoor fireplace, and even just taking a walk out on the pier.", "title": "Great Family Getaway", "user": "wildcatmass", "date": "June 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32401973}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The room was larger than I expected, and recently and beautifully renovated. We had a gorgeous water view.", "title": "Glad I chose to Stay Here", "user": "ExecAssist", "date": "June 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32148145}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The rooms, grounds, pools, and hotel are all in great shape and very comfortable. We stayed three nights which was just perfect. My husband and I traveled alone but it seems most people brought kids...lots of kids, and they didn't always supervise them so it could get very noisy and routy at times. The hotel seems to really cater to corporate groups and they seem to come first. We had to leave our seat by one of the pools when they wanted to set up for a large corporate group...no apologies...just \"you have to leave.\" Even though we were paying over $300 a night we kind of felt like second class citizens! But overall we had a nice, relaxing time and our room had a lovely view of the river.", "title": "Pricey but nice!", "user": "Dreaming", "date": "July 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 36228089}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Had a great time with my entire family there ! They had something for everyone from aged grand parents to young children. I stayed 3 days and it was just perfect.. Large swimming pools, miniture golf, billards, ping pong table, gym, air hocky table, and etc etc etc...", "title": "Great Family vacation spot with golfers in mind...", "user": "saavytravelor", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35919130}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Beware of balcony rooms at front of hotel. Pigeons roost on the balcony partitions and by the time we left, there were piles of pigeon droppings on our balcony....ugh. Very unsightly and unhealthy. When we complained, we were told that the rooms facing the rear (water side) of hotel were $50 more per night. Quite franklin, they didn't care.", "title": "Pigeon Problems ughhhhhh", "helpfulness": 1, "user": "mimi2many", "date": "July 18, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 35097358}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We spent three days at the Hyatt. Just back last night. We had a great time- husband and two kids ages 9 and 5. Most of the reviews were pretty much dead on. The location is great. Property very well taken care of. Rooms recently refurbished very nicely. Nice choice of pools for people with and without kids. We ate on property. Lunch by the pool good choices and fair prices. Ate one night at the Waters Edge grill. Food was not great and our waiter seemed like he pretty much hated his job. He was less than helpful. Second night we ate the the Blue Point Provision. Food was good and the location was terrific. We ate on the deck. Cost for both nights was high for what you get but not unexpected for a hotel. If we go back we would head off property to eat dinner next time.", "title": "We had a great time!", "user": "jjags", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 34972818}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The one thing that holds this hotel back is the service. Service was not really bad- staff is largely very young from what we saw and seems to lack experience ( both young and older staff). They had many young workers that seemed to be from eastern europe with some language barriers. We've stayed at similiar resorts both in and out of US (like Trump in Ft Lauderdale and Hilton in Cancun) and I can say the quality of the service and calibar of type employee lags WAY behind. This has to hold this hotel back from being a great place. All that to say we would go back. Nice resort not too far from home.", "title": "Wonderful Weekend", "helpfulness": 1, "user": "mickey63c", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34535647}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "It's one thing to spend a w/e with family you haven't seen in a while, and another to find such a great hotel to enjoy it in- no matter what the weather. We were there before the \"season\" , and it didn't even matter!!! Indoor/outdoor pool, multiple game rooms, pool table, mini-golf, table tennis, smore's by the fire. (Spread out all over the grounds). My kids felt like they were never in the same place- and didn't want to go home. Great food and service. Jonathan, the chef at the Blue Point restaurant came out to our table to ensure everything was great. I even observed a cashier pull a dollar out of her own pocket to pay for part of a candy purchase by two children. We'll go back for sure.", "title": "Put it on your list of places to go. The kids didn't want to leave!!", "user": "FamilyoffiveCincy", "date": "April 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28388570}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Went to the Hyatt for 3 nights - got the deal via the Hyatt website - buy 2 nights, get the 3rd for free - breakfast buffet for 2 adults included as well. Located right on the Chesapeake on the Choptank River, this place is wonderful if you are a family with children over spring break. There was SO much to do - complimentary face painting and temporary tattoos, cookie decorating, Easter egg hunt, egg decorating, arcade games, game room with air hockey and ping pong, moon bounces, mini-golf, beach volleyball. I know I am forgetting stuff as well. There are 4 pools total on the resort - 1 outdoor activity pool with a big slide, 1 outdoor infinity pool, an outdoor kiddie pool and a large indoor pool with an indoor/outdoor hot tub that showed family-friendly movies nightly. Inside pool had a snack bar that served adult drinks as well - excellent mojitos and margaritas. The outdoor pools were heated and we had decent weather so our kids were swimming outdoors in early April in Maryland! They have nighttime s'mores by a big outside fireplace that my kids loved doing. Restaurants are as expected - pricey - but you can cut corners by ordering from their casual bar restaurant called Michener's Library one night for more pub-like food and appetizers and they have the Hyatt kids menu as well. Never got to the spa, but it looked great. The rooms were really nice - clean with comfortable beds, large bathrooms - and get one with a water view, so beautiful to wake up to in the mornings and it's nice to have the balcony as well. My husband and I both loved the place and our kids are planning their return visit next year. All in all, a great, great time.", "title": "Phenomenal resort - great for spring break with kids!", "helpfulness": 2, "user": "mccarthys5", "date": "April 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 27958010}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Had a great time with the family (2 yr old and 5 yr old). The resort was geared up for Spring Break. All three pools were open. The kids loved the water slide and the indoor/outdoor hot tub. They also enjoyed fishing from the pier, playing at the beach, mini golf and the giant chess set. Our 5 yr old spent half a day at Camp Hyatt and wanted to go back again next time. Food was good. We ate the crab cake sandwiches pool side most days for lunch. The Blue Point Provision restaurant (open evenings Thursday- Saturday) was very good and kid friendly. There are also plenty of open spaces outside for the kids to run. Did I mention the resort is on a beautiful piece of property. Overall a real treat.", "title": "Terrific for Families with Kids", "helpfulness": 1, "user": "Olive321", "date": "April 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 27705054}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Just returned from 2 nights/3days at the Hyatt Chesapeake for a quick spring break getaway. This is probably the fourth time we've been to the resort and I must say it was the most pleasant. The resort has been refurbished and we could not have been more pleased. We stayed on the Regency floor and the rooms were very comfortable and clearly new. The Regency room is such a nice treat, continental breakfast in the morning, snacks during the day (though the kids were disappointed that there were no cookies our second day), and a great cocktail hour with beer, wine and hor'deurves. I highly recommend the Regency floor, it is well worth the price. All of the staff we encountered were top notch. We made several requests and they were fulfilled promptly. Food was expensive at the resort restaurants, but nothing we didn't expect for this type of resort. Overall, all of us (2 adults and 2 children) has a great stay. I do have one recommendation, the hotel could use a larger arcade room with video games etc. for the kids. We'll be returning to the Hyatt again.", "title": "Spring Break Getaway-Very Pleased", "helpfulness": 1, "user": "hrmomx2", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 27613531}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "This place was awesome!!!!!! The rooms were amazing! The golf was superb!!! We experienced nothing but the best in service, comfort, and fun..... Absolutely fantastic!!!!", "title": "What can you say bad about this place!!!!", "user": "MdKennedys", "date": "April 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27256324}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "My husband took me and our 2 young children to the hotel for a night after a day at the beach as a surprise. We stayed in a king room with bunk beds for the kids - what a perfect room and a great idea for the kids - they loved it! The room was very large and comfortable. With 3 pools and miniature golf, the kids couldn't ask for more but there was! With the outdoor fireplace, the beach, the boats/kayaks, views and many other outdoor activities, you could easily spend a wonderful time here on vacation. There was a movie at night by poolside, which was a good treat. After returning to our room after a day of fun, we were pleasantly surprised with a plate full of oversized delicious cookies and milks in our fridge - what a nice touch! The hotel employees were friendly and knowledgeable. We will definitely be back!", "title": "Great hotel with many adult and child on-site amenities", "user": "timmeg31", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31902574}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Our family of 4 stayed at the Hyatt in Cambridge Maryland over Memorial Day weekend. We were looking for a place within a 3 hour drive from our home in northern Virginia and considered several places which I researched extensively on this site before deciding on the Hyatt. Here are my impressions:", "title": "Enjoyed our long weekend stay very much", "helpfulness": 2, "user": "LisaDee_Virginia", "date": "June 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 31871591}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Room: Nicely decorated, large and clean. You could tell the rooms were recently renovated because of the fresh bedding and carpets. Bathroom was large and had great bath products. Room included a refrigerator that actually kept our drinks cold unlike many small units. We had two double beds with a great view of the river and the 18th green of the golf course. We paid $50/night extra for the water view. There was a lot of room around the beds and I’m surprised they didn’t put in two queen sized beds instead of doubles. As our children grow we will no longer be able to fit into two double beds so we hope they renovate again with bigger beds or at least offer rooms with an additional sofa bed.", "title": "Want's to be a Four Seasons - Only Makes Two Seasons", "helpfulness": 2, "user": "mjsavocat", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 5.0}, "id": 31399656}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Dining: We ate at Waters Edge for both breakfast and lunch. The food was good and service was great. Food at all the restaurants is pricey, as you’d expect at a resort-type property. We had dinner at Blue Point Provision and enjoyed it so much we canceled our dinner reservation at Waters Edge to return to Blue Point again the next night. Blue Point is a casual seafood restaurant with gorgeous water views. I had the rockfish one night and crab cakes the next, both were excellent as were my husband’s meals. The walk back to the hotel along the river during sunset is fabulous (a shuttle is available if you don’t want to walk.) All the restaurants have kids menus but avoid the kids pizza which is tiny and didn’t fill them up at all. We had lunch at the snack bar by the pool and that was the one dining disappointment for me…my chicken Caesar wrap had way too much dressing.", "title": "Beautiful place, however level of service needs improvement", "helpfulness": 1, "user": "Precocious", "date": "May 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 5.0}, "id": 29866252}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Service: Everywhere we went the employees were smiling, attentive, and pleasant. Even the life guards asked if we were having a good time. There seemed to be quite a few foreign employees (their country of origin is on their name tag) but there were no language barriers. We had a problem with our bill which was handled quickly and effectively by the front desk. Billing was the only issue with our stay. I booked the “stay more play more” package directly with Hyatt which was supposed to include a $200 resort credit plus 25% off the kids club. My bill didn’t reflect either of these discounts. When I brought my bill to the front desk they quickly resolved the issue but when paying $350/night for a room I shouldn’t have had to deal with that annoyance.", "title": "Great value and a beautiful resort with lots of kid-friendly amenities", "user": "monty4uga", "date": "April 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28471881}], "location": {"country": "United States", "city": "Cambridge"}, "stars": 4, "variance": {"poor": 46, "average": 112, "very good": 313, "terrible": 23, "excellent": 326}, "aka": "Hyatt Regency Chesapeake Bay Golf Resort, Spa & Marina Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Come experience the pampering luxury and picturesque landscape of Hyatt Regency Chesapeake Bay Golf Resort, Spa and Marina. Located on the beautiful Choptank River, Hyatt Chesapeake is a premier AAA Four Diamond resort that encompasses more than 342 acres. Our resort offers a wide range of fun recreational activities, including an 18-hole championship golf course, which received a 4 ½ star rating (out of 5) from Golf Digest. Our acclaimed Sago Spa & Salon which just underwent a $1 million renovation boasts 14 treatment rooms providing a complete range of signature Eastern Shore spa treatments. The River Marsh Marina has 150 full service slips that dock upto 150 ft yachts. Other amenities include three outdoor pools, a glass-enclosed Wintergarden pool, a state-of-the-art fitness center, private beach with boat/ kayak/Jet Ski rentals, wildlife preserve, four lighted tennis courts, and more.Regional seafood specialties and waterfront views are just two of the attractions at Hyatt Chesapeake’s six restaurants and lounges. In 2009, all 400 of our luxurious guest rooms, including 56 suites, were completely refurnished. In addition to step-out balconies with magnificent views, each room has 37” flat screen TVs and inviting leather armchairs with ottomans. Come enjoy this luxury waterfront destination."}