{"user_rating": 4.0, "review_count": 709, "name": "Hyatt Regency Hill Country Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "we just got back from a stay at the hyatt and loved it. we have two children ages 2 and 6. the staff was very friendly, the grounds are beautiful and the hotel really caters to families. they have bikes for families, a playground, pools for adults, kids and toddlers, a beach area and the floating river. my son loved the river and it's only 3 feet deep at the deepest points, perfect for young kids. at night they have hayrides, smores and a disney movie on the lawn. they provide blankets to lay on and free popcorn. the kids loved it. the we ate at one of the restraunts and the food was good, our two year old ate at the buffet for free at breakfast and dinner. we went to sea world one day and the hotel could'nt be closer. i would stay there again.", "title": "loved the hyatt", "helpfulness": 5, "user": "jeanniec", "date": "April 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4982786}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "My two teenagers and I spent the week at this fabulous resort. Although previous reviews mentioned lots of kids, there were some, but it was not overrun with them, and this was spring break. I thought there were more business people there, than families. I chose it because of the resort atmosphere and the large rooms; we had two double beds and a roll-away bed. The room overlooked the lawn, which was beautiful yet private. The room was clean, along with the rest of the hotel. The staff was very friendly and very accomodating. Yes, the food was expensive, but after all it is a resort. We had dinner at Rudy's BBQ, which is just down the street. I spent time at the spa and it was heavenly. I will definitely return to this resort, and will consider the other Hyatt resorts when traveling.", "title": "Great Vacation", "helpfulness": 6, "user": "BBinVA", "date": "April 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4978421}, {"rating": 2.0, "title": "not rushing to go back", "text": "I just got back from a 2 nights stay at the Hyatt. Let's just say I did not do enough research. The hotel was filled with kids (and I was there with my boyfriend). Definitely not a place for anything but families. We didn't have such great weather but I don't think I would have gone near the lazy river with all the kids there. Definitely not relaxing. One thing I did enjoy was the spa. The golf course was nice but the grass isn't kept very well. The rooms were just okay. There was an ant in the bathroom which didn't make me very happy. The beds were comfortable but we were stuck in a room with 2 queen size beds instead of 1 king. There was a conference going on at the hotel so it was pretty full. Bottom line - At least we didn't pay full price for the room because we would have overpaid.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 3, 2006", "id": 4831753}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "My wife and I stayed 3 midweek nights while visiting our son; overall it was ok; rooms were nice but bathrooms very small; Kids everywhere; restaurants were ok, service great; food average; dissapointed there was no quiet lounge to have a drink in the evening; the bar was very noisy very smokey and loaded with business types. Do not use the yahoo driving directions available from the concierge; use mapquest instead; they were much better. Great staff will do anything it takes.", "title": "Great Staff", "helpfulness": 3, "user": "aerobics1", "date": "March 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4742991}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We stayed in a Suite and it was beautiful. The location captured the ambience of being in San Antonio. The staff were very pleasant and attentive. The king-sized bed was perfectly comfortable. There are so many things to do. There is tennis, golf, swimming and the Rambling (man-made) river. The fitness center has top-of-the line treadmills and exercise equipment. There are hiking trails, evening movies on The Lawn with popcorn and treats. Smores are served and there are hay-rides for the kids. One of the best Sea Worlds is close and there is a shuttle ride. Rudy's BBQ is also close and is well known for its awesome BBQ. The river walk is a short drive and there are awesome restaurants and activities. If you want turn-down service, be sure to call ahead of time upon check-in. Best of all, there was not a single mosquito during the whole trip!", "title": "Great Family Location", "helpfulness": 5, "user": "sonicboom", "date": "March 15, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4624240}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Just \"GREAT\" from Bonnie at the Front Desk to the Lazy River and the Chip the Carrige Horse. It was a Fantastic couple of days! We did not leave for the three days we were there. We booked our trip on Priceline and saved by naming our own price.", "title": "Best Young Family Trip with 3 Year Old", "helpfulness": 1, "user": "bigdaddyofgolf", "date": "July 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35018844}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Couple of Tips to Save Money!", "title": "Amazing!", "user": "SusanF95", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34299445}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Stock-up your fridge in your room with snack items. If your on a buget and want to save money, the General Store is the way to-go! We had every meal from there (following advice from other postings) The Breakfast Tacos are great and the Pizza is the way to-go. You can order a whole pizza and take it back (with drinks) to the pool area and \"SAVE\" big time. The Smores were \"GREAT\" and the carrige ride was very fun! The whole place is geared towards making you feel First Class. It was Really fun for little kids and parents alike. We are already looking forward to next Summer. It's that good!.", "title": "Outstanding Customer Service and Very Family Oriented!!", "helpfulness": 1, "user": "luvtjmb", "date": "July 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33843080}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "NOTE: We went to Fiesta Texas the day before and stayed about 2 hours! The Heat was too-much and because it's down in a hole, there was ZERO breeze.", "title": "Most Relaxing Family Vacation Ever", "user": "renejaime", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33617439}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Sea World is next door, we will do this next year. The Golf Course and Spa looked nice but we spent 95% of our time in the Pool/Lazy River.", "title": "I had the most perfect wedding here.", "user": "julze1980", "date": "June 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33505552}, {"rating": 4.0, "title": "Hyatt Hill Country---It's a Winner!", "text": "This was a great hotel. We are a family of four with two small children and this place is absolutely geared for kids. So many activities and lovely grounds to enjoy. We rented bikes and rode around the property which is gorgeous. The pool area is beyond great--my husband and I enjoyed the mojitos and floating around in the lazy river with our kids. It is truly an ideal vacation spot for a family. If I didn't have kids I probably wouldn't want to stay here even though the hotel is lovely and the spa looks amazing---way too many kids and like I said, it's pretty geared for families. The accommodations were good, too. We had a situation with our room and the manager moved us to a suite, which was perfect and there wasn't much hassle with moving our stuff, etc... they were very gracious and accommodating. The beds are so comfortable and the hotel is surprisingly quiet considering the property was at 100% occupancy! Let me tell you, we are not into crowds and never once did we feel like, \"Oh no, there are a million people here!\"", "helpfulness": 1, "user": "jackw", "date": "August 14, 2008", "id": 18951863}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "I think the thing I appreciated the most was that the hotel has a general store where you can purchase milk, yogurts, whatever groceries you need, and store them in the refridge in your room. This was a nice amenity since you could also get sandwiches, breakfast burritos, etc.. for a fairly reasonable price (this is a Hyatt, after all---) and not be gauged to death by room service, pool restaurants, and other dining options, unless, of course, you want to be :) It was a lot cheaper to go this route since our first night there we spent 45 dollars on a burger, two drinks and some chicken nuggets. I will tell you, this is an amazing property; I would looooove to go back year after year! PS Just a side note to other reviewers, complaining about mold on shower heads, AC conspiracies, food prices etc... doesn't make you a more sophisticated, worldly traveler with higher expectations than the rest, it just makes you a complainer who needs to re-focus on the more obvious pleasures in life. Enjoy!", "title": "Good and Bad at Hyatt Hill Country", "helpfulness": 9, "user": "austinmdpedi", "date": "August 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 18937281, "likes": {"liked": "— Kids activities", "disliked": "— Just not as nice as it used to be. Questionable value."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The Hyatt Hill Country Resort is still a nice and unique place to stay... but this will likely be our last visit.", "title": "A perfect resort for kids", "helpfulness": 1, "user": "Roitz", "date": "July 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18423676, "likes": {"liked": "— The pools & the room", "disliked": "— Lack of places for couples to go for cozy, quiet food & drink"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The good:", "title": "Beautiful grounds...yucky rooms", "helpfulness": 2, "user": "janetrat", "date": "July 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 5.0}, "id": 18048995, "likes": {"liked": "— The activities for children.Beautiful, well maintained grounds. Fun for the whole family.", "disliked": "— Housekeeping service. Dirty bathroom in our room."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "-The hotel's public places, especially the lobby and the grounds, are simply beautiful. Flowers everywhere. The buildings and really all resort features fit beautifully within the Hill Country setting.", "title": "Heaven for children, skip the Regency Club", "helpfulness": 1, "user": "stella27", "date": "July 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 17868904}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "This hotel was absolutely wonderful. I don't have any complaints .We were always busy. The lazy river was a blast, the man made beach was cool, and the bike rentals were great as well. I could go on and on about the activities but the list would be too long. My kids were very disappointed when it was time to leave. We will be back next year!!!", "title": "Wonderful!!!!!", "user": "msmonek", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36443514}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We stayed at the resort for two days. The lazy river was the main reason we stayed here and we enjoyed it. We purchased the family vacation package that includes breakfast. Do not waste your money. The food at the Springhouse Cafe was much worse than the last time we stayed here. Whether you choose buffet or order separately, both were equally bad. Dinner was not very good either. The best item was coffee in the morning and chocolate cake after dinner.", "title": "Its all about the lazy river", "user": "weeiiss", "date": "July 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35603609}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We were in room 3814 and it had rotten access most all amenities. We did not valet this time. Self parking would have been fine if they would allow you to enter through the nearest doors. However they lock the exterior doors so you have to walk all the way around this monster hotel to find access. Hopefully you pick the right door or you'll be walking 15 minutes to find your room. Its like a maze and the stairways are all centrally located, nothing in the interior wings of the hotel.", "title": "sticker shock", "helpfulness": 1, "user": "textraveler93", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 35568526}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Overall this was a nice place for family fun. Would not be a relaxing, quiet time for adults or singles.", "title": "Worst Experience at a Hotel", "helpfulness": 3, "user": "Dublin777", "date": "July 22, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 35490723}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "It's a pretty nice hotel, but we should have chosen our typical Hampton Inn experience, or La Quinta, or anyplace that offers free breakfasts. I think perhaps we are just not the \"resort type\" of family. We're too cheap to enjoy ourselves at a place like this. The Internet access was $10/day, fortunately we used our iPhones and got around that. Also we found a Walmart close by and got our room snacks there. We did the Self Parking option instead of the valet (and the staff were very polite to us about that). Clearly it is a popular place but something just felt weird about spending $200/night for a room that was extremely ordinary. We ate ala cart breakfast in the Springhouse Cafe and it was tasty, but again, pricey, $40 for 4 of us, and not worth it. The Rambling River was a welcome way to end a day at SeaWorld, but it was crammed with boisterous kids. I think perhaps we are the last human beings on the planet who believe in disciplining our kids. All the staff we encountered were polite and outgoing and chatty. In all, a lovely resort if you're into that sort of thing. I honestly can't recommend it though.", "title": "Overrated!", "user": "trdojo", "date": "July 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35208047}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "Just back from a 2 night stay at the Hyatt. This is our second stay there. While we had a nice time this is the second and third time someone in our party has gotten their things misplaced. Our first visit our friend had his golf clubs misplaced. This last visit they misplaced my husband's golf clubs and our friend's luggage. They really do need a new system of keeping track of things.", "title": "Be Careful", "helpfulness": 7, "user": "tlegray", "date": "June 7, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5318492}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Other then that our stay was very nice. The staff is amazing. The place is relaxing. It's a very family place. They have activities all day long for kids. It's really very enjoyable.", "title": "Fantastic for families", "helpfulness": 7, "user": "BossElf", "date": "May 31, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5287319}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "We (me, my husband, and our almost-two-year-old) stayed at the Hyatt Hill Country Resort over Memorial Day weekend. Overall, we were very pleased. The resort and grounds are beautiful, with a rustic Texas flair. The staff is very attentive and professional. The range of activities is outstanding-- the lazy river, a special pool for babies, an adults-only pool, bicycles you can borrow, a \"family barn dance\" on Saturday night, kids' activities scheduled all day long, a nice spa plus a special spa for teenagers, beautiful golf course, etc. There are also numerous food options: the elegant/formal Antlers Lodge restaurant, an ice cream/coffee bar in the lobby, an outdoor snack bar by the pool, another bar perfect for a beer or two, and much more.", "title": "Ok at the Hyatt", "helpfulness": 6, "user": "CLJ93", "date": "May 21, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 5186080}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "I had a great massage at the spa, but the spa itself was not as well-managed as others I've been to. Many people checking in and out at the same time, and the lounge area was not very quiet or relaxing-- the two doors were constantly being opened and closed.", "title": "Hill Country Memories", "helpfulness": 7, "user": "D W", "date": "May 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5147386}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The only problem we had was that our room faced the main courtyard of the hotel, and on Sunday night there was a \"Disney Movie on the Lawn\" right outside our window. It was VERY loud, and did not end until nearly 11 pm. This would have been fine if our son was 6 years old-- we'd have been out there on the lawn enjoying the movie. But he is a young toddler and goes to bed by 8 pm, so we did not appreciate the loud movie right outside our room. They should have told us about the movie at check-in time, and we could have chosen a different room. Apparently the rooms on the spa-side of the hotel are the \"quiet\" rooms-- this is what you want if you have a baby/toddler who needs to sleep!", "title": "Wonderful Weekend Getaway", "helpfulness": 5, "user": "niclou", "date": "April 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 4983197}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We stayed here two nights in December 2008. Property is huge. Lobby and outside grounds very nice. Did not use golf course or pools, but they looked quite nice. Room was big, clean and comfortable. Internet was $10 a day, did not use. Bottled water $4.50 each, did not partake. Looks like a nice place to hang out in the summertime.", "title": "Great place, very spacious", "user": "travelingman59", "date": "December 21, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 22896074, "likes": {"liked": "— Beautiful grounds, big clean room.", "disliked": "— No complaints here."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled on business", "text": "I visited this hotel for a conference. The rooms are spacious, clean and well appointed. The staff is friendly and very helpful. The meeting facilities are roomy and comfortable. There is a beautiful golf course, several nice pools, and idyllic grounds. The hotel is about 15-20 mins away from the San Antonio Riverwalk and other attractions.", "title": "Fantastic Southwestern Resort!", "helpfulness": 1, "user": "YShimon", "date": "November 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21872288, "likes": {"liked": "— Comfortable and friendly", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "This hotel provides a great combination of upscale amenities and comfortable, friendly atmosphere that is very relaxing. I highly recommend.", "title": "great for families", "user": "SKS1969", "date": "October 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20605705}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "With 2 and 4 year old children, we were very happy at the hotel. It was best to spend time at the pool and lazy river area. There is also a small artificial beach. Although the property is near Sea World, the lack of shade and long lines at Sea World were less fun than just hanging out on the hotel grounds.", "title": "Labor Day at Hill Country Hyatt", "helpfulness": 1, "user": "Colbystew", "date": "September 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 19625807, "likes": {"liked": "— The friendly staff and lazy river.", "disliked": "— The food."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "As far as prices go, the room itself was a great price for its level of quality, but the room service, buffets and restaurants were not inexpensive. The nachos were a good value because they're ample enough for more than one person.", "title": "Fun Family Experience", "user": "ajtravis", "date": "August 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 19077185, "likes": {"liked": "— The lazy river and the family activities", "disliked": "— the front desk."}}, {"rating": 4.0, "title": "Amazing - Every Year Trip", "text": "We visit the Hyatt Hill Country each year. It is so relaxing. There is something for everyone to do. We always come away refreshed. The grounds are very neat and homey. The rooms are a little small - especially for the price. However, there is so much to do outisde that we spend very little time in the room. The lobby is gorgeous and like a huge ranch house. We spend time in the lobby at night playing games. We enjoy the Hyatt every year - it's like going home each time we visit.", "user": "Miller_Crew", "date": "March 24, 2009", "id": 26776716}, {"rating": 4.0, "title": "Blast for Spring Break", "text": "Our family just went to the Hyatt Hill Country for Spring Break and had a blast. It was heaven for kids as the resort really catered to them.", "user": "sse1078", "date": "March 21, 2009", "id": 26573880}, {"rating": 4.0, "title": "A golf outing", "text": "Pool:", "user": "brat41", "date": "February 27, 2009", "id": 25298821}, {"rating": 5.0, "title": "Visit was too short", "text": "There is a great main pool area, nice baby pool and lazy river. There is even a small beach at one area of the lazy river. Lots of innertubes and also an area for volleyball in the pool.", "user": "watruw8ing4", "date": "January 6, 2009", "id": 23329980}, {"rating": 5.0, "title": "A Great Getaway", "text": "Playground:", "user": "LSUgirl06", "date": "January 2, 2009", "id": 23206040}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband and I thoroughly enjoyed our weekend escape. Our room was beautiful and the service was outstanding. Every staff member went out of their way to be friendly and helpful. We enjoyed the Windflower Spa one full day with excellent service including lunch delivered poolside. The lazy river and adult pool were both nice. Plenty of servers around to make sure you stayed hydrated! Ha! We ate at the Springhouse Cafe and enjoyed a special Mexican buffet as well. All in all, it appears they are trying hard at Hyatt. The resort and grounds are topnotch and we will be making Hyatt Hill Country Resort a frequent escape.", "title": "Just the place for our weekend escape!", "user": "twobluecats", "date": "September 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 39961471}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "This property was meant for families with children. It reminded me of DisneyWorld with all the activities and extras for the kids. The lazy river, hot dogs, face painting and all just cried out for large groups of children. It is near Sea World and located in San Antonio where there is lots to do, but I am not sure why you would leave if you paid to stay here. With that said, it was not quite as attractive to the solo business traveler or conference attendee because of all the kids. It is good though for attendees who want to bring their families and combine business with pleasure. I also understand it has a great golf course. I think where your room is located could make a huge difference and I was lucky to be on the back side with a nice view and quieter neighbors. The rooms were nice and comfortable and I had a balcony, as did many of the rooms. However, the balconies are not private - just separated by an open rail. One very pleasant surprise was a meal I had in the family dining area. While the waiters were not too up on the idea of a salad other than the salad bar or other extras, such as a roll with dinner, the tuna steak I had was out of this world and of the quality that I would have expected to pay far more than I did in this casual restaurant. My guess is the fine dining restaurant is extremely good if this was any indication. The hotel staff was friendly and helpful. Do be prepared for a walk as the parking and hotel property itself is spread out over a large area.", "title": "Perfect for Family Getaway", "user": "DRace", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 38065069}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "At the time of our visit, this place was teaming with kids. The key to enjoyment for adults traveling without kids, is the spa and the adult only pool area. The spa pool is only available if you schedule spa treatments, we had it all to ourselves most of the morning. We had to ask about the other adult only pool and it was heavenly when we finally found it. Waterfalls and rocks mask the kid noise on the other side and again we had it nearly to ourselves. The rooms are clean, quiet and comfortable.", "title": "Spa-ahhh!", "user": "CasiTheWoodlands_TX", "date": "August 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37973280}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We were very pleased with our stay. The lazy river was definitely the highlight. The water is very shallow all the way around and my 5 year old could touch the bottom, which is very important to him. There were also smores each night around the firepit and movies on the lawn a couple of nights we were there. The lazy river was never too crowded in the afternoon or evening times while we were there, but we were there on a Thursday & Friday only not over the weekend.", "title": "Great Family Fun", "user": "winags", "date": "August 4, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36666862}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We ate at Papa Ed's by the pool two nights. The cocktails were very pricey, but good. The food was ok, but the convenience of not leaving the pool area was well worth it and the service was great.", "title": "Fun Time!!! Loved It.", "helpfulness": 1, "user": "BJerome", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 36596495}, {"rating": 5.0, "title": "Hyatt vs. Westin La Cantera", "text": "We just got back from a terrific weekend in San Antonio at the Hyatt. We stayed at the Westin La Cantera earlier in the summer and fell in love with tha property also. Before I compare the two properties (see Hyatt vs. Westin below) I want to mention the \"crowd\" and \"kid issues at both of these resorts.", "helpfulness": 32, "user": "depauldem", "date": "October 17, 2005", "id": 4028401}, {"rating": 3.0, "title": "Beautiful Place But", "text": "CROWDS & KIDS", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 14, 2005", "id": 4024151}, {"rating": 5.0, "title": "Great business/vacation combo!", "text": "Both of these hotels are large resorts of over 500 rooms each. So if you do not like crowds, dont waste time complaining about them. These places are meant for lots of people, not personal egos....so check yours at the door or dont go. As for the complaints about kids: I do not have any and would prefer they were not at these resorts in great numbers. However, lazy rivers, playgrounds, trails, arcades, kids clubs and water slides are (sadly) not built for the adults. They are built for the kids and to draw their parents into staying at the Westin or Hyatt. Further, the Hyatt is across the freeway from Sea World and the Westin is just up the hill from Fiesta Texas. These locations were selected to cater to people with children, not the people who complain about them.", "helpfulness": 3, "user": "MP50", "date": "October 7, 2005", "id": 3999651}, {"rating": 2.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "There is no avoiding children in the summer at either of these two resorts. Period. But if you can just accept that kids will be there and realize that you were once one too, then you should have a fine time.", "title": "Kids, Kids, and more Kids!", "helpfulness": 11, "user": "gafaith", "date": "October 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3985953}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "If you want to minimize kids and crowds then go in an off period...mid-October worked for us. The weather was warm and sunny and crowds were minimal. Yes, there were plenty of children, but it was nothing compared to the summer. At night we had the hot tub to ourselves and during the day the pool area was virtually empty. Yesterday (sunday October 16) we had the entire lazy river to ourselves for a good part of the day.", "title": "Kids Everywhere!!!", "helpfulness": 21, "user": "shepardw1", "date": "September 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 3912347}, {"rating": 4.0, "title": "Excellent as Always", "text": "This was our third stay at Hyatt Hill Country and it was excellent as usual. The kids love the pool and lazy river. For the first time I realized that the entire pool is 3.5 feet deep so my 5 year old could touch down anywhere which was nice for her. Kids love the various activities from face painting to smores. Food and drink remain pricey but the BBQ on Saturday night was free for 6 and under. The kids love the jr sized buffet for them. Staff is always attentive. Rooms are always clean. We'll stay here again.", "user": "vlfair", "date": "October 1, 2009", "id": 45608121}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We've spent numerous holiday weekends at the Hill Country Hyatt, but this Labor Day weekend was somewhat of a disappointment. Maybe the activities are just too geared to families with young children, or we're getting too old for the noise and activity level with so many kids running around, because people did seem to be enjoying themselves. While we will continue to visit this property, we'll probably skip going on holiday weekends in the future.", "title": "Holiday weekends are way too crowded!", "user": "eksdhs", "date": "September 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 41185034}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We were pleasantly surprised at our Diamond upgrade to a Hill Country Suite with an enormous balcony overlooking the lawn. Other than that, we were unimpressed. Being a holiday weekend, we knew it would be crowded, as we've spent several Labor Day weekends there. It was the first time, however, the lazy river was so crowded we had trouble finding a vacant tube. The horse-drawn carriage rides were a nice idea, but the wait for a ride was too long. There wasn't an official line or any staff monitoring the queue. We waited through several wagon loads (about 10 people) of people, each time the wagon pulled up a huge number of kids came from nowhere and filled it up! They either need a larger (or additional) wagon, a shorter route and staff to maintain a more formal waiting line.", "title": "One of our best vacations ever!", "user": "LAmomof6", "date": "September 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40859489}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "We were interested in the BBQ buffet offered, but had a lot of trouble finding the location. Once we did, we changed our mind because it was served in a stark white (mostly empty) tent with absolutely no atmosphere. We dined at the Springhouse restaurant instead. Even though we only had one trip to the salad bar (which was an option on the menu) the waitress charged us for full buffets @ $18 each. Getting the bill corrected and getting a pen to sign the check took forever! Our experience with breakfast the next morning was much better, though.", "title": "Had a Great time at the Hyatt Hill Country", "user": "Dalsemer", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 40709929}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Our daughter really enjoyed her visit to the spa. Offering kids spa prices is really nice (and is a great marketing ploy getting kids used to such treatments at an early age!) While waiting for her, I was amazed how quiet it was there compared with the rest of the resort with all the little kids running around. They did a great job locating this place of refuge. We also appreciated the front desk allowing us a late checkout (3pm) to accommodate her spa appointment.", "title": "Will not return.", "helpfulness": 2, "user": "AM2008", "date": "September 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 40065346}, {"rating": 2.0, "title": "never again", "text": "I recently spent a weekend at the Hyatt Hill country, and was very dissappointed. First of all I reserved a room on the club floor, which was much more expensive, only to find that the club was not to be opened until after my departure. So why were they happy to charge me for nothing? The rooms were tiny, as were the bathrooms, and even though the hotel has been recently renovated I believe at over $300.00 a night it isn't too much to expect a decent bathtub.", "helpfulness": 13, "user": "bda1", "date": "March 7, 2006", "id": 4591744}, {"rating": 2.0, "stay_parameters": "Stayed February 2006", "text": "Worse were the ridiculous prices for everything. The only comic relief was that everytime I purchased something, the employee would say, \"yes, I know it's a ridiculous price\", before I even had a chance to gasp in disbelief at the price myself. For example my room service breakfast which consisted of coffee and frozen orange juice, scrambled eggs and toast, came to $56.00, and even though they say the gratuity is included, the server told me they only make less than a dollar per order, so of course the breakfast then came to over $60.00. These are prices I have no problem paying if the quality is equal to the price.", "title": "Lukewarm Feelings", "helpfulness": 10, "user": "cutiemcpootie", "date": "March 3, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 4.0}, "id": 4578766}, {"rating": 4.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "Basically a very standard property with luxury prices.", "title": "Beautiful Grounds But Very, Very Isolated..", "helpfulness": 4, "user": "oclife", "date": "February 27, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4559305}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "My husband and I stayed here for a wedding at the hotel and to celebrate our first anniversary.", "title": "We stay there regularly-- nice place, but some things to note....", "helpfulness": 23, "user": "Angelmonkey", "date": "January 3, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4319778}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Upon arrival, I headed straight for the shower. The tub had many ugly scratches in it and there were dirt stains from where a bathmat must have existed some time ago. The tub immediately began to backup with water and I got to experience seeing someone else's pubic hair float around my feet. I told the front desk and they had an engineer come fix it immediately, which was nice.", "title": "Great time; would return in a second.", "helpfulness": 14, "user": "jdvmd", "date": "November 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4138060}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I'm kidding. Sort of :-). My husband, our 7-year-old son and I stayed at the Hyatt during Easter break '09. I was a little concerned about the number of kids there after reading some of the reviews. However, our son's school break (week of 4/12) was apparently the week AFTER most everyone else's school break. We got there on a Saturday night. Easter Sunday was crowded but after that day, the resort was basically empty. We loved that. We were there till Friday 4/17.", "title": "We lucked out - All the kids were gone!", "helpfulness": 1, "user": "MrsTraveler", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 28243885}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "THE RESORT: It is HUGE and the property is VERY NICE. The weather was great except for one rainy day on our last full day (it was mostly in the 80s during the day). Floating down the lazy river pool was LOVELY. However, the water was COLD! My husband and son had no problems going in. I just stayed on top of my inner tube. There's also a hot tub near the big pool. Side note: We've stayed at the Hyatt in Bonita Springs, FL, where there are great pools as well, including a lazy river pool. We liked Florida's lazy river pool better (it's just prettier).", "title": "not for romantics", "helpfulness": 1, "user": "littlett", "date": "April 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27824637}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "THE ROOM: We got it through Priceline so we got a great deal. We were in the 400-block on the 4th floor. Our room was a standard Hyatt room. Nothing special but nice enough. There was a small balcony with a view of trees. The timing for room cleaning varied. The first couple of days, they'd come in the afternoon. Towards the end of the stay, they'd come to clean in the morning.", "title": "Nice break, beautiful grounds", "helpfulness": 1, "user": "PhfamWA", "date": "April 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 27574889}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "THE RESTAURANTS: We only ate the Springhouse Cafe and Papa Ed's Pool Bar & Grill. We also had room service a couple of times. We thought the fajitas (cafe), quesadillas (pool bar), chicken wings (room service), apple bread pudding (room service), chocolate mousse cake (room service) were great -- the cheeseburgers with fries (pool bar) were just okay -- and the chicken caesar salad (cafe), bbq brisquet sandwich (room service) were not good. They have a pretty good children's menu.", "title": "Great place to stay!", "user": "laurelinn", "date": "April 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 27351651}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "SPA: I had a 60-minute relaxing massage. It was GREAT.", "title": "Relaxing trip for families!", "helpfulness": 1, "user": "Michelle S", "date": "March 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27045913}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 4, "variance": {"poor": 45, "average": 72, "very good": 246, "terrible": 20, "excellent": 326}, "aka": "Hyatt Regency Hill Country Hotel San Antonio", "slim_ranking": 0.123919308357, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Nestled on 300 wooded acres, only 20-minutes from downtown San Antonio, this 500-room resort features 27-holes of championship golf, tennis, five themed restaurants, fitness center, four swimming pools, Windflower-The Hill Country Spa,950-foot Ramblin' River and Camp Hyatt children's program."}