{"user_rating": 4.0, "review_count": 540, "name": "Hyatt Regency Austin", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We were looking to get away for the weekend and decided to go through priceline. We were surprised to book the Hyatt for just $110 a night.", "title": "A good 4 star value!", "helpfulness": 1, "user": "mikjen111", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5933162}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Upon arrival, we did not expect to have a nice room, but requested a city view. To our amazement, we were given one of the rooms with the nicest views. The view is unlike anything else in Austin. Since this hotel is across Town Lake, you can have a view of the entire Austin Skyline from your room. My husband and I enjoyed waking up and watching the activity on Town Lake as we drank our coffee.", "title": "Great place to stay!", "helpfulness": 2, "user": "butterf160", "date": "August 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5630236, "likes": {"liked": "— Location", "disliked": "— charge for internet access"}}, {"rating": 5.0, "title": "First class service and beautiful room", "text": "The rooms have just been updated and we found the furniture to be functional and spa like. Our king bed was comfortable and faced our amazing view.", "helpfulness": 4, "user": "spiburns", "date": "August 9, 2006", "id": 5593006}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "The hotel itself has a great lobby area with comfortable furniture and excellent margaritas. The conceirge and desk were incredibly friendly and helpful. The pool area is located right beside Town Lake and although it seemed outdated, we enjoyed it.", "title": "Can't Go Wrong Here.................", "helpfulness": 4, "user": "cgocubsfan", "date": "July 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 5511439, "likes": {"liked": "— Comfy bed", "disliked": "— Charge for internet service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Our one disappointment was the cleanliness of the hotel. Unforttunately, as we looked at our great view from the room, we also had to look at about 5 spiders and the webs they had spun. It seemed that the hotel had not cleaned the windows for awhile. Also, the maid service in our room was lacking. We had left some crumbs in our room and they were still there upon our return. Our coffee supply was not replenished. We found a small card in the bathroom explaining that the hotel will only change sheets and towels every 3rd day unless we directly called them and requested they be changed.", "title": "Noisy, but otherwise lovely", "helpfulness": 4, "user": "cades2go", "date": "July 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5510306, "likes": {"liked": "— The view", "disliked": "— The water temperature changes"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "Just came back from a one nights stay at this hotel. We booked through Priceline and got a rate of less than $100 per night. Rooms and lobby were very nice and well kept. We were upgraded to a lake view room on the 12th floor. The staff was friendly and helpful. My 2 year old daughter woke up in the middle of the night with a fever. We called the front desk and they had some Children’s Motrin. Also, when I went down to get the medicine I asked if there was anywhere I could get my daughter some apple juice. Although everything in the hotel was closed, the lady at the front desk said she would get her manager to check in the restaurant. Less than 10 minutes later the manager was at our door with a bottle of apple juice. Also, we forgot our toothbrushes and toothpaste. When we were going up to our room I asked the gentleman at the front desk if they had any. He called housekeeping and before we could get up to our room they had brought us toothbrushes and toothpaste. The only downside was that the hotel was kind of noisy at night. They atrium style of the hotel is beautiful, but it allows noise to carry all the way up the building. There was some sort of function going on the Saturday night we were there and it was pretty loud. We were on a high floor, so I can only imagine how loud it must have been down on the lower levels. By 1 a.m. it seemed to quiet down. I still think this is a great hotel and would return.", "title": "Nice Hotel", "helpfulness": 3, "user": "Texan_Family", "date": "November 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6165644, "likes": {"liked": "— Service.", "disliked": "— Hotel was nosiy at night."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Stayed in Austin for the first time. Picked the Hyatt because of the reputation of the hotel chain. The rooms have just been redecorated with the nice beds and flat screen tvs. The staff was exceptionally personal. I felt that every staff member made an extra effort to make eye contact and greet you. The lobby area is very cozy with stone and the Texas decor, although may change. The location on the river is very scenic and easy to walk around. The neighborhood a few blocks away had great boutique shops, lots of funky things. The staff was very helpful with directions and suggestions. Would highly recommend this hotel.", "title": "Best hotel in Austin", "helpfulness": 3, "user": "jackieb150", "date": "November 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6127576, "likes": {"liked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "If your only priority is to be at a Town Lake location, and you're willing to pay for that, then the Hyatt qualifies. If you're looking for a hotel that caters to it's customers, then I suggest you look elsewhere. For the price I expected a lot better customer service. Seems to be completely set up for business travelers. Never again. For the price you can do much, much better.", "title": "Go for location..not service", "helpfulness": 2, "user": "Jim3109", "date": "October 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 6005698, "likes": {"liked": "— Location", "disliked": "— Customer service"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "Just got back from a one night stay at the Austin Hyatt (Oct 2006). There were four us all together- we shared one room (1120) with 2 double beds.", "title": "Perfect location and very clean!", "helpfulness": 4, "user": "TxNative", "date": "October 10, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5935556, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This hotel is in the perfect location just off I-35 on the south side of downtown Austin. It is a mile from the downtown location of Shady Grove and Chuy's and you can walk across the bridge to get to the downtown clubs and restaurants. Beats trying to find parking in downtown! There is free self parking on the property very close to the main entrance to the hotel.", "title": "Overpriced and Noisy", "helpfulness": 2, "user": "annyb", "date": "October 10, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 5933915, "likes": {"liked": "— nothing", "disliked": "— room"}}, {"rating": 4.0, "title": "Very nice hotel with a beautiful view", "text": "We booked a room with the view to the river and it was magnificant! The room has panoramic windows and it’s realy nice. Everything else is O.K friendly stuff, clean room, great restaurants and breakfast. Perhaps it's a bit outdated but hopefully they will take care of it. There was some remodeling going on in the lobby area and the front entrance which was a little bit annoying.", "user": "kirka35", "date": "March 31, 2010", "id": 60038651}, {"rating": 3.0, "title": "Meh, you can do better", "text": "I stayed here during SXSWi 2010. I didn't hate this hotel, but I woudn't stay there again.", "user": "MissGigl", "date": "March 20, 2010", "id": 59082701}, {"rating": 2.0, "title": "Noisy, service below average", "text": "On the plus side, they made good use of technology, sending me a welcome email with online checkin and other relevant info. I arrived around 4pm and my room was ready. I was \"upgraded\" to a room with an outside sitting area, which would have been fine but it really opened onto an open patio which made me a little nervous security-wise. If i was a smoker it would have been great. They also honored my request to bring a fridge to my room.", "user": "Kurt12", "date": "March 18, 2010", "id": 58889177}, {"rating": 2.0, "title": "Other Options in Austin", "text": "On the downside, the room itself was definitely rough around the edges... the toilet ran unless I jiggled the handle, the sink stopper was wonky, and the inside of the ice bucket was gunky. The worst was the thin walls. With all the SXSW activity there was a distinct \"prom night\" feel with people running around late at night being loud. (Or maybe I'm just getting old!) I wasn't overly impressed with the room service menu, but at least the room service was reasonably fast.", "user": "TheAmbassadorofVA", "date": "February 28, 2010", "id": 57295106}, {"rating": 3.0, "title": "OK", "text": "Considering the price I think it's possible to do better, especially if you are in town for SXSW. It was walkable to the events, but the torn up driveway and other construction made it a little hard to navigate. I'll try to stay closer next year for sure.", "user": "MatsD", "date": "February 16, 2010", "id": 56119059}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "The Hyatt Regency offers an excellent location -- on the bank of Lady Bird Lake. It's a great site for joggers because you can find a dirt runners' trail steps from the back of the hotel. The hotel also offers a 15-minute walk to downtown restaurants and juke joints, which are on the other side of the lake (which looks more like a river).", "title": "Good place to stay", "user": "CaracasCorrespondent", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 80366470}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I should note that not every room has a view of the lake. Some get just the hotel's parking lot.", "title": "Nicely updated hotel, comfortable room", "user": "Stephintexas", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74436548}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Two small touches that I liked: the hotel has a cooler of water spiced with lemon slices next to the entrance. The hotel also puts the soap and shampoo in the shower itself.", "title": "Very nice", "user": "mhphouston", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 72594458}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Something I didn't like: The Internet connection in my 16th floor room was slower than what I find at South American hotels. Surely, a U.S. hotel can do better!", "title": "Nice hotel, okay service", "user": "Jdirka", "date": "July 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71803861}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "We stayed here for one Saturday night after tubing the Guadalupe. We booked through a winning bid on Priceline for a 4 star downtown hotel. I was hoping to be closer to the campus area, but this turned out to be a nice location right on the water. The hotel really takes advantage of the nice water & city view from its bar and restaurant. There is also a great walk/jog/bike path just out the back door of the hotel that runs along the river. It was crowded when we went in the morning, but still a nice alternative to a hotel gym (which they do have if you prefer working out in the a/c!)", "title": "Great location, great rooms", "user": "flagfan", "date": "July 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71557522}, {"rating": 4.0, "title": "Beautiful rennovation", "text": "I stayed at the Hyatt for a business meeting, and the facilities were excellent. I would highly recommend this hotel to any travelor.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 15, 2006", "id": 5469211}, {"rating": 4.0, "title": "Great location and family friendly", "text": "The hotel is close to the downtown area but is also close to lots of great local shops and restaurants if you go south on Congress. The lake and Bat Bridge (Congress Ave Bridge) are right outside your window and a short walk from the hotel lobby.", "user": "katiey424", "date": "May 19, 2010", "id": 64753406}, {"rating": 3.0, "title": "Regular Hyatt on water in Austin", "text": "Check-in was a breeze and our room requests were honored.", "user": "FreqTravelerDC", "date": "May 3, 2010", "id": 63171177}, {"rating": 3.0, "title": "Poor Customer Service", "text": "We had requested a crib and arrived to find it already set-up in the room along with a travel kit of Johnson's baby products - a nice touch. We drove into the downtown area for lunch and then returned for an event at the hotel. The pool was packed but we gathered at Marker 10, the lobby bar, which was quite nice with big comfortable couches. The Perks Coffee bar was great for breakfast as well.", "user": "6_Continents_Dallas", "date": "May 3, 2010", "id": 63067670}, {"rating": 4.0, "title": "Another great stay", "text": "Overall, a great stay for families with kids as you are close to all the tourist spots in town, but also a nice hotel with good amenities and friendly staff.", "user": "TravelingAggies", "date": "April 30, 2010", "id": 62893981}, {"rating": 3.0, "title": "Decent spot", "text": "The hotel is an average Hyatt with regular size rooms, clean and with decent views, if you get one on the water side (which they refer to as a city view). The facilities themselves are good, with a new workout facility, a nice bar, indoor restaurant and outdoor patio looking over the lake. In addition, there is a Perks coffee bar for light food items and other necessities. The location is helpful, especially since it is right on the running/walking trail next to the lake. Besides the hotel's restaurant, there are several places within a short walk.", "user": "mwalno", "date": "April 27, 2010", "id": 62577584}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The Hyatt Austin is a fine hotel. It's not as nice as the Four Seasons, but nicer than the Stephen F. Austin Intercontinental (I've stayed at both previously). Hotel is completely renovated; nice flat screens, comfortable beds. Very small rooms and bathrooms have a single sink and old-school tile. Elevators are neat glass elevators and the atrium is a nice Hyatt Regency throwback. The lobby bar was hopping with a neat outside deck on the river where some good live music was playing. The food at the Southwest Bistro in the hotel was passable though I would skip in favor of Austin's many fine restaurants (not worth wasting a meal there in this great dining town). I like the location; somewhat out of the downtown madness of 6th Street but just over the bridge. Would return again.", "title": "Standard Hyatt Fare", "user": "mickshrimpton", "date": "July 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 71500952}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "I was very pleased with the hotel especially since I got a great price at the last minute. My room was very attractive and comfotable as was the atrium and all public areas. Free newspapers and iced lemon water in the lobby.", "title": "Pool Full of Bugs", "helpfulness": 1, "user": "Continental American", "date": "July 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 71209685}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Location was over the bridge technically in south Austin, but walkable (over the bridge) to downtown.", "title": "Comfortable rooms, nice view", "helpfulness": 1, "user": "delicatelywild", "date": "June 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 68126268}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "I was not offended by extra charges for internet, parking etc. since that seems to be customary with hotels at this level. Free internet would have been nice though. $10 a night is a little steep.", "title": "Republic of Texas Rally 2010", "helpfulness": 2, "user": "HarleyDallas", "date": "June 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 67511538}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "I was impressed that there was a recent model coffee maker and fine coffee in the room. This is such a great convenience, and it's always a letdown to check into a room and not find one.", "title": "Peaceful Stay", "helpfulness": 1, "user": "seejules", "date": "June 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 66259877}], "location": {"country": "United States", "city": "Austin"}, "stars": 4, "variance": {"poor": 43, "average": 91, "very good": 244, "terrible": 20, "excellent": 142}, "aka": "Hyatt Regency Austin Hotel Austin", "slim_ranking": 0.403314917127, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located in downtown Austin on the shores of Lady Bird Lake, the Hyatt Regency Austin is a full service hotel which offers cool, contemporary new guest rooms. Situated along the Hike & Bike trail, the hotel is within walking distance to all of Downtown Austin's major entertainment districts, and 7 miles from Austin Bergstrom International Airport."}