{"user_rating": 4.0, "review_count": 771, "name": "Hyatt Boston Harbor", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This is our second stay at this hotel. Our first stay was memorable -- great view and outdoor dining at a great price. Our second stay over the weekend unfortunately was not so great as there were people next to us and you could literally hear them talk as if they were in your room. While we were equally pleased with the restaurant and service both at dinner and breakfast, if you can't get a good night sleep, then what's the point. The hotels should invest a little more money in construction and noise proofing.", "title": "Nice hotel but paper thin construction", "user": "scarvalho7", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 124835159}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We stayed here for a wedding in October and it was perfect! We were only there for one night but all was great and they did a fantastic job on the wedding. We also ordered room service since we had way too much to drink but from what I can remember the lobster mac and cheese was delish!!! For breakfast I had the lobster omellette and it was outstanding. We came back in January for a chess tournament-not sure why the room rate was 100 dollars less per night from what it was in October at the wedding, but again a great time, I sat in the bar most of the time and the service all around was great! We love this hotel and will return next year if they host again for another chess tournament!!", "title": "Stayed twice within 6 months!", "user": "sabrinacat", "date": "February 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124756049}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Take an ocean view room otherwise don't bother going there because the whole point of this hotel is to benefit from the view! The view is absolutely incredible whether from the room or the restaurant, whether indoor or even outdoor where you can relax on the grass in front of the ocean.", "title": "Superb view!", "user": "M303", "date": "February 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 124627952}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "If you don't care about the view, you can't afford or you're not willing to pay that much for an ocean view room, don't go there! Go to a hotel in downtown (DT) instead. Airport in Boston is really close to DT so if you think you'd be late to your flight by taking a hotel there you're wrong...", "title": "Outstanding", "user": "Barry F", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124492875}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The room was nice and up to the standards, but nothing special (the room could be more spacious)", "title": "Convienent One Night Stay", "user": "dpbdmd", "date": "February 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 124310225}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We chose this hotel at the end of New England because of its convenient location and the reputation. On the whole our stay was excellent, but I will start with my major criticism. It's always nice to be able to get to the airport with the minimum of fuss after a long holiday, and the Hyatt with its free shuttle bus and proximity to the airport supposedly provided this. However, our experience was the opposite. After boarding the shuttle, we were then driven around the airport but the driver failed to take us to our terminal, despite us highlighting this to him; after a 20+ minute journey we ended back at the Hyatt. It was a busy Friday before the Labor Day weekend and taxi queues in the airport were lengthy. The driver started to pick-up non-Hyatt customers trying to flee the airport, and filled the bus to capacity. Once back at the hotel, the hotel manager seemed unconcerned by the fact that we had been on a mystery tour of the airport, which had unnecessarily delayed our international check-in. He tried to say that the bus can be used by anyone - an interesting statement in my mind - but even if that was the case, then surely not to the detriment of Hyatt customers paying good money to stay at the hotel. After insisting we be taken directly to our terminal, he then said the bus would need to follow the standard route, meaning that our terminal would again be the last drop-off. Customer service at its best - not - and it is unfortuntate that our lasting impression was a negative one. Fortunately, the driver saw sense, and took us straight to our terminal. On the positive side, the hotel was clean and tidy with very good facilities, including the pool and gym, although it is disappointing that a hotel of this standard does not provide complimentary Internet. Our room on one of the upper floors overlooking the airport was quiet with tremendous views. Breakfast was of a very high standard and we ate in the restaurant on one evening; the staff were friendly and attentive and the food delicious. River taxis were the most direct means of getting to downtown Boston, but use the 'massport' or 'T' taxis which are significantly cheaper than the others available. Overall, an enjoyable stay, let down by poor attention to detail and customer care by the management; the restaurant staff on the other hand were excellent.", "title": "Quality and Convenience", "helpfulness": 1, "user": "DesertDrifters", "date": "November 30, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 146516567}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Great location, patio dining is just fun. The staff was wonderful, from the bell staff, front desk staff, maid service, and wait staff in the restaurant. There are good value choices on the menu. You just have to choose wisely. Gym is standard Hyatt with enough equipment for a good workout if you are smart about it. Bring your own wi-fi hot spot and who cares how much they charge for internet service......", "title": "Boston is expensive, so this hotel is not that expensive....", "helpfulness": 1, "user": "Paul G", "date": "November 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 146263743}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Pros: Price was good, hotel staff were very pleasant, shuttle service was convenient.", "title": "Mixed Review", "helpfulness": 1, "user": "Karen M", "date": "November 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 146007329}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Cons: Onsite restaurant food made me ill, noise from airport runway was loud, walls were thin and hallways were noisy, couldn't find a hair dryer, thermostat was restricted - could not get room to a comfortable temperature, mattress was very soft.", "title": "Great Hotel with a excellent view of Boston", "helpfulness": 2, "user": "Holmesathome", "date": "November 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145851799}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were down in Boston celebrating our son's and daughters birthday. Most of the hotels that we normal go to were full (Colonade). We decided to try the Hyatt Harborside which we always saw across the bay from boston. They had availability and we ask for a higher room. The service was excellent, the wait staff surberb and the rooms were great. At night we did not need to turn on the TV since we had an excellent view of the city lights of Boston. Getting there was easy. Taking a water taxi from the Marriott made it easy. The water taxi ride was fantastic. Great views of the city from the water. Getting back to south station via the silver line was free. What a hotel discovery.", "title": "great for an early flight", "helpfulness": 1, "user": "lovetotravel291", "date": "November 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145694521}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This was our 3rd or 4th stay at the Hyatt Boston Harbor and will be our last, at least until the hotel undergoes a major refurbishment and gives a great deal more attention to food and customer service. I suspect conventions keep it going based on location alone, but it could and should be oh so much better. The view over Boston Harbor is as spectacular as ever and the convenient water taxis are a great way to come and go to the downtown waterfront. Room service food was pretty much totally unsatisfactory. My wife's cheeseburger at the restaurant came back somewhere beyond cardboard over-done when she had ordered medium rare. And the breakfast buffet would have been fine but for a 15-minute wait for replenishment of most of the hot dishes.", "title": "Great location, but this hotel is in need of a major renewal", "helpfulness": 2, "user": "HMac_2013", "date": "August 1, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 170334838}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "my room had the view of the boston habor. It was just fascinating. Great rooms, good food and service wonderful. What more can i expect out of a business hotel. Very convenient location with great shuttle service. Highly recommended", "title": "what a view", "helpfulness": 1, "user": "suman_sasmal", "date": "July 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170222950}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We spent the last night in this airport hotel to avoid the rush for an early morning flight. Great choice! Upon check in I requested a room with a view of Boston Harbor. It was granted and what a view of the skyline! The boats drifted in and out through the evening. There is also a short walk one could take along the harbor on a nice evening. The Hyatt had some little fire pits that one could sit out and order a drink to enjoy the view.", "title": "Great City Views", "helpfulness": 2, "user": "gmw0713", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 169741526}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The hotel despite its age is very well kept and clean. Not a problem at all. There was free WiFi access and a speedy free airport shuttle to get to your flight. I bid on this hotel on Priceline and it was well worth the deal!", "title": "Nice hotel, but limited room capacity and pricey, slow room service", "user": "sarechka", "date": "July 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 169526987}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I reserved a room online and selected a room with 2 double beds. Opted for the rollaway add-on. When we arrived we were informed they couldn't put a rollaway in a 2-bed room. The only other option was to exchange for a single king, which didn't help at all. Then we wanted to order room service but there was no in-room menu and the room service option on the phone linked to room voice mail, not room service. The front desk didn't have a menu but were willing to relay our order. Finally we were told that we could order the 4 beers we wished for but that it would be a 25 minute wait. Nearly $45 and 15 minutes later we had our four Sam Adams. Pretty pricey and disappointing service. We will try another hotel next time.", "title": "Looking for Logan overnight? Hyatt is best", "helpfulness": 2, "user": "Occi0", "date": "July 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169520099}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My wife and I stayed at the Hyatt Harborside hotel on the night of Monday 9 October 2006. We paid $389 plus tax for room only. Yes, the view across the harbour from our 10th floor room was fantastic, but the room itself was very ordinary. The air conditioning was noisy. irrespective of which ever setting I used, including off. It was simply a 'business type standard room.'", "title": "Poor value!", "helpfulness": 1, "user": "Malbrough", "date": "October 31, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6032448, "likes": {"liked": "— Great view from the harbour view rooms", "disliked": "— Very ordinary room for the rate."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The buffet breakfast was excellent (extra charge), but dinner in the Grill Room was distinctly average. Some of the staff need to learn to smile occasionally at the customers and our meal took 55 minutes to arrive after placing our order.", "title": "Hated It", "helpfulness": 4, "user": "Travelfreak101", "date": "September 15, 2006", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5802232, "likes": {"liked": "— Pretty view of the city across the Harbor", "disliked": "— smoke filled room, rude staff, far from town"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "We were pleased to be leaving after 1 night. A great view does not make a great hotel, especially at the price we paid. We were expecting something rather special and left feeling very disappointed.", "title": "looks can be deceiving", "helpfulness": 1, "user": "burke140", "date": "August 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 5620094}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "In all my travels, I have never seen a hotel staff so rude and unresponsive. My husband and I were attending a conference, so we brought my parents to babysit. We had requested connecting, non-smoking rooms. When we arrived at the hotel, the rooms we had requested were not available. The only rooms even on the same floor were smoking. It took 1 1/2 hours to check in. When I requested a Manager, he came out listened to my story and looked at the front desk clerk who obiviously did not know how to run the computer and said, \"You handle it.\" We went up to see how bad the smoke was in one room and I called the front desk. The clerk said, \"We are busy, I will call you right back.\" After 10 minutes, I went back downstairs. The Manager and the two clerks were standing there talking and laughing. At this point, it was not funny. I needed to get tired kids to bed. We decided to take the smoking rooms to be on the same floor, with the intention to move the next day. I stopped by the desk the next day to let the new staff know our situation. They did nothing. The Manager would not return phone calls to our room. We found a Hampton Inn right down the street. It was beautiful, smoke free and $100.00 cheaper a night. With two rooms that really adds up. Save yourself the hassle, stay at the Hampton.", "title": "Very poor", "helpfulness": 1, "user": "simon50", "date": "August 14, 2006", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 5609873, "likes": {"liked": "— Nothing", "disliked": "— Most things"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The lunch buffet was expensive and not good either and we had to unload our own luggage because a bell boy was not available.", "title": "Not at all pleased with my Hyatt experience", "helpfulness": 5, "user": "Webini", "date": "July 31, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0}, "id": 5534368}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I have stayed at this hotel before but this was my first stay for a couple of years. The check in was efficient and all the staff I met were very pleasant. Room service food was very good even if my food wasn't exactly what I had ordered.", "title": "OK Airport Hotel", "user": "AFrequentTraveller", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 123774816}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The biggest problem was the noise. There were a bunch of guys in 1217 who thought that they were on spring break. Shouting in their room could be heard the length of the corridor and they kept roaming around shouting and screaming at the top of their voices.", "title": "Nice View and deacent stay for business", "user": "ScottyA320", "date": "January 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 123747953}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "I'll probably try the Hilton next time.", "title": "choice of room seems to matter!", "user": "Andrea N", "date": "January 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 123588803}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "This is a nice Hotel - the rooms are fair sized; not big but not too small. The layout of the room provides adequate space to work. Climate control in my room was ok; couldn't dial it in for a comfy temp though.", "title": "Convenient & Friendly Too", "user": "MVeeC", "date": "January 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123519558}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I was given a room on the 9th floor facing the harbor which had a spectacular view of Boston's skyline.", "title": "Very Good, Especially for an Airport Hotel", "user": "kjdesperado", "date": "January 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123379147}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed here over a weekend and was quite pleased overall. The staff was very friendly and competent. The breakfast was great. Some shortcomings in the room itself. I would definitely stay here again.", "title": "Excellent airport hotel", "user": "PDXBigGuy", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 125772205}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "PROS:", "title": "Great Experience", "user": "Bella349", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125374781}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "ROOM: had a harborview room on the 12th floor (top is 15) which had a great view of downtown Boston, especially at night. The room was spacious and clean; the bed quite comfy.", "title": "Still a great place to stay at Logan", "user": "familyinnh", "date": "February 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 125355809}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "ELEVATORS: 3 of the fastest elevators I've ever been on in a hotel. Over my stay, I never waited more than 5 seconds for an elevator.", "title": "Attractive, enjoyable airport hotel", "user": "kakistoc", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125076413}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "BREAKFAST: complimentary Full breakfast at Harborside Grill (lobby restaurant) for Diamond Gold Passport members. No coupons, just charge to room and removed. Yurio is especially friendly and efficient, but all are great.", "title": "Very Nice", "user": "Joelfan", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124969074}, {"rating": 5.0, "title": "Newly renovated rooms are great!", "text": "Hi,", "helpfulness": 3, "user": "blondfromBeantown", "date": "April 9, 2007", "id": 7300635}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "I stayed at the Hyatt Harborside last month for a conference I was attending at the hotel. While the location isn't for everyone...not great if you want to easily walk around Boston, for example, it was perfect for our group. Attendees could easily park or if they were flying in, get to the hotel via the free shuttle in minutes. We did not have any trouble getting the shuttle to come quickly.", "title": "Just OK", "helpfulness": 2, "user": "LoveMyTrips", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7272061, "likes": {"liked": "— The view", "disliked": "— The shower"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The views from the hotel's rooms that face the harbor, our meeting rooms and the restaurant were just lovely of the Boston skyline.", "title": "Ok, but....", "user": "dollarcautious", "date": "March 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7219790, "likes": {"liked": "— Good value for close proximity to historic downtown", "disliked": "— Way too much noise from hallway and adjoining rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I was really impressed though, by the brand newly renovated sleeping rooms. All were completed by January. All new linens with lovely duvees and cashmere throws, Ipod Home docking stations, great hi speed lan or wireless internet, cool colors, decor and nice bathroom amentities, lighting and design. Loved the beds and pillows.", "title": "Going downhill", "user": "ojy", "date": "January 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 6576714, "likes": {"liked": "— Airport location", "disliked": "— run down"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I'd highly recommend this hotel especially if you want close proximity to the airport.", "title": "Great if you're flying out of Logan", "user": "Tim M", "date": "January 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6572100, "likes": {"liked": "— Clean, comfortable, great view of Boston, close to Logan Airport", "disliked": "— Limited computer facilities with high pricetage for use"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "My first stay in an \"airport hotel\" so have nothing to compare against but here are some thoughts on the Harborside in general.", "title": "Handy refuge", "user": "Ptahsuti", "date": "January 4, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "service": 5.0, "rooms": 2.0}, "id": 6550879, "likes": {"liked": "— The staff", "disliked": "— The bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006", "text": "Location", "title": "There are better choices", "helpfulness": 1, "user": "rabble", "date": "December 30, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 6519687}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Quick courtesy shuttle ride away from Logan airport. Pickup seems on the slow side. I had to wait 20 mins at Logan and 30 mins at the Airport Underground/Subway station. The City is reachable by water shuttle (didn't try this) or Underground/Subway (+ car/taxi of course).", "title": "Great staff, great position, great hotel", "user": "camdencalling", "date": "December 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6348398, "likes": {"liked": "— Excellent position for flyers together with super-friendly staff", "disliked": "— Having to pay for internet access"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled on business", "text": "The hotel", "title": "Very nice, comfortable stay.", "user": "montieds", "date": "November 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6149264}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Rooms are enormous and include a decent sized desk. Beds very comfortable. Bathroom fixtures and fittings looked distinctly tired in my room e.g. chipped bath enamel. Decor overall pretty netural - mainly beige. Boston views available at extra cost, otherwise you get the airport - but soundproofing must be top notch as I didn't hear a thing.", "title": "Finally a perfect stay!", "helpfulness": 1, "user": "brokenankle", "date": "November 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6111329, "likes": {"liked": "— Everything was perfect!", "disliked": "— No complaints this time."}}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Hotel is a very convenient business hotel, but didn't quite measure up to the normal quality of Hyatt brand:", "title": "Not up to normal Hyatt standard", "user": "tonitone", "date": "February 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 124157895}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Pros:", "title": "The best hotel in Boston-The views are the best I've ever seen!", "user": "MCMinor", "date": "January 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123871678}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "- Near to airport, free shuttle bus", "title": "Nothing Short of Perfection", "user": "facorsig", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123858196}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "- Nice meeting rooms", "title": "Ultra quiet airport hotel, nice staff, expensive internet", "user": "cheapskate1959", "date": "January 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123838083}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "- Friendly staff", "title": "Ok if you need a room and get a deal", "user": "cruiseagentandtaxman", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 123798564}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Stayed here for a conference. I found they staff helpful, especially the concierge. Great dinner recommendations. Shuttle driver was great too. We bought a weekly transit pass so the shuttle drove us to and from the T each night. I had two stays in the same week. Both times I had a room facing the runway, but there was no noise from the airport. Only challenge was door lock/key cards on room for the first stay. It rarely seemed to work and the front desk reissued my room card four times in three days.", "title": "Convenient location", "user": "Heather M", "date": "December 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 147950896}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Can't beat it free shuttle to and from airport. The room was very quiet and the restaurant was delicous. Check in service was great. Requested a Harbor view room and got it. No extra charge. only Con was the parking was $35/night but staid for a conference for 2 days and they only charged me for one night. That's what i call hospitality.", "title": "Great View of the Boston Skyline", "user": "AO_DC", "date": "December 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147794388}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Would stay again.", "title": "Fantastic View", "user": "217Love_to_travel", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147749353}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "My boyfriend and I loved this hotel! Our room had a full view of the water, and it was spectacular. We only wish we had that view every day! The room itself was very clean and well kept. The bed was comfortable and the tv was pretty big. There is a charge for wi-fi, but we didn't use it.", "title": "Great location & service", "user": "matt4633", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147691099}, {"rating": 3.0, "title": "Good location but lacks atmosphere", "text": "The young man at the front desk was incredibly nice and helpful. Also, the hotel has room service but it's pretty pricey. It might be better to just order food from the neighboring restaurants, which is what we did.", "user": "redparaman", "date": "December 16, 2012", "id": 147572373}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Major design fault with the door locking mechanism means you cannot close the door without making a very loud noise, however careful you try not to. Given it is an airport hotel, where people are arriving and leaving at different times, you are almost guaranteed to be woken up. Other disappointments were the initial unavailability of the inter-connecting rooms we had pre-ordered, only to be miraculously found 15 mins later, an expensive daily charge for WiFi PER ITEM and an even more expensive car parking charge.", "title": "Disappointing", "user": "NigeH", "date": "January 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 148833013}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "We stayed at the Hilton on the way out, which you can walk to directly from the airport. Whilst it doesn't offer the views ,it does offer a swimming pool and gym (gym closed at Hyatt) and we all had a much better nights sleep", "title": "Comfort and Convenience", "helpfulness": 1, "user": "Petunia78", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148451879}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "On the other hand,at the Hyatt side we were upgraded to harbourside rooms, which give a great view, very different to the other side where you views over the airport. Also has a shuttle bus to travel to and from the airport/subway/car rental which is free, prompt and on demand, and the staff are very pleasant and helpful", "title": "A step above other airport hotels", "helpfulness": 1, "user": "Bethdad", "date": "December 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148211375}, {"rating": 4.0, "stay_parameters": "Stayed December 2012", "text": "I have stayed at the Hyatt Harborside several times when having an early flight out or late flight in to Logan Airport. Hyatt is my first choice when staying near the airport. They have a 24/7 shuttle to the airport and the nearest \"T\" Station where you can pick up the Blue Line if you want to get out and around in the city when you have extra time. I have always been extremly happy with the hotel and hospitality. The rooms are nice and spacious, very well kept, beautiful linens with a spectacular view of the city across the water. The restaurant has a nicely varied menu and I have never been disappointed with any meal. They also have several designated \"quiet\" floors if you are a light sleeper...and very quiet heating/ventillation systems.", "title": "Just a stay over night", "user": "P1warwick", "date": "December 28, 2012", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 148207275}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Airport hotels are often dreary places to spend a night before an early morning flight but dreary is not a word I'd associate with the Hyatt Harborside. Perched on the edge of Boston harbor with huge windows that invite guests to see the passing panorama on the water, the Hyatt is a hotel that knows exactly what it's doing. The front desk staff is fast, hospitable, personable, not the hostile or indifferent types that hotels so often and so inexplicably put out front. The rooms are medium sized, sparklingly clean and tastefully furnished. A dynamic display screen in the lobby keeps guests up to date on flight status and a computer terminal is handy for printing out boarding passes. The shuttle service from Logan terminals is prompt and courteous. My wife and I have stayed at the Hyatt three times before early morning flights and each time had rooms that overlooked Logan Airport runways. But the roar of the jets outside never filtered through what surely are sturdy double glazed windows. We have stayed only in winter so the outdoor terrace off the hotel's dining room has been closed, but we've often remarked it must be a terrific warm weather spot to sip a drink and watch the sun set behind Boston's skyline just across the bay. A jogging path is all that separates the terrace from the water. Even though the Hyatt is at the far corner of the airport, it sits next to both a bus stop and a ferry landing. Water taxis and public transit boats zip passengers to Boston's thriving waterfront in ten minutes with no traffic hassles and the bus connects to Boston's extensive MBTA transit network.", "title": "Great View, Great Service, Great Restaurant", "user": "DRRIGBY", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148161367}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "we went there in winter,but it wasnt snowing yet. we took the harbour view room and just loved it. the room is very clean and the view it gives from the large window is great. can see the whole boston skyline. looks more lovely at night. the dining area is aslo nice giving the view with large glass windows. good place to just seat at any time of day. they have some books also there to read. the inside pool was closed then and so couldnt enjoy that. but the hotel is located in such a location that you cant resist walking the back side of it (even wearing jackets). there is a walking path out the back of hotel where you can take in the sun and the view,aslo the sound of ocean and the ferries going by. also you can see the airport and planes landing ffrom the elevators. the BEST PART IS FREE FERRY SERVICE. make sure to ask for it and take a ride in it. it takes you to the north end and can bring you back also at your time,you will just have to take the time. definately a good location for this hotel. we will be coming back again for the view. the staff is very helpful and pleasant. they upgraded our room on request since it was my birthday.", "title": "excellent location,boston skyline view+ ferry service+airport near", "helpfulness": 1, "user": "H B", "date": "August 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 171226406}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I stayed at this hotel for just one night en route to the Cape. It was a nice property, great staff, good food, magnificent view of the city. The room was comfortable and quiet. We took the water taxi. It was a fun experience, even in the rain. It is covered by the way. I would stay here again.", "title": "Wonderful Stay", "helpfulness": 2, "user": "malkodj", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171205625}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Hello - my daughter and my best friend from NJ and myself all just stayed here this past weekend for the Days of Our Lives Event. When my daughter and I arrived on Friday about 2:30 pm, we were immediately checked in and were 'upgraded' to one of the high floors (12th floor) with the harbor view. When we went into our room (our bellman was wonderful too) the view from the huge picture window left us both speechless!!! The entire Boston Harbor, the skyline, the boats, just never wanted to leave that room! The room was so clean and comfortable with some of the most comfortable beds that we have ever slept on. Maids brought us as many extra towels as we needed! The restaurant was wonderful, great food. The event staff worked very hard and it was a huge success. We hated to leave!", "title": "Fantastic hotel, views to dream off!", "helpfulness": 1, "user": "Kathy M", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170866022}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "August 3, 2013 arrived at hotel greeted with a wonderful man behind desk Louie who could not have been nicer. The hotel is clean great service and in a wonderful location to airport and the water taxi taking you to Waterfront for attractions and convenient to North End . The waterfront view from hotel room AWESOME & I would definitely stay again at this Hyatt.", "title": "Great place to stay", "helpfulness": 1, "user": "judithing", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170816975}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "We booked the Hyatt to be able to stay over prior to our early flight from Logan. This hotel provided courteous and efficient service. We were generally pleased with the breakfast and the shuttle to the airport. I've stayed at the Logan Hilton in the past, but prefer the Hyatt.", "title": "Excellent place to stay while at Logan Airport", "helpfulness": 1, "user": "SWhitbourne", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170498980}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed here during most recent trip to Boston. The hotel is older, however the service makes up for it.", "title": "They value their customers", "helpfulness": 2, "user": "JamieH21", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 169348018}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "First, you have an incredible view of the harbor and it was really nice to sit outside and take in the view as the sun set.", "title": "A Boston Hotel That Goes Above and Beyond!!!", "helpfulness": 2, "user": "Elizabeth K", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169230633}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Second, the Hyatt shuttle service is incredible. We took the shuttle from the airport, to and from the T station, and to the rental car place. We never waited more than 5 minutes for the shuttle to arrive and the drivers were helpful, intelligent, nice and funny.", "title": "Lovely patio", "user": "akbuddie", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 169101779}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Third, during our first night we were awoken by some noisy neighbors - a family with children who we didn't hear earlier in the day. I assume they checked in after arriving on an international flight. I called the front desk and explained the situation, and within minutes everything was quiet again. This wasn't enough to get us worked up and honestly being this close to an international airport, I bet this hotel has lots of guests checking in in the middle of the night - that being said the hotel is more than equipped to deal with this in a polite and efficient manner.", "title": "Great place to stay", "user": "ILoveWisconsinSnow", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 169087708}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "-Also, the location is very close to everything you want to see in Boston via the T.", "title": "Location: The Up AND Down Side", "helpfulness": 2, "user": "lwsara", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 169064152}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Not only are you right at the airport (looking out over a runway as you are in the elevator), you will have a great view of Boston (city view rooms). Water taxi is right next to the hotel. Walkway along the water to walk or run. One of hte best clam chowders around. When weather permits, outdoor dining with a view of the city.", "title": "Great airport hotel", "user": "William746", "date": "December 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147051289}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "My first time to Boston and I had a chance to stay harbor-side at the Hyatt. It was located right next to Boston Logan Airport so very convenient in that regard. Right on the water with amazing harbor view....there was Boston, right across the water. So close, yet so far away. Read on for more.", "title": "Convenient to airport, but not much else", "helpfulness": 1, "user": "TravelingFam22", "date": "December 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 146826224}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Pro's:", "title": "Service and food great - noise not so great", "helpfulness": 1, "user": "ValVil", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 146612329}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "1. Convenient to airport", "title": "Great Airport Hotel w Great amenities", "helpfulness": 1, "user": "lanzmo", "date": "December 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146583447}, {"rating": 5.0, "title": "Fantastic Hotel!!!", "text": "Free shuttle gets you to the hotel in about 10 min max. Great if your meeting is at the hotel or on the airport-side of the harbor.", "user": "Neil H", "date": "December 1, 2012", "id": 146572334}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The plus; minutes away from the airport - non-stop shuttle to and from airport and on demand shuttle pick up from car rental facilities. Water taxi to downtown from hotel and shuttle to the Silver Line - free wifi for 1 hour. The cons - only 1 restaurant for all meals. Very slow service - seems like food has to be transported from upstairs - hard on the staff and takes time - expensive $18 for a ham and cheese omelette (no toast or potatoes at my request) and tea - $80+ for 2 main courses and 2 glasses of wine. Would stay here again only if flying out early the next day. We asked for harbor view as recommended here and had to pay $20..were told normally costs $40 additional - but we had booked our room via Hotwire so perhaps that is why.", "title": "Only 1 restaurant but very convenient to airport", "helpfulness": 1, "user": "natmicstef", "date": "August 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171834550}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We just spent one night at the Boston Harbor Hotel before flying out early in the morning. I'm a Hyatt Platinum member so was \"rewarded\" with a ninth floor room sharing the floor with an entire wedding party (two rooms of which contained small yappy dogs). At night, there was a continuous stream of loud, drunk people walking down our hall until about 2:00am (the dogs stopped barking by 11:00). It's not really the hotel's fault; they did have a sign at the elevator asking people to be mindful. But, i think they should do a better job of separating people that are there for events. The rest of our stay was fine. The shuttle driver was punctual, the view from our room was great, and the front desk service was prompt. I can't recommend this hotel mainly because the one thing we needed from it (to get a good night sleep) was not possible.", "title": "Please stop the noise", "user": "gbob", "date": "August 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 171812084}, {"rating": 4.0, "title": "Good place", "text": "Friendly staff told us what was the quickest way to Boston which was water taxi. Not the best location but still close to Boston and right next to Logan. Room nice and spacious with view of Airport which was cool. Nice sleep bed was comfortable. Nice place if you have to fly ok if you are not flying.", "helpfulness": 1, "user": "Bob L", "date": "August 10, 2013", "id": 171613790}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We were only there for one night before our flight the next day. The hotel is very bright and airy and has a wonderful view of the harbor. Didn't really get to spend much time there. Were very impressed with their concierge. He was so very helpful. We dropped off our bags and then went to drop our car off. We then went into the city to sightsee. We wanted to take the subway from the city back to the hotel. The concierge gave us his number to call and we took the subway to the airport station and called the hotel and the van came right away to pick us up.", "title": "Great Service and View", "helpfulness": 1, "user": "petsitter", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 171514192}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Because nobody would willingly stay at an airport hotel, unless obliged by a lay-over or a business meeting, guests are effectively trapped and victims of limits on quality.", "title": "Okay So Far as it Goes -- Which is Not Very Far", "helpfulness": 2, "user": "Jim P", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 171460707}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "I stayed at this hotel for Sunday night in July 2006. Booked the room for just $82 on priceline (with additional $16 in taxes and fees). I guess the hotel is willing to go extremely low during weekends. However, you get what you pay for. I am not saying the hotel is extremely bad (after all it's 4+ stars) but there were a few things that have made my stay VERY unpleasant:", "title": "A few negative points regarding Boston's Hyatt Harborside", "helpfulness": 2, "user": "GREAKLY", "date": "July 27, 2006", "detail_rating": {"value": 2.0}, "id": 5520779}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "1. In addition to the room price I was charged $30 for overnight parking. I felt that was outrageous. The only occasion when I paid more was downtown Manhattan. Accross the street airport parking costed $17. Not cheap either, but at least somewhat sensible.\\", "title": "Excellent location, great value!", "helpfulness": 5, "user": "momentum12", "date": "July 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5493295, "likes": {"liked": "— quiet and clean", "disliked": "— hotel shuttle"}}, {"rating": 2.0, "title": "Beautiful but staff needs to rally!", "text": "2. The room did not have a freezer/minibar. No idea why. You would not expect one in a roadside motel, but at a 4+ star hotel??? Strange... They did, however, have an ice machine on the floor, which solved the problem.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 5, 2006", "id": 5431449}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "3. The bath tub did not have a rubber mat. To make things worse there were misleading dark oval dots on the bottom of the tub. Thinking they were made of some sort of anti-slippery rubber I stepped in and ... immidiately felt down hurting my anckle and knee. Be VERY careful when using the bath tub at this hotel.", "title": "Fantastic View of Boston Harbor", "helpfulness": 3, "user": "LouisvilleGuy", "date": "May 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5037563}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "I must admit though that the management was very responsive. When, during the checkout, I told them about the bathtub problem, they promissed to send someone to bring the rubber mat right away. They also waived my parking fee for the inconveniece.", "title": "Great Views!", "helpfulness": 1, "user": "agirlinfin2004", "date": "March 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4772621}], "location": {"country": "United States", "city": "Boston"}, "stars": 4, "variance": {"poor": 55, "average": 109, "very good": 287, "terrible": 29, "excellent": 291}, "aka": "Hyatt Harborside At Boston`s Logan International Airport Hotel", "slim_ranking": 0.493506493506, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Modern glass lighthouse compliments the Boston Harbor setting, seven minutes by water transportation to the heart of Boston. Elegant touches, superb facilities and all the amenities complete the picture, tying in the stately flair and nautical theme. This hotel boasts unparalleled views of the city Skyline, and sits right along the banks of Boston Harbor."}