{"user_rating": 4.0, "review_count": 276, "name": "HYATT house Los Angeles/El Segundo", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Just stayed in this hotel - 2 bedroom Suite for 7 people. For the price we paid, it wowed us. Exceptional Service! All staff are super friendly and do everything they can to whatever we need. The room is clean, I give it 4 out of 5, there are several small things that are not superb, but overall very satisfied. The rooms are a bit small for a group of 7, there are not enough desk space and the washrooms are a bit tight. But that is not their fault as not many choose to squeeze 7 people in one place! Breakfast is great, with a good variety, staff keep refilling the food. We tried one social night and thought it was very good as well, food quatity never went low. Gym is small but clean and spacious. My friends enjoyed the pool a lot. The downside is there are no elevators, so we had to take our luggage up the stairs. But it didnt bother me too much. and I wish they provide shuttle to the LAX airport. I see they do grocery shopping for you as well, but I never tried.", "title": "Great Choice", "helpfulness": 1, "user": "jodcha", "date": "October 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119611856}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "I am impressed with this hotel. For the price we paid, I cannot expect Rtiz, but they definitely are the Rtiz for the same star hotels. Whenever I can, I plan to go back to this chain for future trips.", "title": "Fantastic from start to finish!", "helpfulness": 4, "user": "suearoma", "date": "September 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118713809}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Stayed here from 12th September until 26th September 2011. My husband and I with my 18 year old daughter and 20 year old son. Loved this place from start to finish. Nothing is too much trouble for the satff and everyone is so welcoming and friendly. Complimentary breakfast contains two different kinds of melon, yogart, porridge, scrambled eggs, sausage/ham, potatoes/waffles, bagels, toast, fruit juices and tea/coffee. They also provide a social hour Mon through Thurs with free wine/beer and light bites(free) Rooms are spacious and spotlessly clean. Safety deposit boxes are provided at reception and that is also free as is the gym, parking and internet. The pool was a lovely temperature and the jacuzzi was as warm as bath water. There is a room with two computers with internet access and a guest laundry. They charge $1.50 per washing machine load and the same for drying. The machine takes quite a large amont of washing, so nice not taking home all the dirty washing! Would highly recommend this place to anyone. Will definately be back again!", "title": "Just OK", "helpfulness": 1, "user": "thelovelymrsd1951", "date": "September 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118507570}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Stayed 2 nights at this hotel in late September 2011. This was not an exceptionally clean hotel. Seems like floors had not been vacuumed from prior guest. I asked housekeeping to run the vacuum and they never did it! Sheets always fell off of beds! Breakfasts were good, standard. Afternoon snacks were just OK. Room cards would not work after first day, had to go to desk to have them reactivated....same thing happened next day after breakfast. This is extremely inconvenient and frustrating after arriving at the room after a full day's touring. TV's were flat-screens with good reception. This place is right beside a metro-rail and is VERY NOISEY when they go by! Be aware! Ask for a room far away from the track!", "title": "Good for one day", "helpfulness": 1, "user": "Georgia C", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 118005005}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The biggest problem is that the hotel does not provide a shuttle transfer from the airport. As it's too close, the taxis may refuse to drive you there. So, just book if you have a car. If you don't, you should choose some others with a regular shuttle service. Another downside is there is not elevator - if you don't ask for help you may have to carry your bags for two floors. In fact, we left too early so there was not staff available to help us with our luggage.", "title": "nice", "helpfulness": 2, "user": "thwong", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117731481}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We spent two nights at the Hyatt Summerfield El Segundo in late July, after we had joined a three-day packaged tour of southern California that took us to the obligatory Disneyland, San Diego Sea World and Universal Studios. Prior to arriving at the Summerfield El Segundo we had spent three nights at the dreadful Howard Johnson Fullerton, the designated hotel of the packaged tour.", "title": "Nice family get-away", "helpfulness": 1, "user": "allanng2004", "date": "August 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116991811}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We were therefore very happy when we saw that our suite at the Summerfield was rather spacious, which came with a sitting room and a fully-equipped open kitchen, together with a big king-bed room with walk-in closet. The design and decoration were modern and simple but still tasteful. Everything was in working order, well maintained and clean.", "title": "We keep coming back", "helpfulness": 1, "user": "JM D", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116859316}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The great thing about this hotel is that it offers breakfast and evening snacks for free. For breakfasts, hot dishes included scrambled egg and sausages, plus salad, cold cuts, yogurt, pastries and various juices. Choices were a bit limited but quality was good. At evening, from about 5:30-7:30, the hotel hosts a so-called social hour where a simple snack (such as pizza, or taco, or some sort of pasta) plus green salad are offered for free. There is also unlimited supply of red and white wine. On the two nights when we were there, my wife and I virtually filled ourselves up at the social hour so that we didn’t need a proper dinner afterwards.", "title": "Thumbs Down, Unfortunately", "helpfulness": 3, "user": "Angie55", "date": "August 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 4.0, "service": 4.0}, "id": 116619900}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Our son didn’t eat much at social hour, for he was busy playing basketball with the other kids at the hotel. In the courtyard facing the dinner room, there is a basketball court as well as a swimming pool. Other hotel facilities include a gym and a coin-operated laundry room.", "title": "Family Friendly - Great Place to Stay", "helpfulness": 1, "user": "javillane", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116619755}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The hotel is within walking distance of the Douglas Station of the Green Line of Los Angeles Metro system. From Douglas, it is a few minutes ride to the Aviation Station, where one can take a shuttle to LAX airport.", "title": "Truly Excellent", "helpfulness": 1, "user": "dk2227", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 116579610}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "I stayed here with my husband and my 16 year old sister for 7 days. A perfect location for all of the LA area sites. The room was clean and large enough for us to have some privacy as well. The only complaint i had was the bathroom was in the master room which meant my sister had to come in our room during the middle of the night to use it", "title": "Great location & Clean Hotel", "helpfulness": 1, "user": "Koolkerry7", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115899020}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The breakfast was perfect - we never used the night cocktail reception. The staff was perfect! great location!", "title": "Fantastic", "helpfulness": 1, "user": "ChrisPAngKatHol", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115635951}, {"rating": 5.0, "title": "Best hotel on our holiday", "text": "We stayed as a family of 4 and it was perfect, great facilitites, great location, great staff. Loved it!", "helpfulness": 1, "user": "george2997", "date": "July 20, 2011", "id": 115592288}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My family of four people stayed here in the two bedroom suite.", "title": "Excellent", "helpfulness": 1, "user": "Ofield", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115580666}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is close to the airport, but there is no noise at all from aircraft. Reception staff were very friendly and helpful. The room itself was very good. The two bedrooms each had their own bathroom and great bedding. There was a shared area in between with a kitchen which was very well equipped with fridge/freezer and hobs and microwave. The free internet service was very reliable, there were three TVs altogether, and even a TV guide.", "title": "Beach, LAX, Hollywood Family vacation", "user": "AthenaP1", "date": "July 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115556215}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Their complimentary breakfast is a must with a variety of good and healthy food.", "title": "We loved it and will definitely be back!!", "user": "rosannae", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116325528}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This is wonderful choice for family vacation in LA. We had a double room suite with a fully equipped kitchen and a living room. Each room with a bathroom and a wardrobe-room. Clean, quiet, with complimentary high-speed internet. We had some problems with the air conditioning though, but they were minor compared to the overall good stay and comforts.", "title": "Perfect suite for a family", "user": "KaliThessaloniki", "date": "August 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116183155}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "The pool and the jacuzzi were great and kids had lots of fun there.", "title": "Nothing special, but good enough", "user": "Charles02138", "date": "July 29, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 115969104}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The complimentary breakfast was even better than expected, although the service in late breakfast hours was a bit slow...", "title": "Excellent hotel.Superb Staff", "helpfulness": 1, "user": "SteveStandish", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115903007}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "There were laundry facilities (thank God!) and a good business center. The personnel was very helpful.", "title": "Nice Suprise", "helpfulness": 1, "user": "kitson12", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 115902505}], "location": {"country": "United States", "city": "El Segundo"}, "stars": 3, "variance": {"poor": 15, "average": 23, "very good": 109, "terrible": 14, "excellent": 115}, "aka": "Hyatt Summerfield Suites El Segundo Hotel El Segundo", "slim_ranking": 0.4}