{"user_rating": 4.5, "review_count": 1035, "name": "Hyatt Regency Scottsdale Resort and Spa at Gainey Ranch", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "If you're searching for a romantic weekend getaway or even a relatively quiet hotel, choose another hotel. There's no doubt that this Hyatt is beautiful and well maintained. The pool area is magnificent and that alone attracts many local families for the inexpensive weekend rates during the summer months.", "title": "Overrun by kids - thought I was at Disney World", "helpfulness": 2, "user": "KSLinda", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 37491031}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Yes, there is an adult pool, but it's adjacent to the kids pool which is noisy beyond belief. Kids frequently wander over to the adult pool to sit on the edge of the pool with parents. No one makes them return to their own pool.", "title": "Wonderful Stay", "user": "Jmmm", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37074499}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "In the evenings a large screen TV sits by the kids pool and blares movies that can be heard throughout the entire pool area - so forget a quiet evening swim or even sitting poolside.", "title": "a resort to dream about", "user": "griswolds09", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 36971582}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "While we were there, the lobby looked ilke a kid / teen pageant area. There seemed to be many youth groups too. Hallways resounded with loud talking and banging doors for most of the evening.", "title": "Spectacular!", "user": "rawtravel", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36829086}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Within 10 minutes of arriving in my room, a baby was crying loudly in the room next to mine. I could hear numerous small children playing. When I returned to the front desk to ask to be moved, even the staff appeared to be puzzled about where in the hotel they could give me a room with some semblance of quiet. I was offered another room and moved. However, it wasn't much better, but at least the front desk staff tried.", "title": "Very good for the $", "user": "muhawk23", "date": "August 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 36761814}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "Stayed for one night in August. It is very nice. As a Hyatt platinum passport member I was bumped to a suite which was nice enough, but didn't really wow me. Slightly outdated. Bathroom vanity only has one sink. I am kinda picky. Also had access to the regency room...Once again very nice. Wifi was also free due to my status. Hotel grounds are incredible. Location is fantastic. Hotel does charge a $20/day resort charge to cover lots of things wether you use them or not. The staff at the hotel was really fantastic.", "title": "Good", "helpfulness": 1, "user": "Billyphx", "date": "August 25, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117254419}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Loved it! There's no denying that is was hot but being in and out of the pool all day made for a very comfortable stay. One detail I really liked about this hotel is the pool towels. My pet peeve is when you stay at a pool resort and the towels that are provided are barely big enough for a child. This is definitely not the case here. Also, be sure to visit the Native American Learning Center. The room was cool and quiet with a very comfortable bed.", "title": "Loved it!", "helpfulness": 1, "user": "KatmanduNorthernNJ", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117232608}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I fell in love with this hotel. The landscaping is immaculate. There are palm trees all over the place, the pools are wonderful, the outdoor seating for the multiple restaurants is very pleasant. The inside is very large and although I got lost at first, there was plenty of friendly staff to ask for directions along the way. The restaurants I tried are very good (see the reviews for those for more detail). If I had to change anything, the pool needs a little preventative maintenance and the computer in the business center is very slow and frustrating. But those two things were very minor compared to the many great things this hotel did have. I would stay there again in a heartbeat.", "title": "Loved it!! I would definitely recommend to friends.", "user": "CarenaM", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117205637}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "We went with a group of 15 or so people. Nice pool, many other people here, I would say late 20's crowd. Most of the families and kids are at the sand pool.", "title": "Nice Adult Pool, Great Party Poolside!", "user": "BeachBuzzed", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117105277}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Rooms were clean and up to date. They charge $30+ for overnight valet. I had such a great time poolside forgot to move it in the evening, oh well.", "title": "Complete luxury experience--business and leisure", "user": "Zoomer2You", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117055927}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My wife and I celebrated our anniversary during the weekend of August 8-9, 2009. The hotel service was excellent, the room was very clean and updated. We loved the fact that they have an adult only pool - and it was a good thing since the family pool was a zoo on Saturday! While at the adult only pool we ate lunch at the cabana bar near the pool. We got to talking with the bartender, and during the conversation mentioned that we were celebrating our anniversary. When we returned to our room later that afternoon, the bartender had some chocolates waiting in our room - nice touch! I only had 2 minor complaints during our stay: 1) The pools need to be renovated - not that big of a deal. 2) When we checked in we asked about the fitness room and if it was included in the price of the room. We were told that it was. Upon check out I realized there was a daily $20 resort fee added - apparently use of the fitness room wasn't free after all....Overall, the hotel is awesome and a great place to spend a romantic weekend!", "title": "Great Hotel - Loved the Adults Only Pool", "user": "cupcake3439", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39010367}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "My family just stayed a week at the Hyatt for some leisure time just before school starts, we thoroughly enjoyed the resort and the staff was very accomodating of our needs. We had (2) rooms and they were both clean and looked like they had been recently renovated.", "title": "excellent stay at Hyatt gainey ranch", "user": "71bronc", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38773879}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "My kids enjoyed the pool area especially the volleyball nets, basketball, they also liked that the pool area was kept open late so they could take a swim after dinner.", "title": "Not the greatest stay...", "helpfulness": 2, "user": "animal_lover8", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 37786006}, {"rating": 4.0, "title": "Everyone here has a \"can do\" attitude", "text": "My wife and I dined at Alto the Italian restaurant at the resort, it was very good and Jay our server was excellent, we also enjoyed breakfast every morning at the SWB restaurant.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 15, 2009", "id": 37758751}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Our family planned a weekend and the Hyatt for me and my husbands birthday. We got a fairly decent rate - $179 a night for a suite.", "title": "Absolutely Wonderful Resort", "user": "luvsgrandcayman", "date": "August 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37619231}, {"rating": 5.0, "title": "Sublime", "text": "Stayed here last week for 3 nights. Really great hotel! The grounds are beautifull, nice pools, great service and hotelbar. The restaurants in Scottsdale are sublime! We had a great time", "helpfulness": 7, "user": "ans206", "date": "November 15, 2004", "id": 2825449}, {"rating": 5.0, "title": "First Class", "text": "My second visit to the Hyatt having stayed for a week on business in summer of '03. Enjoyed it so much, travelled back from the UK this summer with wife and two teenage children. Booked two Regency Rooms for two weeks and was NOT disappointed.", "helpfulness": 9, "user": "Scotsman1", "date": "November 8, 2004", "id": 2812998}, {"rating": 3.0, "title": "So-so", "text": "Staff very friendly and helpfull, Club Lounge facilities excellent and very knowledgeable concierge who advised on Scottsdale restaurants to try. Rooms very quiet and comfortable and pools/grounds extremely attractive.", "helpfulness": 9, "user": "mandssa", "date": "November 3, 2004", "id": 2804209}, {"rating": 2.0, "title": "Less than SO SO rooms", "text": "I spend a considerable time in hotels throughout the UK of a similar (price) standard and the Hyatt has yet to be matched. Sad that some travellers have had bad experiences but don't be put off, the same can happen anywhere but I don't believe that it is by any means the norm at the Hyatt.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 18, 2004", "id": 2755103}, {"rating": 5.0, "title": "Outstanding!!!!! highly recommended", "text": "Enjoyed the place so much, we are trekking 1/2 way across the world, back there again next year for another two weeks! I think this underlines how much we enjoyed it and what a great place to stay.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 11, 2004", "id": 2695970}, {"rating": 5.0, "title": "Quit Your Whining", "text": "We just came back from this resort and had a great time. I can say that the negative reviews I read online prior to my trip were things I did not experience during my stay. The staff was always friendly and helpful. Our room was part of the Regency Club category but upon check in we were told that the club was closed until 9/7, the day after we were scheduled to leave. For the inconvenience, we were given complimentary breakfast at the Squash Blossom every morning of our stay. This was no donut & coffee freebie. I had poached eggs and filet mignon twice! The concierge was more than happy to suggest day trips and excursions throughout our stay. We had so much fun exploring Sedona, shopping, and seeing the desert from a hot air balloon! All planned for us by the resort. The resort is beautiful and so clean. I would definitlely come back and stay at the Hyatt.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 8, 2004", "id": 2517882}, {"rating": 5.0, "title": "More than wonderful!", "text": "I really had no idea what I was booking when I chose this resort to stay in because I was looking for the closest place to my daughter and her future inlaws home and this seemed to be the place. I did call days in advance and request a non smoking & QUITE room (my mom was with me and needs it quite) When we arrived at the resort to check in we were 3 hours early and because our room was ready and available, we were allowed to check in then! A+... The room was really perfect for just us and the best part was the balcony where we enjoyed our morning coffee! We both hate a/c and in Rhode Island you can really live without it so we turned it off at night to sleep and just kept the screen door shut onto the balcony....it worked perfect and we had 2 excellent nights sleep. It was quite and the bed comfortable! We were probably the only 2 people in August in AZ sleeping without a/c!! I had read other reviews and heard complaints about the price of the food but hey...your in a 4 star resort....need more be said? We did eat lunch in one of the restaurants and it was very good, the waiter was very friendly and the service good. The girl that works in the small coffee shop in the morning was just the most pleasant person ever! I found the staff very helpful and friendly and even the early morning workers in the pool area were very nice. The place was very clean and we saw firsthand how hard they work every morning to get ready for another busy day and believe me, the place can get busy but with 98+ degree weather....the pool is the place to be! It was hard to find a chair to lay on but even if they had more, they would of been taken....they did have alot, could of used more, but it wasn't more than 5 -10 minutes we did find a lounge chair and it was so hot after 3 minutes you had to get into the water so the chair was not that big of a deal to us. If I had to get really nit-picky and find something to complain about i'de say, change the lighting in the bathroom....it makes you look like your skin's yellow! Out side of that, it was a more than wonderful stay!! Thank you to all the staff and people seen and unseen. GOOD JOB!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 2, 2004", "id": 2508332}, {"rating": 2.0, "stay_parameters": "Stayed January 2005", "text": "Stayed at the resort for 5 days with my 2 daughters (7 and 11).", "title": "Good and Not So Good", "helpfulness": 5, "user": "gbtour", "date": "August 25, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 2494388}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "I love this hotel! I have been here many times over many years, and it still is one of my very favorites. The setting is just beautiful, rooms are comfortable, service is friendly, food is delicious, and the pools/fountains/waterfalls are especially lovely. Even with other people around, the sound of the water makes it so relaxing. The live music in the evening is open to the outdoors and is enchanting. I have stayed at other resorts in the area, but continue to return to the Hyatt Gainey Ranch.", "title": "The Best", "helpfulness": 1, "user": "sixfoot2", "date": "August 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116287915}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Nothing bad to say about this hotel. We stayed from Tuesday until Saturday. The staff were fabulous, the pool area was ridiculous, and the shower was phenomenal. Highly recommend this hotel.", "title": "Fantastic hotel!\"", "helpfulness": 1, "user": "sixfoot2", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116284880}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "-We stayed 2 nights and had an ok time. We were disappointed by the size of the guest rooms for the price; we've stayed in Super 8's that had larger rooms, but the rooms have everything you need and are quiet, clean and comfortable.", "title": "Rooms are just ok, but the property is fantastic.", "user": "harpmaster", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 116271241}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "-The service was fantastic; everybody really aimed to please.", "title": "Beautiful resort, but consider this.", "user": "Kleontie", "date": "August 3, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116217405}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "-Loved the pools. Just right for families. We spent a full day at the pools and just loved it.", "title": "Unexpected Bliss", "user": "DavoMama", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116079081}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The employees were all very friendly and helpful. Outstanding customer service!", "title": "Outstanding resort!", "user": "eddiebill", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 116067974}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Very large and beautiful pool area. The only draw back for us was that they were allowing small children into the \"adult only\" pool. Room was noisier than we expected. Keep in mind that the 2nd floor is the main floor so there is a lot of noise and traffic in the hallway. Avoid room #2748, it's next to housekeepng and ice machine.", "title": "Stunning facility", "user": "Melodyc37", "date": "July 28, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115942498}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "This is a true resort- you won't want to go anywhere whilst staying here! The facilities are top class and due to it's large size lots of interest and places to run around and explore with kids. We stayed in a Regency Club which is well worth it for the breakfast & daily snacks. I thought our room could have been a bit larger but it had a wonderful view of the mountains & lake from the large deck/patio. The staff were friendly & helpful. The only bad experience we had was with Camp Hyatt. I am not familiar with hotel camps but the ladies running the camp were very unwelcoming, looked tired and disinterested and my son did not want to go back after just one afternoon. He had an accident going to the bathroom and fell in the toilet just before I picked him up and he was totally soaked. The lady was not apologetic or concerned and then reported that he had wet himself so when we went back the next day the new staff member just said he was \"not allowed because he wet himself\" without any concern that this was being advised in front of other customers as well as my son. It was a real shame as the service in the hotel was excellent and the Camp left a bad impression of our visit as the same standards were not applied.", "title": "Paradise in the desert!", "user": "svwc", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 115921551}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I stayed here with 5 of my girlfriends celebrating my bachelorette party & it was amazing!! The staff was very friendly, hotel & rooms spotless, pool was refreshing & lots of pool activities (volleyball, basketball, water slide or beach pool). There is also an adult pool if you just want to relax. It's about 20m to PHX airport. It's very close to Old Town Scottsdale where all the nightlife is. We only ate dinner once at the hotel & the food was delicious at the SW Grill. As expected, food was pricey but if you want to eat outside of hotel, there are many options. We had breakfast at Butters, down the street from hotel. Not only was the food delicious but the prices were cheap! I recommend renting a car to venture out & book tours outside of hotel. We did a kayaking trip for $38 at Saguaro Lake Ranch & the hotel wanted to charge us $150 or more for the same trip! Other than that, we loved this hotel!!", "title": "When you really want a taste of desert spendor...one very small glitch...maybe two", "user": "Remmy19", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115906741}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We love Sedona and visit there every year ...but first we have to get our fix of the Hyatt Resort -Gainey Ranch. Typically we stay here two nights before we head up to Sedona. Great start to any vacation. What a property. Hyatt always seems to get it right.", "title": "Nice Getaway", "user": "bellaborges", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115864741}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "this was about the 5th time or so we visited this resort. we were always excited about this place, and still are in a way. the pools and gardens are awesome. after visiting so many resorts in the area, they surely belong in the top 3. this time however we noticed that this hyatt seems to having introduced a saving plan which comes down to their customers. we booked the regency club included: no more honor bar. you pay per order and restaurant prices are charged e.g. beer usd.4 or 5 etc. Hors d'oeuvre think of meat balls and dry vegetable quesadillas. dessert cakes limited to two choice of lesser quality. breakfast consists of smoked ham, a few cheeses and cold hard boiled eggs, no variation, no salmon, no salami, always the same. this gives a cheap impression and is below hyatt standards. the best example for us how the management tries to save on their customers can be found in the room: no more mouthwash during our entire stay and what used to be fuji water for usd.5 in the room turned into aquafina. in those hyatt \"how can we save\" workshops was clearly too much attention for taking away or downgrading those little things which gives the customer the royal feeling. it's also the customer who compares with all the other resorts in the area and in that price range. well, those little things: almost every basket- and volleyball was lacking air. staff appeared indifferent. and why are only the sunbeds at the adult pool cushioned? the service went pretty much downhill and we have to think twice before coming back. a shame for such a georgous venue.", "title": "regency club and all the little extras", "helpfulness": 5, "user": "griswolds09", "date": "August 18, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 1.0}, "id": 116903956}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My husband and I stayed at this Hyatt and we were dually impressed. The grounds are beautifully landscaped. There was live music and the hotel staff was always ready to help. Our room was very comfortable and clean. Lovely. My only complaint was that the bed was too soft, but that is a personal preference. I would definitely stay here again. Excellent!", "title": "Beautiful hotel, excellent service, and very pleasant stay", "helpfulness": 1, "user": "gypsylady3200", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116825383}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We spent two weeks around christmas at this hotel, and were completely amazed by the ability to run a high class hotel but still with a family feeling.", "title": "Best place ever ?", "user": "NativeSwede", "date": "August 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116645416}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed in February and it was absolutely beautiful. The grounds were kept up so well and I loved walking them in the early morning. The pool was great with volleyball nets, basketball hoops and even a water slide. There was a shuttle service that went to local shopping areas and she even stopped to drop us off at Camelback mountain which we hiked in the morning and then she came back to pick us up. I don't recall her name but she was very informative about the history of Scottsdale. We took a night time gondola ride in their pond and the gondalier even sang for us. It was definitely a great vacation....we couldn't have asked for more!!!", "title": "Best Hyatt Resort....beautiful property!", "user": "DreamsPoetry", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116472240}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Our family spent the last night of our Arizona vacation at the Hyatt Regency Scottsdale. The hotel is beautiful, and the recently-renovated rooms were comfortable and well-planned.", "title": "Hyatt Regency Scottsdale did not meet our expectations.", "user": "TexasMom-of-Three3", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 2.0}, "id": 116365682}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "You will find a real gem. They put on a great forth of July firework show. Every person from the valet to the sweet maids that get to know your coming and going are great", "title": "We love this resort and plan to get back soon.", "user": "travelyFortWorth", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35501036}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I stayed for three days and had a wonderful time. The hotel is spacious, with lovely grounds and a fantastic series of swimming pools. It even has a lap pool! Also, a beach with real sand at one end of the family pool and a great water slide.", "title": "Delightful stay", "user": "GrannyC44", "date": "July 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 35160546}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "My room was clean, nicely decorated and comfortable. Good quality fixtures in the bathroom with a large shower.", "title": "Wonderful!!!", "user": "travelen4l", "date": "July 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35076548}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "My sister and I ate at the two restaurants and the food was excellent.", "title": "Pretty, but the service really lacked.", "user": "sweptawayy", "date": "July 16, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 34959395}, {"rating": 5.0, "title": "An awesome place to celebrate the fourth of JULY!", "text": "Service was generally excellent.", "user": "HappySPAtypes", "date": "July 16, 2009", "id": 34937809}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Had a great time with the family for a week at the Hyatt Regency/Scottsdale. Plenty hot, but no shortage of space at the pool. The kids loved the 3 story high twisting water slide and the nearby sandy beach.", "title": "Getting to the top of the waterslide is a real workout... when your kids make you do it 40 times in a row!", "user": "kcandmc", "date": "August 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36447617}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We took advantage of the continuous beverages and snacks in the Regency club. I took advantage of the the free wifi in there too.", "title": "The most beautiful hotel in all of Arizona at the Best Price!!", "user": "FamilyOfFour91", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 36374798}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "I'm sure we will be coming back frequently!", "title": "Won't stay here again - pretty average.", "user": "lovetraveltips", "date": "July 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 36028539}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We really enjoyed our trip to the Hyatt. It was BEAUTIFUL and had a bunch of pools that were very fun and pretty. the rooms were small and the food was really expensive. It has a great view of a golf course and mountains. It is close to a lot of stores and restraunts. We reccomend Wallys. It was a sports bar right by the hotel. At the pool, the slide is soooo much fun! Everyone that went on it enjoyed it! it also has a fake beach that has sand in the pool and around it. I would reccomend going to the pool in the early morning beacause you will pretty much have every pool to yourself, but the slide opens around 10. One night they had live jazz music in the lobby. There is also a Native American Learning Center. I really loved the hotel and i was never bored there. I would definetely come back, and i didn't want to leave!", "title": "Go for the Pool - Go Elsewhere for Decent Service", "helpfulness": 1, "user": "SunFunFamily", "date": "July 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 1.0, "rooms": 4.0}, "id": 35824623}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "We chose the Hyatt Gainey because with kids you need great pools. Even though the resort boasts 10 pools, be mindful that there is only one \"large\" family pool and most are smaller lap pools. The kids enjoyed the slide but complained of the slime in the access pathway. We all enjoyed the water volleyball nets and basketball hoop. Poolside service was pretty non-existent in that plastic cups and leftover food plates were left for quite some time. A highlight was poolside S'mores on Friday night.", "title": "Nice Resort, but totally overcrowded on the weekends", "user": "Sandokan62", "date": "July 25, 2009", "detail_rating": {"cleanliness": 4.0, "location": 3.0, "value": 3.0, "rooms": 3.0}, "id": 35736572}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 53, "average": 98, "very good": 276, "terrible": 33, "excellent": 575}, "aka": "Hyatt Regency Scottsdale Resort And Spa At Gainey Ranch Hotel", "slim_ranking": 0.177215189873, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Set amidst flowering cactus, breathtaking sunsets and framed against the majestic McDowell Mountains, Hyatt Regency Scottsdale Resort and Spa features a 2 1/2-acre \"water playground\", 27 holes of championship golf, world-class tennis, Spa, the Native American Learning and Environmental Center, an international art collection and four distinctively different restaurants."}