{"user_rating": 4.5, "review_count": 241, "name": "HYATT house Seattle/Bellevue", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Staff is professional, materials are new and does not feel old. Rooms are clean. Bed is very comfortable and the suite is large. Closet is nice too.", "title": "A very execellent 3 star hotel", "user": "DCCN", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123333712}, {"rating": 5.0, "stay_parameters": "Stayed March 2011", "text": "Skip their apple pie, its too tiny for the price.", "title": "For my honeymoon we loved it!!", "user": "JovonnaDaza", "date": "January 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 122853845}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband were just married and wanted to get away, we absolutely LOVED IT!!! The pool was warm and quiet, the breakfast was beautiful and they upgraded our room when they found out were just married and the room was gorgeous!!! Thank for making a very happy couple on our wedding vacation!!!! Lots of places to eat around the hotel also :)", "title": "Stay here if you are coming to Bellevue!", "user": "Lucianne", "date": "December 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 122126888}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "My boyfriend and I stayed here the weekend before Christmas to do some shopping at Bellevue Centre. In a nutshell: this hotel is a steal! (Unless they decide to raise the prices after the re-brand it to Hyatt House in 2012). We paid less than $100 for our room for the night and it included free parking, a very comfortable bed, fully-equipped kitchenette, fitness centre, pool and an excellent breakfast buffet. You will need a car to get around as this hotel was located away from the shops and restaurants (it was across from an office/school building). From Bellevue Centre, it was less than a 10-minute drive away.", "title": "Affordable, Convenient, Family-Friendly", "user": "regalgal", "date": "November 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 121165587}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "The breakfast buffet included a variety of breakfast items-including rice, kimchi, and miso soup. For those less adventurous, there is usual muffins and toast. The nice addition was that a staff member was also on hand to make a “made-to-order” omelets. There is also a little “convenience” store located next to the front desk. It is filled with items from toothpaste to pizza pops. To my surprise, the prices were quite reasonable.", "title": "A nice stay", "helpfulness": 1, "user": "LoveSouth", "date": "November 28, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 121150020}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Went for a week end to Bellevue and this place offered good value. Free Parking & free Wi-Fi. The free breakfast was nothing special, after two days you wouldn't want it any more. The French Toast was awful. The rooms are very modern and are designed for a business person staying a few days close to the indistrial parks. The one glaring omission the rooms don't have is a in room safe, how they missed this is beyond me. The bathrooms are very tiny and would compare to those of a Ramada or Days Inn .The closest mall is the Factoria Mall, it seems to have more closed stores than open ones. You are not within walking distance of anything so I would stay closer to the Bellevue Square Mall and pay $20-40.00 more next time.", "title": "You need a GPS to find this place", "user": "monarg", "date": "May 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 1.0}, "id": 130377852}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I really like the Hyatt House hotel concept. The rooms are big & comfortable, plus the hotel is full of amenities that every hotel should offer. The Bellevue Hyatt House is a truly great hotel. The staff is very friendly & the hotel itself is spotless. They have covered parking so you can keep from getting wet. That's a nice plus in the Seattle area. I requested a quite room & that's what I got. Even though the hotel is right beside I-90, I never heard a sound at night. My room was extremely comfortable. The sofa was wonderful to sit & relax on, but the bed was the best. For whatever reason, I love sleeping on the Hyatt Grand beds. The extras at the hotel are, however, what really give it true \"value.\" The WI-FI is free & had a strong signal. The complimentary breakfast was amazing. I hope Hyatt expands this hotel brand to many other cities. It is certainly a great place to stay.", "title": "Hyatt House is a great hotel concept", "helpfulness": 1, "user": "JHBingham", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129556113}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "This is our second visit to Hyatt House (formerly Hotel Sierra). It is easy access off the freeway from I-90 in Bellevue, Washington. It is super clean with extra cumfy beds. Everyone at the hotel seems very friendly and accomodating. We got the best price for our room on priceline.com when they offered us 28% off the regular price. They have nice big rooms.", "title": "Excellent stay again!", "user": "Lynn G", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129453089}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "They have a super great breakfast with made to order omlets that have everything in them! Yum! A fresh fruit basket with bananas, oranges, and apples as well as fresh cut-up grapefruit. During the week they have pancakes but not on the weekend. There were bagels, white and whole wheat bread, muffins, and pastries. They also had scrambled eggs with cheese as well as peppers and onions in another pan, sausage, and hash browns with of course all kinds of juices and coffee. I would definitely stay here again!", "title": "Works for business or pleasure", "user": "joel e", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 129204677}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I think the Hyatt House in Redmond is geared towards business travellers, specifically Microsoft customers and clients, but it was a really great stay for us. We were going to a special dinner on a Saturday on the East side of the Puget Sound region and the Hyatt House was the best location we found for price and amenities. We were not disappointed. Overall the room was very nice considering how affordable it was. The style of the entire building is very modern. The room itself had a comfortable bed, a large LCD that was viewable from anywhere in the room, and a decent bathroom. It also came with a small kitchenette that included hotplates, a small fridge, basic utensils and storage for dry goods. One could spend a couple weeks in this unit and live comfortably away from home with the setup. We were only in town for one night and did not use the complimentary breakfast, but we peeked in and it looked superior to most continental breakfasts I've seen in bargain traveller hotels. We had a very restful sleep. The bed was comfortable, the room was quiet, and the room stayed comfortable warm all night. I'd recommend this to travellers although the location is inconvenient if you're visiting Seattle. Redmond is about a 30 minute drive from downtown Seattle, across one of two bridges that can get clogged at rush hour. But if you need a good affordable place on the East side, this is it.", "title": "Stayed here for a month", "user": "jcarp030", "date": "April 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 127890192}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This has been recently taken over by Hyatt. It was formerly Hotel Sierra. Seems like there hasn't been much change in day to day operations. Rooms are spacious, service is above average. Breakfast is included which is a great bonus.", "title": "Great Value for your Money", "user": "AUDREY W", "date": "March 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125457908}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Hotel Sierra is now managed by Hyatt House. We found this hotel clean and sleek. The employees were friendly and helpful.", "title": "Now Hyatt House", "user": "LaVida", "date": "February 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125367234}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The kitchen in our King Suite was stocked with plates and paper towels, a dishwasher and a full size refrigerator.", "title": "Second stay and will stay again at this family friendly hotel", "user": "swimteammom01", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124936748}, {"rating": 2.0, "stay_parameters": "Stayed February 2012", "text": "The closet in our bedroom was huge with ample shelving.", "title": "Bad service - stay at the much better Silver Cloud up the road", "user": "Lighthouse71", "date": "February 18, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 124787822}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I did get lost on the way there -- beware if you are looking for 148th street, 150 is the same street so if you see 150 that's your turn on to 148.", "title": "Now the Hyatt House...", "helpfulness": 1, "user": "David M", "date": "February 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124344429}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "If you like Courtyard Marriott youll like this even more. NO EXTRA CHARGE FOR COOKED BREAKFAST . Our One bedroom suite had well stocked Kitchenette. But way better than the old style vacation kitchenettes. Nice Pool , not too big not too small , but could get crowded if many people used it at the same time. Parking was undercover or open air and it was right by the brilliant seattle park n ride multi storage car park, a 5 minute walk. Highway notice was audible but not a massive roar just a purr. No surrounding stores or ameneties but for a short stay that will never be a problem in Seattle.", "title": "Experieced Travellers Real Deal", "user": "retiredtravelagent", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 127799194}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Great hotel in a great location. Close to major interstates (I-90 and I-405) or to a transit terminal for those who would pure to commute via public transit. We (couple) stayed two nights in a king room (not with the kitchenette). Hotel is in perfect condition, rooms are a good size with comfortable bed. Elevators tend to smell like the restaurant (deep fry in the evening and potatoes in the morning).", "title": "Huge Value Close to Seattle", "user": "CMacIsaac", "date": "April 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127532543}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Sorry for the delay but this is a review of a September 2011 weekend visit to this hotel over the Labour Day weekend.", "title": "Not up to my meagre expectations", "user": "Hawkfan22", "date": "April 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 1.0}, "id": 127501721}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I usually head to a downtown or Queen Anne hotel during this regular Seattle visit. In 2011, since I didn't have a reason to be downtown I thought I would try this suburban hotel. Mistake.", "title": "Great for extended stay, need car", "helpfulness": 1, "user": "SparkyEstonia", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 126798057}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Now I am a bit spoiled in that I am used to being able to walk to attractions, restaurants, and grocery stores from my hotel so my first issue was that you definitely need a car to get ANYTHING. The hotel is in a business district near interstate highway 90. The closest thing is factoria mall which can be a 5 minute drive if there isn't any traffic, 15-20 with it.", "title": "Hyatt House - Bellevue", "user": "nydlj", "date": "March 2, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 125484711}], "location": {"country": "United States", "city": "Bellevue"}, "stars": 3, "variance": {"poor": 12, "average": 12, "very good": 74, "terrible": 4, "excellent": 139}, "slim_ranking": 0.16, "description": "The Bellevue Hotel Sierra beautifully blends cozy chic with the convenience of guest-empowered travel thru intelligent design, stress-free service and free-flowing amenities. Its 160 smartly designed guestrooms + suites feature flat panel TVs, MP3 docking stations and waffle terry bathrobes while free details include breakfast with made-to-order omelets, Starbucks brewed coffee and WI-FI throughout. Sample small plates, sip and socialize at the HBAR or alfresco patio complete with fire pit and lounge seating. Providing easy access to I-90 plus upscale shopping, dining and entertainment in downtown Bellevue."}