{"user_rating": 4.0, "review_count": 2747, "name": "Hyatt Regency Maui Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "An amazing setting with glorious ocean views particularly at sunset. The onsite restaurants are excellent, the pool majestic. The staff are friendly and the rooms are well sized.", "title": "Paradise", "user": "tomb5", "date": "April 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 128573486}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband and I were visiting Maui for a wedding and split our stay between two hotels, the Hyatt in Lahaina (4/14-4/16) and the other five nights in Wailea at the Marriott. Overall based on our two night stay at the Hyatt we were generally pleased with our stay and would not hesitate to recommend it to others thinking about staying in this area. We did manage to get an unbelievable deal through the name-your-own-price feature on Priceline, but it seems that many travelers are able to get a decent rate through some travel website or another. Our deal did not come with the buffet breakfast, but that was fine considering the super low price we paid.", "title": "Above Average Hotel in a Great Area", "helpfulness": 2, "user": "Lilsquirrel", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128568736}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We arrived pretty late at night from a long flight from Canada after some lengthy delays and were pleasantly greeted by the front desk with two cold bottles of water (nice touch). We did have a tough time navigating through the area even with our GPS because the hotel is grouped with a bunch of other resort hotels, and the self-parking was difficult to find. It turned out the self-parking was full, and they offered to valet us for free. They told us that normally if the self-park was full we could self-park in the valet lot, but on the subsequent night we had no trouble finding a spot in the self-park open lot.", "title": "Wonderful stay in Maui!", "helpfulness": 1, "user": "jtomnyc", "date": "April 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128544607}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The lobby of the hotel is gorgeous and we were excited to get to our room. Unfortunately we got a ground floor room facing the parking lot, but overall the room was not bad. It looked a little older, but we slept well, and we never had to wait long for the elevator. We noticed there was a doctor on site in case you needed it, the hotel had much to offer, especially for families. I would rate the hotel a solid 4 stars, and the one thing that made it a 4 star property was the service. We had booked a luau through the concierge prior to our stay, and confirmed everything on the morning of. Unfortunately there must have been some sort of confusion, and our luau was cancelled for a private event, which we did not find out about until we showed up at 5pm. The whole situation was remedied beyond our expectations, and it showed the type of hospitality that you get here in Maui, and at the Hyatt.", "title": "Wonderful week in Maui with our kids", "helpfulness": 3, "user": "gurneemom", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128490621}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We had the opportunity to try Japengo, and it was one of the best meals we've had in Maui. It is on the pricier side, but the meal was well worth the money. Great place for a romantic night out. The view is amazing from there. If you venture off the property Whalers Village is about a 15 minute walk (or you can drive over--3 hours parking with validation). We loved the Yogurtland there! There is a $25/night resort fee (pretty standard), and it includes parking, daily paper, and high speed wi-fi internet. Checkout was easy and painless.", "title": "Good Resort", "helpfulness": 2, "user": "kkamalx", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 128477693}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The Hyatt treated us extremely well during our recent family reunion of 26 people. The service was excellent and they took special care to make sure we were happy and having a good time. There were nice gifts in the rooms from management, great food in the restaurants and friendly service. We rented a pool cabana for 4 days and it was the best thing we did. Bottled water was provided as well as a fresh fruit plate and later in the day pineapple. Everyone could meet at the cabana and then spend the day in the kiddie pool, main pool, spa or the beach. Each night we had an event such as the luau on property, or dinner at Japango, and one night we had a private dinner in the Statue Gardens. This event was a highlight, well serviced and managed with delicious food. Nearby are numerous activities like parasailing, jet skis, stand-up paddle boarding, surfing, and the list goes on... When there was a disruption such as work on the air-conditioning, we were given $50 vouchers to use for meals. We really felt this was a wonderful gesture.", "title": "Perfect family reunion", "user": "DeeWiz", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166667022}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Overall experience was amazing we did not want to come home. This was our first time to the hyatt at Maui and we would highly recommend the facilities on offer were amazing. The sushi restaurant was really nice and the atmosphere was so relaxing. The Hawaii evening on resort was really nice and we met so many interesting people. Everyone was so friendly and we would highly recommend. The breakfast was really nice with a good choice of continental and hot buffet breakfast. The spa experience was also nice as we had a full body massage by the sea which was superb.", "title": "Second part of our honeymoon....amazing", "user": "holidays4me_9", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166637563}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Paradise, but so tempting, you might miss the rest of the islands beauty. We stayed here after a week at a lovely condo, and I'm sure if we had stayed here first, we would have missed so much of what the island has to offer. Glad we split up the trip. This was not an economical option, but beautiful memories and so much to enjoy without ever getting in the car.", "title": "Never want to leave", "user": "momreilly", "date": "July 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 166611372}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We recently stayed at this hotel having purchased four nights online. We were aware that we were purchasing an ubstructed view however we were not made aware of the mess we would be passing through every time we left our room. There are workers and dust everywhere, forklifts and bobcats zipping back and forth in the hallway as we try to get to our elevator. Our son has breathing issues and this is unexceptable. I was told at the front desk I could be moved for the discounted price of one hundred dollars a night. We met another very upset couple last night moving in for ten nights, they also had a lovely view of construction, again not aware until check in. This section should be closed during this time.", "title": "Stay away until renovations are completed", "helpfulness": 5, "user": "Joan M", "date": "July 7, 2013", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 1.0}, "id": 166573868}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This was our 3rd time at the Hyatt. The grounds are gorgeous. The rooms are fine, nothing spectacular. As for the construction~this was somewhat bothersome, but I had expected it after reading all the reviews.", "title": "Great hotel but...", "helpfulness": 4, "user": "alc0586", "date": "July 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 166451435}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at the Hyatt in Maui after coming from the Hyatt in Kauai for our Honeymoon. I wrote a review to that one too if you are interested. The hotel is on Kaanapali beach. A 10 minute drive to Lahania and Front Street. Upon arrival we were escorted to the front desk. Since it also happed to be my birthday they gave us a Hawaiian style photo album. Really nice touch. The grounds are beautiful with tropical flowers and nice landscaping, birds, fish ponds, flamingoes, penguins. We got an ocean front room in the atrium tower (middle one). It was ocean front indeed. It felt like you could touch the ocean. The balconies are very small. Just enough room for 2 chairs and a small table. The beach is very narrow, in some places not even wide enough for a beach towel. I guess that's why they put a lot of money into the pool. The pool was huge. It had waterfalls, water slide, caves, pool side bar. Not actually a swim up. They had lots of chairs some with canopies so you didn't have to roast in the sun if you didn't want to. They were so close together and they were pretty full each day. They had women serve drinks and food to you chair. The breakfast which was included was similar to the breakfast at the Hyatt in Kauai. It had anything you could want. There was something there for everyone. We ate at the sushi and steak restaurant (i forget the name) for my birthday dinner. I really liked it because I like sushi and and husband won't touch it. he's a steak lover. The next night we had champagne and fruit delivered to the room. The fruit actually made me sick later in the night. I think it may have been the yogurt dip. We got a couples massage next to the beach. It was ok. I would have liked it if the huts were futher away from the people lounging by the pool. The spa in Kauai was way nicer. All in all we enjoyed out time at the Hyatt in Maui. Hey you are in Maui, what's not to like?", "title": "Great Hotel", "helpfulness": 39, "user": "steph44w", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12762308, "likes": {"liked": "— location, grounds", "disliked": "— narrow beach"}}, {"rating": 5.0, "title": "If Money Were No Object.....", "text": "We went to the Hyatt Regency in Maui and it was pretty close to paradise. The room was smallish for the 4 of us but that was not the fault of the hotel.", "helpfulness": 56, "user": "TechnoKitty", "date": "January 6, 2008", "id": 12393467}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The hotel supplied us with extra cots, micro wave and mini fridge.", "title": "Wouldn't Stay Here Again for the $$$", "helpfulness": 7, "user": "justbeen2hawaii", "date": "January 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 12280805, "likes": {"liked": "— It was a very beautiful place with a gorgeous pool", "disliked": "— Service. The pool area needs to have a better system for being able to get a chair. Restaurants were not good."}}, {"rating": 5.0, "title": "great experience even during xmas", "text": "Once we got over the fact that everything was an extra charge and accepted that we had a great time.", "helpfulness": 30, "user": "aliNewJersey", "date": "January 2, 2008", "id": 12262944}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The food was excellent and our kids were busy planning on how to make us miss our flight and stay.", "title": "Good hotel - starting to show its age though", "helpfulness": 53, "user": "kimnkitties", "date": "December 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 11999087, "likes": {"liked": "— Convenience, comfortable beds.", "disliked": "— Starting to show it''s age. Updating, so it may get better."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "We spent our honeymoon here and loved it! We cannot wait to return. Even though our ocean front room was not available upon check in, we were upgraded to club room floor. The next day, our things were moved for us to our ocean front room. The concerige desk was very helpful and willingly scheduled all of our activities. We highly recommend Hike Maui. Our tour guide was wonderful! The luau at the Hyatt was also wonderful! The food was great and upgrading to VIP was well worth it. We were able to have a great view, able to go thorugh the buffet first, and did not have to wait to enter. We missed the pictures taken as you come in, but the staff was quick to get us taken care of. As everyone else has mentioned, the food is expensive. However, the Pavillion has reasonably priced food. We ended up splitting the chicken nachos on our second visit and still had leftovers.", "title": "Best Place to Honeymoon!", "helpfulness": 6, "user": "givens123", "date": "June 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3554671}, {"rating": 5.0, "title": "Great Vacation", "text": "I too worried a bit after reading other reviews, but I am not sure where those people with poor reiews stayed. The hotel is in incredible shape - I noted nothing but clean high quality roms and grounds. Brought my young twin girls and they had a great time - the pool is perfect for families. The grotto splits the adult from kiddie pool so you do not really bother the \"quiet\" side when at the kiddie pool. Ended up upgrading the room which was the best thing we did. I asked to look at three romms before checking in and was given keys to see what tower, etc would be nice. I did not notice any noice in the Atrium tower ecxept for the ocean and the birds at dawn. Food was excellent, and like all the resorts expensive. We asked the bellman for a fridge (which is lucky to get) but treat them right and they can find one. Able to keep some milk and \"cheaper\" spirits in the room. All staff was very nice at all times. We were too tired to go back to Lahaina for the Luau so we did the Hyatt Luau and my family loved it. The extra $50 for VIP is worth it - great seats, waitress and quick food. I think you need to take some responsibility for any vacation working out well - I asked nicely for different things - including lais for my girls as they did not like the shells - and never heard \"no\" from anyone. Great family vacation.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 9, 2005", "id": 3541930}, {"rating": 5.0, "title": "Tropical paradise", "text": "We booked our vacation to Maui in March and were concerned about the reviews I had read previously regarding the Hyatt but were more than pleased with our stay. Upon driving up to the Hyatt we were amazed at how beautiful the grounds were. We arrived the afternoon of May 29th and it took no time to check-in to our room. It was myself and three teenage children sharing a room but we had plenty of space except for the small bath area which could have been larger. The beds were unbelievably comfortable although it was an adjustment in the time change and we didn't waste much time sleeping. The buffet was excellent in the Swan Court and that was also included in our package. The cocktails were a little pricey out by the pool in the afternoon but we requested a refrigerator in our room and stored our own sodas, water and wine. We did not plan any excursions just simply rented a car and toured the island on self guided tours. We actually went to Hana twice and loved it both times. The second trip we discovered things that we missed on the first trip. Although we are from Houston, Texas the heat is extreme. We are accustomed to central air conditioning and Maui doesn't seem to have the luxury of the central air. Our room was a little warmer then we would have preferred but we managed and loved it to say the least. We never had a bad meal in Lahaina and loved all the shopping. We'll plan another trip in the Fall and will book again at the Hyatt.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 8, 2005", "id": 3540178}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "Stayed at the Hyatt for our honeymoon. After arriving, we waited awhile to check in. We were given a room next to the laundry room - with a view of a rooftop - not quite what we expected for our honeymoon. We were told this was a favorite hotel of honeymooners - no way. They never treated us like we were on our honeymoon. We did complain about the room and they switched us to another, but it was not much better. We were promised a bottle of champagne, and didn't get it for 3 days. I called and finally asked for it, and they brought it an hour later and it was warm.", "title": "Not worth the money", "helpfulness": 11, "user": "fluffyges", "date": "June 8, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 3.0}, "id": 3539902}, {"rating": 4.0, "title": "better than expected", "text": "You need to pay extra for everything at this hotel, including chairs near the non-existant beach. Valet parking took at least 15 - 20 minutes each time to get our car. And the $15 resort fee is so stupid. You have to pay here to get what any other hotel gives you for free - such as a coffee maker and safe in the room.", "helpfulness": 27, "user": "A TripAdvisor user", "date": "May 27, 2005", "id": 3504353}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This is certainly a luxury resort but rather high end for my taste. There was a tendency for it to be self contained and a visitor could miss the more interesting aspects of Maui. I did take advantage of the exercise room and one run on the lava tube water slide. The pool areas seemed congested and we heard the Luau from our room but were not tempted to attend. The beach close by was eroded.", "title": "Hyatt Lahaina", "helpfulness": 1, "user": "StepheM9886", "date": "July 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 167199274}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My family and I went on a 10 day trip to Hawaii. It was my first time visiting Hawaii and I loved every minute of it. I've separated the experience at this hotel into a few different sections. If you don't feel like reading a long and informative review then maybe you should skip ahead to the next one.", "title": "Amazing Property!", "helpfulness": 11, "user": "leahdaniels", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167169277}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Remodel: Everyone has been talking about the remodel going on here but honestly it's not a big deal. They're making changes to better the hotel to benefit their customers, what's wrong with that? If it just so happens that it is going on while you're staying there try and make the necessary arrangements to be placed in the Lahaina Tower AWAY from the construction zone. We had read about this construction issue on this site and made all fo the necessary requests to be placed as far away as possible from the construction and didn't hear a peep. The only problem we ran into was when they were taking care of something at the pool to make it SAFER for people to swim in the pool area. There was some jack hammering during the day at the pool but it wasn't often and you could hardly notice with the waterfall running and awesome music playing. Plus there is plenty of other things to do like see the beautiful view of the ocean! But if you were thinking of switching hotels, don't! Just ask for a room in the Lahaina tower before you arrive. This is a beautiful property that certainly needs to be seen and visited. Just ask to stay away from the noise.", "title": "A Tropical Paradise", "helpfulness": 5, "user": "Kayleigh_Kevin_85", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166773607}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Front Desk: First of all the people at the front desk were awesome and very straight forward. We arrived and the women who greeted us gave us fresh water and leis. They had a bellman take my parents bags and showed them around the resort quickly as they walked through the grounds to get to the lahaina tower (it's a bit further away from the main building but totally worth it.) My husband and I carried our own bags and got to our room Very quickly. I was surprised at how spacious it was! Anyhow, back to the front desk. They always are there to assist you no matter what time of day it is.", "title": "Hyatt Maui", "helpfulness": 1, "user": "Sophia S", "date": "July 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166680156}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Food: The restaurants at this hotel are a bit pricey so if you're trying to save some money try not to eat here very often because a burger, fries and soft drink at the Umalu restaurant will run you about $50.", "title": "There really is paradise!", "user": "Tim M", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166667134}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "We stayed at the Hyatt in Maui from June 14-18. Overall, it's a nice hotel but I found it overpriced. They also went out of their way to try to nickel and dime you with additional charges.", "title": "Nice but Overpriced", "helpfulness": 50, "user": "JK-Pittsburgh", "date": "June 22, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 4.0}, "id": 3604535}, {"rating": 5.0, "title": "Best Resort in Kanapali", "text": "We had two rooms as my mother-in-law was travelling with our family of four. Both rooms were fine and similar to the pictures on the website. The bedroom was average-sized and the bathroom area was somewhat generous. The porch/lenai was a little small, had a a partial ocean view and could seat two people. The room with the king-sized bed was a little nicer than the room with two beds.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "June 20, 2005", "id": 3576606}, {"rating": 5.0, "title": "Best hotel in world", "text": "We stayed on the Regent Floor which provides a continental breakfast and drinks and appetizers at happy hour. Both the breakfast and happy hour were top notch. During the rest of the day they put out cookies and soft drinks. It's somewhat difficult to justify paying the premium ($150) to stay on the Regent Floor, but we enjoyed it.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "June 18, 2005", "id": 3574930}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "The grounds are nicely mainitained with the various birds and plants. Service was generally good. We didn't eat the the hotel - prices for dinner were awfully high for restaurants that aren't rated that highly.", "title": "Hyatt as Expected", "helpfulness": 8, "user": "Biker56", "date": "June 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 3564055}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "The pools were nice but it was very difficult to get a chair. We went down at 11:00 am and almost every chair was taken. Only about 25% of the chairs had people in them, most were simply claimed by a towel.", "title": "Loved the Hyatt, best hotel on beach", "helpfulness": 4, "user": "morlannet", "date": "June 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3554690}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My fiance and I booked the Hyatt through priceline.com for Nov 10-17, 2007. Our hotel rate was $205/night for a basic room (found out others paid $350 for same room class). For \"some reason\" the hotel thought it was our honeymoon and upgraded us to a partial ocean view (it was a full ocean view in my opinion, it was that beautiful!) They also gave us chamgane and a keepsake photoalbum.", "title": "Love, love, loved it!", "helpfulness": 48, "user": "ashley2563", "date": "December 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 11554944, "likes": {"liked": "— The resort grounds and pool", "disliked": "— Expensive food and drinks"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2004, traveled as a couple", "text": "We really enjoyed our room, and felt that pp complaints were not true to what the hotel is like - it was beautiful! The grounds were amazing, the location is fab (I thought the beach was good...def not as wide as near the Sheraton, but this made it less busy - which is a good thing).", "title": "Our honeymoon trip", "helpfulness": 39, "user": "lovinsj", "date": "December 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 11514484}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Food and drinks are $$$, but the Lava Flows are amazing! My fiance just packed a soft sided cooler with beer/rum/mix from the ABC store, and he was set to go ;) We had appies at the Cascade Grill (ribs = yum-o!) - we had breakie at Cascades but the buffet was too much money for our liking...it looked delish though!", "title": "Save your money and stay home!", "helpfulness": 6, "user": "g1wzwnd", "date": "December 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 11471531, "likes": {"liked": "— staff", "disliked": "— price and condition of the property"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Pools are amazing...tons of chairs...tons of sun.", "title": "Worst Experience Ever", "helpfulness": 8, "user": "adriscampa", "date": "December 10, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 11468640, "likes": {"liked": "— I absolutely hated it!", "disliked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "In regards to the parking...the have two large lots...we parked in the back lot as it was closer to our room. We never had a problem finding a spot...although the lots did seem pretty full.", "title": "Can't wait to go back.", "helpfulness": 17, "user": "Capt4Real", "date": "December 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11463231, "likes": {"liked": "— Everything...Sorry", "disliked": "— Everything"}}, {"rating": 5.0, "title": "A wonderful time", "text": "I had a chance to stay at this hotel a couple nights. I also stayed at the Westin just a few kilometers down the road. Although location wise, Westin was better as it is right next door to the Whaler's Village and closer to Black Rock for those who like to do some snorkeling, Hyatt Regency wins my vote because of its layout. The building is of atrium style. When I walked through the lobby or getting to my room, it feels very open and not overcrowded like I felt when I stayed at Westin. The room may be a little dated, but because of the superior quality of materials used, it still feels very classy and elegant.", "helpfulness": 3, "user": "AKLVancouver_Canada_", "date": "May 1, 2012", "id": 129199565}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "Another thing that this hotel holds an advantage is the ground. The plantation is lush, landscaping well designed and maintained. Swimming pools are gorgeous. And if you want have full workout, the gym has all the equipment anyone needs. By the way, check out the daily activities as they arrange yoga and pilate classes.", "title": "Gorgeous resort. Awesome pool and hotel grounds!", "helpfulness": 4, "user": "ashleighjustine", "date": "May 1, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 129194989}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I only patronized the casual dining down by the pool. The fish taco was delicious, as well as the cocktails. Staff was very friendly. Although I am not too keen about the plastic glasses that were used.", "title": "Paradise", "helpfulness": 1, "user": "bergman123", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129171616}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Yes, everything in this hotel is expensive, but so is all the other hotels in Maui. I can hold this against this hotel.", "title": "Play-grounds!", "helpfulness": 1, "user": "elderbro", "date": "April 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129140925}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "And when you can enjoy the view like I did, it's all worth it.", "title": "Another Overpriced Plastic \"Paradise\"", "helpfulness": 2, "user": "George_Moosie_W", "date": "April 30, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 129121598}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We stayed at the Hyatt in Maui for the second part of our honeymoon. There were some things that we really loved about our stay, and some things that kind of rubbed us the wrong way. The view from the beach was fantastic. The Japanese restaurant was amazing, the beachside grille was very good too. The view from our room was incredible as well! What we really didn't care for is how we felt nickle and dimed for some things. For example, there was a resort fee (which is understandable), but then there was a $14 per day charge to park. In addition, any time someone helped your at the resort, they essentially had their hand held out asking for a tip. Seems kind of tacky for a place like the Hyatt. The room itself was just ok. The view was great, but the room was small and had some outdated decor. Location was about an hour from the airport, but there were tons of restaurants and shopping immediately in the area. Overall it was good, just not great.", "title": "Good, but not Great", "helpfulness": 2, "user": "Brick83", "date": "July 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 166424495}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "It pains me to leave a negative review of a resort I once loved, but the truth needs to be told. We have stayed at the Hyatt Regency Maui during several previous vacations, and until now, we have always been delighted with the resort. This time, however, missed the mark completely. We booked the room through a third-party website, which failed to disclose the noisy construction taking place just outside of our room, noting instead an \"obstructed view\". There is a significant difference between an obstructed view and noisy, disruptive construction that begins at 7am every day of the week. The information was not available at the time of booking, but as of now, the website includes the information (maybe too many customers complained about false advertising?) I can understand a resort's ambition to upgrade their grounds and build additional units for time shares, but keeping guests in the dark about these changes and their impact on a vacation is unacceptable. Speaking of upgrades, while they are sprucing things up, why not start with the room interiors? The rooms feel dark, outdated, and unwelcoming, despite the stunning lobby and amazing landscape. I feel deceived by this absence of information, as well as the clerk who checked us in at 10:30pm the evening we arrived and assured us not only that we had one of the best rooms at the resort, with a lovely view included, but also that the parking lot we had used in the past was inconvenient and that a more distant lot would be more suited to our needs.By the way, parking now costs between $14 (self-pay) and $20 (valet), a stark change from the past, when parking for guests was free. Parking isn't the only thing that the resort overcharges for; meager cocktails, which include a copious amount of ice and a small amount of fluid, will cost you around $14, and the breakfast buffet, at $25, is limited, boring, and sadly lacking in healthful breakfast items. Both the management and staff have some work to do in the customer service department. Housekeeping didn't come one day until I called the front desk to request service. If you choose to stay here, remember to ask for new sheets daily if you want them, because they will reuse the same bedding several days in a row otherwise. One of the perks of a vacation should include fresh sheets and towels daily, in my opinion. If not for the sublime gardens, the Hyatt Regency wouldn't have much else to attract visitors. I find it heartbreaking that a place with the potential to be heaven on earth has chosen to create unnecessary headaches for its guests instead, many of whom have saved up for special occasions and deserve better than what they get. In the future, we will look for a resort that lives up to the expectations we once had for the Hyatt Regency Maui. Save your money and do your research if you're planning a dream vacation, or you may find yourself dealing with a nightmare trip instead!", "title": "Mourning the Hyatt Regency of My Memories", "helpfulness": 6, "user": "Laura C", "date": "July 5, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 166362195}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We really like this hotel. Had a few problems at check-in but the manager Adam took care of everything. Great manager and has a wonderful staff. He was very happy to talk to us and make sure our stay went well and checked on our group several times. Rooms are great and have some of the best views in Kaanapali. The hotel is under construction but should not stop any one from going. The breakfast buffet is awesome. The pool staff was excellent. If you find Brooke at the pool she is one of the best waitress ever. Great hotel with friendly and experienced staff. This place is a must stay. We had a group of 13. Ages ranged from 2 to 66 and everyone had a great time.", "title": "Family Trip", "helpfulness": 1, "user": "117mike", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166336248}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Beautiful Hotel. Very open an tropical. Big pool. Beautiful rooms (Ocean view). View on either side would be amazing. The mountain view was magnificent also. Take the cheaper room. Not much beach area. You'll have to walk a bit for it to another hotel. This hotel, unlike the one in Waikiki does not offer free beach chairs and water, which was a bit of a disappointment. We did not spend any time at the beach here. We went to Honolua bay for snorkeling and other areas where we hiked and sunned ourselves. This room was a bit bigger than the Hyatt Waikiki. We rented a car and they allowed us to park free of charge. I believe there is a fee to park your own car as well as valet parking (which of course is more). We had an issue with our toilet when we got there. They came up and fixed it right away. There are stores and restaurants within this area which was very nice to walk to and shop. There is so much to do on this island. You will need a lot of time here since five days was not enough for us. As I said in my Hyatt Waikiki review, since we didn't spend much time in this hotel, I might opt to go cheaper next time. This is a hotel to truly enjoy if you plan on spending time there.", "title": "Beautiful", "user": "Lori P", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166324792}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We enjoyed a fabulous honeymoon at the Hyatt Regency Maui Resort, June 2013. Our room on the 5th floor of the west tower and over looked the beautiful resort grounds. It was quite and we often set out there in the evening and early morning to enjoy a glass of wine or breakfast. The resort is adjacent to several other resorts that can be easily reached by walking down a lovely beach walk. You are welcome to enjoy the restaurants and bars of any of the resorts. Each has it's own flare and most have periods of free live music. Before dinner take in an amazingly beautiful sunset from the comfort of one of the many resort hammocks. The employees at the resort seem to enjoy their jobs and are very helpful to us in requesting taxis (to go into town), making dinner reservations or arranging for our many activities. Be prepared because it is pricey to stay at a resort -- drinks/food and items have a 50-75% mark up as compared to nonresort places. But it sure is nice to sit in your cabana on the beach and have drinks/food brought to you at your request. The only negative comment I could make is the construction that was going on around the pool during our stay. However the resort did their best to minimize the inconvenience by having the work done in sections, putting up drapes around the workers and by softening the sounds of work by providing pool side live music. The benefit is a resort that strives to maintain their premises.", "title": "Can't wait to return!", "user": "Cheryl S", "date": "July 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 166072333}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "First time to maui was made magical by this hotel. An open air lobby with parrots and penguins, an oceanside garden filled with more wildlife, a water fun park with a watersilde, kiddy pool and poolside bar.....we couldn't have wanted for more!", "title": "Simply the best!", "helpfulness": 2, "user": "zacstar", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167490260}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "The resort was buit in the mid 80s and having a touchup at the time of our stay but it was perfectly managed to keep noise or unsightliness hidden...wouldnt even know anything was happening. Great rooms, not that we stayed there much.", "title": "Used my Hyatt points and scored an awesome family vacation!", "helpfulness": 2, "user": "TradeshowMagician", "date": "July 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167353045}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Breakfast buffet was more than anyone could ask for with swans and ducks and parrots to entertain us...really!?", "title": "Great Trip to Maui!", "helpfulness": 1, "user": "Jenrs", "date": "July 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167352460}, {"rating": 5.0, "title": "Wonderful wedding in paradise!", "text": "If there was anything that perhaps was missing, it was that the beach right in front of us wasn't perfect....we walked up 5 mins to make sure we didnt have to deal with rocks.", "helpfulness": 2, "user": "Andy P", "date": "July 12, 2013", "id": 167334365}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We walked to Whalers Village for dinner....easy and otherwise necer left the place in 5 days.", "title": "Nice staff, Okay Resort.", "helpfulness": 4, "user": "AlaskaLivs", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 167224713}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "I just finished spending 6 nights at the Hyatt and I was a little disappointed.", "title": "Maui a little short on the wowi", "helpfulness": 10, "user": "Jeff511", "date": "July 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 1.0}, "id": 3698411}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "This is a fantastic property. It was definitely kid friendly with a fantastic pool , waterslide, waterfalls, etc. It was also a place for couples with all kinds of romantic backdrops and places for some private time. However, the service in a majority of the areas of the hotel was awful. There were few places where you were greeted with a smile and an aloha. The Swan Court restaurant was a fiasco for breakfast in the morning- understaffed, could not get service. The Paradise Cafe and the service poolside made you want to get up and go purchase your own drinks or food. This is a four star hotel without a doubt, but you expect 4 star service and a friendly attitude , this was a one star in those regards. Sorry", "title": "a honeymoon in paradise", "helpfulness": 20, "user": "davacationexpert", "date": "July 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3684864}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Sincerely,", "title": "The Hyatt was the best", "helpfulness": 12, "user": "lynn2", "date": "July 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3660422}, {"rating": 5.0, "title": "A Definate Must Stay!!", "text": "East coast family", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3640610}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "me and my wife stayed at this hotel for ten days on the month of may this year for our honeymoon. we are from the north east and we never traveled this far somewhere and we couldn't believe how long the flight was. but when we first arrive on the airport as soon as the flight attendants open the door of the aircraft you notice the aroma of maui. it smells like you walked in to a sun tan lotion bottle (lol). we got our rental car and drove to the hotel the drive from the airport to the hotel is amazing so many beautiful things you see on your way up to the hotel you have to pinch yourself just to make sure its forreal and pull over to take pictures. the drive is very easy even if your bad with directions its impossible to get lost. we get to the hotel and we use the valet so that we can check in and bring our bags to the room. omg!!! as soon as you get there the employees of the hyatt jump on you and make sure you are treated like you are royalty! the check in was a very good experience the front desk staff was very helpful and answered all are questions. the bell boy was very friendly and gave us some hints on what to do on our stay. he told us there is channel you watch on the t.v. in your room that you can use to see all the activities you can do and all the best restaurants where you can eat at. there is a couple of restaurants in the hyatt but they are very very expensive but the food quality is and taste is awesome. there is not much night life but if you wanna just have a romantic time with your love one this is the place to go. dont get me wrong i saw alot of families at the hyatt but i think its more of a couples kind of resort than a family one. the pools are ginormous beatiful waterfalls and a slides as well. there is always a seat at the pool even though there is alot of people the staff is always on making sure everyone is happy at there stay at the hyatt. the swim up bar is cool and aslo the bar at the pavilion reasturant pool side is awesome gotta give a special shout out the \"abner\" this bartender is so friendly and one of the best employees in the hyattreally down to earth kinda guy. the hyatt also is host of one of the best shows i have ever seened the luou is a must see at your stay at the hyatt. i have nothing but good things so say about my stay at the hyatt maui all good experiences nothing bad to say. at the end of my trip my wife and i where practically in tears because we didnt want to leave paradise. it was kinda funny because when we checked out we asked the front desk lady for some comment cards and she was all out of them because everyone asked for them before they leave. so you know this place has great service!!!!! i cant wait to go back i recommend this to anyone that wants to experience first hand what paradise really is and to be treated like royalty!!!!", "title": "Great Hotel!", "helpfulness": 17, "user": "SouthMilwaukeerocket", "date": "July 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3635004}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The property is beautiful! We even saw whales right from our room lanai!", "title": "Nice!", "user": "JDLSTT", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128364610}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "It's difficult to find any hotel that really has charm in Maui. The are all big box chains with large properties filled with tourist. If you can spend a little more $$ consider booking at the Four Seasons or the Fairmount in Waylea as the clientele is more sophisticated and these hotels are very close to Big Beach which is simply fantastic. The hotel strip where the Hyatt is located is just north of Lahaena and it's a major tourist trap with high priced restaurants and bars. Venture out if you must stay in this area for true restaurant and beach experiences. The Hyatt itself is in major need of a refresh as its seen it's share of tourist. The linen was rather used ( same quality as my gym towel service) and the bed was not the most comfortable for a resort. The staff is generally very polite, however, the pool bar staff have clearly been around for years and they are simply working the shift. Try to find a pool bar table that has table service is simply embarrassing ! Most tables are self service ! My impression is that the hotel is really focused on cost containment. Be warned that you will also be charged a $25 a night resort fee when you check out . Why not include it in the price of the room? This is my first time staying with the Hyatt brand and I thought it would at least match the quality of the Hyatt in Toronto.", "title": "Hotel needs a refresh!", "helpfulness": 3, "user": "S L", "date": "April 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 128250740}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband and I stayed at the Hyatt for 6 nights. We booked a partial ocean view room and we were given a slight upgrade to a preferred (as the receptionist called it) room. We overlooked the gardens, children's pool and the ocean in the background. It was a very spacious room with a couch, chair, table, bed and large sink vanity area in the bath. The room had a good sized closet with a safe. The toilet/shower room was very small. The balcony had two chairs and a table which was nice for sitting out on.", "title": "Nice 6 night stay at the Hyatt", "helpfulness": 1, "user": "RAKfromMD", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128247644}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "Since we did alot of sightseeing and played golf two times, we only spent two 1/2 days relaxing at the pool. Yes, as others have mentioned, people do save pool chairs very early. I did go out early to get chairs, but went back to the room for breakfast and was back to the chairs within 30 minutes. I did see a guy save 4-5 chairs when I was down, but he did not return for over 3 hours. I am sure that was frustrating for people looking for chairs. I did read on a previous post from a guest that the hotel is working to enforce the no saving for over an hour (or something like that).", "title": "Nicely Done", "helpfulness": 3, "user": "OnRTravels", "date": "April 19, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 128184611}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We really enjoyed Umalu. We were there during the Masters. My husband enjoyed sitting at the bar, feeling the ocean breeze and watching golf. I would take a break from the sun from time to time and join him for a drink. Some of the food options are a bit pricey, as others have mentioned, but I think that is the case for all hotels on that strip. One of the best values at Umalu was the basket of fries - shoestring style (even the 1/2 order was huge) and the Ocean rings made from Maui onions. The bar and wait staff was very attentive and friendly.", "title": "Enjoyed Our Stay", "helpfulness": 10, "user": "Moirende", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128175075}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "This is now my second stay at the Hyatt Regency Maui and again it was a fantastic experience!", "title": "Dreamy vacation!", "helpfulness": 3, "user": "flyingkangar00", "date": "May 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15669674, "likes": {"liked": "— comfortable beds and oceanviews"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I was part of a small group which can often make travel difficult, but the Hyatt Regency handled everything smoothly and efficiently.", "title": "Another Great Stay", "helpfulness": 3, "user": "dkr1971", "date": "May 5, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 15654265, "likes": {"liked": "— Great pool and beach", "disliked": "— Parking, overpriced restauranats"}}, {"rating": 2.0, "title": "Fantastic Grounds, crummy dirty outdated rooms", "text": "I was lucky enough to be in an oceanview room which I would thoroughly recommend - it overlooks the magnificent pool and out to the sparkling ocean beyond. Worth paying that little bit more as nothing can compare to waking up and eating breakfast on the balcony as the sun rises. The staff were super friendly - nothing was too much trouble.", "helpfulness": 3, "user": "RochelleRose", "date": "May 1, 2008", "id": 15559023}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Having visited several other properties, the Hyatt definitely has the best setting. Make sure you see the black footed penguins and macaw on site! Although I was with a group, I think the hotel is an ideal place for honeymooners. Soooo beautiful! It's really well located with a great boardwalk along the beach to nearby Whalers village. Each time I return, I discover something new about the property - like all the wonderful shops on site, closer to where the conference facilities are. I will be back!!", "title": "Loved The Hyatt", "helpfulness": 3, "user": "HNYMOONER28", "date": "April 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15430863, "likes": {"liked": "— Great Staff & Pools", "disliked": "— Small room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "We just got back from our second stay at the Hyatt. This was another great experience. The first day we saw whales from the beach, which was an unexpected surprise. We rented a cabana and had the beach completely to ourselves, which was very relaxing. Most people stay around the pool, which is also nice.", "title": "Great hotel", "helpfulness": 4, "user": "newportmom", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 15383916, "likes": {"liked": "— Fabulous pool, and a great nightime program on the roof!", "disliked": "— Very choppy design - hard to find your way around the hotel."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We just returned from 4 nights at the Maui Hyatt and it was excellent. The hotel is VERY family friendly. We have a 4 and 1 year old. The penguin pond in the lobby (yes penguins) and feeding the koi in the morning were both big hits. Our mountain/golf view room also had an ocean view from the lanai. We booked using a AAA discount and upon check-in were told of a AAA special for breakfast for 2 at the Swan Court buffet and were given a voucher for each morning of our stay. Since kids 4 and under were free we ate a fabulous breakfast each morning for free. The kids pool is wonderful and my kids really enjoyed the popsicle lady that came around. My husband enjoyed the big slide, which was conveniently located next to the kids pool. I agree with other reviewers that the beach itself isn't the best in Maui as the waves are a bit bigger, but it turns out my youngest is scared of the waves anyway so we didn't spend much time on the beach. Service was great and the fact that each room had a fridge and a fold out couch (so the kids didn't sleep with us and we still got a king bed) was great. The setting is beautiful. We will surely go again.", "title": "Family Friendly Fun", "helpfulness": 5, "user": "vlfair", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16438544, "likes": {"liked": "— Family Friendly", "disliked": "— The beach wasn't the greatest but it was still nice"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Both me and my wife decided for our first time in Maui to stay at the Hyatt. I had read several previously bad reviews, so I was skeptical about what to expect. People had mentioned that the hotel was old. I have stayed in other hotels like the Disneyland hotel and believe me that was old. I really did not notice the age much as the rooms were clean and in good condition. One of the many things we liked about the hotel was the bed, which is nice and soft without the scratchy sheets. The only problem we had with the room was the slow drain and the private Lanai is really not that private. The view out to the ocean was great except for the last two days when the volcanic fog moved in and limited the view.", "title": "Relaxing experience.", "helpfulness": 3, "user": "Glamdrig", "date": "May 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16320198, "likes": {"liked": "— Soft Bed"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Parking as others had mentioned can be a problem. After the round a bout coming into the hotel grounds you can take a right for the first self park lot and then a slight left right at the hotel to get to the secondary lot. If these are full prepare for 20.00/night plus tips. We had no real problem except on the last day when some company showed up for meetings. I am a little confused as to parking distance. People complained about walking too far even on the grounds. If your complaining about this your definitely older or in a wheel chair, but why are you there if not to relax? Anyone with minimal physical capability can get around the hotel without too much trouble. Also someone mentioned a bridge without rails going over some water. There are some bridges, but nothing different than what you would see in some landscaped home or park.", "title": "A True Showplace", "helpfulness": 5, "user": "AlabamaTravelers", "date": "May 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 16224035, "likes": {"liked": "— Location, pool, grounds and landscaping", "disliked": "— Lots of extra charges"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "They are doing construction, so If this bothers you don't go. I really didn't hang out at the pool on a regular basis, but when I was there I did not notice a problem. You can hear it well however outside of your room on the Lanai if you are near the pool.", "title": "For Ocean/Beach activities, consider staying elsewhere", "helpfulness": 4, "user": "drakemallard", "date": "May 16, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16114631, "likes": {"liked": "— Boardwalk along Kaanapali Beach", "disliked": "— No Ocean/Beach activities; pool area too busy with people who left manners at home"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Also if you decide to have breakfast at the hotel make sure it is included in your trip otherwise expect to pay $30.00 per person for a buffet style breakfast. It got old fast after a couple of days since the options change very little. We thought the hotel grounds were nice and they even have little showers right off the beach to rinse off your shoes, feet or yourself. Drink wise I would recommend stopping by Costco near the airport since there are no state run liquor stores you can stock up on some premixed drinks and bring them down to the pool with you. Make sure the containers are plastic. We did not have a problem with seats around the pool. I don't believe things were as busy as with other people. I always looked out onto the pool and there were spots available, but again I can see things being too busy and there were lots of spots with no people, but towels.", "title": "Having a Wonderful time!!", "helpfulness": 4, "user": "Jamesokc", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16076449, "likes": {"liked": "— First service", "disliked": "— Self-Service Parking Lot"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We stayed 4 nights at this hotel in the week before Christmas. We were disappointed with most things here.", "title": "Old and Crowded", "helpfulness": 8, "user": "AksNYC", "date": "December 27, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 11990855, "likes": {"liked": "— Old, crowded"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "1. We were in a room in the Napiili tower. The hallways, carpets and elevators seem quite old and not very well cleaned. The elevators were also having some maintenance done, slow to respond.", "title": "Horrible Experience - Stay Away", "helpfulness": 18, "user": "DetailedCritic", "date": "December 24, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 11923533, "likes": {"liked": "— Well kept hotel grounds.", "disliked": "— Everything else other than the hotel grounds."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "2. The room smelled like smoke even though it was supposed to be a king non-smoking. It was very large, no complaints there. But again old-ish carpeting and furniture. It suits a Days Inn or something, not an expensive Hyatt (we paid ~250 a night on priceline). I haven't seen a curved screen CRT TV in a looong time and was surprised to find one in the room! Not even a flat screen CRT, that is the norm in any decent hotel now, if not LCD/Plasma.", "title": "Great Experience", "helpfulness": 85, "user": "MariMckenna", "date": "December 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 11699849, "likes": {"liked": "— Great service, great restaurants on site, friendly staff.", "disliked": "— The in room coffee was not good."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "3. The resort fee is compulsory and an absolute waste. Everyone has cell phones now, who needs unlimited local dialing ? How many people play tennis on a vacation, especially if the court is at the other end of the hotel grounds. All the more frustrating because at our stay the previous two nights at Marriott Waikoloa, the resort fee included daily mai tai's for two, and half-day snorkeling rentals. The resort fee here is a complete sham.", "title": "over priced Deluxe Ocean view room with poor room quality", "helpfulness": 11, "user": "hewu", "date": "December 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 11642677, "likes": {"liked": "— Pool", "disliked": "— room quality (too old)"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007", "text": "4. No fee for parking, phew. At Marriott Waikoloa we paid $7 a day.", "title": "My Vacation from Hell!", "helpfulness": 13, "user": "kilarney1", "date": "December 16, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 11611271, "likes": {"liked": "— Nothing!", "disliked": "— Everything!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "This great time started with the impressive Atrium view when you register! We met many terrific customer service focused staff members helping us to have the best vacation possible. Norma and Brian were always available to answer questions with enthusiam and Island facts; Jennifer, Lance, Owen, and many others should be complimented for doing such a superb job! We look forward to our return trip to the Hyatt @ Kaanapali!", "title": "5 Star Experience", "helpfulness": 2, "user": "slc4939", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128985814}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "OK, so let me start by saying this was part of our honeymoon trip. I'm a regular business traveler (and we travel frequently for vacations as well), so my expectations are high. This hotel did not fail to deliver!", "title": "Heaven on Earth", "helpfulness": 2, "user": "megawatt259", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 128799872}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The grounds were spectacular and the feeling of calm, peaceful relaxtion would be difficult to give into, no matter how hard you tried. Every view was picture perfect and the Kaanapali beach area was especially nice. We used the pool daily (it's resort-perfect: several acres in size, restaurant and bar areas, waterfalls, a separate area for kiddies that borders the main pool, a hot tub and a waterslide. Guests from neighboring hotels even made a point of spending the day at this pool!", "title": "Great grounds,service & pool , but dated rooms", "helpfulness": 1, "user": "Tim W", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 3.0}, "id": 128638313}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We used the beach a few times as well, although it is narrower than other areas of the Kaanapali beach area. This, however, along with the attraction of the pool, made our beach time feel even more relaxing since it wasn't crowded--almost like having a private spot all to yourself.", "title": "Amazing Honeymoon!!!!", "user": "Stephanie B", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128605612}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Our room was nice overall; it was in the main tower. We weren't converted by the platform beds (rather than the traditional mattress and box spring)--we commented that older folks or those that have a difficult time getting up from a lower position might have a difficult time with these. But, having a lanai (balcony) with nice furniture and a nice view made it hard to argue with anything. We also had a walk-in closet, mini-bar, refrigerator and microwave in a separate area near the closet and the vanity and washcloset. Attractive stone finishes and wood made it very pleasing without being dated. The king sized bed room also had a couch, arm chair and coffee table, along with a larger dining table/desk area near the balcony. Not an expansive room, but not crowded for the size by any means.", "title": "I hope that our stay was unique", "helpfulness": 1, "user": "AK_PK", "date": "April 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128591802}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "While staying at the Hyatt Regency Maui, we experienced some of the best hospitality in a long time. Everyone made us feel welcomed and it definitely had the Hawaiian feel to it. The location is great on the Kaanapali beach close to downtown Lahaina and great restaurants. I loved waking up every morning watching the flamingos get fed while gazing over the beautiful Pacific Ocean!!! They have great pools with a water slide and a mall inside the hotel including a Macy's. They also had plenty of restaurant choices to choose from. I would highly recommend this hotel to all visitors. The rooms were very large and accommodating with balcony views. The beds were also very comfortable. There is nothing better than hearing the sounds of the ocean while lying in bed.", "title": "Best hotel in Maui - location and service", "helpfulness": 5, "user": "jchapman73", "date": "April 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15323387, "likes": {"liked": "— Location right on beach, flamingos and excellent pool.", "disliked": "— you have to pay $9.99 fro Wifi access"}}, {"rating": 5.0, "title": "LOVE this tropical resort!", "text": "We've stayed at this hotel 4 times...every time we come to Maui this is the only place we will stay! It is trully all you could want in one of the best places on earth! We had our honeymoon in Wailea at the Fairmont - and still like this place better. We found this place from a co. trip of my husband's (after our honeymoon) and it's definetly the best! The location is the best on the island - Wailea is beautiful also, but the best weather is here in Ka'anapali - it can get cloudy and rain more in Wailea, and up where the Ritz is too. We checked out the spa at the Ritz, and still like everything about the Hyatt the best. If you like to spa, you must go - if even to just hang out in the relaxation room after your massage or facial...words just can not describe how any stress you may have felt on the mainland will literally melt away instantly. The rooms here are fantastic - the bed just envelopes you like no other... you can walk to the shops down the beach - there's an entire outdoor mall with restaurants - Leilani's is my favorite - the Opaka is to die for... You will never want to leave this paradise - all the pictures posted are perfect for showing you what the reviews leave out. You can not go wrong at the Hyatt in Maui! I've already booked our next trip for Nov. 08 - Can't Wait!!", "helpfulness": 4, "user": "traveljunkie9", "date": "April 22, 2008", "id": 15246420}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I had to leave a review after seeing some of the negative comments about the Hyatt in Maui. We just returned - spent the first 5 nights at the Hyatt and we were treated like royalty from the moment we arrived. I still can't get over the top notch customer service they perform - they being every employee we encountered, from the front desk staff to the maids. It's understandable that Hawaii is said to have the friendliest people in the world.", "title": "Honeymoon - surely I can find something wrong here", "helpfulness": 4, "user": "MarkzGirl", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15174037}, {"rating": 5.0, "title": "Hyatt Regency Maui, a Grand destination", "text": "The pool area had some construction but it did not affect any aspect of enjoying the pool and swim up bar.", "helpfulness": 5, "user": "LovesFirstClass", "date": "April 18, 2008", "id": 15129920}, {"rating": 5.0, "title": "The Hyatt is what Paradise must be like!", "text": "Grabbed a Starbucks (on the property) each morning and enjoyed delicious food at each of the restaurants. ESPECIALLY the \"Sonz\" restaurant - the bruch. It was dynamite! We had it 4 out of 5 mornings. I've only seen one other brunch that even compared to this one. $25 sounded like a lot for a brunch, but it was absolutely not. Everything was fresh, neatly displayed, continually refresed and the areas cleaned. The view of the bay - open air so that even a few birds found their way in and then quickly out. Beware of the lines - they can be long - beware that they are not like other lines you may have encountered that are long - these move quickly. More than worth it.", "helpfulness": 5, "user": "kaygee11", "date": "April 14, 2008", "id": 15036980}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "When checking in to the Hyatt Regency Maui, it is customary for the staff to provide their customers with lei greetings. Neither my husband or myself received one, although the couple checking in directly before and after us did. (Not a big deal, but just the icing on the cake to what happened next.) We were told by the front desk that we should take our bell ticket to the bell station and we would be assisted to our room with the baggage. We proceeded to the bell station and were told that no bellmen were available at the moment as they were all delivering bags, but that the next one available would bring our bags up momentarily. After travelling from the East coast of the US, we were tired from the travel and just wanted to take showers and change our clothes. After an hour had passed, my husband called the bell station because our bags had not arrived. My husband then walked down to the bell station and was told that \"even if they had the bags there, they couldn't release them to him.\" They had my husband checking storage to see if the bags were there. Because they weren't, he assumed they were on their way up and came back to the room. He asked me if the bags had arrived while he was downstairs and I said no. It got to the point that we had to speak with the manager before any real action was taken. Turns out they cannot read their own writing and the bags ended up at another room. Way to start out, Hyatt Regency Maui.", "title": "Mixed Feelings on the Hyatt Regency Maui", "helpfulness": 20, "user": "Stanger", "date": "May 25, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3500677}, {"rating": 5.0, "title": "Paradise found!", "text": "I was not sure what to expect regarding the condition of the room, as I had read several different experiences here on TripAdvisor. Our room was VERY clean, including the tub which in most hotels seems to be the most neglected area by housekeeping. The bathroom, however was very small and confining. I couldn't even lay the bath mat towel down all the way. The bathroom sink was seperate from the commode and shower, which was nice. This allowed us to get ready in the morning without having the sink mirror steamed up from the shower. Housekeeping did a wonderful job in our room, however as we later found out, they have until 4pm to service your room. This can be a bit frustrating if you use up your towels in the morning and spend the afternoon at the pool. You either have to use wet towels or wait for new ones. A bit of advice-request a specific time for housekeeping for each day of your visit.", "helpfulness": 18, "user": "Mauionmymind", "date": "May 25, 2005", "id": 3500502}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Our 'Garden View' was more like a parking lot view. We weren't too disappointed since it was quiet at night and it seems most people weren't active after 8pm!", "title": "Honeymoon at the Hyatt Regency", "helpfulness": 20, "user": "goosie1717", "date": "May 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3500376}, {"rating": 4.0, "title": "Enjoyed the Hyatt", "text": "The bed was extremely comfortable, probably the most comfortable bed I've ever slept in. I couldn't believe this was a hotel mattress! I slept like a baby every night of our stay.", "helpfulness": 7, "user": "undecidedguest", "date": "May 23, 2005", "id": 3495530}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "The hotel grounds were immaculate and the staff that worked the grounds were very friendly. Several of the staff whose job it was to water and prune the plants/bushes were happy to talk to us about the plants and answer questions we had.", "title": "Ok but rooms need to be updated", "helpfulness": 9, "user": "Vickie", "date": "May 17, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3478712}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "If you're the kind of person who is more interested in the resort and it's amenities rather than a large, upscale hotel room, then this is definately the place for you. It has penguins!!! What more do I need to say? You have to stay at a hotel that has penguins at it, right? But that's not all, it has an awesome pool with waterfalls, caves, and a waterslide, and great views of the sunset from the pool. It has the nature walk with black swans, flamingos, and yes, penguins. It has some very good restaurants, including one that overlooks the nature walk area (can't think of the name of it offhand). It has a great luau called Drums of the Pacific. It has a tour desk, and it's on a pretty nice stretch of Kaanapali Beach. The only thing I wish would have been better was the room, I felt it was a little small and basic (the bed was insanely comfortable though!). For the price, I felt it should have had a seperate bathtub and glass-enclosed shower, and a flat-screen TV. However, you're in Hawaii, you're not going to spend that much time in your room anyway, so don't worry about it, just hand out by the pool, enjoy your Mai Tai, and don't feed the penguins!!!", "title": "Awesome Resort", "helpfulness": 27, "user": "schererd", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 11249520, "likes": {"liked": "— the penguins!", "disliked": "— the bathroom"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "My husband and I took our 17 and 20 year old sons to Hawaii for Thanksgiving, and while most of our experience was good, there were a few things that irritated us.", "title": "Less than perfect", "helpfulness": 4, "user": "waltunas", "date": "November 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 11167616, "likes": {"liked": "— Grounds are beautiful", "disliked": "— Beach is small and rocky"}}, {"rating": 4.0, "title": "Just a great place to stay!", "text": "First the good: Breakfast at Swan Court was included and was good, but get there before 8 am or the line is very long. Dinner at Cascades was great. Grounds are beautiful, include open space, and not overly crowded like the resorts further down Kaanapali. Rooms were clean and beds were comfortable.", "helpfulness": 9, "user": "NealSil", "date": "November 27, 2007", "id": 11108005}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Shampoo/lotion smell great!", "title": "Capital Investment Needed", "helpfulness": 7, "user": "IlliniRon", "date": "November 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 11012527, "likes": {"liked": "— Pool area", "disliked": "— Renovation Needed"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The not so good:", "title": "WOW - Paradise for our Honeymoon", "helpfulness": 29, "user": "LondonLegend", "date": "November 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10936011, "likes": {"liked": "— The resort & the friendly enviroment in & arround the hotel", "disliked": "— Nothing, it was superb"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife and I spent a week from May 7th thru the 14th for her B-day and enjoyed the Hyatt terrifically. Because it was a special time for us, we were delighted when we were upgraded to an ocean front room at no additional cost and were given a nice photo album as a gift upon our arrival. Our bellman was outstanding when we checked in, he probably spent 30 to 40 minutes with us answering questions and giving us great advice about local eateries, night life and local musicians.", "title": "We could NOT have been more pleased!", "helpfulness": 5, "user": "Headfirst1955", "date": "May 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16060990, "likes": {"liked": "— location right on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Our view of the pool and grounds was extraordinary and the shopping in the hotel is first rate. We ate at all of the on-site restaurants and never had a single complaint about any of the food. Our best meal was at Cacades when my wife ordered the Tempo Box. It had five or six compartments of different food ranging from sushi to steak.", "title": "Wonderful Stay", "helpfulness": 4, "user": "Barbie-ca", "date": "May 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 15975844}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The construction at the new poolside restaurant was very well secluded by a large wooden wall and was no inconvenience to us at all.", "title": "unforgettable", "helpfulness": 2, "user": "princepoetry", "date": "May 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 15972203, "likes": {"liked": "— ambiance", "disliked": "— parking or lack therof"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "We loved our stay at the Hyatt and highly recommend it to anyone going to Maui.", "title": "Just there - May 4 - 8th! Loved it!", "helpfulness": 4, "user": "russp3762", "date": "May 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 15961894, "likes": {"liked": "— location in proximity to beach; pool; weather patterns; room", "disliked": "— driving distance to other parts of Maui"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "We stayed at the Hyatt Regency in Maui from May 3-6, 2008. Upon arrival we were given room 1428. We had reserved a mountainview/golf view room and this room technically was a mountain view/golf view, but it was also a partial ocean view. From our balcony we had a nice view of the ocean. Our room was clean, the beds were wonderful and the service was first rate. Some people have complained about the construction down by the pool, but we did not notice anything on the weekend and on Monday the construction was really not noticeable at all. We would definitely stay here again.", "title": "Maui Relaxation", "helpfulness": 4, "user": "cornishblue", "date": "May 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15942592, "likes": {"liked": "— View and the iPod dock in the room. Empty fridge for our own items", "disliked": "— small bathroom. Almost time for a makeover I think. Upgrade of the TV's for sure."}}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 169, "average": 336, "very good": 805, "terrible": 92, "excellent": 1345}, "aka": "Hyatt Regency Maui Hotel Lahaina", "slim_ranking": 0.678571428571, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Guests enjoy exquisite dining, extensive recreation facilities, international shopping, a collection of asian & pacific art, unique wild life & nightly entertainment and Hawaii's only oceanfront spa."}