{"user_rating": 3.5, "review_count": 388, "name": "Hyatt Regency Albuquerque", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2011", "text": "A nice hotel. A large, spacious gym. Typical comfortable hyatt. Decent pool. A good business trip hotel.", "title": "Fabulous gym!", "user": "TuckerCA", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 113244729}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "I decided to take a quick train ride to Albuquerque from Santa FE to have a nice dinner and a comedy show.", "title": "One way train ride left us stranded. Hyatt showed us the time of our lives.", "helpfulness": 1, "user": "GregMenke", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113171385}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Sitting next to us on the train was a lady that worked for hyatt and had a train schedule with her. We were on the last train for the night. Oops!", "title": "Hands Down - the best place to stay in Albuquerque!", "user": "Jennifer85260", "date": "June 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 112274812}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "This woman told us to just tell Hyatt you were stranded and could they give us a break on the room. We told the lady at the front desk our story, she really took care of us. Too many comps to mention, the really good upgrades. All access pass to a culinary event on the rooftop, I felt like royalty. This was an evening that started out with potential to be ugly. Hyatt made it gorgeous. The next morning, a man herd us talking about how awesome hyatt was to us and gave us a free limo ride to catch our shuttle back to Santa FE. Unreal!", "title": "A 'home away from home' for road warriors", "user": "jgonzaleshou", "date": "June 8, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 112264170}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "I have been in Hawaii for the past nine years and I experienced more aloha here in 24 hours than I can remember anywhere else.", "title": "Awesome romantic stay", "user": "DenverWill", "date": "June 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 112099981}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Visits to New Mexico are always a treat for me. Usually I prefer staying outside of Albuquerque in Taos or Santa Fe or Ubiquity. But for this last trip I chose to stay in town at the Hyatt which was offering an advanced purchase rate of $119.", "title": "The Center of it All", "user": "sallybeagle", "date": "May 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110533564}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Our room was lovely and clean and the staff as friendly and helpful as could be. My grandkids were wowed by the lobby and the newly renovated restaurant served up some of the best hotel food I have ever eaten.", "title": "Beetle in my salad", "user": "brmusicman", "date": "May 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 108408859}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I was surprised by how much there was to explore in this city I had passed up on so many previous visits. The best part is how much you can do, whether you are traveling alone or with kids.", "title": "Does this hotel managment ever visit a room?", "helpfulness": 2, "user": "Threetix", "date": "May 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 107419649}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "If you go, do not pass up the Rattlesnake Museum in Albuquerque’s quaint old town. Whether you are young or old you will be fascinated. It is right on the plaza, surrounded by a ton of shops and restaurants. We also visited the Bio Park, the Botanic Gardens, the zoo and the aquarium. As it was my birthday, I splurged and treated us to a hot air balloon ride at dawn. And after every day, we trooped upstairs to the roof top pool and I watched the kids and sipped a well-earned Margarita.", "title": "Second stay as good as the first.", "user": "TXTravelLady12", "date": "May 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 106578869}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "For a small city Albuquerque has a lot more attractions than many cities twice it size, and the Hyatt was in the center of it all.", "title": "Unforgettably bad\"", "helpfulness": 1, "user": "sallybeagle", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104193267}, {"rating": 3.0, "stay_parameters": "Stayed March 2011", "text": "Stayed her for 4 nights with our daughters for a business conference for my husband. The meeting rooms, breakfast, and banquet were great. Our room air conditioner was broken and after two sweaty nights and several phone calls to the front desk it was finally fixed on the third day of our stay. The exercise room was WONDERFULL!!! Ordered room service one night for the kids and I... Food was okay, my daughters kids meal cheeseburger was missing the cheese. Also, none of the channels were kid friendly. That wasn't a big deal since we were out of the hotel most of the day!!! Great location to check out all that Albuquerque has to offer!! Would have given a four star had our air conditioner been fixed promptly!", "title": "Nice, but not family friendly!", "user": "Travel_lovin_momma", "date": "March 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 101678739}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here during a one month road trip for one night in August 2010 and were fortunate to get a great price from a third party website. We found the Hyatt Regency an attractive and comfortable hotel. The rooms were great, incredibly spacious, well appointed with a lovely view. We used the bar on the ground floor which was pleasant.", "title": "Very nice, reasonably priced hotel", "user": "Sweex", "date": "March 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99030100}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "A very nice stay, would definitely recommend.", "title": "Even McDonalds has free internet", "user": "RamonaJack", "date": "February 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 95971061}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "If I would have paid for this place rather than been on business I would have been much more upset. A ten dollar a day charge for internet is ridiculous, even the McDonalds down the street advertises free Wifi (really). The room was average, I will give a good rating to the gym, most places have a substandard workout area and this one had nice treadmills with decent weights. All in all, I'd choose somewhere else but I was here on the company dime.", "title": "Soap please", "user": "amyelise25", "date": "January 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 94641717}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "During my 4 day stay the housekeeping staff only left me with shampoo, conditioner, lotion, and toothpaste. I was washing my hands with shampoo the first night. They never left refills after cleaning the room. I had to call twice for them to bring me stuff.", "title": "Choose a lower priced hotel", "user": "Jann60542", "date": "January 25, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 94366424}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Rooms are ok, even if they are the standard american rooms, with no atmosphere, comfortable beds, big tv, expensive internet.", "title": "A lot less of I was expecting", "user": "shaker70", "date": "June 1, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 110957340}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I did not try the restaurants, but the food that the hotel offered during the breaks of our meetings was awful. Food in New Mexico can be good, but what we ate at the hyatt was a low quality version of standard mexican meals. Even breakfast, that is usually excellent in the US, was kind of poor, with overcooked scrambled eggs, tasteless fruit and very limited choice of pastries.", "title": "Downtown Elegance", "user": "WagzLady", "date": "June 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 110913228}, {"rating": 5.0, "title": "Fun with kids at the Hyatt", "text": "The pool is nice, quite warm and long enough to allow real swimming.", "user": "george32174", "date": "May 31, 2011", "id": 110839879}, {"rating": 5.0, "title": "It Was Wonderful", "text": "This is a very elegant hotel in the downtown area, just 2 blocks from the newly rejuvenated Central Avenue (formerly Route 66). Lots of things to do and see, along with many restaurants. Easy access to I-40 and I-25. The hotel itself is wonderful; the staff and concierge were priceless. Spa, pool, and exercise rooms are only accessable to the guests via card entry on the elevators. The rooms are more than spacious, with a wonderful king bed, full dressers, table and chairs, and even a comfy recliner for those who curl up to read. Parking is under the hotel (extra$) and has its separate elevator. Restaurant prices are excessive, and there is no bar for a late night cocktail, but with an abundance of other places in the area this was not a problem. All in all, a delightful experience.", "user": "patti3432", "date": "May 31, 2011", "id": 110806765}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Good day – I had the pleasure of staying at your property over Memorial Day weekend with my family. I wanted to share the following:", "title": "Fabulous Hotel with Great Service", "user": "cmitts", "date": "May 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110771368}], "location": {"country": "United States", "city": "Albuquerque"}, "stars": 3.5, "variance": {"poor": 54, "average": 55, "very good": 130, "terrible": 27, "excellent": 122}, "aka": "Hyatt Regency Albuquerque Hotel", "slim_ranking": 0.31724137931, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Discover a landmark hotel. Hyatt Regency Albuquerque is an urban oasis in the Land of Enchantment known for its high level of personal service, upscale amenities and ideal downtown location. Just 10 minutes from the Albuquerque International Sunport, the hotel is directly across from the Albuquerque Convention Center and a short walk to historic Route 66 with its many noted shops, art galleries and colorful avenues.Take the time to explore some of Albuquerque’s best dining options. Enjoy regionally inspired cuisine at Forque Kitchen and Bar or locally produced wine, micro-brewed beer and hand-crafted specialty cocktails at HQue Lounge.Immerse yourself in our rich cultural heritage and 310 days of sunshine a year and you will quickly understand why Albuquerque is the must visit destination of the Southwest. At Hyatt Regency Albuquerque, our renowned service, amenities and downtown location make us the ideal choice for business travelers, vacationers and conferences."}