{"user_rating": 4.0, "review_count": 93, "name": "Hyatt Place Dallas / Park Central", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Spacious double double, but the tub/commode area is oddly small with a door that drags across the floor. Small closet as other have pointed out, but there's drawer space and a lot of counter space. Bed was comfy. Plenty of towels. We experienced no noise issues. Hot water and wifi all good. Staff was friendly; check in and out no problem. I can see where some things and areas are beginning to show wear. They had a bit of trouble keeping breakfast stocked, and it wasn't a busy morning.", "title": "Good Stay", "user": "brngckn", "date": "November 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 183397280}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "All in all just fine for a one-night stay. Decent rate at $91 including taxes.", "title": "Nice modern family friendly", "user": "Whiterabbitqueen", "date": "October 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 183094003}, {"rating": 3.0, "title": "Needs to improve", "text": "Every thing about this hotel is wonderful. Comfy bed huge tv large desk space. Needs a microwave in room but other than that I will stay again. Friendly staff, very clean which is my cup of tea. Breakfast is great along with the coffee, tea and multiple juices. Much to choose from, room service 24/7.", "user": "edtrvl417", "date": "October 27, 2013", "id": 182620313}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Used to be diamond member but found Hyatt was lacking but decided to try again. Parking was poor, and when I went to room the door was open. Called the front desk and they said it was ok likely housekeeping forgot to close door. Not exactly safe and reassuring. For price nearby Westin is better.", "title": "Hyatt Place Dallas Park Central", "user": "ScottEP", "date": "October 2, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "location": 4.0, "service": 5.0}, "id": 179495293}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "2 night stay in September was very nice and a tremendous value. Found a great rate with Southwest Airlines. Hotel rate includes parking, WiFi and free breakfast.", "title": "Overall clean but needing some work", "user": "Christina D", "date": "September 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 177458828}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Great, if you don't want a quiet room and don't want breakfast with a million children.", "title": "Just OK!", "helpfulness": 1, "user": "mikemo", "date": "March 24, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 26747912}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "I lived just nearby for 25 years, so you better know your way around Dallas.", "title": "Great Value and Friendly Staff", "user": "ICTTNI", "date": "January 21, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23752515, "likes": {"liked": "— Price, cleanliness, updated", "disliked": "— Heat and Air system"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "M", "title": "Great Place to Stay", "user": "Harjoe453", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23297973, "likes": {"liked": "— Top notch staff", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "What a nice \" homey place\"", "text": "We stayed at the Hyatt Place for three nights after staying in other Hyatt Place properties in the midwest. The hotel has been recently updated, and the furniture, carpet, beds and linens are nearly new. For the money, the property is a good value, with a complimentary cold breakfast and Starbucks coffee.", "user": "A TripAdvisor user", "date": "September 24, 2008", "id": 20343690}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "The staff at this property is friendly and goes out of their way to be helpful and accomodating. For the dollar value, this is a great place to stay.", "title": "Very nice for business travellers", "user": "kkingmd", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 19945209, "likes": {"liked": "— clean, modern, large rooms. Staff terrific!", "disliked": "— Food a bit pricey"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Midweek prices in Dallas can be a real shock so I was looking for a better priced alternative to the usual place I stay while in Dallas for a quick trip... They will be sorry that their midweek price sent me to the newly renovated Hyatt Place because I will never go back after finding this hidden gem on 75 near 635! What a great surprise... I read the reviews on here saying it had been redone and upgraded with 42\" flat screen televisions but for the $129 price for a Wednesday in Dallas I was blown away by the boutique hotel feel and extremely courteous front desk staff. The room was perfectly appointed with granite counters, mini fridge, wonderful comfy beds and that wow factor 42\" flat screen... I didn't think I'd get any sleep because I was so happy enjoying my room! A pleasant continental breakfast is embellished with some great custom order and pay options and the starbuck's coffee choices and constantly available crisp granny smith apples have made a quick fan of me. I'll be back again and again and again.", "title": "Amazing hotel for this price range!", "user": "KathleenB1977", "date": "June 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17093512, "likes": {"liked": "— Courteous Staff, Clean, Excellent Room, Reasonable Price!", "disliked": "— that I didn't know about it sooner!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "I would recommend this hotel. It has been completely renovated and the rooms are great...they are clean and new. There is a sitting area in your room with a L shaped couch and flat screen TV.", "title": "Clean, Comfortable, Great Price", "user": "NorthEast33", "date": "June 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0}, "id": 17034475, "likes": {"liked": "— Recent Renovations", "disliked": "— Slow, not much going on."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "During my stay, the hotel was at an extremely low capacity. If you're looking for a hot spot for activities, this is not the place for you. Very Quiet.", "title": "Great place to stay in Dallas", "user": "jmurphyjohnson", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 16642192, "likes": {"liked": "— The price for the qualityof the rooms", "disliked": "— Nothing really comes to mind, unless you are arriving or departing during rush hour"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I didn't venture far from the hotel so I have no idea of what is around the area. My first impression is that there really isn't much in the immediate vicinity.", "title": "Very Inviting", "user": "reneoy", "date": "January 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12906551, "likes": {"liked": "— Cleanliness", "disliked": "— Odd location"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Amenities: The hotel is a no frills type of place. There is a self service kiosk for check in. For food there is a small bar that serves alcohol and a limited menu of hot and cold food. There is a free continental breakfast.", "title": "Its an Amerisuites not a Hyatt", "helpfulness": 1, "user": "AUTUMNSUN", "date": "April 4, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 3.0, "location": 3.0}, "id": 7282155, "likes": {"liked": "— It was free", "disliked": "— slow elevators"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "When I got to my room it was musky and then I realized the airconditioner didn't work.. They changed my room and there was a leak under the sink..they changed me again and the room was \"ok\".. the rooms are dark and depressing and you and you can hear every noise. the breakfast was nothing special even though they advertise a \"bountiful buffet\" its not. This hotel is not even close to being 2 1/2 stars. maybe 1. If you have a choice stay away.", "title": "not very nice", "user": "loriyand", "date": "March 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 2.0, "rooms": 2.0, "location": 4.0}, "id": 7217645}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "Upon arrival check in was quick and simple. The lobby was nice and there was a free complimentary breakfast. The room I reserved did not have a working air conditioner. I contacted the front desk and after about 30 minutes they transferred to me to another room. The only problem was they had a smoking double because they were overbooked and I reserved a non-smoking double. Smoke troubles my allergies so I went to check the room to make sure it was suitable and did not smell like smoke and to my surprise it did not so I happily changed rooms. The hallway had a heavy smell of smoke though. The room was average and clean. There was some mold around the grout of the bathtub which was kind of gross. The bathroom sink is outside the bathroom which was nice since there were 2 people staying in the room. There was also a full length mirror which I thought was great since most hotels don't have them. The room had a good sized sitting area with a table, couch, desk, and small sink area with a microwave and small refrigerator. There was free wireless internet access and an ethernet cable in the room, which worked much better than the wireless as the signal was very low. The location is good, easy access to hwy 75 and hwy 635. I didn't have any problems sleeping with the highway traffic sound. Even with my room facing the highway, I could barely hear it. Overall it was a good stay.", "title": "Decent for the price", "user": "vintageshimmer", "date": "March 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7191940, "likes": {"liked": "— Easy acces to the major highways", "disliked": "— The mold around the bathtub"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "Stayed at the Amerisuites for one night with boyfriend. The hotel is really clean although I did receive a double room when I reserved a king room. The problem was fixed very quickly.The room was clean although in no way shape or form a suite in my opinion. There is a wall that separates the bedroom from the sitting area and I found the room the smallest suite I've ever seen. The kitchen is functional with small fridge, microwave, and stove. However, the problem is insulation. We heard every noise going on outside from the construction, the people upstairs, the people walking by outside in the hallways. There is no insulation to guard against noise. Didn't get a good nights sleep at all. The heating unit is one of those in the wall units that only heats the immediate area which wouldn't be a problem if Texas was not having an ice storm that day so it was freezing! The breakfast buffet was decent as long as you don't mind warming it up. There are very few restaurants nearby and the staff is not very knowledgable. I would not return but may be economical choice for business travelers", "title": "For business travelers only", "helpfulness": 4, "user": "davissummer24", "date": "December 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4230701}, {"rating": 4.0, "title": "Loved It", "text": "Hotel was fantastic, well presented and clean. Staff were lacking local knowledge however were very friendly. Breakfast was plentiful and free. Suites would suit family, strongly advise to hire a car as hotel a bit out off the way from down town. Places worth seeing South Fork Ranch, 6 Flags theme park, Billy Bobs(Fort Worth)", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 11, 2004", "id": 1925114}], "location": {"country": "United States", "city": "Dallas"}, "stars": 3, "variance": {"poor": 5, "average": 15, "very good": 35, "terrible": 4, "excellent": 34}, "aka": "Hyatt Place Dallas / Park Central Hotel Dallas", "slim_ranking": 0.356382978723}