{"user_rating": 4.5, "review_count": 700, "name": "Hyatt Regency Lost Pines Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This was our second time back at LP and it was just as wonderful as the first! We have three girls ages 7,5 and 3 and they did NOT want to leave. We even extended our stay an extra night (we stayed 5 nights) because the kids were having so much fun and my husband and I were actually getting to RELAX!", "title": "So Good We Stayed An Extra Night!", "helpfulness": 1, "user": "Mamaofthreechickies", "date": "July 8, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 133803572}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "So many wonderful things to mention about the resort....4th of July fireworks were awesome and we loved how they honored all that have served our country, my kids were so happy at the pool for HOURS, the food and drinks were superb, felt like they were quite full at the resort but there were plenty of staff members there and all ran smoothly. Also, they had an activity room for the kids (out of the heat), all kinds of art projects going on constantly and we thoroughly enjoyed getting to interact with the staff that is over the animals....they couldn't have been more patient and kind. My 5 year old LOVES animals and they let her walk the alpacas, she got to pet the donkeys, have her picture with the Longhorns (T-bone and Ribeye), they always let her pet Hoss (the Hyatt dog), they educated us about their horses while on a wagon ride and we learned so much about the resort and the grounds on the tractor hay ride. The evening s'mores and movie on the lawn were the perfect endings to quite perfect days.", "title": "Family fun mostly", "user": "Carmen M", "date": "July 8, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 133775939}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Hope to go back in fall or spring with just the hubby because they have all kinds of hiking trails and things to do that would be so fun for us. Summer is definitely family season, so expect there to be lots of happy kids running all over!", "title": "Wonderful Service and Beautiful Property", "user": "Knoelle_12", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133765864}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "On another note, we were told from staff how much they like the GM there because he/she cares so much about taking care of people. It shows. Love putting our business with places that care and treat people the right way.", "title": "Great get-away!", "user": "Traveldenali", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133720169}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Helpful note for families: Even though they do not allow coolers in the pool area, we brought one for the room (our room had a mini fridge) and our kids ate breakfast and had snacks and sandwiches there to help with food costs. Also, one night we ordered a pizza from the restaurant to-go for the girls....it was excellent and the not too $$ at all.", "title": "Great time at Lost Pines", "user": "sammicatwoodlands", "date": "July 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 133695861}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and I shipped the kiddos off for a week, and decided to take a short mid-week getaway. We stayed for one night, checking in on a Wednesday. Their rates midweek are AWESOME. The stay started out great when I arrived and was given early check in @ 10AM. The front desk was awesome, friendly and smiling. The room was a first floor King which opened on to the grass and walking trail on the end of the building farthest from the pool. The room was average size, nicely appointed, if not slightly dated. Very clean. One thing that impressed me was that almost all of the employees we encountered , even just passing in the hall, engaged us with some sort of greeting and a smile. Talk about making you feel like a VIP. We dropped our stuff and headed out for some fun on Lake Austin. When we returned we decided to head over to the pool and lazy river. Had a few cocktails which were resort priced and so-so. The pool was beautiful, but the water temperature was very hot. Daytime temps were 100+ the week we went, so I am not sure that there is a solution to that. It was like a hot bath. Later that evening some friends joined us for dinner. We had a beers in Shellers which was great. Dinner at the Fire Wheel was ok. I have to say that the Fire Wheel is really showing it's age. The fixtures are dated, which sort of gives you the impression it was unclean. It's a shame, because the food was good and the service was great. We had the buffet at Fire Wheel for breakfast, and my wife and I raved about it. Some folks have an issue with the prices for food, cocktails and resort fees. While I certainly would prefer to pay less, I understand that places like the Lost Pines are RESORTS. It is LUXURIOUS it should be a TREAT. It's not priced as a place you stay on your way to somewhere else; it is a DESTINATION. If you set your mind right before you go( and the resort delivers value for your resort $), you will not be disappointed. Overall, I had a positive experience here and will keep it in mind for future getaways!", "title": "Great Mid-Week Getaway", "helpfulness": 3, "user": "jamlewis", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 135339332}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "You gotta go at least once. Food and service are incredible and th amenities are perfect. My kids were so upset to leave. I will definitely be back!", "title": "Fantastic for families and private enough for an adult get away.", "user": "Mturner71", "date": "July 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 135294899}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I took my girlfriend a month ago and took my 8 and 10 year old recently.", "title": "Fabulous Time At Lost Pines", "user": "Krista H", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135073103}, {"rating": 3.0, "stay_parameters": "Stayed July 2012", "text": "The girlfriend and I have Lost Pines at the top of our list for places to get married.", "title": "Hot hot hot!!", "helpfulness": 4, "user": "CristyAutry", "date": "July 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 2.0}, "id": 134935684}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The first time my husband, daughter, and I have stayed at Lost Pines. From the efficient, friendly Front Desk Staff to every outlet, spa, etc. the Staff was definitely there to ensure our happiness. Stories Restuarant is formal dining but for a special meal with family or friends you shouldn't miss it. The staff at the Spa is friendly and treats everyone so special. We enjoyed seeing the \"Horseshoeing\" and Paula and her husband are Texas friendly and so welcoming. We were there on the horse's birthday and the horseshoe cookies and cake were adorable. The ambiance of Lost Pines is great for all ages...something for everyone! Can't wait to go back and visit again. Rarely in the room as I didn't want to miss a thing!", "title": "Lot's of fun at Lost Pines", "helpfulness": 2, "user": "TonyG55", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134549828}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We try to go at least twice a year. It's not to far from home so a one night stay is perfect for us. We arrive early that morning and stay in the lazy river all day. I'm glad to see that they have added more sitting areas around the pool. Only problem with the last visit was there wasn't enough tubes. It wasn't extremely crowded so I'm not sure why. The firewheel cafe has the best breakfast buffet. Also, I love the outside movie and s'mores at night.", "title": "Always a fun and relaxing time.", "user": "Sossamanbailey", "date": "July 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133894737}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We met our adult children and their families here last weekend. It was my first trip and I didn't really know what to expect. Our group included seven children, ages four to twelve. They, their parents and grandparents all had a great time. Some of us did archery, some went horseback riding, all of us swam and ate. The only \"downer\" was that a planned sunset float trip on the river was cancelled because of threatening thunderstorms but I certainly didn't want to be on the river during a storm.", "title": "Great family vacation place", "user": "Texasmh", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133884829}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I don't think the Hyatt website does justice to this place. We had a lot more fun than we expected. And I was impressed that when the storm threatened (didn't really happen--just a quick shower) the Hyatt people immediately turned a ballroom into a child's delight with crafts, bounce house, games and young staff. Impressive.", "title": "Always a great experience...", "user": "Wardsntx", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133877040}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The man-made lazy river is super...significantly longer and more fun that I expected. I think it was a favorite with all of us.", "title": "So enjoyable!", "user": "2Anita", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133851976}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Great place to go as a family or for a romantic getaway. Staff is always very friendly and the atmosphere is always welcoming and warm. S'mores on the fire pit and hiking from the resort into the neighboring state park along the Colorado. Lazy River and pool area is FANTASTIC for kids and if you are a couple looking for some quiet time away from kids...there is a adult only section of the pool/waterpark. Close to the stables for horseback riding, and the spa services are great too...need a place just to get away with no agenda - this is the place. Only a 20 min drive into Austin, so you always have that choice to take in a tour of the state Capitol or eat some famous bar-b-q or go for some fun on 6th street. You can't go wrong with Hyatt LP!", "title": "AWESOME!!!!!!!!!!!!!!!!!", "user": "Ohad T", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133834889}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We have come to Lost Pines for three years for a family reunion. There are 22 of us total. We always LOVE it. The service is GREAT. The facilities are wonderful. The older the kids get, the more there is for them to do - and they LOVE it. It's the perfect gathering place for our families. And, when our kids have participated in the free activities (candy jewelry making, sand art) or the paid events (horseback riding, zip line, etc.) the staff are always exceptional, skilled and kind.", "title": "Love this place!", "user": "ViewFromAli", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 134208508}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The hotel has nice grounds and an attractive water park. There were an overwhelming number of children in the hotel, running in the hallways, banging doors and making a lot of noise. On Sunday evening, the families in the rooms on both sides of us were making horrendous racket. I called the front desk to ask to be moved, but the call led me to a voicemail box. Eventually, as the kids went to bed, the noise settled down, but it was an unpleasant start to our vacation.", "title": "Nice grounds, but the hotel was crowded, noisy and worn", "helpfulness": 2, "user": "Linda E", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 134089156}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I was disappointed in the cleanliness of the room. When I pulled down the covers of the bed I found a few hairs on the sheets, leading me to believe that the sheets weren't changed after the previous occupant left (yuk). The carpet in the room and the hallways also needed to be vacuumed.", "title": "Could've been good, but...", "helpfulness": 2, "user": "BESTTXBOY", "date": "July 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 134065970}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "On the positive side, the food was good. The servings were big, so sharing an entree is a way to eat at a reasonable cost. The waitstaff was friendly and helpful.", "title": "Great Family Vacation", "user": "dallasiteonbusiness", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134017787}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The recreational activities were plentiful. Bikes were available to rent, so getting around the expansive grounds is easy. The first hour of bike use is free, which was a nice surprise. Spa treatments were very expensive, so I passed on those.", "title": "Great Family Vacation", "helpfulness": 1, "user": "dallasiteonbusiness", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 133916396}], "location": {"country": "United States", "city": "Cedar Creek"}, "stars": 4, "variance": {"poor": 23, "average": 76, "very good": 201, "terrible": 19, "excellent": 381}, "aka": "Hyatt Lost Pines", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "This 492 room resort located 17 miles from Austin offers chapionship golf, exquisite dining, outdoor adventure activities and full spa service."}