{"user_rating": 4.5, "review_count": 1214, "name": "Hyatt Regency Taba Heights", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "This is a very nice hotel. There are several accommodation blocks, all well spaced out and individually designed, which lead down to the hotel’s own private beach. The gardens are beautiful and thanks to the subtle lighting are particularly attractive at night.", "title": "Nice quiet place for weeks break", "helpfulness": 10, "user": "RossyFan", "date": "February 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6746083, "likes": {"liked": "— The quiet"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2004, traveled as a couple", "text": "The food and service were excellent, a couple of nights we traded in our half board allowance to eat at the Lebanese restaurant which was fantastic. The grills arrive in a pot, smoking on hot charcoal (check the wind direction before deciding where to sit). The portions are very generous and there’s enough in one main for two people if you have starters and maybe a side dish with the main. We also ate at the Italian which was OK and the fish restaurant, which again was fine, if a little pricey. Buffet breakfast was good and the choice extensive.", "title": "Fantastic", "helpfulness": 5, "user": "GuernseyGirl", "date": "January 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6713245, "likes": {"liked": "— The cleanliness and the views", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Our room was spacious, comfortable and had a pleasant large balcony overlooking the top pool (a nice quiet area to chill out for a few hours).", "title": "Great Holiday in Taba Heights", "helpfulness": 21, "user": "FrancesHove", "date": "January 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6687455, "likes": {"liked": "— Nice big room with lovely balcony and views", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "The price of alcohol has been mentioned in several reviews so I thought I’d add to the debate. The local wine, Obelisk, at the current exchange rate is about £12 odd a bottle which is more or less what I’d pay in a restaurant here in Bolton for a decent Pinot Grigio. In most bars, the local beer is about £3 a pint but there are, however, two for one happy hour offers, details of which are in the hotel information packs in the room. From memory, the Beach bar has the offer from 4.00pm till 6.00, the Rocks bar 6.00pm till 7.00 and the Breeze Bar has selected after dinner spirits and liqueurs on offer till late. In the Breeze bar, you also get to see the barman do some fairly interesting tricks with burning sambuca. Finally, Waterworld, sometimes, I think, referred to as the Dive Centre has a very nice café by the sea and from 4.00 sells local beer at E£14 a pint (about £1.20). The food here is also good. The last shuttle bus back to the hotel is 6.40 (it’s free).", "title": "Christmas in Taba", "helpfulness": 6, "user": "PalomoLondon", "date": "January 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 6575324, "likes": {"liked": "— Comfortable and clean with private balcony. Excellent service", "disliked": "— Very expensive alcohol and restrictions on bringing your own"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "I’d recommend the Hyatt Regency, and Taba, for anyone looking for a quiet relaxing winter break", "title": "Good pools and a reasonable beach with good snokelling but..", "helpfulness": 5, "user": "scfc", "date": "January 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 6569466, "likes": {"liked": "— proximity to beach", "disliked": "— expensive, not cleaned well, poor childcare, poor entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Our trip was 9/2 – 16/2 we had booked our flights and hotel independently. We flew from Manchester with Thomsonfly all passed without problems. We arrived at Taba airport no problems with visas etc, we were met by our driver unfortunately we were detained at the airport exit for 40 min !! It seems security will not let single cars out we had to wait for more cars and coaches ! This was quite irritating. It took us about 40 minutes to get to the hotel, on the way the driver took us to the pharmacy as my daughter ( age 5 ) had developed a bad cough he spoke to the pharmacist for us explained her symptoms etc and the pharmacist gave us cough medicine and anti biotics – for just £5.", "title": "Beautiful setting", "helpfulness": 7, "user": "spadge", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7270684}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "Check in was quite smooth we were given complimentary fruit juices, and asked if we wanted to upgrade to a lagoon room for $10 per night !! We said yes and I am so glad we did. We were then taken by buggy to our room, the room was beautiful very newly decorated slight smell of paint ! King-size bed lots of pillows and a roll away bed for our daughter. The balcony was huge with a lovely view over the lagoon and to the sea and also Jordan and Saudi.", "title": "Didnt want to leave!", "helpfulness": 5, "user": "ollybee", "date": "April 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7266586, "likes": {"liked": "— The gardens and wonderful spa", "disliked": "— The food choice could have been better"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Breakfast was very good, egg station, waffles, cereals, yoghurts, pastries, various juices etc. Lunch you could eat in a choice of two bars – its was ok but not a huge choice and something’s were a little expensive. Evening meal was buffet style and we felt this got a little dull and wasn’t that varied. You do of course have the option of using the dine around and also going to the a la carte restaurants we didn’t do this. On about day 3 there was a large influx of guests and the service declined somewhat, if the hotel were full I think it would be incredibly busy and not enough places to cater for everyone for food and drink. Drinks are a little on the expensive side, we were naughty and took some wine from the airport to drink in the evening we asked fro our fridge to be emptied and put our wine in it ! we also ordered the box of water which worked out at quite good value.", "title": "Great resort, except just a few things", "helpfulness": 11, "user": "punkyhoya", "date": "March 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7218919}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The main pool is lovely ! it was heated and it certainly needed to be at that time of year, the other pools were too cold. The beach is nice they cleaned it whilst we were there as I think there had been some complaints about the amount of litter strewn about. The grounds and whole lay out of the hotel is very nice, its all very peaceful and serene. The fish are great but it’s somewhat different to Sharm you have to get in the sea and snorkel to see them whereas at Sharm you saw lots just from the pontoon, you can see them from the pontoon in Taba buts it’s a much better experience to snorkel. We saw an octopus which was amazing and also a huge variety of fish.", "title": "Great for a one week break", "helpfulness": 6, "user": "tonyclk230", "date": "March 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7194635, "likes": {"liked": "— Spacious & clean", "disliked": "— No tea & coffee making facilities"}}, {"rating": 5.0, "title": "The best place to do nothing!!", "text": "Staff were a mixed bunch some lovely and smiley and made a huge fuss of our daughter others seemed quite miserable.", "helpfulness": 4, "user": "BertieB49", "date": "March 13, 2007", "id": 7154153}, {"rating": 4.0, "title": "Wonderful room with a view", "text": "After getting the room changed to one with a much better view - from C block to J- which was actioned witn charm and a gracious attitude by the Reception staff, the time spent at this hotel was excellent.", "helpfulness": 2, "user": "Adamos", "date": "March 12, 2007", "id": 7014923}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "As others have said the food is most acceptable- the half board arrangement works well- a goodly breakfast out on the terrace of the Limoncello restaurant, and then a most excellent Dinner also on the terrace with a heater overhead to combat the slighlty cool air.", "title": "Great Hotel", "helpfulness": 6, "user": "philster1", "date": "March 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6920540, "likes": {"liked": "— Clean and spacious"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "The European wines were ludicrously expensive, the Egyptian red tolerable but the Rose- it had a nose of disinfectant and tasted of ...nothing much.", "title": "Pub Tandoori jwel of Hyatt Taba ", "helpfulness": 3, "user": "neevats", "date": "March 6, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6919981, "likes": {"liked": "— spacious rooms and good indian food if u like curries", "disliked": "— no coments"}}, {"rating": 5.0, "title": "Thoroughly Enjoyable", "text": "One cannort fault the relaxed and charming manner of the staff- one of the most pleasant places I've stayed for gracious and friendly service.", "helpfulness": 5, "user": "GeordieReg", "date": "February 24, 2007", "id": 6834859}, {"rating": 4.0, "title": "Copy of Sheraton Miramar, but not for food!", "text": "The room was very acceptable particulalrly as it had a stunning view of the beach and gardens.", "helpfulness": 7, "user": "erps kwerps", "date": "February 22, 2007", "id": 6823689}, {"rating": 3.0, "stay_parameters": "Stayed February 2005, traveled as a couple", "text": "Having previously stayed at the Hyatt in Sharm El Sheikh, we booked the Hyatt in Taba for a cheap week in the sun.", "title": "OK for a week but no longer", "helpfulness": 4, "user": "Hertsgirl99", "date": "February 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 6815718, "likes": {"liked": "— Good value for money", "disliked": "— Nothing to do in the Resort of Taba"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "The hotel was fine, spacious public areas and a few different pools. However it wasn't quite as good at the Sharm hotel.", "title": "Lovelly hotel very relaxing", "helpfulness": 4, "user": "ruthfa", "date": "February 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6807590}, {"rating": 5.0, "title": "Best kept secret ! !", "text": "The food was ok and there are different restaurants catering for different tastes.", "helpfulness": 22, "user": "Derby", "date": "February 16, 2007", "id": 6802251}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "There is absolutely nothing to do in Taba and this was the first time we'd been away on holiday and hadn't left the hotel grounds! So I definitely wouldn't stay longer than a week.", "title": "Lovely Experience", "helpfulness": 1, "user": "peewee29", "date": "February 14, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "business": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6788967, "likes": {"liked": "— The spacious rooms, no tower blocks, lots of room to move around (gardens)", "disliked": "— The price of drinks"}}, {"rating": 4.0, "title": "cold at night this time of year", "text": "The hotel is right on the beach but with all these resorts it can get a bit windy. You can snorkel and this is good but again, not as good as Sharm.", "helpfulness": 3, "user": "mr_chipsPortsmouth", "date": "February 12, 2007", "id": 6781912}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa", "city": "Taba"}, "stars": 5, "variance": {"poor": 48, "average": 109, "very good": 366, "terrible": 22, "excellent": 669}, "aka": "Hyatt Regency Taba Heights Hotel", "slim_ranking": 0.230769230769, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Situated on the Red Sea, surrounded by the Sinai Mountains, Hyatt offers guests direct access to the sea, impressive architecture, lush landscaping and extensive facilities. With a myriad of in-house facilities and dining options, you will not have a dull moment. The azure waters of the Red Sea, the myriad pools, the seawater lagoon and all the state-of-the-art services of Club Olympus provide water lovers and activity buffs a range of options to choose from."}