{"user_rating": 4.0, "review_count": 1025, "name": "Hyatt Fisherman's Wharf", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Got our room the morning of our stay for $95 on Priceline (best online rate I could find was $210). The room was pleasantly comfortable and looked like it had been renovated in the previous year or so -- great beds, nice shower, good 42-inch LCD with about 35 channels. We had nice weather so the kids checked out the pool -- small, only 3-1/2 feet deep. Parking at the Hyatt was $38 plus tax, which is about standard for that block.", "title": "Good family choice", "helpfulness": 1, "user": "JRCaesar", "date": "August 18, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5623497}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "For those of you who've never stayed in Fisherman's Wharf, there are about six chain hotels right next to one another along North Point and Bay Streets. If traveling alone or just with my wife, I might have instead stayed at one of the two nearby Kimpton hotels (Argonaut, Tuscan Inn), but the Hyatt was terrific for a family stay.", "title": "Great place to stay near the Wharf!", "helpfulness": 4, "user": "kpwhubert", "date": "July 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5513874, "likes": {"liked": "— The bed was wonderful.", "disliked": "— Parking was too expensive."}}, {"rating": 4.0, "title": "They believe in great customer service!", "text": "We booked through Priceline and got the Hyatt at Fisherman's Wharf for $90 a night. Having heard some bad experiences about Priceline customers getting small rooms and such, we were a little worried. No need to be...I called Hyatt upon learning of my winning bid and requested a King non-smoking room. We arrived and were given just that and more. Our room was beside the Governor's suite and was quite large. A separate dressing area and a huge bathroom with a jacuzzi greeted us as we opened the door. The location is terrific...just a half block from the Cable cars and two blocks from the Wharf. Safe neighborhood...we walked everywhere and had no problems. The staff was friendly and helpful and the bed was about the best we've ever slept on in a hotel. The room had recently been renovated and had a new LCD tv and new furnishings. Would we return to the Hyatt? We're already planning another trip!", "helpfulness": 1, "user": "Beth527", "date": "July 22, 2006", "id": 5497082}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Spent three days at the Hyatt at Fisherman's Wharf in July06 for business. The most comfortable room with all the amenities, except mini bar. All staff great, from check-in to front desk to car valets to servers in the restaurant.", "title": "Great location, great service", "helpfulness": 1, "user": "eBzky", "date": "July 21, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 5495246}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "This is a nice hotel in an excellent location, near all the great attractions of Fisherman's Wharp, Pier 39, Ghiradelli, etc. Although I was on a business trip, I brought my family along (including 10 year old boy & 5 year old girl) and we stayed five nights.", "title": "Great Hotel", "user": "sheralic2005", "date": "July 16, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5469814}, {"rating": 2.0, "stay_parameters": "Stayed November 2005", "text": "We booked to stay for 3 nights at Hyatt Fisherman's Wharf on the understanding that this was one of the best hotels in the Fisherman's Wharf area. If this was one of the best, I dread to think what some of the others are like.", "title": "A real disappointment", "helpfulness": 20, "user": "TravelFan_01", "date": "December 12, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4232898}, {"rating": 3.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "In hindsight, it was a mistake to stay at Fisherman's Wharf anyway. Myself and my husband spent part of our honeymoon in San Francisco three years ago but stayed near Union Square. At the time, we seemed to be travelling down to Fisherman's Wharf a lot for Alcatraz, Pier 39 etc so it made sense just to stay down there this time. In fact, we ended up spending nearly all of our time away from there! I don't know what has happened in three years, but it seemed to feel more unsafe, more seedy, more tacky and there were certainly more beggars down there. We could hardly walk out of our hotel without getting hassled by someone, and therein lies the first problem of Hyatt Fisherman's Wharf.", "title": "Just Ho-Hum", "helpfulness": 7, "user": "amtedrow", "date": "October 26, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4053348}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "We booked the hotel through priceline for $75 a night. Upon arrival after requesting a nice room they offered an upgrade for $90 to the newly renovated top floor. We looked at both rooms and went with the hip, newly renovated one. My husband and I loved it, beautiful king bed, flat screen TV, contemporary funrnishings and a great location (if you're doing all the touristy things). Walking distance from North Beach and Fisherman's Wharf.", "title": "Really enjoyed our stay", "helpfulness": 4, "user": "dreamz76", "date": "July 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5414986}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "As is the case in SF, parking was really expensive ($35 a night), but most convenient as they offer a flat rate with in-and-out services.", "title": "Great Hotel, Great Location", "helpfulness": 2, "user": "Katrinia", "date": "June 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 5317076}, {"rating": 4.0, "title": "Great Hotel with great service!", "text": "The concierge was very helpful and recommended some very good places. Our favorite was breakfast at Pat's Cafe, a great way to start the day. Wonderful home style pancakes and waffles, free wirless internet, great service.", "user": "A TripAdvisor user", "date": "May 29, 2006", "id": 5232417}, {"rating": 2.0, "title": "Just the room - no free bells and whistles - hang on to your wallet!", "text": "We highly recommedn the Segway tours, a novel experience, bit pricy though. The SFMOMA is worth a visit for anyone interested in modern art. Also if you have half a day, the 49 mile drive takes you through all of San Francisco and is a great way to get the flavor of the entire city (pre-print the map - some signs have been stolen).", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 5, 2006", "id": 5036929}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "We stayed in a newly renovated room. The room was lovely. The bed was the best bed I ever slept in, including at home!", "title": "Enjoyed our stay", "helpfulness": 4, "user": "alertvideo", "date": "May 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5034731}, {"rating": 2.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "The pluses:", "title": "There are better hotels out there.", "helpfulness": 9, "user": "noirjet", "date": "March 25, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 4731815}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "-The hotel is in a good location if you want to stay in the Fisherman's Wharf and be close to Northbeach/Chinatown.", "title": "Great location!", "helpfulness": 4, "user": "tallgrl651", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4721119}, {"rating": 4.0, "title": "Not bad for kids", "text": "-Excellent beds. If you need a lot of rest and not interested in being out, this is a great hotel for it. But, then again, why pay Fisherman's Wharf prices, when you can stay somewhere else with much better rates?", "helpfulness": 1, "user": "djt68", "date": "March 7, 2006", "id": 4590692}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "-The rooms have recently been upgraded with very comfortable plush beds, flat screen TVs, and new fixtures.", "title": "Great location, but nothing fancy.", "helpfulness": 2, "user": "bdubs9", "date": "January 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4389602}, {"rating": 5.0, "title": "Excellent location, overall a great hotel", "text": "-There's a decent size lap pool and jacuzzi.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "December 22, 2005", "id": 4256328}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4, "variance": {"poor": 55, "average": 175, "very good": 469, "terrible": 22, "excellent": 304}, "aka": "Hyatt At Fisherman`s Wharf Hotel", "slim_ranking": 0.36170212766, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Located in the heart of historic Fisherman's Wharf in San Francisco. Exciting attractions are nearby, including PIER 39, Ghirardelli Square, North Beach and Chinatown. At San Francisco's most European Hyatt, you'll find 313 guestrooms and suites, 19,000 square feet of Conference Space, Outdoor heated pool and fully equipped fitness center. Automated Business Center available 24 hours, high speed wireless capabilities in guestrooms and function space, and Concierge Services. Knuckles Historical Sports Bar & Grill voted #1 Sports Bar in San Francisco."}