{"user_rating": 4.0, "review_count": 3153, "name": "Hyatt Regency Chicago", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I stayed here several years ago and always thought of this as one of those \"escalator\" hotels: full of conventioneers, dark walls, etc. They have completed an amazing renovation and it is exceptional. The beds and linens are superb, the food is fantastic, the building is gorgeous. Very modern. The breakfast buffet at Craft is a must: $24 but very high end, amazing pastries, fresh fruit parfaits. I had dinner at Stetson's and the sushi was fabulous. We ate every meal on site because the food was great. Service was fabulous also. The spa was also great. If you want a deep tissue massage, Lily is a must! The gym got me working out every day! Lots of equipment, headphones, mats, weights, and cooled peppermint hand towels. Disappointed I don't have another meeting coming up in Chicago!", "title": "Amazing Stay!", "user": "kayak41952", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161827786}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This property was magnificent. Check in with computer terminals were a breeze. The room was clean and smelled fresh. The bed was extremely comfortable with fantastic pillows and comforter. I stayed in a regular king room. The bathroom was stocked with very nice amenities and soft towels.", "title": "NRA at Hyatt Regency Chicago", "user": "Michael A R", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161651928}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "LED television had a good selection of channels. There was plenty of space to work in the desk. The mini bar was well stocked and the lounging area in the bedroom was comfortable.", "title": "Great Location!", "user": "Marilyn W", "date": "May 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161543213}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "I especially liked the American bar and restaurant on the first floor. The assortment of local beers was well represented and the food was above expectations. The waiter could have been more attentive, as he forgot to bring silverware with the meal. Another waiter passing by resolved the issue.", "title": "A very comfortable but huge hotel near the O'Hare Airport", "user": "Dilyara S", "date": "May 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161466612}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "he market basket area was nice to pick up a quick drink, coffee or sandwich with very friendly staff. The front desk staff was also very friendly and helpful. Taxis were easy to get and transportation to the restaurant show was very convenient.", "title": "Grand stay at a great hotel", "user": "gadgetguy63", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161448343}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The location of the hotel was great. Central to the park and downtown. The staff at the hotel was great. Very helpful and answered every question. The accommodations were less than expected. The bed was too soft. It felt like the mattress was 20 years old. The pillows must of come with the mattress. There were 2 small drawers to put clothes in. Had to live out of the suitcase for 5 days. Paid $20.00 extra for a city view. Bad choice. On the 16 floor and only could see a few of the closer buildings. Needed to be higher. Had a better stay at the Embassy last time.", "title": "HYATT - CHICAGO ON WACKER STREET", "user": "Doug P S", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 162195236}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Recently stayed at the Hyatt Regency Chicago on Wacker Street. Hotel has an open lobby with great meeting space contained in two buildings. Service was very good and hotel room very nice and comfortable. This hotel is across from the river and is within walking to many attractions. Had a good stay and good meeting. The Convention staff was excellent.", "title": "Convention space and great location!", "user": "TValls", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 162162688}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This hotel is located in the heart of Chicago, just steps away from Magnificent Mile. Watch out at check in. The valet will push that parking pass on you before you even have time to tell him that you are going to park in a public garage that is $32 a night vs. their $58 a night. Make sure that you tell them you are going to park somewhere else before they put your car in their garage. You have 15 minutes to check in before they move your car. Although it was a good deal it was still about $200 a night. For that $200 a night we got two queen beds to sleep on and three towels for four people, beyond that the cable is terrible and the television is very cheap. (We were not there to watch TV so that was really not a big deal) I asked for extra towels on the second day and did not get them. I asked again on the third day and got no towels at all. I then had to call the front desk to ask for towels (I requested four towels). It took about 40 minutes to get my THREE towels. There is no free Wi-Fi in the hotel which is ok if you have a smart phone with a data plan. But again location, location, location.", "title": "Great Location", "user": "Alesia L", "date": "May 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 162162320}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This hotel had a recent renovation. The hotel upgraded us to have concierge club access. That was perfect, since we are not large breakfast people. It reduced our expenses and gave us a quick breakfast. The location, a block from Michigan avenue and across the street from the boat for the architectural tour, it was perfect.", "title": "Great location", "user": "Alan S", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 162129768}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We enjoyed our 3 night stay here. Check-in was great. We had an inexpensive package and were given a King room in the East Tower on the 31st floor with a great view of the river, Navy Pier and the lake. We even saw the Saturday night fireworks from our room. The location is really good since you can walk to Millennium Park, Navy Pier, and the North area as well. There is a Corner Bakery at the corner of Michigan and East Wacker, and the loop train and orange line to Midway is also very close, Lake and Wabash, I think. The king room was not huge but quite functional. The elevators can take a long time to get up or down stopping at many floors. Just depends on your timing. Otherwise a great stay and probably a 4+ rating!", "title": "Great location, solid King room, nice views of the lake and river available", "user": "golfslw", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162128108}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I stayed here for business and loved it. Got it for $93 inc tax on Priceline, an incredible deal for this hotel. If I wasn't on priceline I would expect to pay $200 per night (maybe more) for this location/level of service. It's in the heart of downtown Chicago, walkable to many locations. The lobby is very impressive, the room was very nice. No complaints at all, from check-in to check-out. I was alone so didn't go to the bar but it looked like people were really enjoying themselves. It was full of people all the time. I want to stay here when I come back with my husband for a fun weekend in the city.", "title": "Very nice place", "helpfulness": 2, "user": "prairiemom", "date": "May 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7712529, "likes": {"liked": "— Lobby", "disliked": "— Price of valet parking ($41/day)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "just got back form a 2 night trip to Chicago, stayed at Hyatt Regency for 2 nights and it was great. Cab ride from Midway to Hyatt was only 23 dollars. Cab rides to local attractions, shedd aquarium ( and the whole museum campus), sears tower, john hancock, were all fairly priced ( under 10 ). Dining was also easy, breakfast we ate Houlihans(10 dollar brkfast buffet ! very good ! you can get there without exiting the hotel. Near by is also Giordano's ( very famous stuffed pizza in chicago area). Hyatt Room was pretty nice and the staff was very very nice. We had a free upgrade to deluxe on the 27th floor, and they gave us two free Breakfast buffet vouchers for 1 morning. Before this trip i was very skeptical because of peoples review on this forum, but non of them were true. The bathroom was all marble and clean, room service was good ( you have to call for your bed linens and towels changed because they \"conserve the world\". ) Overall it was very good and i would recommend anyone to stay there.", "title": "Pretty Good", "helpfulness": 2, "user": "BNT1120", "date": "May 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 7697635, "likes": {"liked": "— Free upgrade to Deluxe room and free breakfast voucher !"}}, {"rating": 4.0, "title": "Great Hotel, Great Location", "text": "After a long drive from Maryland we ended up arriving several hours before check in time, but were pleasantly surprised that our room was ready and waiting for us. We had a Standard Double Room with two Double Beds. We had a great view from our 32nd floor room! The room was beautifully decorated with modern decor and the kids loved the Ipod home radio/alarm clock. The bathrooms were a really nice size for a hotel room. Room service was good, but pricey (of course). My son had a $30 pizza! The staff at the hotel was very friendly. The decor of the lobby was very exciting, with water fountains and big open windows.", "helpfulness": 2, "user": "crystalswa", "date": "May 23, 2007", "id": 7683465}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "This hotel is located right along the river where you can get water taxis, or scenic boat tours. The Navy pier is a nice walk along the River walk, and Grant Park is about a block away. Don't miss the Buckingham Fountain (The one that is in the opening credits of Married with Children). We walked through Grant park around 8:30pm and saw about 20 rabbits hopping around amongst the purple flower. I highly reccommend the double decker buses/trolly, they take you where ever you would want to go in the city and have great information about the city. They also have two stops that are fairly close to the hotel. We paid about $23 for an all day hop on hop off pass. If you like to eat then this is your city, you can practically have anything you wish. We had a fun meal at Bubba Gumps Shrimp House on the Navy Pier, Yummy!", "title": "Rooms are a little rough!", "user": "EkimPennsylvania", "date": "May 18, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "business": 4.0, "cleanliness": 1.0, "rooms": 1.0, "location": 5.0}, "id": 7639956, "likes": {"liked": "— Location", "disliked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Overall, the hotel was perfect for us and Chicago \"is my kind of town\"!", "title": "May 11-14-07", "helpfulness": 2, "user": "beckyok", "date": "May 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7628558, "likes": {"liked": "— location"}}, {"rating": 5.0, "title": "Sweet Suite!", "text": "I had an absolutely exceptional experience a this hotel. As a guest in the Monarch Suite, I received friendly, courteous and prompt service. It's been three months since my stay and I still remember \"Pierre\" who handled the reception and other food/bar service in the suite. I hosted two events and entertained many guests -- the staff was wonderful. I would stay here again in a heartbeat. The attention to detail from making sure that beds were perfectly made to making sure my guests were properly served was first class. Even a mistake at checkout was promptly and courteously handled by the manager on duty. If you want to impress business associates (or anyone else) -- try the Monarch suite. The Hyatt Regency is a winner!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 23, 2004", "id": 2316355}, {"rating": 5.0, "title": "Wonderful Hotel, glad I am going back", "text": "I stayed at the Hyatt Regency for Valentine's Day weekend. Like many others on here, I was fortunate enough to get my room through priceline for around $50. My husband and I enjoy going on small weekend trips, so I have frequented many of the Chicago hotels. Needless to say, I was impressed. The room was very well decorated, very modern, whoever said it was retro, I think you were in the wrong hotel. As for parking, $35 for the city is normal. This is Chicago, and it is much safer than half of the other garages in the city, that can charge up to $50. Plus you get in and out privlages, which if you were just to park in the city somewhere, you would not have! As for the service, it was all very helpful. Our shower broke, so when I talked to the manager, I got two free breakfast buffets, they moved us to another room for showering in the morning, and they gave us a free night. The location is ideal, and there are plenty of awesome restaraunts and attractions nearby. Lastly, there is always free entertainment on the weekends, and Connies Pizza just rules!!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 22, 2004", "id": 2315340}, {"rating": 3.0, "title": "Not a relaxing environment...", "text": "The good: Location is convenient (but this is true of most hotels in downtown Chicago). Rooms have been recently renovated, and although not particualrly large, are comfortable and attractive. Some rooms have very nice views (mine did). Free high speed internet access, reasonably priced room service. Safe in room (but not large enough for a laptop).", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 11, 2004", "id": 2289674}, {"rating": 3.0, "stay_parameters": "Stayed July 2004", "text": "The Bad: The elevator situation is horrendous--expect to wait and then be packed in like sardines--to make matters worse, maids, maintenance, and room service use the guest elevators too. Expect to hear your neighbors a little, and hallway noise as well.", "title": "Busy hotel, okay overall", "helpfulness": 4, "user": "1Methos", "date": "July 6, 2004", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 2270907}, {"rating": 3.0, "title": "Decent hotel, but nothing special", "text": "Verdict: Although not an unpleasant experience overall, not recommended unless you enjoy a lot of hustle and bustle in your hotel. If it's an oasis of serenity you crave, then look elsewhere.", "helpfulness": 5, "user": "dannycarlucci", "date": "June 25, 2004", "id": 2222670}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I have stayed at many upscale hotels, but I have to say that I was completely impressed by the Hyatt Regency Chicago. The staff went out of their way to be helpful and they were more than pleasant, they were so friendly! The room was very comfortable and the massaging shower head was the icing on the cake. I had read a review that complained about the toiletries and towels not being changed daily, but maybe the writers of that did not see the sign in the bathroom that stated that in order to conserve, they will restock daily only if asked to. Our room had the best view of the river and looked straight at the John Hancock Center-Beautiful at night! Check in and check out were both a breeze and we had no problem with the valet service getting our car.", "title": "Staff and Room Were Great!", "helpfulness": 1, "user": "IndyDaytripper", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7443360, "likes": {"liked": "— Friendly staff, nice room, great view"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I've stayed at the Hyatt several times for conferences, and it's generally well run. Staff is very courteous and plentiful. The hotel offers a lot in terms of facilities for dining and lounging. The room was redecorated in a trendy color scheme sans bedspreads, and there was a nice leather chair in the room - much appreciated. Our view was great, looking out from the front of the building onto the Chicago skyline. Nights were beautiful. The location is great.", "title": "Pretty good with some service glitches", "helpfulness": 2, "user": "LibrarianontheLoose", "date": "April 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 4.0}, "id": 7432372, "likes": {"liked": "— Staff friendly and helpful; good facility", "disliked": "— Internet pricing and connectivity issues"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I did find it off-putting to be greated at the front desk with a stern warning about the minibar. I was told it was motion sensitive and that I would be charged a $25 fine for putting my refreshments in there. I never go near minibars myself - way too pricey. The thought of setting off an alarm kept me well away. Staff routinely knocked on our door every day to inspect the minibar. Do these things make that much money that there needs to be this much fuss over them??? It just wasn't a warm and friendly welcome that one expects to get. It seems it's all about money, not about customer service.", "title": "View and a half", "helpfulness": 3, "user": "BoldlyGO", "date": "April 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7392841, "likes": {"liked": "— The great views", "disliked": "— Very expensive wireless internet and the electronic minibar"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We asked for a non-smoking room, but there were aromatic signs that prior guests had definately been smoking. There's a $250 fine for that.", "title": "Great location!", "helpfulness": 1, "user": "wendy75", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7380752, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "The guests on one side of us started loud conversation at 4 am, in tones one might hear at a ballpark. Their son had an incredibly penetrating voice. The metal door connecting our two rooms was a great conductor of noise. I endured this, thinking they had to get up early to catch a plane, but after two hours, I figured they weren't going any where, not even to bed. I got up, stuck my head out to check the room number and called the Front Desk. About 25 minutes later Security knocked on their door. The noise was so loud, they couldn't even hear the man knocking. But we finally got that matter resolved.", "title": "Great Hotel !! Great Price !!", "user": "rossvin324", "date": "April 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7380138, "likes": {"liked": "— The cleanliness", "disliked": "— City Parking"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Generally I don't like large hotels and this one confirms my belief.... it's like Vegas without gambling this is a huge place and being on the 22nd floor of the west tower means that it a good 5 minutes from door to bed..... That said there are some good things and some bad things", "title": "Large Hotel Average", "helpfulness": 1, "user": "bizTaveller", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 177507603}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Nice location and I had a nice view of the river from my room", "title": "Great location", "helpfulness": 1, "user": "RNay", "date": "September 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 177390216}, {"rating": 5.0, "title": "Awesome hotel", "text": "staff was friendly (Generally) at least checkin, cleaning and the store - not so much at the restaurant", "helpfulness": 1, "user": "KCULP35", "date": "September 15, 2013", "id": 177312436}, {"rating": 3.0, "stay_parameters": "Stayed September 2013", "text": "Room was ok but getting old - tv was old I was in the hyatt place which had way more connections/tv etc. for $89 not $180+", "title": "Not the best", "helpfulness": 1, "user": "Samzaki", "date": "September 15, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 177302226}, {"rating": 4.0, "stay_parameters": "Stayed September 2013", "text": "Bed was quite good", "title": "Three Complaints", "helpfulness": 1, "user": "mljhawk", "date": "September 15, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 177249160}, {"rating": 2.0, "title": "Not Recommended", "text": "I bid $69 for this hotel on priceline - the total price was $86. Stayed the day after Thanksgiving - the place was CROWDED. Our biggest complaint is that we waited twenty minutes for an elevator at checkout, and we were only able to get a down elevator because we hopped on the up elevator (the down elevators were all completely packed). A couple we stood with while waiting for the elevator said they had no hot water (we didn't have any problems). Good location, facility is apparently remodeled, but the rooms were not very clean. All in all, would pay more to stay somewhere else.", "helpfulness": 6, "user": "TripadvisorUser", "date": "November 29, 2004", "id": 2853041}, {"rating": 3.0, "title": "The pros and cons of booking here with Priceline", "text": "Pros:", "helpfulness": 8, "user": "mellymai", "date": "November 15, 2004", "id": 2825312}, {"rating": 5.0, "title": "Great Place to stay in Downtown Chicago", "text": "*Free high speed internet", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 2, 2004", "id": 2615343}, {"rating": 4.0, "title": "Labor Day 2004", "text": "*Clean, large rooms", "helpfulness": 8, "user": "A TripAdvisor user", "date": "September 14, 2004", "id": 2571116}, {"rating": 3.0, "title": "Loved Location - Hated Hall Noise", "text": "*Friendly staff", "helpfulness": 13, "user": "Scuba_Doc", "date": "August 31, 2004", "id": 2504629}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We spent 3 nights over Memorial Day weekend, and while the hotel was sold out, we had no complaints with service or crowds. Our room didn't get made up until after 5 PM on Saturday, and then only after we returned from our day out and asked the front desk to have it taken care of, but it wasn't a problem. I was impressed with the friendliness and professionalism of all staff we came in contact with. I would have liked free computer usage in the business center, but at least it was easy (and free) to print our boarding passes. The lighting in the bathroom was excellent, which is something that I'm usually very critical of. My biggest complaint was the prices in the bar and restaurants. But since we had gotten an excellent room rate, I guess high prices elsewhere in the hotel are to be expected.", "title": "Great hotel in the middle of downtown", "user": "LindaShall", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 162121925}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel is in a great location! Very clean, nice people working there. I would stay here again! We arrived at the hotel very early and they got us checked in! We didn't have to leave our bags and come back to check in! And kindly enough, we found ourselves on the club level floors and received access to the club lounge!", "title": "Awesome!", "user": "erin j", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162114799}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We stayed four nights over Memorial Day weekend and had a very pleasant experience at this large hotel. Check in was easy and fast, the room was quiet, nice and clean, and the hotel is very close to many downtown attractions such as Millennium Park, Michigan Avenue, and the Art Institute. We walked from the hotel to Navy Pier one evening and it wasn't too far. The hotel has a large bar (Big Bar), a coffee shop that serves Starbucks products, several restaurants on premise and more. Everyone was very helpful and we enjoyed our stay. Recommended.", "title": "Nice, large hotel", "user": "Dena M", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162043031}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We stayed here several nights while exploring Chicago: the hotel building is not especially attractive, but it is difficult to beat the location right on the river. This means easy walking to shopping on Michigan Avenue and and to the attractions on Navy Peer. The lobby of the hotel is very large and hosts an excellent breakfast buffet. The rooms are functional but nothing special. If possible, get a room facing east with a view onto the lake.", "title": "Good location on the Chicago River", "helpfulness": 1, "user": "GlobetrottingSwede", "date": "May 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161907712}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "I stayed in the HR Chicago hotel on a business trip. Clean, functional, good staff.", "title": "Good functional hotel for business in a central downtown Chicago location.", "user": "Derek_L_11", "date": "May 26, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 161902218}, {"rating": 4.0, "title": "Nice hotel", "text": "Nice a and clean hotel. No real issues except at check in. I collect reward point via Hyatt and had requested an upgrade. They could not accommodate the suite upgrade and that was fine but the front desk person was very rude about it and in fact put us in the worst room he could find( still nice) but compared to the other rooms booked by our group. We still had a great time in Chicago. This hotel is in a great location, just a few minute walk to the magnificent mile, navy pier and a short cab ride to soldier field. We were lucky when we booked and caught a sale so made this hotel even nicer for half off!", "helpfulness": 1, "user": "northener007", "date": "September 21, 2013", "id": 178036005}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Hyatt regency chicago is a great location, fab walking distance to great shopping and resturants.", "title": "Love Chicago:", "helpfulness": 1, "user": "anna s", "date": "September 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 177842118}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "the upgrade on the hotel is fantasic, this place is looking great, we got a standard 2 double bed room and it was a great size room and pretty big bathroom compaired to most standard rooms out there! good price vaule too! i was very happy.", "title": "Great Hotel! Great Location!", "helpfulness": 1, "user": "Ashley333", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177791594}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "loved loved loved stentson steak and sushi downstairs! i was there evey night, if i wasnt eating i was drinking at the bar, deb and quan are the most fantasic bar tenders ive come across! met some lovely people! will deffs come back!! hidden sercert of chicago i think ;)!!", "title": "Great Hotel. Great Location", "user": "JustinK2009", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177725250}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "I found this hotel through Priceline, and oh did I get lucky!", "title": "Amazing View, Best Location!!!", "helpfulness": 1, "user": "Acralism", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177693229}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "WOW. That was my first and last impression of the Hyatt Regency Chicago. This hotel exceeded every expectation I have for hotels. From the moment I walked in (greeted by multiple staff) I knew in for a great stay.", "title": "A big hotel that feels like a boutique", "user": "sbenjamen", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 178354771}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "The room was divine! Contemporary, muted colors, very wide-screen TV. The bathroom was sparkling. Love the quartz countertops. The beds were delish and comfy. And the thermostat for temperature was easy to use.", "title": "Beyond expectations", "user": "Amy E", "date": "September 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178334657}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "The lobby was an atrium of two floors. And somehow not noisy! The first floor had lots of places to sit comfortably while waiting for friends. The light show was very cool. And, there was a market to easily grab coffee, sandwiches and snacks. The second floor lobby has a great bar. Reminded me Vegas w/out the gambling.", "title": "Great location -- wonderful staff!", "user": "Toothsc", "date": "September 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 5.0}, "id": 178312520}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Staff is always around and on their best! I appreciated the desk receptionist standing in front of his podium saying \"right this way and I'll help you\".", "title": "What you expect from a Hyatt!", "user": "Yerffej14", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 178120779}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "The location is ideal. Right across the street from the boat that does the architectural tour. Also across the street is the bridge to the Wrigley building and that Magnificent Mile of shopping. To the left and a few blocks down is the Millennium Park, Art Instituted and The Auditorium.", "title": "Good location, nice hotel", "helpfulness": 1, "user": "Karen E", "date": "September 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 178058592}, {"rating": 2.0, "title": "Too many negatives", "text": "We stayed here for five nights in May & chose it for it's great location plus we are Gold Passport members having stayed in Hyatts in Perth & Adelaide. We booked a Regency lake view room which was comfortable enough & had a great view.", "helpfulness": 1, "user": "Scallywag", "date": "June 4, 2007", "id": 7754810}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "However, the heating system was something else. The instruction on the controls read to the effect \"this heating sytem is silent & works", "title": "Wish I could've stayed longer", "user": "Laney02", "date": "June 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 3.0, "cleanliness": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7751799}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "on a radiant system, you will not hear a fan\". Whoever wrote that was", "title": "Good hotel in great location!", "helpfulness": 2, "user": "Milt07", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7750853, "likes": {"liked": "— location", "disliked": "— Limited drawer space"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "stone deaf. As soon as it was switched on the roar was like being in an aircraft. It would have been impossible to sleep with it on and apart from anything else it didn't work. Any schoolboy knows that hot", "title": "Good location, excellent service", "helpfulness": 2, "user": "UDSL05", "date": "June 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7750494}, {"rating": 1.0, "stay_parameters": "Stayed May 2007", "text": "air rises, so why would you put the heating system at ceiling level. No wonder it took 6 hours to go up a degree. The maintenance man sent", "title": "Don't waste your money on this hotel!", "helpfulness": 1, "user": "lucida509", "date": "May 29, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0}, "id": 7714780}, {"rating": 3.0, "title": "I've been in worse hotels......", "text": "I just got home from a 2 night stay at the Hyatt Regency and I'm glad to be home. I have stayed in worse hotels then this place, but I've also stayed in much, much better, for less money. If you are going to Chicago, try to find another place, but if you have to stay here, make the best of it! The Stetson's Chophouse has good steaks, but I've been to better(Old Homestead, Morton's) but the piano player and accompaning singer was a nice touch. The bartenders are nice and quick. The front desk clerk was a little confused (first day, maybe?) and the maid service was adequate but nothing special. This place was probably really great 20 years ago, now it's just old and tired.", "helpfulness": 4, "user": "kimkru", "date": "June 18, 2004", "id": 2204743}, {"rating": 4.0, "title": "Hyatt Regency a great location", "text": "My sister and I stayed at the Hyatt June 5 and 6th, having gotten a room on Hotwire. The location is wonderful - a short walk to the Magnificent Mile and Rush Street, and not a much longer walk down to the Art Institute and Grant Park. We were able to check in well before the posted check in time and our room was comfortable and nicely decorated. We found the staff extremely helpful and friendly.", "helpfulness": 12, "user": "tea50", "date": "June 8, 2004", "id": 2171600}, {"rating": 5.0, "title": "Great Hotel!", "text": "My wife and I just stayed at the Hyatt last night and were very impressed! The hotel was beautiful, the rooms were great and the location was perfect. We highly recommend staying here!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 6, 2004", "id": 2158111}, {"rating": 4.0, "title": "WAY too big but good job overall", "text": "The HR Chicago is huge! 2000+ rooms! Luckily, it's divided into two towers so it's not as massive as, say, a large Vegas hotel. Staff is nice and friendly but sometimes gets overwhelmed by the sheer numbers of guests. The renovated rooms are beautiful, however, and are definitely worth the $140 corporate rate. If you can get it on Priceline, even better!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "June 6, 2004", "id": 2158049}, {"rating": 4.0, "title": "Close to perfect", "text": "I got our room off priceline for $75/night. I must admit, I had relatively high expectations since it was considered \"4 star\" and normally had very high room rates. I was only slightly disappointed. There was no wait to check in, our room was very nice (although I wish there had been a lighted vanity - the light in the bathroom was very dim for putting on makeup!), and they had met our requests of a high floor w/ a view and king bed. The only problem we had... we woke up on the 2nd morning of our 4 day stay to find no water!! Not just no HOT water, but no water at all. No flushing, no brushing our teeth! However, the front desk quickly offered keys to a room near ours for us to shower, etc. in, so the problem was easily solved. We did some running around that day and by the time we returned to the room at 5 PM our water had been restored.", "helpfulness": 11, "user": "kristin1122", "date": "May 19, 2004", "id": 2078460}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I stayed at the Hyatt Regency as a conference attendee. The hotel is very large, but I really enjoyed my stay. Check-in was smooth, no king beds were left, but since I was traveling alone I didn't mind two doubles. The room was clean and each room had an air purifier in it. All of the rooms are non-smoking, which works for me. Lots of restaurant choices on-site, and a lot of places to sit and relax. Location is great as well. Cost is up there...but comparable to everything else in Chicago. My big complaint (and I heard this from others) is massive problems with Internet connectivity. I never was able to connect, but others said I just didn't wait long enough (30 minutes) for the connection to take hold.", "title": "Very nice -- recommended", "helpfulness": 1, "user": "mrs_nuts", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7614581, "likes": {"liked": "— Location, service,", "disliked": "— Internet connectivity"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Stayed here for business recently and it was a disaster. There was a problem with the booking of our room - two of my colleagues decided not to come on the trip and two different people came in their stead. Despite the fact that we had the credit card the room was booked on in hand, the hotel would not let us check into the room because the names of the guests who showed up did not match the names on the reservation (again, on the same credit card). We went through two levels of management, and the response was \"Sorry, there is nothing we can do to help.\" Then, our office manager called from afar, was told the same thing about the rooms, and then put on a show by faking crying and making up a story that she would be fired if the situation was not rectified. Then, and only then, did management suprisingly decide to allow us to occupy the room. All of this wasted 2+ hours of time and caused great stress. I was simply shocked at how many times management said \"There is nothing we can do\" instead of trying to help us out. The other \"great\" thing was that they fully admitted we would be charged for the room because we had reserved it, but could not occupy it or cancel the reservation because the actual guests listed were not present.", "title": "Not good service", "helpfulness": 2, "user": "andrewdd", "date": "May 12, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7591144}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "We stayed at the Chicago Hyatt Regency on E. Wacker for 4 nights, Fri. May 4 - Tues. May 8. We booked the room through Hotwire. We paid a little more then most posters here ($139/nt) but I believe it was due to some big conventions going on at the time. Good thing I read about the convention factor here on TA and booked early. Overall, our stay was a very good one. From O’Hare airport we took the “L” Blue Line to the Washington stop and then caught a cab to the Hyatt Regency. We arrived around 3 pm. Having received our Hyatt Gold Passport (free) a few weeks earlier we were able to by- pass the longer check-in line and check-in quite quickly. We were given a room in the East Tower on the 25th floor (room 2562). The even numbered rooms face north which I believe is a better view. I think that the West tower might actually have some of the better views. We did have an excellent view looking north of the river, The Hancock Building and rest of the uptown skyline was very impressive. The room itself was very comfortable. We did heed the warnings from our fellow TA’s about the costly incidentals. We didn’t have a car to park, didn’t even touch the mini-bar, and didn’t eat the breakfast buffet. We did have a drink in the Big Bar on Fri which was pretty crowded. We did however get dinged for $12 for a 5 min call back to PA. The Hyatt Regency’s location is pretty convenient to everything we wanted to see and do. Overall, I would recommend this hotel however as many have pointed out you just need to watch the incidentals unless you’re on an expense account as most of the other guests appeared to be.", "title": "Pleasant overall stay", "helpfulness": 1, "user": "jeff101d", "date": "May 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7589711, "likes": {"liked": "— The View", "disliked": "— Pricey extras"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Stayed recently for a conference and paid $239 for a nite through the conference organizers. The hotel only merits a lukewarm average from me. Like the other reviewers, I found the internet access charge to be exorbitant, especially since the access was cranky. Like someone said, nowadays, its the cheaper properties (like the Comfort Suites in Gurnee that I stayed in for one nite) that provide free internet access - ironic. That the minibar was on motion sensor was also quite ridiculous.", "title": "No great shakes", "user": "Zin2", "date": "May 7, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 7553688}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "I stayed at the Hyatt Regency Chicago back in Sept of ’06. I was attending a conference there and I thought that hotel was very well accommodating to the massive amount of people. The rooms are typical Hyatt, clean and new, the bathroom was kinda of small, I have stayed at many lower end hotels that had bigger bathrooms, nevertheless, it was all marble and very clean.", "title": "really nice", "helpfulness": 1, "user": "trainaholic", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7483874}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The beds were comfortable. The hotel is nice and updated. Two blocks from Michigan Ave. Parking is pricey and self parking at hotel is not an option. Rooms were quiet. Did not hear the neighbors. Bus located right across street to major destinations. I would stay here again.", "title": "Nice and Convenient Location", "user": "Bobkatevan", "date": "May 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162340030}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This is a really well run hotel with a professional friendly staff, from the parking attendants to the bellmen. The only downside was the beds were a little on the soft side, but the positives far outweighed the negative.", "title": "Great hotel", "user": "jimleylandfan", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 162231964}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We stayed three nights over Memorial Day weekend and had a great stay. The rooms are very clean, comfortable and nicely decorated. Great views. The common areas are very nice - trendy. It's a very big hotel. Every staff member was very warm and friendly, but not necessarily very experienced. I called housekeeping for an extra pillow and they sent an extra towel - that sort of thing, nothing major. The brunch is outstanding. The concierge was very helpful and the location is fabulous - can walk to a lot of places and also convenient to the subway.", "title": "Family trip to Chicago", "user": "BBPAUSA", "date": "May 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162230931}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The room itself was very clean and comfortable. The bed was extremely comfortable with nice linens. The staff were all very helpful and competent. Only a few negatives. No free breakfast, no Jacuzzi, and location was not the best for shopping. Also the complexity of the two buildings and elevators that didn't always stop at our floor. (you had to take the proper elevator ).", "title": "Nice room", "user": "Lolenzek", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 162199733}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Just got back yesterday after a Memorial Day Stay....the hotel is very nice with a very good location.....its at the center of everything.....Miracle mile...not too far...navy pier not too far....", "title": "Very Nice Hotel", "user": "eposadas", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 162198168}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Upon entering the hotel I was greeted with bars, restaurants, gift shops and multiple levels of common areas. The whole environment was one constant stream of people eagery getting a start to their day or moving to the next page of their daily activity. While ripe with activity, the guest room was tranquil. Provided with a great view of the city, the rest and relaxation inside the hotel were very welcome. With instant access to the ped-ways, I hardly had to go outside unless I actually desired.", "title": "Buzzing With Activity Yet Filled with Peace", "helpfulness": 2, "user": "Alan_Mosin_Fan", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177665813}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Dwayne and Tina are the best!!!!! Helpful, friendly, courteous and just plain NICE!!!!! Also, Laronda - the staff at this hotel are the nicest we have ever had the pleasure of dealing with. The hotel itself is outstanding and as guests, you cannot ask for better service. Rooms are lovely with great beds and linens...spotless and a relaxing place to return to after a hectic day seeing the sights. Wouldn't think of staying anywhere else in Chicago now that we have stayed here.", "title": "Awesome!", "helpfulness": 1, "user": "C0nnieB12", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177587643}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "This is a huge hotel with a great central location for downtown. My king size room had an updated design and a great view of the river and Lake Michigan. My entire family stayed here for a wedding and everyone seemed to enjoy their rooms. We also frequented the newly remodeled hotel bar, which is rather large and packed at night.", "title": "Huge hotel with updated rooms and hotel bar.", "user": "honora44", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177578814}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Pros:", "title": "great location, busy hotel but not very clean", "user": "MMJJ13", "date": "September 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 177577727}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "- Nice quality and size of rooms for downtown Chicago", "title": "No free internet", "user": "Patricia M", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177567233}, {"rating": 2.0, "title": "Do not pay more than $65 for this hotel!!!", "text": "I booked through priceline and got the room for $65 a night. I guess the hotel is ok for business people or families on vacation but i can't imagine paying full price for a place like this. The hotel is so large and busy with convention-goers that the service suffers. it gets pretty loud as a result of hallway noise and you can hear the pipes going everytime someone flushed their toliet. rather disgusting. i think i had cleaner rooms and better service from motels. DO NOT PAY MORE THAN $65 FOR THIS HOTEL!!!!!", "helpfulness": 4, "user": "Oni242", "date": "August 31, 2004", "id": 2504073}, {"rating": 2.0, "title": "ok place, but there are much, much better...", "text": "we stayed here during a huge conference and found it frustrating to be in such a huge place - impersonal, small rooms, just-ok service. i would find someplace with a higher rating close to wherever you need to be.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2491891}, {"rating": 4.0, "title": "Chicago Getaway for New Family", "text": "We were very pleased with the service that we received while staying at the Hyatt Regency Chicago.", "helpfulness": 13, "user": "seekingsun4", "date": "August 9, 2004", "id": 2432513}, {"rating": 5.0, "title": "Well Worth Every Penny.", "text": "The hotel is in \"ok\" shape and generally clean for the shape that it is in. The hotel location is awesome! It is close to everything!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 3, 2004", "id": 2380005}, {"rating": 5.0, "title": "Hyatt was great", "text": "We didn't experience any delays with checking in and the front desk staff was very helpful. We purchased our room off of Priceline for $75 and we inquired about an upgrade to a suite when we checked in. The upgrade would have been an additional $150 so we opted not to do the upgrade. We had requested a refrigerator for our room and they waived the $25 fee for that since we had an infant with us.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "August 3, 2004", "id": 2378415}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4, "variance": {"poor": 207, "average": 515, "very good": 1289, "terrible": 122, "excellent": 1020}, "aka": "Hyatt Regency Chicago Hotel", "slim_ranking": 0.439759036145, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Discover the difference between a hotel and a Hyatt when you stay at our incomparable downtown Chicago, Illinois hotel. Set within the epicenter of the city, our AAA Four Diamond Hyatt Regency Chicago is conveniently connected to the Illinois Center and within minutes of the Magnificent Mile.We are excited to announce the completion of our $168 Million renovation! We are eager to show you our new welcoming lobby, engaging check-in pods and new restaurant concepts and menus. Come see the completely transformed Hyatt Regency Chicago!"}