{"user_rating": 4.0, "review_count": 436, "name": "Hyde Park Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Central, very well equipped affordable deluxe studio with kitchen. Staff, facilities, welcome all exemplary. Continental breakfast provided in the room. All superb in a city centre hotel.", "title": "City Centre Luxury", "user": "marabooka", "date": "January 19, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 12780715, "likes": {"liked": "— Size of rooms, kitchen facilities", "disliked": "— N/A"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My two teenage children and I shifted to the Hyde Park Inn after spending a week in unsatisfactory accommodation elsewhere. From the moment we entered the lobby the experience was a complete contrast to our previous one.", "title": "Wonderful experience", "helpfulness": 4, "user": "PerthMishelle", "date": "January 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12774416, "likes": {"liked": "— quality room, perfect location, lovely staff"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The staff were friendly, helpful and keen to oblige. They insisted on helping us carry our bags to the room, and popped in a few minutes after we checked in to ensure everything was okay. The room, with kitchenette, was very well appointed, tastefully decorated, comfortable, very clean and beds were quality. The bathroom was lovely, and exceptionally clean with all the necessities provvided. We had an upper level room with balcony, and loved being able to pop out to absorb the city atmosphere. After the first day the city noise became quite soothing, almost 'background' noise.", "title": "Fabulous place to stay", "helpfulness": 4, "user": "mumbro1965", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12595645, "likes": {"liked": "— Tasteful decor, comfy beds, great view from balcony and close proximity to all things fun in Sydney!", "disliked": "— Nothing really!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "Having a continental breakfast provided was a bonus, with cereal, toast, fruit and juice, a more than adequate start to each day. As we stayed a week we cooked some basic meals in the room and found the utensils provided to be adequate. There is a Coles and number of seven elevens just moments away to provide any supermarket needs.", "title": "Great Service, Great Location", "helpfulness": 2, "user": "Tanray", "date": "January 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12556894, "likes": {"liked": "— location, cleanliness", "disliked": "— street noise"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "The flatscreen tv and free movie channel was a bonus for the end of day when needing to unwind.", "title": "Excellent hotel", "helpfulness": 1, "user": "sportygalaus", "date": "December 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11234942, "likes": {"liked": "— Convenience, price and excellent room facilities at no extra cost", "disliked": "— Noise from street"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My wife and I have stayed at the Hyde Park Inn regularly over the last five years. It is an excellent 3/4 star hotel, the rooms are spacious and well kept, and the staff have almost always been friendly and helpful. Take a room above the 5th floor if you can as there are small balconies with beautiful views over Hyde Park. The lower floors have no balcony. There is on site parking which will save you money if you have a car, but it is limited so be sure to tell the staff when booking that you need a parking space. The prices have been quite reasonable over the time and the only reason we didn't stay there last time we were in Sydney is because it was fully booked. It also has a conference room if you are planning a business trip.", "title": "Home away from home", "helpfulness": 2, "user": "Grandad_Gaz", "date": "April 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7279632, "likes": {"liked": "— Convenient to city centre", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "We stayed at this hotel for a week from 13th Feb. We had a top floor apartment with balcony with a great view over Hyde Park and Woolomoloo Bay. The apartment had everything we needed and was very clean. Breakfast was delivered every afternoon and put in the fridge, cereal, fruit, juice, bread for toast etc and was more than enough. The bed linen was changed daily. I would certainly stay here again.", "title": "Great Views", "helpfulness": 4, "user": "ABC123England", "date": "March 13, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7154751, "likes": {"liked": "— The spaciousness of the apartment"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed at this hotel for 3 nights when we first arrived in Australia and found it to be great value. Yes the decor is a tad dated but the room was spotlessly clean and we had everything we needed including a cute continental breakfast in our fridge every morning.", "title": "Great value", "helpfulness": 4, "user": "Yorkshireman25", "date": "January 26, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 6699065}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Positives:", "title": "Pleasent Stay", "helpfulness": 3, "user": "eonnee", "date": "November 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 10996509, "likes": {"liked": "— The Location.", "disliked": "— Internet Access, very expensive and no wireless."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The rooms are very large and clean. They come with kitchenettes which include a stove, microwave and a fridge. In the fridge there are complimentary juices, package fruits and bread for breakfast. There are also forks, spoons, plates, frying pans and a water steamer for tea. The view is very nice. The bathroom is also clean and comes with all the proper things. You are also alloted a parking space if you have a car (I do not recommend driving in Sydney). The beds are very comfortable. The hotel is very \"homey\". It is a comfortable place to stay in. The desk clerks do not really bother you but say hello and smile when you walk in. Also included is a flat screen T.V.. There are a lot of channels, but what I liked the most is the \"Box Office\" channel that offered new movies that are on DVD for free. I was sick for a day and a half during this trip, so the movies really made me feel at home. The hotel is very centrally located to the subway (on same block or across the street) that connects you to all the main attractions. On the same block there is also a a bus stop that connects you with all the main buses that can take you all over the city. There is a also a Seven-Eleven store two doors towards Liverpool street where you can buy inexpensive dinners (noodles, beef pies) and bus/subway tickets (I suggest buying the \"Red Ticket\", you can use this ticket for a week on all the subways and buses that are in the Sydney Area but won't work on the Ferries). It is also two blocks from the Monorail, two blocks from the Spanish Corrider, a block from China Town and across from Hyde Park. Also included is air condition.", "title": "Take your ear plugs", "user": "tongi", "date": "October 29, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 10435597, "likes": {"liked": "— renovated decent-sized room", "disliked": "— noise"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Negatives:", "title": "Nice little hotel in central sydney", "user": "Rach&Ben", "date": "October 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10281599, "likes": {"liked": "— Parking and Light Continential breakfast included", "disliked": "— noise"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "The hotel is on a major street (Elizabeth Street) which can get quite noisy during the day. If you close your door to the balcony, your room becomes very quiet.", "title": "Great Hotel!", "user": "WinnieP", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7841931, "likes": {"liked": "— Location and service", "disliked": "— Nil"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The hotel offers Internet Via Ethernet wire (no wireless) for 22 Aus dollars a day. I bought it for two days because I was sick but around the corner on Liverpool Street there is a internet shop that offers internet for 1 hour for 3 Aus. Dollars.", "title": "would stay there again", "helpfulness": 1, "user": "sleepyh", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7367677}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 16, "average": 27, "very good": 201, "terrible": 11, "excellent": 181}, "aka": "Hyde Park Hotel", "slim_ranking": 0.108108108108, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.5, "location": 5.0}, "description": "4 Star Hotel in Sydney Australia offering quality family accommodation with views of Hyde Park and Sydney Harbour. The Hyde Park Inn is a 93 room property in the heart of Sydney’s Central Business District across from beautiful Hyde Park. For comfort, cost, facilities, location, transport and spectacular views of the city, the Hyde Park Inn is the place to stay in Sydney.Our Rooms include all new furniture, fittings and appliances including LCD TV's, DVD's & Microwaves in all rooms as well as cook tops fitted in all Deluxe Studio & Family Rooms and Apartments.The rooms also feature all new interior design including carpet, bedding furniture and curtains to create a contemporary yet comfortable feel.Conference & Meeting CentreIntroducing the Hyde Park Forum Conference and Meeting Centre. An all new state of the art Conference and Meeting Centre in Sydney's CBD. Featuring built in AV & IT equipment including data projection, teleconferencing and videoconferencing units. Two meeting rooms and an Executive Boardroom with exhibition/trade show space available. All rooms face Hyde Park and feature abundant natural light.Hyde Park Forum, Small Meeting SolutionsLevel One, 271 Elizabeth Street Sydney"}