{"user_rating": 2.5, "review_count": 182, "name": "Hyde Park Suites Serviced Apartments", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "The location is great because it is close to two subways; Queensway and Bayswater.", "title": "Great location but poor conditions and service", "user": "ada_24", "date": "April 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 27778516}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Great shopping and social activities. However, the apartment itself was small and far from the office which is at 11 Inverness Terrace. The elevator was not working when we arrived and there were alot of steps for exercise. The hot water was intermittently hot some days. Some of my friends had a theft in their apartment of their shopping and that left a damper on our vacation. Needs much improvement in area of customer service.", "title": "Good Experience in Hyde Park Suites", "helpfulness": 1, "user": "happycoupletaiwan", "date": "April 1, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 27230794}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "I have read all the reviews in here before I went in Hyde Park Suites. So quite worried that the bad experience of others would come to us. However, thank God, our experience in there was much better than we expected.", "title": "Not what was expected....", "helpfulness": 2, "user": "clur78", "date": "March 10, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 25918787}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The staff there are quite helpful. We asked them about the service and speed of Wi Fi and the staff let us one day \"free access\" to try the service. They also helped us to keep our luggage without any charges after we checked out.", "title": "Only positive is location", "helpfulness": 3, "user": "L2TVL", "date": "March 1, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 25390693}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The room is neat and tidy. We have lived there for 8 nights and the staff have came there once to clean up the room. The kitchen is well-equipped and good for cooking simple food. There is only one thing not good which is the wall is quite thin and we can hear people talking outside the room.", "title": "Great Location....Not So Great Service", "helpfulness": 2, "user": "sofygraves", "date": "January 13, 2009", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 23535162, "likes": {"liked": "— Location", "disliked": "— no lift, no service from staff"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "The room was very, very small and extremely worn and they told me at check in that was an upgrade. I would have hated to see what I was upgraded from. My view was the rooftops of a smelly alleyway. `the electrical sockets did NOT work and they told me they did when I complained. When I asked to be moved to another flat they told me that I was not giving good enough reasons and would not help me. I left on the same day I checked in, I never slept one night in this flat and they would not give me any kind of refund. I was supposed to stay for 9 nights, needless to say I am out of a lot of money.", "title": "RUN FOR YOU LIFE!!!", "helpfulness": 1, "user": "adoptforlove", "date": "May 29, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 31099986}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The three of us in our family booked a \"deluxe triple\" from lastminute.com under \"Lancaster Gate Suites\", thinking it wasn't hyde park suites and it was 4*. Turns out both were not true! It is actually guised under a different name, but stlil Hyde Park Suites. Firstly, they gave us a room in the basement floor in Talbot Square, which we couldn't open the windows and the bathroom was appalling. We had to walk back to the reception (which was a distance away in Inverness Terrace, very annoying as they dont pick up calls and are EXTREMELY UNHELPFUL) for several things: 1) change of room, 2) spoiled washing machine, 3) ask for new towels since machine couldn't wash, 4) satellite tv was crap. Absolutely terrible. In addition, the \"triple\" bed configuration was actually a lousy sofa bed, not even a proper extra bed! They also did not clean the room during our entire 5 days there - dirty! The reception was not helpful and never kept its word, we also had to trunk call them because there was no house phone. Avoid, avoid, avoid! Stay at someplace better.", "title": "AVOID THIS PLACE AT ALL COSTS", "user": "startree", "date": "May 26, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 30798170}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "I stayed at Hyde Park Suites from 1 to 3 May 2009 with my family.", "title": "Avoid it! Not safe", "helpfulness": 2, "user": "sil74Brux", "date": "May 15, 2009", "detail_rating": {"front_desk": 1.0, "value": 1.0, "service": 1.0, "business": 1.0}, "id": 30052519, "likes": {"liked": "— unsafe and rude staff"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Someone got into our appartment with a regual key, when through our personal stuff - things where misplalced- and stole one of my dresses - my best one obviously.", "title": "Enjoyed the vacation at hyde park suites", "user": "ImperialchoiceLondon", "date": "May 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29546277}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled on business", "text": "People at the reception refused to do anything about it, they did not do any investigation, they ignored me. I wanted to speak to the manager but I got no answer.", "title": "Misrepresentations, inadequate features, noisy", "user": "uprightafloat", "date": "May 4, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 29340461}, {"rating": 2.0, "stay_parameters": "Stayed August 2008", "text": "Well...(just an advice - take always into account ALL reviews before deciding, whatever location...).", "title": "House of Mouse?", "helpfulness": 3, "user": "freeport76", "date": "December 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 22938126, "likes": {"liked": "— Location, Wireless, Kitchen", "disliked": "— Mouse traps"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "There a lot of cons and a few pros with this type of apartments. The good things: location, location and last but not least, location! London is fantastic, and this area is too. You got a lot of shops, metro stops, playgrounds for kids and that incredible place where you can go for a walk or to just relax in case you're tired called Hyde Park. The cons: I had a \"feeling\" the place is infested by mice. You could tell - all those mouse traps under the kitchen, bathroom and even in the stairs. I don't really know if this is \"normal\" for London - maybe, being all houses made of wood?", "title": "Location is all you will get.", "helpfulness": 1, "user": "Sister05", "date": "November 24, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 22125406, "likes": {"liked": "— Location", "disliked": "— Staff were appalling"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The rooms are ok, Ikea style. All comforts, I have to admit.", "title": "I'd recommend it if", "helpfulness": 2, "user": "gloopus", "date": "November 5, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 21555788, "likes": {"liked": "— location, spaciousness and decor", "disliked": "— the dampness. i would imagine difficult to remedy considering the location"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Besides this, however, the staff is not professional - just one question: I wonder how this place will be in 5 years!", "title": "Not the best", "helpfulness": 1, "user": "garda44", "date": "October 29, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 21376014, "likes": {"liked": "— the location to tube", "disliked": "— the stairs"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "While the location is so convenient and the actual room was quite clean and fine, the service from Hyde Park Suites was baffling at best, and at times I wondered if I was actually staying at Faulty Towers.", "title": "BEWARE!", "helpfulness": 3, "user": "Memem02", "date": "October 27, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0}, "id": 21259919, "likes": {"liked": "— Theft of money!"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "When my wife and I arrived at the office for Hyde Park Suites, we were given a key for a room. We walked a block to the room and discovered it was underground, beneath the sidewalk. The room was dark and smelled moldy and musty. We refused to stay in the room. We returned to the office and asked for a room above the ground level. We received a key to a room on the 2nd floor of the building we previously went to.", "title": "Below expectations", "user": "jandc8491", "date": "May 2, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0}, "id": 29192378}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "As soon as we entered the room, we could smell something like bleach or disinfectant or something else coming from the shower in the bathroom. We were tired and jet lagged, and decided not to try our luck on another room. If we kept the bathroom door closed, there was little odor in the bed area, next to the bathroom. There was fortunately a fan in the room which we could use with the open windows to ventilate the area with fresh air.", "title": "What a Shocker!", "helpfulness": 1, "user": "bretthartmann", "date": "April 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 28982690}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The room was certainly not 4-star quality, as claimed by the booking agent. There was the small bathroom, a small living area with a bed and a flat screen TV, and a kitchen. The bathroom did not contain shampoo or conditioner.", "title": "would not stay here again", "user": "aussietraveller1000", "date": "April 21, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 28461411}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The hotel was close to 2 tube stations, Bayswater and Queensway. There were grocery stores in the area.", "title": "Bad apartment experience in London", "helpfulness": 1, "user": "lisbonjp", "date": "April 20, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 28423034}, {"rating": 1.0, "stay_parameters": "Stayed April 2009", "text": "Its taken me a year to write about this place- it is astounding it is still functioning, though I am sure that people keep getting sucked in by their website. I did. Dont be fooled. We paid a deposit and booked for a week approximately 4 months in advance. Luckily I had the receipt when we arrived. Our first drama was believing the map they have on the site which showed the apartments being three blocks from Paddington Station- 45 minutes after dragging our bags we arrived 10 minutes before they closed up the reception area. We paid the balance of the stay, and after some difficulty locating the key which had gone missing to our room, we made it a further two blocks to the apartment with the cleaners key. I went up to the room while my partner waited for me to open up. As I opened the door there seemed to be some movement in the dark room- and as the door opened wider I saw a poor bloke sitting up in bed! I apoligised and locked him back in and bolted down the street to try and get someone at the office before they left. Still there- and still not knowing what was going on- so she found us a key to another room, telling me to pop in the next day to sort it out. Back at the apt. I went ahead to open up- no need- the door was wide open and the heat was on. Very comfortable in July! I tried to sort that out, but there was no knob on the old style water heater to turn off the heat. My partner went this time, and came back with a wrench. We turned it off, but found that we had to spend the night with the window open on Islington Terrace- noisy and hot. It seems the premium we paid for air conditioning didnt include air conditioning. The room was fine apart from all this- tiny bathroom, but good kitchen, tiny double bed (not much fun in the heat, fairly thin mattress on a slat base and too small for big Australians). The next morning we trotted up to the office to find that we would have to move out of the room we were in (fine) buit for some unforseen circumstance they were unable to honour our booking at the apartment building. They had lost our booking, and booked others into the room we were in. We were told to get the luggage out of the room and into storage they had at the building (turned out to be the garden shed!), but she was sending a young fellow to assist. He stood and watched while we moved the bags. We were asked to go back to the office at 2pm and they would have somthing sorted out. So- after we wasted a day on this, we arrived back to find that they had nothing for the level of quality we had paid (supposedly 4 star), but could accomodate us at another of their buildings. Turns out it was back at Paddington station, which they offered to pay for a cab to, unfortunately less stars than we had paid for, 2 stars, and we would have to sleep in a double bunk! We started to lose the plot at this stage, and told here we would discuss and return. A quick visit to an internet cafe told us that there was no accommodation in London that weekend due to tennis, the grand prix and Madonna, unless we wanted to pay 800 pounds a night. So I called a friend who came and collected us, to spend our London holiday an hour out of town. Surprisingly, the woman in the office could not process a refund for the balance of the week we had paid for that they could not accommodate us. There were all the stories under the sun about how the boss was the only one who could refund a CC and he was unavailable. This story went on for five days, irate and pleasant phone calls from us having no effect and as we left the country we still werent sure that we had been refunded. That website makes the rooms look really good, and the prices seem very reasonable for all they offer- but its a sham. DONT STAY WITH THEM! Its not worth it. What all the olther revies say is exactly what its like.", "title": "Never Again", "helpfulness": 1, "user": "Mariem_9", "date": "April 14, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 28034623}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 36, "average": 38, "very good": 31, "terrible": 61, "excellent": 16}, "aka": "Hyde Park Suites Serviced Apartments Hotel London", "slim_ranking": 0.686346863469}