{"user_rating": 4.5, "review_count": 63, "name": "I Melograni B&B", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My family and I just returned from a magical trip to Tuscany. We stayed in a warm and cosy B&B located in a villa in Empoli. Empoli is a convenient town to base your Tuscany stay. Florence is only 25 minutes away by train. The four of us (adult children) were given two huge rooms with beds we slept soundly on - the views of the neighboring vineyards were spectacular AND just outside our bedroom windows. Our hosts, Sue and Riccardo, spoke English and helped us practice our limited Italian. They, along with Sue's adorable niece Casi, served us savory breakfast sandwiches, delicious juices, and perfect coffee. We were given rides to the Empoli train station daily by Sue and valuable tourist information by Riccardo. When in town, we purchased a variety of cheeses and breads to go along with the olive oil and wine we purchased from Rolando Bettarini, one of the owners of the Piazzano Farm located a short and pleasant walk from the B&B. Rolando gave us our own personal wine tasting. During one of our nights at the B&B, we shared our food and incredible wine with several of the other guests and had quite a jovial time with our new friends from England, Germany, Denver, CO, and Italy. We sat outside on the terrace and enjoyed our community meal while watching the sunset over the hill. The B&B just completed renovations and although Sue and Riccardo were in the midst of reorganizing - they took great care of us. This place is special not only because of the comfort and style it offers but because of the people who run it. It was everything that I had hoped and planned for along with a good price. Contact I Melograni at:", "title": "Warm and Wonderful B&B", "user": "VineyardConnecticut", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7380712, "likes": {"liked": "— The Hosts/comfort/view", "disliked": "— Nothing"}}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 1, "average": 5, "very good": 4, "terrible": 1, "excellent": 52}, "slim_ranking": 0.5, "description": "Four pretty rooms set on a large terrace with breathtaking views of a classic Tuscan landscape of cypress trees, vine groves and olive groves. Each room has a private en-suite bathroom. Breakfast is not included in the price.In each room there is a small fridge, a kettle, a table cloth, plates, wine glasses, cutlery, a bottle opener,tea/coffee and map of the area indicating restaurants, shops and winery. The rooms are located in the first and oldest part of an 18thC villa set in the countryside between Florence and Pisa. An ideal location for exploring Tuscany."}