{"user_rating": 4.0, "review_count": 2442, "name": "Iberostar Paraiso del Mar", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My husband and I just returned from our second visit to the Iberostar Del Mar,", "title": "Still Love the DelMar", "user": "Sofiamia", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48628300}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "October 13 -22 . We have previously stayed twice at the IB Tucan, Mexico -The Majestic and Punta Cana Grand , in Punta Cana and Riu Negril , Jamacia.", "title": "pure magic, did not have to think for a whole week!", "helpfulness": 6, "user": "andyDenver", "date": "November 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 48503749}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Last December was our first time at the Del Mar and we love it.", "title": "Wedding at the Del Mar", "helpfulness": 3, "user": "cmfs", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48376710}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "Transfers were with Olympus-quick and uneventful.", "title": "If you need R & R, this is the place", "helpfulness": 1, "user": "TraciNewHampshire", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48368004}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Arrived at the resort about 1:30pm-check-in was quick and we were upgraded to an oceanfront room same as back in December and it was wonderful!!", "title": "very good", "helpfulness": 1, "user": "treejon", "date": "November 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48227378}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Stayed 5 days at the hotel, was my 4th holiday in an all inclusive hotel on the Mexican Caribbean coast. The first impression was the beautiful lush tropical garden in which the resort is embedded. Friendly reception and throughout my stay, every single staff member was very friendly and helpful without exception. The room was spacious and well equipped, with coffee maker, ironing board and free of charge mini bar. New flat screen TV with CNN and BBC. Also, the two beds were large and comfortable. A balcony provided additional space, and possibility to smoke, Anyhow, there was nothing to complain about the room or otherwise except that laundry service needed to be called twice. The breakfast buffet was good with various selections, eggs made to order, but bread choice or selection of cheese could be improved, but for the price more than adequate, the restaurants (upon reservation, visited the Italian and Mediterranean) offer good service, but dishes may be partially modest for European standards. The beach is beautiful, with white sand, and pleasant to swim. The pool is large. Something unique are the various animals that inhabit the estate. Most visitors will appreciate the flamingos and swans in the amazing waterways and pools integrated into the hotel, but the \"Quatis\", kind of anteater, do not meet the favor of all hotel guests. These animals appear in groups of 20 to 30 animals and are greedy to get food and e.g. jump into waste bins at the snack bar for getting disposed food. They are actually harmless, but some of the tourists were upset. We also spotted a Gecko. To comment is also the daily night show. The shows include a lot of choreography, dancers and partially live music. It is worth while to visit one or two of the shows, not to be forgotten that they are included in the all included scheme", "title": "Place to Relax", "helpfulness": 3, "user": "Frequentvoyager", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144785099}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "The buffet food is just not of good quality and it needs some serious attention for a 5 star resort. The Internet is only available in the lobby which is quite amazing in 2012, I wouldn't expect wifi in each room but there should be wired Internet at the very least.", "title": "Shocking food, no Internet in the rooms.", "helpfulness": 2, "user": "Tom6187", "date": "November 6, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 144772962}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The staff were good and the weather was great. If you can stomach loud Americans, poor and limited Internet options and truly awful food then stay at the iberostar.", "title": "Good but not great.", "helpfulness": 1, "user": "cu_nanny", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 144609347}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I spoke to a couple who stayed at the grand and they said that the buffet food there was disappointing as well and that is the flagship hotel at this resort.", "title": "Never again!", "helpfulness": 3, "user": "cancoba", "date": "November 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 144605062}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We were quests at the Del Mar Sept.27 thru Oct. 4 on an Apple Iberostar Square Deal.We had a nice relaxing vacation overall, but we have had others that were better. I guess this just didn't have that special WOW factor. Our room was clean with a nice king bed. The room temp was a little warmer than I like but they lower it after 2 different requests. Mini frig was kept stocked with Coke Light by leaving a polite note. I don't know who our maid was but she did an excellant job. We had a ground floor room which we prefer. The weather was great.We had one day of rain that started with a thunderstrom during the night. Rained hard in the morning but by 10 we just headed to the pool anyway and enjoyed the day. Loved the pool and the water temperature.Nice and warm but not hot. We were always able to find chairs with shade and because of the time of year no towel,chair games. The beach was large with plenty of chairs and shade but this trip I really enjoyed the pool. Tried several different drinks but preferred their good cold beer. We ate at the main buffet and buffet by the beach and both were good. No problem with sevice. Iberostars always have good service. We ate at 3 alacarts and liked the Steak House best. We didn't do the shows, choose to have after dinner drinks at the lobby bar. The grounds were lovely and well cared for. There were peacocks,flamingos.swans and lots of coati. Loved the white peacock.I had never seen one before. There is some walking but we enjoyed it .We were in building 15 which is in the middle of the resort. The only real problem we had was we given wrong information about Catholic Mass.. We were told by staff there was one in their chapel @ 6pm Sunday but there was not one. We ended up taking a taxi into Playa for their 8 pm mass.Had we known we would have planned and gone earlier. My better half was upset about this. All and all it was the relaxing trip we needed . Next time I'll pay more and try the Iberostar in Cancun or go back to the Tucan. Happy Travels!", "title": "Great Relaxing Get-A-Way", "helpfulness": 5, "user": "dworl1", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144577804}, {"rating": 4.0, "title": "Returned from del mar on feb 18th", "text": "we were there the 11th - 18th. the resort is beautiful. the food was surprisingly fantastic! meditterranean and brazilian if you like meat and lobster. did not eat at any others. stayed at almost all of the sandals and grand lidos and the food at this resort tops them! service excellent. front desk and public relations rude and unaccomodating. slipped on marble in lobby first day and was injured. was told doc was too busy to see me. they took me to the room in a golf cart. sent a garbage bag filled with ice and never even called to see if i was ok. when falling i dropped my video camera in the pond. this is where public relations comes in. i simply asked if my insurance would cover it, and she said \"this is why we have plants and animals in our ponds, it is not the hotels fault, you shouldnt have walked so close\"and then practically pushed me out the door. --- weather cold! 73 in mexico!? no sun till last day. so only swam once. ocean very rough. but, as strange as it sounds, i am ready to go back to this resort only because i know i will not be disappointed with the food and service. and i will stay away from the pond and the front desk. oh! and only top shelf at lobby. no gran marnier. everything else is the cheapest of alcohol. beautiful resort, friendly staff, excellent service at bars and resaraunts. rude front desk and p relations. have fun!", "user": "serena k", "date": "February 22, 2006", "id": 4478378}, {"rating": 5.0, "title": "The Best Holiday EVER!!!!", "text": "My husband and I were at the Del Mar Jan14-28, 2006. It was nothing less than amazing. The staff couldn't do enough for us - Thank you Jorge, Royer, Martin, Alex, Susanna, Sajid - and the rest of the Star Friends - I did not want to come home and I will be back to the Del Mar!!", "user": "Tracey&Jeff", "date": "February 18, 2006", "id": 4468629}, {"rating": 3.0, "title": "Good and Bad", "text": "We met some awesome people there and have formed great friendships.", "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4456827}, {"rating": 5.0, "title": "Wedding at the Del Mar", "text": "We just returned from a trip to the Paraiso Del Mar.", "user": "alicat352", "date": "February 11, 2006", "id": 4452436}, {"rating": 5.0, "title": "Excellent vacation!!", "text": "First, I'll list the good things: The weather could not have been better. The resort was beautiful and very clean. The pool and beach were very nice, and there were plenty of chairs at each, so you didn't have to rush in the morning to get one. We traveled with a large group and had children of all different ages and they all found things to do and had a great time. The star friends were great at getting the kids to participate in fun events around the pool. We took advantage of the free shuttle into Playa Del Carmen one morning and did some shopping.", "user": "veroturmel", "date": "February 9, 2006", "id": 4449197}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "21 of us decended on this place from staten island, boston and new jersey.", "title": "nice place...great golf course", "user": "Christopher S", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 144550136}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "the food at the restuarants was good....the buffets however left alot to be desired . they seemed to to be under staffed and empty trays of food were not readily replenished...and this place does not carry premium alcohol as it boasts. this was our first try at iberostar. we found ourselves comparing it constantly to Barcelo ~ a much better place as far as the food, booze and overall layout of the place... i thought the service was exceptional room keeping, waiters and bartenders and bell hops.", "title": "Great value", "helpfulness": 4, "user": "Rajobie", "date": "November 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144484862}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "management at the front desk seemed confused and un organizied.", "title": "Beautiful resort but I got food poisoning!", "helpfulness": 1, "user": "Anne M", "date": "November 3, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 144419926}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "the golf couse was outstanding and for 79bucks well worth it. for an extra 25$ upgrade to a better set of clubs...the ones the give you are pretty beat up.", "title": "Another great time", "helpfulness": 1, "user": "sueray8", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144376739}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "AC didn't work well.", "title": "Terrible food quality and cheap liquor. Grounds were very nice.", "helpfulness": 2, "user": "dismail", "date": "October 31, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 144169698}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This was the first time staying at an Iberostar hotel and I would absolutly stay here again. The hotel is huge and the grounds are georgous. We stayed in building 11 which was right near the restaurant, pool and beach enterance. The beach is beautiful and the water was crystal. The pool is salt water and the water was warm. Sometimes too warm. There are pool games that goes on each day. The chairs by the pool go quickly. We always went to the beach for the morning and then after lunch we would go by the pool. I have two things that I wasn't too happy with. The food at the dinner buffet was not that good. Personally I think the only place that the food was decent was at the restaurants and it was nearly impossible to get dinner reservations. For a weeks stay, you are only allowed to have 3 dinner reservations, so that left 4 nights that you had to eat at the buffet. No a good system. My second thing was that we were so far from the lobby and the restaurants. You had to rely on the trollys to get to and from your room to the lobby. It is about a 1/2 mile or a 15 minute walk. I think if I were to go back again I would stay in a building closer to the lobby as opposed to staying near the beach.", "title": "A great trip and a beautiful place", "helpfulness": 2, "user": "busyb421", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46312565}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "My 2 daughters (ages 16 and 9) stayed at the Iberostar Paraiso del Mar in August, 2009. We had a wonderful time. The room was beautiful and our room was on the 3rd floor next to the pool. It was great being so close to the pool and the beach, although it was quite a hike to the lobby where we ate breakfast and where the evening shows were. For lunch we ate either by the pool buffet or at the beach grill. Both had excellent food and even my picky 9yo found plenty to choose from. Staff was very friendly and accomodating. Would recomend this hotel highly. Ate one night in the Mediteranean Restaurant and one night in the italian restaurant. Medit. was awesome and had a delicious seafood bar. Italian was good too but not as much food!", "title": "Soaking up the sun in Mexico", "helpfulness": 1, "user": "bupper66", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 46300298}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "First, the minus: there *are* mosquitoes, so bring your bug spray! BUT, the resort is stunning, with beautiful, meticulous landscaping and an amazing pool. The beach is breath-taking. There are hammocks and plenty of lounge chairs. The hotel was very empty when we were there. I'd read complaints about the food, but I thought it was good. It was better than most cruises I've been on! The Steakhouse was excellent, and Japanese restaurant was entertaining. The \"Star Friends\" are fun and engaging. The spa was blissful and reasonable. I would go back to the resort in a heartbeat!", "title": "Already planning return visit!", "helpfulness": 2, "user": "chr15ras", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 46244914}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Sorry for the late review- heading to the Lindo this November and it reminded me to get the review in for the Del Mar. 2 couples with 3 girls aged 10, 11 and 11 and one 17 year old boy. The service was, as always, wonderful. We were worried about the 17 year old being bored, but the staff always had something going on that he was interested in and he was very anxious to go back after the trip was over. My only complaint was that the a la carte restaurants were very difficult to get into. We never had a problem getting in or even getting an extra night at the Tucan, but with 5 resorts all being able to book at the Del Mar and Beach restaurants it was just too hard. We did get our three nights, but not the restaurants or the times we wanted. Overall it was a wonderful week and we are looking forward to going back.", "title": "Another great stay with Iberostar", "helpfulness": 1, "user": "Beachlvr49", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46231263}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "This place was beautiful and relaxing. My 7-yr old spent entires days in the pool. It was wonderful! He said he would rather come back here for vacation than go to DisneyWorld. The staff was very accomodating. When we checked in we had a room by the lobby, which wasn't very desirable for us. However, when the hotel service person noticed the age of our child, he moved us to a room near the beach and right next to the pool. Awesome!", "title": "Can't wait to return!", "helpfulness": 2, "user": "Wendell_NewEngland", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45503856}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband and I just returned from our 4th trip to the Iberostar del Mar April 14-19, 2012 and would go again tomorrow if we could! We previously have stayed at the Majestic & Grand Oasis in Punta Cana, Riu in Negril Jamaica, Breezes in the Bahamas,& Iberostar Tucan in Playa del Carmen among others, but keep coming back to the del Mar.", "title": "Love the del Mar", "helpfulness": 4, "user": "Sofiamia", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128450700}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The resort is about a 30 min. transfer from the Cancun airport,we traveled with Olympus who was on time & pleasent. Apon arrival we were sad to hear Olga is no longer with the resort but our room was ready ,on the beach and as lovely as always. We made our two dinner reservations & were put on a waiting list for the other three evenings which were honored, thank you Hugo. Our room was oceanfront with a gate opening directly onto the beach...what is not to love. Contrary to what I read in others reviews we always seemed to be able to catch a trolly to the lobby but it was only a 10 minute beautiful walk anyway. We never had a problem getting a palapa by the pool, and compared to other resorts, chairs are so plentiful no worries here. The pool speaks for itself it is huge winding & beautiful. A few new wicker beach beds were added by the sports pool since our last visit & they were in the process of adding a bed with a pergola on the beach behind the beach bar ,but it was still in the works. There is soo much food available that I am so surprised that people complain about it. The choices are endless, some things may seem strange but the resort is catering to guests from many different countries hence the variety.", "title": "Poor Management", "helpfulness": 2, "user": "SUNLOVER912", "date": "April 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 128434336}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The commercial center still has yummy crepes with ice cream & the spa wow!", "title": "i was convinced that they didnt want us back", "helpfulness": 1, "user": "geofflovesmexico", "date": "April 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 128384951}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We took the shuttle from the lobby $5.00pp each way to Playa del Carmen. It makes for a nice morning trip to pick up a few gifts and back in the pool by lunch. If you are considering the Iberostar del Mar you should know that the resort is large (but not too), family friendly (even though we traveled as a couple), the buffets are open air which we love ( but may be hot in mid summer) has a wonderful mexican feel to it (not the Taj mahal )", "title": "The Good, The Bad, and The Food", "helpfulness": 3, "user": "bigdogohle", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 128276668}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I had a great time, but it is what you make it. However, this resort is not being managed properly. It is incredibly beautiful, and has a ton of potential, but something is off.", "title": "Very nice place", "user": "Nomo123", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128235065}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I just returned from our third visit to the Iberostar Del Mar,", "title": "Third visit to the Delmar & still want to go back!", "helpfulness": 2, "user": "Sofiamia", "date": "November 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88291484}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "November 13 -18 . We have previously stayed twice at the IB Tucan, Mexico -The Majestic and thePunta Cana Grand , in Punta Cana and the Riu Negril , Jamacia.", "title": "Bats Bats and more bats!", "user": "Redreb", "date": "November 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 88227327}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We've stayed at the Delmar in December 08 & October 09 and as you can guess we love it.", "title": "back to what we know", "user": "dez1964", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88021516}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Transfers were with Olympus-quick and uneventful.", "title": "NOT A 5 STAR", "user": "brunellar", "date": "November 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 87923082}, {"rating": 5.0, "stay_parameters": "Stayed December 2009", "text": "We arrived at the resort about noon time and our room was ready. Olga at the front desk was very helpful and informative . We had an oceanfront room same as the last two visits and it was wonderful!!", "title": "Paradise at its finest", "user": "mbaker82", "date": "November 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 87601281}, {"rating": 5.0, "title": "Very nice resort! Please read the ending.", "text": "Stayed October 22 to the 29th. This was our first stay at an Iberostar and it will not be our last. It was definately a step up from the other resort chain we typically stay at. The other reviews that mention the need to walk alot are not exaggerated. 20 minutes from our beachfront room to the lobby. However, we found the golf carts or \"trams\" we're always available to get us from our room to the lobby, to the on-resort shopping center or to the dinning rooms. And the drivers (bellboys?) were always willing to arrange time to get you when you needed a ride. Any issues I had with the walking was from my own stubbornness to not take the ride when my princess told me to. (there....Are you happy dear??? You were right. That hurt). The grounds were immaculate and all the food courts were constantly cleared and cleaned. The staff were exceptional. The Apple Vacation Reps knocked it out of the park again, always there to help.", "helpfulness": 4, "user": "Bob M", "date": "October 30, 2012", "id": 144101621}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "One word of caution and it should not be directed only toward my experience at this resort. After we checked in and upgraded our room we went to catch some lunch. I received a text from Verizon regarding global charges. I returned to my room to call the number Verizon provided regarding the text I received. While on the phone the door burst open and a worker quickly entered the room. No \"knock\", no \"hello room service\".....just entered real quickly. When he saw me he didn't say anything, just turned and ran out. I went after him but didn't find him. I called the lobby and explained what happened. They confirmed that a supervisor had just called the management to report that while he was doing room checks he came in our room not expecting us to be there. When I asked why he did not knock, they said he didn't expect anyone to be in the room. (in his defense, we had upgraded from our original room to the oceanfront room and only an hour and a half had gone by since getting into the new room). So there is the chance that word had not gotten to the \"supervisor\", who was suppose to be in charge of those rooms. When I asked management if it was customary to knock first they said yes, when I asked why the supervisor ran out of the room without trying to explain hat happened, she said that he panicked because he does not speak English. I bumped into the supervisor a short while later and discovered he understood English and spoke it well enough to be able to tell me that he thought the cleaning lady was cleaning in our room. After some discussion with management regarding what had happened, they were gracious enough to offer us three additional nights dining at their specialty restaurants. Again, this is just a heads up for everyone traveling to any resort. Don't let down your guard or believe for a second that your room is subject to entry. It's just fortunate for us that the princess was not feeling froggy and wanting her prince to do something about it at that specific moment...:-0", "title": "The Best Resort", "helpfulness": 4, "user": "mimnden", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144069924}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "I would certainly consider returning to the Del Mar but will most likely do better research for a much smaller resort.", "helpfulness": 4, "user": "Robert Mr B", "date": "October 28, 2012", "id": 143947344}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "We stayed at the Iberostar Paraiso del Mar from October 6 to 13. It was an amazing resort!! Please do not believe the negative you read about this place. Everything was phenominal! The staff bend over backwards for you......whether you tip them or not!! You can't help but give them an extra tip because they are so good. The restaurants are wonderful........the food is unbelievable!!! Shame on you if you disagree! Not one complaint about the food or service. The buffet is typical but no complaints there either. There is a huge variety of all types of food and found it all to be very good.", "title": "Get what you pay for", "helpfulness": 6, "user": "JandB924", "date": "October 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143918866}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The beds are firm but we like our bedding firm, not lumpy, bumpy soft........not good for your back.", "title": "Amazing!", "helpfulness": 3, "user": "Stephen T", "date": "October 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143846411}, {"rating": 5.0, "title": "first timers in mexico", "text": "This was my first trip to Mexico and first \"plane trip\" vacation in many years. We left in the snowstorm on Feb 12 and arrived at the hotel about 11 PM. Very easy check in and a staff member waiting with welcome drinks at that late hour. Because it was dark we saw nothing of the grounds on arrival. What a surprise when we got up the next day. Like opening the door to OZ! The hotel and grounds are immaculate. The food was good (although I'm not fond of buffets) and the staff are very professional and friendly. I didn't care for the stray cats around the beach restaurant and the main buffet and I also didn't like how the Star Friends plopped themselves at your table at breakfast. It did rain one day so everyone piled in the lobby for bingo and drinks. It would be nice if the \"satellite\" tv had more variety and a few more stations in English. Although Scooby Doo in Spanish is pretty funny. We took the shuttle bus to Play del Carmen on a cloudy morning but is difficult to shop with all the vendors pecking at you and we found the prices in the hotel gift shop about the same and bought our souveniers there.", "user": "A TripAdvisor user", "date": "March 7, 2006", "id": 4589806}, {"rating": 2.0, "title": "over rated hotel", "text": "All in all a stellar vacation and we are seriously thinking about returning next year. I really miss the Mariachis!", "user": "A TripAdvisor user", "date": "March 5, 2006", "id": 4584767}, {"rating": 5.0, "title": "2nd time and just as good!", "text": "My family and I were at the Del mar Pres. week. Two kids 18, and 9 my wife and myself. I found the hotel to be too large. We had to constantly wait for a tram to go back and forth from the lobby to our room. You could walk it, but its pretty far especially in the hot Mexican sun.", "user": "WTG", "date": "March 5, 2006", "id": 4583691}, {"rating": 5.0, "title": "Treated like Gods", "text": "The beach is pretty, but you cant swim unless you want to get the bottom of your feet cut. It's very rocky. You have to walk all the way down the beach to go in the water.", "user": "A TripAdvisor user", "date": "March 4, 2006", "id": 4582612}, {"rating": 5.0, "title": "Totally awesome!", "text": "The tennis courts are on the other side of the resort, and requires two trams to get there!", "user": "shadycat", "date": "March 3, 2006", "id": 4578333}, {"rating": 5.0, "title": "From the Young Rietired Couple", "text": "The resort was literally a Garden of Eden with space, flowers, pools and animals ie. Flamingos, Peacocks in harmony with architectural columns and buildings leading to the main buildings. The staff from barkeeps to waitresses were exceptional We barely had to think of a desire before it was fulfilled The food was fair to good and on par with other all-inclusives we have been at but below that of cruise shios The room was great and the bigger than king sized bed comfortable for us. The shower was great in itself. The grounds are spacious which allowed us to choose between being \"where the action was\" with lots of other guests and kids or tucked away by the adult pool and relaxation area (where we stayed) We didn't find the walks difficult and did use the hotel trolley once or twice Entertainment - Mariachi's -Bands that got the main pool rockin- and evening shows were fun and we did not expect Broadway anyway We enjoyed this resort so much we will look for other Iberostar properties for future vacations We will most certainly return to this resort given opportunities and would love to bring our entire family- all 14 of us. We did tip frequently but the only people asking for tips or expecting was the \"Apple\" representatives This was the first vacation we've had that had a resort so wonderful - we decided AFTER our arrival not to book any side trips and stayed there just to blissfully relax!", "user": "jojosgranny", "date": "March 26, 2003", "id": 924609}, {"rating": 5.0, "title": "Fun in the sun!", "text": "We just got home yesterday from a week at Paraiso Beach, and loved every minute of it! We would highly recommend it to anyone who asks. The resort grounds and rooms are kept EXTREMELY CLEAN, with staff working non-stop to keep it that way. The staff are very friendly, and would go out of their way to make sure we enjoyed our stay. The pool was amazing, the best we've ever seen. The beach was beautiful as well, with white sand and turquois water. There are three swim-up bars at the pool, and one bar at the beach. Liquid refreshment was never a problem. There were plenty of lounge chairs at both the pool and beach, however as you would expect, the best seats are always reserved early. I still swear there were people reserving seats at both the beach and the pool, as many of the \"reserved\" seats would go unused for most of the day. Still, we never had too much trouble finding a good spot. The food and drinks were well above average for an all-inclusive resort. We never had any problem with ice in our drinks, and judging by the number of people with pina coladas in their hands, it appeared as though most would agree. We were still a little cautious with the tap water in the rooms though, just to be safe. There was always a large variety of food at the buffet, however due to our tendancy to eat pretty much the same things, we grew a little tired of it by the last day or two. Our mistake was not to make reservations at any of the specialty restaurants. We'll know better for next time. The Coca-Cola actually tastes like Coca-Cola, and the \"maple syrup\" is as close to the real thing that we've ever seen at an all-incluse resort, making the fresh pancakes and waffles a nice breakfast option. Oh, did I mention that they make fresh donuts every morning too? The ice cream bar near the pool was a nice touch, as was the bar fridge in the room, which was re-stocked daily (despite a sign saying it would only be re-stocked every other day). Based on reading several of the earlier reviews on this website, we specifically requested a pool-side room, and were glad we did. Construction of a new resort is under way on the other side of the buildings, and although not noisy, would not be as pleasant to look at as the waterfall and pool view we had from our balcony.Our only word of caution is that due to the layout of this resort, you better be prepared to walk, a lot. Not that it was a bad thing for us, as it allowed a good chance to exercise off the few pounds that surely would have been gained otherwise. There is a trolley that regularly passes if you'd prefer a ride. There are a number of day trips available (Mayan Ruins, snorkelling, etc...), taxis into town, a night club, cigar bar, pool tables, a kids club during the day, and nightly entertainment to keep things exciting. All in all, we had a great time, and would definitely go again. Maybe next year...", "helpfulness": 5, "user": "dave2step", "date": "March 24, 2003", "id": 923130}, {"rating": 5.0, "title": "Enjoyed Our Stay", "text": "My family and I just returned from this resort where we spent six days and five nights during Srring Break. We had a wonderful time and found the information on this site to be very helpful and accurate. Here is another person's perspective on the property:o Rooms -- Very nice. The depiction on the Iberostar web site was accurate. The beds were a bit hard though. Each room had a safe and a mini fridge that was regularly stocked with soda, beer, and water -- all included in the package. (Parents with little kids: the TVs in the room have Nickelodeon.)o Service -- Really top notch. Very friendly and helpful.o Grounds -- The grounds are magnificent and very well taken care of.o Food -- If my family had any quarrels with the hotel, it was over the food. There are a number of specialty restaurants at the hotel, but you must book them in advance. Our guess is that while they want to offer variety, they want guests to use the main buffet restaurant (which requires no reservations and is probably less expensive to operate) to the max. If you stay for 5 nights you are allowed 3 specialty restuarant reservations during your stay. The seatings are at 6:30, 7:00, 8:30 and 9:00. Make your reservations the first day; they are difficult to obtain.Having said that, I'm, not sure the specialty restaurants are anything to write home about. The Mexican offering was top-notch; quite delicious. The Japanese was awful. The \"Tropical\" restaurant (specializing in seafood) was mediocore at best.The buffet was not bad, but you did start to see some sameness after a couple of days. Breakfasts tended to be better than lunch or dinner. You can also get a llimites (and included) room service from 11 - 11 if you want.There also is an ice cream parlor open in the middle of the pool that is great for kids.o Pool -- Really lovely. It is quite huge and has a very nice \"waterfall\" at its start. A tip for parents: the pool has tons of lounge chairs, and most are covered. However, there are five little \"cabana\" structures by the pool. They are completely covered and several kids (or two adults) can nap in them comfortably. This is a wonderful offerinbg if your kids are small. However, people will literally go out at dawn (if not before) to claim them.o Beach -- Again, really lovely. Tons of lounge chairs, but unless you get to the beach early, you may not be able to claim one that is covered. There are lots of hammocks under shade at the beach and there is a bar and waiter/waitress there as well. The sand is soft and the water is great, but it can be rough. You really cannot snorkel there because of the roughness and it may be too tough for little kids. o Spa/Gym. My wife did not go to the spa, but she said it was quite expensive (not unexpected). The tennis courts have a weird surface and there are only two of them For a facility this size, you would think there would be more. As for the fitness center, I have been to an Embassy Suites outside Detroit that has better equipment. Lots of people do job around the facility, and it is a pleasant jog.o Side trips. If you did not book one through your travel agent, you can book one at the hotel through one of their reps. We went to XCaret, an eco/heritage adventure park. We had a good time but, particularly if you are going with kids, I suggest that you plan to spend the entire day and leave early. There is a lot to do/see. o Ground Transportation -- If you booked yourself (not thru an agent) and don't have an airport transport nailed down, just take a cab. It should cost you around 300 pesos.o Final Note -- As noted in other postings, the Paraiso Beach and Paraiso del Mar are essentailly the same hotel, just on different sides of the pool. I'd stay at Paraiso Beach as there is construction adjacent to the del Mar side and it can be kind of noisy (though I did not hear anyone complainiang about it).All in all, we had a very nice time, would go back, and recommend it to anyone traveling with kids.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 21, 2003", "id": 922068}, {"rating": 5.0, "title": "Vacation of a lifetime", "text": "Our Christmas vacation was spent at the Paraiso Iberostar. Grandparents, siblings, and our teenage children. We had a wonderful time. The resort is absoulutely beautiful and the staff were very helpful. The food was plentiful and quite delicious. The pool and the beach are breathtaking. Be flexible with bus shuttles in to town as they are a little loose with their times.We look forward to our next vacation there.", "user": "A TripAdvisor user", "date": "March 12, 2003", "id": 913466}, {"rating": 5.0, "title": "Excellent, Would Go Back, ASAP", "text": "Got back on March 9. This place is beautiful. The grounds, food, service, rooms were all first rate. Easy to recommend it!", "user": "A TripAdvisor user", "date": "March 10, 2003", "id": 911774}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Returned yesterday from the Del Mar. What a great resort. My husband and I have been to Mexico approximately 5 times, and this is the second best resort we have stayed at. The first was the Aventura Spa Palace and it was for our honeymoon. Obviously the Aventura is much more expensive and therefore, the accommodations and food were a step above the Del Mar. But we do not allow that one experience to over-shadow any experience we have somewhere else.", "title": "Just got back yesterday (10/21) and We LOVED it!", "user": "TexasMom01", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84490773}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We stayed at the Del Mar for 6 nights, so we weren't there for an entire week, but we were very impressed with everything. We only ate at the buffets, and we were always able to find something that we liked. The rooms were nice and the maids always made sure our rooms were clean and well stocked. The grounds were lovely. Yes, this resort is very large, however, most people that travel to the Del Mar know this before they go, so it shouldn't be that much of a shock. As one review wrote, after eating and/or drinking, it's nice to have that walk to burn some of it off. The staff was exceptional. From the reception area to the bartenders, to the grounds keepers. Everyone went out of their way to make sure that we were well taken care of. Go see Victor at the beach bar and tell him to make you a Barcardi, Diet Coke and a splash of coconut rum!!! At the lobby bar, have Gabriel make you one of his margaritas! You will definitely need the trolly to take you back to your room!", "title": "7th Time Just May Be My Last", "helpfulness": 2, "user": "KTD1807", "date": "October 21, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 84347272}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "I've seen several reviews on this site about service by the staff being poor. IMO, you make it what it is. We tip EVERY PERSON that does anything for us. We tip every time we order a drink, we leave money for our maid every day, we tip our bellboys, we tip the trolley drivers, anyone that offers their assistance. We even tipped the front desk when we checked in. So if you want good service, take care of the ones that are taking care of you. My husband's exact quote evertime we go on a trip is: \"I can turn any resort into at least a step above what the rating is just by smiling, and throwing around a buck or two\". The staff members are not paid very much by the resort and they count on the tips that they receive, therefore, they are much more attentive and will make your trip more enjoyable if you take care of them.", "title": "Absolute Paradise!", "helpfulness": 3, "user": "Susani56", "date": "October 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83956207}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "We will definitely go back to this resort. We typically like to stay at a different resort when we go so we are able to see other resorts, but I think we have found a place in Mexico that we will return to again, and again.", "title": "We stayed at this location in september...", "user": "klynn14", "date": "October 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 83184564}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "If you have any questions, or would like more info, let me know!", "title": "Not what I expected!!", "user": "LMM22", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 83151808}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I travelled to the Del Mar with my wife and three children from 4/5/12-4/11/12. We stayed in third floor rooms 1449 and 1450 which were very nice and centrally located. We have been to many resorts both in Mexico and the Dominican and this resort rates as one of the best in terms of beauty of the grounds and quality of the beach. While it is a big resort, it is not to big to get around. There was plenty of space on the beach and the star friends do a very nice job of providing things to do. Our only complaint, which would cause me not to return to this resort was the main dinner buffet and the limiting of ala carte restaurants. The dinner buffet was the worst I have seen in the six resorts I have visited. There was no quality and everthing seemed like it should be a side dish. This was a big turn off. The ala carts were ok but much better than the buffet. This resort should seriously consider upgrading the buffet and increasing the ala carts or change the ala carts to what they do at Dreams where you just show up and if you have to wait, you get a pager. We have been to Dreams twice and this is a great feature. The shows were very good and the entertainers work very hard. The ice cream and crepes were fantastic as was the gym. This resort should also revaluate the smoking policies. I know they cater to alot of Europeans who smoke but it was very annoying to sit on the beach with smoke blowing all over and cigarette butts all over the sand. This resort could be so much better with a few changes. Overall, we had a good time but would not return do to the food as described above. If they make these changes, I would consider returning as the resort and beach are beautiful. Additionally, my son cut his toe on uneven boards by the beach grill area and they did their best to clean and bandage the injury but I think there first aid personnel could use a little more training.", "title": "Great Resort..OK Food", "helpfulness": 3, "user": "longbeack", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 127799131}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Area very beautiful, Food not so good!!! If you like starches and high carb food this is your place !!!!!! Did not enjoy ourselves.", "title": "hot dog and Hamburgers", "helpfulness": 3, "user": "Basia S", "date": "April 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 127546309}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I must say I have been to lots of different resorts, hotels and restaurants and I found the most awesome server in the Iberostar Paraiso Del Mar. His name is Jose Armando Carmaal Poot but his name tag says Armando. I have had outstanding service before but he completely exceeds all servers anywhere. Iberostar, please praise him and let him train all other servers. It was such a pleasure to meet him and he certainly made our vacation better! Thank you Armando!", "title": "Fantastic server", "user": "Laura T", "date": "April 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127493365}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This was our second trip to Mexico and I loved the Iberostar Del Mar !!!. First off the staff was absolutely wonderful, helpful, so polite, efficient and it didn't matter whether it was a gardener, maid, waiter , bartender, any time of day I always got a \"Hola\" and a smile.. Food was good, not exceptional but very good.Room was always cleaned very well as was the rest of the hotel, very clean. The grounds are stunning and well kept as were the pools. Beach was beautiful and once again well maintained. I have heard some people complain about the strength of the drinks...hmm to that I say have a few more :) I also had read reviews about all the coatis, and other animals being a problem. I work at a zoo so for me it was great but regardless I did not think they were a problem.. There were a lot of coatis running around, as well as peacocks and other birds but I honestly don't think they were an issue.", "title": "Mexico rocks !!!", "helpfulness": 4, "user": "Darlene G", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127336713}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "If I had to complain about anything it would be that my room card wouldn't work a few times but the staff was quick to bring me another and very apologetic and honestly that really doesn't seem worth getting cranky about. I highly recommend this hotel !!!", "title": "First time Mexico", "helpfulness": 10, "user": "lunaBelgium", "date": "April 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127141955}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "We stayed here from 10/16-10/23. It was a last minute deal for $1500 something for both of us all inclusive, airfare from DFW for 7 days.", "title": "The Good, The Bad & The Ugly", "helpfulness": 1, "user": "lastpenny", "date": "October 29, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 48084741}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The Good,", "title": "We found a slice of paradise at the Paraiso Del Mar", "helpfulness": 3, "user": "Pooski441", "date": "October 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47979924}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "The grounds are totally beautiful. We looked around in awe at the lobby, wildlife & waterfall as we wandered around the first day.", "title": "Great Family Vacation", "helpfulness": 2, "user": "Lori W", "date": "October 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 47814137}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The staff aims to please & would remember you, your drink & always have a smile.", "title": "One of the best resorts in Cancun/Riviera Maya area", "user": "happyncancun", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47782531}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The pool has alot of different areas based on what you are looking for at the time. Games with the Star Friends, quiet areas, basketball/volleyball areas & more.", "title": "absolutely beautiful", "helpfulness": 2, "user": "gerimayl", "date": "October 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47709652}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "This is the third time my wife and I have been to the Iberostar Paraiso del Mar / Paraiso Beach. They call them two hotels, but for all intents and purposes they are really the same. We visited in October 2009 along with my brother-in-law and his wife.", "title": "Third Time is Still the Charm!", "helpfulness": 6, "user": "TJJH", "date": "October 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0}, "id": 47605793}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "We previously visited this resort in Oct 2003 and Oct 2004, and were very happy to see that the warm remembrances we had of those two trips were confirmed by the quality of this trip.", "title": "Perfect Girls' Getaway", "helpfulness": 5, "user": "afranz", "date": "October 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46807606}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Due to the economy, it seemed that resort attendance was down compared to previous years, - a few of the restaraunts were closed. That really did not put a crimp in our step at all; the service and the food were REALLY good.", "title": "Beautiful resort", "helpfulness": 2, "user": "hammerhead355", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46761467}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Quick notes:", "title": "Relaxed, rested, recharged, and reconnected", "helpfulness": 4, "user": "thedawnof31", "date": "October 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46697807}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "* Weather was in the low 90s and sunny every day - PERFECT", "title": "Cant beat the price", "helpfulness": 4, "user": "vitalintent", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 46570213}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "My husband & I just returned from our first stay at the Paraiso Del Mar and couldn't have had a better time. As noted in most of the previous reviews, it was immaculate, and the entire staff couldn't do enough for us. The weather was perfect, 85 every day, with only a downpour about 5 a.m. one morning while everyone slept. The ocean was a little rough for the first 2 days but quieted down about the 3rd day. It was very difficult to go hungry or thirsty at this resort - we ate at the Japanese, Italian, Mediterranean, and Steakhouse and enjoyed them all but were a little disappointed with the Italian restaurant. We thought the buffets were excellent with a great variety. The bartenders and waitresses were friendly and very attentive to everyone's needs. Roger, the bartender at the swim-up bar, was great. The grounds are meticulously maintained, and we found the walk through this huge resort to be very pleasurable and good exercise. The peacocks, parrots, and flamingos were fun to check up on each day although our favorite was the fat old white duck who seemed to hang around the flamingos. It's hard to be back in the \"real world\" now but hope to return to the Del Mar in the future.", "title": "Wonderful week at the Del Mar", "helpfulness": 13, "user": "SuzanneE", "date": "March 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4719036}, {"rating": 5.0, "title": "Great destination wedding!", "text": "If you are looking to get married in paradise, Iberostar's Parisio del Mar Resort in Playa del Carmen Mexico is the place to go. We just got back from the most wonderful experience of our lives and could not have dreamt of a better place to do it.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "March 19, 2006", "id": 4694314}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We chose Playa del Carmen, Mexico because it is on the Caribbean side of Mexico where the water is warm and the scenery is lush. It is 30 minutes away from Cancun, but not as touristy or full of spring breakers. We were a little worried because we had heard the Hurricane had hit the area pretty hard, but they work fast down there and that place was up and running in beautiful fashion.", "title": "Wonderful Vacation", "helpfulness": 28, "user": "TwoShihTzus", "date": "March 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4615962}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Now, a little warning, if you are planning this long distance, as we were, it is a little difficult and frustrating at times, but don’t let that deter you. Most of our contact was through email, which many times went unanswered for long periods of time or not even responded to. As a stressed out bride, I was a little put off by that, but once we got down there, everything got taken care of. We met with our wedding planner our first day there and she arranged for everything, including the most gorgeous flowers I’ve ever seen for the wedding. She was unaware of some of our requests, such as the happy hour after the dinner, because of troubles with communicating through email, but was more than accommodating to make up for it. Once that meeting was over, we could relax until the wedding day; they even up-graded our room for no extra cost.", "title": "Outstanding Vacation", "helpfulness": 23, "user": "flino4", "date": "March 13, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4615838}, {"rating": 5.0, "title": "Awesome at the Iberostar", "text": "This is an all inclusive resort, which made the trip even more enjoyable and easy to manage financial. There were a few things we had to pay for in cash for the wedding and we did go into the town of Playa del Carmen a few times to shop, but other than that, we hardly touched our wallets. Tips are even included in the meals, but it is polite to give a little extra to someone who helps you out or does an exceptional job for you. I encourage you carry some extra ones around for that.", "helpfulness": 24, "user": "Pauline O", "date": "March 10, 2006", "id": 4599562}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed at the Iberostar Paraiso Del Mar from February 21st – March 6th, 2012. This is quite a long review. We had an excellent time except for all the people smoking. Smoking is allowed everywhere: restaurants, buffets, pool, bars, beaches, theater, and rooms. In the restaurants they would set aside “non smoking “tables, but they would be right next to tables which allowed smoking. In each of the buffets there were 2 sections. It would be nice if they put smokers on one side and non smokers on the other. The same for the pools; create one section for non smokers. The beach is more difficult unless again there was a section roped off for non smokers. The theater was so smoke filled that after 5 minutes we had to leave. I would think it would create difficult breathing conditions for the performers. Unless, there are some accommodations made for non smokers; we probably won’t return to this resort. Now, the good things.", "title": "Incredible, beautiful,and fun but too SMOKEY", "helpfulness": 7, "user": "lmom12", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127139614}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The food was generally very good. There was never any problem finding something healthy to eat. Service was excellent in the El Mercado. Service in La Plaza was very poor. We ate in that buffet twice with the same results. Food in both places I think comes out of the same kitchen, so it was all the same. The 2 snack bars serve a nice breakfast and lunch – just not as much as is offered at the buffets. The grill on the beach offers burgers, chicken, etc. It’s all freshly cooked. One day a week they make up a huge pan – like 3-4 feet across - of paella. It’s fun to watch and good to eat. The specialty restaurants were nice but not exceptional. We left the Brazilian restaurant mid meal because the service was so slow, and we weren’t thrilled to start with because we all were kept waiting until 6:45 to be seated instead of opening the doors at 6:30 as the other specialty restaurants did. It would also be nice if they opened a dinner buffet at 5-5:30 for people that may want to eat earlier. Otherwise, there isn’t anything available from 4 – 6:30 except hot dogs.", "title": "Mostly great vacation...", "helpfulness": 1, "user": "K R", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127136364}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The staff was excellent. Nearly everyone with a smile, asking if you needed any help, and very courteous. We found the following people to be exceptional: For some reason, we got to know the bartenders very well. In particular, these went out of their way to provide good service and make the experience a fun one. Demetrio in the lobby bar, Alejandro in the snack bar, Roger in the beach bar, and Luis in the pool bar. Flori the maid was always so cheerful, smiling and friendly. Danny-boy in security was very helpful on one occasion when we had a problem with our room keys, Karina at the front desk helped out a couple of times when we had a problem with the safe and with something that was stolen. She was very kind and helped to try and resolve our issues.", "title": "Welcome to paradise!!", "user": "Mgodin", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127096178}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "In the buffets, these people also provided better than average service, Miguel Gomez and Herlindo- who is working hard to learn English. Every morning we would be greeted for breakfast by Mariza - always happy and smiling. She was there to say hello and to wish you a good day when you left. Lastly, we had several conversations with Jorge Sardo in Customer Service and who ran the carousel in the shopping area in the evenings. He was a delightful young man who seemed to work very hard and always tried to make us feel welcome. He had a great attitude and excellent English skills. All the Star activity staff were fun to watch and very welcoming and talented. Take the bike tour. It’s fun and you get a good feel for the whole resort.", "title": "Fabulous - every aspect", "helpfulness": 1, "user": "PSmith1167", "date": "March 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127048053}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "It’s very difficult to get a shady space around the pool unless you got up at 6 and plopped a towel down. It’s pretty close to the same at the beach. There were days that we couldn’t find space at the pool because of all the ‘saved’ chairs. When we did get a spot, we would watch the saved chairs and even though we would be there for 3-4 hours no one came to use them. There has to be a solution, but I’m not sure what it is.", "title": "Best family vacation ever", "helpfulness": 3, "user": "bosslady1965", "date": "March 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126767178}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Our extended family (9 of us) including our 7 month old grand daughter just returned from the Iberostar Paraiso del Mar. This was our 6th trip down to the Riviera Maya in the last couple of years, and it won't be our last. Going in early November the resort was only about 60% filled so it was not too difficult to find a great spot around the pool or at the beach or even to get a timely reservation in one of the specialty restaurants. The weather was not bad - low eighties. There were a couple of mornings with some rain, but that ended by 10:00 am.", "title": "What a Great Time", "helpfulness": 2, "user": "montazuma007", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87291028}, {"rating": 3.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "This was our second stay at the Iberostar Paraiso Del Mar. We came back because my wife and I enjoyed our first stay so much. The front desk did a great job of getting our 4 rooms in the same building. Our rooms were nice and clean. The small refrigerator was stocked with some soda, bottled water, and a couple of beers. The beds were very hard, but that is the way I like them. We spend very little time in our rooms so they more than met our needs.", "title": "great time", "user": "RoadRunner888", "date": "November 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 87193314}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We spent almost all of our days outside at the beach or around the pool (weather permitting). I got up early to get a palapa but on most days I could have gotten one even as late as after breakfast. There were a lot of empty chairs at the pool and beach. There were some great places to sit and sun yourself all day long. The pool water was a little on the cold side, but the water in the gulf was very warm.", "title": "Beautiful but keep an eye on your belongings!!!", "helpfulness": 1, "user": "Nursie10408", "date": "November 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 85959044}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "We ate at the buffets, the mediterranean, Mexican, and Japanese restaurants. The food was very good where ever we went. I think that the breakfast buffet with the omelet, pancake, and egg stations are pretty unbeatable. The key to eating at the buffets for lunch and dinner is not to keep getting the same thing every day. I tried different things at every meal and also had some of my old standbys as well. It is a buffet; it tries to cater to a wide variety of tastes and palates. If you couldn't find anything you liked then you had to be a very very picky eater.", "title": "cancun with the girls", "user": "glorn5", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 85657020}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Probably the thing that stood out the most to me were the people working at the Iberostar Paraiso Del Mar. They were all very friendly and very helpful. Customer focused quality had to be at the top of their list. The Star Friends did a great job of offering different games, challenges, and activities to keep us active. I was going to try and give some names of those who I felt went over and above, but that list got too long to print. I especially want to recognize the people who cleaned the bathrooms, scrubbed the stone walkways, worked the pool area, cleaned our rooms, and cut the grass. These people did an awesome job and probably don't get the credit they deserve.", "title": "Lots of Bang for your Buck!", "helpfulness": 2, "user": "anniem7", "date": "November 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85650438}, {"rating": 4.0, "title": "A great 5-day getaway", "text": "Just got back from 5 days at the DelMar and we are very satisfied with all aspects. We arrived four hours late (thanks to American Air Lines) but jumped right into the relaxation. We were able to dine at three of the ala carte restaurants, Brazilian, Tropical, and Mexican. All were very good, though not spectacular. The service at all was excellent. The buffets were ok, but again not spectacular. We stayed at the Moon Palace last Easter and I'd have to say the food there was better, but we paid a lot more. The Del Mar layout is nicer and a more relaxed atmosphere. The entertainment was good, although a bit cheesy. But the \"star friends\" are very talented and worked very hard to provide good shows and activities all day long for guests of all ages. The drinks were good and top shelf was usually available. We'll go back again.", "user": "A TripAdvisor user", "date": "February 28, 2006", "id": 4565495}, {"rating": 4.0, "title": "Balanced account", "text": "We stayed in a standard room with a 3 year old and 8 month old and found the service, size and cleanliness excellent. The weather was cold for the first 4 days and rained for one of them so it wasn't the best start, but we made the most of it by hiring a driver and mini bus for the day $220 for 12 hours during which time he took us and guided us around over $500 worth of trip destinations(Tulum, Coba, Chichin Itsa, etc. The pool was very cold to begin with. However once the sun had shone for a couple of days the huge , and i mean gigantic pool was warmed up nicely. Plenty going on all day if you wanted it (very good organised grown up activities especially round the pool)or somewhere quiet and relaxing if you just want to unwind at the adult only pool area. Went on a disasterous 'caribean fun day' trip to isle majeure, it was a building site with diggers driving across the so-called paradise beach, the beach club wasn't a patch on the hotel we had paid to leave.", "user": "Jesterrip", "date": "February 27, 2006", "id": 4523972}, {"rating": 1.0, "title": "Overrated Iberostar", "text": "We tried all of the hotels restaurants but to be honest we didn't find the food to be much better than the buffet food. However it was nice to be served 'piping hot' food. We even tried the chinese in the Lindo, The Japanese is probably the most fun and the Mediteranean the best food (if you like fish)Mexican ok,Tropical v nice,steak liked by most people. Once your garanteed visits are used Go on the waiting list for 9pm and you are practically garanteed any of the restaurants but check to see if you are succesfull because they dont always tell you.The staff were very helpfull especially the waiter Esteban in the buffet restaurant (he works like a trojan) Regular tips work with all staff i think as the salary is low. We organised a babysitter one night and she was brilliant, but i heard that a child couldn't be found for 4 minutes whilst in the care of the kids club. Not long i agree, unless it is your child.", "user": "travelsnob13", "date": "February 26, 2006", "id": 4521096}, {"rating": 5.0, "title": "Awesome Resort", "text": "Generally we found everything about the hotel to be very good if not excellent. Remember buffet food by its nature is not gourmet, but we were never left wanting. There was allways a wide variety of things to choose from including freshly cooked fish, lamb, beef, mexican etc. I think the common mistake most people make is to have a bit of everything everyday instead of constructing a proper meal, IE: Beef with the relevent sides instead of a plate covered in prawns, fish, chicken, taco, pizza.etc and then doing the same thing for 14 days and getting bored with it.", "user": "RobertElkGrove_Ill", "date": "February 24, 2006", "id": 4500121}, {"rating": 5.0, "title": "Better than I Ever Expected", "text": "We have been to a number of Caribean islands as well as USA and Europe and would go back if it were not for the fact that we have so many other places to visit yet. But we will be looking for Iberostar hotels in other places now.", "user": "A TripAdvisor user", "date": "February 23, 2006", "id": 4498337}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We just returned today from this resort. After reading the reviews I was a little nervous, but was pleasantly surprised when we arrived the resort was absolutely beautiful. The grounds were kept immaculate by the staff. The restaurants were fantastic and we were always asked how the service was and if they could do anything better! The were lots of food choices and never went hungry. The entertainment staff work very hard to put on some great shows and always activities going on if you want to get involved. We would definitely go back! Wonderful time!", "title": "Paradise", "helpfulness": 2, "user": "behappy2468", "date": "October 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143804884}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Stayed October 16-23. Would like to thank Monica and the staff in Public Relations. They made our stay fabulous. We have stayed at this hotel many, many times. The pool was crystal clear, the maid service in the room was fantastic. Everyone is so friendly. This resort is big. There is a lot of walking - but if you can't - just call the bellman for a cart and they will be there shortly. These guys are great! We ate at the Brazilian, Steak House and Mediterranean restaurants - all were super! The bartenders will make the drinks as weak or as strong as you like. Just ask! All of the employees from the front desk to all the groundskeeping crew are friendly and always greet you with a smile. Thank you Iberostar!!!! We will definitely returning!", "title": "Great Vacation!", "helpfulness": 2, "user": "Foxborough", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143700915}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The resort staff was very friendly and helpful. The grounds were beautifully kept clean. The nighttime live shows were a nice touch done by the staff. You could tell that the staff put a lot of time and effort in making our stay more enjoyable.", "title": "Honeymoon", "user": "moose275", "date": "October 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 143677391}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The grounds are beautiful with walkways through various flora to & from the room & restarants & the beach. The main buffet & reservation dining have marble walkways surrounded by water-very impressive. The food overall was mediocre. The only place you could get a decent drink was the lobby bar. They had only one swim-up bar open.All others were closed or under repairs. They had three days when every bar was out of vodka. Our room got cleaned only three times and we were gone for at least seven hours each day. We've been traveling for 20 years and actually we had worse. But the infiltration of coati (south american rodent) was a little much. There were hundreds ! This resort should not be rated a Golden 5.", "title": "IIberostar Pariso Del Mar", "helpfulness": 1, "user": "bjdsummer", "date": "October 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 143646542}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Just returned Oct.23rd ---- 7 days --- weather great --- we have been there many times before --- have stayed at the Iberostar Beach ---- the Lindo --- Maya. We keep going back to the DelMar or the Beach side because of many reasons --- Front counter people are great (Friendly) ---- Bellman love helping everyone (we use them for transportation) ---- Rooms are very clean (we upgraded to the Room on the Beach) the view was out of this world and the Beds where soft ---- Maids are easy to work with ---- Bartenders very friendly ----- Food was good ---- special resturants where great (we had three of them) ---- for the money --- this is a good place to try", "title": "Great Time ---- Zachs", "helpfulness": 2, "user": "Patrick Z", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143633976}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Just got back today 10/28. I can't wait to go back!! went with a girl friend of over twenty years who needed a vacation but I can't wait to go back with my husband. The People are so dang friendly. They really go out of their way to make your vacation the best it can possibly be. I took money to tip but felt like I didn't take enough, I believe in rewarding great service and their service was so incredible that I would've spent every dime I had on tipping them if I could've. the beach/pool service is the best I've ever experienced. I've been to alot of different places, Bahamas, Dominican republic 9 times, bermuda, Jamaica this was not my first All-Inclusive experience but bar none Iberostar has exceeded all of them. it was like going from a motel six to a ritz calton. I'm already planning to go back in April for my 5th wedding anniversary. My only complaint if you call it one is that the place is too dang big. it's like a city, alot of walking, all it needs is a post office and you could spend the rest of your life there lol. Please please listen to this review and book your trip asap. I may even see you there :-)", "title": "Who ever doesn't like this place is Crazy!", "user": "reednikki", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85215978}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We went here for a friends wedding and stayed one week. The rooms were not very clean, if you wore white socks they will be black by walking around the room in them. The paint was chipping off of the walls in both of our rooms... we got moved mid-week as a \"comp\" due to being locked out of our room (the key card reader broke) and we had to wait a long time for a response from the hotel. There were bugs in the rooms and we were NOT on the first floor in either room. The water temp in the shower changes on you without intentionally changing it. The beds are old and you can feel the springs in the mattresses. We asked for a foam pad which took three days for them to deliver and it only covered the area of the bed from the hips to the shoulders. Some of the sheets had stains and holes in the sheets. The toilets clog VERY easily, even with a little bit of toilet paper and the response to unclog... HOURS. We called to report a clogged toilet at 9pm and they said they would send someone \"right away\", we called again at 10pm and I walked down to the front desk at 11pm because we were tired of hanging out waiting for them to arrive and I wanted to get my shower. The beach is groomed daily. Be careful going out in the water as there are a lot of rocks in the water but if you walk up the beach towards there high-end, no kids, hotel, the beach is nice there. The food is mostly greasy to pack stomach meds. Bottom line: I think this hotel is probably great for spring break college students that will be drunk the entire stay and will not notice, or care about the above items. If you are going here to drink your week away, this is a great place for you... there are bars everywhere and it's all-inclusive. They did a nice job with my friends wedding on the beach and that is the most positive thing that I can say about it. I would not go back even if I won a free trip there.", "title": "In USA star ratings: 2 star hotel on 5 star grounds", "user": "NittanyLionLuv", "date": "October 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 85149027}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Before going we did a lot of research because we had been in the area several times and came to the conclusion that this was the best option for a family retreat booked through apple vacations.", "title": "Huge!!!", "helpfulness": 1, "user": "jdocarmo", "date": "October 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84815432}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The resort is immense, endless pools, activities from early morning to evening by the pool. There is nightly entertainment, which is themed every night, not Broadway shows, but mostly musicals and comedy mixed. The rooms were extremely clean, bathrooms impeccable, every day maids would leave a different towel sculpture on our beds. The pool could use a little updating and my son got a cut from a broken tile, but overall very enjoyable (Salty water), and there is very little to no chlorine smell to it, water fall is nice, but the jacuzzi is moldy. There are several swim-up Bars and they mostly keep imported licour hidden for you to ask or upon a tip they may serve you, a few dollars will get you great drinks all day long. The lunch at the snack bar is great and has dozens of options, from meats to salads, fruit, ice cream, all help yourself. The gourmet restaurants are okay, but don't expect 5 star food, the buffet is huge and has a different menu everyday with very healthy options, breakfast is complete and plentiful they also have 24/7 room service. Service is great all around, extremely friendly staff, and very helpful. The beach has swimming spots but also a lot of rocky areas. Over all I think this was the best resort we stayed in Mexico so far. The only observation I would make is that everything is far, and there is a lot of walking to and from everything, which I appreciated after huge meals. Have fun!", "title": "Beautiful place but bad food and weak drinks", "user": "westchester5", "date": "October 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 84647768}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "My wife and I went there for out 35th wedding anniversary. The hotel grounds were beautiful. The pool was great, the beach was unbelievable. The room was upgraded to a junior suite. Basically the same as you get at holiday inn. Not the greatest of rooms but was comfortable. However the rooms were not cleaned and restocked very well everyday. The little frig only had water, soda’s and a couple of beers. But the sad part of our trip was the food. We were there 7 days and with 7 day stay you get to pick 3 restaurants to have dinner, “only 3” the rest of the time you had to eat at the buffet. Everyday your food was pretty much the same thing. Their deserts were rally bad. The room service was hot dog or hamburger very very poor chooses. The restaurants basically was like eating at the buffet but you had to chose off menu and you were served rather than getting it yourself. The place is gigantic in size so you have to walk a lot. The shows were fun several nights but you have to watch were you go because one night the show we went to would not serve us because we had the wrong color band on. Same with beach bar even though they were right there together. The staff was very nice and friendly and tried to make everyone feel welcome. As to if we would return the answer is NO. We have been to several resorts and even thought this place was beautiful it was not up to the standards I would expect for the price we paid. If you have kids it would be a good place for them they have lots of events kids would like just not a place for couples.", "title": "Wonderful resort", "helpfulness": 2, "user": "cbrzez", "date": "October 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84522435}, {"rating": 4.0, "title": "A bargain when on sale", "text": "Just returned on 4/17/2012 after 7 days Apple Vacations all inclusive. Four adults, two kids under 12. Kids were free except for airfare. Only 30 minute bus ride south of Cancun. Check in was a breeze. Rooms were ready upon arrival. Staff very competent and friendly. Beautiful landscape and architecture. Very clean. Good sized and comfortable rooms with TV. Nice balcony. Matresses a little too firm. Mini fridge well maintained. Buffets and snack bars were good, but not gourmet by any means. Wait staff were excellent. Bars were very accessible and the bartenders were excellent. Pool was huge and well maintained. Beach was white sand and moderate surf, with some spots of rocks, but plenty of clear areas for swimming and snorkeling. Acitivities and animation staff were energetic and friendly, but a bit too loud for our old ears. Evening entertainment featured a lot of audience participation and was a lot of fun, but also very loud. The complex is big, so bring good walking shoes. The weather was mostly sunny and in the 80's. Shuttle buses are available but not always convenient. Watch for sales and save some money. Americans: you still can't bring Cuban cigars back into the country, but you can enjoy them while you're there.", "helpfulness": 3, "user": "Blue_Crab", "date": "April 19, 2012", "id": 128189971}, {"rating": 4.0, "title": "Very good value for money. Lovely grounds. Food only ok!!!", "text": "Check in very good. Think was Alexandra and was very pleasant and helpful. No welcome drink or towel etc but smooth check in.", "user": "linzilocket", "date": "April 18, 2012", "id": 128115351}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Room. Good size and clean. Maid came in daily and cute little towel animal everyday. Beds not massively comfy but ok.", "title": "Can't wait to go back", "helpfulness": 2, "user": "Huntingfriends", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128068050}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Grounds. Beautiful and clean lovely to walk around day and night, pool area nice also, could always get a subbed without playing sunbed wars early although some did!!!!!", "title": "a very honest review of the resort and the low class clientelle", "helpfulness": 1, "user": "Diane K", "date": "April 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 127886293}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Beach. Clean and nice.", "title": "Cancun in April '12", "helpfulness": 3, "user": "kelleyboone", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127884744}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 107, "average": 283, "very good": 752, "terrible": 66, "excellent": 1234}, "aka": "Iberostar Paraiso Del Mar Hotel Playa Paraiso", "slim_ranking": 0.7, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Directly on the beach of \"Playa Paraíso\" (Mexico). High standard of comfort. Wide gastronomic variety. 18-hole golf course. PAD/SSI – diving school, massage at the beach and the pool. Spa."}