{"user_rating": 4.0, "review_count": 1529, "name": "Iberostar Playa Alameda Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "this is a nice hotel with good staff but it is not a 5 star hotel more like a three to four star", "title": "not a 5 star hotel", "helpfulness": 4, "user": "larryosafc", "date": "October 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119101501}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "the food is not very good and you will have to fight the flies for your meals.", "title": "Awesome Holiday!", "helpfulness": 7, "user": "Ana164", "date": "October 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119057742}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "the mossies are an absolute nightmare b e sure to leave mossie machine plugged in as much as possible", "title": "True 4.5* Resort.", "helpfulness": 10, "user": "grzes", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118753769}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "tip the cleaner a couple of pasos and you will recieve good service even though you dont have to", "title": "honeymoon vacations", "helpfulness": 7, "user": "sylvain o", "date": "September 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 118631766}, {"rating": 4.0, "title": "Lots of good things, but some could improve", "text": "the two lads in the santiago bar are really good guys and will help you as much as they can.(colin the waiter and frank the barman)", "helpfulness": 6, "user": "daveat28", "date": "September 24, 2011", "id": 118540983}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I travelled to Playa Alameda for a week at the end of August with my family. I have been to Varadero before but for my parents, it was their first time and and all in all - they had a wonderful experience.", "title": "Wonderful for the price!", "helpfulness": 10, "user": "SleeplessDreamer", "date": "September 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117775190}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The RESORT itself is located further into Varadero and therefore, it has a lot of grounds complete with palm trees, flower shrubs and fountains - it is perfect for walking around between eating and swimming. The resort is set up in blocks of condos, with each condo with about 24 rooms spread across 3 floors. I would recommend asking for a room not located on the first floor in order to avoid bugs coming in from the doors. I emailed the resort a week before our stay, also asking for two rooms close to each other and that is exactly what they gave us. The ROOMS themselves were spacious, with coffee tables, a couch, double beds, a functioning safe and AC (sometimes even too cold) and a bathroom that had both a shower and a tub with a pull-out shower nozzle - however the tvs in both rooms did not work well. There is also an electrical plug that is converted for North American voltages. Our rooms were cleaned everyday, complete with towel art. However, if you would like the mini-fridge to be restocked - you will need to write a note to the maids in order for them to do so, same with asking for extra towels and pillows. We found out that if you don't ask, they won't give.", "title": "It was OK", "helpfulness": 6, "user": "TravelsAlways", "date": "August 23, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 117146431}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "BEACH was superb as it is in the Varadero area - the water got pretty strong at times, with huge waves but nonetheless there was always people at the beach. When the waves aren't that strong, all the water sport equipment is brought out! We never had any problems with finding beach chairs even with the people putting their towels and reserving the shaded areas. Throughout the day, activities went on around the beach and pool areas for anyone that wanted to participate. The animation team were never pushy - so no need to worry for all you beach bums like me!", "title": "feel like family", "helpfulness": 4, "user": "josee g", "date": "August 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116957468}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "As for FOOD, there are 3 a la carte restaurant but it is only the seafood restaurant that is worth mentioning - since we found that the best. The buffet began to lack variety by the end of our stay but we always found something to eat nonetheless. There is always something that is grilled on the spot, either meat or seafood, and a pasta bar with spaghetti that is custom made for each guest. At any time of the day - there was food somewhere, be it the snack bar by the pool for pizza and fries or the piano bar for a drink or a cup of coffee!", "title": "Really Smashing Hotel", "helpfulness": 7, "user": "Philip1952", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116768354}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "For ACTIVITIES out of the resort, I would suggest taking the Varadero bus tour, a double-decker bus that takes you into Varadero city for 5 pesos - perfect for buying all your souvenirs at the various flea markets. The ticket is valid for the day and you can hop on and off, if you wish to go back to the resort for lunch and head back out later on! The bus picks you up and drops you off right in front of the resort and is a great option for those cloudier days. And if you are willing to pay a little bit more to go out of Varadero - I would definetly recommend taking a tour into Havana. I have been twice and each time, I was blown away with the beauty and culture of that capital!", "title": "A great first time experience!", "helpfulness": 7, "user": "MegDebYou", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 116615107}, {"rating": 5.0, "title": "Fabulous SECOND Stay...Will go again!", "text": "Let me begin by saying this was my second trip to this hotel, having visited previously in December 2008. I loved my vacation then and loved it even more the second time. The main reason for this is the amazing staff! This time I travelled only with my 18 year old daughter (last time we were a group of 9 family members aged 15 to 70). As with our last visit, the animation team (Star Friends) under the leadership of Alexis, absolutely made our holiday the most memorable and enjoyable experience it could possibly have been. From the moment we arrived at the pool on our first day to the minute we left the beach on our last the saw to our every need, kept us entertained, and generally treated us like family. Alexis has an amazing team and does a SUPERB job. I will go back to this hotel again and again because of the work that he does. Special mention also goes out to Yudi Romero, a Star Friends team member who went above and beyond every day of our holiday to ensure that both my daughter and I felt welcome and a part of every activity going on. We miss her already!! Be sure to look both she and Alexis up when you choose this hotel. Pepe, the gentleman on the beach will take care of all your needs regarding beach chairs and anything else that you need on the beach. He was also there two years ago. Eduorado, the egg chef could always be counted on the morning to greet you with a generous smile and perfectly cooked eggs...another long standing employee. I believe that this is the greatest asset that this hotel has going for it; employees who have been there for many years and treat the guests liked people visiting their own home. In addition to this wonderful feeling, we had comfortable beds (pillows were awful), good food, beautiful beach, plentiful cold and delicious drinks (especially the mojitos)! Could not have asked for more. There were several folks there with younger children who seemed to be having a great time with the entertainment team as well! We had two minor issues with our room that were dealt with immediately and professionally by the folks at reception who were also most helpful in getting us a taxi when we needed in and helping me to try track down a lost item. Live entertainment in the evenings in the form of bands with dancing and then shows were great. In all, there is NOTHING I would change about this trip!! I am already planning my next visit which cannot come soon enough!", "user": "Finnmac66", "date": "August 10, 2011", "id": 116544622}, {"rating": 5.0, "title": "Honestly, a great place.", "text": "My family and I travelled to this hotel for 10 days at the end of July. Honestly, people who pick and pick and complain will do so no matter what. This was our first trip to Cuba and we absolutely LOVED it. We have been to many Carribean Islands and this one didn't disappoint one bit.", "user": "natx66", "date": "August 5, 2011", "id": 116314848}, {"rating": 3.0, "title": "Have been to better", "text": "The Staff:", "user": "CubaFreak69", "date": "July 28, 2011", "id": 115907642}, {"rating": 4.0, "title": "As Expected", "text": "Cannot say enough about the wonderful amazing staff at Playa Alameda. They are like one big family and treat you as such. They appreciate anything you give them as far as gifts and tips and please do tip...they rely on it so much to live. Everything is done graciously and with a smile and I cannot think of one staff member who didn't treat us with the utmost care....respect is a two way street and if you expect it, give it. Too many tourists there (very international, we met people from 15 different countries and not one American). These people can speak up to 5 languages!!! To Tania, Wendy, Osvaldo, Frank Ernesto...you are all one of a kind! Bring stuff for them, they really need it.", "user": "TiggerPEI_Canada", "date": "July 28, 2011", "id": 115891404}, {"rating": 4.0, "title": "Below Expectations", "text": "The Beach:", "user": "becker91", "date": "July 21, 2011", "id": 115626548}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Reading some negative reviews makes you question if they have stayed at the same hotel. I have stayed at the Iberostar Playa Alameda the week of October 10th.", "title": "exceptional service", "helpfulness": 15, "user": "SAMANABahiaprincipe", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119811357}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "- The staff is amazing you get exceptional service wether you tip or not.", "title": "NOT A 4****", "helpfulness": 6, "user": "Giovanna M", "date": "October 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 119512572}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "- Staff will go out of their way to make your stay as comfortable as possible by resolving anything you ask for.", "title": "Is your cup half full or half empty?", "helpfulness": 16, "user": "Vacationner", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119368457}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "-E-mailed room request & got exactly what asked for with ocean view.", "title": "The ONE!!!!", "helpfulness": 35, "user": "CubaJunkie0913", "date": "October 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119188264}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "-Resort is not huge and rooms very quite seem soundproof.", "title": "Excellenté", "helpfulness": 6, "user": "Audy36", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119114078}], "location": {"country": "Caribbean"}, "stars": 4.5, "variance": {"poor": 114, "average": 212, "very good": 589, "terrible": 85, "excellent": 529}, "aka": "Iberostar Playa Alameda", "slim_ranking": 0.322033898305, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Located on a beautiful stretch of Varadero Beach surrounded by tropical gardens. Elegant atmosphere. Wide range of gastronomy. Varied entertainment programme. Golf course nearby."}