{"user_rating": 4.5, "review_count": 522, "name": "Iberostar Grand Hotel Trinidad", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "At the time we went there was a festival directly across the square from our room. Very loud music until gone midnight then the drunks singing until 2 to 3 am. Check for this as some people may want it and others (me) may find it too much for an entire stay. We did get out and dance in the streets on two nights but after long days we also wanted some rest. So some rooms had good views over the square with accompanying noise and the back rooms had no views at all but were quieter.", "title": "Watch for the Festival", "helpfulness": 2, "user": "Globe-spanner", "date": "January 27, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 94553418}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The lobby area was quite nice with a poor games room and a very slow internet service. There were only 2 floors above the ground floor so quite a small place.", "title": "Great hotel", "user": "Dutch1505", "date": "January 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 91266765}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Breakfast was better than average but not quite as good as the Parque Central and dinner was ok but nothing special. We had an option of paying for dinner in the UK for £17.50 which was a good deal as locally it is 35CUC s. The once I ate out, up the hill to the left side of the church, I got sick. This was a pity as I was then in bed for 2 days and did not get chance to eat at the Musica place.", "title": "Excellent, but pack some ear plugs", "helpfulness": 2, "user": "KentManKent", "date": "December 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 90314072}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The staff were variable. Sometimes they did not seem to care and other times they went above and beyond the call of duty.", "title": "home, while not at home", "user": "winstonsolo", "date": "November 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 88327738}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "This is rated as the best hotel in Trinidad as it is really the only decent hotel. Other non locals staying at cheap casa particulars were often coming round for rooms but were put of by the price.", "title": "Beautiful hotel", "user": "Watson75", "date": "November 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87314313}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I found this is the only decent place for stay in the old town Trinidad, it's an oasis. Hotel beautiful, clean. Staff good. Room spacious and clean. My room is facing the Square and I found there were always several people gathering and chatting at the hotel entrance and the Square throughout the night. There are two desk top computers on the lobby floor and you can use it for free though the speed is very slow. There is a shop at the corner opposite where you can buy bottled water. The only rather negative comment is the buffet breakfast which is not fab. Bread is dry and not fresh.", "title": "Oasis and the Only Choice in Trinidad", "helpfulness": 1, "user": "MissHK2009", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 83265466}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Trinidad is a small old town and you can walk to everything. But with your suitcases and the stony streets, you'd better take a ride to the Viazul bus station nearby for heading to other cities. There are always taxis or rickshaws at the hotel entrance, CUC2 or 3 will do.", "title": "Fantastic hotel!", "helpfulness": 1, "user": "Zongen", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77827220}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "We stayed for 3 nights and it was great! Fantastic, spacious room, good airco, great bed, clean, large bathroom. Dinner at the hotel restaurant was great too. Buffet first course, then served main course, buffet after course.", "title": "I can see why people recommend this hotel", "helpfulness": 1, "user": "mlansom", "date": "August 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75462869}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The hotel is not cheap but really worth to book it! Parking in front of the hotel. Note: there is a \"clever\" Cuban guy who wants to earn some money, don't do that. If you stay in the hotel you can park in front of it.", "title": "lovely place", "helpfulness": 1, "user": "emmapony", "date": "August 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75017071}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "With improved transport links Trinidad is now more easily accessible from Havana - though still a very long drive from on side of the island to the other. But the town and the Iberostar made the journey worth it. Not many rooms, but the one I had was beautifully appointed - and my travel companions said the same. The staff were extremely efficient and the food, though limited (this is Cuba after all) was exceptional. Trinidad is a beautiful old town with a great nightlife.", "title": "Nice hotel in a great location", "helpfulness": 2, "user": "katejldn", "date": "August 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 73271506}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Cannot fault this hotel, Even when there was a blackout in trinidad this hotel was the only place in town with power. Great town, Great hotel. The only fault is no swimming pool.", "title": "Opulent", "helpfulness": 1, "user": "kingofchi", "date": "March 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58963229}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed here for 2 nights and I can only recommend staying there unless you prefer a casa particulares.", "title": "Splendid hotel in good location, excellent service", "helpfulness": 1, "user": "JayT_UK75", "date": "March 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58934399}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The hotel building is an architectural, our room's terrace overlooked the square and it was a treat to look out on and relax with daily life buzzing below. The room was clean, always nicely decorated and kept squeak clean by the room service.", "title": "Grand indeed but not very Cuban", "user": "priscillaBath", "date": "March 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 57801186}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The buffet breakfast had a reasonable choice taking into account Cuban standards, my wife also very much enjoyed the freshly made omelettes.", "title": "Great hotel - but some rooms very noisy", "helpfulness": 1, "user": "JM49", "date": "March 4, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 57734734}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Reception staff and the overall service is excellent, we even got a nice and well stocked breakfast box given on the way back to Havana as we had to leave before normal breakfast hours.", "title": "If I had onlly known!", "helpfulness": 1, "user": "EJGMIA", "date": "March 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 1.0}, "id": 57624049}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We stayed at this hotel for 3 nights as part of a twin centre holiday we arrived on the 21st May, we had a fab time in Trinidad and would love to go back and stay in this hotel, It was lovely very clean, room was great overlooking the square and it was fab looking out and watching the world go by. We ate in the hotel 1 night and the food was very good. All the staff were very good at the hotel very friendly and helpful. If you stay here you will have a great holiday. Trinidad itself was great plenty of places to eat lots of music and lots of dancing and we felt very safe the whole time we were there.", "title": "Oh what a Grand Hotel", "user": "salsa50", "date": "July 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70522734}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We went to Cuba back in December. Stopping in Havana then Trinidad and then on to Santa Cruz Del Norte. We stayed at NH Parque Central in Havana which we loved with the swimming pool on the roof but when we arrived at the Iberostar in Trinidad we fell in love with our room. We had a large balcony overlooking the square and it was great to watch people getting on with their lifes. Lots to do, beaches are beautiful and you can get a taxi there (not too expensive). Many places to eat - you just need to know where. The lighting at night time is not great in Trinidad and did feel a bit worried but nothing happened. Took a walk around town and the markets and love it. We thought it was better than Havana!", "title": "Beautiful hotel in a charming town", "helpfulness": 3, "user": "sasingh", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 64714377}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Fabulous hotel. We were driving around Cuba and decided that we'd spend the night in Trinidad (originally planned to drive to Havana that evening but, wisely, decided that it was too far to go when were were still in Trinidad late afternoon/early evening). This was the first hotel we found and decided to splurge (this is NOT a cheap hotel to stay in) - well, the girlfriend at the time decided that I should splurge!", "title": "5 Star Luxury", "helpfulness": 4, "user": "the_curl", "date": "April 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62330228}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "It was certainly worth the money, the whole hotel was immaculate and by far in better condition than any other building that we saw anywhere in Cuba! Staff were friendly and helpful and the rooms and public areas were certainly up to a five star standard (and would be anywhere in the world).", "title": "Luxurious, but a great location too. Is it really very Cuban though?", "helpfulness": 2, "user": "CaptainBlackmore", "date": "April 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 61810650}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "Would definitely recommend this hotel to anyone who's not on a strict budget!", "title": "Get Ready For A Pleasant Surprise", "helpfulness": 1, "user": "Kevin3638", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 59364021}], "location": {"country": "Caribbean"}, "stars": 5, "variance": {"poor": 5, "average": 25, "very good": 110, "terrible": 6, "excellent": 376}, "aka": "Iberostar Trinidad", "slim_ranking": 0.1, "description": "The Grand Hotel Trinidad de Cuba is a 5-star hotel in the heart of Trinidad, a gorgeous town characterised by its elegant colonial architecture.The Iberostar Grand Hotel is perfect for couples and adults. A lower age limit of 15 has been set to ensure total rest and relaxation for our guests.The Grand Hotel guarantees visitors a truly extraordinary holiday, at any time of the year, getting to know the culture, the cuisine and the people.The Iberostar Grand Trinidad strives to bring together the great interest that there is in all things Cuban and a wide range of top of the range leisure."}