{"user_rating": 4.5, "review_count": 2988, "name": "Iberostar Paraiso Lindo", "reviews": [{"rating": 4.0, "title": "Just got back from Iberostar Pariaso Lindo - read my review", "text": "We just returned from the Iberostar Pariaso Lindo last evening, thought I would add to the helpful reviews posted on the hotel and the area of Playa Del Carmen. Thought I would mention that we are b/w ages of 28 & 29. This is a family resort, but there were a variety of age ranges, couples of all ages, parents with young children and teen agers.", "helpfulness": 42, "user": "gucci913", "date": "April 10, 2005", "id": 3348510}, {"rating": 4.0, "title": "Teenagers will love it", "text": "The Hotel:", "helpfulness": 19, "user": "A TripAdvisor user", "date": "April 4, 2005", "id": 3329366}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "The hotel (Lindo) was absolutely beautiful. And to those of you who wrote the pictures do not do it justice, you are absolutely correct. The pools and landscaping were breath taking. The lobby with marble floors and ambiance unmaginable. We were quite pleased with the property. It exceeded my expectations. The rooms were impecable, clean and simple but yet an elegance with Mexican flare. And yes the beds were hard, but I had no problem passing out each night and did not have any back problems. The housekeeping was awesome. We had a new animal made out of towels with fresh flowers each day. We did walk to the Del Mar and the Beach which were also lovely, but you could see they were not as new, but the landscaping was more lush, and tropical birds did live on the property, but for the extra money, I prefered eating inside air conditioning rooms. I did not see the Maya, but it was right next door. I am sure it was beautiful, but you do get the same for your buck at the Lindo. The gym was a nice size, but the lack of air conditioning is silly, and almost passed out one day trying to work out around 5pm. But this did not have a negative impact on my vacation. The club at the Del Mar is really for teen agers. Perhaps it was spring break for high school and it is not like that all the time, but it was a great place for kids in that age bracket. The ocean and beach were awesome..beautiful with soft white sand. The waves are big, but did not have any red flags the few times we made it there.", "title": "Wow! The Only Thing That Wasn't Great Was", "helpfulness": 16, "user": "filet", "date": "April 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3325886}, {"rating": 5.0, "title": "Loved the Iberostar!", "text": "The Staff:", "helpfulness": 60, "user": "winchesterdoc", "date": "March 30, 2005", "id": 3314196}, {"rating": 5.0, "title": "iberostar lindo", "text": "The staff at the Lindo were great. Everyone was so friendly and pleasant. They are so organized, and will wait on you jand and foot. I have nothing but great things to say about them. We only made it to one evening show, but found it to be entertaining, they put a lot of effort into preparing for them and getting people involved. It is just not really our idea of nightly entertainment. We traveled with GWV, Martin is a great rep, he was helpful, and accomodating. And visit Edwardo at the lobby bar, he is the man!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "March 30, 2005", "id": 3311746}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Our group of 19 just returned from the Iberostar Paraiso Lindo 9/17-9/24", "title": "Iberostar great for groups!", "helpfulness": 22, "user": "jojosgranny", "date": "September 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3936843}, {"rating": 5.0, "title": "The best honeymoon ever!", "text": "We had spent a week at the Del-Mar a year ago and were excited about returning. On arrival, we were all upgraded to the Lindo and are already talking about booking it next year! The Lindo has more a/c common areas- restaraunts and bars. You are not limited to number of specialty restaurant reservations. Room service is available 24/7 (albeit with a limited menu) Bars have top shelf alcohol available. Pools, if you can believe it, are more elaborate and extensive and include a \"lazy river\" and \"wave pool\" Shaded palapas are available in abundance and you may choose to chill out in a quiet area of the pool or join the activities in the main pool as we did! Water aerobics, games, songs and wonderful staff made this vacation even more fun! Food at Cajun restaurant was exceptional- good in Italian, Seafood and Japanese So -So in Steakhouse! Good variety in morning and lunch buffets. Several enjoyed Spa services and poolside massages Shows were almost cruise line quality with audience participation. Rooms are very nice and maid service touches of flowers and towel animals a nice touch. Staff is constantly cleaning and working to maintain the huge resort and grounds but are incredibly friendly and attentive. Special thanks to Keno and Juan at the pool bar Denise in the Lobby bar Maris, Jane, Sara and the group at the Main Pool We are still singing! Apple does a great job in transfers and follow-up I didn't want to leave and can't wait to go back!!!", "helpfulness": 28, "user": "A TripAdvisor user", "date": "September 23, 2005", "id": 3934075}, {"rating": 5.0, "title": "Paraiso Lindo and anything else!", "text": "My new husband and I stayed at the Lindo from Aug. 29, 2005 through September 5, 2005 on our honeymoon. It was above and beyond our expectations and we couldn't have chosen a better place to spend our honeymoon. We took 125 pictures while we were there just so we didn't forget a single thing.", "helpfulness": 40, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3932156}, {"rating": 5.0, "title": "Loved It!!!", "text": "When we arrived in the Cancun airport, customs was a breeze. We went straight through with out a problem or a line. We booked our honeymoon through Liberty Travel and we were taken care of by Olympus Tours when we arrived in Mexico. We waited for a total of 10 minutes for another couple to get in the air conditioned van with us and we were off to the Lindo. When we arrived at the Lindo, we checked in in about 5 minutes and they gave us a starter drink right there. We were then taken by golf cart to our building (#54) and the driver even gave us an idea of how the place was set up. They took our bags up to our room for us and we were all set to start our vacation.", "helpfulness": 29, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3931540}, {"rating": 3.0, "title": "Average quality \"All inclusive\"", "text": "Everything is immaculately clean. It seems like there are about 2000 people working there to make sure it is like that too. There is always someone cleaning or fixing or tidying up, but they will all stop what they are doing to give you and \"Hola\" and a smile and then continue. We made all of our reservations with our building concierge the first night and that was less thing to worry about.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "September 16, 2005", "id": 3910252}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My husband and I and two children (ages 6 and 10), recently returned from the Lindo. All the reviews you read about this place are pretty accurate. The grounds are beautiful, well-maintained and lush. Pools are fun and were a little cool after it had rained one night, otherwise they were refreshing. The kids loved the wave pool and lazy river (which is very lazy!). Floats are provided, but sometimes you have to wait for one. Bring your own as we did, and have them blown up at the towel bar for free. Speaking of pool towels! One day after the lazy river, we got out to find that someone had taken 3 of our towels. We needed to go to the front desk to report it and then they gave us free towel replacement cards (otherwise they say it's a $10. per card replacement fee). It seemed as if we were not the only ones this happened to. So keep any eye on your towels!", "title": "Had a great time!", "helpfulness": 16, "user": "travelreviewer", "date": "April 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7331242, "likes": {"liked": "— Friendly staff and beautiful location.", "disliked": "— Rocky beach and towel takers!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Beach was nice, but a little too rocky for me. Because the water was very rough at the beginning of the week, it was hard to see the rocks, and we got pretty banged up on them. By the end of the week, the water was very calm and it was much easier to navigate around the rocks. Don't get me wrong, we still had a great time enjoying the sand and surf. We were even able to do some snorkeling by the rocks/reefs and we saw lots of cool fish. Bring lots of sunscreen! We used up all we brought with us and had to buy more at the resort which was about $22.USD for one bottle. If your kids want beach toys, you can borrow them for free from the towel bar, no need to pack your own.", "title": "Great All-Inclusive for families", "helpfulness": 15, "user": "sd28", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7303089, "likes": {"liked": "— Beach and food", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Rooms were nice. We were in building 51 facing the pool. Location was great, very close to the pool, beach, and some restaurants. We even had a jacuzzi on our balcony which the kids loved. Housekeeping does a great job keeping up with the rooms, and they do deserve a tip for their hard work. We did have some minor maintanance problems in our room which were quickly addressed and taken care of. In the showers is always a supply of shampoo and body wash, so if you don't want to pack them you don't have to. Hairdryers are terrible so bring your own if you need one.", "title": "A great family beach vacation!", "helpfulness": 14, "user": "chicagomark", "date": "April 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7291480}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "As far as food goes, we all were able to find something we liked at each meal. Both buffets at the Lindo were fine for breakfast, the one at the Italian is a little bigger and nicer, but food was about the same. We did eat at some of the restaurants and enjoyed most of them. We ate at the steak house twice and both times it was very good. We liked the Japanese and Mexican a lot and the Cajun and seafood were okay. We did tip at all restaurants and bars because the service was very good and the staff works very hard to please. Drinks were good as well, much better than when we went to the Iberostar in Punta Cana last year. We thought the drinks at the Lindo lobby bar were the best by far. I know people mention how good the ice cream is and beleve it or not it is amazing, the best ice cream I've ever had. There's an ice cream bar above the pool bar and there's one at the commercial center. You've got to try it!", "title": "No problems, but a little pricey", "helpfulness": 10, "user": "lmcg40", "date": "April 7, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7290463, "likes": {"liked": "— The food and the beach", "disliked": "— Price, given that there wasn't a real difference between Lindo and other hotels we've stayed at"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Shows at night were very good , especially the Las Vegas and Broadway shows. We never made it to any of the kids shows, but heard other kids really enjoyed them. Star friends are great, very entertaining and friendly. I did aqua aerobics and step aerobics on the beach with Guga, one of the star friends who is great!", "title": "Perfect for the Whole Family", "helpfulness": 9, "user": "Juja80301", "date": "April 5, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7285071, "likes": {"liked": "— Beautiful grounds and something for everyone to do.", "disliked": "— Some of the dinner restaurants were pretty average."}}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "I'll jump to the punchline, because once I figured it out a whole lot of other things became clearer to me. As we were checking out, we noted a phone charge for $5.00 for an in-country 800 number (confirming our return flight) -- our concierge said there was no charge for in-country toll free. When we questioned the charge, the clerk at the front desk vehemently maintained that the concierge was wrong and that the charge was legitimate. When I requested she remove the charge because we were given incorrect information by a hotel staff member, the front desk clerk said she would, but that the employee in question would be \"charged for their mistake\". $5US is a lot of money, I suspect, to a concierge in a Riviera Maya hotel -- so we backed off, but I realized that what I had been observing in the hotel staff all week -- very little hospitality or spontaneous friendliness, seldom making eye contact, ignoring guests waiting to be seated or hoping for a refill on coffee in the buffet restaurants while the staff cleared tables and prepped new placesettings, etc., etc. -- was truly the long result of a culture of fear.", "title": "Disappointing experience -- a triumph in yield management over hospitality", "helpfulness": 22, "user": "DrewKnightWV", "date": "September 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 139518889}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "For context: we've stayed in probably a dozen different resorts and hotels in the Riviera Maya, Cancun, and Cozumel over the last 20 years. We've always had great experiences, and have always felt like the warmth and hospitality we found was the very best part of visiting Mexico. This is what was most evidently lacking during our week-long stay -- and in retrospect, it really soured the experience, especially for my wife and me. By way of contrast, last year, we stayed at a less-expensive property -- the Grand Sunset Princess -- for considerably less money, and arguably had a much better time. I think a lot of that boiled down to the lack of hospitality we experienced at almost every turn. Shame on the Iberostar management, plain and simple.", "title": "Lindo - Huge Resort - Long Review", "helpfulness": 34, "user": "ScottfromLV", "date": "September 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 139487841}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "ROOMS AND GROUNDS: The differences in physical plant were very slight. Iberostar Pariaso Lindo rooms are virtually indistinguishable from other higher-end resorts in the Riviera Maya; the common spaces and restaurants are marginally nicer than the Grand Sunset Princess. Our room -- an upgrade to a Junior Suite -- had the typical marble floors, two queen beds, and a day-bed made up for a third sleeping area. We were on the third floor of Building 53 (close to the beach area and by the main -- and noisy -- activity pool), with a balcony overlooking the pool area but screened by palm trees. The room was reasonably comfortable, but the air conditioning barely kept up with the 90 degree days and high humidity (other hotels we've stayed at have been similar but typically allowed you a degree of control over room temperature -- the thermostat in the Iberostar rooms doesn't control the temp at all -- it's locked at 23 degrees Celsius). IMPORTANT NOTE: Make absolutely certain the slider to your balcony is shut tight and locked... my daughter opened the door on our first afternoon, closed it, and thought she had locked it -- but the door wasn't quite tight enough and it shut down the AC... we awoke to suffocating heat and humidity in the wee hours of the morning. When I talked to the front desk (I couldn't stand it and walked all the way down to the lobby at 4:30am) the young man on duty essentially shrugged it off and said that that the AC had been out off and on in the lobby too (there's that great service for you). Fortunately, when I talked to the building concierge after she arrived, she suggested I slam the slider because the sensors can be touchy. I did. The system came back on.", "title": "Excellent All-Inclusive for Families with Children!!", "helpfulness": 13, "user": "Klhst20", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139371981}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The grounds at the Iberostar are very nice... but also very typical of the species. Nothing out of the ordinary here. Several people mentioned a lot of walking -- on this account, I'd have to argue. The Lindo and its sister resorts as a whole are big -- going from side to side or beach to the \"mall\" complex is a long way -- but within each resort proper, the distances are pretty manageable, maybe five minutes from Building 53 to the main buffet and lobby complex (the Grand Sunset Princess was more like 7 or 8 minutes of fast walking).", "title": "I would go back!", "helpfulness": 3, "user": "ethniclady", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 139308073}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "THE POOLS: The pools -- which at least in our orbit seemed less numerous than, say, the Grand Sunset Princess -- were typically crowded and noisy, but nicely kept. The Wave Pool (like most wave pools) was somewhat intermittent in operation and not that exciting compared to the real surf that was \"up\" during most of our visit -- but it might be safe and more fun for little kids. The Lazy River? Yeah... torpid is more like it. IF you can find a float (there seemed to be about 10 for the entire resort), it could take you the better part of 40 minutes to drift around. There is just about no measurable current. I think most kids would lose interest before the first bend.", "title": "The Good, the bad, and the ugly", "helpfulness": 16, "user": "ksmoo", "date": "September 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 139204892}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "My wife and I spent several days at the Lindo for a wedding that took place at the resort. Because all the Iberostar Hotels are on the same property, the entire resort is huge. My wife and I typically prefer smaller venues. With that said, the resort grounds/pool areas were nicely kept up. The beach itself was nice and there was plenty of room on it to accommodate everyone. The room was good although the beds were very hard (which is typical at these type of resorts).", "title": "Nice Resort", "helpfulness": 7, "user": "cseanmc", "date": "April 4, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7281216, "likes": {"liked": "— beach and pool were nice, golf course", "disliked": "— too many kids, bed was hard, food wasnt great"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The food itself is just ok. The breakfast buffet was probably the best meal. The lunch and dinner buffets are mediocre. We ate at the Japanese and the French restaurant the other two nights. French restaurant was a pleasant experience as the room was very nice and service was good. It was probably the best meal we had there. The Japanese experience was fun as we sat around a table with a number of other guests and got to meet them. The show the chefs put on there was fun to watch, but again we thought the food was just ok. We did order room service one night and I would not recommend it. By the time our food got there it was cold. We ended not eating much of it.", "title": "Great vacation!", "helpfulness": 5, "user": "NLPColorado", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7279202, "likes": {"liked": "— pools, beautiful grounds", "disliked": "— distance from Playa del Carmen, fighting for pool chairs"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "A couple of us did end up playing golf at the Iberostar Playa Paraiso Golf Club. The course was in excellent shape and it doesn't appear to get much play on it. It was a difficult set up and if the wind is blowing it makes it even tougher. I would highly recommend playing the course.", "title": "Had a Wonderful Wedding at the Iberostar Paraiso Lindo", "helpfulness": 9, "user": "rabidamazon", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7270453, "likes": {"liked": "— Everything!", "disliked": "— The drink are the only thing I can think of."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "My overall assessment is this is a nice resort for families or large groups There were a ton of kids running around and there seemed to be plenty of activities for them. If you want a quiet romantic trip for 2, then I would go somewhere else. We will plan on returning when my kids get older, but would not go back with just my wife.", "title": "5 Stars, Mostly", "helpfulness": 6, "user": "HBL54", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7269795, "likes": {"liked": "— Layout and design of entire resort", "disliked": "— far flung"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We just returned from a week at the Lindo and had a wonderful vacation! The resort is beautiful and the pools are plentiful and refreshing. We took our 2 kids (ages 6 and 3) and they really enjoyed the lazy river and the sports pool (warmest pool of them all). None of the pools were cold as has been mentioned before, in fact they were the perfect temperature for the warm weather. Did have to secure our pool chairs fairly early (before 7am) for the prime locations, otherwise there are plenty of chairs around if you don't care where you are situated. Our favorites restaurants were, in order, the Japanese, the Seafood, the Steakhouse and lastly the Italian (which we thought was only fair at best). The breakfasts at the Italian/Chinese were incredible. Lunch was delicious at the pool restaurants (maya or lindo). Ice cream was creamy and delicious. Only drawback (small one) in my mind is the distance to Playa del Carmen. There is a free bus from the resort, but the morning we went into town at least 20-30 people could not fit and had to wait another hour to go into town. Took 30 minutes with lots of traffic. Otherwise, this is a terrific resort and we are planning on returning next year.", "title": "Already booking our next trip here...", "helpfulness": 6, "user": "liebs04", "date": "March 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7260014, "likes": {"liked": "— The beautiful grounds", "disliked": "— The hard beds"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "The resort is amazing. From the moment you get off the transfer bus you will be totally awestruck at the beauty and attention to detail. I have travelled to many resorts and this one by far has the friendliest staff, the prettiest grounds and the best food.", "title": "Simply Amazing!!!!!", "helpfulness": 29, "user": "Tessamarie", "date": "March 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3288953}, {"rating": 5.0, "title": "Great Resort - Terrible Vacation Wholesaler", "text": "We did not even book a specialty restaurant because we do not like to be on a schedule when we go on a trip since we live by one in our daily lives. The food in the buffet was outstanding and there was such variety. The staff is so freindly and accommodating.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "March 16, 2005", "id": 3277993}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "The beach bar, and the swim up bar are fun!!!! Some people celebrating St. Patrick's Day at the Beach Bar were having a little too much fun but you find that at all resorts. The only negative thing about the drinks are the people who drink too much. When we were there there was a young guy that drank so much that he passed out in the middle of the main pool at the hot tub. It was very difficult to get him back to land and it took a while. Many children and families were looking on in shock. Parents, please remember that the drinking age is 18 in Mexico and although your children may be allowed to drink here they may not be able to control themselves on all that all-inclusive booze. Keep an eye on them and you will be fine. I guess the drinks are not as weak as other past comments have suggested.", "title": "A little taste of paradise..", "helpfulness": 30, "user": "Kitcatatwork", "date": "March 15, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3274767}, {"rating": 5.0, "title": "A must for anyone needing to escape WINTER", "text": "The pool temperature is perfect now. The weather has been really hot and the water warmed up while we were there. It is now perfect. There are also no flies to worry about.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "March 15, 2005", "id": 3274045}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "The beach is excellent. If you want to get away from all the action go down to the Maya area of the resort. It is very quiet down there and private.", "title": "Lindo with young kids", "helpfulness": 19, "user": "monkeysdad", "date": "March 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3273159}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I stayed at the Lindo for a week in October of 2006. We just remembered to write a review while doing our research for an upcomming vacation. So we will spare you a lot of details and just say what a great resort we thought this was. It is the cleanest, most well kept property and although it is enormous when you consider you have the run of the four hotels, it never felt crowded or did we ever have a problem getting a spot on the beach or at a restaurant. We were also impressed with the numbers of specialty restaurants and the fact they have a concierge available at each building where your room is to make reservations anytime of the day.", "title": "Great Beach Resort", "helpfulness": 6, "user": "lpweb", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7252893}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "We have no qualms about recommending the Lindo to others, you will have a good time.", "title": "Wonderful", "helpfulness": 11, "user": "Kristen007", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7218722, "likes": {"liked": "— Everything, it was gorgeous there.", "disliked": "— The pools closed at 6:00"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "22 of us went to the Lindo to celebrate my mother-in-law's 50th birthday. My husband and I brought our two kids, age 3.5 and 1. Before I left I read all the reviews and not all were good. I was a little let down by that. But when I got there it was amazing! The place is big, so yes, it does take some walking to get around. The lobby was about seven minutes away, but how often are you in the lobby? The beach was maybe two minutes away and was gorgeous. Lots of beach chairs ensured that everyone had a place to sit. The water was warm, and yes, the beach was rocky in a few places. But you could see them under the water, and they were huge, almost 10 foot long pieces of coral. There was a sand bar out at the end of the swimming area which was perfect to stand on and body surf from. I also read a complaint that the pool water was too cold. Well, when it's that hot out it's nice getting into a cool pool. It wasn't cold, just cool. But once you were in it was fine. The staff was amazing, always there to refill your drink, to get you whatever you need, everything. My kids were too young for the kids group but the kids show was on every night at 8 and everyone enjoyed it. Younger kids are more than welcome to get up on stage and participate. We ate at a specialty restaurant every night and the food was amazing. Eating at the steakhouse was odd because (I'm from Calgary) the inside looks like a log cabin, there's country music playing, you're eating a steak, and look out the \"cabin\" window to palm trees and blue skies. Very funny! This was the perfect place to go for all age groups (1-7, 17-29, 43-50, 72-79). The rooms were gorgeous and air conditioned, were cleaned very well every day, and we'd always have atowel folded up into some neat shape (a mermaid, an octopus, a baby, a swan, etc.) I recommend this hotel absolutely to any traveller from anywhere.", "title": "amazing place to be", "helpfulness": 8, "user": "LynneLabelle", "date": "March 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7217834, "likes": {"liked": "— the pools, the entertaiment"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "Me and my husband arrived at the Lindo Feb 22 to March 3. I have nothing but good to say about this resort, To anybody who is looking for somewhere to relax , have fun or just to spend time with loved ones. It's definately the place. To all of you who would have anything bad to say, call your doctor. The staff is always ready to please you. The entertainment staff is awesome, make sure to meet Isreal , The shows are entertaining. There was lots of kids but you don't hear, no whining there are having fun, it's actually nice to see. We booked a junior suite, the maids always keeped it clean with towel animals and bubble baths. wow. I will be back for sure.", "title": "Fabulous!", "helpfulness": 16, "user": "beach-toronto", "date": "March 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7215201, "likes": {"liked": "— Facilities", "disliked": "— Noise from some late night partiers"}}, {"rating": 5.0, "title": "Perfect family all-inclusive!", "text": "My husband, kids (13 and 15) and I stayed at the Iberostar Lindo from March 11 to 18. We had a wonderful vacation. Our last trip was to Disney 6 years ago so we have nothing to compare this to but I would highly recommend this resort.", "helpfulness": 15, "user": "welovethemayan", "date": "March 17, 2007", "id": 7173622}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "I went to Mexico alone to relax, and I must say I selected the perfect place to do that. As a female on vacation in a place that I have never been before I never felt unsafe or uneasy.", "title": "Loved The Place", "helpfulness": 27, "user": "brown_coffey", "date": "September 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3907970}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The Resort: When we drove up, I thought this is an awesome place. The landscaping and rooms are great. They are maintained perfectly. I found the staff from housekeeping to the bartenders to be friendly and willing to assist you with anything you desire.", "title": "Absolutely Awesome", "helpfulness": 21, "user": "cornishgoodies", "date": "September 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3906289}, {"rating": 5.0, "title": "One Word: Amazing", "text": "Food: I have been told by others that I am a picky eater....rumors. Well if that is true than the Lindo has scored highly here as well. I have to say that I had no problems finding something to eat and enjoy from both the breakfast and lunch buffets. I will have to say that the service at the buffet for getting drinks could have been better.", "helpfulness": 30, "user": "A TripAdvisor user", "date": "September 14, 2005", "id": 3904150}, {"rating": 5.0, "title": "Paradise Found", "text": "For dinner I made reservations at the available restaurants every night I was there. I was so impressed with both the food and the service at the seafood and gourmet restaurants that I tipped the waiters, even though tips are included in the price. The food and service were on a 5 star restaurant level, at no extra cost to me.", "helpfulness": 25, "user": "A TripAdvisor user", "date": "September 12, 2005", "id": 3896767}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "Activities: If you cannot find something to do, or nothing at all in my case, you are never satisfied. They have the beach, pool, activities, free shuttle to Playa de Carman, and activities for outside the resort.", "title": "Excellent", "helpfulness": 11, "user": "DonnyQ", "date": "September 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3896193}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "My stay at the Iberostar Paraiso Lindo was more than fantastic and exceeded my expectations. Everything my group and I ate and drank was included and the staff, knowing that it is an all-inclusive resort, pushed all of it on us. I don't normally have tequila at 9AM, but when offered after the realization of the fact that I was on vacation, I gladly accepted.", "title": "All-inclusive means all-inclusive, just make sure to hide your valuables.", "helpfulness": 6, "user": "Travel_Scanner", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 138807803}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I took this trip to be with my brother and his newly pronounced wife at their destination wedding. The wedding ceremony was nicely laid out on the beach near the edge of the resort so there wasn't much traffic. The reception was hosted at the Italian restaurant which had a wonderfully laid out buffet. We were supposed to dance on the beach after dinner, but with Tropical Storm Ernesto blowing seaweed and such up on to the shore, the staff suggested that we have it at a different location so they set us up in a gazeebo half-bordered by one of the pools. It was a beautiful venue and we had so much fun. The Iberostar set up the music equipment for the ceremony and reception and my brother gave them his iPod to play the music that they wanted. The entire day went great and we had so much fun.", "title": "One of the best all-inclusive resorts visited so far!", "helpfulness": 1, "user": "Ian_Trish", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138798929}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Other things of which I took advantage...", "title": "Cancun 5 Star Golf Course", "user": "Mark T", "date": "August 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138774051}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Watching the Star Friends: I enjoyed their company as well as the stage shows in which they performed. They made the whole trip fun with things such as pool side games and impromtu salsa dance lessons.", "title": "Iberostar Paraiso Lindo=AWESOME!!! (Best value, service, relaxation for your money)", "helpfulness": 3, "user": "TTU2014", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138627829}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Room Service: A little slow to respond (so plan ahead), but the food was delicious AND INCLUDED! I recommend the tacos.", "title": "fantastic long awaited vacation!", "helpfulness": 10, "user": "LorenaD_1087", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138572327}, {"rating": 5.0, "title": "The best! ", "text": "I just got back from staying at this hotel yesterday. I was extremely pleased. It is defenitly worth the money. The activites are great and there are many of them. The dining is OK. The only restaurant that was bad was the chinese. I would suggest going to the buffets most nights. The hotel is beautiful and huge. The room's are the cleanest I have ever stayed in. The people are very nice also. There are many pools, a lazy river, a wave pool, a swim up bar and many more. The lobby bar is AMAZING! And if your looking for some cheap jewelery, go to the flea market, they have nice things that are overpriced, but you just have to haggle. I also went to XCaret. I did not enjoy it mostly because of the extreme heat, so I had to leave early. I also went on the ATV/zipline/cave swimming tour. It was very tiring so I suggest you don't go on it unless you are very athletic and like hiking. Another bad part was when my ATV broke down in the middle of the desert. I had no one to help me for about 30 minutes. The ATV stalled about 14 times going there and back. I was so mad with the people that I made them take me back in the rescue truck..ha! But back to the hotel, it was great, so make that your next vacation!", "helpfulness": 22, "user": "A TripAdvisor user", "date": "September 1, 2005", "id": 3837393}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We're 2 active families with teens from NYC just back from the lindo. We've been going to all inclusives in tropical destinations for many years now. This is our 3rd trip to Mayan Riviera, we love it for the great beaches and magnificent natural wonders and fun excursions. Here's our impressions:", "title": "The Lindo with Teenagers", "helpfulness": 27, "user": "margib", "date": "August 31, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3834787}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Grounds - Magnificent, beautiful everywhere you go, classy touches like antique looking handcarved furniture, etc.", "title": "Best Vacation", "helpfulness": 22, "user": "zina1218", "date": "August 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3811804}, {"rating": 5.0, "title": "We got what we asked for!", "text": "Rooms - Great, spacious, clean. Balcony with table & chair and clothes dryer. We requested bldg. 53 for it's central location & it was perfect", "helpfulness": 15, "user": "A TripAdvisor user", "date": "August 26, 2005", "id": 3809089}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "Pool - Spectacular! This is an enormous series of pools that run thru the center of the resort. Each pool has a different feature. This must run at least a 1/4 mile. There's plenty of shade and lots of loungers. This is both a positive and negative feature. Early in the day and in the evening it's beautiful. In the middle of the day it's pretty hectic with kids and you must pass thru it to go anywhere on the resort.", "title": "Fabulous Wedding at the Lindo", "helpfulness": 9, "user": "jacksocm", "date": "August 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3805999}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "WOW! Out of the six times that I have been to Mexico in the past, no trip has ever stood out more than this year! I travelled to this hotel with my family and another family of four for 7 nights. The resort is enormous and beautiful in every aspect. As soon as we stepped into the hotel, we were greeted and served immediately. We checked in very quickly, had our luggage brought to the room, and decided to explore the hotel to find out what we were in for. I still cannot get over the size of this place – it is truly amazing!", "title": "Counting down the days to go back!", "helpfulness": 67, "user": "lexi17", "date": "March 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3306412}, {"rating": 5.0, "title": "Fabulous family vacation", "text": "Everyday we stayed around the pool and beach and participated in the many activities available to us. There is always something going on during the day for children, adolescents, and adults. Whether it is pool activities, aerobics, beach volleyball, dancing lessons, soccer, bikini contests…these people are always trying to find a way to entertain you! The beach also has many activities, including parasailing, sailing, banana boat rides and more.", "helpfulness": 37, "user": "Brutusd1136", "date": "March 27, 2005", "id": 3305518}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "During the day at the pool, employees walk around with parrots or a monkey and you can take a picture with the animals. Also, there are massages and hair braiding available, as well as other tourist best-sellers. Although some are a bit pricey, nothing can compare to a relaxing hour massage on the beach. The resort also has a dance (Dale Pa’lla), which is very fun and the staff all sing and dance for you, as well as gets you to dance with them. There is also a kids club during the day for the very young children. There is a mix of all ages at this hotel; the most of all were families with children.", "title": "Hats off to the Staff", "helpfulness": 24, "user": "wwwhhhooooo", "date": "March 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3303619}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "The weather was great. Very hot everyday - do NOT forget sunscreen. The pool is very refreshing and extremely large. There is plenty of room at the pool for seating, as well as at the beach. The beach is beautiful – white sands and crystal blue waters.", "title": "Greatest Vacation Ever", "helpfulness": 20, "user": "kjmdkmdkdd", "date": "March 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3301391}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "There are complementary shuttle buses to Playa Del Carmen every day at specific times. It’s very nice to walk down the street there (5th avenue) and shop, dine, or party. As well, vendors are available to you at the hotel every few days, which is convenient. There are shops in the hotel, as well as pool tables, which we played every night before the show. You will never be bored at this hotel!", "title": "Great Vacation Resort...", "helpfulness": 35, "user": "MAnth87869", "date": "March 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3299698}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "My wife and I spent the week of 3-12 thru 3-19 at the Lindo. We were with three other couples, and all enjoyed our week there. First let me address some of the complaints you may have heard of. Cold water in the pool----it was a little brisk untill you got used to it, no worse than a swimming pool in michigan in july. It actually warmed up by the end of the week. Slow service at the pool bar----- I never had a drink have a chance to run out. Of course it helps to tip the bartender. I only tip once a day at the pool. First drink I give em twenty. Hey i'm on vacation and I don't want to wait. Believe me it works! Restocking the room fridge----- No problem, I left a note requesting 5 beers and three cokes--along with 4 dollars. When I returned to my room there were 10 beers, 6 cokes, 6 waters, and enough other assorted sodas that the door barely closed. It remained that way all week. Dinner reservations-----our biggest complaint! Book early folks. I think the problem may be people who book several restaurants for the same evening and then decide at the last minute which on they want go to. Every night we saw at least a third of the restaurant empty. We ate at the Italian, French (gourmet) Japanese and all were good. Bugs-----didn't notice very many.", "title": "too short of a stay in paradise", "helpfulness": 30, "user": "jmrcricket", "date": "March 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3298381}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "Some things you don't want to miss--- lunch at the beach. On one or two days of the week they will have a cookout on the beach. They will have the biggest frying pan you have ever seen. Takes four men to lift it. Bring your camera for this one. They will even let you assist. And the food is awsome! ( bring a nutcracker for the crab claws). Get up early and take a walk to see the peacocks. Great photo opp. And last but not least, bring a couple of insulated cups ( 32 oz ) and a soft sided cooler ( the pool and beach bars don't open untill 10 or 11 ) Be prepared to meet some great people. Jaine-- pool bingo Juan--- pool bartender. Paul and Rita from canada hello! And the newly wed couple from Wi. MIchigan back at ya.", "title": "All 22 of us going back next year!", "helpfulness": 23, "user": "IllinoisSusieq", "date": "March 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3294038}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "We took a group of 22 people to the Iberostar Lindo and had a wonderful time! We will go back next year. Everyone in our group from start to finish had a great time which is how we decided to go back next year.", "title": "Honeymoon at the Lindo", "helpfulness": 20, "user": "MrsChase", "date": "March 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3294023}, {"rating": 4.0, "title": "Wonderful March Break", "text": "First, we arrived in Cancun on Feb. 26 coming from Chicago we had a great flight on ATA. We went through Fun Jet which they were awsome, I recommend them highly. Our first day was fun-filled. My boyfriend and I set our reservations for supper up that first night, also. I would do this on the first night you arrive, our reservations were at 6:30 and 7:00 for most but for the other people in our group that waited to set up their reservations till later, had to wait until 8:30-9:00 to eat. The first night we ate at the buffet which was located by the pool, we had lobster and shrimp and the most delicous desserts ever.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 21, 2005", "id": 3292139}, {"rating": 5.0, "title": "Paradise Found!!!!!", "text": "The second day we headed to the pool, which is a little hairy. we stayed in complex 50(?) which is the closest to the front lobby, closest to the restaurants, and closest to the theater, but the most far from the beach. You can not see the beach from complex. There is a 500 yard or so of jungle that seperates the pool from the beach. The walk from the pool to the beach consists of walking on a wooden path(unlit) of course. You just keep walking until you land on sand. The beach was very nice but this is a very family oriented resort. Just as you lathered up in sun tan oil you have a kid running from the ocean kicking up sand on you. I have children myself so it didn't bother me that much but I could see that others were less impressed.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "March 20, 2005", "id": 3290015}, {"rating": 5.0, "title": "This place is surly \"Paraíso!\"", "text": "My family and I stayed at the Lindo Feb 21 - 28. This was the nicest resort I have ever stayed, and I have stayed all over the Caribbean too. I traveled with my family, my mom and dad, my aunt and uncle, cousin, grandmother and her friend. I'm currently a high school senior. The flight down was easy enough. Just watch yourself at Cancún Airport. Too many timeshare people. Don't talk to them. It's a short 25 - 35 minute ride from the airport the the resort. When checking in, you are greeted with a cool, refreshing drink. My family was fortunate enough to be upgraded to the Honeymoon suites in building 50. Building 50 is right on the beach. It is quite a hike to the restaurants and the shopping center, but it's not too bad because the amount that you eat, you are probably going to have to walk it off. The restaurants were very good. There is a large variety to choose from. I'm sure there is something for even the pickyist eaters out there. We ate at the Mexican, Seafood twice, the Steakhouse, the Gourmet, the Japanese, and the buffet at the Del Mar. The lobby bar, El Aquario is a very nice setting for an after dinner drink. Aleli and Cecilia are the most amazing bar maids. The entertainment is also great. From activities during the day, like shooting, bingo, and salsa lessons, to the shows at night, to the disco. The adult disco is called Galaxy. You must have the adult bracelett to enter. It is a very fun place to be. I suggest it to all people who like to go out and party. We also booked a half day trip to Tulum. It is a little helpful to know a little Spanish. The friendly staff knows English, Spanish, French, German, etc. but it is nice to greet them with an \"hola\" or \"que tal?\" If you have any questions what so ever, please feel free to e-mail me with any questions. I'll be happy to help you.", "helpfulness": 10, "user": "chicoesquivo", "date": "March 11, 2007", "id": 7012019}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My husband and I just returned from our week's trip. It was our first time at an all inclusive. We chose this hotel from the high ratings/great reviews and amenities it had to offer. Many of our friends had told us that an all inclusive was the best. We had mixed reviews:", "title": "First All Inclusive Experience", "helpfulness": 17, "user": "rsuthe97", "date": "March 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 7011649, "likes": {"liked": "— food"}}, {"rating": 5.0, "title": "Fantastic Family Resort", "text": "The rooms were wonderful, large, very clean, service was very good. Mini bar was kept well stocked by the maids. Would definitely ask for building 53 because it is central. We had building 50 which was at the end at the beach although if you're looking for a hotel with an ocean/beach view it's not that kind of a place. The beach is at the end of the complex and is somewhat narrow. Concierge at each building which was very helpful. This facility is very large and easy to get turned around in, especially if you visit the neighboring facilities to eat or drink at. Lots of walking. It's nice because you can visit the other hotels for drinks and it does offer options.", "helpfulness": 30, "user": "CochraneFamily", "date": "March 10, 2007", "id": 7009735}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "The pools are beautiful and they are quite large with different areas for kids, swim up bar, wave pool, lazy river. Many of the chairs and huts had towels on them by the time we went to breakfast at 9:00. Chairs were saved with towels all over the place even though they say you aren't allowed to save chairs. At the beach, it's worse. Try finding a hut to shield yourself from the sun. Forget it. The chairs under the huts are saved and then people save their sun chairs also. You might not see these people for the entire day but their chairs are saved w/towels, books, thongs, etc. It was riduculous. The beach is jammed. You can get drinks and food at the beach and that seem plentiful and you didn't have to wait in a long line. Service at the pool/beach was spotty.", "title": "It was amazing", "helpfulness": 13, "user": "MeganOntario", "date": "March 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7008921, "likes": {"liked": "— Variety of activities", "disliked": "— Loved everything"}}, {"rating": 4.0, "title": "Very good - some tips", "text": "Food was okay, not great. We enjoy eating out and going to different restaurants and like good food. This was mass produced quantity food, not necessarily quality food. Make sure the men take long pants because all of the restaurants where you make reservations at require it. Would not recommend the Mexican restaurant. The Japonese restaurant was good and very entertaining because the Chef cooks the food in front of you. Seafood was okay, I had to send my salmon back 3 times to get it cooked. Steakhouse was pretty good. After this we ate at the large El Mercado buffet which is next store. If you enjoy really good food, this place is not for you.", "helpfulness": 17, "user": "buttercupandcheeto", "date": "March 7, 2007", "id": 6927668}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Just came back. Yes, not enough shuttles which are really golf carts. I also felt pressured tomhave to give a tip each time. Way too much walking for anyone, young, old or active just eat or go to the beach. If youre children are. Used to american cuisine - not the place! The food is okay but nithing to brag about. Definitely not 4 star dining even the speciality restaurants. Actually, i thought those were jokes. I saw so few people when i dined but yet it was difficult to get a reservation. Wave pool for kids was the best part. Lazy river is the laziest and smallest i ever saw and while i tried to laze around, the counselor of the kids club decided to bring the children in to splash and swim - go figure. The rooms were musty and dark. I had a junior suite. The entertainment was practically non existent and juvenile. I felt safe with valuables etc and found staff to be very personable and tended to my needs (shower drain clogged and tv didnt work). Fixed immediately. No i wont be back but it was a nice experience. By the way, i am not a heavy drinker but agree that the drinks were considerably watered down!", "title": "Ok vacation - only ok nothing exciting!", "user": "Zatraveler", "date": "September 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 139180228}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We travelled to Iberostar Paraiso Lindo August 12-17 of this year with our 2 sons and one of their friends, ages 21 and 23. This marked our third trip to the Riviera Maya. The first trip was also with the whole family (and 2 other families) and we stayed at the Barcelo Maya Caribe (2006). Our second trip was just me and my husband and we stayed at Excellence Riviera Cancun (2009). We’ve also stayed at the Paradisus Punta Cana (2004). So, we are not strangers to all inclusive travel and have learned to manage our expectations.", "title": "Good for families", "helpfulness": 10, "user": "shoebedo22", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 139177298}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Our airport transfers were booked with Olympus Tours. You will notice them as everyone wears orange. There was another couple in the transfer van with us so we had to make one stop. Not terrible. The resort is not too far south of the airport so the van ride wasn't too long. Arrival at the resort was friendly but nothing special. At Excellence we were offered cool cloths and champagne immediately, which was lovely.", "title": "great value a must on your bucket list", "helpfulness": 1, "user": "Bradley M", "date": "August 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 4.0}, "id": 138998693}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We had heard that the check in process was not the easiest at the Lindo. That is true, but it wasn’t horrible. There was about a 15 minute delay before they could take us at the counter. There was no one in front of us and 3 staff behind the counter working with 2 other couples; it just took a while for all the paperwork to be completed. We were offered a ‘cocktail’ while we waited. It tasted REALLY sweet, sort of like fruit nectar, and it was tough to finish. While we were waiting, Katalin, from Olympus Tours, met us in line, welcomed us, and suggested we do the paperwork for our return transfer immediately after check-in to get it out of the way. She was incredibly friendly and helpful. Our turn at the desk finally came. Our reservation was for 2 rooms and we had requested a rollaway bed for our sons’ room since there were 3 ‘men’ staying in that room. Besides the notation on our reservation, I had sent an email requesting the rollaway one week in advance of our arrival. During check in, we were told that rollaways were not available. I pointed out the size of the 3 guys and said there was no way they could sleep with 2 of them in double beds. She excused herself and said they could bring a 3rd bed into the room but there would be a delay in making the room ready. That wasn’t a problem as our room was ready immediately and the boys’ would be right next door.", "title": "Need more shuttles", "helpfulness": 1, "user": "EvergreenTim", "date": "August 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 138987818}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We got up to the room with all 5 of us and the luggage arrived shortly after. We were on the 3rd floor of building 51. There are no elevators in the buildings so the bellman carried all of our luggage up. Not an easy task but it was all done with a smile. After the boys changed and cleared out to the pool, I realized that one of my pieces of luggage was missing. I called the bell desk and they promptly came back to get me to look for the luggage. I really started to panic. I had been sure to pack most of my clothes in my carry on so they wouldn’t be lost by the airlines and that was the piece that was missing. It was nowhere to be found. As a last resort we sought out Katalin to see if had been left behind in the van. When we walked up and said “We have a problem.” She said ‘I know, we have it, don’t worry, the van driver just called me.” She promised she would get the luggage back to me by later that day if at all possible or first thing in the morning in the worst case. I was then able to start to relax. It was returned later that day and she insisted that I check the contents to make sure everything was still there, and it was.", "title": "Nice pools, bad employees and dirty rooms", "helpfulness": 2, "user": "Melani H", "date": "August 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 138835277}, {"rating": 5.0, "title": "Great Vacation!", "text": "My boyfriend (26) and I (22) just returned from the Iberostar Paraiso Lindo from August 31st till September 5th. We really enjoyed the vacation. The service was above and beyond what we expected. When we first arrived, our room was immaculate. We met the maids and they were extremely good at cleaning the room and making sure that everything was fine. Although, we did use the safe in the room, at no point were we afraid of anything going missing.", "helpfulness": 31, "user": "A TripAdvisor user", "date": "September 11, 2005", "id": 3895281}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Before leaving, we read many reviews about the food. Some of the reviews were good and others not so good. We went to Mexico expecting the worst. However, to our surpise, the food was extremely good. We dined at the Cajun (Jambalya), Steak House (Maya Hotel), Japanese Hibachi Restaurants (Del Mar and Maya) and all of the restaurants were above average. We chose these restaurants based upon availability and recommendations from the concierge desk and other hotel guests. For breakfast and lunch we would dine at the Italian Restaurant, which is a buffet style for breakfast and lunch, and thoroughly enjoyed ourselves.", "title": "Great vacation in Lindo", "helpfulness": 10, "user": "pizzsa", "date": "September 8, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3888514}, {"rating": 5.0, "title": "Gorgeous Lindo", "text": "The waiters and waitresses, and all of the staff for that matter, were extremely attentive and nice. There was no pressure to \"tip\" the workers, but because of their extremely good service we felt that the workers deserved more and tipped them most of the time.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "September 8, 2005", "id": 3888482}, {"rating": 5.0, "title": "Great time at the Lindo with Teens", "text": "The beach was beautiful and clean. It was never crowded and we were always able to secure a \"good-spot\" on the beach. The pool was just as nice as the beach but a bit more people seemed to hang out by the pool rather than beach. But, the pool is really big and there is no real \"over-crowding.\"", "helpfulness": 11, "user": "A TripAdvisor user", "date": "September 6, 2005", "id": 3846207}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "The Star animation team are really really great people. During the day they have various activities, pool-side and by the beach, some of which are extremely fun. At night, the Star team is responsible for the Nightly Entertainment and we were extremely impressed with the quality of the shows. We went to Punta Cana, Dominican Republic last year and the shows there were not as well put together as those in the Lindo.", "title": "A Little Piece of Paradise", "helpfulness": 43, "user": "missyrn", "date": "September 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3841022}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We had a great time at the resort - the grounds are very pretty but there were many weeds at the ocean, however, only some spots... restaurant food was great but buffet was mostly the same every day. Entertainment was okay but I enjoyed more the Princess resort ent. last year... too many shows were including public, not too many professional shows (in my opinion). However, it's a great family resort & kids enjoyed it very much (lazy river, ice-cream stations, many lunch restaurant options - so we didn't have to go far). I would definitely return to this resort!", "title": "Great Family Resort", "user": "Laura G", "date": "August 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 138248903}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "First of all, let me say that I'm not accustomed to sub-par hotel conditions, as my husband is an avid deal-finder, and usually puts us up in some of the nicest hotels around, at a fraction of the price. It's his hobby. We hadn't been on a legit family vacation since the birth of our son, so this was our first trip in a long time and I had great expectations. That said, let me tell you about this place as honestly as I can:", "title": "This place is the best. I'm not sure what these other reviewers expect.", "helpfulness": 27, "user": "Desiree C", "date": "August 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 138231324}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "0. MY HUSBAND LOST HIS WALLET WITHIN AN HOUR OF ARRIVING. I put that in all caps because it was a serious thing that happened. We immediately freaked and assumed staff had stolen it somehow. Guess what? A call to the front desk led the front desk to ask security, who found the wallet and returned it to us with all of its USD and credit cards inside. THAT IS RIGHT. IT WAS RETURNED IN TACT. Already this place gets 5 stars from us.", "title": "Excellent Resort", "helpfulness": 6, "user": "bigblue0123", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138062611}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "1. The staff is /wonderful/. Hands down. They were super helpful, super friendly, and always eager to please. We made friends with Leslie at the pool-side buffet, and Geovane at the front desk. Geovane upgraded us to a Maya delux suite for no extra cost and Leslie attended to our needs with hawk-like concentration. To anyone who disses the staff at this hotel, perhaps you did something to incur their rudeness. A 20 peso tip with each drink and meal also makes a marked difference in your treatment. Come on, guys. Just cause your meals and drinks are free doesn't mean you shouldn't show appreciation. It was about 2 billion degrees outside when we went mid-August. The staff is wearing polyester and still smiling. That deserves a tip.", "title": "BUGS! and Rude Employees!", "helpfulness": 13, "user": "Jessica5763", "date": "August 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 138060523}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "2. To the American other travelers to Mexico, a little kindness and empathy goes a really long way. It also wouldn't hurt to pick up a few key phrases in Spanish, you know, since you're going to a Spanish speaking country. Regardless of your language, they will be able to accommodate. When we went, English speakers were the minority, since a lot of Latin American countries' school systems were on the final week of summer break. There were also a ton of Russians there, as well as French Canadians. It was a nice environment. But, there were a ton of different languages being spoken all around us--as it should be. We're not in America.", "title": "Girls trip August 2012", "helpfulness": 3, "user": "EBS59", "date": "August 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138051817}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4, "variance": {"poor": 96, "average": 232, "very good": 790, "terrible": 43, "excellent": 1827}, "aka": "Iberostar Paraiso Lindo Hotel", "slim_ranking": 0.3, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "Located directly on the beautiful beach of \"Playa Paraiso\" (Mexico). With the only wave pool on the Riviera Maya. 16 restaurants, 11 of them A-la-Carte. 18-holes golf course and convention center."}