{"user_rating": 5.0, "review_count": 2609, "name": "Iberostar Grand Hotel Paraiso", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "This was our first trip away from the children and the adult's only fit our needs as we left our kids and didn't want to be around other's childrens. This hotel was incredible. We have always enjoyed the Iberostar Pariso Lindo and on our last visit they were building the Grand (almost 5 years ago). This was our first time back to the cancun area and we were so happy with our choice. The Grand is so clean (there was always someone cleaning or polishing the floors, etc.). The mini bars were always stocked with what we wanted. We ordered champagne to the room and they brought glasses, an ice bucket and tray. So nicely presented. The food was incredible. The special restaurants were great but to be honest the lunch buffet was the BEST. The gym was small but it was never fully used so it was perfect for our needs. All and all, the service, the friendliness of the staff, the quality of the food (jumbo shrimp and lobster daily at the buffets), the wine selection, the beds, the size of the rooms and bathrooms. Everything was just perfect. We will definately be returning to the Grand on our next Cancun trip. In fact, we are alreayd looking at the other Grand hotels in different locations. It is worth every penny!!!", "title": "the BEST vacation in a long time", "helpfulness": 5, "user": "BeccaDiaz", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177828937}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled solo", "text": "Having already stayed at both the Iberostar Grand Jamaica and Iberostar Grand Punta Cana recently, a visit to the Iberostar Grand Paraiso was a must.", "title": "WONDERFUL RESORT", "helpfulness": 9, "user": "rcb71", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 177730672}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "The Grand Paraiso completes the chain. This resort is beautifully maintained with workers busy cleaning, sweeping, painting and keeping things looking beautiful. The amazing staff everywhere are always greeting you with a smile and a \"hola\". Everybody seen to go out of their way and make you feel very special. Several times during my one week stay, out of the blue a Star Friend would ask if I needed anything, and would even go back to my room if I had forgotten something. Trusting them was not an issue !!!", "title": "Good Time in Bad Weather", "helpfulness": 6, "user": "Randy T", "date": "September 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177710949}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "All of the STAR FRIENDS are amazing, so many of them it's hard to pick out just one, but JENNY is an absolute treasure !! She does a wonderful job and is a joy to be around. Also Daniel at the lobby bar is an amazing bartender !!", "title": "great visit", "helpfulness": 7, "user": "wally r", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 177508581}, {"rating": 5.0, "title": "Incredible resort", "text": "The shows at night are some of the best I've ever seen at any caribbean resort. The classic ROCK & ROLL show, plus the BEATLES show are really well done !! The headline singers are really amazing !!", "helpfulness": 7, "user": "A TripAdvisor user", "date": "September 16, 2013", "id": 177435590}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at the IGP for nearly a week during our honeymoon. We were impressed the minute we arrived from the courteous staff, immaculate grounds, and beautiful beaches/pools. I'll spare the extensive details since they are thoroughly explained by other positive reviews. I will say that they are fully credible and without question deserved. The luxurious setting and pampering staff will not disappoint. The service and attentiveness from administration, chefs, service staff, and entertainers was most impressive.", "title": "Best luxury and staff...Very romantic honeymoon!", "helpfulness": 9, "user": "campbyj", "date": "June 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33373722}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The food quality fell slightly short of our expectations, but not from lack of effort or worth complaining about. The chefs are wonderful and accomodating. The quality is consistent with what you may expect from an all inclusive resort, but the restaurants are creative and menus extensive. They were also very willing to surprise us with special \"off menu\" selections that was truly appreciated.", "title": "A Grand vacation for the mobility impaired", "helpfulness": 18, "user": "HLyn", "date": "June 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33333058}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Overall the experience exceeded expectations. The staff were the highlight with their accomadating approach to everything. Would definately return and recommend this resort to all. One of the Yucatan's best!", "title": "GREAT Experience at the Grand", "helpfulness": 13, "user": "eurotripper22", "date": "June 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 33204214}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The Ibersostar Grand is truly a grand vacation for the mobility impaired. My husband and I had a week-long stay there for our honeymoon. He has a spinal cord injury and requires a wheelchair. After pre-arranging a handicap accessible transfer from the airport, we hardly had to worry about or consider his disability for the entire vacation. Absolutely every part of the Grand is accessible with marble ramps and paved entryways to each facility.", "title": "Wonderful Stay at the Grand", "helpfulness": 8, "user": "BayAreaHappytraveler", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33109920}, {"rating": 5.0, "stay_parameters": "Stayed June 2009", "text": "We reserved an accessible room. He was able to roll up to the sink and the shower was so big that he could do a 360, if he wanted to! He had plenty of room on the balcony and was easily able to transfer to the couch there. The bed was a dream and was perfect for him (I certainly had no complaints either!). All of the restaurants were accessible with elevator access. It would be a challenge to eat outside at some of the places but after being in the sun, the A/C was a welcome reprieve and we didn’t miss outdoor dining. With floor to ceiling windows, we had incredible views and felt as though we were outside anyway. There are many walkways throughout the resort and he was able to access all of them.", "title": "Back from Heaven", "helpfulness": 1, "user": "AntonioSales", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 33061007}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The noise and speed of traffic and the general hum of humanity was jarring. After spending a week at The Grand and not seeing any cars or crowds, leaving the resort and heading back to the real world at the Cancun airport was overwhelming. My husband I spent a week at the resort from December 13-20, 2007, to celebrate our 20th anniversary. We came away impressed with the level of service, the quality of the cuisine, and the stunning beauty of the resort that photos cannot really capture. Nor can photos capture the vibe of the place, which is upscale yet comfortable, and relaxing but not boring.", "title": "Relaxing yet unpretentious opulence - a grand resort", "helpfulness": 50, "user": "SpotsmomNC", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 11882763, "likes": {"liked": "— The service, the food, the beach", "disliked": "— Nothing, really"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "This place is perfection, with only a couple of small bumps that in no way marred our perfect week. From the time we arrived and were greeted with chilled champagne and cold towels to the last perfect cocktail in the lobby bar waiting for our taxi, my husband and I experienced a truly wonderful week in paradise. We upgraded to an oceanfront room for an extra $50 per day, and for me, it was worth every penny. We had a second floor suite in Building 70, and with the views and the crashing sound of the ocean, the teak-floored balcony was my happy place. I spent many hours, lying on the balcony’s comfortable couch or swinging in the hanging chair. The concierge staff and butler in Building 70 were amazing friendly, and knew our names. We never wanted for anything, and our butler Victor was amazing.", "title": "2ND VISIT and IT'S ONLY GOTTEN BETTER", "helpfulness": 17, "user": "newcarbuyer7", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11877093, "likes": {"liked": "— Great Food,Great Service,Great Staff", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The décor is grand – opulence abounds with frescoed ceilings, immense statuary artwork, gold gilt and an abundance of marble. Although that sounds like it would be a cross between Disney, West Palm Beach, and Las Vegas, somehow, even the tropics, it generally works (except for the lobby which has a rather bizarre décor and color scheme based on purple silks and gold gilt). One caution: the abundance of marble and tile can be hazardous when it rains and it gets wet. The walkways are then as slippery as ice – bring good pool sandals that have a grip. The size of the place is manageable and we kept discovering new areas each time we meandered; poker tables and a game room, a cigar bar, and opulent public spaces.", "title": "Fantastic - so sad to be home", "helpfulness": 27, "user": "Lindsey0604", "date": "December 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11715937, "likes": {"liked": "— The service, the pool, the beach.", "disliked": "— That it lacked outdoor bars, restaurants, etc."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "What truly makes this place incredible is for what it doesn’t have. There are no crowds on the beach or at the pool. There are no lines for self-service – there is no self-service. The length of the beach is approximately the same as the length of the beach for the other four resorts in the complex combined. Yes, you read that correctly! The beach in front of Building 70 is swimmable, with few rocks. The beach in front of the other oceanfront building (Building 71) has many rocks and is not swimmable. Plus, for some reason there are wicker chaise lounges with cushions and head rests under palapa huts in one side of Building 70, while the other building has standard mesh seats. A waiter came around about every 15 minutes and offered us drinks. Anyone not staying at The Grand, while free to walk the beach, could not stay. It made for a tranquil, uncrowded beach experience, completely different from the Lindo/Maya next door, that had a jam-packed beach full of toddlers, screaming children, beach volleyball, etc…", "title": "WOW awesome place and also for disabled", "helpfulness": 18, "user": "Maggiep00", "date": "December 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11605216, "likes": {"liked": "— Everything -- awesome mattress", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "The pool is lovely, and is salt-water, a nice change from regular chlorinated pools. Iberostar Resorts know how to design a resort that is pool-centered, and they make up for the somewhat rocky beach by providing marvelously designed pools. The main pool has an abundance of chairs and beds; some of the chairs are in ankle-deep water so that you feel you are surrounded by tranquility. The main pool is cold in December, but doable. The tranquility pool is a bit warmer (and beautiful!) and the indoor/outdoor spa pool is heated and provides a plethora of jets to provide an aqua massage. The outdoor Jacuzzis are heated and delightful.", "title": "Awesome!!!", "helpfulness": 25, "user": "TravelingIsAwesome", "date": "December 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11583507}, {"rating": 5.0, "title": "if you have not booked do it now!", "text": "my boyfriend and I, both in our early 20's and stayed at the Grand for 2 weeks in late July to early August. This hotel absolutely beautiful! The rooms are lovely, they all have balcony’s with swing seats, mini bar that is refilled everyday and all the usual other things. A maid comes every night and turns down the bed and lays little chocolates on the pillows, i thought this was such a nice touch!", "user": "kat_storrier", "date": "December 23, 2008", "id": 22971067}, {"rating": 5.0, "title": "Fantastic Vacation", "text": "While at the hotel we tried to make the most of all the amenities and activities that were going on. The star friends are so helpful and go out of their way to make sure you have a great time, if you go make sure u get involved with the pool games, we did water aerobics, beach volleyball, football, water polo (they give you lovely hats to wear!), dance lessons, scuba lessons in the pool and Mexican cooking class outside! My boyfriend also played around a golf which he thoroughly enjoyed, the golf course was beautiful but in the summer heat it’s not a place you want to be for too long! There are also water sports we did the jet skis but this is an extra charge, the kayaks and all other non motorised activities are free. The hotel also has shows on every night they are not Broadway productions but they are still good and a little cheesy.", "user": "hopeful74", "date": "December 22, 2008", "id": 22916016}, {"rating": 5.0, "title": "Loved the Iberostar Grand", "text": "There are several restaurants in the hotel but our favourite by far was the Japanese! The buffets where good as well they did theme nights such as American, Italian, Mexican, so every night there was a different variety of food! We also ordered room service one night which was also very nice. There are several bars, which serve only the best alcohol, our favourite was the one beside the piano bar, it had lively music and great cocktails!", "user": "Itch45", "date": "December 20, 2008", "id": 22870746}, {"rating": 5.0, "title": "One of the best", "text": "We booked a number of trips through the hotel; chicken itza this was great but the bus ride was so long and you are no longer able to climb it which was disappointing. Tulum extreme was excellent we went snorkelling in underground caverns, then visited tulum which isn’t as impressive as chicken itza but is still lovely, then after that we went on zip wires through the jungle and did some abseiling this was a very good trip would definitely recommend it. We also did a speed boat tour where you got to drive your own speed boat out into the ocean then you do some snorkelling at a rief. My boyfriend loved driving the speed boats but I found the snorkelling at the rife a bit disappointing", "user": "BG508", "date": "December 19, 2008", "id": 22860541}, {"rating": 5.0, "title": "Honeymoon Villa! OMG!", "text": "This hotel is absolutely beautiful and anyone who has trip planned here is in for a treat! A top class hotel in a gorgeous location what more could you ask for. We will most definitely return here next time we visit Mexico!", "user": "bionicwomanTexas", "date": "December 19, 2008", "id": 22860206}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My boyfriend and I stayed at the Iberostar Grand Paraiso in August and had an amazing vacation. Every aspect of our stay was extraordinary. Food, service, beautiful beach, quiet enough to relax but stimulating enough not to get bored. We planned to stay for 5 nights and ended up extending our stay to 7! A month later, we are already planning our next trip to the Grand in November!", "title": "Absolutely Perfect!", "helpfulness": 9, "user": "esa2583", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 177390489}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We travel to the Grand every September and are never disappointed. This year was better than ever. I love the staff and how they go out of their way to make every day perfect. Special thanks to everyone at the front desk for a quick, effortless check in; Ana and Adriana, the concierge in our building, who were always helpful, even with minor requests; the waitstaff is incredible, thanks to David, Victor, Guadalupe and Angel (our waiter for the dinner on the beach which was amazing, we will never forget it). Eder, Jenny and Eduardo made us laugh every day. They go out of their way to make sure everyone is enjoying themselves by the pool and in the evening. Daniel, our favorite bartender, who was sure to have the specific wine we liked each night before dinner.", "title": "Always a fabulous vacation", "helpfulness": 6, "user": "BostonVacafan", "date": "September 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177387966}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The food was better than last year, I can't believe I'm saying that because it's always been great. They've made changes to the menus so if you are a repeat guest you won't get bored. The lobster, filet mignon, lamb chops, octopus carpaccio - everything was out of this world!", "title": "Iberostar GP vs Secrets Maroma Beach - comprehensive review", "helpfulness": 43, "user": "Brian H", "date": "September 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 177170089}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Can't wait to return next year and run into the same repeat guests and the wonderful staff.", "title": "A disappointing holiday", "helpfulness": 28, "user": "RB1884", "date": "September 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 177024489}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "My wife and I stayed at Secrets Maroma Beach in Feb of 2011 and tried desperately to book another trip there recently, but due to the cost and unavailability we had to \"settle\" for the Grand Paraiso. We stayed at Iberostar Grand Paraiso in May of 2013 and I intentionally waited a couple of months before writing a review as to get a more unbiased opinion of both. The following is a list of some of our observations for those who wish to compare. I recommend copying and pasting this review into a Word doc so you can see it in its entirety as it's very long.", "title": "Most awsome honeymoon ever", "helpfulness": 10, "user": "Sallybell", "date": "September 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 176767816}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We celebrated our 25th wedding anniversary at one of our favorite all-inclusive resorts, (our fifth trip) at Iberostar Grand Paraiso in Riviera Maya, Mexico two weeks ago. We knew it was hurricane season and although the weather was pretty bad, we still had a great trip.", "title": "Best Resort in Bad Weather! (OR PERFECT WEATHER)", "helpfulness": 10, "user": "garyandsue515", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178291773}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "In addition to a huge outdoor pool and quiet pool, there is a large indoor pool located at the spa which was absolutely wonderful on those days where the beach and outdoor pools were not an option.", "title": "Nice Place!", "helpfulness": 8, "user": "MRT2KB", "date": "September 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 178195458}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Because we were return guests and it was our anniversary, we were treated like royalty! Fresh flowers in the room, special turn down service, bubble baths and special anniversary wishes from everyone. (I honestly believe ALL the guests were treated that way!)", "title": "Another wonderful stay!", "helpfulness": 6, "user": "Chem24id", "date": "September 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 178034892}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Food, service, entertainment and the entire staff are wonderful, friendly and will go out of their way to make sure your wants and needs are exceeded as in the past.", "title": "Great Trip", "helpfulness": 4, "user": "BenBindokas", "date": "September 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177961752}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "This is another resort that we recommend staying in the beachfront buildings, 70 or 71. These buildings are truly beachfront locations and have wonderful patios and balconies, complete with sofa, table and double swing.", "title": "Still Beautiful", "helpfulness": 3, "user": "whiskykat", "date": "September 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 177907884}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "So we are picked up from the airport with the airline bus and are driven to the hotel. The entire trip there we have a group of businessmen bragging about how great their hotel was going to be. We drop them off and proceed to our hotel next. As we pull into the resort, everyone else on the bus are shocked and begin to exclaim, how those guys were way off and questioning why they had never heard of this resort. Having flown out at night and not being able to see the full landscape of the resort and still being impressed was a great first impression.", "title": "Far exceeds a 5 star!", "helpfulness": 12, "user": "TO_travelers", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11477635, "likes": {"liked": "— Super clean, very friendly staff, all expectations were met and exceeded, GREAT HOTEL!", "disliked": "— some of the people staying at the hotel (not the staff) were very rude at times"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We walked off the bus to be greeted by a Mariachi Band and beautiful women dressed in Mexican costumes. Upon entering the front door, we are served our first Margaritas and move along inside the hotel. At this point my partner and I are perma-smiles and this is only the entrance. We keep walking further into the hotel when we run into our butler. He asks where we are going and we explain that we need to check into our room, at which point he tells us that we have completely by-passed the front desk and will need to return but, he will bring us to our room to leave our bags.", "title": "Go There!", "helpfulness": 2, "user": "djoseph1", "date": "December 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11470942}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We head to the front desk and check in, the entire time with perma-smile. The rooms…OMG and the staff is so very attentive to your needs. They are super accommodating and are constantly cleaning the hotel. The windows and glass surfaces are impeccable, but they would still clean them. I was surprised that we didn’t find a bunch of birds on the ground the next morning from crashing into them.", "title": "Overall awesome AI", "helpfulness": 2, "user": "cmd333", "date": "December 10, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11469308, "likes": {"liked": "— Grounds, property", "disliked": "— Slightly less than world class service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This hotel is a diamond resort for sure. If there was a star rating higher than 5 I would have to say it was there. The food was unbelievable and the chefs were always willing to make something from scratch if we didn’t find anything to our liking which was near impossible. The buffets were great, which is normally not the case. We found that it was better than some of the A-La-Carte restaurants.", "title": "Amazing Vacation!", "helpfulness": 15, "user": "FebBride", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11416459, "likes": {"liked": "— Everything. The Grand is incredible.", "disliked": "— Not a complaint to be had."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We are planning to head back to this resort soon, and would highly recommend it to anyone. You will not be disappointed.", "title": "Awesome place", "helpfulness": 6, "user": "rshipley", "date": "December 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11407763, "likes": {"liked": "— The atmosphere", "disliked": "— The language barrier"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "My husband and I had the wonderful privilege of staying at this resort for 4 nights in the middle of December. Friends of ours were celebrating their 10 year anniversary and their travel agent had recommended this as the place to go, boy was he right.", "title": "What a wonderful place", "helpfulness": 22, "user": "cmskjg", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12197330, "likes": {"liked": "— The view", "disliked": "— People trying to sell stuff on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Even though it was raining when we arrived, it didn't dampen our enthusiasm as we looked around at the beauty of the resort. We received a welcome drink and proceeded to check in. Our friends received a complimentary upgrade from ocean view to ocean front and when all was said and done, we paid an extra $50 a night to be upgraded as well, we had booked a run of the house room.", "title": "10th Anniversary PERFECT destination", "helpfulness": 24, "user": "IluvJesus", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12193118, "likes": {"liked": "— hotel service", "disliked": "— website quality"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "What a fantastic view from the lobby in the oceanfront building, we were in 70, which had only been open for 3 weeks. The room had everything we needed and then some. The butlers came by and explained what they could and would do for us and they really took care of us, it was nice to always have someone around when you wanted a bottle or a golf cart ride somewhere.", "title": "5 * building 3-4 * service", "helpfulness": 9, "user": "chris074", "date": "December 29, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 12052482, "likes": {"liked": "— new buildings - very clean and uncrowded", "disliked": "— inadequate customer facing service"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Plenty of jacuzzi's around the pool, and the salt water was a nice touch. We didn't even find the tranquility pool til the 3rd day, we would start out at the beach and then after lunch head to the pool. There were always chairs available, although sometimes I think people left towels on chairs that were not being used. The beds with the cabanas were really nice.", "title": "A truly grand experience !", "helpfulness": 5, "user": "ruckusridgenc", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11997046, "likes": {"liked": "— The staff was wonderful !!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Food was fantastic, breakfast was like a regular buffet with omelet station, etc. Lunch we had lobster tail and grilled shrimp and then asked for the lobster and shrimp fajitas and couldn't believe how delicious they were. A big thank you, I think to Coxy, I think that might be who my husband ran into while we were there and she said to order them-wow! The Japanese was nice, it was your typical \"benihana\", but the shrimp was fantastic, I think that was my favorite that night. Italian was pretty, risotto was good-the deserts at this place are to die for. Banana thing at Japanese was amazing. Another really nice thing was the wine that the servers offered, it was all really good. Suf and Turf was my favorite. The steak was as good as Ruth Chris, which really surprised me. The seafood sampler for appetizer was amazing too. Gourmet had a menu with duck or lamb, if you like that, but they also had steak and lobster too. The wait staff were all great no matter where we went, they were all smiling and willing to assist. They also didn't push you out the door when you were done eating, they gave you time to let your food digest.", "title": "this in not the place to stay if you have a firm mattress at home", "helpfulness": 9, "user": "DA-BARES", "date": "December 25, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 11945400, "likes": {"liked": "— staff and pools, cleanliness, top shelf booze n beer", "disliked": "— no firm or extra firm mattress, the reservation system for dinner, dress code for men only."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "My wife and I and three other couples traveled to the Grand for five nights in early December. We are all in our late 20's/early 30's, so we were there to party and have a great time. I state this because I can only relate to you our experience based on our expectations.", "title": "Only Review You Need To Read - Best Trip Ever!", "helpfulness": 23, "user": "shacker11", "date": "December 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11550470, "likes": {"liked": "— Property, food, and drinks!", "disliked": "— Olympus tours."}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We had booked this trip primarily because of all the reviews from this tripadvisor.com website. Let me confirm that 99% of the positive reviews were 100% accurate. Anyone who had a negative experience at this website was either the victim of an unfortunate circumstance that happens one time in a million, or is a person that can find something wrong with anything.", "title": "security alert", "helpfulness": 5, "user": "bedpower", "date": "December 13, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "business": 5.0, "value": 2.0, "rooms": 5.0, "location": 4.0}, "id": 11535893, "likes": {"liked": "— food", "disliked": "— service and security"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "My wife and I have traveled quite a bit so I think we have a good base to compare the Grand to the rest. Places we've stayed range from 5-stars like the JWMarriott at Ko Olina and Cancun to the Mandarin Oriental in Miami. The five all-inclusives we've stayed at were all Sandals (Royal Bahamian, 3 at St.Lucia, and the Whitehouse). This resort is in our opinion the best all-inclusive we've ever been to from a physical property aspect. It is large, beautiful, and uncongested. I'd give it a 5/5.", "title": "Have I Just Returned From the World's Best All Inclusive?", "helpfulness": 75, "user": "johnyhandful", "date": "December 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11529534, "likes": {"liked": "— Food, beverages, services and staff were amazing", "disliked": "— The ocean here, while nice, is certainly the one weakness. There are better beaches elsewhere."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "The service was great 90% of the time (I feel the Sandals had great service 100% of the time). Most of the workers were awesome, but a few seemed to be overworked and tired, which is why I'd rate it a 4.5/5 in service (still great). We discovered that all you had to do was just ask politely for anything that wasn't what you expected, and someone would definitely make it right for you. A little patience goes a long way!", "title": "gerogeous hotel", "helpfulness": 11, "user": "Divergirl50", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11489615, "likes": {"liked": "— the best bed I ever slept in", "disliked": "— nothing was unliked"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The food was unbelievable! All the reviews we read about Toni's (surf and turf) and the Japanese restaurant were so helpful. The food at these two restaurants rivals anything you've had anywhere else. In fact, it was so good, we ate at both twice. When you eat at Toni's, ask for the 'double cut' filet with your 'surf & turf' meal, it is unbelievable! We did eat at the french restaurant which the guys seemed to enjoy more than the ladies. The guys also may have had more to drink so anything would have been good at that point! We did not try any of the others so we can't comment on them. There is a taco stand in the shopping village that is also fantastic (Get the #1 & #7).", "title": "Truly a grand hotel", "helpfulness": 6, "user": "cbstraveller", "date": "December 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11484748, "likes": {"liked": "— rooms", "disliked": "— no wooden dance floor"}}, {"rating": 5.0, "title": "Heaven on Earth!!", "text": "My wife and I stayed at the Grand 4 nights for our honeymoon over the Thanksgiving weekend and words couldn't really describe how great it was! I'm not sure what the last reviewer was talking about because my experience was completely different. Some of might have to do with taking ocean front rooms instead of the regular rooms but I heard that aside from the view its all the same. Maybe they upkeep those rooms more because people pay a higher rate...", "user": "talperry", "date": "December 17, 2008", "id": 22806272}, {"rating": 2.0, "title": "A lot of hype, in the end a real disappointment", "text": "Beach/pool - we were at the pool or beach every day around 10am and had no problem finding open beds, especdially on the beach. The beds were extremely comfortable and everything was very clean and new.", "user": "TorontoAsi", "date": "December 16, 2008", "id": 22775190}, {"rating": 5.0, "title": "The best vacation i ever had!!!", "text": "Rooms - beds, shower, balcony were all unreal! Amazing design and comfort. Bath towels could have been a bit better but it wasn't a big deal really. View of the ocean and the swing on the balcony great too. And nothing beats taking a nap and listening to the sound of the ocean.", "user": "KimBostonMa", "date": "December 15, 2008", "id": 22765050}, {"rating": 5.0, "title": "Returned to paradise within 9 months!", "text": "Food - The buffets were really great and had plenty of selection. However, note that the breakfast and lunch the selection at the beach front buffet is much smaller. The a la carte restaurants were all satisfactory, not amazing, and above average for all-inclusive resorts. I won't get into details but the best one in my opinion was the surf & turf (if you know what to order...).", "user": "ricksplace631", "date": "December 15, 2008", "id": 22762286}, {"rating": 5.0, "title": "Absolutely Wonderful Experience!!", "text": "Anyway, the overall experience was great. Place looks terrific and gives off a feeling of wealth and grandeur. Staff was friendly and accomodating. Highly recommended!!", "user": "jeffandleak", "date": "December 14, 2008", "id": 22731049}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "Easy into and out of the country...no one going to Mexico. Real Shame..US Media should be ashamed.", "title": "FANTASTIC STAY AT IBEROSTAR GRAND", "helpfulness": 8, "user": "nyc_apt_sitter", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32897381}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Arranged Private transfer to hotel....", "title": "Luxury at its Finest", "helpfulness": 12, "user": "Grneyedlady62", "date": "June 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32699669}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Greeted with choice of drink and a cool towel at checkin.", "title": "5 Star Vacation!!!", "helpfulness": 8, "user": "HillbillyRockstar", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32641690}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Great Food at The Italian,The Surf and Turf and Japaneese.", "title": "Beautiful resort, average service", "helpfulness": 7, "user": "canuck225", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 32577930}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Have to figure out what resort people stayed at that complain about this hotel.", "title": "Beautiful resort- great choice for a luxury beach vacation.", "helpfulness": 18, "user": "MGoBlue99", "date": "June 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 32529398}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband and I stayed at the Grand Paraiso for 5 days in August and we had a good time. It was about a 30 minute ride from the Cancun Airport so not too bad. The first two days we were there it poured and the staff told us this was their rain season:( However the last 3 days were gorgeous!", "title": "Great staff!!!", "helpfulness": 3, "user": "delgadot", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176644657}, {"rating": 1.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Every single person that worked at the hotel from the front desk to the landscapers were so incredably nice! Everyone spoke to you and made you feel so welcomed! The room bar was re stocked everyday and the maid cleaned the room twice a day in the morning and at night! The 24 hour room service was so great to have at 2 am! We only went to one show which was \"Boogie Nights\" and it was great entertainment! We went to the club 3 different nights and the music choice was not our first selection but it was still a good time!", "title": "TERRIBLE!!", "helpfulness": 26, "user": "epalz", "date": "September 10, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 176598896}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I enjoyed all three pools (indoor, outdoor main and outdoor quiet pool). The beach was a bit rocky and the sand flies were a pain but overall the property was kept up very nicely. There were plenty of chairs and beds to lay on which was great! The Iberostar property is huge boasting 5 different hotels!! So we were not able to check them all out but we did go next door to the Maya and that hotel was so big and decorated so beautifully in Mayan decor. There was even a wave pool at the Maya which was a very nice feature. Due to the size of the Iberostar property you had to take a golf cart to get to each hotel, to the club, basketball courts and shopping center.", "title": "Disappointed", "helpfulness": 16, "user": "K B", "date": "September 9, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 176449912}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I only have two negative things, I was not that impressed with the food selection. I stayed at the Iberostar in Jamaica and the food there was AMAZING so I guess I was hoping for the same experience but was sadly disappointed! We ate at two of the themed restaurants the Meditteranian and the Steak House and the food at both places were presented very pretty on the plates but the actual taste was not so great. My husband likes his steak medium rare but his steak was still alive and sadly he was not able to enjoy it. The second negative is the hotel can definetly use a new paint job. You can tell this was the first Grand they built as it has seen better days paint wise and with all of the rain there were a lot of leaks in the main hall ceiling. The staff had towels and buckets laid out on the floor in the main hall to absorb the water.", "title": "The service is what made a great holiday/hotel, simple superb", "helpfulness": 8, "user": "John D", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176378296}, {"rating": 5.0, "title": "Great hotel - needs some repairs", "text": "Overall our stay was great and I would reccomend this hotel to any couple looking for a quiet relaxing vacation. However, I have to say that I think the Iberostar in Jamaica was much better and I will be back there again!", "helpfulness": 10, "user": "Kim R", "date": "September 8, 2013", "id": 176354915}, {"rating": 5.0, "title": "Wonderful trip to the GRAND!", "text": "My husband and I went to Iberostar grand for our 2 yr wedding anniversary from Nov 11th-18th. I have to say the trip was absolutely amazing! The property is gorgeous and wonderfully maintained! Our favorite thing about this resort over other all inclusives we have been to was the Butler service. It was so nice to have someone to call when there was something you needed. We loved the room service option the food was delish and we liked the fact that you could order any time of day. I also liked that you could have your favorite liquor brought right to your room. My husband and I love to walk in the morning for exersize and it was really great that all the neighboring properties we are welcome on so it was fun to walk around and get a nice workout in. It was great that you can use the internet free of charge so I could keep in touch with my parents to check on our daughter. The nightly shows were fun to watch. As far as the restaurants are concerned the best one for us was Haiku! Their sushi was wonderful but really everything there was yummy. We liked Tonys surf and turf that was our second choice. The others we really were not impressed with at all. The breakfast buffet in the main building we felt was MUCH better than the one by the beach. The serenity pool was nice but you couldnt lay by it because you would get eaten alive by bugs. We usually either went to the beach or main pool. Every night we would go to the indoor pool to relax and that was really great! I would definately recommend this resort you will have a wonderful time!", "helpfulness": 7, "user": "MeggiesMommy", "date": "December 2, 2008", "id": 22373789}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "This hotel is the nicest place that my husband and I have ever been, mostly due to the service and the quality. My husband has traveled all over the world with the military, and has been to Austrialia and Hawaii in all the nicest hotels, and still says this is the best service he has ever received. I felt like an A-list celebrity the whole trip.", "title": "***Heaven on Earth***", "helpfulness": 8, "user": "LovesTheBeach55", "date": "November 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22294630, "likes": {"liked": "— Everything!", "disliked": "— That I can't live there for the rest of my life"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The rooms were spacious, immaculate and had the most comfortable bed I have ever slept in. They clean the room and stock the mini bar twice a day. It is ABSOLUTELY worth the money to upgrade when you get there to an ocean front room! There is a swing and a bed kind of thing with a mosquito net on the balcony. It is especially nice at night hearing the ocean, and we almost slept out there one night.", "title": "Heaven on earth", "helpfulness": 6, "user": "rapunzelNewYork", "date": "November 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22166413, "likes": {"liked": "— service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "The food at the surf and turf and Japanese restaurants were excellent, and we ate at those places almost every night!", "title": "Iberostar Grand Exceptional", "helpfulness": 6, "user": "G0Irish", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 22104514, "likes": {"liked": "— people, facilities and value", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We had lots of fun with the other couples that we met-doing karaoke, and hanging out at the swim-up bar at the pool. We had alone time if we wanted, but there were many friendly people there to socialize with as well.", "title": "TripAdvisor - best hotel 2008", "helpfulness": 6, "user": "StickyDallas", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22104675, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Hello, and thanks to the many reviewers that have already reviewed IB Grand. We based our decision to stay at IB Grand on TripAdvisor reviews.", "title": "IB Grand Paraiso - it is paradise", "helpfulness": 7, "user": "Botanicaofkansas", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31985220}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I stayed 5/20-27 in an oceanfront suite. We booked and paid the rates of the resort before the H1N1 scare and had requested a corner room. We didn't receive that room or even the possibility of paying for an upgrade to a corner room. Only one oceanfront building was open. Having said that, we were very happy with our room and came to find that the swing chair was a wonderful way to relax and listen to the ocean at night.", "title": "If only life were always so good!", "helpfulness": 10, "user": "Denver58", "date": "June 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31679194}, {"rating": 5.0, "title": "2nd Time around", "text": "When we were there quite a few things were closed/ different due to the low occupancy (40%). So, that is to be kept in mind when reading this review.", "helpfulness": 10, "user": "eddie559", "date": "June 3, 2009", "id": 31523898}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The property is MAGNIFICENT!!!! The employees work hard to take care of the guests and most everyone is very friendly!!!! For the first 6 days of our stay the star friends were only at half (or less) staff and they were WONDERFUL!!! On the 7th day of our stay the resort seemed to change with the resort trying to ready itself to come back up to full capacity (e.g. The previous week we had been trying to do different activities and were having trouble locating them at the appropriate times... on the 7th day star friends handed out an activity listing, complete with map, that outlined all the activities for the week (would have been nice to have earlier)).", "title": "Heaven on earth if you go looking for it", "helpfulness": 3, "user": "texashessfamily", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 31414585}, {"rating": 5.0, "stay_parameters": "Stayed May 2009", "text": "Things we loved about the resort in no particular order...", "title": "A Perfect Paradise Wedding!", "helpfulness": 11, "user": "nmmayra", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31414085}, {"rating": 5.0, "title": "Great Hotel", "text": "This hotel is great! They go above and beyond to make sure that every detail is addressed, and that you are happy.", "user": "TravelGoddess77", "date": "December 12, 2008", "id": 22674716}, {"rating": 5.0, "title": "We've Got Grand On The Brain", "text": "The beach is amazing, and the food wonderful. But as in most cases the people make the place.", "user": "digsafe1", "date": "December 10, 2008", "id": 22590940}, {"rating": 5.0, "title": "Fantastic vacation", "text": "The concierge's for each floor even think of things that you as a guest may not. And I don't think I heard one employee ever say the word 'no'.", "user": "terryhNj", "date": "December 4, 2008", "id": 22457070}, {"rating": 5.0, "title": "Perfect Anniversary at The Grand", "text": "You can find the perfect place within this hotel for activity, or peace and quiet. A great place to relax is the 'quiet' pool, that is huge with two big jacuzzis and just the right amount of people. And even though this pool was a little further from the main pool and bars the service for drinks was great!", "user": "CarolinaMidwife", "date": "December 3, 2008", "id": 22420785}, {"rating": 5.0, "title": "Food Made With Great Taste and Passion", "text": "Since this is an adults only resort it was great not to have children under foot.", "user": "VAD4450", "date": "December 3, 2008", "id": 22399575}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My husband and I spent a 2 month honeymoon here beginning of Oct 2008 - I'm very late writing my review! We choose Mexico b/c we wanted a 2-week trip and the best of all-inclusive world and Mexico allowed us to get what we wanted w/in our budget. I am experienced world traveller with high standards for lodging and cuisine, my husband wanted a beach, never ending drinks, and to feel safe - The Grand was a perfect choice for the two of us. The Grand is a 5-star, adult-only resort within a 5 or 6 resort Iberostar complex - it is the top of the line and Grand guests may visit/dine at any of the other resorts (via complementary golf cart shuttle service available only for Grand guests) but at Iberostar, you can only \"visit\" resorts that rank lower than yours...so no one could come to the Grand. Made you feel like royalty.", "title": "Honeymoon perfection", "helpfulness": 12, "user": "bankerchic", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32443459}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The resort is gorgeous. Marble everywhere, artistic orchid arrangements everywhere...staff cleaning 24/7 so everything is spotless. Open arrival we were welcomed like royalty and staff immediately learned our names. If you speak Spanish or even attempt to you will be treated like a rock star! My husband is bi-lingal and staff visibly relaxed around him and we were treated to fascinating conversations and extra service. Everyone can speak English, but for many it is an effort so they were so appreciative of the opportunity to speak their own language...especially the bartenders, bellhops, and service staff. Tips are not necessary but REALLY appreciated, even just a couple of dollars. Tips go a long way with the butler - we found \"suprises\" in our room - rose petal bath, fresh flowers, chocolates, Champaign and strawberries, our favorite beer refreshed daily w/ fresh limes. Many options for food and most was excellent - the buffets were spectacular. I am a vegetarian and did not have trouble finding enough to eat. The Mexican restaurants at the other resorts should not be missed - no Mexican at the Grand b/c it's considered \"too common\". We attended all of the evening shows - the dancing and costumes were fantastic, singing was ok. Italian restaurant was the best. Gourmet was great for my hubby but unimpressive for a vegetarian.", "title": "Well worth the money!", "helpfulness": 8, "user": "wine_on_vaca", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32330106}, {"rating": 5.0, "stay_parameters": "Stayed May 2009", "text": "Drink service was excellent throughout the resort, especially at the pool bar. Pool bar staff were a lot of fun and we finagled them into playing dominos with us when they weren't busy. Tip - the buffet restaurant will deliver menu food to the pool bar, I didn't see anyone else use this option but we requested burgers at the pool bar a couple of times and got them promptly.", "title": "Fabulous wedding!", "helpfulness": 7, "user": "sbmcin", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32200434}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The pools are gorgeous. The spa pool is AMAZING. It is a water therapy pool and became part of our daily routine - buffet breakfast, gym, therapy pool, juice bar, pool (water aerobics), lunch, beach (volleyball), jacuzzi, shower, dinner, cigar bar, theatre...really rough life. The cigar room is excellent, very good selection, we smoked Cubans every night.", "title": "DONT MISS OUT", "helpfulness": 13, "user": "PaulnHelen", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32185428}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We did two excursions - one full day to Chican Itza...LONG day but well worth it if you are into history and there long enough to sacrifice a day, and one half day horseback riding on the beach - this is very close to the resort so you don't lose much in travel time, nice relaxing ride thru the jungle and along the beach followed by light traditional Mexican ranch food (my fav food of the trip). There are LOTS of excursion options, but the resort is so amazing and relaxing you are going to want to spend most of your time there just enjoying it.", "title": "Paradise on Earth.. except for the rocks on the beach", "helpfulness": 11, "user": "dao82", "date": "June 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 32000249}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 33, "average": 89, "very good": 290, "terrible": 14, "excellent": 2183}, "aka": "Iberostar Playa Paraiso", "slim_ranking": 0.1, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Directly on the long, fine, sandy beach of Playa Paraiso in Mexico's Riviera Maya. Top 5-star luxury. Quiet and relaxing. Personal butler and concierge service. 24 hours all inclusive service. 4 a la carte restaurants."}