{"user_rating": 4.5, "review_count": 2151, "name": "Iberostar Punta Cana", "reviews": [{"rating": 4.0, "title": "Good Experience", "text": "Stayed at the resort for 5 days/4 nights. Here is a brief opinion of the area and the resort:", "helpfulness": 23, "user": "rs9", "date": "May 22, 2006", "id": 5188675}, {"rating": 5.0, "title": "Wonderful! Wonderful! Wonderful!", "text": "Hotel: The grounds are clean and well kept.", "helpfulness": 27, "user": "A TripAdvisor user", "date": "May 16, 2006", "id": 5144315}, {"rating": 5.0, "title": "Incredible place!!!!", "text": "Rooms: I want to thank a previous reviewer that said you should request a room in the newer area (6000 series of rooms) as they were updated. All other rooms were somewhat substandard. Although we requested the 6000 room before going, we had to raise the issue after receiving one of the other rooms. Other than some minor issues -- the new room was more than acceptable (the older room would have been less than acceptable).", "helpfulness": 25, "user": "rjlaminates", "date": "May 16, 2006", "id": 5144152}, {"rating": 3.0, "title": "Beautiful Place...Watch the food", "text": "Food: The buffet was better than average. The specialty restaurants were good, however, the reservation system they use is a mystery (particularly if you are there for less than a week). Make reservations as soon as possible if you want the specialty restaurants.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 11, 2006", "id": 5055691}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Pool: Extremely well kept and did not have a problem finding a chair in the area of our choosing.", "title": "Absolutely Pefect!!", "helpfulness": 12, "user": "rf523", "date": "May 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5046196}, {"rating": 3.0, "title": "Just back from the IB Punta Cana", "text": "This review is based on the fact we have been to three iberostars in 3 years, the other two being the IB Tucan and IB Costa Dorada.", "helpfulness": 14, "user": "sue1958", "date": "July 30, 2006", "id": 5527723}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We were one of the unfortunate families to get a musty smelling room with a toilet not working, we went straight back to Reception who were reluctant to change 2 rooms (my daughters in the other), however after speaking to Franklin who greeted us he sorted it for us.", "title": "great time at iberostar", "helpfulness": 30, "user": "bambi66", "date": "July 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5496467, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Excellent Love Iberostar Chain Repeat Customer", "text": "The rooms were standard IB rooms, very very clean, fairly spacious and adequate for our stay as we spend very little time in them. This was the biggest of the developments we have stayed on and probably a little too big for us but that is our preference. We had silly little niggles, no water in either room one day and when we rang for some it never came, the maid had also removed all bottles so we were unable to fill them. Another day the room was missed and another towels were not left. But other than that the service from the maid was the best we have experienced, friendly, helpful and always smiling.", "helpfulness": 18, "user": "cariocagirl1brasilia", "date": "July 19, 2006", "id": 5488215}, {"rating": 3.0, "title": "Poor beverage service", "text": "There were plenty of sun beds we overslept till 9.20 one day and still got a prime position by the pool. Was a lovely change not to have to rush down. The buffets were adequate in my opinion not as good as the others but again that is my opinion. The speciality restaurants were lovely, my favourite the oriental, my families was the steak house. The beach bar is lovely situated right by the beach and open till 11pm absolute heaven. The bbq at lunch is amazing and with dancing most lunches it is a brilliant atmosphere. The star friends are friendly, and not overpowering. There were however a lot less than at other hotels we have been to.", "helpfulness": 8, "user": "jer5t", "date": "July 16, 2006", "id": 5470637}, {"rating": 5.0, "title": "It was the best", "text": "Our major problem was sickness, all four of us were ill and my daughter was very sick for over a week. WE cannot say what it was we cut out certain foods and drinks but to no avail. We met quite a few other people who had mild similar symptoms, usually lasting 2 days. We have reported this to the Rep and Hotel and are awaiting tests from our doctor back home.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5465265}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "just came back from a week stay at iberostar. upon arriving, greeted with a drink at check-in. I went with my parents, my husband and two kids. We had requested two rooms in the 6000 section based on other reviews read here. We were shown adjoining rooms with garden views. I asked if we could get ocean view at which point we were upgraded for a fee \"off the books\" . My parents stayed in a single room in the 6000 section which are newer and closer to the lobby, main buffets, and the entertainment. The rest of us went to the 5000 section which was closer to the pool, and beach. These rooms are not as nice and the AC was much stronger in my parents room than ours but was fine for me. Good thing about our room was that every morning I would get up and grab a spot on the beach and pool area for all of us. Too far for my parents to do this from their room.", "title": "Just got back- 1st time stay at iberostar for this new yorker", "helpfulness": 12, "user": "Bronx4", "date": "August 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 5706976, "likes": {"liked": "— beach/pool", "disliked": "— lots of walking on hotel grounds"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Do this before 9am to get a nice spot. We ate everyday at the main buffets which was a walk for us in the 5000 section. The food was pretty decent and the fruits were awesome. Every night we ordered steak but the cuts they have are not great (lots of fat) some cold cuts did not look appetizing but use your own judgement. Entertainment was a bit corny but enjoyable. I was not expecting Broadway shows. Staff is pleasant. One major letdown is that the hotel rooms do not have irons so we were wrinkled throughout our stay. You can have someone iron your clothes from the laundry dept. but we never did. The pool is wonderful and the beach is very nice. A short walk down the beach and there are stands that sell souvenirs. Whatever prices you are given, offer half or slightly less than half. You become a pro at haggling. We went on a tour to Saona island which was nice but I have seen better. This place does have nice shells along the beach and at the end of the trip we were taken to a spot way offshore where the water is waist deep. This was the highlight for me but it was only 30 minutes out of a whole day trip. My husband and oldest child (13 years old) went snorkeling at Marinarium with nurse sharks and loved it. He said our 4 year old could have gone as he saw a 2 year old on the trip. Overall, the hotel is very nice and clean and offer lots of activities for free as well as water activities (some free and some with a charge). Would recommend it but if I go back to Punta Cana I might try another place just to see what else is available. If going somewhere else, I would still go to another iberostar chain", "title": "Best Vacation Ever!", "helpfulness": 10, "user": "misery", "date": "August 23, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5701363, "likes": {"liked": "— Location,cleanliness", "disliked": "— rooms need updating a bit"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "We stayed at The Iberostar Punta Cana and in all if my 40 years of traveling, this was by far the best. It was raining the first day but soon cleared. Check in was very quick, the main manager was biased, but Julio was there to the rescue for the the rest of the trip. We never got ill, we drank the water at the restaurants, bars but brushed our teeth with the bottled water and drank bottled water on the beach. The food was good and the restaurants may look empty,, but they book every hour and leave empty tables for the next group so it appears to be empty. But the buffet was good for us. We tipped our Camarista (maid) and left her small gifts of soaps and lotions (samples from bath and body etc.) and we had our mini bar stocked to the hilt every day, fresh towels, clean sheets and flowers in our room every day as well. The beach BBQ, bar and restaurant is great and they keep it very clean. The soda at a couple restaurants is flat but some are ok so it may just be the mix. The Saona island tour was a bust..the island is beautiful but the two hour catamaran ride and long bus ride was a down side, and actual time on the island was only about 2 1/2 hours. snorkling was no good as the speed boats were in and out of the area and it was not safe to venture to far out so the sand was pretty kicked up. We did take the $20 shopping trip to Bavaro which was nice. Yes it did take you to their special place to shop but we were able to get some great deals, you also were taken to the rum factory with free samples and the Vivaldi cigar factory where you could sample the smokes. Good trip for the price and 4 1/2 hours, which also showed how thrid world these folks are.", "title": "Wedding Ring hidden and no help fom Manager", "helpfulness": 14, "user": "david1234", "date": "August 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5623465, "likes": {"liked": "— Beach", "disliked": "— Maid"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "The staff was very friendly and helpful, and yes there are those in speedos and topless women..so what!! look the other way if you do no like it, I am sure they could say some things about other people they saw as well. We never had trouble getting a Palapa or any trouble with anything except check out. We called to have our luggage picked up 45 minutes before we had to be downstairs and they showed up as we were taking them ourselves with 15 minutes to spare...he did apologise...alot.", "title": "Iberostar Punta Cana was Wonderful!", "helpfulness": 7, "user": "CPTMOM", "date": "August 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5617752, "likes": {"liked": "— Overall it was great, the staff was excellent.", "disliked": "— No real dislikes."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Ceasar and the other Apple reps were very helpful. The sand is nice not bright white but not dirty, the resort cleans the seaweed every morning and grooms the beach. The steak house is the best restaurant in our opinion, the chairs just sink a little low in the sand, but who cares it is a beach side open air restaurant. The buffett had ants running around the bread and after notifying the head waiter they began abating the problem. The staff are always smiling and singing and put up with my limited spanish but they are willing to help teach you new words. These people work long hours and get paid very little, you are not expected to tip, but they really go beyond when they get a dollar for good service. If your drink is light on alcohol just ask them to rum it up and you will get what you want...no problem.", "title": "Hotel Great---Food..so-so", "helpfulness": 22, "user": "sramlp", "date": "August 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5564234, "likes": {"liked": "— friendly people, cleanliness", "disliked": "— food"}}, {"rating": 4.0, "title": "Excellent Value", "text": "I stayed at the Iberostar from April 23-30th. There were four of us women and we had a great time. Keep in mind, you get what you pay for. Considering we only paid $1200 per person for air, hotel and food/drinks, we felt it was a great value. No fine dining but certainly plenty of food to choose from. Make your reservations for dinner early and keep checking back to see if there are any available. They try to limit you so you only eat in the buffet. The grounds of the hotel are very nice and the beach is one of the best I've seen. My only complaint was the drinks....way to sweet for me.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "May 8, 2006", "id": 5042825}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "If I go back I will try to stay at the bavaro suites - from what people told us, they are nicer and you get more choices of restaurants. For a good value, I would definately recommend it.", "title": "Best Vacation I've been on!", "helpfulness": 27, "user": "blondi21", "date": "May 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5040252}, {"rating": 5.0, "title": "Stayed April 21 - 28 - Fabulous time", "text": "The Iberostar Punta Cana is a wonderful hotel! It was a wonderful vacation and I will return. THe most gorgeous gardens and beach I have ever seen!", "helpfulness": 20, "user": "A TripAdvisor user", "date": "May 2, 2006", "id": 5029320}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "A few tips though to make the most of your vacation so that you are as lucky as we were...", "title": "Great vacation", "helpfulness": 17, "user": "LESLIE1968", "date": "May 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 5024053}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "1. We were lucky enough to have a room in the \"new section\" of the hotel, which are the 6000 series rooms located closest to the lobby. These rooms are HUGE with a big private balcony. They have completely new furniture and are lovely! From talking to others, these rooms can make or break your vacation. Some of the older rooms did not have things like ironing boards, irons, etc. We called 2 days before going to ask for an upgrade and also upon checkin. It helps if you have someone call that is fluent in Spanish, as it is hard to communicate if you do not.", "title": "dominicans are super!!", "helpfulness": 14, "user": "nfsharp", "date": "April 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5018495}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "Hotel room okay/adequate. Air conditioner was an electric wall unit, very loud, we had it on high the whole time, and was barely cool enough. Otherwise, room was very clean.", "title": "Put on your blinders for the topless women!", "helpfulness": 12, "user": "angtino31", "date": "July 2, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "service": 2.0}, "id": 5416732}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Food was adequate, I,m not a picky eater, just be careful of what you eat.", "title": "Very good, especially the staff", "helpfulness": 23, "user": "mayo5", "date": "June 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5412529}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "BIG, BIG PROBLEM---BEVERAGES---You get 2 bottles of water & 2 bottles of soda in your mini-fridge every other day. This is the only time you can get any beverage in a sealed bottle. All bars, resturants, etc., SERVED WATER FROM PITCHERS, SODA AND BEER CAME FROM TAPS/SPICKETS.", "title": "Beautiful, relaxing resort", "helpfulness": 17, "user": "Jeannette965", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5409347}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We are a 44 year old couple from the UK and went to the DR Iberostar (Punta cana) from 6 - 21 June 2008. We have read all previous messages, mainly from the USA, and were a bit unsure as to whether we believed them or not. This is our experience:", "title": "Lovely Hotel & Staff - We had Tummy Bugs though!", "helpfulness": 4, "user": "jeffh-j", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 17206997, "likes": {"liked": "— Staff", "disliked": "— Food - tummy bug"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Check In - Very Painless after an 8 hour flight.", "title": "LOVED IBEROSTAR", "helpfulness": 4, "user": "leesha4", "date": "June 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17161959, "likes": {"liked": "— Beaches Pool Casino", "disliked": "— Drinks"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Top Tip - I agree with other posts where you give 20 dollars to the check in girl and get an upgrade - we did and got a sea-view (although you cna't really see the sea as there are coconut trees in front!) I had a ready made Spanish script for her but she - and all the other members of staff, spoke perfect English. 10/10", "title": "Beautiful!!", "helpfulness": 3, "user": "MI_Newlyweds", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16988863, "likes": {"liked": "— The Beach", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Room - No problems at all. Room was always clean, if a little dated. Annoyed that the staff/bell boy, pointed to where we should go (300m) \"to the left\" !! After a day travelling - not what we wanted. Our colleagues had the same. Please insist on being taken to your room. 9/10", "title": "Great Trip to the the Iberostar", "helpfulness": 5, "user": "cish39", "date": "June 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16980792, "likes": {"liked": "— Friendliness of the staff; beach", "disliked": "— rude tourists"}}, {"rating": 4.0, "title": "Loved the", "text": "Grounds - Well documented.... lovely, as were the Rooster, flamingos and peacocks. 10/10.", "helpfulness": 5, "user": "suegodley", "date": "June 15, 2008", "id": 16950760}, {"rating": 4.0, "title": "Nice Getaway", "text": "Pennsylvania, 1/31-2/3: My daughters and I went for a quick getaway to escape the cold. The resort was beautiful, the grounds are well taken care of. The staff was friendly and we found them to be very accomodating when we requested anything, the desk staff included. We upgraded to a jr suite (for a tip to the desk staff) and the room was very clean when we arrived, however it did smell musty. It might have been the air conditioning - not sure - but the smell lingered in my clothes even after we truned the air off and left the breeze cool the room. The maid was great - tip her the first day and she will keep your mini bar stocked and the room very clean. We left notes each day as to what items we wanted and they were always there when we returned from the beach. The entertainers & bartenders are alot of fun and certainly are friendly enough. The food was just average but certainly plenty to select from. The steak restaurant was definitely the best meal, don't miss that. All in all we had a great time and would go back again!", "user": "PATRAVELER54", "date": "February 12, 2008", "id": 13495324}, {"rating": 5.0, "title": "Amazing stress free vacation!", "text": "This was my first trip to the Carribean. I will absolutely go back! The Iberostar Punta Cana is amazing. The setting is beautiful and the staff are very friendly and helpful. My biggest question before arriving was- what is the difference between the three Iberostar resorts in Punta Cana? Well, from my experience, the Punta Cana and the Dominicana are the same except the Dominicana has more rooms and more noise. I was very content with the location of our room and the noise level at night when the shows were going on. We never went to the Bavaro- the third resort so I can't give any information about it.", "user": "bout_23", "date": "February 12, 2008", "id": 13497870}, {"rating": 5.0, "title": "Restful Vacation", "text": "Our room was spacious with a balcony overlooking tall Palm (coconut?) trees. Our flight was delayed in arriving and so we showed up at the hotel at 3am. The staff rushed the bus load of travelers through check-in and they were smiling the entire time. The grounds are maintained nicely and there are flamingos and even a very large chicken roaming around. I especially loved the turtle pond in the lobby. We went through Apple vacations and so all our transportation to/from the airport was taken care of. Also, there was an Apple representative at the hotel so me and my husband could ask questions about tours and what to expect. I really appreciated this. The staff were so pleasant. Most of them couldn't speak english fluently but they could speak bits of many languages so it wasn't hard to communicate or find someone to communicate to. I loved the open air structure of the hotel. The lobby and the buffet restaurants are all open. The few times that we encountered air conditioning were okay but I much rather preferred the open air. Our room had great air conditioning which we did use to take the dampness out of the air. Otherwise all our money and books would have been slightly mushy. We did two excursions: the outback safari and snorkeling. Both were great and gave a good experience outside of the resort. I was glad that we only went on 2 excursions because I loved just hanging out on the beach all day. I thought I would get bored but it was so beautiful and relaxing that I definitely could have spent more time there.", "user": "Cheryl Hrap", "date": "February 7, 2008", "id": 13366619}, {"rating": 5.0, "title": "Great Wedding Location", "text": "Just know that both myself and my husband were very satisfied with this hotel and we have been telling everyone to go!", "user": "WorldTravelers1205", "date": "February 6, 2008", "id": 13338021}, {"rating": 5.0, "title": "Iberostar Punta Cana- Exceeded all expectations!", "text": "Punta Cana Vacation", "user": "beachrights", "date": "February 5, 2008", "id": 13269520}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "We just got back from IB Punta Cana and it was wonderful. Don't worry about the water, the rooms or the food. Everything was wonderful. I was very concerned about the water situation and when we got there we found that the water in the hotel for drinking, food and drinks is all bottled. So no problem. Just don't drink the water directly from the spigots or shower and slow up on the Pina Colada's. The tour rep told us they are made with Coconut Juice which is a natural Diuretic. So drink one or two then try something else. They make a Mamawanda drink that is made with rum, honey and some spices which is to die for. Really good.", "title": "IB Punta Cana - Great", "helpfulness": 31, "user": "ddwaz", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5409250}, {"rating": 5.0, "title": "Great Place", "text": "Everyone was talking about upgrading their rooms and we didn't get an upgrade and the room was perfect. Clean, comfortable and spacious. Special needs for the rooms were graciously handled to everyone's likings. If you aren't in a hurry, the hairdryers are ok. Took a little longer to dry my hair than usual but they were fine. Electric current is the same as the states, but the outlets are recessed so if you don't have one of those adapter bricks on your plug then you don't need to bring anything. They do sell adapters to compensate for the recessing of the outlets in the hotel shops that are about $1.00 if you need them.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 26, 2006", "id": 5391055}, {"rating": 5.0, "stay_parameters": "Stayed May 2006", "text": "The pool was spotless, as well as the beach. Never had a problem finding a chair under the palapas, which in that sun is a must. The nightly entainment was FUN. Don't expect Broadway, but they were lots of fun, especially the shows before the big show. They get the audience involved and we laughed ourselves through the night. Constant entertainment was the rule of the day. They work very hard at getting everyone involved at the beach and at the pool.", "title": "Loved it, would definately stay here again!", "helpfulness": 14, "user": "stacey b", "date": "June 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5360563}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "Food at the buffet was good, not wonderful. They have the same thing every day, so there are no surprises at dinner time. The buffet lunches on the beach were very good. We found the one at the steak restaurant interesting. They also have soft serve ice cream which we didn't find until our last day. Bummer!! Save yourself at lunchtime for the Paella lunch they make once a week in huge frying pans by the beach. It was fabulous. Tons and tons of seafood in it and they serve it with fabulous Sangria drinks.", "title": "Wonderful - better than expected", "helpfulness": 17, "user": "glorialagos", "date": "June 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5296810}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "I must of had 5 of those at lunch. Soooo good!", "title": "More 2 star than 5", "helpfulness": 12, "user": "radar20", "date": "May 25, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5225879}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Our review has information on getting there/going home info at top, then reviews/details about all aspects of the resort and vacation, followed by a comparison to the Riviera Maya Iberostars.", "title": "Long Review - Helpful Tips - Lots of Details", "helpfulness": 12, "user": "MTMAonVacation", "date": "July 10, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 17754938, "likes": {"liked": "— Good restaurant right at the beach.", "disliked": "— No good strawberry daiquiri."}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008", "text": "So here's the setup, 2 adults, and 2 boys ages 9 and 13. We were staying in the Iberostar Punta Cana for 11 days. We have stayed at Iberostars in Cozumel and the Riviera Maya before. This was our 4th stay at an Iberostar resort. For this trip we used Apple Vacations so you will see comments below about their part in our vacation.", "title": "Bad Destination", "helpfulness": 1, "user": "milwaukeewiWi", "date": "July 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 3.0}, "id": 17692497}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Please note that we have traveled in Europe and some minor stints in Asia. We, above all else, have reasonable expectations and go well informed so that we do not expect too much or too little. We know the part of the world we are going to and understand that the standard of living is vastly different than that of the United States. Given this, we rate our vacation and give our opinions based on how much we enjoyed our time given fair expectations.", "title": "Had fun anyway, but did not quite live up to the iberostar standard", "helpfulness": 1, "user": "reeLouisiana_US", "date": "July 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 17543152, "likes": {"liked": "— The beach, the activities, and the servers were friendly", "disliked": "— The rooms, and the maid service, food just average"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Enough of that, let’s get into the good stuff.", "title": "Disgusting", "helpfulness": 1, "user": "Connie59", "date": "June 29, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 2.0}, "id": 17346327, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The airport in Punta Cana is small which means we got through fast as well. We did have to buy the Visitor Card for US$10 which is funny, since you buy it at a little counter and walkabout 15 feet to hand it to another guy. This is simply a tourism tax. In any case, after getting our luggage we were approached incessantly by gentleman wanting to take our bags for bucks. This is typical of the region’s airports so not unexpected. They would typically approach us saying something like \"Apple\" as if we would go \"Yes, take our bags!\"Just remember that these guys will hit you well before you even see the brightly colored shirts of the Apple representatives which are around the corner. The Apple reps told us what bus to get on and out the door to the parking lot we went to our bus. The buses were air conditioned nicely and we were on our way to the resort fairly quickly.", "title": "Wonderful resort!", "helpfulness": 6, "user": "micie66", "date": "June 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17213542, "likes": {"liked": "— The people who worked there.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2006, traveled with family", "text": "It was FANTASTIC! Beautiful and fun. Got red bracelets and drank 80 Virgin Pina Coladas!!! It was so much FUN!!! Dont want to be a chatty kathy so, I will say it was excellent and if you were getting married i recomend here. It was romantic and fun. Defenantly a thumbs up!!", "title": "LOVED IT!!!!", "user": "CrazyChick43", "date": "August 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18894799, "likes": {"liked": "— Clean and friendly.", "disliked": "— DONT BRING BABYS/ 1,2,3 year olds. They ruin the other guests Vacation"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "The most appealing part of this resort was certainly the beach! Lots of cabanas and chairs to relax and soak up the sun! My room was clean and acommodations decent. However, the staff was not friendly or welcoming for the most part. You can always point out the one person here or there, but it was not the norm. You would have been very uncomfortable if you did not know the basics of Spanish. Most of the staff and guests spoke primarily Spanish and those guests seemed to be able to get better service. The WORST part overall was the food - hard to do buffets for the whole stay. Most of the food was not at a good tempature: not hot, cold or fresh. Even at the restaurants on the property where they restricted reservations had a buffet. I went to the Oriental restaurant and the food was ok, but buffet service for the appetizers and desert. They did at least take your drink and meal order and bring it to the table. Overall I would not go back nor would I recommend it to anyone I care about. It is worth it to try some other resort in Punta Cana.", "title": "Loved the beach, Food was horrible!", "user": "jadoc", "date": "August 12, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 18892691, "likes": {"liked": "— The beach", "disliked": "— The food and large resort which is not amenable to getting around if you have limited mobility"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "One of my good friends and I stayed at Iberostar Punta Cana from July 9-14. the hotel is beautiful and big as well as the pool. the rooms were decent the beds could have been much better and the balcany was a nice touch...just being on vacation in general was great and to be in such a pretty place made it even better. the staff THE ENTIRE STAFF were all very nice and helped out with whatever it was you needed. the food was okay nothing special but it wasnt horrible either...the only down fall we had was there wasnt too much to do at night..they had dancing but i wasnt up for that.. I am 23 and there were a ton of couples there as well as familes with kids of all ages...I wouldnt say this is a place to go if you are single and looking to have a great time..dont go here...if your single or with your other half or family and are looking for a great beautiful place to relax this is the place. i would go back but just time with my boyfriend..", "title": "Beautiful..very relaxing...", "helpfulness": 4, "user": "missy06710", "date": "August 11, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 18849703, "likes": {"liked": "— the pool was amazingly huge!", "disliked": "— not enough entertainment at night"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We did the ATV's and that was a great time! well worth the money! it was a half day thing we saw a lot and laughed our butts off..", "title": "Iberostar Punta Cana Good Vacation:", "helpfulness": 5, "user": "KissXX", "date": "August 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 18518278, "likes": {"liked": "— White Sugary Sand and Caribbean Atlantic Water", "disliked": "— Rude, Ignoring at the Bar!"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "the airport was a breeze, I really thought we would be stuck in line forever but as soon as we got off the plane we walked really fast so we could be at the top of the line while they were checking us in at customs...it cost $10 to get in through customs so have your money ready..", "title": "Our Iberostar visit", "helpfulness": 4, "user": "sfbljnky", "date": "July 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 18390729, "likes": {"liked": "— Good food, nice people", "disliked": "— Pool closes too early, not enough nightlife."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008", "text": "The Iberostar Punta Cana and Dominica are essentially the same resort. The grounds and buildings were immaculate. There are flamingos and peacocks walking around freely. The buildings are very long so the walk to the pools or beach or back to the main lobby is a bit long but not bad. The staff was very friendly. The drinks were generally okay and the wait at the bars was short. They do have some name brand liquors and will accommodate most requests. The beach is clean with sugar-like sand. The water is wonderful. Toples sunbathing is allowed all along the beaches.", "title": "Hotel is very good, Food so-so", "helpfulness": 4, "user": "SunLuvrs", "date": "March 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14022707, "likes": {"liked": "— Beach and pools", "disliked": "— food quality and choices"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We were with a group of about 14. We mostly agreed the food service wasn't very good and was our biggest complaint. There were no 'theme' nights. What you see on day one is what you'll see all week. One bright spot was the grilled chicken along the beach restaurant areas. We ate at a few specialty restaurants at night. The seafood restaurant food wasn't too good. The Oriental food was pretty good. Everyone in the group seemed pleased there. On our last night we ate at the steakhouse by the beach. We thought that was the best of the three by far. At all three the service was attentive and friendly. We often tipped a dollar or two an more at the specialty restaurants. Tips are not required of course but greatly appreciated.", "title": "A Good Time In Punta Cana", "helpfulness": 5, "user": "Zifful", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13994526, "likes": {"liked": "— Beaches & the resort is beautiful", "disliked": "— Nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "We took the Outback Safari Excursion. We did this 4 years ago and really enjoyed it. This time it was a little different and was very commercial. It seemed they were trying to sell us something at each stop. If you go, take extra cash. They do stop at a one room school house where if you bring some school supplies they gladly accept. Several of us brought school supplies. We had the driver stop at a second school so we didn't give everything to one school.", "title": "Great Week", "helpfulness": 7, "user": "ShadRap", "date": "February 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 13873334, "likes": {"liked": "— beach", "disliked": "— food"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "My wife And I went scuba diving at Catalina Island. It is an all day excursion (7-7PM). We would not recommend going there only because of the travel time. There is a 1 3/4 hour drive one way over mostly rough roads. Then about a 25 minute boat ride over seas that may not be calm to get to the island. It may be a good palce to snorkel but hardly worth all the travel from Punta Cana. Of our 2 dives, one was down to 100 ft. with about 50' visability. The other dive was along a white sandy bottom at 45 ft. and was very good. The water clear and bright and the aquatic life was pretty good.", "title": "Excellent Resort", "helpfulness": 5, "user": "Eagle1236", "date": "February 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13844687, "likes": {"liked": "— beach", "disliked": "— food"}}, {"rating": 5.0, "title": "OUTSTANDING!", "text": "On our boat return trip from the island we stopped at Altos de Chavon. A village that looked like an old Tuscan town but was built around 1980. We didn't stay long but it was fun to visit. Check it on Google if you want to read more about it.", "helpfulness": 15, "user": "rwy246", "date": "February 14, 2008", "id": 13545774}, {"rating": 5.0, "title": "Loved the Iberostar...returning customer!", "text": "Just returned from a beautiful week at the Iberostar punta cana...9th time and second for this resort having been there when it first opened...George from animation and his crew were fabulous ...the dining room manager was great...Joannna was wonderful and helped me with my 86 year old mom...iberostar is classy, congenial and willing to acccommodate everyone...food was great, liquor top shelf and maid service and maintenance excellent...would I stay anywhere else but an Iberostar?...never again! Thanks and God Bless.", "helpfulness": 3, "user": "maryqueen", "date": "March 15, 2008", "id": 14306008}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "The title says it all. WOW!!", "title": "WOW!!", "helpfulness": 4, "user": "Kicker08", "date": "March 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 14294324, "likes": {"liked": "— The constant availability of food and drink.", "disliked": "— no clock in the room"}}, {"rating": 5.0, "title": "Beautiful Resort", "text": "OK, this was our first time to the D.R. and an all inclusive resort and was somewhat Leary but I must say that we were pleasantly surprised!", "helpfulness": 5, "user": "GreeneyesBoston", "date": "March 12, 2008", "id": 14225247}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Arrival at the airport was different with all the people trying to grab your bags to move them about 100 feet for a tip. Got a kick out of that. Then before we arrived at the Ibeostar Punta Cana the TNT rep. gave us all pointers, what to expect, where to go, etc.", "title": "Don't sweat all the small stuff it was fine!!!", "helpfulness": 2, "user": "wesa185", "date": "March 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14081938, "likes": {"liked": "— The staff outstanding!!the beach!!", "disliked": "— nite life!!!!nite LIfe!!!!!!!"}}, {"rating": 4.0, "title": "Wonderful Vacation", "text": "Check in was a breeze, we were in our room in less than 20 minutes.", "helpfulness": 9, "user": "picruiser", "date": "March 5, 2008", "id": 14065465}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "I stayed at the hotel in late August early Sept with my family. The hotel was beautiful, and the staff were amazing. I met some really good friends whilst staying at the hotel, every day was wkd, there was loads of stuff going on by the pool and on the beach all day, which you could either take part in or just watch both ways were entertaining!! The shows in the evening were ok, but seeing as i have been to an iberostar hotel in the DomRep two times before i had already seen most of them! They are really funny if you havent seen them before! Me and my friends usually went to the hotel disco which was really good, and when that finished we went to a club down the road called Pacha which was wkd and i would advise going to, it costs about $4 to get there in a taxi and is free entrance! We also went to two other clubs which were brilliant, you MUST go to MANGU and ARIEETO!! The entertainment staff at the hotel were so funny, especially Juan, Mac, and Henry!!! They made the holiday!! the staff are so attentive and go out of there way to make your stay amazing!! The chef even cooked us hotdogs at 6.00 in the morning most nights after going out clubbing!! lol!! This hotel is really good as is the Iberostar Costa Dorada on the other side of the island!! I do Warn if you want to visit other countries DO NOT come to the Dominican Republic because once you have been it is very hard to go anywhere else!!!!! email me if you wana know anything else Maddisondsouza@yahoo.co.uk", "title": "Wana go back NOW!!!!! england baby!!! woop woop!!", "helpfulness": 11, "user": "domrepcrazy", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5788537, "likes": {"liked": "— The complex was huge and spotless at all times!!", "disliked": "— Take small notes to tip with!!"}}, {"rating": 1.0, "title": "was i on vacation ?", "text": "We stayed aug 19 -29,06 at this resort.Things went from bad to worst. We had no coffee pots in the room!!. There was no room service!!!. The resort had resturants but you had to make reservations,well we did and only fri,sat,sun,we avalible.We had to eat at the buffet,the food was substandard,the smell of grease would turn your stomach.We had to try to eat there all week. Relaxing at the pool was great unless you got thirsty,you had to walk to the bar and wait in line to get your drink.they had no one walking around with any type of drinks.", "helpfulness": 6, "user": "JERZYGEORGE", "date": "September 7, 2006", "id": 5776700}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "So disappointed in the lack of services at this resort...", "title": "Loved the Iberostar Punta cana", "helpfulness": 20, "user": "ggdgula", "date": "September 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5765676, "likes": {"liked": "— hotel grounds", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Just came home from Punta Cana. We stayed at the Iberostar Punta Cana. I vacation there from August 26,2006 till September 2, 2006. It was awesome. The iberostar hotel was clean. The hotel staff was always happy and very helpful. They did speak english. The food was okay. We had seafood twice in the week. Did not get sick at all. It was myself and husband,my son and his girlfriend. The grounds of the hotel were beautiful. The ocean and beach were awesome. I love the carribean ocean. The water was clear great for snorkeling. Saw many diffrent fish. The weather was unbeleivable! We came in on saturday and it rained for a half hour because of hurricane Ernesto. The rest of the week was sunny and the temperature was in the 90's. It was not humid at all. And we escaped the mosquites. there were none to be found. And I understand that this island is known for them. The airport was very organized. You must purchase tourist card for $10.00 when you arrive. And you are all set. I met many people from different parts of the world. That's what makes a vacation fun! I would recomend Dominican Republic to anyone and everyone. The hotel to stay at is the Iberostar Punta Cana! I felt safe at the hotel had no problem with anything missing. Need to use safe! Do not drink the water at all. Use bottle water to brush your teeth. You will not get sick. Keep away from pina colida's they use real coconut it is a natural laxative. I will definately be returning for a 2 week vacation next year. Awesome!", "title": "You can't go wrong!", "helpfulness": 31, "user": "RAB4um", "date": "August 30, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5728114}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "One of the best trips we were ever on! My wife and I celebrated our 20th and we had a blast. I was a little nervous because it was our first time there, and I read some negative comments. I truely believe that those people are never happy. The worst part of the trip was the ride from the airport. It is about a 40 minute ride through the poor sections of the DR. Once you get there you are greeted by the staff. They explain everything to you, and in english, not the best, but good enough. We arrived around 10:45 and our room was not ready until 1:30, so we made sure we packed our suits in our carry-on. They give you an id braclet as soon as you arrive, so you can eat and drink right away. Trust me, you do not want to go right to your room, because you really want to take a walk around and see the grounds.", "title": "IBEROSTAR IS FANTASTIC", "helpfulness": 15, "user": "soccaref", "date": "August 26, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5712044, "likes": {"liked": "— When you get to the resort go there with a plan and find out exactly what you want to do first"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "We have stayed at Iberostars for over 10 years now. This was our second time here and also we chose this as the site for our destination wedding. We went on 7/3 for 10 days.", "title": "My Iberostar Wedding", "helpfulness": 5, "user": "PalomitaBlanca", "date": "July 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18382692, "likes": {"liked": "— My honeymoon suite!", "disliked": "— Credit card theft!"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We booked through out travel agent who used Funjet. Besides a missed connection, everything else was smooth sailing. We got to the hotel and they even had a sign in the lobby welcoming all of our 64 guests. That was really nice :)", "title": "Could have been better", "helpfulness": 2, "user": "vmoli", "date": "July 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 18377606, "likes": {"liked": "— The friendly young staff", "disliked": "— to noisy"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The service is great at this hotel. From the restaurants, to the staff, they go overboard trying to please you, always with a smile.", "title": "Not Excellent, but Not Bad Either!", "helpfulness": 9, "user": "CooksX3", "date": "July 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 18101322, "likes": {"liked": "— The beach!", "disliked": "— Staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "The grounds and beach are immaculate. The ocean water is SOOO gorgeous and BLUE!!!!!!!!!!!!!", "title": "Great time!", "helpfulness": 5, "user": "1coolchick", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18114849, "likes": {"liked": "— Great beach!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We had so much fun, kayaking, snorkeling, doing a catamaran excursion and drinking lots with all of our family and friends.", "title": "O la la in Punta Cana", "helpfulness": 7, "user": "CarolinaCowboy", "date": "July 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17770642, "likes": {"liked": "— Thw workers were very nice", "disliked": "— Some restrooms needed tolet paper"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "first the good - beautiful pool, grounds and food and we always had lots of hot wonderful water no matter when we took a shower", "title": "some good - some bad", "helpfulness": 4, "user": "moneycatchers", "date": "March 24, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 14499433, "likes": {"liked": "— pool", "disliked": "— walking distance and casino"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "bad - WAY too much walking from one end of the complex to the other. The only beer is local - not so great and i have been on many other islands and have always found frozen drinks but not here. The drinks were EXTEMELY sweet and watered down. Even my rum and coke was bad. There were 4 of us and we all ended up just drinking cokes because there were not any \"frozen\" drinks. That was very dissappointing for us.", "title": "another awesome repeat stay!", "helpfulness": 5, "user": "gottatravelsoon", "date": "March 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14437720, "likes": {"liked": "— Excellent service.", "disliked": "— Everything was just fine."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We were guarenteed 3 reservations for dining - unfortunately, we only got to use 2 because the other one would have had to be at 10 PM at nite. They only book from 6:30 -10 PM and only about 10 tables at each restaurant so we never got to go to the steak one. I heard it was very good from other people. If you get stuck for reservations, do go to the \"Hard Rock\" on premises. You can get decent sandwiches etc. there.", "title": "Best Vacation Yet!", "helpfulness": 8, "user": "Mels3315", "date": "March 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14386815, "likes": {"liked": "— The BEACH!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "If you are in a wheelchair, also be aware that it is not handicap friendly. On the grounds it is paved but the walk from the pool to the beach is a good eighth of a mile. OK if you can walk not so great if you can't! The walk from the \"casino\" to our room which was midway in the resort was over 1/2 mile. Speaking of the casino .... don't go there with the intent of expecting anything. Machines were outdated and there were only about 30. It also didn't open until 6:30 PM.", "title": "Amaaaaazing!!!!!!!!!!! Loved It!", "helpfulness": 2, "user": "BrooklynCutie", "date": "March 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 14377469, "likes": {"liked": "— food,sun,beach,"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We also had the same result with waiting for a room when we arrived. We had to wait AT LEAST an hour, which did not make us happy but I must say that our room was nice and the maids were very nice (we left a $2 tip everyday). We always had lots of water and pop in our frig and our safe worked once we got a key from the main desk.", "title": "Frequent vacationer - Great All-Inclusive", "helpfulness": 5, "user": "CaesarKelley", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 14325383, "likes": {"liked": "— pool", "disliked": "— No pool bar"}}], "location": {"country": "Caribbean"}, "stars": 3.5, "variance": {"poor": 56, "average": 189, "very good": 660, "terrible": 43, "excellent": 1203}, "aka": "Iberostar Punta Cana Hotel Punta Cana", "slim_ranking": 0.158415841584, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Directly on the beautiful, sandy beach of Bavaro (Punta Cana). Friendly atmosphere. Beach restaurant. Set in a palm grove. Attractive pool area. All inclusive (generous, varied buffets for all meals)."}