{"user_rating": 4.0, "review_count": 2119, "name": "Iberostar Paraiso Beach", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Great shorts and sandals location !!! Just relax and have fun !!!", "title": "Great affordable getaway !!!", "user": "Murray64", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117847821}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "For the money it is the best deal around.", "title": "Perfect for the price and our expectations.", "helpfulness": 4, "user": "kristenlblythe", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117799015}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My boyfriend and I stayed at the Iberostar Paraiso beach from August 28 to September 3. We had searched every resort in our price range in the Riviera Maya before deciding on this one and we couldn't be happier with our decision. I should first say that we went during the off season which I think made things a little easier. There was still a good amount of people for entertainment but there were no issues with over crowding. We arrived early and were able to check-in as soon as we got there. We were also able to pick the building we wanted. We choose 3521 so it was half way between the lobby and the beach, overlooking the pool. We never had problems with getting a lounge chair at the beach or the pool. We stayed for 6 nights which guaranteed 2 dinner reservations but we were actually able to book the specialty restaurants every night. The rooms were clean, cool and spacious. There was cable TV with some English channels plus regular hotel amenities. The pool was huge and active. It was warm, not very refreshing and towards the end of the day got a little slimy, but not enough to really matter. The food is good, nothing outstanding but I don't think any all inclusive places have excellent food. At one place or another food and drinks were available 24-7. The service was excellent, there was on-site shopping and entertainment. The Paraiso Beach is 1 of 5 connecting resorts. The Beach shared Del Mar, the 3 other resorts are upgrades but from I what saw, not worth it. I loved every bit of the trip and would definitely recommend it and will be returning myself.", "title": "Great Sandy Beach and Huge Pool", "helpfulness": 7, "user": "bookangel08", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117710527}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I have been to the Mayan Riviera 4 times and this was a really great resort for friends and family at an excellent price . We were 6 people and had three rooms on the same floor. We were here the last week of August and while there were families with children not so many school age Americans because school has started in some states. I was concerned about the weather but only had a couple of intense tropical rain storms that lasted about an hour. The rest of the week was beach weather.", "title": "Wonderful First-Time Experience! Would Go Back in a Heartbeat...", "helpfulness": 3, "user": "Zavibaby", "date": "September 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 117642703}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The ambiance of this resort is traditional Mexican as as opposed to modern. The rooms were large and attractive and had a a small drying wrack on the balcony. The bathrooms were large enough to change your clothes in. We had a problem with the AC on arrival and someone was down to fix it immediately. Mattress was firm but I slept well.", "title": "Very nice", "user": "Brooksy116", "date": "August 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117424172}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This is a nice hotel for beginner all-inclusive goers, but if you've been to many all-inclusives then probably isn't for you. The food is good, but couldn't always find what I was looking for and what I was used to at other Riviera Mayan hotels. Positives: There is a lot to do, a lot of room around the pool and the beach, rooms are kept up pretty well, the beach and waves are great!, had a blast in the water. Some negatives according to OUR experience: no tub in room, resort is TOO big - it is a chore to go anywhere and you have to plan it because there is no quick way to get back to your room, I think I rode the \"trolley\" once during my whole week stay - it is never around, my family members had trouble calling out - the phone card they had was blocked by the hotel - they made you purchase their's, the nightclub is very far away because there are 4 resorts on this property, however the nightclub was a blast!", "title": "Average All-Inclusive, a few good things", "user": "mcinar", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116782967}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Hope this helps, I always try to be honest and objective when giving reviews. I have been to a few better all-inclusives, but this is a pretty good deal for the money. I think perhaps the reason why this property doesn't live up to others in Cancun is because it is not a Mexican-owned resort, I believe it's owned by some European company and standards there are obviously much different. People expect a lot more for their money in Mexico and can usually get it.", "title": "It was good except the humid heat and invisible mosqitos", "helpfulness": 4, "user": "omega200229", "date": "August 14, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116684164}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "After reading hours of reviews of this hotel and other hotel we decided on the Iberostar Beach. How bad or good can it be? Well here is the result after 7 days at the Beach.", "title": "\"Not horrible, but will try somewhere else\"", "helpfulness": 11, "user": "Omahaeater", "date": "August 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116640759}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "First for all first timer to mexico when you arrive at the airport and are about to leave the costum , go straight to the exit of the airport. Once you leave the costum area there are Timeshare shark waiting for you . Dont look and talk to them just leave the airport. All the Vacation Rep are waiting outside the airport . We book with transat Holidays and once we were outside the airport the rep showed us to our bus. Transfer to Hotel were easy. It took 20 minutes. The first thing that hits you right in the face is the humid heat when you get out of the airport. One eldery women fainted and needed medical attention. So if you can handle the heat dont go in August. Its like staying in a sauna for 7 days straight.", "title": "Has it's pluses and minuses, probably won't return", "helpfulness": 2, "user": "libbygirl58", "date": "August 12, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116621384}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We came prepared and brought 3 bottles of Bug spray but those bottles were in the check in lugguage and once you arrive at the hotel you will get atttack. We come from edmonton and this year we have 100 times more mosqitos then usual. I cought a bucket full of mosqitos in just one night in my light trap. So I wasnt worried about bugs in Mexico. Boy was I wrong. If you can see them its easy to wait and kill them but there are so tiny( fruitfly size). Most of the time the bug spray works( cover yourself from head to toe) . Hotel room was spacious. AC worked nonstop in our room the whole time. When you arrive we recommend to sweep the room for mosqitos. The people who clean the rooms leaves the door open while cleaning.If you do that you will have no surprise at night. The mini bar fridge is filled every second day. We left a note every day with a 20 pesos tip and it was filled everyday with our requested drinks. Room was cleaned everyday and extra towels were left for us. We tried to get to know the maids and staff and this helps alot if you need something from them.", "title": "Very nice stay", "helpfulness": 1, "user": "BrianandSusan", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116618738}, {"rating": 4.0, "title": "great place to go", "text": "Jus got back from Iberostar Paraiso beach and it was great. The place is Huge ( I was a little worried about this) but it's not that bad and it's beautiful to look at. We walked a lot thru our site and also the neighboring sites (maya, lindo and del mar) Everywhere it's just so beautiful. The food was good and you can eat at 3 restaurants, that require a reservation, during a one week stay. They were all good. The Beach is nice, I was suprised at the amount of people on the beach and yes there are rocks in the water but you can't miss them so they're not a problem.. For me, this was the only downside of this vacation but it wasn't enough to bring me down. I really don't get the bad reviews that I've read for this resort, I wonder are these reviews real...", "user": "Julielowson", "date": "February 27, 2007", "id": 6849316}, {"rating": 5.0, "title": "Just great", "text": "It was so great.", "user": "MexicanSun", "date": "February 26, 2007", "id": 6840126}, {"rating": 5.0, "title": "Didn't Want To Leave!", "text": "The best vacations I ever had.", "user": "KatGayle", "date": "February 20, 2007", "id": 6816158}, {"rating": 5.0, "title": "Great Resort", "text": "We stayed there for one week.", "user": "kaola", "date": "February 18, 2007", "id": 6807939}, {"rating": 5.0, "title": "Paraiso Beach - One word \"FABULOUS\"", "text": "The hotel rooms were so big and just wonderfull.", "user": "remocamel", "date": "February 16, 2007", "id": 6803040}, {"rating": 5.0, "title": "fantastic holiday", "text": "we stayed here from 19 feb 2006 for two weeks. It is one of the best complexes ive ever stayed at the food and facilities for fantastic!", "user": "ju1es22", "date": "February 15, 2007", "id": 6797603}, {"rating": 5.0, "title": "Beach is gorgeous and relaxing", "text": "Don't worry if your the kind of person who likes to explore there is a courtesy bus into playa del carmen which has lots of restaurants and bars runs every hour,there you will also find boat trips and people selling excursions , i'd advise to book with them instead of your rep as you'll save yourself quite a bit!", "user": "lexiChicagoIllinois", "date": "February 15, 2007", "id": 6797576}, {"rating": 5.0, "title": "2nd time around, still in love with the Beach!", "text": "The animation team were great from dance lessons to volleyball on the beach, the've always got somthing organised to keep everyone busy!", "user": "MamaSita27", "date": "February 13, 2007", "id": 6785014}, {"rating": 5.0, "title": "Loved the hotel and service", "text": "The complexe is masive as it has 4 hotels, but the good this is the little train that runs from the hotel entrances to the beach so saves your legs!!", "user": "travelbug277", "date": "February 13, 2007", "id": 6784859}, {"rating": 5.0, "title": "Loved it!!", "text": "Definatley a 5* rooms clean, great service and facilities what more can you ask for!", "user": "DinoRossi", "date": "February 10, 2007", "id": 6777702}, {"rating": 5.0, "title": "Great Stay at the Iberostar Paraiso Beach", "text": "We just returned from IPB where we stayed from 02/26/07-03/05/07. I figured since I relied so heavily on reviews from other travelers, I better give my review of this resort in return. First off, we had incredibly great weather all week. It was sunny everyday with occasional passing clouds and the temp. in the high 80's-90 F. It remained warm in the evenings and I'm glad I brought enough sleeveless shirts since I wore them every evening without a jacket or coverup ( and I was still warm).", "user": "sonnec1", "date": "March 8, 2007", "id": 6933302}, {"rating": 5.0, "title": "My 2nd Home, 1st in my heart!", "text": "The grounds of the resort were as beautiful as everyone else described. It's definitly carved out of the jungle and the walkways throughout the place are surrounded with a lush tropical feel. The place is huge but I didn't think the walking was all that bad or that far, as others describe. However, my husband and I are very active people and we really enjoyed the walks from the beach to the lobby since it was so scenic. Just don't bring uncomfortable shoes since I saw many gals carrying their high heels walking barefoot. We really enjoyed watching all the peacocks, parrots, swans and other countless birds roaming around the resort.", "user": "Senor-Brian", "date": "March 7, 2007", "id": 6927887}, {"rating": 5.0, "title": "Fantastic!", "text": "The rooms of the resort were fairly large where we had a standard room, nothing special. The maid service was adequate and we enjoyed their towel sculptures. I liked the sitting area with the couch and lounger that the room provided and the balcony was nice as well.", "user": "Mexic01", "date": "March 6, 2007", "id": 6921156}, {"rating": 3.0, "title": "Beautiful but I will go elsewhere!!", "text": "The food at the buffet was pretty good with good enough variety. Since we stayed 7 nights we were allowed to choose 3 specialty rest. so we chose the tropical, steak and Mexican rest. The tropical was ok as I thought my snapper tasted a little fishy, my husband liked his \"plate of meat\" since he does not care for seafood. The steak rest. was surprisingly very good. I usually tend to stay away from the beef in Mexico, but the tenderloin and beef ribs were very good. The Mexican rest. was pretty good as well were able to find more authentic Mexican dishes. The breakfasts were great, and we also enjoyed the ice cream stands offered throughout the resort. I would recommend trying the taco stand in the shopping center, the tacos are made to order and were very good. The only food I didn't care for was the barbque hut on the beach near the bar.", "user": "kcagent007", "date": "March 2, 2007", "id": 6901558}, {"rating": 3.0, "title": "Just okay", "text": "We thought the entertainment the resort provided was very good. The \"Star Friends\" entertainment staff did their best to get everyone involved and although I thought the audience participation would be a bit \"hokey,\" I enjoyed myself. We thought the \"Las Vegas\" show was excellent.", "user": "playaDenver", "date": "February 28, 2007", "id": 6891553}, {"rating": 5.0, "title": "heaven", "text": "i had no idea a resort could be this beautiful before setting foot off the shuttle bus onto this resort. beautiful open lobby with helpful receptionists. we arrived early, but they placed out bags in a watched room and we set off to roam around. we went to the pool area and were simply stunned. it was like a pool party. so many people having fun, tanning, and drinking at the swim up pool bar. the ice cream and pizza buffet area is something you must try.", "user": "erin k", "date": "February 9, 2007", "id": 6774105}, {"rating": 5.0, "title": "Breathtaking!", "text": "we got into our rooms an hour later and the rooms were gorgeous. beautiful tile standup showers and granite countertops.", "user": "dncr23", "date": "February 7, 2007", "id": 6752736}, {"rating": 4.0, "title": "A Beautiful Wedding", "text": "it did take us almost 2 full days to really know how to get around this resort since their are so many different areas and paths, but the beautiful scenery more than makes up for it.", "user": "Robbins1", "date": "February 6, 2007", "id": 6751613}, {"rating": 5.0, "title": "loved the beach!", "text": "the hotel overall has a lot to do-shows, games-and don't forget the disco.", "user": "chrissybobo", "date": "February 6, 2007", "id": 6751467}, {"rating": 5.0, "title": "Great Vacation and Wedding!!", "text": "the beach is a little walk but worth it. beautiful!!!!", "user": "wallythebeerdog", "date": "February 3, 2007", "id": 6738620}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "My husband and I and our 14 year old teenage daughter spend a fantastic week at this resort. We enjoyed many of the resorts activities including the bike tour, archery, dance lessons. My husband even won an award in an airgun tournament. The nightly evening entertainment was very well done every night. The staff at the resort were excellent they worked very hard and always with a smile. I would recommend that you book your A la carte restaurants as soon as you get there.", "title": "Fantastic Family Vacation", "helpfulness": 2, "user": "monacofun", "date": "August 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116579578}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "This resort is great, and has it all.", "title": "Loved this resort", "helpfulness": 2, "user": "LemonCalgary", "date": "August 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116576894}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "the pools are huge, and the beach is really nice. We spent most of the time at the pool, and the resort activity staff were great. By the end, they knew our names and we talked to them all the time. The activities that the resort offers are also great.", "title": "Much better resorts out there", "helpfulness": 3, "user": "beachlivin2", "date": "August 10, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "value": 3.0, "service": 3.0}, "id": 116533309}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This resort isn't in a town, which was nice, as we didn't feel like we had to leave the resort to go out.", "title": "Terrible Food and won't be back", "helpfulness": 1, "user": "ABrownBear", "date": "August 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 116363765}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The buffet restaurant was open for breakfast, and then would close at 10 am, and reopen at 1 pm for lunch, and then at 6:30 for supper. If you wanted food inbetween there were selections by the pool and by the beach, so you never have to worry about going hungry. Oh and the ice cream stand is wonderful.", "title": "Beautiful Resort", "helpfulness": 6, "user": "Caribbean4me", "date": "August 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 116325925}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We just got back from a week at the IBEROSTAR PARAISO BEACH. A couple and 1 year old child, we made reservations 2 days before leaving and they were able to accommodate us with no problems.", "title": "Great time, would go back again.", "helpfulness": 6, "user": "Barb H", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117330274}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Food", "title": "perfect resort", "helpfulness": 1, "user": "maxrealty", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117146325}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "There are 7 restaurants that require reservations. We were told that 3 reservations are guaranteed upon booking, now that means that you will get all 3, but not necessarily in the restaurant you want or the time you want, it really depends on availability. To book, you had to go see the concierge in the am between 9-11 or pm 4-7. We tried the Japanese and Mediterranean restaurants. The Japanese is around hibachi tables with something like 12 people around it. The white rice wasn't all that great so I would recommend the fried rice which was yummy. Our \"performance\" was ok, nothing to write home about, but if you've never actually seen one before, check it out. The portions weren't like North American size, so someone used to eating a lot might still be hungry afterward. Overall it was fine. The Mediterranean restaurant was quite good. I had the surf and turf with a nice chunk of meat in my lobster tail. The appetizer bar is full of seafood items, so if you are into that, I would definitely recommend eating there one night. There was a trio walking around playing music which was nice.", "title": "Used to be good", "user": "Peter F", "date": "August 20, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 3.0, "service": 1.0}, "id": 116993832}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The 2 buffet restaurants and beach snack bar always had lots of food to choose from. The big buffet restaurant switched up every night and had a wide variety of food. There was the standard pizza and pasta, just in case though and the pasta came in handy for the baby when all else failed. There was always some big hunk of meat being carved along with many other dishes to choose from. Even the dessert was very varied and lots to choose from.", "title": "4th visit to this Resort - excellent", "helpfulness": 3, "user": "Hornette123", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116961632}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Overall, in my opinion, the food was good, keeping in mind that they are constantly preparing food for a huge amount of people. We never went hungry, that's for sure.", "title": "Nice resort! Good service. Food....meh!", "helpfulness": 5, "user": "Phil_Karp", "date": "August 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116863197}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 3.5, "variance": {"poor": 83, "average": 251, "very good": 665, "terrible": 48, "excellent": 1072}, "aka": "Iberostar Paraiso Beach Hotel Playa Paraiso", "slim_ranking": 0.6, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Directly on the beach of \"Playa Paraíso.\" Imaginatively designed lake – pool. Convention centre. The holiday complex is perfectly integrated into the tropical landscape."}