{"user_rating": 3.5, "review_count": 650, "name": "Ibis Cologne Centrum Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Myself and my boyfriend have just returned from a weekend away to Koln. We stayed in the Ibis as it was cheap and close to the City center.", "title": "Good value for the money", "helpfulness": 2, "user": "annomonus", "date": "July 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8222341, "likes": {"liked": "— clean and cheap"}}, {"rating": 4.0, "title": "Everything we wanted", "text": "The room and bathroom were very clean although the bathroom was very small. It is about a 10 minute walk into the City center which is very convienant and you do not need to pay for taxi's.", "helpfulness": 2, "user": "Roversfans", "date": "February 24, 2007", "id": 6833967}, {"rating": 3.0, "title": "Great Karnival", "text": "The front staff were very helpful.", "helpfulness": 1, "user": "Steve_Cowley", "date": "February 20, 2007", "id": 6818279}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "Koln is a very nice City.", "title": "Well worth it", "helpfulness": 2, "user": "clanjc", "date": "January 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6571984, "likes": {"liked": "— amenities nearby", "disliked": "— no tea/coffee making facilities in room"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Hotel clean & modern, staff very friendly. Large selection at breakfast buffet - served in large bright breakfast room. Location excellent - 4 tram stops from cathedral but also plenty of bars and restaurants in vicinity. Room small but newly refurbished and spotlessly clean - why spend time in hotel room when Cologne has so much to offer !!!!", "title": "Great location, Good value, OK service.", "helpfulness": 4, "user": "SamDub", "date": "October 22, 2006", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5983755, "likes": {"liked": "— location", "disliked": "— rude-snappish front desk staff"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2005", "text": "I booked the Ibis Barbarossaplatz for a stag weekend (bachelor party) in Cologne. It was very cheap so of course we weren't expecting anything other than somewhere to flop, but we were still disappointed with the level of service. The big problem was that despite believing I'd booked 7 twin rooms, most of the rooms allocated turned out to be doubles - meaning many of the men ended up sharing a bed! When I asked for alternative solutions, the receptionist was rude to the point of hostility and refused point blank to check with the other Ibis hotels in the city for availability.", "title": "cheap, but you get what you pay for", "helpfulness": 8, "user": "Nezzerus", "date": "June 26, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 1.0}, "id": 3611758}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "I stayed here for a few nights with a friend and found the hotel to be clean,the rooms a bit small but more than adequate for a short break.Continental breakfast was served in the restaurant and had plenty of choice.", "title": "CLEAN AND BASIC", "helpfulness": 1, "user": "tf1803", "date": "April 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4981631}, {"rating": 3.0, "title": "Basic Good Clean", "text": "A short tram ride away from the main railway station and Cathedral,a twenty min walk if your feeling energetic. Very close proximity to the student quarter of town which has many good bars a restaurants.", "helpfulness": 1, "user": "F00dman", "date": "October 9, 2005", "id": 4002897}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We stopped one night hear on the way to Coatia, & one night on the way home to England.The rooms were small but OK for one or two nights.The Hotel was clean. The Restaurant in the Hotel only served Breakfast, but this was very good. You have to eat out at night, but the reception staffwere most helpfull, recomending places to eat. The bar was nice with very good Staff.", "title": "Good hotel excellent value", "helpfulness": 11, "user": "kenLiverpool", "date": "October 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3981398}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "If your looking for a decent clean room with a good location & facilities then I'd recommend this one because its easy to get to from the centre & is better value for money than the centre hotels.", "title": "Fantastic Value And Very Comfortable", "helpfulness": 4, "user": "lnt999", "date": "September 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3946964}, {"rating": 4.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "I'm normally a \"taxi from the airport\" person but, like another couple we met, we travelled from the airport by train which is really easy to find (downstairs in terminal 2 tickets are 2.10 Euros from the machine [key in 2000 for koln station]- its best if you can take some change before you go) but we took a taxi from Koln station to the hotel because we struggled to find the underground station. The taxi was only 7 euros but we later found out that we were only yards from the underground which is downstairs in the corner of the station in front of the departure board (go to exit near the dom cathedral square). If we had managed to find it then taking the number 16,17,18 or 19 train/tram would have taken us to barbarosoplatz station which is only about 30 metres back up the line to the Ibis hotel so if you look out the right hand window of the train before it pulls in you'll probably see the hotel. Now don't go thinking that because its next to the line that its noisy, it isn't & I'm very particular about getting a quiet hotel room. We had a back room & it was quiet as a mouse except for the odd room door closing in the morning.", "title": "Much better than expected!", "helpfulness": 2, "user": "dgrbleu2", "date": "September 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3937649}], "location": {"country": "Germany", "continent": "Europe", "city": "Cologne"}, "stars": 2.5, "variance": {"poor": 41, "average": 187, "very good": 329, "terrible": 6, "excellent": 87}, "aka": "Accor Cologne Centrum Hotel", "slim_ranking": 0.220640569395, "description": "The Ibis Koeln Centrum hotel is located in the city centre of Cologne, 1.5 km from the Millowitsch Theater and 4 km from Koln Deutz Messegelaende. The airport is 20 km away. The hotel has 208 airconditioned rooms with WiFi Internet access, including 3 with facilities for persons with limited mobility. You can also book 2 meeting rooms. A bar, 24 hour snacks and private undercover pay parking are at your disposal. There is a golf course 10 km away. Pets accepted."}