{"user_rating": 3.5, "review_count": 503, "name": "Ibis London Greenwich", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Pleasant room, clean and a little larger than most Ibis rooms. The bathroom was functional and well lit. We were charged for the car park but there was no room in it to park the car until 8pm by which time we had already had to find another car park, they did refund this though. The hotel is well located and It’s conveniently attached to a wonderful Café Rouge so we had breakfast there instead of the hotel.", "title": "Pleasant room, good location.", "helpfulness": 1, "user": "JeaneAOD", "date": "June 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 32132294}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I have just read a few reviews of people who stayed around the same time as myself and my partner - we were there for 2 nights as the other half was running in the London Marathon. We arrived and were checked in efficiently. On viewing the room it is what you expect from an Ibis hotel, rather like a travel inn. There is a large bed (which is pretty firm), flat screen TV, remote, small clothes hanging space, tea and coffee making facilities, desk, chair and Wifi access and keyboard if you needed it. The bathroom is sufficient with a shower over the bath and soaps provided (no fancy toiletries I'm afraid). There were only two pillows in the room, but as soon as I asked at reception extra ones were provided and so was a hairdryer - I was a bit surprised there wasn't a built in one in the bathroom, but it was fine by me to \"borrow\" one from reception. The staff working on reception were fine and efficient and pretty helpful. If you wanted an alcoholic drink or to hang out with visitors you would go next door to Cafe Rouge, where its pretty laid back, there is a covered, heated area outside on the balconies to eat and drink and the staff there were really friendly and attentive. The food there is also nice, and the continental breakfast (for which you need to collect a voucher from reception) is only £4.75, and includes a large fresh orange, coffee, pan au chocolat, Bon Maman preserves and french bread. There are also ironing facilities if you need them. The hotel is really central for Greenwich nightlife, and only a 10 minute walk from the DLR. We would also recommend the Rivington Bar and Grill which is just around the corner from the hotel if you like fresh seafood and oysters. I can't complain at all about the hotel and if I stayed in Greenwich again I would stay there again. People may have been a bit upset about the increased prices the night before the marathon (approximately £40 per room extra), but this happens at the majority of hotels around London on what they call an \"event weekend\". PS Another good point, I thought, was that the bedroom doors all closed really quietly, which is a bonus in the mornings if you want a bit of a lie in.", "title": "Booked for Easy Access to Start of London Marathon But Pleasantly Surprised!", "user": "sazzle24", "date": "April 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 29025371}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Dreadful hotel with miserable staff and very poor quality accommodation", "title": "Avoid", "helpfulness": 1, "user": "ltfs", "date": "April 12, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 27871161}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Not even 1* the only good thing about this hotel is the location nightly stay very expensive dearer than quoted £113 for a night, staff very rude with very bad attitudes, bar in reception was appalling no tea, no wine, no gin, no beer, no ice and lemon for drinks if you were lucky enough to get one the person looking after the bar/coffee had no idea or motavation, no comfortable lounge for guest to sit in just the reception area which was cold, no towels or pillows in very small room had to ask for them, don't bring your cat as there is no room to swing it, and car parking was so painful I don't know where to start, so if you are planning on staying at this hotel don't forget to pack your sense of humor because you will need it.", "title": "3* Hotel with a 5* star price tag", "helpfulness": 2, "user": "jvc12", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 27085516}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My wife and I have stayed here several times, and our only complaint is the silly and rather annoying extra charge for refills of coffee at breakfast (the breakfast in other Ibis hotels is much more generous, being self-service). But the Café Rouge is attractive and evening meals are good. The staff is pleasant, the location is excellent, and the parking (just) big enough- Greenwich is a very good base.", "title": "Good value for money", "user": "Carmens_hubby", "date": "March 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 26500257}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Stayed here for one night - standard Ibis offering but with good, friendly staff and Cafe Rouge useful for lunch and limited choice breakfast.", "title": "No frills but clean and good value", "user": "The_Traveller006", "date": "February 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 55967488}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Both our rooms were fine - a couple of maintenance niggles but nothing serious.", "title": "Not the greatest but no complaints", "user": "BandiB", "date": "February 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 55707151}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "Car park very busy but we always found space when we needed it.", "title": "perfect place to commit suicide", "helpfulness": 3, "user": "newtsystems", "date": "December 14, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 51242984}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Would definitely stay here again for a good value overnight in this part of London.", "title": "Never Again. Rude Unhelpful Staff. Smokey Bathroom.", "helpfulness": 1, "user": "RegularBusTraveller", "date": "December 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 50715202}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "Stayed here twice in the last week on business and as I only really want a clean, warm room with a comfortable bed and a clean bathroom then things were fine, though of course stand IBIS decor and fit out.", "title": "Good all round, was pleasantly surprised!", "user": "Anniesman", "date": "November 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 50277599}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Stayed for 3 nights for weekend break in london was very happy with hotel it has everything you need if you are out all day sight seeing then crashing down for the night. Location is excellent lots of places to eat drink and shop, train station very close by you can get over head train (national rail) or use DLR tube which runs to canary wharf train station then you exit and hop accross the road to canary wharf tube station, which has access to the other tube lines. A small cinema a few steps away with very comfy chairs. We did not have breakfast so could not comment but there is a mcdonalds next to DLR station so could have it there? however a kettle is provided in the room so we just made a brew in the morning then set off exploring.", "title": "great price great location perfect for our needs", "user": "vickeh", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 61133633}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "It does depend what you want in a hotel but for a weekend sight seeing this in my opinion is perfect, I have stopped and do stop in a lot of hotels regulary on business and this is not the same class that I am used to but then again I dont have to pay for my business hotels, I would certainly reccomend this.", "title": "Good basic hotel", "user": "Empathology", "date": "April 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 60109099}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Fit for purpose.", "title": "Clean, simple & well located but nothing special", "user": "BigMikeBath", "date": "April 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 60082493}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Well done IBIS and thank you for a fab weekend and a fab price!", "title": "Okay for one night", "user": "Dorsetbay", "date": "March 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 59724437}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "PS Yes parking is sparce but I was lucky and at £3 per night you can not argue with that", "title": "Peon to the Durability of Cardboard", "user": "groggery1", "date": "February 18, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 56356603}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "An absolutely horrible example of a hotel, our room had a stong stench of urine, the bathroom was disgusting and smelled really bad. We complained and the french speaking receptionist was useless and said she had no other rooms, then the night manager , another non-english speaker got us a room only this time it had a window that wouldn't close properly, the bedside lamps didn't work, the curtains fell off the rails....etc etc, a disasater and not good value at all. If you enjoy living in filth, and smelling urine in your room and being kept awake by cold drafts and sirens then stay here. I had to leave and go to the Holiday Inn Express a bit dearer but million times better in all aspects.", "title": "If you have very low standards of hygiene then stay here - otheriwse stay in the Holiday Inn Express!", "helpfulness": 1, "user": "pAKL", "date": "November 6, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 48660832}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Re-cap, Ibis in Greenwich (and Liverpool) are filthy, the staff don't care and the clientelle who say it is good ar elying or else they have very very low standards of hygiene themsleves.", "title": "Ideal for Maritime Museum Visit", "user": "cairnstar", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 44217059}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Note i HAVE NO CONNECTION TO THE hOLIDAY INN EXPRES BUT FOR AN EXTRA 10 POUNDS YOU GET BREAKFAST AND A BEAUTIFUL ROOM AND PROPER SERVICE.", "title": "GREAT HOTEL NOTHING TO MUCH TROUBLE", "user": "CADS5", "date": "July 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36070794}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "A 5-10 min walk from Docklands Rail Station and a 5-10 min walk from Maritime Museum made this location very suitable for us. Given a ground floor room only a few yards from Reception area was a sound call for an older couple. Reception always answered our questions with care, even to stepping out of the building to underline directions. The restaurant was very busy when we had our evening meal but I have rarely seen more organised, willing staff and the meal was enjoyable too. In contrast, however, both the breakfast staff and the food was disappointing. We were only booked for 1 night but I would have skipped breakfast had we stayed longer. Altogether would happily visit again.", "title": "Great Location", "user": "CeeJayEastSussex", "date": "July 16, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 5.0}, "id": 34923716, "likes": {"liked": "— Location", "disliked": "— A Rude Receptionist"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Great Hotel i would recomend it, Its in the perfect location", "title": "great location", "user": "bailenamona", "date": "June 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32253993}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 3, "variance": {"poor": 24, "average": 102, "very good": 249, "terrible": 28, "excellent": 100}, "aka": "Ibis London Greenwich Hotel London", "slim_ranking": 0.328996282528, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Ibis London Greenwich is an economy London hotel, located in the historic centre of Greenwich, close to Maritime Museum. Your hotel puts you close to Cutty Sark and Royal Observatory. You can easily access Canary Wharf, the O2 Arena or Excel Ehxibition Centre via local transport links. Hotel is within short ride from London City Airport and the Olympic Park. Relax in the bar with a coffee or a glass of wine, and choose from a range of bar snacks and light meals. Paying outdoor parking available. The hotel is located in historic Greenwich, close to Greenwich Park and the River Thames. Riverboat services to Tower, Westminster and Waterloo piers. Also services east to the O2 Arena. Inviting, modern and cosy, with a comfortable bed and a functional bathroom. The ibis room has got everything you need for a pleasant stay. Hotel 100% non smoking.From central London by car: Follow Waterloo Bridge, Elephant & Castle, New Cross and A2 to Greenwich. From M25: follow A2 Central London. 15 min. by train from Waterloo East or Charing Cross. Underground: 2-min. walk from Greenwich Train Station and fromthe Docklands Line (Stop at Cutty Sark Station).GPS: N 51° 28' 47.83'' W 0° 0' 33.74''"}