{"user_rating": 3.5, "review_count": 471, "name": "Ibis Antwerpen Centrum", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Stayed here for 12 nights with a sporting group. Rooms were small but clean. Bedding was good. Beware if you are any more than small to average in build you will find the bathroom very hard to manage. It is as others have said tiny.", "title": "It's an Ibis", "user": "wiskey", "date": "September 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 177713694}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Location is great for exploring the city, plenty of eateries close by and the old part of town a short walk away. Markets are held in the square opposite each Saturday & Sunday. So a bit of noise early on those mornings but good fun to walk around.", "title": "Pleasant and good location!", "user": "Chouca30", "date": "September 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 177650670}, {"rating": 2.0, "title": "Small but clean", "text": "It took us, with bags in tow, 15 minutes to walk from the rail station to the front desk. Front staff a little aloof but cleaning ladies were really very helpful.", "user": "Rachel B", "date": "September 16, 2013", "id": 177328073}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The hotel is walking distance from the station, is close to local amenities and you can walk to the old town. The room, although a bit small, was not too bad. It has everything you need: wifi, TV, good size bed, desk, heating, A/C...Breakfast was good, with a large selection of teas/ coffee, hot and cold buffet, continental breakfast! Staff at the reception desk were friendly. I must admit that the bathroom and shower cuble was very small but it was okay as I was there on business for a few days!", "title": "Reliable Ibis", "user": "Sagacandidate", "date": "September 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 175285560}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "I have stayed in plenty if hotels ranging from backpackers to five star, and I was expecting more out of the Ibis Centrum as our friends took cheaper options and got a better deal. The rooms are small, too small for two people to get dressed for a function at once. The shower cubicle was so tiny I couldn't shave my legs or wash my hair properly, so had to get a blow dry down the street. A few of the people at front reception were rude, although that may have been an Antwerp thing. The breakfast buffet was great and had a bit of everything.", "title": "Reasonably priced hotel in good location", "helpfulness": 1, "user": "benz37", "date": "August 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174834892}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed in hotel at the beginning of August for 2 nights. It is a typical \"Ibis\" Very small and very clean rooms. Location is the best. Very close to Rubens house and all major attractions.Underground parking across the street and costs 14 euros per night. My only negative comment is that the cost of excellent breakfast is not included. Practically it means that hotel cost for two is 28 euros more per night. I had similar breakfasts in other hotels in Belgium and it cost was 1/2 of that price.", "title": "Convinient location", "user": "emmgal_48", "date": "August 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 174291060}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The Ibis Center is well located. Only 20' walk from the hotel to the train station. About another 20' to the old town center. Breakfast was good and with plenty of choices. The reception team was attentive and helpfull. At the hotel entrance you will find a nice space to enjoy a beer, and for those that smoke a pleasent location. I will stay in this same hotel next time. The Rubens museum is just in a 5' walk from the hotel.", "title": "Very Pleasant Stay", "user": "WHL573", "date": "August 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 174290506}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "It has good wifi connection. But mega small bathroom. Good for petite Asian size.", "title": "Very good location", "user": "EunChan", "date": "August 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 172147214}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Walkable from Antwerp Central station. Walkable to shopping streets, and Fashion museum.", "title": "An overnight in Antwerp", "helpfulness": 1, "user": "Mike M", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170451508}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Hotel Ibis is a good quality chain. You get what you expect. They are consistent in what they deliver. The rooms were clean and comfortable. The breakfast was adequate. I prefer the ability to cook my own eggs. We got a good price at 120 euros for 2 nights. We were very central for most activities. They even looked after our bicycles in the staff reception area. So why isn't it a 5 star review? Well, they managed to lock us out of our room the second day, so we had to go downstairs to get the key reprogrammed. The outside seating area is tacky in comparison with the inside seating area. It was busy and very hot at 33 degrees. Many of the non-residents were buying drinks and sitting outside. This is where we were bitten by a mossie. This was only the second mossie bite in two 10-day trips through Belgium. On each occasion it happened while we were staying in the Hotel Ibis. Coincidence? I don't think so. I suspect that there is a tendency to not care about certain things that go on. Unless a whole bunch of people say \"Hey, I've just been bitten by a mosquito right outside your hotel. It must be your fault so what are you going to do about it?\" I don't think the people (mainly young people) who run the place are bothered enough to look into it and to work out why it happens. I think that they think they have the guest experience under control, until the mossies upset their plans.", "title": "Watch out for the mossies - 2", "user": "CondadoJohn", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170338553}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "When your only in town for one night you want to get out and see the sights not wait in a hotel lobby. The guy in front was disputing a bill, there was only one guy on the desk. The wait was beyond a joke with another 3 groups of people waiting behind us in the line. When someone else finally appeared to help we didn't even get an apology. All the time we were waiting the tv behind the desk kept telling us that is your complaint isn't resolved in 15 minutes you get the night for free. We asked about this and we were told it didn't apply. Still after this no apology.", "title": "30 minutes to check in, what a joke", "user": "Michael B", "date": "July 30, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 169970004}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The rooms are smaller than other Ibis hotels I've stayed in.", "title": "Good location, friendly staff and very comfortable beds!", "user": "Little_0407", "date": "July 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 169407034}, {"rating": 4.0, "title": "City break", "text": "We stayed in the Ibis Antwerpen Centrum for 2 nights and found it a great hotel in a perfect location in Antwerpen! From this hotel we were pretty much walking distance from everything so didn't have the expense of having to use public transport. Rooms were clean and beds were so comfortable I didn't want to get up! Staff were on hand to answer any questions we had from recommending where was good to eat and showing us our way round. We didn't eat at the hotel but did have a drink and found the prices very reasonable - we didn't pay any more than we would have elsewhere in town. The only fault I have is that the bathroom is very small - there was barely room to get dressed! All in all the Ibis was good value for money and we would definitely stay here again.", "user": "Rob C", "date": "July 14, 2013", "id": 167483119}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Like most of the other Ibis, we already have been, this also has the usual Standard Interiour. Nothing special, but all was pretty clean there. At the Reception was a good and friendly Service (they speak good english there). In Lobby was also a Computer for Internet Acces. We did liked their Breakfast buffet. Especially the Bread and Coffee was better then expected.", "title": "good and friendly", "user": "freshbluewaterbeach", "date": "July 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 167404208}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I stayed here june 2013. The hotel is located next to a theatre and close to the old town. For the most part the hotel and rooms are clean and well kept. The beds are hard and so small. Smaller than a single bed. The bathroom is tiny and you really cant open windows too much. The tv is small. The room It is just good enough to sleep in and get out. i had a dinner there and it was terrible. 2 items were on the menu and not available. I had the chicken, it was so dry and hard that i could not eat it. {and I was really hungry}. Breakfast is ok but a little limited in selection. I think this hotel caters to bus tours that travel all of Europe {if it is Tuesday it must be Belgium-movie} If I were to come back to Antwerp, I would not stay here again. The only good thing is the price. Very cheap for a European hotel. I guess you get what you pay for", "title": "very average - for a business trip", "user": "R0b_and_lisa", "date": "June 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 165632407}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Ibis hotels are always practical and useful if you want to travel and do not spend on hosting, here you are. The hotel is well located, close to the center. The room and bathroom a bit small, but everything functional.", "title": "cost benefit", "user": "JustAn0therT0urist", "date": "June 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 165402424}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "stars": 3, "variance": {"poor": 21, "average": 156, "very good": 225, "terrible": 9, "excellent": 60}, "aka": "Ibis Antwerpen Centrum Hotel Antwerp", "slim_ranking": 0.25974025974, "description": "Ibis Antwerpen Centrum is in the heart of the historic town centre of Antwerp, near the famous Vogelenmarkt marketplace, Rubens House, the main shopping street (known as Le Meir) and just 700 m from the railway station as well as close to theatres. Book one of our 150 rooms and make the most of our facilities, a restaurant, bar with terrace area open 24 hours and 2 meeting rooms for seminars and conferences. Business guests will appreciate use of WiFi Internet access, public parking also available."}