{"user_rating": 4.0, "review_count": 428, "name": "Ibis Zurich City West", "reviews": [{"rating": 4.0, "title": "Good hotel", "text": "We were happy with the Ibis Zurich City West hotel, while it was a little way from town, it is well serviced by public transport. The rooms aren't air conditioned rather they are cooled by a central system so they have the potential to get stuffy when its warm outside. The internet that is provided by the hotel is quite reasonably priced when compared to internet cafes in town. The breakfast buffet had a good range of food but avoid the juice as it isn't very good. I would reccomend the Ibis range over hostels as they give you a good room for the price.", "helpfulness": 4, "user": "T-A-UK", "date": "July 30, 2007", "id": 8256956}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "I have found that IBIS hotels really do mean business. They are very clean, front staff helpful and friendly (and multilingual). There was a lovely young lady in Zurich West IBIS who could speak 4 languages. And she was blonde...Haaa!!! That shoots down the blonde jokes....", "title": "Unexpectedly Pleasant", "helpfulness": 4, "user": "PacificParadise001", "date": "July 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 8116396}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "The room was bright and very clean. There was nothing old about the room and bathroom. IBIS hotels are very modern and so affordable. I will be using IBIS where I can because I can be guaranteed of a very good room that rivals many 4 star genuine hotels. When I travel, I am the type of traveller who views hotels as rooms to sleep in and thats it......I am out all day and evening so I am not too bothered about 5 star, 4 star or 3 star. Just a clean comfortable and very affordable room. I like to spend my money on other things like sightseeing and shopping. IBIS hotels in Switzerland exceeded my expectations. Will use them again and again when I visit Beautiful Switzerland and hopefully thats soon.", "title": "No complaints really, had a very pleasant stay", "helpfulness": 2, "user": "Misty78", "date": "June 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 8020292, "likes": {"liked": "— The really clean and quiet room + the air-conditioning", "disliked": "— no fridge in room"}}, {"rating": 4.0, "title": "Good, friendly, reasonably cheap, but out of the way", "text": "Stayed here for three nights in July 2006 - I found the hotel to be very clean, safe and comfortable - nothing luxurious, but then I wasn't looking for luxurious anyway. :)", "helpfulness": 3, "user": "unspecified", "date": "August 26, 2006", "id": 5711636}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "The most important thing for me was that the place felt safe and everything worked (including the air-conditioning, which I really couldn't have lived without as it was EXTREMELY hot in Zurich during my stay).", "title": "Clean and comfortable", "helpfulness": 4, "user": "CHDD", "date": "July 28, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 5523164}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "This hotel offers good clean and reasonably equipped rooms at a good price, particularly at the weekend. It is not the best located hotel in Zurich but is less than ten minutes walk from Hardbrucke station which has 14 trains per hour taking two minutes to the central station. (The walk under a flyover is not exactly scenic!). I found the staff helpfull.", "title": "Good budget hotel", "helpfulness": 4, "user": "Peter999", "date": "April 26, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5010038}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "My only reservation is that the hotel does not seem to have full air conditioning and it may well be worth paying a bit extra and staying at the Novotel in the same block during the summer months.", "title": "A great budget choice", "helpfulness": 5, "user": "MariahTK", "date": "March 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4735495}, {"rating": 3.0, "title": "Good choice for the price", "text": "I would recommend the hotel.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "October 26, 2005", "id": 4054221}, {"rating": 4.0, "title": "Good inexpensive option but a little extra effort to get to", "text": "Having just spent a weekend in Zurich I can honestly say that the this hotel, while not being in the centre of Zurich,has nevertheless a good location and is justified by the weekend tariff of 99SFR/EUR62 without breakfast. This area is an up and coming trendy area with alot of 'in' places like \"Schiffbau\", which is a converted warehouse with a great rooftop bar and restaurant.Also check out Mati Hari, Langstrasse 237,and also \"Les Halles\" as well as \"Besame Mucho\" which are beside one another on Pfingstweidstrasse, the next street to the Ibis.", "helpfulness": 13, "user": "tilthouse", "date": "April 15, 2004", "id": 1786863}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 2, "variance": {"poor": 19, "average": 105, "very good": 230, "terrible": 7, "excellent": 67}, "aka": "Ibis Zurich City West Hotel", "slim_ranking": 0.467741935484, "description": "The Ibis Zurich City West hotel is located in a stylish district of Zurich, close to the motorway and 100 m from the Technopark business centre, 9 km from the airport and 10 min from the main railway station. The hotel offers 155 rooms with air cooling (including 5 for guests with limited mobility) as well as a restaurant, a terrace area, a bar serving light meals and snacks 24 hours and private undercover pay parking. Business guests will appreciate our WiFi Internet access."}