{"user_rating": 4.0, "review_count": 935, "name": "Ibis London Gatwick Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I wanted to stay overnight to catch an early morning flight from Gatwick to the US.So i checked out a lot of hotels in proximity of south terminal and having heard of the Ibis chain, I shortlisted it. Great price!", "title": "I'll be back", "user": "Satyajai", "date": "June 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0}, "id": 112136935}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "It was a pleasant surprise as the hotel had its own shuttle running every half hour in the mornings and evenings just for 3 GBP, which is really convenient. The bar food was good and reasonable and pleasantly they also served the local ale on tap. Room was clean, and good enough for two people. All in all it was a good selection.", "title": "Let down by certain staff", "helpfulness": 1, "user": "londonsteve2", "date": "June 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 1.0}, "id": 111912393}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I stayed there on my return and requested an early check in at 8.00 am. The room was ready.There was a good spread for breakfast, which I passed. I had to leave for Heathrow in the afternoon. They didn't have the shuttle, but I managed the Local #100 bus at 1.8GBP to the south terminal from where I caught my bus to Heathrow.", "title": "Lots of little niggles", "user": "curts", "date": "June 6, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 2.0, "value": 3.0, "service": 2.0}, "id": 111855562}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "My wife and i stayed at this hotel because we had an early flight on the monday...everything was great until i went down for an early cup of coffee before heading out...i had checked the day before that drinks etc would be available and assured that they would be.when i went down and asked for a cup i was told that i couldn't have a cup as it wasn't open until 4am i did point out that i had enquired about it and was told that none was available until 4....i then went back to the room and fetched the brochure they have there that clearly states that food and drinks were available 24/7 and that i wanted a cup if it wasn't too much trouble.he then realised that i wasn't going to be pushed around and let me have some coffee.i ravel and stay in a lot of hotels and it's only in this country that i come across this sort of attitude...when will the people in the service industry here realise that they are here for the benifit of the PAYING customer and not the other way around? after this episode i will never again stay in an ibis hotel and will stay where my money and myself is welcome", "title": "Fantastic value", "user": "Dije101", "date": "June 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111294051}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Lots of little problems contributed to my opinion of this hotel. There was the tiny, cramped car park that was oversubscribed the first night. There was the hot breakfast items that were not in a food warmer and starting to cool when I came down for breakfast at 8 AM each morning. There were the thin, hard pillows that were anything but comfortable. There was the total absence of decaf. coffee both in the breakfast room and my room. There was the bathroom door that didn't fit properly and couldn't be closed completely. There was the loud crash and thud of numerous large laundry cages being loaded in and out the elevator and staged on my floor between 6 and 7 AM. There was the on-demand movie that stopped part way through and returned to the main menu, twice, and no controls to fast forward or advance the chapter. They did refund my money for the Internet and movie package when I complained the next morning.", "title": "Great value; served its purpose well", "user": "WilliamArthur", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111114025}, {"rating": 5.0, "title": "Ibis at Gawick", "text": "I have now stayed at this hotel a number of times and have always found it to be excellent. The staff are always friendly and helpful; in fact they treat me as an old friend almost! It's not a fancy hotel but it is clean with a good restaurant; the rooms at the back are quiet (enough to have the windows open) whilst those at the front are quiet enough with the windows closed. I really can't find fault with it at all!", "user": "A TripAdvisor user", "date": "May 16, 2011", "id": 108458992}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at this hotel before a 2 week break in Cancun, we got a deal with 2 weeks parking and car was secure and under the hotel basement. Very clean, basic hotel and room was actually really nice especially for this star hotel, and very quiet with window shut for a great nights sleep. Overall very pleased and a bonus is that just up the road is a big leisure park with Mcdonalds, TGI Fridays, Chimichanga, Frankie and bennies etc", "title": "Ideal gatwick hotel - does what it says on tin", "helpfulness": 1, "user": "DaveStorer", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108371156}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "If you have a back problem stay at Ibis hotels , the beds are really comfortable and supportive unlike egTravel lodge or Premier Inn etc", "title": "GREAT HOTEL GREAT BEDS", "user": "zhivagoGlenrothes", "date": "May 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108217742}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The rooms are compact but have all you need inclucing powerful ,large showersand are spotlessly clean.", "title": "Cheap and easy for a Gatwick stopover", "user": "dipper666", "date": "May 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 107779692}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The staff are always very helpful. I always stay at Ibis if possible here or abroad and hope they expand their locations even more.", "title": "Cheap and convenient, but details let it down", "user": "cpdc1030", "date": "May 9, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 107533915}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Needed a room for the night as no connection from our local airport. Price < £29 could not be faulted. Great value. Room spotless and bright. Staff friendly and helpful. Only bugbear was transport to and from airport. Phoned the hotel to request the shuttle bus on arrival at Gatwick and told it would be 10 minutes and to wait at bus stop 8. Bus came after a second phone call and 45 minutes. Meanwhile several local buses no. 100 came and went from the same stop - we later found out they stop outside the hotel. Following morning, no orderly queue for shuttle bus - survival of the pushiest so we got the local bus 100. It took about 5 minutes and cost £1.80 (shuttle bus £3). I think the G23 also stops outside. Didn't have time to try the restaurant but the food looked appetising. Apart from the bus incident couldn't fault the hotel.", "title": "Good economical overnight stay at Gatwick", "user": "Cheshireite", "date": "May 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 110773569}, {"rating": 3.0, "title": "Airport stay", "text": "Comfortable room for overnight stay before leaving from Gatwick on an early morning flight. The location of the hotel is near an industrail estate and there is little to do in the area if travelling without a vehicle. The room was noisy if thewindows were left open at night but there was an alternative air treatment in the room. Generally a pleasant stay.", "user": "A TripAdvisor user", "date": "May 31, 2011", "id": 110680481}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We stayed here before an early flight and found it such good value with included parking for 2 weeks that we have just booked again for the same. This time booking with the hotel direct to get the cheapest deal. Its very clean and more than comfortable enough for a night stay. The transfer price seems pretty standard. Coming back from a long flight it did seem like a long wait for a return bus though. Also on arrival the car park was full so it was a bit of a faff to get a spot but a staff member moved their own car for us. Didn't eat at the hotel but at the pub at the top of the road which was fine. All in all a great stress free budget start to the holiday", "title": "good value", "user": "Rboo44", "date": "May 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 110255146}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The hotel was clean, the room was clean, and large enough for 2 people to be comfortable for one night. The hotel staff very friendly and helpful. We didn't try the food in the hotel, there is a pub a 5 min walk so we went there. The room plus 15 nights parking was £95 which is very reasonable, parking is secure. The shuttle to the airport was £3 per person, and it only took 10 mins to get there. We didn't use the shuttle on the return journey, just because we didn't want to wait for it to arrive. I would recommend this hotel for people who are looking for a clean reasonable priced hotel within a short distance of the airport.", "title": "Good value for money", "user": "Fiona_Chapman", "date": "May 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109050221}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I booked this hotel due to the fact it was an exceptional value close to the airport and that we had previously booked with Accorhotels with an overnight stay in Paris. This hotel far exceeded that of Paris in value and overall appearance. We were pleasantly surprised when we entered our room. The hotel featured a shuttle service to the airport which was helpful in the early hours of the morning... our 5 am shuttle was full so we had to wait for the next. The desk staff offered complementary coffee while we waited. Only negative I had was that the shuttle service has a fee which was only 6 pounds for the two of us... but the website made no mention of that fact.", "title": "Enjoyed our overnight stay.", "user": "Kiragi0", "date": "May 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 108919415}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed in two rooms overnight in June when the daytime temperature in London was 28 degrees. Neither of the air conditioning units worked and opening the window was too noisy. None of us got any decent sleep as it was so stuffy.", "title": "Don't stay if the weather is hot!", "user": "Chris4817", "date": "June 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 113970318}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We have stayed at Ibis hotels in ten different countries - including the UK - so we knew what we were getting with this booking but the Gatwick Ibis did not measure up to the standard set by other hotels in this chain. When we arrived before noon, bleary-eyed, from an overnight flight from SE Asia, the young woman at the counter was defensive about our room not being ready rather than being helpful and compassionate towards us. She actually told us that she would not check us into a dirty room. The sink smelled terrible, the rooms was shabby and there was no hair dryer so my partner paid a deposit to borrow one. Our dinner, ordered at the bar, was mediocre at best. When it was time to go to sleep, we discovered that the air conditioner was not working properly; even set at 15 degrees Celsius, the room did not cool down to a comfortable level. We would not stay here again.", "title": "We won't be back!", "user": "OverseasTeacher", "date": "June 16, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 3.0, "service": 2.0}, "id": 113771981}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "This hotel is a perfect budget option for an airport stopover. There is an airport shuttle. The rooms are immaculate and the beds very comfortable. There is a lovely pub a short walk along the road with a pleasant beer garden and delicious bar meals. I was very impressed and would use this hotel again.", "title": "Perfect for airport stopover", "user": "angel103", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112954467}, {"rating": 4.0, "title": "Perfect Stay while on transit", "text": "If you are transiting through gatwick, it is one of the best places to stay for a good price. It is very close to the airport which makes it cheap to pay for transfers, besides there is a shuttle service for only 3 pounds. The menu is slightly limited but the food is good.", "user": "A TripAdvisor user", "date": "June 10, 2011", "id": 112605145}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "A value for money property. Simple and basic budget hotel. The location was good considering we used the hotel as a transit stop. The food in the restaurant was decent-service in the restaurant a bit slow,but guess they were a bit short staffed. Good for an overnight stay.", "title": "Budget property", "user": "DSA1965", "date": "June 10, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 3.0}, "id": 112568081}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 2, "variance": {"poor": 59, "average": 173, "very good": 435, "terrible": 32, "excellent": 236}, "aka": "Ibis London Gatwick Airport Hotel Crawley", "slim_ranking": 0.444444444444, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Ibis London Gatwick Airport is ideally located less than 5 min from all terminals (private shuttle from 5 a.m. to 11.30 p.m. on request), M23 (Jct 10), links to M25, A23 and A217, walking distance from the Manor Royal industrial estate (training centre,Oxford Aviation Academy, Virgin Atlantic base), 30 min by train from London (Gatwick Express), and 45 min from St Pancras international station. All rooms offer ensuite with shower, high speed internet, pay TV, airport parking (long and short term)."}