{"user_rating": 4.0, "review_count": 1080, "name": "Ibis Wellington", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My wife and I spent two nights here as part of a three week tour of NZ. We didn't choose the itinerary or hotels - we bought a package. We got to compare lots of hotels in NZ but can't comment on vaue as we paid a package price.", "title": "Great location, super restaurant", "user": "Dai_the_Welshman", "date": "March 6, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 125706299}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "This hotel - the Ibis - came across as being towards the budget end of the spectrum. By that I mean that the carpets were not deep pile, the fixtures and fittings appeared a little plastic-y, doors were bright red, accommodation was small not spacious etc. But it's in a really good location right in the centre of Wellington and easy walking distance of museum, waterfront, shops, government buildings, cable car etc. We enjoyed being able to walk out the door and be in the centre of everything.", "title": "Great location and very clean", "helpfulness": 1, "user": "KaffeeOderTee", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125633274}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Our room felt small and was an odd shape. But it was well organised and there was space for everything. Desk, wardrobe, TV unit appeared to be built in rather than free standing furniture. The room and bathroom seemed very clean - but the lobby seating area seemed to attract a lot of cups and glasses which didn't seem to get cleared quickly.", "title": "Average stay", "user": "JSP88", "date": "March 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 125622402}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We were comfortable for our two nights although the bed was a little hard and wasn't enormous. Bathroom was small but adequate but could have done with more towels.", "title": "Great price, great place for a family", "user": "bluedaisygirl", "date": "March 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125489669}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Very convenient for the purpose of our visit. Safe and clean. No room service avaliable. Hotel was close enough to all amenities, ie, many muesems, galleries, shopping. Checking in and out was fast and professional. Modern decor.", "title": "Safe", "user": "robsie_12", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125825763}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled solo", "text": "Average hotel, they say they have free high speed internet, but only if you have last century equipment, no wifi in rooms, limited wifi connection in the very small overcrowded reception area. Still, I'm sure this will be all rectified after the earthquake, when they re-build.", "title": "WiFi ?", "user": "Roh84", "date": "March 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125781662}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Central location, good size room and bathroom. Nice enough staff.", "title": "Average", "user": "Chiara B", "date": "March 6, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 125727091}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I booked two double twin rooms for a girls weekend to Wellington for the Wearable Arts show. When we arrived, I was informed that they had allocated us twin single rooms instead, but breakfast was included. This was okay as we were only there one night, however I would have liked to have been informed of this prior to check in.", "title": "Fine for a short stay", "user": "Angelco", "date": "March 16, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "location": 4.0, "service": 3.0}, "id": 126210108}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "The hotel was clean and the breakfast was good. It is in a central location. Like all the Ibis Hotels I have stayed in, the room was small but adequate. We had dinner down the street at Arbitrageur, yummy but pricey.", "title": "Good Location, Poor Service", "user": "Jess L", "date": "March 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "location": 5.0, "service": 1.0}, "id": 126163843}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The good things about this hotel are that it is in a good location, close to many attractions and it is clean.", "title": "Adequate accommodation in a great location", "user": "sushi_roseAuckland", "date": "March 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126156679}, {"rating": 4.0, "title": "Ibis Wellington, good enough", "text": "However, the service at the hotel was really poor. We had reserved a parking spot when we booked, but they had lost the reservation – luckily we had a copy of our confirmation with us because they kept arguing on and on that we didn’t have a reservation for parking in their handwritten notebook of parking reservations. After they did give us a parking spot in the tiny, 15-space garage, they failed to mention and give us the permit that would show we had the right to park there and prevent us from getting towed – luckily I saw the sign that it was needed and we went back to get one from the front desk, or this could have ended up being a one star review. Then they only gave us a spot for two nights, not three. And the whole attitude of the staff was that they just plain didn’t care how much inconvenience this was causing us. Disappointing.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 14, 2012", "id": 126103964}, {"rating": 5.0, "title": "Great location", "text": "Enjoyed our stay at the Ibis Wellington. Pleasantly surprised at the amenities and the size of the room compared with other Ibis hotels I've stayed in. Comfortable beds. Great location in city-centre and easy to find from Interislander ferry, although watch for the one-way streets!", "user": "A TripAdvisor user", "date": "March 14, 2012", "id": 126079268}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We satyed here for only 1 night and we were very happy with it. We had a great room on one of the upper floors.We had a larger room than others (we think we were upgraded).The room was clean and in a great location for walking around Wellington.We would certainly stay there again.", "title": "Wonderful Budget Hotel In Great Location", "user": "Bucket-Listers2", "date": "March 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125904829}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We stayed here for 1 night in between an interislander ferry crossing and an early start on the overland train the next day. And for what we paid, it was fine.", "title": "Budget hotel - you get what you pay for", "user": "Outinthemiddaysun", "date": "March 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125863184}], "location": {"country": "New Zealand", "region": "North Island", "continent": "South Pacific", "city": "Wellington"}, "stars": 3.5, "variance": {"poor": 50, "average": 234, "very good": 526, "terrible": 22, "excellent": 248}, "aka": "Ibis Wellington Hotel", "slim_ranking": 0.372549019608, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Ibis Wellington is located in the heart of the city offering, 200 guest rooms. Our stylish rooms with modern décor allow increased connectivity with the ability to connect media players and digital cameras via 26 inch flat screen LCD TVs. The rejuvenated rooms complement the stylish Vivant! Restaurant & Bar and lobby area. Limited parking is available at the hotel for an additional cost of $25 per night and must be booked prior to arrival."}