{"user_rating": 3.5, "review_count": 168, "name": "Ibis Budget Warszawa Centrum", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled solo", "text": "You'll get more than you can hope for the price. Clean room, noise-free, internet access in the room, AC, hot shower, TV... At ~30€/night, that's excellent quality/price ratio (many hostels with shared room and bathroom are way more expensive in Warsaw).", "title": "Excellent value for money, bad location", "helpfulness": 1, "user": "MajdaN", "date": "September 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 1.0}, "id": 139608393}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The hotel is a little out of the way and not easy to find. You need to take the bus 185 from the old town or 171 from Centrum. It is surrounded by trees and is quiet dark at night. I would not recommend it to a solo female traveller.", "title": "A bus ride out of town wi fi poor", "helpfulness": 1, "user": "only_visiting", "date": "October 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 143133565}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "This is a basic budget ibis. Strangely the shower is in the room so if you are not with a good friend you may feel embarrassed. The toilet is however behind a door. There is a desk and TV. If your room faces the main road it is noisy even with the double glazed windows closed.", "title": "Fantastically cheap, neat and clean!", "user": "Luckita12", "date": "October 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143107690}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The wi fi is free but doesn't work. It constantly looses the connection which is very frustrating.", "title": "Pleasant stay for reasonable price close to centre of Warsaw", "helpfulness": 1, "user": "Turysta", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142866452}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The receptionists are friendly so get precise directions to the buses from them. They have a good guide to Warsaw for free in reception \"Warsaw in your pocket\" which has a map (I believe the publication has an online version).", "title": "ibis budget Warsaw", "helpfulness": 1, "user": "Andrew P", "date": "October 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 142629810}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Crazily cheap. We didnt expect it to be so nice and clean. The rooms are small, and they do not have a defined bathroom, but everything is new and neat. The service is fine, and it was good that it had snacks and drinks machines in the lobby. Definitely a great option for the money!", "title": "Good budget option", "helpfulness": 1, "user": "pskij", "date": "October 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 142462045}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Whenever I go to Warsaw and don't feel like spending too much on a hotel, I choose Ibis Budget (previous name was Etap). It's not exactly in the city center, but not much far away, and there's a lot of public transportation stops nearby. It took me about 20 minutes to get to Nowy Świat from the hotel by the city bus.", "title": "Inexpensive but good", "user": "marc00s", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 137247438}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "The staff is friendly and the quality-to-price ratio is pretty good (some youth hostels in Warsaw charge more than this hotel). Breakfast is really nice and if that's not enough, there are vending machines near the reception desk, serving hot meals (mostly toasts with different fillings), chocolate bars, water, soft drinks and beer.", "title": "Nice no frills Hotel", "user": "cse_limited", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 132593138}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Rooms include a tv, a shower, quite a big bed and desk. This is a cheap hotel, but the tv service includes Canal+, which usually is a premium-paid channel, so you can watch sports and movies.", "title": "Not very central", "user": "clohanes", "date": "May 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 130419791}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Stayed here for five nights at the end of January and had a very comfortable stay. The hotel is in a residential area but only a brisk 20 minute walk into the old town and about 10 minutes walk from Lazienki Park. Around the hotel are several convenience stores and deli's where you can get supplies for your room if you need them. The hotel itself was spotlessly clean in both the bedroom and communal areas. The room although small was modern and sufficiently equipped for a city break. Linen was changed regularly and we had fresh towels every day. It was also lovey and warm after being out in the Warsaw freeze. There was an interesting and informative tv station about Warsaw with tips for sightseeing and so on which we found really useful. We didn't know until we watched it that you can be fined for jay walking in Warsaw! The only downside to the room would be that if you are not particularly close to your companion it may be a little awkward. I haven't seen a twin room but in the double the shower opens directly into the bedroom and has only a frosted glass door. This was fine for us as i travelled with my husband but may not be ideal for families or companions who prefer a bit of privacy in the shower! We didn't try breakfast in the hotel but went down one morning for a look and found the selection to be somewhat limited. That said if cereal and toast would be enough for you then it would be ok. We made use of the vending machines in the foyer for snacks and drinks. There was also a coffee machine although it was out of order on our visit. All in all i would definitely return to this hotel as we found it an ideal base to discover Warsaw and it was excellent value for money.", "title": "Great budget hotel", "user": "saoirsechick", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153058725}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I had planned on staying here for 2 nights and after the first night asked if I could cancel my reservation for the second night as i wanted to move to the Novotel because my colleagues were staying there - this was no problem for the staff. The hotel is not far from the centre of the city and the rooms are comfortable. They have free wi-fi - I got 2 log-ins. The breakfast was adequate for the price. Would i stay here again? It's not a 5* hotel and that's why its price is low - but i know I'm staying at a chain hotel and would feel (and felt) comfortable there.", "title": "Well-priced hotel", "user": "Expat_in_Poland", "date": "January 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 151030760}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Budget hotel not in central location, but still not too far from the center of Polish capital city. Small room but with new furniture and equipment. Most importantly room and bathroom is clean. Very good budget solution for Warsaw. Just for quick business trip but you can also come with children. The best possible price in relation to offered quality. Breakfast minimalistic, but I have no complaints. Generally recommend.", "title": "You just get, how much you pay for", "helpfulness": 2, "user": "kubap1", "date": "November 30, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 3.0, "rooms": 3.0}, "id": 146494496}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Weekend price for one night - 109 PLN. I'm sure you can't get anything better in Warsaw for such little. Reception staff nice and service was quick. I asked for additional duvet and got it at once for free. Room was small, but it was clean. Very simple furnishings, but I prefer that than pseudo-baroque kitsch. Great location: 10 minutes walk to Three Crosses Square or National Museum. Good mattress - we slept well. Quiet in night (2nd floor). We didn't have breakfast since it is many places in Warsaw where you can eat great breakfasts in fine places, so I cannot tell. Good option if you only want to take a shower and sleep. I recommend it for short stays during intensive visits to the diverse city, which is Warsaw.", "title": "best price/quality ratio, good location, modest but clean", "helpfulness": 2, "user": "jakkno1977", "date": "October 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 144099788}], "location": {"country": "Poland", "region": "Central Poland", "continent": "Europe"}, "variance": {"poor": 6, "average": 45, "very good": 81, "terrible": 8, "excellent": 28}, "slim_ranking": 0.125, "description": "Ibis Budget Warszawa Centrum hotel is located over the Vistula River, just 1.5 km from the Royal Baths park, about 20 minutes’ walk from the famous shopping street, Nowy Świat. The hotel offers 176 bright, comfortable rooms, each with a bathroom featuring a shower cabin. All rooms are fitted with air conditioning and a TV. Wi-Fi access is also available.Guests can benefit from a paid car park and vending machines with hot and cold beverages and snacks, available 24 hours a day. The Ibis Budget Warszawa Centrum provides guests with a buffet breakfast, available for as little as PLN 23.00"}