{"user_rating": 4.5, "review_count": 665, "name": "Ibis London Shepherds Bush", "reviews": [{"rating": 5.0, "title": "Good location, lovely staff", "text": "The location of the hotel is very convenient as it is a close distance from bus and underground stations and also the Westfield shopping centre.", "user": "Dianki", "date": "March 17, 2013", "id": 154820454}, {"rating": 5.0, "title": "Our first visit to London and staycation in ibis shepherds bush", "text": "The rooms are the same standard as all the Ibises, clean and user friendly. However, the design of the reception and the bar area is more modern.", "user": "Don H", "date": "March 16, 2013", "id": 154725010}, {"rating": 5.0, "title": "Very enjoyable stay", "text": "Free Wifi available throughout the whole building.", "user": "xitamaria", "date": "March 15, 2013", "id": 154677989}, {"rating": 4.0, "title": "Location :-)", "text": "The check in and check out was very quick and the staff was helpful during my stay.", "user": "JD1708", "date": "March 12, 2013", "id": 154367733}, {"rating": 4.0, "title": "Our stay at Ibis London Shepherds Bush", "text": "I will stay there again.", "user": "Sandy965", "date": "March 12, 2013", "id": 154347489}, {"rating": 4.0, "title": "Would stay again & recommend to others", "text": "The room was very clean and had everything you needed. The only odd thing about the room is the bathroom which is kind of like a capsule embedded in the room. I was afraid the toilet may fall out of the wall! But I can't fault it in any other way. Accommodation is VERY expensive in London so the IBIS provided everything I needed at a good price, good location (very close to the train station), wifi in the room, tv, comfy bed, phone, clean & modern. If you just need a nice place to stay without all the frills (like gym & pool etc) then this is excellent. It's London, so who is going to be hanging out in their room anyway?!!", "user": "ellebee1233", "date": "March 24, 2013", "id": 155551098}, {"rating": 5.0, "title": "Great Hotel", "text": "We were given an extremely warm welcome by Mylene (I hope I have spelt this right), she was very friendly and informative. The room was ideal with everything you need for a weekend , tea,coffee facilities ,hair drier ,TV etc. this hotel is great for The O2 and shopping and easy access to London via the Tube. The breakfast is good value but my only criticism would be there can be limited seating if busy, it would also be a good idea to have a place for guests to put trays of used crockery as the staff were extremely busy and not always able to clear the tables. This is not their fault as they are very busy greeting guests, taking payment and general running of the buffet. We were greeted on Sunday by Cynthia who was again very friendly. All the staff we met were a credit to the hotel and could not have been friendlier or more helpful.", "user": "KCHUT", "date": "March 24, 2013", "id": 155519965}, {"rating": 4.0, "title": "Excellent", "text": "Basic but very clean and great value. Very close to Shepards Bush O2 which was purpose of our trip. Coffee could have been better and one small towel each was insufficient. But would definitely stay in this hotel or use this chain again.", "user": "Meredith-Jackson", "date": "March 22, 2013", "id": 155308755}, {"rating": 5.0, "title": "Is this London?", "text": "In this hotel you don't feel like being in London. It has nothing similar with London hotels in that price range and even double higher. The hotel is new, clean and I finally a double rooms are allocated to single person. You don't get that in London under 200GBP. I have changed so many hotels in London and was always angry when checking out as I did not get that what I paid for, but this one I left with happy face.", "user": "Jannaly", "date": "March 19, 2013", "id": 155099273}, {"rating": 3.0, "title": "Could be better....but for price, forgiveable.", "text": "I will be definatelly coming back. And, I would recommend it to everybody who does not want to spend money on London shabby and overpriced hotels.", "user": "Mcmeme", "date": "March 18, 2013", "id": 155011413}, {"rating": 5.0, "title": "Great Stay!", "text": "I loved staying in this hotel for my 2night stay in London. Is conveniently located close to tube stations so that it is handy for travelling to other locations. The bed was comfy and the room was clean and clutter free. The food was great. Staff were very friendly and helpful. Would recommend a stay anytime.", "user": "Blackfaery", "date": "March 11, 2013", "id": 154263490}, {"rating": 4.0, "title": "Good stay", "text": "I stayed for four nights.", "user": "MingAnn", "date": "March 6, 2013", "id": 153901279}, {"rating": 4.0, "title": "Ibis raises the bar", "text": "Since it's quite new. I really have nothing to complain. Everything is good, clean, efficient ... etc.", "user": "mxcal", "date": "March 3, 2013", "id": 153625457}, {"rating": 5.0, "title": "Very impressed", "text": "Location is good, I took the bus 94 to the city. No need to change platforms in the tube.", "user": "MsJackScotland", "date": "March 2, 2013", "id": 153546844}, {"rating": 4.0, "title": "A better end Ibis", "text": "As I was flying into London midweek for the sole purpose of attending a concert at the Shepherds Bush O2 I wanted somewhere I could stay overnight that was convenient for the venue and had good transport links so that I could get back to the airport easily and quickly in the morning. This Ibis fits the bill perfectly as it is 300 yards one way to Shepherds Bush tube station and the same the other way to the O2 (as well as being close to two other tube stations). The hotel has obviously not been open long and therefore feels fresh. It is a no frills establishment - but it is an Ibis so you don't expect anything else. The bed was perfectly comfortable and the \"pod\" bathroom was all that was needed. At £8.95 (or thereabouts) for breakfast it was perfectly adequate for the price. If you wanted a hotel close to Westfield it would be perfect for that too. Beyond that Shepherds Bush doesn't have much to recommend itself.", "user": "BigMac58", "date": "March 30, 2013", "id": 156085704}, {"rating": 5.0, "title": "A great quality hotel for the money", "text": "Perfect location for Westfield Shopping Centre in Shepherd's Bush and only 20 mins or so into Central London. Excellent facilities, great rooms and good value for money. Some good pubs within walking distance. Highly recommended.", "user": "Linzi_13_13", "date": "March 28, 2013", "id": 155876082}, {"rating": 4.0, "title": "Superb value!", "text": "This new hotel is a dash across the road from Shepherd's Bush tube and is snugly situated down a smaller road. My boyfriend and I stayed for two nights last week. When we arrived there was one man on the desk checking in another traveller but he saw to us quickly and efficiently and he was very cheery! The hotel interior is very contemporary but comfy, you can tell it is new! Our room was a nice size with lots of storage space. There was a Freeview TV and tea & coffee facilities as well as a hair dryer, for those interested. The bathroom was bright but was more of a wet room than a bathroom, but this wasn't an issue for us. The shower was hot and powerful and the shower gel smelt lovely :) the bed was very comfortable with the option for extra pillows. Another bonus was free wifi and reasonably priced room service! We had booked to go on the London Eye but had misplaced our printout - luckily there were fast computers downstairs which you could use at your whim with a free printer facility! Perfect. There was even a selection of complimentary magazines which I took for the journey home - I would have bought them anyway!", "user": "iamagiraffe", "date": "March 27, 2013", "id": 155823274}, {"rating": 4.0, "title": "Good value for money", "text": "We were lucky enough to be in a room which wasn't facing the main road, if you are a light sleeper you may wish to request a similar room as the main road is always busy!", "user": "OD100", "date": "March 26, 2013", "id": 155755860}, {"rating": 5.0, "title": "Excellent!", "text": "There's a good choice of shops and restaurants in the Westfield shopping centre which is 5 minutes walk from the hotel. There is also a Pizza Express directly next door which we visited.", "user": "25sm", "date": "March 26, 2013", "id": 155751114}], "location": {}, "stars": 3, "variance": {"poor": 5, "average": 33, "very good": 283, "terrible": 4, "excellent": 340}, "aka": "Ibis London Shepherds Bush England", "slim_ranking": 0.0910780669145, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Welcome to ibis - feel good at a great priceIbis London Shepherd’s Bush is our latest London hotel, located few meters to Westfield Shopping Centre, close to BBC TV Centre, Hammersmith and Noting Hill.The hotel offers 128 inviting modern rooms (100% non smoking) with comfortable beds \"Sweet Bed\" by Ibis TV with freeview, free Wi-Fi, tea & coffee facilities, bathroom with shower.Enjoy a treat in our innovative restaurant concept \"Fogg's\" which serves modern and international dishes from “around the world” or in the bar which is perfect for coffee, pre-dinner drink with our “tapas” daily counter or light meal in a cozy atmosphere."}