{"user_rating": 4.0, "review_count": 193, "name": "Ibis Perpignan Centre", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "Stayed here for one night. Facilities were excellent for this hotel but the rooms in general were average for what is a budget hotel. If you don't go there expecting 5* then you will enjoy this hotel and Perpignan.", "title": "Okay hotel", "helpfulness": 1, "user": "Captain_Caveman", "date": "July 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3661161}, {"rating": 3.0, "title": "Good value hotel with no thrills but nice and clean", "text": "My husband and I visit Perpignan very often and this hotel is the place we stay when we're not feeling too rich. It is well positioned between the train station and the town centre (just opposite the new shopping centre) and although there is a very busy main road next to it, the hotel thankfully has double-glazing. The rooms are not large, fairly basic (no doors on the cupboards, no draws, no hairdryer in the bathroom) but it is clean and we have always slept ok. The rooms are very 'IBIS' and do not contain any local character, which is probably the biggest down side for me, but then for this price, I'd much prefer to miss out on character than to stay at a hotel full of local charm with poor hygiene! We have never taken breakfast at the hotel because there are always cafes on the way into town offering coffee and bread with jam ('des tartines') and/or croissants for less than half the price. The hotel does have a restaurant and one Sunday night (owing to excess and few restaurants in town being open), we had a meal there and it was ok - we just took the buffet main course and it did 'just the job' but a lot of people seemed to be eating three-course meals and enjoying themselves. The hotel staff on reception speak English and are very helpful. There is a car park (small fee) but if you are not familiar with left-hand drive cars, take it slowly as the road outside is narrow and the entrance to the car park is two-way and those coming out have the right of way - also the hotel staff like to change the code and not tell anyone!", "helpfulness": 45, "user": "A TripAdvisor user", "date": "April 21, 2005", "id": 3395896}], "location": {"country": "France", "region": "Languedoc-Roussillon", "continent": "Europe"}, "stars": 3, "variance": {"poor": 8, "average": 49, "very good": 99, "terrible": 5, "excellent": 32}, "aka": "Accor Perpignan Centre", "slim_ranking": 0.190476190476, "description": "The Ibis Perpignan Centre hotel is located in the city centre, 800 m from the railway station, 5 min from Castillet and 10 km from the beaches. It has 100 air-conditioned rooms, including 5 for disabled guests, a restaurant, a terrace next to an indoor garden and a bar serving snacks 24/24. It has 6 meeting rooms for organising conferences and seminars. Wifi wireless Internet access for guests on a business trip. Public outdoor pay parking."}