{"user_rating": 3.5, "review_count": 223, "name": "Ibis Dijon Sud", "reviews": [{"rating": 4.0, "title": "very good for through travel to the Uk", "text": "We came from Tuscany Italy and planned to stop in Dijon Sud so we could go back on the road to Calais early the next morning. Hotel is reasonably easy to find and close to the major motorways.", "user": "A TripAdvisor user", "date": "June 27, 2012", "id": 132881825}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We planned to stopover at Dijon, on our journey to the South of France, and Dijon seemed the right point to do so, Our booking with Accor was as usual, simple online. Using our satnav we located the hotel with relative ease, however at night it was difficult to physically locate other than driving past and turning around - they could do with a sign to indicate how to turn left at their junction, as the 'roundabout' surrounded the road, difficult to explain. Once in their car park - in front of the hotel, parking was easy on a Friday night - this seems primarily a business hotel, so most clients had gone home. Booking in was a simple act, they had all prepared for us, and this took no more than 5 minutes, pleasing after a 4 hour drive and after a day's work.", "title": "Overnight at Dijon", "user": "MarcusMis", "date": "December 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 121707813}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Hi this hotel is great for a stopover, its no where near Dijon though, but in a small town close by. The hotel rooms are a bit tired and showing signs of needing upgraded. The breakfast was ok and worth it if included in costs which were reasonable.", "title": "Not near Dijon, but in small town outside", "user": "scot5", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 168679041}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Nothing within walking distance unless you like looking at industrial areas.", "title": "Excellent standard for Ibis at Dijon South", "user": "103DavidM", "date": "June 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 165675411}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Staff were very good and could manage basic English.", "title": "stay", "user": "ringrosep", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 165520552}, {"rating": 4.0, "title": "Very relaxing stay at Ibis", "text": "This looks like an old building but it has been refurbished to a very acceptable standard. The menu for Ibis seem to be the same in France so after a couple of weeks travelling you will get bored.", "user": "A TripAdvisor user", "date": "June 22, 2013", "id": 164781959}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Only downside was when a coachful arrived. The restaurant staff coped really well but the race and quiet just went", "title": "Travel vlaue", "user": "HenryScreen", "date": "June 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 162796187}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "As with many Ibis hotels this is near an industrial estate on the outskirts of town. Ok, though other than the CORA not much else in walking distance. Hotel a little noisy due to location. Other than that usual basic, clean Ibis standard. Please please please Ibis, can you provide tea and coffee making facilities in the room for us Brits!", "title": "Ibis - quite near main road / CORA - generally OK - a bit expensive for the location", "user": "wombleadvisor", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 161257631}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "A very nice stay, typical ibis quality with a nice bar and restaurant, good atmosphere and friendly staff. €9 per person for breakfast which seems a little steep, especially for a 6 year old. But a nice place for an overnight stay.", "title": "A very nice night stay", "user": "Merlin F", "date": "May 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 160628400}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "This is the third Ibis I have stayed in in the Dijon Area and I would say that it is currently the best value for money. The staff are pleasant, the location good for visits into the city or out to the villages en route to Beaune. Restaurant facilities are good, but there are a large varieties of places to eat close by. When I return to Dijon I shall be booking there again.", "title": "Good stay in Dijon.", "user": "Ste120", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160083764}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Clean, confortable and quiet. Close to autoroute and easy to find. Lots of restaurants nearby. Room was reasonably spacious. Disappointing that Ibis hotels don't have coffee/tea making facilities in room but, despite this, was generally OK and I'd stay there again!", "title": "Ibis", "user": "Bushy87130", "date": "April 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 156977132}, {"rating": 4.0, "title": "Ibis quality. Great staff.", "text": "Address of hotel could be more helpful, but the GPS ID gets you close. Once we found it the reception was helpful and the place clean and fresh. It's close to the road but the rooms are away from this and we had a good nights sleep, no noise trouble. We ordered 2 dishes from the 24 hour bar menu. They arrived at our door soon after and were delicious.", "user": "A TripAdvisor user", "date": "April 3, 2013", "id": 156487612}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We were travelling to the alps from Calais so at 5.5 hours or so in, this location was an ideal spot for an overnight stay.", "title": "An excellent place to stop over!", "user": "coachles", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152927687}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The room was basic but modern and ideal for one night. It was absolutely spotless so the housekeeping staff deserve a 10/10 for their efforts. The beds were comfortable with the only down side being the usual problem in hotels of keeping the room aired and at an acceptable temperature during the night. The window was directly above one bed so it wasn't practical to have it open and the air conditioning was tricky to balance out with the right temperature. With a bit more effort we probably could have sorted it out but we were tired!", "title": "good value and friendly", "user": "Funkychicken12", "date": "January 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150801528}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The bathroom is exactly what you need and the free wifi for one night is a bonus for this type of hotel.", "title": "Much to commend it as a stop-over", "user": "papluviose", "date": "January 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 149452588}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Breakfast was superb with a great choice.", "title": "Good value but difficult to find", "user": "Janice292", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 149049718}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My only advice would be make sure you really research where it is from your direction of arrival. It is in a huge out of town shopping area and although our sat nav helped we could have done with a bit more detail on how to find it. Leaving and finding the motorway South was much easier!", "title": "A perfect start for visits to wineries.", "user": "Stesse", "date": "August 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 136166837}], "location": {"country": "France", "region": "Burgundy", "continent": "Europe"}, "variance": {"poor": 11, "average": 54, "very good": 121, "terrible": 6, "excellent": 31}, "aka": "Ibis Marsannay La Cote", "slim_ranking": 0.1, "description": "At the starting point of the Wine Route, surrounded by the Burgundy vineyards, the Ibis Dijon Sud hotel is easily accessible from the centre of Dijon (15 km) or the A39 motorway. The airport is 9 km away. The hotel has 48 air-conditioned rooms with Wifi Internet access (2 adapted for disabled guests) and 1 meeting room. A restaurant, a bar open 24/24, a terrace and free parking are at your disposal. Tennis and golf 5 and 8 km away respectively."}