{"user_rating": 3.5, "review_count": 2638, "name": "Ibis Milano Centro", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "I spent 3 nights at the beginning of July 2010 in this hotel and can warmly recommend it to every one who's looking for the best correlation between the price, quality, comfort and location. They have a promotion for a long weekend and the price is with 30% discount so the double room costs just 151 euros (without breakfast). The room was very clean and modern furnished. The bed was super comfortable. You can easy to find Ibis hotel if you walk just straight from the square of the Central rail station, where is the main stop of the buses from Malpensa and Orio del Serio (Bergamo) airports. It takes just 10 min walking or you can take a metro (red line) to Porta Venecia station and them just 3 min walking trough via Tunisia, which is on the main shopping street Corso Bueno Aires. You can use metro (red station again) to reach quickly Duomo (just 2 or 3 stops away). The tram stops are very close as well so you have many and easy ways to reach the city center, Cental rail station, shopping areas, sight-seeings and whatever you want to go in Milano. I can't say anything about the free Internet connection or the food and service in the restaurant because I didn't use these facilities but if you're hungry you can find in the area many small nice places for coffee with breakfast, ice-cream, pizza and even Billa supermarket. The only problem I had in the hotel was that sometimes I couldn't open the room door with the card. I saw another customer to have the same problem so it will be good they to change cards time to time or just to check the locking system because it's a bit annoying.", "title": "It's really worth it", "user": "GattaPasso", "date": "September 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78224113}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I enjoyed my stay in this hotel and if I come back to Milan again, with sure I will stay there.", "title": "Was OK...", "user": "GlobeTrotter933", "date": "August 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 75941626}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I choosed the Ibis Milano Centro after reading comments on Trip Advisor. This was obviously an mid-budget hotel. It was OK, nothing more.", "title": "good value", "user": "TravellerIndependent", "date": "August 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 74425134}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Easy to navigate from the train station, the hotel is located on a secondary road and it's in a quiet location. There is not too much dining options close to the hotel (5-10 minutes walk). We tried the restaurant within the hotel and I was disapointed with the choice offered and the pricing, which I found to be very expensive for what you get. We are not talking about fine cuisine, but the prices in Milan seems to be higher than average everywhere anyway.", "title": "Ibis Centro Milan", "user": "belanda1", "date": "August 6, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 74088981}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This hotel does not offer free Wi-Fi. You have to pay 15 Euros per 24 hours. Connection was hard to make with the 3rd party provider. May be it was due to the room location.", "title": "When in Milan, stay in Ibis Milano Centro!", "user": "onlythemostawesome", "date": "July 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 72053106}, {"rating": 4.0, "stay_parameters": "Stayed April 2003", "text": "We stayed at the Ibis Centro for 4 nights in April and was very pleased with the hotel. For a family of 4 (2 children 12 and 10) we had to book two rooms, as family rooms in Milan don't seem to exist. Anyway, the hotel was very convenient for the centre - about a 10 minute tram ride. A tram stop is located just outside the hotel. We found the staff very friendly and helpful. The bar was a bit small but you don't go to Milan to drink in the hotel bar, do you!! The rooms were clean , although a touch on the small side, but at a cost of £50 per room per night (April off peak rates it seems) perfectly acceptable. I would stay there again. I gather, tho' that prices rise steeply in peak periods, so do your homework first on comparative prices.", "title": "Hotel Ibis Centro", "helpfulness": 17, "user": "Papofurado", "date": "May 8, 2003", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 992374}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We booked this hotel just for couple of nights, the rooms very nice & service was really amazing....we loved it !!", "title": "It's very clean & rooms are very nice", "user": "escube_studio", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 3.0}, "id": 68402377}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Over all a wonderful experience.", "title": "Better alternative than Hotel Sempione on the same street", "user": "Bondi25", "date": "June 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 67881041}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Bankim Gogri", "title": "Best location for tram,train and underground.", "helpfulness": 1, "user": "GMAN75", "date": "June 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66616922}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We have stayed in Ibis on 2 separate occasions, with two totally different experience. Even both rooms costed the same, the double room on your left hand side facing the reception was newly furnished, modern minimalist look, so simple yet pleasant bathroom, and comfy bed, whilst, the twin-room (since the double room was full) on your right hand side facing the reception is so much older, ugly floor-board and bathroom, and unenchanting bed cover - overall the room gives you a depressing feeling. So if you book, make sure you get the new room! Location is sufficient, 15 mins stroll to the Dome, and if you arrive by train (or shuttle bus from the airport), just walk few blocks down the main road from the front of the central station, or just take one-stop metro from the central station to Republica station, then turn to the street on your left infront of the Westin (Ibis is at the end of that street). The staff is more helpful compared with other hotels in Italy, better trained I supposed. However, the Internet price is way too high, besides the first 15 free mins each room gets, it costs EUR7 per hour - so you are better off go wifi in a cafe!", "title": "Great value and convenient", "helpfulness": 2, "user": "kakijalan", "date": "June 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 66195796}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "We stayed here for a week in may and found the hotel to be brilliant value at only about 53 pounds per night excluding breakfast, which was quite expensive at 8.50 euros but you could eat as much as you liked.The tram stops at the back of the hotel which takes you to the duomo etc or there is also two metro stations within a 5 to 10 minute walk.Milan central train station is a ten minute walk away and is worth seeing even if you don't intend to catch a train.The hotel is very clean and the rooms are quite small but have a huge bed!You can order room service 24hrs a day or eat a snack at the bar which serves draught peroni for 4.50 for a large glass.We did not eat at the hotel restaurant as there are cheaper and much nicer places nearby.The hotel also has internet access but you have to pay after the first free voucher which lasts for around 15 mins and has wi-fi in the rooms.We would stay here again if we ever return to Milan because of the value,cleanliness,nice staff and above all the location which is just away from the crowds but with easy access to all the sights and the station for exploring other areas.", "title": "location is good but the room wasnt clean", "user": "Trump23", "date": "May 23, 2010", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "location": 3.0, "service": 4.0, "rooms": 1.0}, "id": 65103812}, {"rating": 3.0, "stay_parameters": "Stayed September 2005, traveled on business", "text": "I go to Milano twice yearly for a convention. Ibis is a hotel we've stayed in a bit. The hotel seems to host a lot groups and is full of travellers from Japan as well as groups of other conventioners from neighboring countries. During the mornings the breakfast area is a mad house. The breakfast buffet is pretty meagre by north american standards but I it's a pretty normal spread in most of the italian hotels we've stayed at.", "title": "okay for business travellers", "helpfulness": 10, "user": "604Paninaro", "date": "December 18, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 4249697}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "Most rooms are pretty small and the washrooms are typically cramped. Make sure you're not staying in a room on a lower floor facing the Tram! It'll keep you up at nights. Rooms were clean. Elevators are very small, maximum 3 people with bags in a single file (bags in front).", "title": "Very good value 3 stars", "helpfulness": 6, "user": "And42100", "date": "December 9, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4228640}, {"rating": 3.0, "title": "Dont expect for to much", "text": "The hotel has a safety deposit type safe on the side by reception. You have to get a staff to open it up with you, so during busy periods at reception this can be quite a task. Oh and they really have a silly way to check people in... it's by the letter of the alphabet to your last name.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 26, 2005", "id": 4053020}, {"rating": 1.0, "title": "Staff deeply rude - do not stay here!!", "text": "The Central train station is about a 15 minute walk, Republica line a 5 minute walk and the station on Buenos Aires is 10 minutes. By Metro the Fairground is a 30 minute ride. Lots of supermarkets nearby but you've got to hit them before 7PM before they close. Restaurants are everywhere in this neighborhood. For a bit of variety, there's a surprisingly decent chinese restaurant called Lon Fon on the Tram side of the Hotel.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "August 8, 2005", "id": 3746693}, {"rating": 2.0, "title": "Not so great", "text": "604Paninaro", "helpfulness": 5, "user": "BillVol", "date": "April 13, 2004", "id": 1783183}, {"rating": 2.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Stayed just one night in Sept 2010 in this hotel. The room was expensive, and we had booked three rooms, so we really paid a lot to stay in this hotel. The room was very dated, with a very odd flooring that seemed dirty and two old bedspreads and single beds. Breakfast was good however, but basic continental - check-in desk sold us on \"eggs\" but the eggs were just hard boiled but peeled eggs.", "title": "Glad it was just a night", "user": "europa00", "date": "September 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 79703529}, {"rating": 4.0, "title": "Easily accessible from central train station, close to metro stations, clean but staff not overly eager to help", "text": "Its fairly close to the metro, perhaps a 10 minutes walk, but a bit far from the train station to walk, so you'd need a taxi while isn't too expensive. The internet was not free and was very expensive, so did not use. They also had bottled water in a vending machine but it was 2 euros for a bottle of water, very expensive since our hotel in rome had water for just 50 cents.", "user": "meliedanis", "date": "September 14, 2010", "id": 79511393}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "The evening and night staff were not helpful, it was easier to deal with the morning staff.", "title": "Modern Hotel Good Location", "user": "Robin061", "date": "September 12, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 79253133}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "food at breakfast buffet was fresh and there was choice but no hot meals. The ibis rooms are standard and you can always expect a clean room.", "title": "Good value for money", "user": "lavender-ru", "date": "September 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 79091968}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Location: easy access to everything", "title": "Perfect for city visit", "user": "TravellerThilak", "date": "September 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78810155}, {"rating": 3.0, "stay_parameters": "Stayed May 2007", "text": "I stayed here two nights in May 2007. The rooms were basic, but very clean. We had dinner at the hotel; the food was good but pricey. Breakfast was \"Amercian-style\" and fine.", "title": "Good hotel - questionable location", "helpfulness": 1, "user": "Lecia J", "date": "December 9, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 11400094, "likes": {"liked": "— Clean and good breakfast", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "There were problems, however, with the phones. Everyone in my group had calling cards, but the phones wouldn't work (even for tollfree numbers) without going down to the lobby and paying a deposit. Was a big hassle, especially for people that didn't have credit cards. The staff at the lobby counter were slow and quite curt too.", "title": "Great Value, would use again.", "helpfulness": 6, "user": "ArferDent", "date": "November 12, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 10768186, "likes": {"liked": "— Location & Cleanliness", "disliked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Another problem we had was with the location - it didn't seem to be in the best neighborhood and we were told to only walk around at night in groups of 3 or more, so we didn't go out and explore much.", "title": "All right hotel", "helpfulness": 3, "user": "natashka5", "date": "September 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 8866151, "likes": {"liked": "— location", "disliked": "— small rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "All in all, I would stay here again, but it's certainly not my first choice.", "title": "Good Room, Good Price", "helpfulness": 2, "user": "fashiongirl7", "date": "July 12, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8106172}, {"rating": 2.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "In any other city, I'd give this a 3 star review for being an average, no-frills, decent hotel. But in Milan, where there are some chronic hotels, this is great value.", "title": "You get what you pay for", "helpfulness": 3, "user": "ToddParis", "date": "January 3, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 6545733}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled with friends", "text": "The hotel is highly above average for a 2 stars hotel with a new building and very clean rooms.It is better than many 3-4 stars I stayed in Europe. The Dome is in 20 mn and Corso De Buenos Aires shopping street is in 3 mn walk distance , so is the subway station.I strongly recommend the hotel for short gateaways and low budget trips", "title": "Great for a 2 stars", "helpfulness": 3, "user": "Maya_tr", "date": "October 3, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5901996, "likes": {"liked": "— It's modern and new building", "disliked": "— Some rooms are very dark , without sun light."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "By the time we got to Milan we were totally broke and I was so nervous about staying at a cheap hotel. Our taxi driver actually recommended it and I would say it is a good option for someone on a budget. The area is pretty cool and I felt very safe in the hotel. It is equal to a new Super 8 in the US. We walked into the hotel without reservation and they advertise a 99 Euro per night rate so the rates I am seeing advertised seem a bit high. For 99 euros I would say it was just fine. It was easy to walk around the city and I would estimate it was a 10-15 minute walk to the Piazza Duomo and the central shopping districts. Our friends all stayed at the Four Seasons and loved it but I am glad we saved money on the room because the shopping was super.", "title": "CHEAP HOTEL IN MILAN", "helpfulness": 5, "user": "KNR1851", "date": "September 3, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 5765575, "likes": {"liked": "— Cheap", "disliked": "— Ugly room"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The room was clean, ugly 1980's grey, small, but it had hot water and a tv. Besides we were not interested in staying in the room. I thought it was a good place to stay if one is on a budget", "title": "Cheap, cheerful, and you get what you pay for", "helpfulness": 5, "user": "unclejames", "date": "August 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 2.0, "rooms": 2.0}, "id": 5537780}, {"rating": 1.0, "title": "Unpleasant", "text": "If you're a UK reader, an Ibis hotel is much like a Travelodge. If you're a US reader, it's a step above a motel, but probably not much of one. The Ibis experience isn't one of luxury. But the Ibis price isn't one of luxury either.", "user": "A TripAdvisor user", "date": "July 18, 2006", "id": 5478471}, {"rating": 2.0, "title": "Ideal for Short City Break", "text": "We ordered a double room; we got twin beds. The hotel room is clearly a little old, though the public areas of the hotel appearedto have had a makeover recently. The internal restaurant was cheap but nice; the internal bar not dissimilar to what you'd get if you got a bar in a motorway service station but not too bad for all that; and if you think that \"Centro Hotel\" means it's central to Milan, you'll soon lose that impression when you discover it's three underground stops (for a euro) to get into the centre of town. The secure parking is great as long as you arrive at 2pm (as we did) and not at 6pm.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "January 23, 2006", "id": 4370973}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Ibis Milano Centro is very good for anyone arriving by train because it's in a walking distance (15 minutes) from the station. For people coming from Malpensa airport is also good, because there are bus coming from the airport to the train station.", "title": "Great location on a typical Ibis", "helpfulness": 2, "user": "lucasousa", "date": "July 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72038696}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The Ibis is very close to the city center. You can go by foot (15 minutes) or metro (2 or 3 stops) to the most important attractions like the Duomo, Scala, via montenapoleone and much more.", "title": "More than expected!!!", "helpfulness": 2, "user": "Liana25", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71745869}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "About the hotel, is situated in a quite area and is a tipical Ibis. Rooms with no luxury but with everything you need (and with a great price for Milan). Definitely one of the best price/quality ratio hotels!", "title": "Decent hotel at convenient location", "user": "aerotrav", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69517835}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "A couple of friends of mine went there this year and liked it too.", "title": "Reasonable priced accommodation in good location", "user": "Usenko", "date": "June 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 69200169}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The Hotel if I'm not mistaken was just renovated. So everything in the lobby, room and bath feels like extremely fresh, new and more than clean. I would definitely recommend it due to the price and location. Though some people may say that it is far from everything - it is not true. The hotel is strategically situated in 5 minutes walk from Corso Buenos Aires, Via Manzoni and Corso Venezia and from 2 Metro stations if you do not like walking by foot!!! And the public garden was right up my street - an island of tranquility in the heart of big city. Thank you Ibis!!!", "title": "Good Location and Ibis Reliability", "user": "kevinpng", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68638103}], "location": {"country": "Italy", "region": "Lombardy", "continent": "Europe", "city": "Milan"}, "stars": 3, "variance": {"poor": 174, "average": 634, "very good": 1370, "terrible": 67, "excellent": 393}, "aka": "Ibis Milano Centro Hotel", "slim_ranking": 0.289655172414, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.0}, "description": "Just a stone's throw from the city center and the train station and only 5 miles (8 km) from the airport, the Ibis Milano Centro hotel is the perfect base for visiting Milan cathedral and La Scala opera house. This international hotel has 437 air-conditioned and soundproofed rooms, 6 of which are suitable for guests with reduced mobility, as well as an \"Open\" concept restaurant and a bar open 24 hours a day. Perfect for conferences, it also offers 8 meeting rooms and a free Wi-Fi connection."}