{"user_rating": 3.5, "review_count": 571, "name": "IFA Bavaro Village Resort & Spa", "reviews": [{"rating": 1.0, "title": "NEGATIVE.......", "text": "You get what you pay for!!! It was beautiful scenery, but that is all the further it goes. Took 6 hours out of our \"arrval date\" to check in, front desk employees does not speak English well enough, and has the worst customer service. Finally received 1 key (only) keying in to our room it was taken by another family. Went to complain and in 5 minutes they had us moved to another room, promising us we would be moved again to be closer to our friends we came with. Never happened the whole week. 2 weeks before arrival we had a confirmed email stating we would have the 3000 block and 3 rooms in a row so we could be all together. Never happened, and yes we requested it once again. Ocean view - Not at all. Quite a walk to the beach. The food was bad. The alcohol was bad. Customer service throughout our resort was bad. There may have been 2 employees that were friendly. We knew people that were moved 4 times due to their air conditioner not working. We had to call about our air also. We had to pay $20 for an extra key so we could keep the air on all day. Once you took your key out of the box for the lights and air it shut off. So your only choice was purchasing a key. After complaing to our Apple Vacation Rep. we got $20 back. We had ants galour. We had to wash everything when we got home. We experience cockroaches, and a mouse. There are no wash rags. Cannot drink the water. It took an hour standing in line to check out, once again it was bad. Our engoyable experience was the excersion we went on (for extra money) and a 10 minute walk to Hard Rock Cafe so we could get some \"real\" food and a \"real\" beer. It was to die for and the employees there were all about service and happy and cheerful. Our friends never did get their phone fixed after reporting it 5 times. There are no hair dryers in the rooms like they mention. Was great to get back to the states. I know we wil not be back, and do not recommend it.", "helpfulness": 1, "user": "vacationer77", "date": "February 18, 2008", "id": 13643655}, {"rating": 4.0, "title": "IFA Bavaro is Great", "text": "I travelled to IFA in 2006. I was there is april and july.", "helpfulness": 7, "user": "isariv007", "date": "February 12, 2008", "id": 13497602}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I work in the travel industry and traveled with a friend who also does. We really enjoyed ourselves. We are both in our 20s.", "title": "Negative Reviews!!!!!!! Are There 2 Ifa\"S", "helpfulness": 15, "user": "tkachance", "date": "February 8, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13380654}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "ROOMS: Pretty large compare to other resorts. Very simple but clean. Did have a lezard one time in the room. But it is part of the experience. We were located in the village area. Between the main pool and the smaller one. They do sometimes clean the rooms later in the afternoon. Limited Towels but you can always ask for more.", "title": "Attention -- Forget The negative reviews...", "helpfulness": 7, "user": "Reidmck5", "date": "February 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13178286}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "GROUNDS : Amazing. The resort is very big but it is very well kept.", "title": "Canadians like it here but", "helpfulness": 5, "user": "finnnnnn", "date": "February 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 13162090, "likes": {"liked": "— clean first level", "disliked": "— didnt know u had to fill out a list on what u wanted done in the room on the thing u hang on the door"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "A friend and I stayed here at the IFA Bavaro Village March 3rd through March 10th 2008... and what a perfect stay it was!", "title": "Perfect Vacation!", "helpfulness": 3, "user": "HotShotVancouver", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14323564, "likes": {"liked": "— The Beach and The People", "disliked": "— Can't think of a thing...."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This was my second trip to Punta Cana. Previously I stayed at the Barcelo Bavaro Resort, which brags a higher star rating than IFA, but I have to say that IFA was the nicest hotel I've stayed at in all my travels!", "title": "Good times at the IFA", "helpfulness": 4, "user": "M&HWinnipeg", "date": "March 14, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 14290915, "likes": {"liked": "— Beautiful beach, clean resort, newly remodelled, friendly staff.", "disliked": "— Check-in service was slow, music at pool was too loud, cocktail drinks were too sweet."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We arrived at 10pm to a speedy check-in and an escort to our room. As you can see from the attached photo, the room was gorgeous. Everything was clean and comfortable... and the shower... well it was just amazing. I had to take pictures so that I can someday have one like it in my house! It looked like our room and most of the resort was freshly updated/renovated, as the grounds were beautiful, the buffets and restaurants were clean and modern, the pools were amazing, and the washroom facilities were CLEAN at all times!!", "title": "Fabulous Resort", "helpfulness": 5, "user": "cj-sunlovers", "date": "March 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14262743}, {"rating": 1.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "The food at IFA was good too. We did one a la carte (Caribe), which was excellent... I recommend trying the local fish selection. The buffets were always fresh, lots of selection, and was better than I expected when visiting a carribean island. I heard a few people complaining that the meat was weird and tasted bad... But guess what? That's what beef tastes like when it's not stuffed with horomones and over processed!! If you are sensitive, then choose the chicken, it was consistant at every meal! There was always lots of fresh fruit, salads, rice, pastas, grilled meat, fish, dessert, and always attentive staff. What more can you ask for??? I am absolutely shocked at reading some reviews about the food being bad---are people just looking for something to complain about??", "title": "should be a 2*", "user": "onthebeach-7", "date": "March 9, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 3.0}, "id": 14173153, "likes": {"liked": "— didn t like anything", "disliked": "— aircondioning"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Bavaro Beach is absolutely amazing. If you just want to lounge in the sun and swim in crystal blue waters, it is the perfect place! Lots of loungers, with the beach buffet and bar close by so there's no need to leave the beach all day if you didn't want to! The animation crew is always up to something, either beach-side or pool-side, so if you are bored, take them up on a salsa lesson, an aerobics class, play some volleyball, get in on some water sports... it's all there.", "title": "Great Time - Good Deal", "helpfulness": 6, "user": "scapers", "date": "March 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 14138798, "likes": {"liked": "— Beach", "disliked": "— Buffet"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "First the bad... (but not too much of it, let me say!) No washcloths, language barrier - i speak english only so the spanish was a little difficult! The food was a little \"different\" but still not too bad overall. The 3 restaurants they have offer a little more of a \"formal\" atmosphere, and they are worth the trouble of making the reservation.", "title": "Great! Loved it!", "helpfulness": 3, "user": "MissyP3699", "date": "March 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14011996, "likes": {"liked": "— The beach and the sun", "disliked": "— The food"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Myself and 4 other ladies stayed here and we had all read the mixed reviews of this hotel - we were a little wary of what we would find when we arrived, but we were VERY pleasantly surprised! The rooms were clean, the beds were hard, but the pillows were soft! We stayed in the Ocean section, which is nearest the beach, so no need for any shuttle service to get there. A couple of us were late nighters, but let me tell you, we were in bed by 9:00 pm every night! I guess too much sun in the day! We never made it to the disco and only stayed up for one of the nightly shows! Beware of the roosters that cackle in the early morning hours!!! They got us up bright and early every day....", "title": "IFA Was Great! Better then we expected! A good place to stay!", "helpfulness": 9, "user": "MinnesotaWally", "date": "March 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13998138, "likes": {"liked": "— Clean and everything worked in our room. Quiet and restful."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled as a couple", "text": "A few tips: Make your reservations for the nice restaurants as soon as you get there - they are open to take reservations from 9:00 to 9:30 each morning. Beware of the mixed drinks - they sneak up on you! Take your own washcloths. If you like Diet Coke, you can only find it in the gift shop or on the beach at the flea market shops - 2.00 Dollars a bottle. Take plenty of sunscreen. Stay at the Ocean or the Village, not the Villas (the Villas appear to be the older section and more like bungalows, but is a really pretty scene there! You would probably need to take a shuttle to the ocean each day...) The Villas section seems to be the most quiet and less inhabited, so if you like that, you might consider it. The Village section (the middle) seems to see the most action and where the water aerobics and swim-up bar is. Fun!", "title": "Had A Great Time", "helpfulness": 7, "user": "reyna64", "date": "February 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 13921986, "likes": {"liked": "— The rooms and the hospitality of the employees", "disliked": "— I think that they should give two keys per room, when there is more than one person in the room."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Overall, we had a BLAST and we are going to go back next year! Hopefully we can learn a little more Spanish by then.....", "title": "\"Pure Paradise\"", "helpfulness": 10, "user": "MissyP3699", "date": "February 26, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13860427, "likes": {"liked": "— The beach and the sun", "disliked": "— The food"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "IFA Resort Review", "title": "Fantastic Location", "helpfulness": 4, "user": "Mustang2007Canada", "date": "February 22, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13762335, "likes": {"liked": "— Clean and great service", "disliked": "— N/A or check in"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Great beach, the best we've seen in Punta Cana. The food is (almost always) the same every day, but the worst of all was the cockroaches we found in our room on the last day...", "title": "Nice, but...", "user": "rrib74", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 14683991, "likes": {"liked": "— Near the beach", "disliked": "— Cockroaches in the room!"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We booked this trip through USA3000 and Apple Tours... Didn't know what to expect and weren't to concerned because the trip was dirt cheap! We were amazed at how beautiful the resort is and it was so big that we discovered that we hadn't even seen the whole place. Our room was next to the swim up bar pool and the pizza restaurant... the pizza was delicious, fresh and available all day! The beach was incredible, beautiful water and lounge chairs for relaxing. If you get to the beach later in the morning then you have to search out lounge chairs. We snorkeled right from a tour out of the resort, it was inexpensive and the site was nice lots of pretty fish. The all-inclusive package was great the food and drinks were all very good, they gave me the dominican rum when I asked for it on the rocks, we also enjoyed the mama juana... the grill by the beach was great and they had a nice assortment of foods to choose from. The buffet restaurant across from the spa is better than the one by the check in desk. It was less crowded and the wait staff was more accommodating. The room was so nice it looked brand new. We had a stocked mini fridge with sprite, coke, beer and water... some of the other guests said they didn't have that. The people that worked at the resort were friendly and we met one of the managers and we were impressed with how much he cared about the resort and the guests having a great time. We met some great Canadian ladies and enjoyed the days on the beach with them :) We walked the beach and there were no shells, I collect them and was shocked that there were none. The sand was pinkish and really clean. Overall we had a wonderful time and would recommend this resort and go back.", "title": "So much for so little!", "helpfulness": 2, "user": "GnTworldXplorers", "date": "March 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 14538330, "likes": {"liked": "— The pizza restaurant, the beach, the weather, the room... everything!!!"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "It is what you make of it! yes, the food is different to say the lease however it was good. I will give you tips because this is most important for your stay! 1-bring 300 one dollar bills 2-bring 16 oz plastic cups. 3-bring lots of suntan lotion. 4-GO TO BREAKFAST BEFORE 8:30 or the flys will bother the heck out of you..all the resturaunts are open air! 5-Don't exspect to see alot of americans there. 6-If you need to use a computer its only 1 us dollar for a half an hour. 7-make sure if you sign up for a snorkle trip that you don't have to take a 1 hour bus trip...you can snorkle right from the beach out front...they will take you to a reef for 25.00 for 1.5 hours. 8-Fishing should be no more that 90 dollars a person for 4 hours trolling. 9-tip your maid evdery day and she will keep soda and beer in the frig. 10-go around the whole complex the first day and you will find your spot. we liked the pool across from where the shows are held. 11-While your checking in turn around and see that guy sitting down....make reservations for the resteraunts. you can only make one at a time so you may have to go back every day...otherwise you will eat at the buffet all the time..if you check in on saturday then you can make reservations for monday....and so on! 12-the guy from captain cooks that walks around is shady. 13-get a safe for your room...20.00..its worth it! 14-the beer is good..its called BRAMA and I liked it. 15-the drinks are good also however the liquer is cheep brand called Harmony. 16-When the maids clean your room they open the windows to air the place out...thats when the bugs get in....however, they are just jungle bugs you have to exspect. If you go to an Island...there will be bugs...no problem! 17-as far as getting a chair at the beach....if you wake up early and start your day by 8am..no flys at breakfast, no line to make reservations for dinner, no problem getting a place to relax. 18-anyone who writes a bad review is up to late...if you wake up at 930-10am you will not like this place! You must get out of bed and start the day early. the sun is hot at 8am. 19-Three pools to choose from and All are wonderful in their own special way! 20-there are no hot tubs...I don't know why people are complaining about the hot tubs...they have four whirlpool tubs around the bar that is located the furthest from the beach. you must go there and have a feww drinks with Lois the bar tender. The tubs are not hot tubs! hello, hot tubs in 90% weather! Have some sense! 21-Taxi to IFA Bavaro from air port is 18.00...don't let them charge you 30 like they try! 22-The beach is loaded with things to do including..kyaking...oh, yes it comes with all inclucive...you must give 30.00 for a deposit and then you get it back when you return. 23-There are many rude people from Germany, france and Spain. Yes, thats right rude people! They butt up in line and knock into you while your walking..but thats there problem not yours! 24-the best pizza I have ever had is at there pizza place for lunch. Don't forget to look at the whole menu there! They have inside outs that are out of this world. 25-If you walk the ground every morning you will find coconuts and the workers dressed in green will cut them for you...get a few straws from the bar! remember, bring your one dollar bills because its nice to hand out a dollar or two to all the nice people working there. 26-There are plenty of spring water bottles given to you in your room every day! if you want more its not a problem. 27-Topless woman are everywhere so if you are from the US and you want to go topless...this is the right place. you may want to go tanning first to avoid burning!. 28-Shopping is nice on the resort with pricesw ranging from 2 to 30 dollars. The huts on the beach are full of huslers and they are a pain in the butt to deal with. You can use your charge card on the resort. Oh, they charge by the paso so take exchange chart...get it on-line and print it! 29-Shots of Marajamama are real good. its the Island drink and is good. Make the b ar tender chill it first!!!!! 30-leave your wife at home....just kidding! If you want more info feel free to contact me at remaxgold@aol.com", "title": "Wonderful vacation", "helpfulness": 5, "user": "coffeyclub", "date": "March 25, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14533421, "likes": {"liked": "— close to beach", "disliked": "— Bed pillows"}}, {"rating": 4.0, "title": "Nice Holiday!", "text": "Arrived at the IFA Bavaro Village on the 9th in the evening. The check out was quick and everyone was escorted to their rooms-the resort is pitch dark at night time. To my surprise, the rooms were above what i expected. They have been all renovated and are clean, modern and spacious. I have stayed in resorts that claim to be a 5 star rating, but i found these rooms much nicer. The air-conditioning worked very well-infact i was cold most of the time! The fridge was always stocked with bottled water daily, and the cleaning ladies were very friendly.", "helpfulness": 5, "user": "sb8826", "date": "March 23, 2008", "id": 14474413}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The beach is beautiful. The water is clear and warm-if you are looking for a nice beach get away-this is your destination. There are plenty of chairs on the beach. There isnt a lot of shade, but that didnt seem to bother many. The only thing i found annoying was the party boat that went by every hour with blasting music. Also, there is alot of noise from helicopters and other boats-but after a couple of days, you seem not to notice it anymore. There is a bar and place to eat during the day on the beach, so you can literally spend the whole day there.", "title": "Good place (3 resorts in 1)", "helpfulness": 6, "user": "YYZ2112", "date": "March 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 14428004, "likes": {"liked": "— Beach, Sun and Pool", "disliked": "— To much walking. The cobblestones on the resort are annoying. When they (employees) wheel the towel bin and the bus boy dollies your luggage it makes a loud noise."}}], "location": {"country": "Caribbean"}, "variance": {"poor": 47, "average": 114, "very good": 229, "terrible": 36, "excellent": 145}, "aka": "Ifa Bavaro Village Hotel Punta Cana", "slim_ranking": 0.633663366337, "description": "IFA Bavaro Village Resort & Spa is the ideal place for those guests who enjoy a quiet location during daytime and the service & benefits of the new IFA Corallium Spa located in the Ocean section and in the evening to enjoy a professional entertainment program with live performances on stage. In the center of the resort the lagoon-like Village Pool is the perfect meeting place for most daytime activities. The Villas area is surrounded by lush tropical gardens and invites you to relax. All guests have access to all services of the entire resort, regardless of the area in which they are accommodated. The \"all inclusive\" - service includes breakfast, lunch and dinner in the restaurant Colibri and Las Velas beach restaurant with buffets of international cuisine, snacks in the beach restaurant \"Las Velas\"or\"Pikalo” Snack Bar (open from 12:00 to 02:00h), menus in the Pizzeria new Creperie and dinner with prior reservation in the a-la-carte restaurants Italian \"Bella Serata\", Mexican \"Jalisco\", Asian “Bambu” and the gourmet restaurant \"Caribe\" (lobster with extra charge). With the \"all inclusive\" - service, you have the choice of a variety of national drinks and cocktails at all bars, including the In-Disco \"Fantasy\" (23:00 to 4:00h) with national drinks and admission. Our resort features a full catering and leisure facilities, such as 9 restaurants, 7 bars, discotheque and shows. Within this excellent facilities it offers: 3 Pools, each with a separate children's pool, 2 tennis courts, table tennis, basketball and volleyball court, darts, new mini club and mini disco for the entertainment of the little ones, stores at the shopping center \"Las Palmas\". 18 hole Golf course Cocotal ($) 5 min away. As well for free are, the use of loungers and towels both in the pool area as well as on the beach, for you to freely enjoy the Caribbean sun. Additional Services (extra charge) include: a laundry service, babysitting service, car rental, internet, money exchange, ATM and 24h medical assistance. The resort also has several souvenir shops, a small supermarket and a pharmacy. Activities range from dance lessons to Caribbean rhythms, introduction to the thrilling world of diving on to invigorating lessons of aerobics and agua-gym. Additional sports activities on the beach are: badminton, windsurfing (standard boards) snorkel gear, beach soccer, kayak tours, catamaran, pedal boat or sailboat, horseback riding ($), diving lessons in the PADI diving school ($), or in the vicinity of the resort you can enjoy deep sea fishing, boat trips & glass bottom boat (all$). Among the additional services is to mention the excellent IFA Corallium SPA, with more than 1500 m2 space, especially designed for relaxation and health care of the guests. It is open from 7:00 to 22:00h and offers: 8 cabins for facial and body treatments, a fitness room (free for all guests), a beauty salon, 2 saunas, 2 steam baths, Jacuzzi, hydro massage cabin and an outdoor massage area exquisitely furnished. Our SPA specialists will advise you about the wide variety of programs, beauty, anti-stress therapies and rejuvenating treatments."}