{"user_rating": 4.5, "review_count": 297, "name": "Il Bargello B&B", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Much has been said about this highly rated B&B and its incredible host. What has to be emphasized is the location. It is near everything. Steps from the Duomo, next door to the Bargello, and a short 2-3 blocks to the Uffizi.", "title": "Location, Location, Location", "helpfulness": 13, "user": "MelandRog", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6599096, "likes": {"liked": "— Location and hostess.", "disliked": "— Lack of fruit and cheese at breakfast."}}, {"rating": 5.0, "title": "A warm, hospitable, caring Italian home- Il Bargello", "text": "As others have noted the hostess is friendly, ready with advice, makes reservation for museums, and a darned good cappuccino.", "helpfulness": 14, "user": "travelwisher", "date": "January 13, 2007", "id": 6584637}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The rooms are quaint, but ours was a bit small. Others seem a little bigger. They are homey and comfortable. You felt like you were in someone's apartment. A plus is always accessible internet (and now wireless connection if you bring your own). We were there during cold weather but the rooftop patio would be worth the room charge alone in warmer weather. Wonderful views.", "title": "Fantastic location and host", "helpfulness": 9, "user": "Dazoli", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6563550, "likes": {"liked": "— Location, Host, Roof terrace, Longe room", "disliked": "— Long Life milk in coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "There are two quibbles that we have. First, we really wanted some fruit at breakfast (although we did not ask for it either). The second is that they seemed to turn the heat off during the day and when we came back in the afternoon the room was quite cold. Again, we didn't mention it and it might have been our mistake or within our control. It was warm at night, but then strangely it went off again each night at about 12:30AM until about 6:30AM. Dont get me wrong, we didn't freeze, but just mentioning it for the hostess.", "title": "Wonderful", "helpfulness": 6, "user": "janisjanis", "date": "January 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6550532, "likes": {"liked": "— Gabriella, the terrace", "disliked": "— nothing!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Overall, the reviews do this place justice. It is a great place to stay. The hostess is as wonderful as everyone says. Ask her for bargain places to eat. She would shun what the guides tell you and send you to a most amazing place.", "title": "Gabriella is the BEST!", "helpfulness": 13, "user": "Princess T-Rex", "date": "November 25, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6174039, "likes": {"liked": "— Location and Staff", "disliked": "— Have Gabriella book your tickets to the Museums before you get there"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed at Il Bargello for two nights...what a wonderful place to stay...we all loved it! Gabriela and Massimo, the owners, are absolutely lovely people who will make you feel more than welcome. They have decorated the B&B very nicely and there is air conditioning in the rooms. Don't miss the enchanting rooftop terrace, with partial views of the Duomo, Santa Croce and the Uffizi tower. The location is unbeatable - only a five minute (or less) walk to the Duomo and round the corner from Il Bargello museum. The only drawback is that it's on the third floor with no elevator - but, we actually came back from Italy a couple of pounds lighter, and believe me, we ate like kings, so perhaps the stairs helped! We wouldn't hesitate to book Il Bargello again for our next visit to Florence.", "title": "We loved Il Bargello!", "helpfulness": 19, "user": "Cdn_Globetrotters", "date": "September 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5759687, "likes": {"liked": "— Rooftop terrace, location and hosts", "disliked": "— Stairs!"}}, {"rating": 5.0, "title": "Excellent location Great welcome", "text": "Pros:", "helpfulness": 18, "user": "jokskot", "date": "August 20, 2006", "id": 5628939}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Situation", "title": "A perfect place to stay in Florence", "helpfulness": 16, "user": "bifm", "date": "August 17, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5619044, "likes": {"liked": "— The friendly welcome"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "Gabriella - pesonality, welcome and recommendations (Trattoria Anita superb value; OneStop superb situation by Ponte Vecchia (and her booking got us a window seat) (food OK if you like Pasta and Pizza - you’ll be disappointed if you’re expecting “Good” food).", "title": "agree with the posts", "helpfulness": 16, "user": "amy13", "date": "August 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5594691}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "Availability of PC and information", "title": "Wonderful place to stay in Florence!", "helpfulness": 20, "user": "kat1014", "date": "July 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5516908, "likes": {"liked": "— Location, personal service, very quaint.", "disliked": "— Climbing the stairs."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "After doing a great deal of research for B&B's, we came to the conclusion that this was the place for our honeymoon during our stay in Florence. Mostly we decided this from the great ratings...the great reviews seem endless here on TripAdvisor.", "title": "Good but Some Issues...", "helpfulness": 1, "user": "bosden", "date": "November 24, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 6171117, "likes": {"liked": "— Location", "disliked": "— Awkward situations with the host"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "After staying at Il Bargello though we're a little unsure how the B&B gets the ratings that it does. The walls are paper thin so we found ourselves whispering a lot and we never really felt \"at home\" here. The breakfast was usually cereal, oatmeal, and toast. It was enough to tie us through lunch and every morning Gabriella sat and joined us for breakfast. I'm sure it was an attempt at a nice gesture but the conversation was very awkward and we couldn't wait to get on with our day afterwards. We also felt as though we were punished once for trying to stop by the B&B in the middle of the day to drop off some of the items that we had purchased that day. My wife also had to use the bathroom as she had a little emergency. We were told that our room was not ready and that they need more time to prepare it. We had to insist that she needed to use the bathroom and we were just going to drop off the purses that we had purchased at the leather market so we wouldn't have to carry them around. If you've been to Florence you'll understand that it's a little difficult walking around with larger bags as the side walks are very narrow. We were trying to be nice about the situation but she seemed a little annoyed. There were several other strange scenarios but I'd rather not go into too much detail. This was certainly our least favorite B&B/hotel that we stayed at in our 2 week honeymoon trip. I'm not trying to convince anyone to stay here or not though, I'm just trying to share our experience since the reviews were very misleading to me. I think that the July 23, 2006 reviewer sums up Il Bargello better than what I can myself.", "title": "The heart (and soul) of Florence ...", "helpfulness": 11, "user": "Piccolina", "date": "November 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6124533, "likes": {"liked": "— The hostess, the location, the cleanliness", "disliked": "— The small shower"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "On the positive end, we really enjoyed the balcony and Gabriella did allow you to use her personal laptop with internet access. The steps were a bit of a hike but we knew from the reviews here what to expect and it didn't bother us at all. We met a few of the other guests and very much enjoyed our conversations with them so that saved our not so great breakfast conversations. Also, the location was very nice and convenient. As long as you're in decent shape, it's fairly easy to walk to just about any place in the historic district of Florence. If you go to Il Bargello we certainly hope your stay is a little more enjoyable than ours.", "title": "Duomo is at the end of the road!", "helpfulness": 17, "user": "Schmoopey", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6033252, "likes": {"liked": "— The cleanliness", "disliked": "— Noise early in the morning"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We spent a week at Il Bargello recently, and would highly recommend it! Gabriella is a wealth of information about all things florentine, and truly enjoys helping her guests (including providing them a limitless supply of Nutella!). The b&b is quiet and comfortable, and the location is unbelievably convenient to major sights, great restaurants, and beautiful concerts every evening at Santa Maria de' Ricci. The 77 stairs do exist, but they're beautiful old stairs! Enjoy your stay at Il Bargello!", "title": "We definitely HIGHLY recommend!!", "helpfulness": 19, "user": "WelltravelledCanuck", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6029673, "likes": {"liked": "— Location", "disliked": "— Nothing, it was honestly perfect."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "When we arrived at the B&B we were shown around by Gabriella and taken to our room. We were in a smaller room to start with and were told we would be moved to a better room after two nights. Initially I wasn't that happy about being moved, but Gabriella said she would move everything for us and we didn't need to worry about a thing. I am so glad she did move us because the new room was absolutely great. Both rooms were extremely clean, but the second room had a wardrobe and a dressing table and much more space around us, which the first room didn't. The only downside to the B&B was that we could hear workmen outside our window from quite early in the morning. The road from one side of the B&B was closed due to work aswell (which has been going on for about 2 years apparently) but that didn't bother us as we always came in from the other end anyway. Breakfast is served round a communial table from 8am - 10am. It's best to get to the table early as one morning we couldn't get a place until gone 9am as all the seats were taken, which was ok but we liked to get out early. Gabriella was extremely hospitable and very willing to help with any information from places to eat to shopping tips or even a general history of Florence. I would deffinately stay again as the location is so great, the price is very reasonable, the rooms are extremely clean and Gabriella makes a great host.", "title": "The best in Florence", "helpfulness": 14, "user": "Erickson", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6025555, "likes": {"liked": "— Large, comfortable spacious room and bathroom", "disliked": "— 3 flights of stairs"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Stayed at Il Bargello for 4 nights during our honeymoon in Florence. We had an amazing time in Florence and Gabriella's Bargello B&B was the perfect choice. Don't be deterred from the initial fear of walking up the steps to the 3rd floor - it's good exercise and worth the effort!! Gabriella is such a great host - she will help with museums, restaurants and an excellent cappuccino!! We booked via email directly to Gabriella, ask her about Rebekah's wine tour of Tuscany for an excellent day trip into the Tuscany wine region - you'll love it. Florence is a beautiful city and very easy and safe to get around. You walk everywhere and the food is amazing. Make sure to eat 2 servings of Gellata daily!! Have fun and book with Gabriella you'll have a great time!!", "title": "Il Bargello is awesome!", "helpfulness": 13, "user": "jgayser", "date": "October 22, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5984818, "likes": {"liked": "— owner", "disliked": "— the bed"}}, {"rating": 4.0, "title": "Loved the Il Bargello!", "text": "I must admit that I was slightly worried about staying at a B&B on our recent trip to Florence, but am pleased to say that we couldn't have chosen a better accommodation! I had read some of the complaints listed on TripAdvisor from those who didn’t want to be in such close quarters with other unknown guests, but I found that those who don’t want to socialize don’t have to! Although my husband and I both enjoyed getting to know the other guests, we saw that we could have easily kept to ourselves by staying in our room. One of the greatest pros is that the location is absolutely perfect! We were able to walk from the train station upon our arrival (although it was a long walk), and all of the attractions that we visited were easily walkable. The rooms were clean, comfortable and charming. And the ability to use the kitchen and roof top terrace was wonderful ...features that we wouldn't have had if we had chosen to stay in a standard hotel. One evening, we bought prosciutto, fresh mozzarella and a bottle of wine from the Central Market to enjoy on the rooftop after a long day of sightseeing….this made for one of our most memorable moments in Florence!", "helpfulness": 19, "user": "Traveller815", "date": "October 9, 2006", "id": 5932804}, {"rating": 5.0, "title": "Wonderful! Gabriella could not be nicer.", "text": "To make things even better, Gabriella was delightful! She made wonderful restaurant recommendations, reservations, and also coordinated the reservation of a rental car. She also recommended a wonderful local artist for a fabulous keepsake from our trip. My husband and I also enjoyed discussing itineraries, things to do and see, and recommended restaurants with the other guests. I would highly recommend the Il Bargello to anyone traveling to Florence. Staying at the Il Bargello made us feel right at home thousands of miles away!", "helpfulness": 16, "user": "Bonaboy", "date": "September 30, 2006", "id": 5895096}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Il Bargello B&B was a wonderful place to stay for our 2 days in Florence. Yes, there are many flights of stairs to get to up there, but it is well worth it.", "title": "Do not hesitate!!!", "helpfulness": 10, "user": "ButtersMother", "date": "September 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5884861, "likes": {"liked": "— Location, spotlessness, friendliness of host.", "disliked": "— Liked everything!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006", "text": "Gabriella was incredibly helpful (a fellow Canadian to boot!) - she speaks perfects English. She was on the phone making dinner reservations for us at a moments notice. Her recommended restaurants and activities truly made our stay in Florence memorable. Do follow her advice about making reservations for museum tickets...they usually have to be reserved a 1 1/2 days in advance. It will cut an hour or more waiting in line out of your day.", "title": "Great place to stay!", "helpfulness": 12, "user": "jamie_webster", "date": "September 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5884753}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 3, "average": 9, "very good": 69, "terrible": 1, "excellent": 215}, "aka": "Il Bargello Hotel Florence", "slim_ranking": 0.214736842105, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Welcome to one of Florence's newest gems situated in a 15th century building in the very heart of downtown Florence. Our cosy, completely NON-smoking home was entirely renovated in 2004. All the rooms have their own private en-suite bathroom with shower, air conditioning, hair dryer, telephone and free wireless internet connection. Also accessible to all of our guests, is a roof-top terrace with a spectacular view of downtown Florence."}