{"user_rating": 3.5, "review_count": 132, "name": "Il Casato Residenza d' Epoca", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "This small hotel has an excellent location about 3 blocks from Il Campo. You can walk to everywhere in the old city center easily. The room was simple, clean but very pleasant with a great view of Siena and the Tuscan hills. The women at the reception desk are always ready with a smile to assist you with travel arrangements or reservations. The breakfast-in-bed tray is simple and could use some variety but was a nice change from the shuffle down to a \"breakfast nook.\" The interior of the hotel is beautiful and gives a unique old world feel.", "title": "Great location, Helpful staff", "helpfulness": 7, "user": "Festnoz", "date": "October 27, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4065255}, {"rating": 4.0, "title": "Nice little place", "text": "My only complaint would be that the online directions to the hotel are horrid if coming by car. We drove around for an hour and a half. If you do go by car, park in the Il Campo parking which I think is by the Port Romana. Or better yet, call for directions!", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 18, 2005", "id": 3374835}, {"rating": 5.0, "title": "quaint b&b", "text": "I loved this spot and would stay again in a heartbeat. I truly felt I was in Italy here. It is not just another \"chain.\"", "helpfulness": 21, "user": "A TripAdvisor user", "date": "August 23, 2004", "id": 2484557}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "Location is ok. Its just a little ways from il campo. the concierge was excellent and was very accommodating. Rooms were sub par for what we paid. Ceiling and some of the furniture had water stains on it. we didn't have hot water in the morning for showers but they took ten euros off the bill for that. They served a good breakfast to your room in the morning. Overall it was an alright stay.", "title": "Could have been better", "user": "thefreddys", "date": "March 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "location": 3.0, "rooms": 2.0}, "id": 14460858, "likes": {"liked": "— Concierge/breakfast", "disliked": "— cleanliness and the water stains"}}, {"rating": 3.0, "title": "Great old building", "text": "This hotel is in a good location, a little way up the hill from the Campo but still an easy stroll to all the action. It's set in a remarkable 14th century building (like much of central Siena), and while our room was fairly unadorned it did have a great view.", "helpfulness": 1, "user": "pandj78", "date": "January 25, 2008", "id": 12980905}, {"rating": 5.0, "title": "Perfect!", "text": "Breakfast was brought to the room and was quite decent.", "helpfulness": 2, "user": "CSK38", "date": "January 4, 2008", "id": 12332630}, {"rating": 5.0, "stay_parameters": "Stayed December 2007", "text": "The bathroom was old and small and it would have been good to have adjustable heating (we had to keep the window open much of the time), but other than that we were quite satisfied with this property and it was certainly good value for money.", "title": "Super Cute", "helpfulness": 1, "user": "sabina75", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12319063}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "We really enjoyed our stay here. The location is great, inside the city walls and only takes a few minutes to walk down to the main square. (Siena is not very big, so it's easy to walk everywhere, but it can be quite steep in parts). Reception is only open for set hours - we were arriving late so rang to let them know and they kindly stayed open late for us. All very accommodating. There is no breakfast room, so a basic breakfast (your choice of hot drink, orange juice, yoghurt, bread, croissant, fruit) is served direct to your room. The residence had great character, good bathrooms and was clean. Outstanding restaurant and wine cellar next door. Very enjoyable.", "title": "Very nice little residence-", "helpfulness": 2, "user": "truffolo", "date": "May 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 7585773, "likes": {"liked": "— location", "disliked": "— breakfast"}}, {"rating": 4.0, "title": "Great hotel", "text": "I recently stayed at the Il Casato Residence (July 7-10) and found it to be a great hotel. The front desk clerk was very friendly and spoke good English. Getting to the hotel can be a little confusing but if you stick to a map you'll have no problem. The easiest way is from Il Campo, when facing the Torre di Mangia, the road to the very right is Via Casato di Soto. If you go on this road you will be entering the hotel from the third floor. If you go on Via Giovanni Dupre, you will enter the first floor where the desk clerk sits. The third floor also has an entrance room with what looks like could be a front desk but during my stay I never saw any clerks there.", "helpfulness": 6, "user": "hyntravel", "date": "August 22, 2006", "id": 5691937}, {"rating": 2.0, "title": "Good & Bad", "text": "Upon check-in (on the first level) my room was a flight of stairs up and above the front desk. To the right of the room door was a lovely garden area which was very relaxing to sit in. When I entered the room I was surprised to see an entrance room with a twin bed and ample storage area, then a second room where the queen sized bed, television, desk, armoire, and bathroom was. Although there was no air conditioning, there was a fan in the room which was very useful. The hotel itself is a former residence, hence the name, and it provides many public areas to enjoy and relax in.", "helpfulness": 3, "user": "eatonl", "date": "August 20, 2006", "id": 5628506}, {"rating": 2.0, "stay_parameters": "Stayed March 2006", "text": "The hotel is well within walking distance of everything and nearby are an internet room and laundromat. Depending on your interest, you could do Siena (town center) in a day or take the time to explore. I would also suggest renting a car for a day, if you don't already have one, to explore the outer Siena area which is very beautiful. The towns of Monteriggioni and Castellina in Chianti are quaint and easy to get to. I would definitely revisit Siena and make Il Casato Residence my choice of hotel.", "title": "Nice residence, but..", "helpfulness": 8, "user": "ARKC", "date": "March 7, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 4589818}, {"rating": 1.0, "title": "Worst stay of our Trip!", "text": "I had some reservations about staying here after reading the reviews but I have to agree with the majority. The hotel is well located within the main town and very close to all major sights, but there were some negatives. It is not staffed with a 24 hour reception and our luck, we arrived during the mid-day when it was closed. So we wandered around until 3:30 when reception opened again. The lady at the desk was very friendly and helpful. Our rooms were on the 2nd floor but were at opposite ends (we were traveling with two small children!) so that did not work very well for us. The hotel is in an historic building which seems as though it was chopped up to make a hotel. Rooms are scattered through a crazy floor plan, there is no elevator and the steps are steep and narrow - making it very difficult to bring up our very large, heavy suitcase. Only after you check in do you have keys to use the upper entrance. Breakfast was minimal and a bit disappointing. I do not like having to note a time to have it brought to my room but prefer going to eat when I am ready. Overall, it wasn't bad, but location is really the best thing this hotel has to offer.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "December 5, 2005", "id": 4164000}, {"rating": 2.0, "title": "OK, but...", "text": "We spent a long weekend in Siena, staying at “Il Casato”.", "helpfulness": 9, "user": "gracie68", "date": "October 31, 2005", "id": 4075571}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 3, "variance": {"poor": 13, "average": 27, "very good": 53, "terrible": 5, "excellent": 34}, "aka": "Il Casato Residenza d` Epoca Hotel", "slim_ranking": 0.527472527473, "description": "il casato b & b is in the heart of siena close to the famous piazza del campo and the magnificent gothic cathedral which dominates the most' old city. all rooms are furnished with care and private bathroom, mini bar, safe casset, telephone ,cable tv, wifi.into the palace there is a romantic garden overlooked by almost all rooms, some with private terrace.is a great place to spend your free time in siena, to studies, to job, to discover the history or just go for walks through the narrow streets of the city. you can forget the car because we are two steps from aroundchildren are welcome.and if travel with dogs or cats you will find always."}