{"user_rating": 3.5, "review_count": 138, "name": "Il Granaio di Santa Prassede", "reviews": [{"rating": 3.0, "title": "Not the choice in summer", "text": "The location is great, about 5 blocks from Termini station, but far enough to feel like a better area than the train station. Very quiet street across from a gorgeous little church with 13th century mosaics.", "helpfulness": 1, "user": "edw11215", "date": "July 22, 2006", "id": 5497656}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "The promised air conditioning is basically non existent. It works, but at such a low level that using it is less efficient than leaving the windows open. Bathroom small but everything very clean and desk staff very pleasant.", "title": "Santa Prassede Pros & Cons", "user": "Joe K", "date": "June 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 5325574}, {"rating": 3.0, "title": "Good Location", "text": "No elevator and narrow stairwell,", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 2, 2006", "id": 5029005}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "My husband and I picked the Santa Prassede for the location and the value. We wanted to be within walking distance of Rome's sites. I called the hotel the day before our reservation to confirm it. I had booked the reservation three months in advance. The hotel said our room was confirmed, no problem.", "title": "Not As Great As We Had Hoped For", "helpfulness": 2, "user": "maminshe", "date": "December 2, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 6316397, "likes": {"liked": "— The location.", "disliked": "— They didn't have a room for us when we arrived."}}, {"rating": 4.0, "title": "Great location, clean and friendly staff", "text": "After a very long day and a very very bumpy and scary flight, we arrived at Ciampino airport, took a bus into Rome, got ripped off by a cab driver who charged us 18 euro to go 6 blocks, only to arrive at the Santa Prassede at 11:30 pm and find they didn't have a room for us. They offered to put us up at a 3 star hotel that was absolutely nowhere near any of Rome's major sites. Because we had no options, we agreed to stay at the other hotel for one night. They paid for our cab ride to the other hotel and the next morning paid for a cab ride back to the Santa Prassede. When the cab driver picked us up to take us back the next morning, he couldn't find the hotel!!! It's on a very obscure street. We drove around for about half an hour before he finally found the street it was on. When we arrived at the Santa Prassede, they still didn't have a room for us, so we were forced to leave our luggage in the lobby. We had such limited time in Rome that we didn't want to miss any sightseeing. We were uncomfortable leaving our bags out in the open, but we weren't about to let this ruin our trip. Luckily, nothing from our bags was stolen.", "helpfulness": 1, "user": "tulipberlin", "date": "November 28, 2006", "id": 6231040}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We arrived at the hotel later that day, were given the key to our room, and walked up four flights of stairs to a TINY room. When we went into the room, we realized the lights weren't working. We told the front desk. They said they would fix the lights. We left to go sightseeing, and when we returned that evening, our lights had not been fixed. All we had for lighting purposes was the bathroom light. The next morning we complained again. Later that day, they finally sent someone to fix it, (they managed to fix only one of the two broken lights) but at the point, we were pretty fed up with the Santa Prassede. The location is great--we were able to walk to all the major sites. From the outside, the hotel is very Italian-looking and cute; but I would not recommend staying here. The staff is polite but lazy, and you can never be sure that they'll actually have a room for you or that the room will be in adequate condition.", "title": "The case of the broken toilet seat", "user": "ConnachtRambler", "date": "October 17, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 5964699, "likes": {"liked": "— location", "disliked": "— The attitude displayed by putting guests in a room with a broken toilet seat"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We stayed there for 2 nights in November. The hotel is a 5 minute walk from the Termini Station but is very quietly located in a side street. Rooms are basic, fairly small but very clean.", "title": "Expected so much more", "helpfulness": 1, "user": "Barnii", "date": "October 8, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 5926853, "likes": {"liked": "— Nothing", "disliked": "— Everything"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "All in all a great value for the money you pay.", "title": "good location but could do better", "helpfulness": 1, "user": "breadbin", "date": "July 29, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 5526783, "likes": {"liked": "— location", "disliked": "— the general state"}}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 2, "variance": {"poor": 11, "average": 32, "very good": 70, "terrible": 12, "excellent": 13}, "aka": "Il Granaio Di Santa Prassede Hotel", "slim_ranking": 0.397265948633}