{"user_rating": 4.0, "review_count": 48, "name": "Il Mondo Boutique Hotel", "reviews": [{"rating": 4.0, "title": "Good value", "text": "We stayed one night and of all our hotels in Queensland this was by far the best hotel we stayed at.", "user": "CyberGreen", "date": "October 17, 2007", "id": 10101777}, {"rating": 5.0, "title": "great VFM", "text": "Room was clean, shower pressure good, toiletries and hand towels in the bathroom,which you may think would come with every hotel room but on this holiday we found it not to be the case.", "user": "bmarshall", "date": "July 24, 2007", "id": 8228812}, {"rating": 4.0, "title": "Nice place", "text": "Room is small but if you aren't staying for a week, then is perfectly fine. Easy parking and easy to find over the Story Bridge. Plenty of cafes,pubs and restaurants right nearby.", "user": "Al-8", "date": "August 7, 2006", "id": 5573380}, {"rating": 3.0, "title": "Great location... but upgrade to 4star!", "text": "My husband and I stayed in a 3 star studio room for 2 nights. The room was very small with a tiny bathroom and just the basic features. The room was quite clean, however I did notice a couple of marks on the bedspread and we were missing a hair dryer. Our dealings with reception were friendly and off street parking was a good bonus.", "user": "Angelco", "date": "July 21, 2008", "id": 18085458}, {"rating": 5.0, "title": "Comfortable Stay", "text": "I would recommend travellers to stay at the Il Mondo Boutique Hotel but I think paying a little more for a 4 star room would be a good idea. The location is great.", "user": "Vash", "date": "May 11, 2008", "id": 15942125}, {"rating": 4.0, "title": "spacious, clean, well equipped and overall excellent", "text": "We spent three nights in a ground floor hotel room (4 star side) and enjoyed it very much. The room was clean, comfortable and modern as was the bathroom. The location is convenient, we got around by ferry and jet cat mostly. The hotel restaurant was great as was the near by Story Bridge Hotel. We would stay here again if we returned to Brisbane.", "user": "London-pn", "date": "April 19, 2008", "id": 15135378}, {"rating": 4.0, "title": "Perfect", "text": "Stayed in April 2008. Booked a 2 bed 4 star appt. for my family for 5 days. We were upgraded to a 3 bed appt which was massive, 3 balcony's, 2 large bedrooms and one double bed area discreetly off the lounge, 2 bathrooms, one ensuite, one family sized. The kitchen was great, had everything, as well as the lounge / dining area which easily would have accommodated a party of 20!", "user": "Duesseldorf", "date": "January 21, 2008", "id": 12841634}, {"rating": 5.0, "title": "A little gem", "text": "Bit odd that the tv only had a video player and no DVD. There is a great bottle (wine and beer) shop within 30 feet, the ferry is 200 yds away. It is a 35 AUD cab ride for the airport. Staff were fine, being more helpful after we had been there a few days. The restaurant attached is OK, the Story Bridge Hotel (50 feet away) is better with Deery's offering good steak and kids meals.", "user": "Mrs_G-L", "date": "October 29, 2007", "id": 10437246}], "location": {}, "variance": {"poor": 2, "average": 11, "very good": 20, "terrible": 1, "excellent": 14}, "aka": "Il Mondo Boutique Brisbane", "slim_ranking": 0.364197530864, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.0}}