{"user_rating": 4.5, "review_count": 1210, "name": "Il Nido Hotel Sorrento", "reviews": [{"rating": 5.0, "title": "Great View, Excellent Food, Inexpensive", "text": "Everything exceeded our expectations except for the shuttle service. (described below)", "helpfulness": 1, "user": "rmttraveler", "date": "April 28, 2007", "id": 7479832}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Awesome home-cooked meals by Dino's (sp?) mom and brother. The prices and the quality were some of the best we had in all of italy. The view was unsurpassed. I enjoyed our stay at Il Nido and in Sorrento more than any other part of our 2-week-long trip in Sorrento.", "title": "Spectacular Setting!", "helpfulness": 1, "user": "Dalkeith33", "date": "April 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7479464, "likes": {"liked": "— View, dining"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We were initially upset with the shuttle service and, because of a series of misunderstandings, waited about 2 hours to be picked up. However, they apologized for this and gave us free wine for our entire visit!", "title": "It's the real deal in every way", "helpfulness": 2, "user": "Irish_guyIreland", "date": "April 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7431952, "likes": {"liked": "— clean,internet,food,views,staff", "disliked": "— found using linen towels strange at first but fine."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Set in the hills above Sorrento, there is probably no finer view than the one from the Hotel El Nido. It encompasses the Bay and City of Naples, Mt. Vesuvius and modern Pompeii. Rooms are comfortable and good value for the area. The dining room offers excellent meals at night, as well as breakfast. The hotel is family run, and staff are friendly and helpful. There is also good free parking. Driving to the El Nido from the A3 can take a little time as the towns along the way including Sorrento are busy. One tip is to take the road from Meta (before Sorrento) up to S. Agata then follow the Via Nastro Verde down to the El Nido from above.", "title": "Great hotel, great food, great guys", "user": "rhnarshad", "date": "April 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7404087, "likes": {"liked": "— view"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Just arrived back after a week's stay at Il Nido. It is definitely THE positive talking point of our trip.", "title": "Il Nido - Service, Value, and Friendliness", "helpfulness": 3, "user": "Navyfan", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7391802, "likes": {"liked": "— The included transit service, and the warm and professional staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I took the advice of many tourists and chose to stay outside Sorrento's downtown up in the hills. It was a great idea. For a small city, Sorrento is very busy. When you break it down, why does one go to Sorrento? For the city? No, it's for the atmosphere surrounding Southern Italy's Amalfi Coast. Hotel Nido has a fantastic view, very clean rooms, and an absolutely amazing transportation service to Sorrento's downtown (which has ferries to Capri) as well as the train station. Internet was free and very easy to use.", "title": "Great view", "helpfulness": 2, "user": "salonia2", "date": "April 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7362990, "likes": {"liked": "— View", "disliked": "— Small shower and rough towels"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "THIS WAS ONE OF THE BEST HOTEL MY HUSBAND AND I STAYED DURING OUT TRIP AROUND ITALY. We started in Rome and finished in VENICE. But by far one of the best hotels was IL NIDO. The staff was super kind and the food was just to dye for. We only stayed there one night before we departed to Capri Isola but we wish we would had stayed there longer. The food was prepared wonderfully. I had home made canelloni and it was delicious. Their house wine was wonderful. I also had an assortment of cheeses and it was also great. Breakfast was delicous as well. The view from the restaurant of the hotel of Naples BAY was breathtaking- I did not want to leave this small nest of scenery.", "title": "Wonderful Place!!!", "helpfulness": 2, "user": "Maria Jose H", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7287746, "likes": {"liked": "— The food- and staff", "disliked": "— Hotel does not provide real towels in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My husband and I got lost tryng to find the hotel but it was well worth it. We arrived around 10pm and they still cooked dinner for us at the restaurant and it was of course delicious. The room view was breathtaking as well and the rooms were very clean. The only thing was that they did not have real towels- only like a table clothes type of rag- I definitely recommend taking a towel with you when you travel around Italy- Some hotels like this one, don't believe in the word \"towel\" :) Overall, I would definitely stay at this hotel a thousand mroe times. This was such a lovely town and the people was extra kind. Il Nido was definitely one of my best hotel picks around ITALY.", "title": "Great service. Nothing was too much trouble.", "helpfulness": 2, "user": "allob", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7278356, "likes": {"liked": "— views, service", "disliked": "— necessity for a shuttle bus into town."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We stayed at Il Nido for a week, making it our base for sightseeing the area. Most guests stayed for only two or three nights. Once booking, the information given about the bus/train transfers, excursions, boat tickets, timetables etc. was extremely good. The service was excellent. Nothing was too much trouble and help with any information needed was given. Great personal service with the shuttle bus, though the necessity of this was not as easy as having an hotel in town. However, the price difference compared to hotels in town compensated for this inconvenience. Fantastic views!", "title": "Il Nido - All around wonderful", "helpfulness": 2, "user": "Tramath", "date": "March 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0}, "id": 7238361, "likes": {"liked": "— Everything", "disliked": "— Nothing to complain about"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "My husband, two teenagers and myself just returned from Italy and we stayed at the Il Nido in Sorrento for 3 nights. We stayed in a quad room with private bath and our stay was outstanding!", "title": "Awesome Hotel!", "helpfulness": 3, "user": "lemontreelover", "date": "March 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7229841, "likes": {"liked": "— The view and the restaurant and free internet.", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Stayed in Sorrento at IL Nido for two nights in June and booked solely on the reviews from TripAdvisor. Overall, my stay was great and I would highly recommend this hotel for the many \"pluses\" it offers including those looking for terrific value. As expected, the view from Il Nido was a breathtaking panorama of the Bay of Naples with Vesuvius looming in the distance. That alone was worth the price. The breakfast was the finest I had in my 2 weeks in Italy. Also, free internet service is a huge bonus anywhere in Italy and they provided 2 computers to use. We were able to catch the local bus to Positano from right in front of the hotel and the use of their", "title": "Nice Place", "helpfulness": 2, "user": "aphanna25", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7872212, "likes": {"liked": "— The view, breakfast", "disliked": "— Room decor"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "shuttle into Sorrento is much needed. I found the actual room to be very basic, although clean and comfortable. I also found the hotel to be somewhat noisy, as our room was located underneath the restaurant and the sound traveled through to our room with little resistance. It wasn't a bother to me whatsoever, perhaps it was my room location, but we spent so much time away from the hotel discovering the region that we weren't there enough for it to matter.", "title": "Loved Il Nido! You will too!", "helpfulness": 2, "user": "FunkyTan", "date": "June 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7849835}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The noise is evidence that business must be good, which is great news", "title": "A gem.........", "helpfulness": 1, "user": "stmag", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7835598, "likes": {"liked": "— Quiet location, size of room, view and food.", "disliked": "— Nothing to dislike."}}, {"rating": 5.0, "title": "Thank you for the comfortable stay", "text": "for the wonderful family which run it and who seem to work tirelessly", "helpfulness": 3, "user": "NANA_nagano", "date": "June 9, 2007", "id": 7818913}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "in an often thankless business. Again, this hotel provides a great value for everything that you get in return.", "title": "Spectaclar & Stunning Views", "helpfulness": 1, "user": "Carole59", "date": "June 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7817237, "likes": {"liked": "— Cleanliness,Friendly Staff,lovely room with views", "disliked": "— Bed was a bit hard on the first night"}}, {"rating": 5.0, "title": "It doesn't get any better than this!", "text": "This hotel rates a perfect score on all counts. I am hard pressed to find a flaw. It's an outstanding place to call home for however long you can stay. The staff is hard-working, competent, and helpful. The in-house restuarant is perfection. In fact, it serves the best Limoncello in the region (we tried many different ones in our 3 week Italy visit)---from locally grown lemons, but don't look to buy a bottle --- sadly none is available. Our room was exceptionally clean---and the view----well, you just need to go visit because my words will not do the view of the Bay of Naples justice. We loved being above the city...it was cool and much more relaxing. I would not change one thing unless it was the length of our stay. Hats off to Il Nido! A++++++++++", "helpfulness": 2, "user": "busterbyte", "date": "May 30, 2007", "id": 7721593}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "My niece and I stayed at Il Nido from 10-13 May. The best feature of the hotel is the stunning setting high above the lovely Bay of Naples. Most of the staff are exceptionally cordial and welcoming--reception here is far more cordial than in most Italian hotels.", "title": "A comfy \"nest\"", "helpfulness": 5, "user": "Annie021", "date": "May 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 2.0, "rooms": 4.0}, "id": 7654796, "likes": {"liked": "— Unforgettable view", "disliked": "— distance from town"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The food in the terrace restaurant (spectacular view!) is excellent and a terrific value for money. Breakfast is much more substantial than at most Italian hotels--there were eggs/meat, though I enjoyed the cheese and delicious Sorrento oranges with toast. Breakfast coffee is from a machine; it's OK though not great. Dinner was made extra elegant by a champagne apertif and bruscetta (served gratis) and the smiling and friendly service.", "title": "Above the chaos and overlooking the Bay", "helpfulness": 2, "user": "ginnywrites", "date": "May 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7639378}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Free internet access is provided from 8AM to around 10PM, a real convenience we hadn't expected.", "title": "everyone staying seemed delighted by their choice", "user": "akitadog", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7616249, "likes": {"liked": "— view from balcony friendliness of staff", "disliked": "— would have liked a bath rather than shower"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The room was small but immaculate. The beds were as hard as a rock, though. I felt as if the model for these beds were the stone couches of the Etruscans. I slept well, though. A lazy rooster (who himself had slept in, crowing at around 8:30) woke us up one morning. The air is delightful high above the town, and this was so much quieter than a hotel in the town itself.", "title": "a special place", "helpfulness": 3, "user": "kenandmrss", "date": "May 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 3.0, "location": 5.0}, "id": 7593730, "likes": {"liked": "— the view", "disliked": "— nothing"}}], "location": {"country": "Italy", "region": "Campania", "continent": "Europe"}, "stars": 3, "variance": {"poor": 13, "average": 39, "very good": 263, "terrible": 9, "excellent": 886}, "aka": "Il Nido Sorrento", "slim_ranking": 0.144329896907, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}