{"user_rating": 5.0, "review_count": 173, "name": "Il Sogno di Alghero", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "Il Sogno di Alghero feels a bit like a oasis of serenity and friendliness surrounded by olive trees. The setting is beautiful (the olive grove, swimming pool, reading corner and hamac \"island\" are a dream) and the owners Alessandro and Monica are wonderful hosts. We have rarely felt so welcome and received as much useful information and help on our travels. We were even treated to a freshly baked cake and some wonderful vegetables.", "title": "Outstanding hospitality", "helpfulness": 1, "user": "asmile", "date": "November 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87464586}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "While Alghero is very beautiful, we were happy to stay in green surroundings rather than in town, especially as car parking can be difficult to find in town. It was also good to have a kitchen at our disposal.", "title": "Nice and calm", "user": "krihol", "date": "October 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 83220458}], "location": {"country": "Italy", "continent": "Europe"}, "variance": {"poor": 1, "average": 1, "very good": 13, "terrible": 0, "excellent": 158}, "aka": "Il Sogno Di Alghero Sardinia", "slim_ranking": 0.0277777777778, "description": "For those who love being in touch with nature along the seaside, while relaxing or being entertained with one or several activities, our BED & BREAKFAST \" IL SOGNO DI ALGHERO \"(Alghero's Dream) is your ideal place. Our B&B is located within an olive tree plantatio, on top of a hill, just outside the town of Alghero. A small creek separates our property from the marvellous and typical Mediterranean vegetation of which you will have an impressive view."}