{"user_rating": 4.5, "review_count": 18, "name": "Ilion Hotel", "reviews": [{"rating": 4.0, "title": "Great balcony views", "text": "We arrived at Ilion at dusk and were so happy that there were a great number of signs directing us to the hotel! It is on a steep hill, but there was plenty of parking outside and we were met at the car to help with our luggage. The room was fairly large and we enjoyed the balcony (and the cats that came up to meet us!) A very short walk into the center of town. Breakfast was good the next morning. Our primary complaint was that the shower did not stay hot for very long - we each took a shower about 10 minutes apart and each of us only had hot water for about 2 minutes before it dwindled to lukewarm.", "user": "Alybyzrp", "date": "October 20, 2013", "id": 181734092}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Beautiful small traditional, family run hotel with stunning views over the Gulf of Corinth. Lovely rooms and friendly helpful staff. Ok, it is a steep, uphill cobbled access which might be difficult for the less able, but staff are ever ready to help with baggage etc. It is really worth seeking this place out. It is no distance at all from the main street and harbour and there are lots of nice eating places and bars too.", "title": "A little gem", "user": "Rasmie", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180338941}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Very nice!!! great view, lovely owner, great breakfast, great coffee. beds are very hard but for one night ok. parking is little difficult because of the hill, but for free..nafpactus is very charming, really worth staying there and not in patras!!", "title": "Romantic location", "user": "Carolinevioline", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 177480358}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Such a nice hotel room was very clean with old style decor and a lovely little balcony with a breath taking view of the sea!!! Staff was very friendly and welcoming!!! Few mins walk from the Main Street.. Wouldn't recommend this hotel to anyone who has difficulty walking up hills cos its a bit high up!!! Very happy with my stay at this hotel!!", "title": "Beautiful view", "user": "Englishrose1980", "date": "September 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 175940404}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Hotel is on hill near castle walls. The car park is below the hotel. Quite a few steps up to rooms but wouldn't stop us staying here again. The room was charming and very Greek with a balcony overlooking the town and sea. Staff were wonderful and breakfast on the terrace was superb. Harbour is lovely with bars all around it and good tavernas in the back streets. Would definitely stay here again.", "title": "Quirky hotel in old town", "user": "jeannieivy", "date": "June 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165580903}], "location": {"country": "Greece", "region": "West Greece", "continent": "Europe"}, "variance": {"poor": 1, "average": 0, "very good": 8, "terrible": 0, "excellent": 9}, "aka": "Ilion Hotel Greece/Naupactus", "slim_ranking": 0.0769230769231}