{"user_rating": 4.0, "review_count": 225, "name": "Imperial Palace Hotel", "reviews": [{"rating": 5.0, "title": "A little expensive but well worth it", "text": "The Imperial Palace (formerly the Amiga Hotel) is, overall, an excellent value in one of the more expensive cities in Asia. The deluxe rooms (which do not cost much more than a standard room) are large and comfortable, and might be the best-appointed of any hotel that I have visited in Asia. They are also a little too-well heated for my taste, so I spent most of my visit (during a very cold January) with a window open.", "helpfulness": 9, "user": "NKC", "date": "February 15, 2006", "id": 4463327}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "As one would expect for Korea, the service is flawless. There is a close attention to excellence that seems to penetrate every corner of the hotel.", "title": "Great Hotel, great service, the gym/sauna is a high light !", "helpfulness": 10, "user": "CJ_Atlanta", "date": "October 28, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4069223}, {"rating": 4.0, "title": "Finished Construction", "text": "Although the room was very reasonably priced, meals and drinks can cause sticker shock, if not momentary cardiac arrest. The room-service continental breakfast is more than $20 and the fabulous breakfast buffet is more than $40. This is due to some degree to the unusually strong Korean currency and the weak dollar. Once one recovers, however, the outstanding cuisine and attentive service makes it seem like a bargain.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 18, 2005", "id": 3481841}, {"rating": 1.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "The hotel also has several other restaurants -- all expensive but excellent.", "title": "Amiga Hotel is not my amiga", "helpfulness": 6, "user": "Weepinbell", "date": "May 9, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 1.0}, "id": 3451999}, {"rating": 3.0, "title": "Three Star Tourist Hotel", "text": "Located in one of Seoul's business districts, the Imperial Palace is about 70 minutes from the international airport and is served by a direct KAL bus service for roughly $14.", "helpfulness": 5, "user": "Stenna", "date": "August 17, 2004", "id": 2454226}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "I couldn't really find the 'wow' factor that other members felt about this hotel. It isn't kitsch, it's just clumsy and vulgar in its decoration. However, the staff, service and food levels are all excellent. We were booked into Imperial Palace by our conference hosts only a few days before arriving, and it was a busy period, with Fashion Week on, and the hotel apparently full - which meant that we couldn't change our room. Room 919 is not to be recommended. I suspect rooms number 19 on all floors will be the same - there is a kink in the building plan which means that three-quarters of the view from the window is blocked by a very close wall. There was almost no clothes hanging space, and little other storage. The bathroom was OK, but nothing special.", "title": "No 'wow' but some good advantages", "user": "salmoneater", "date": "October 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 47798384}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "After 3 days we managed to get a change - for considerable extra, to a Club room. Big difference! Very nice room and bathroom (with auto-wash-your-bum WC), bigger bed and good big view. (An indication of the service care - we realised we had left a suit hanger behind in the tiny 919 wardrobe, but weren't worried about it - but when we returned to our new room later that evening, there was the hanger waiting for us!)", "title": "Lives up to its name", "helpfulness": 1, "user": "99_redball00ns", "date": "August 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 39201204}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "If you enjoy a drink, and especially if you can also get by with a light evening meal, the Club facilities are worth the extra money. A 3-hour happy hour (6 - 9) is furnished with wine, beer and other alcohol, and a cooked dish that changed each evening - and in a pleasantly faked 'traditional Korean domestic' setting. The cost compares very favourably with the very pricey drinks and food in the hotel bars and restaurants. We did try the Italian restaurant and found it excellent (and we are very familiar with real Italian food) - but expensive. The breakfast is great (we used the lobby cafe rather than the Club lounge), and sets you up well enough for the day that the light evening meal can be sufficient. So the Club price can save a lot of other food and drink expenses.", "title": "Impressed", "helpfulness": 2, "user": "nep1984", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 37213802}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The underground station is a short walk away, and again saves a lot of money. Taxis are not expensive - until they get stuck in the awful traffic - best not to use them for a ride across town - it is a very big town.", "title": "What a weekend!", "user": "su-na11", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36118263}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "I stayed here for a week in March and found the Imperial palace to be quite wonderful - probably the best hotel I've ever stayed in. It's an imposing building with fantastic public areas and a wonderful level of service in all it does. I was a little worried about spending a week here as a result of the mixed reviews on TripAdvisor, but chose it anyway as I was attending an exposition at Coex and some associated events were at this hotel. The \"trick\", I discovered, was to make sure that I was booked into one of the refurbished rooms, which are sumptuous. The older rooms, I understand, are a little worn - but still with much charm (a regular guest told me). The room I had on the 19th floor had all I wanted (and much more): great view out over the city, marble bathrooms, plenty of space and even a fully-automatic toilet with heated seat - a fine if somewhat unnecessary example of Korean technology. There's a huge TV and internet access (in some rates - otherwise it's an expensive addition). The pool in the hotel is lovely, there's a fully equipped gym and excellent spa (plunge pools at different temperatures, two saunas, etc.). The Club Lounge (access included in certain rates) has a generous happy hour - free drinks - meeting rooms and free food, so there's no need to eat elsewhere if you want some peace and quiet. I'm not partial to smoke - hate smoky atmospheres - but didn't find it a problem in the hotel in general, only in the main lobby bar in the evening (fairly expensive) if you happen to sit next to a wannabeseen local who is puffing away. There are three other bars, cafe and various restaurants in the hotel, so plenty of choice. The breakfast is an extensive buffet with huge choice of foods to satisfy all tastes. So all in all a quite lovely hotel and highly recommended. I would love to return.", "title": "World class - wonderful", "helpfulness": 3, "user": "Roskers", "date": "April 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 27484222}, {"rating": 2.0, "title": "renovations and upgrade badly needed", "text": "The Imperial Palace is quite impressive when you first enter the main lobby. However, the most important thing in a hotel is the room and the comfort that it provides to the guest. The hallway of the hotel towards the room are quite narrow. The rooms are ok but carpets have stains and looks old. Under the bed the carpets were never vaccumed. The room is heated and feels stuffy. I had to open my window just to let some fresh air in. The view from my room was a back alley so not much to praise also in that area of the hotel. The bathroom is quite outdated and needs to be upgraded. The shower handles are so loose that when I turned on the shower the handle drops to the bathtub floor. There are also no tissue rolls on the toilet. The room ceiling and wallpapers looks cheap and really needs to be changed. There is a plasma tv which is kinda good and a modern contrast to the room itself. The staff of the hotel were quite nice and can understand english well which is good. I would rate this hotel as 4 star only because the lobby and the decor of the room looks nice. It is sort of like a hotel trying to act and pretend to be a victorian classic but doesn't have the class to go along with it.", "helpfulness": 2, "user": "IceMan_9", "date": "January 2, 2009", "id": 23173077}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "I did not stay in this hotel so I can't comment on the rooms, but I did have breakfast there every morning and used the spa several times a week. The spa is SO incredible! I couldn't get enough of it. When you first check in, there is a small but very nice/professional check-in area. When you enter the locker room, there are slippers, towels, and workout clothes with socks. The lockers themselves look like high end cigar lockers made of solid wood and high end fixtures. The floors are all wood as well. The spa area has several small soaking pools. One cold, medium, and very hot. They also have a \"themed\" pool which changes with daily with theraputic herbs like lavender. Outside, there is a private jacuzzi. In the back, there is a massage area (be careful if you've never tried a Korean massage. It is very intense and I had bruises afterwards), a wet sauna, and dry sauna with a clear glass window and a flat screen tv just outside. The remote is inside and the sound is piped in! There are also plenty of showers and salt scrubs available. It gets better! When you walk into the changing area, there is an amoire with robes and gold vents that have motion sensors and dry you off as you walk past them!!! The dressing area is even more amazing! It's absolutely gorgeous (all wood, gold, porcelain sinks with high end fixtures, etc.) and everything you would possibly need from brushes, hair dryers, European spa products, paper/cotton, etc. Past the dressing area are lounges where you can watch flat screens or a quiet room where you can nap. On top of all this, the upstairs houses the small gym/pool area. They have fresh towels, water infused with ginger or lemon served in glasses, a bronze fountain and knowlwdgeable staff. It was amazing and I loved very minute of it! Just a word of warning though. This is a Roman-style spa so if you are extremely shy about walking around sans clothing or barely covered, it might not be the right place for you. I was the only non-local there. All of the times I went, it was local \"ladies that lunch\" who knew each-other. The staff is extremely helpful and customer service oriented. I felt like royalty.", "title": "The spa is incredible!", "helpfulness": 3, "user": "JetSetOC", "date": "October 21, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 3.0, "location": 4.0, "service": 5.0}, "id": 10196917, "likes": {"liked": "— The Spa!", "disliked": "— The breakfast was the same everyday. When you are going there every morning, it would be nice to have some variety"}}, {"rating": 1.0, "title": "Needs to be imploded", "text": "IP, WOW, Where do I begin. Good location. But everything else about the hotel was a huge disappointment.. You suck in exhaust fumes in the underneath pick-up/drop-off area. As soon as you open the front doors you get barreled by cigarette smoke. Hope you have alot of time to waste because waiting and riding the elevators can take upwards of 20+ mins. We checked into our room and it was utterly disgusting. We could not remove our shoes because the floor was stained so badly. The bathroom had cracked fixtures (lights not working) and the vanity and tub were stained...gross.. Needless to say we checked out of the IP immediately. We are budget travelers and have come to expect cheaper places to be so, so and we are usually OK with that, but the IP was a dump. We recommend spending a little more to stay at a much nicer place, you will be thankful that you did. IP needs to be imploded!!!!!!!!!!!!!!!!!!!!!!", "helpfulness": 6, "user": "shabba28", "date": "September 26, 2007", "id": 10008249}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "This was one of the finest and most memorable experiences I've had in ANY hotel, let alone one in Korea. I went there with my partner and now it'll probably be the only hotel we ever go to in Seoul. The service was top-class, the food was exquisite and the room was picture of comfort. I highly recommend it.", "title": "The Best Of The Best!", "user": "jasonpelham", "date": "July 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35719845}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "Not really a tourist hotel. It's on the outskirts of Seoul's Gangnam biz district and a lengthy subway ride away from the downtown tourist stuff. While it's better suited as a biz hotel, the five star amenities make it a great oasis for tourists who are familiar with Seoul's wonderful subway system.", "title": "Seoul's best kept secret", "helpfulness": 1, "user": "mindme", "date": "June 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 33056209}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "PRO: A non chain hotel that provides the comforts and know-how of five star international chains. Pony up the extra bucks a night and go for the club room floor. With the club floor you get an amazing daily breakfast buffet and a great free dinner (lighter fare) and all you can drink booze. This easily pays for the difference in price. Plus you get all the daily english daily papers free (IHT, FT, KT, KH), private check in on the club floor, free internet, and generally first class treatment.", "title": "Definitely Overrated!!!", "helpfulness": 1, "user": "wazzup1", "date": "June 9, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 31929418}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The hotel is opulently appointed, with a huge lounge area that's great for waiting for friends. The decoration might strike some as a bit over the top in the way \"nouveau riche\" Koreans can't decide between Louis XIV, art deco, greek/classical, or tutor styles and just get everything.", "title": "very elegant", "user": "MaheshKakde", "date": "April 20, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 28431111, "likes": {"liked": "— Italian restaurant", "disliked": "— paid snack bar"}}], "location": {"country": "South Korea", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 12, "average": 39, "very good": 88, "terrible": 14, "excellent": 72}, "aka": "Imperial Palace Seoul", "slim_ranking": 0.247395833333, "description": "Imperial Palace Seoul features luxurious European styling and the latest in technology to offer a comfortable and convenient place to work and rest."}