{"user_rating": 4.0, "review_count": 82, "name": "Incentra Village House", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "Yes, this place is cheaper than most in NYC. But be prepared for what a \"bargain\" you're getting. The towels were threadbare (think high school gym class), the carpet in our room was dirty, and the rest of the furnishings were at best tired, but more often downright decrepit and/or filthy. There wasn't a single chair in our room that I would trust to sit in. To be fair, the shower stall was redone and very clean and the bed was ok. For $160/night I didn't expect a palace, but I did expect better than this.", "title": "Sometimes you just get what you pay for", "helpfulness": 16, "user": "jbullock47", "date": "May 11, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 3459178}, {"rating": 5.0, "title": "In The Stable room", "text": "I had a great stay at Incentra, in \"The Stable\" room, a perfectly wonderful room with a private entrance-- fireplace, double bed, tv, microwave, coffee maker, shower, table, iron, hair dryer, etc etc.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "March 17, 2005", "id": 3282207}, {"rating": 2.0, "title": "Pretty Place, Weird Policy", "text": "...Warm and comfortable; homey... and a great location.", "helpfulness": 21, "user": "mollyd123", "date": "February 23, 2005", "id": 3223805}], "location": {"country": "United States", "city": "New York City"}, "variance": {"poor": 5, "average": 6, "very good": 27, "terrible": 4, "excellent": 40}, "aka": "Incentra Village House Hotel New York City", "slim_ranking": 0.22, "description": "Incentra Village House, an Historic Inn, was built in 1841, and occupies two brick landmark townhouses in New York City's Greenwich Village Historic District. As an attractive alternative to Midtown's steel and glass, the Village House offers our guests a warm welcome in our cozy double Victorian parlor which boasts two fireplaces, antique furnishings and artwork, and a 1930's baby grand piano. All of our guests are welcome to relax in our parlor with our supply of newspapers, magazines, and books. To get to your room you'll wander down narrow halls and up charming old stairways to one of 11 unique rooms."}