{"user_rating": 4.5, "review_count": 2134, "name": "Indigo Pearl", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This is a great hotel. We booked a Plantation Villa which was just lovely. The room was very clean although there wasn't alot of space to store suitcases etc . The hotel is of industrial style and was done throughout the hotel in a trendy but thoughtful way. The hotel adult pools are just fantastic, one has a swim up bar which is really nice and there were of sunbeds so no rush to get to the pool after breakfast. We ate in all the different restaurants, Black Ginger (thai) was very good and reasonably priced, the Rivet Grill (mostly meat menu) was absolutely amazing but abit pricey too! The Tin Mine offer ala carte dining or buffet, both were excellent and reasonably priced. There is also an indoor bar where you can play pool/snooker/watch English footie on tv! this was great for a bit of chill out time / pre-meal drinks. The staff at this hotel are wonderful and are so friendly and helpful. My advice would be to book trips through the hotel concierge not through the Thomsons rep, ours would have sold us anything! The hotel offered better priced and quality deals. Moos Kitchen (cookery course) was a great experience, we learnt alot and really enjoyed it (we chose programme 2 which is 4 hours where you prepare food, cook then eat what you've prepared). I would highly recommend this and it was good value. We booked our Phi Phi Island Hopper trip through the Thomson rep, if you don't like boats it's not for you (an hr between islands, not 10 mins which is how he sold it to us!). That cost about £85 per person, was a full day trip with lovely bbq lunch included. It was a good trip (not to be missed but The Beach was abit disappointing becase it's such a tourist trap there were swarms of people everywhere). I would also recommend Mamamia for food on the beach, it's lovely even if you are reluctant to eat at beach shacks as I was, it was very good quality. Save yourself the taxi fare going to Phuket town though, it's smelly, tatty and you are harrassed the whole time by people trying to sell you stuff. Stay in the fantastic hotel and soak up every minute, we were sad to leave and would return tomorrow if we could.", "title": "Great hotel, eveything we hoped for and more!", "helpfulness": 1, "user": "CatFarrell01", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 90824852}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This is quite an expensive hotel by thailand standards but we did stay in one of the most expensive rooms during the christmas period. Never the less i would recommend this hotel to my friends and family. The food in all the restaurants was of a good standard however The Rivet was a little disappointing considering it was priciest and boasted the best food and reputation. We ate here only once because our food was not of the quality we had expected. We ate at Black Ginger a few times and believe this is the better restaurant on the resort. I would also like to add that the breakfast (which is included in the room price) was truly excellent. The selection of food was huge and covered everything you could possibly want for even the pickiest of people. This hotel is best suited for people who wish to stay on the resort and relax. It is quite isolated and the beach behind the hotel isn't great for thailand.", "title": "Expensive for Thailand but worth it for a fantastic hotel", "helpfulness": 2, "user": "MrBrookAdams", "date": "December 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 90642502}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "A very good holiday resort. Service is attentive and of very high standard. Great choices of F&B outlets. Black Ginger Thai especially nice! A few pools to choose from. All very good, but it is just slightly huge and crowded for my taste. If you don't mind a huge resort with a high occupancy rate, than this is the place. Proximity to airport is also convenient, but do bare in mind trips into Phuket town or anywhere else is a bit far and taxi is quite expensive. Resort do have a paid shuttle service which is good for a group etc. Despite the size of the property, I did feel looked after.", "title": "Too big for me", "helpfulness": 1, "user": "Boeing777", "date": "December 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 90175872}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Pearl Suite room is huge, twice the size of a standard and a huge bathroom outdoor area. Decoration etc throughout the property is very nice and artistic, a lot of metal wood etc, reflecting Phuket tin mining past. Generally very happy with the property, but for the same money you can get peace and intimacy at a smaller top end boutique property.", "title": "Earns the five stars. It's great place to be.", "helpfulness": 1, "user": "CATripAddict", "date": "December 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 90009906}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "Firstly, the Indigo Pearl is about 5 km from the airport, but that doesn't affect your experience. I hardly ever noticed noise from the jets flying, and with it's close proximity you'll find cheaper taxi rates of about 150-200 baht (which is still $$, but all taxi rates are in Phuket are ridiculous).", "title": "A Tale of Two Rooms. Great Stay, IF You Have the Right Room . . .", "helpfulness": 3, "user": "LaurenSFBayArea", "date": "December 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 89886512}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Pre-tsunami, this was Pearl Village (had stayed 4x) which had always been a favorite. Now redeveloped, the hotel is even better & has unique, relaxed ambience with minute attention to detail. Check out web site. We had spacious room (Kelly Quarter) with nice private outlook to pool. No rooms have seaview of beach but it is only 5' stroll to hassle free Nai Yang and low cost seafood restaurants & super sunsets. Staff really great. Housekeeping staff superb (leave them a tip!) Hotel food & sevice excellent. Spa was great hit with ladies. Hotel organises a lot of activities. Free fitness centre & can use their MTB's to bike around National Park . Airport transfer to/from hotel was 200Bht.", "title": "Outstanding hotel - exceeded our expectations", "helpfulness": 4, "user": "Jeremy09", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40534389}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We stayed at Indigo Pearl for 8 nights on our honeymoon! It is very close to the airport - maybe 10 minutes maximum but you do not hear any noise from there. When u come out of the airport, walk to the taxi rank as they have a fixed price service to get you to where u are going.", "title": "Good times at Indigo Pearl", "helpfulness": 4, "user": "chiefsimo", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 40512456}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "We both loved the resort - we stayed in a room that had a plunge pool (private pool pavillion) which was a great way to cool down without the need to go to the big pools!", "title": "Sublime- will be back!", "helpfulness": 1, "user": "DannyJSB", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 39727245}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The resort was only about 70% full when we there so we were very grateful to be let into our room at 10am when we arrived - well before 2pm check in!", "title": "I loved it!", "helpfulness": 3, "user": "starrf1re", "date": "August 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39401100}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We were welcomed with rose petals on the bed, bottle of champagne and small chocolate cake - a nice touch!", "title": "Perfect Affordable Getaway!", "helpfulness": 2, "user": "Hilda77", "date": "August 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 39024913}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Phuket was to last station on our Thailand trip. We wanted to relax and do go somewhere where not everything is about party. The Nai Yang Beach was perfect for that. And so it was the Indigo Pearl. We’ve stayed in a Pearl Bed Suite. These suites are in the upper floor. They are very spacious and have a wonderful balcony with view over the pools. We loved the room from the minute we walked in. The resort itself is really big and you need a map to find your way on the first day. But you have everything what it takes for a restful holiday, even a private beach with private chairs and towels only for hotel guests. The hotel is not directly on the beach, as no hotel is at the Nai Yang beach. But there is only a very little street in between so that is no problem.", "title": "Wonderful hotel in a quiet corner of Phuket", "helpfulness": 1, "user": "blueeye-ch", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89737026}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The breakfast was also amazing. For lunch and dinner we haven’t eaten at the different restaurants of the hotel because there are a lot of fabulous restaurants directly on the beach. The food there is really great and lower priced than in the hotel.", "title": "Fantastic Experience", "user": "jonoandmarji", "date": "December 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89714595}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We loved also the pools of the hotel. There are four of them. And at two kids are not allowed. One has even a pool bar where you can drink your cocktail while sitting in the water. Great, especially during happy hour when you get 50% discount.", "title": "Perfect Honeymoon", "helpfulness": 1, "user": "HannaM24", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89571852}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We really enjoyed the stay at Indigo Pearl but we think that it is not a 5-Star-Hotel as advertised on their website. It is rather a 4-Star-Hotel. But anyway it is still a wonderful resort and we would recommend it to everyone how is looking for something in a quiet location. We absolutely loved the place", "title": "Honest - I am not a grumpy old man!...Ok - maybe just a little.", "helpfulness": 2, "user": "Mark-choosy-chappy", "date": "December 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 89240637}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed at IP for 10 nights in July this year and had a wonderfull time. A very funky industrial design, lowset in a nice leafy setting. We chose IP as it had been recommended as a quiet, relaxed resort well away from the hustle and sleaze of Patong. This was the case and we were very glad we listened! Beach is ok but this was the rainy season. Resort food very good especially breakfast but we ate most nights at one of the beach restaurants (just tables and chairs on the beach) which were very good and cheap . Kids had a great time, pool, kids club other activities etc.", "title": "Wow! This hotel swept us off our feet...!", "helpfulness": 1, "user": "Jopy", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89181330}, {"rating": 5.0, "title": "Luxurious property, but ...", "text": "Pros", "user": "kceesse", "date": "January 9, 2011", "id": 92290608}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "- Extremely close to the airport (like 5 min drive), and that means I can check out less than 90 min prior to flight arrival", "title": "Indigo Pearl – More a Gold Mine than Tin Mine", "user": "Shormons", "date": "January 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91945400}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "- Hospitable service throughout", "title": "INCREDIBLE! FAULTLESS & FLAWLESS", "user": "AIKNA", "date": "January 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91809674}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "- Dedicated beach area with beach attendants that would lay out towels and ice water service", "title": "Good, but not outstanding.", "user": "Jagooah", "date": "January 4, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 91650958}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "- Security is evident throughout, at hotel entrance from beach/main entrance and even a security office close to the dive center", "title": "My experience in Indigo Pearl was only 5* because of such a great experience in the Scuba Diving Center: Paradise Diving", "user": "Al_Kav", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91070801}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "What a magnificent find; unfortunately at the end of our holiday. We stayed at 3 fivestar resort and this was the best by a mile.", "title": "Just the best.", "helpfulness": 2, "user": "afclark", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125000291}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "If you want a magical Phuket holiday this is the place to stay. It's all about \"relax and enjoy\". For example there is no \"Business Centre\" rather a magnicient Library. Same facilities of free Internet, books and beautiful lounges in air-conditioned comfort but the emphasis is on relaxing; forget business.", "title": "A truly amazing experience", "helpfulness": 2, "user": "Jesper C", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124948746}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Lovely obliging staff, beautiful pools, fabulous restaurants, magnificent grounds, out of this world beach facility and its signature Spa facility.", "title": "An Adaman Pearl :)", "user": "Jo L", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124944641}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I dare anyone to say they had a less than perfect stay. Give it a go; you won't be sorry.", "title": "What a hidden gem", "helpfulness": 1, "user": "DJW63", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124836693}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was my second stay at the Indigo Pearl. The first stay was great and I knew I would come back. I returned a year later and was even more impressed this time.", "title": "Good stay, modern resort", "helpfulness": 3, "user": "rob2002", "date": "February 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124834134}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "We had a group of 10 staying at the Indigo Pearl for my birthday. The entire hotel had been designed with the tin mining history in mind with funky metal artwork and a hark back to Thailand's little known industrial history. They had clearly taken the time to think through the design of both the rooms and all common areas and the hotel looked great. We did find it a little hard to navigate through all the different building blocks and the seemingly random room numbering. Some better signage wouldn't go astray. Nai Yang itself is about 5 mins drive from the airport, which is convenient. Although it is about 40 mins from the Phuket markets, elephants and Patong. This wasn't a problem for us though as we wanted to relax by the pool for most of our trip. It also made the trip to the airport stress free, and cheap at only 200 baht. There were plenty of restaurants and some shops/ massage places/ tailors (we recommend Williams) by the beach.", "title": "Perfect Birthday stay at Indigo Pearl", "helpfulness": 2, "user": "Rachel_Whales", "date": "February 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125279931}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Our room was very spacious with a very comfortable, but slightly too short, bed. The mattress topper was ideal and it felt like sleeping on a cloud! We also had a separate room for our cases and safe which was a nice touch. We had an issue with our tv where it kept turning off and they replaced it immediately. The bathroom had a big bathtub, huge shower with two shower heads, separate toilet and double sink - with the same funky design that was seen throughout the hotel. My only complaints would be the lack of hot water at times (shaving with cold water at 6am before a boat trip is not much fun) and the use of curtains instead of doors in the bathroom and toilet.", "title": "Lovely place, great staff", "user": "Lyn&MarkfromOz", "date": "February 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125265962}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "We loved the adult pool with pool bar, it is part of the reason we chose this hotel. The larger kids pool looked great but there were quite a few kids playing so the quieter adult pools were ideal. I have to say that the cocktails seemed hit and miss and were mostly full of ice so a little disappointing.", "title": "Unique Experience", "user": "Byron_DAF", "date": "February 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125224986}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We tried several of the hotel restaurants. Tongha Syndicate was quite casual with a pool table and great simple food. The room service was great, I accidentally ordered the wrong thing (spicy fried rice instead of normal) and they replaced it for free and apologised - even though I'd just ordered the wrong thing. Our favourite from the pool bar was the hot chips, we ate them almost every day! Breakfast was a really well made buffet. Friendly staff seated us each day and on offer was a wide range of thai food, including pork buns, cereals, breads, pastries, hot breakfast including eggs and made to order ommelette and pancakes/ waffles cooked fresh each 1/2 hour or so. The tea was a little overbrewed but you could purchase freshly made tea or coffee if you preferred. All 10 of us ate at their beach restaurant, Cotomer, for my birthday dinner, and they made an effort to ensure we were all catered to and even brought me a birthday cake. We dined at Black ginger on our last nigth there and it was a stand out. The moat to take you there is quite cool, staff very friendly and the food was fantastic. Overall the restaurants, apart from Black Ginger, didn't have that many vege options but otherwise the choice was good.", "title": "Favorite resort", "user": "linwes", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125222867}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "All staff here were all incredibly friendly and eager to please. When we gave advanced notice they were fantastic at organising vegetarian food for two of our guests, after some problems with that on the first night. They also booked us taxis several times without any issues. We had a little trouble communicating at times but staff remained friendly and there was a French concierge on hand which also helped.", "title": "Great resort, but not perfect", "helpfulness": 2, "user": "Mitch M", "date": "February 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 125211271}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We stayed at the Indigo Pearl Hotel between November 14th and November 22nd. We booked a Pearl Bedroom however upon arrival as it was our honeymoon they upgraded us to a private pool pavilion (room with own pool). This was a great surprise. We also got complimentary bottle of wine and chocolates.", "title": "Great Hotel and Great Service", "helpfulness": 2, "user": "NSCB", "date": "December 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89144055}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Upon arrival to the hotel they give you a cool drink with a wet towel to refreshen while they complete check in. The hotel has free WIFI available at the lobby and the TIN MINE but not in the rooms. They also have a computer room with 4 computers and printers available at all times.", "title": "Great Hotel in good location", "helpfulness": 1, "user": "1Bassett1", "date": "December 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 89084788}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Our room was cleaned daily and the inroom Pool was cleaned daily. The staff at this hotel are very helfpul and the service was great.", "title": "Gorgeous place nad excellent service", "user": "LizHinlein", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88882602}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This hotel is about 45mins from Patong. The hotel has a shuttle bus service to Patong daily either one way or return. One way to Patong was 300bhats per person. This is cheaper than the TAXI which costs 800bhats for a one way trip.", "title": "Exotic pleasure", "user": "stevovo", "date": "December 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 88724162}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Breakfast at the hotels restaurant the TIN MINE was good. A good choice of food available each morning and the service was great. We also ate at the TIN MINE on a few nights when they had a THAI buffet and Spanish Tapas night. Clearly eating in at a 5* hotel is not as cheap as eating from the street vendors just outside the hotel however from previous reviews we read that the hotel restaurants were a must. We also ate at the BLACK GINGER and RIVET GRILL in the hotel. Both were great. BLACK GINGER specializes in Thai food and RIVET GRILL was more western GRILL food.", "title": "Exceptional Resort", "helpfulness": 1, "user": "uksunLV", "date": "November 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88664911}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "We stayed at Indigo Pearl one week in February 2012 as part of a trip to Thailand. We had read the reviews on Indigo Pearl and were really looking forward to the visit, however our experience was mixed.", "title": "Nice hotel - shame about the beach", "helpfulness": 2, "user": "MalmCopenhagen", "date": "February 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 124826140}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The room (which we got and upgrade on was perfect, we had a beautiful view of the infinity pool which reminded us of a jungle, the pool was an adults only which meant no screaming children running around – nice! The room was fantastic, the bathroom huge and the balcony with both a tub and lounge.", "title": "a bit different", "user": "ken D", "date": "February 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124766104}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Having just stayed at Aleenta (Small Boutique Hotel) further up the cost, Indigo Pearl was very big and the service was not too great. However the biggest disappointment was the beach – there is not private beach at Indigo Pearl! There is a beach club – but, this is definitely not a 5 star beach. The sun loungers are lined up side by side, with less than 1 meter apart. The service is virtually non-existent, you have to walk to the bar if you want to order anything to drink as the staff does not “cruise” the beach to check if they can help with anything. A tip – when you have to go the bar your self, you might as well walk across the street to the minimarket and get your drink for one tenth of the price….", "title": "Mixed feelings", "user": "Noora H", "date": "February 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124704031}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We did not eat at the resort except for the breakfast as there are so many restaurants at the beach – here we recommend you to choose the restaurants to the left as you leave the “gate” from Indigo – Savoey and the seafood restaurant next door are really good and cheap. The bar above the grill restaurant inside the resort is really nice for drinks or coffees – and if you get lucky there will be live music, which gave the place a little NY feel….", "title": "Beautiful Pearl", "helpfulness": 3, "user": "FIN77", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124700920}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The Indigo is a nice hotel – but the beach does not live up to the stars.", "title": "Fourteen nights at a fantastic hotel!", "user": "421KennethL", "date": "February 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124671106}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Stayed at Indigo Pearl Aug - Sept 2008 for 9 nights as a result of reviews in Trip Advisor. Was not disappointed. A 5 Star resort.. We had a Kelly Rooms which was ample space. The pool and gardens could not be faulted. The staff were always obliging especially after a small tip ensured our room was cleaned early :)", "title": "A real pearl", "helpfulness": 3, "user": "terryau", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 45463678}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We ate at resort as well as the 'strip' outside the resort. Resorted prices were dear but it is a 5 star resort and prices to be expected.", "title": "Highly Recommended", "helpfulness": 1, "user": "Cyn1007", "date": "September 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 45221937}, {"rating": 5.0, "title": "lovely", "text": "Hi,", "helpfulness": 3, "user": "jessjessT", "date": "September 28, 2009", "id": 45219379}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "If you are looking for a getaway at a resort that has great service, details to the design of the place and lovely rooms then this is the place. I spent 4 days at the resort and enjoyed every minute of it.", "title": "Designed...Paradise!!", "helpfulness": 3, "user": "crocodile044", "date": "September 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 44823483}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "With 3 pools, good F&B options and a great bar for drinks at sunset, my bf and i could not have had a better place for our holiday.", "title": "Peaceful", "helpfulness": 1, "user": "garden37", "date": "September 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 4.0}, "id": 44015948}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My husband and I just returned from a week's stay at the Indigo Pearl. What an amazing find! We chose the hotel based on reviews from this website and were not disappointed. As stated by many, the attention to detail was amazing! The staff and service were friendly and always willing to help! The bed was SO COMFORTABLE! We had one of the rooms with an outdoor bathtub which was big enough for two and perfect for a long cool soak after being in the sun all day! The hotel has 3 amazing pools-- one with a swim up bar and no kids allowed. The grounds were well kept and so green! We had the breakfast buffet each day which was delicious with choices that would please everyone. We also ate poolside a couple of times (yummy), Black Ginger once (it was so-so), and tapas at Rebar one night-- delicious! The hotel bar ran a great happy hour (6 pm to midnight). The gym facilities were fantastic...especially for being free!", "title": "What a gem!", "helpfulness": 1, "user": "nicks1980", "date": "September 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 43205266}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "Everything was just so clean, welcoming, and relaxing! They did have a room with 4 computers with free internet, and free wi-fi in the lobby area. I wish they would extend that to the rooms. My only complain about the room was that there were not enough hooks in the bathroom to hang up wet swimsuits and towels. We booked our room on the hotel's website and they had some really nice specials for the off season. We booked the Simply Exhale package... airport transfer, free shuttle to Phuket town and Patong Beach each day, 20% off food & beverages at the hotel, one free meal at Black Ginger, and breakfast buffet included for two people. The room was also about 1/2 the price of high season. The hotel did maintain a small beach area which was nice and had their own restroom facilites. I would definitely recommend this hotel to a friend and would stay there again if I were to go back to Phuket.", "title": "A unique resort set in tranquil surrounds with tantalising food!", "helpfulness": 2, "user": "Dooney23", "date": "September 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 42612106}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "The Indigo Pearl was an outstanding resort. If you are undecided about where to stay, you must choose the Indigo Pearl. I stayed here with my Mum for a girls trip and we indulged in delicious food (Black Ginger - amazing! and Tapas Bar, brilliant! Also room service food was superior quality), relaxed and swam by all of the pools. The attention to detail at the resort is insane. From the cutlery, to the tissue holders in the bathroom. Every thing has been considered. Beautiful rooms, balcony with views, comfortable chairs through out. Not to mention the funky looking library, free internet, day spa. I visited a year ago and have not stopped telling people how amazing this place and the staff were. Outstanding.", "title": "AMAZING", "helpfulness": 2, "user": "BA1st", "date": "September 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 42404719}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "This is the best Hotel I’ve ever stayed at.", "title": "Amazing", "helpfulness": 5, "user": "sah79", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41316665}, {"rating": 5.0, "title": "Fantastic Resort, you wont want to leave...", "text": "We loved it soo much so that we went back two years later with our friends and hired one of the suite!", "helpfulness": 4, "user": "Andrew D", "date": "September 10, 2009", "id": 40599848}, {"rating": 2.0, "stay_parameters": "Stayed February 2012", "text": "My first impression of the reception was utter shock am I really in a 5*star resort or a backpackers lodge its one big mess and stuffy, then u sit and wait for attendance they take our passports and get all the information wrong on the form. The staff just look tired and worn out nothing chic about this resort. She takes us to our pavillion room in the K block the grounds are worn out and tired I think they should get a landscape consultant to zen the garden it just looks dry and lacks the thai feeling. We put a dnd sign on the door and at 8 the maid service decide to clean the room. I've stayed in so many 5* and diamond hotels and boutiques indigo pearl is just a middle class resort isolated. I wouldn't recommend this resort to anyone who is well travelled and likes the finer things in life.", "title": "Awfull resort", "helpfulness": 3, "user": "rawahi83", "date": "February 24, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 2.0}, "id": 125162654}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Our family of 2 adults and 2 children age 3 and 10, stayed in a D-Buk Family suite. The tin mine concept was very unique but very well done, and we liked the suite very much, Plenty of room and a large king size bed plus a large bed that did very easily accomodate 2 children. Only complain about the room was the view from the room or rather lack of. The terrace was sort of a small concrete tunnel and not really a place you wanted to spent time, but there were plenty of other nice places to be, so it was not a problem.", "title": "Excellent", "helpfulness": 1, "user": "Bo_Alyce", "date": "February 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125142910}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "There are many couples at the hotel but the main pool which was open for children was excellent and there were very few people there, so we enjoyed very much to swim and play with the children. There were toys to play with, and the staff came with ice water and icecream. In one end of the pool there was a large tree giving shade but the childrens pool was in full sun. Some shade on the childrens pool would have been good.", "title": "Quality Resort", "helpfulness": 3, "user": "Nathan Z", "date": "February 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 125115986}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The staff was very friendly.", "title": "Excellent!", "user": "NAJLHR", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125052254}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "The hotel is only 10 min from the airport but there is no noice from the planes.", "title": "Beautiful, romantic and relaxing!!", "user": "ChloeMWilliams", "date": "February 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 125029176}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We found this resort on the internet and only stayed one night on our way home. What a fantastic resort hidden away .We will be staying at this resort next year while in phuket. A great job done by all staff.", "title": "fantastic resort great service highly recomend", "helpfulness": 1, "user": "rodsith", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38935327}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Word of Advice.", "title": "A holiday worth waiting for.", "helpfulness": 3, "user": "LavvyKing", "date": "August 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38931829}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "If you like the website,you'll luuuuuuv the hotel.", "title": "A beautiful resort and great holiday", "helpfulness": 2, "user": "seemoreMelbourne", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 38830564}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Can't praise the Indigo Pearl highly enough on nearly every count.", "title": "Really not a 5 stars... extremely overated", "helpfulness": 3, "user": "MaxSing", "date": "August 25, 2009", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 38760709}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We had been advised(by a friend with lots of Phuket experience) that the location wasn't great but it was perfect for the type of holiday that we wanted.", "title": "Paradise!!!", "helpfulness": 1, "user": "BettySydney", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38706708}], "location": {"country": "Thailand", "continent": "Asia", "city": "Nai Yang"}, "stars": 5, "variance": {"poor": 47, "average": 136, "very good": 448, "terrible": 34, "excellent": 1469}, "aka": "Indigo Pearl Nai Yang", "slim_ranking": 0.2, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Style and distinction - Historic detail fuses with chic industrial elegance. A 5 Star Luxury Design Resort touching Nai Yang Beach, Phuket. The Indigo Pearl resort experience is an encounter with Phuket's collective imagination - a gathering of intriguing details, re-envisioned through imaginative design. Architecture inspired by Phuket's tin mining past. The hotel decor evokes a Thai factory of a century ago. A landscape overflowing with surprises: the postmodern transformation of a mature plantation, spiced with modern sculpture and found industrial art. Luxury, comfort and service surpasses expectations."}