{"user_rating": 4.0, "review_count": 227, "name": "Infanta Isabel Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "We had a very spacious room in this historic hotel located on the main plaza of Segovia. Bathroom and AC worked fine. One negative was absence of a room safe. Our one-night stay was unexpectedly was timed with the celebration of summer solstice so we enjoyed the various performances which went on until 4:30 AM.", "title": "Infanta Isabel during summer solstice", "user": "beekay458", "date": "July 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 3.0, "cleanliness": 5.0, "rooms": 3.0, "location": 5.0}, "id": 8103505, "likes": {"liked": "— location", "disliked": "— bathroom was step up from room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "When in Segovia, go with the festival!", "title": "Very Nice Historic Hotel in Plaza Mayor", "helpfulness": 1, "user": "AJFlorida", "date": "July 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8069361, "likes": {"liked": "— Location, Rooms, Dining options close by", "disliked": "— Get a back room if you wan't to sleep early"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "If you are going to Segovia, this is the hotel to stay at. It is clean, comfortable, right on the main plaza and next to the best dining Segovia has to offer. Cathedral is 1 min walk away, Alcazar is a 5 min. walk and Roman Aqueducts about 8 min walk. Tapas bars are present all around and the main shopping drag that starts next to the hotel.", "title": "We fell in love!", "helpfulness": 4, "user": "grant_lina", "date": "June 12, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7837770, "likes": {"liked": "— Great view over the square", "disliked": "— Access was initially difficult with a rental car"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The rooms are spacious, bright and cheery and with balconies opening into Plaza Mayor. Beds are comfortable with down comforters and the bathroom is clean. You don't get much on TV but that was OK with us.", "title": "Hotel Infanta Isabel a Winner", "helpfulness": 1, "user": "amsdon", "date": "June 7, 2007", "detail_rating": {"front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 7803655, "likes": {"liked": "— Location & Charm", "disliked": "— Access to auto."}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "They offer an inexpensive valet parking service and good breakfast right on the Plaza or you can pick up a coffee and pastry from 2 bakeries within 20 feet of the hotel.", "title": "All about location", "user": "Algood", "date": "April 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7428451, "likes": {"liked": "— Location", "disliked": "— Noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "26th December 2006 – 28th December 2006", "title": "Great location", "user": "harveywalker", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6815291, "likes": {"liked": "— Location", "disliked": "— Tired looking bathroom suite, but very clean"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Superb location, and although we had a room over looking the side street, very quiet. The bathroom was the only slight let down, as it could have done with being modernised, and looked a bit tired. Although my wife was very happy about filling it, full of bath salts and wallowing for a few hours.", "title": "Perfect", "helpfulness": 10, "user": "Douglas B", "date": "May 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 5207876}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "We did not have breakfast in the hotel, but a café near the pastry shop (great cakes!) served coffee or a decent cup of tea with freshly squeezed orange juice and a croissant for 2 euros each.", "title": "Great location, large room, good price", "helpfulness": 6, "user": "lgalvin", "date": "February 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4469506}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Absolutely charming !", "title": "Undoubtedly a great little hotel, superb location and reasonable price", "helpfulness": 8, "user": "Rockhampton", "date": "February 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4455877}, {"rating": 4.0, "title": "lovely", "text": "This hotel is in the perfect location for your visit to Segovia – on the Plaza Mayor and across from the Cathedral. Our room [407] overlooked the plaza and was the most spacious of the 6 hotels we stayed at during our 3-week visit to Spain. The front desk staff was helpful and the on-site restaurant would be a good choice for dinner. For morning coffee, the Limón y Menta Pasteleria is right across the street.", "helpfulness": 6, "user": "janisc", "date": "October 17, 2005", "id": 4028187}, {"rating": 5.0, "title": "Great Hotel....Great Views", "text": "This is a charming small boutique hotel that we fell in love with. It's on the old town square with fantastic views of the cathedral and within walking distance of all Segovia's historical sites. The rooms are nice size. Our room faced the square and was very quite due to the double pane balcony doors. The desk staff were always friendly and helpfull and spoke english. They took care of parking your car and bringing it to you when you needed it. The room was very comfortalbe and there was always good water pressure and plenty of hot water. We wouuld certainly stay at this hotel again if ever in Segovia.", "helpfulness": 9, "user": "tbirdjoy", "date": "October 2, 2005", "id": 3983772}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "Unfortunately, we spent only one night is this beautiful little hotel. Our room was very spacious, very clean, and wonderfully decorated. The remote control air-conditioning was very convenient, once we figured out how it worked.", "title": "Wonderful old hotel, beautiful views", "helpfulness": 5, "user": "ohnctx", "date": "August 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3801889}], "location": {"country": "Spain", "region": "Castile and Leon", "continent": "Europe"}, "stars": 3, "variance": {"poor": 8, "average": 26, "very good": 90, "terrible": 5, "excellent": 98}, "aka": "Infanta Isabel Segovia", "slim_ranking": 0.185185185185, "description": "The Infanta Isabel Hotel is a unique and comfortable hotel in Segovia, located in the Plaza Mayor, only a ten minute walk from the bus stop and a 15 minute drive from the AVE train station. With a meticulous and elegant decoration, the Infanta Isabel Hotel has 37 fully equipped rooms and is perfect for holidays or business trips, since it has two fully equipped function rooms. Our hotel in Segovia has free WiFi internet throughout the building. The Hotel has 37 spacious rooms, completely equipped and decorated in a late 19th century style. Most of the rooms at our hotel in Segovia have balconies overlooking the main square, where you’ll have views of the Segovia Cathedral and the Town Hall.The function rooms at the Infanta Isabel Hotel are the ideal spaces to organise any kind of event in Segovia. Our two elegant rooms have a capacity for an event with a maximum of 70 people. Both have free WiFi internet, as well as the usual services offered by our hotel in the centre of Segovia.The Hotel also offers the Casares Restaurant. Its cosy areas are perfect to enjoy a magnificent, traditional but elaborate meal from the wide variety of dishes served at our hotel in Segovia."}