{"user_rating": 4.5, "review_count": 839, "name": "Infinity Bay Spa and Beach Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We loved our stay at IB. It was perfect for lounging at the pool or swimming in the ocean. You could snorkel right from the beach and see tons of underwater wildlife. Carlos is the best bartender and was always pleasant. The food was really good here too. The only thing that could have made it better was if they had better coffee. I stayed at Fosters two years ago and there is no comparison. IB is the best place in West Bay to stay.", "title": "Best Place to Stay in West Bay", "user": "LizzChicago", "date": "February 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97186534}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I think of all the hotels I saw in West Bay Beach, Infinity was the most beautiful and luxurious.", "title": "The best Resort in the best beach", "user": "PaulMatthew", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 97119963}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "After visiting, I created a Map of the West Bay Beach, so people can see where exactly is each resort and restaurant located. For some reason, tripadvisor does not let ad links to just write RoatanWestBay and add a .com at the end.", "title": "Best Accomodations in West Bay", "helpfulness": 3, "user": "Sparkykittycat", "date": "February 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 96377983}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Stayed at Infinity Bay January 31st – February 7th. We rented directly through an owner rather than through the rental office at Infinity Bay. We saved about $1000 for the week doing this. There are no accommodations in West Bay that can touch Infinity Bay (IB). Lovely property. The food at La Palapa which is their beach bar/restaurant was very good and very reasonably priced. We got groceries for the week at the Plaza Mar grocery store in Coxen Hole which had an excellent variety but was a little on the dumpy side. The grocery stores in French Harbour are nicer but they aren’t convenient to go to from the airport. There is a variety store which is just a few minutes walk away from IB but keep in mind that it does close at 5pm everyday and is not open on Sundays. The sweetest person at IB is Emmanuel…you will meet him at the towel hut…he takes great pride in his job and many times will even get your towel set up for you and angle your beach chaise just the way you want it. A real super star. George a server at the restaurant and Carlos who is a bartender were great. There was another girl that was really nice at the beach bar as well but I forget her name. There were a few girls working at the beach bar that had a bit of an attitude but we just ignored them and got our favorites to wait on us. If you rent directly through an owner you will receive housekeeping service every 3 days when they will come and clean, give you new sheets, towels, etc however you can request clean towels whenever you need them. You get your beach towels at the towel hut by the beach. You are provided with bare bones things in the condo…just handsoap, one roll of paper towels, one pack of coffee. So if you stop to get groceries on the way to IB keep in mind that you need to buy dishsoap, laundry soap, dishwasher soap, etc…these things are not provided (or stash them in your luggage). I bought a lot of dry light things in my suitcase, coffee, tea, Kleenex (no kleenex will be provided…just toilet paper), crackers, munchies, a couple of rolls of paper towels etc. Our condo only had two dishtowels in it so the extra paper towels came in handy. You may want to consider bringing a small travel reading lamp if anyone is stuck on the pull out couch in the living room as my friend was …it was hard for her to read before bed in there as the lighting wasn't the greatest at night. Our condo only had one lamp and it was in the bedroom. Also a makeup mirror or hand held mirror might be handy. Just one mirror in the bathroom. Some owners probably will have added things to their condo…like makeup mirrors not sure. I was glad I brought a mirror with me as it was helpful for taking my contact lenses out and other “primping” rituals. Last year we had toured through a condo and the queen pull out mattress in the couch was significantly better ( like 300 % better) than the mattress on the pull out couch in our condo…perhaps owners have a choice of what quality they want to put into the pull out couch??? There were always security people on site and we felt extremely safe and secure there. Anyone who has been there knows that the beach in front is primo and the snorkeling is right there…just swim in and 30 seconds you are on a great reef. You really can’t go wrong staying at Infinity Bay. Would highly recommend this as the best accommodations in West Bay. Every time I walked from our unit to the beach I couldn’t believe the beautiful turquoise colours of the ocean. I was thinking that it wasn’t LIKE a corona commercial…it WAS a corona commercial. Oh and the trip to Cayos Cochinos is a rip off…it is $150 per person and an all day affair…we almost went but then we asked a local person and he said it was BS.He said the snorkeling isn't that great there as lots of rivers drain into the ocean off the coast of Honduras and Cayos Cochinos is very close to the mainland so he said it wasn’t really that great for snorkeling there…so be forewarned…it is a lot of money to spend when West Bay is nicer for snorkeling. Like a lot of Caribbean/Mexico destinations you will be safe and have an \"event\" free holiday if you stick to where there are tourists/other people around…but as anywhere things happen in Roatan too…so use due diligence and don’t be gallivanting off into remote areas by yourself (safety in numbers)…you might have been able to do that in Roatan years ago BUT you can’t do it now. Sign of the times. No matter where you stay please buy add dog food and cat food to your grocery list and buy a couple of bags and feed some of the animals that look starving...especially if you see any outside of West Bay or other places that you might be touring through (i.e. Coxen Hole) . There are some ex-pats on the island doing some good work with the cats and dogs and trying to help them, setting up neutering/spay clinics etc...but if you run into any strays in your travels they will probably appreciate a huge meal just to help them survive another day. Breaks my heart...when we were waiting outside the airport enjoying the extra sunshine when our flight home was delayed I bought 4 hotdogs and 2 chicken wraps for a dog that was at the airport...she was gentle and I could see in her eyes that she was saying thank you...I know that she appreciated the food...when you are there...don't just feel sorry for them and turn a blind eye....please go get some food for them!!!!", "title": "Nice hotel", "user": "bphawk64", "date": "February 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 95432890}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Stayed at Infinity in a 1BR condo I rented from a private owner. The room was exceptionally nice for the price I paid. Very comfortable, very nice amenities and overall beautiful room. The hotel grounds were beautiful and the pool was spectactular. The hotel really is a pretty hotel and very well kept. Nice location at the end of the beach area and very close to the reef.", "title": "Icing Sugar Sand :)", "helpfulness": 2, "user": "PhotoPhyl", "date": "February 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95236628}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "We are divers and have been to a lot of caribbean islands over the past 15 years. This place is the best. Diving and snorkeling right off of the front of resort beach are great - super clear water, reefs, shallow at first with wall further out. Can't ask for better.", "title": "Awesome", "helpfulness": 2, "user": "GMB43", "date": "January 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92018265}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Resort is not finished so if you are looking for the 4 Seasons restaurant, spa and exercise room you will have to wait 12 months or so or go to another island. But for diving, snorkeling, pool, friendliness, lack of crowds, beach, price, weather, water temp and rooms, this place cannot be beat. Resort even has good WiFi and internet with US cable channels - so email and communication are easy. It felt very safe with our two kids running around (ages 10 and 12). Town is a 10 minute boat ride away and very cool with dirt roads and good restaurants.", "title": "Great location Great food, but what about a smile", "helpfulness": 1, "user": "hhc10", "date": "January 3, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 91629241}, {"rating": 5.0, "title": "Best location on the island, wonderful service!", "text": "Only thing that was sketchy was main town that you drive through from airport - but we did not ever go there and walk around. No need to leave West End and West Bay.", "user": "roatanismy2ndhome", "date": "December 21, 2010", "id": 90414008}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "From the minute we got off the plane to arriving at our room we heard great things about this hotel. We stayed for a week and loved the location, the pool area, the food and especially the monkey lala's. The rooms were clean, the bed huge, a full kitchen were all great. But dont expect the waiters at the restaurant to be either efficient or smile, that was clearly not part of their agenda and rather disappointing considering the amazing location. I would recommend this hotel and I hope to return.", "title": "Perfect", "user": "lyndseymaree", "date": "December 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 90408059}, {"rating": 5.0, "title": "This is......\"The Best of the Best\"", "text": "Infinity Bay delivers! It is absolutely the most beautiful beach in Roatan. Snorkeling the reef right off the beach is like diving into an aquarium. Location, location, location. Everything needed is within walking distance. The water taxi is right on location which will bring you to another hot spot on the island, West End.", "user": "A TripAdvisor user", "date": "December 8, 2010", "id": 89366354}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "So, we decided to goto Roatan and look at property based on House Hunters International. Not knowing where to turn as far as where to stay I did the google search and trip advisor search and found Infinity Bay and boy amI glad I did!! AMAZING!!!", "title": "An awesome place with great people", "helpfulness": 2, "user": "momofrose", "date": "January 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94284648}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We had a one bedroom ocean front beach villa. All was top notch! They arec ontinuing develop the property so there is a bit of construction noise and activity - but to me that was exciting. West Bay is a primo l ocation on the best beach on the island - snorkleing is amazing! - water taxi's to Wst End (for local culture,shopping and bars) are awesome. - Walking aloing the beach of West Bay to all ofhter hotels and restaurants is so cool.", "title": "Best resort on the island", "helpfulness": 3, "user": "VanTravellers", "date": "January 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93837456}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "The food and drinks at Infinity arequite reasonable and quite tasty.", "title": "Once again a great stay @ Infinity", "user": "NOLITOUR", "date": "January 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93746655}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Any \"issues\" we had were quickly resolved.. but by \"quickly\" I mean island quick NOT USA quick.,..two very different things.", "title": "CLOSE BUT NO GIGAR", "user": "OhioGmaColumbus", "date": "January 10, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 92471549}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We did wind up buying a villa on Roatan and I have to say had our stay at Infinity not been stellar we would have been turned off to the island to invest. I would highly recommend this hotel/condo..you will not be disappointed!", "title": "poor service all around coupled with non-working plumbing", "helpfulness": 4, "user": "kvinings", "date": "January 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 92114445}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "I was going to be selfish and keep this from others but it wouldn't be fair to the wonderful people of Roatan. We are world travellers seeking the sun and snorkeling, along with good people and food. We found it all at the Infinity Bay Resort. Every vacation is what you make it, here if you're looking for stress free, you'll find it no problem.", "title": "Stress Free, Pure Pleasure", "user": "stewandbev", "date": "December 8, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 89364784}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "My husband and I just got back from Roatan and truly enjoyed our one week stay at Infinity Bay. They do not have a spa yet, but that doesn't matter since there are options within walking distance from the hotel. This place is great. They offer free use of their snorkel gear and with a unbelievable coral reef about 25 meters off shore, I only went scuba diving once (through Bananarama Hotel a short walk down the beach). You can see beautiful tropical fish that swarm around you, moray eel and even turtles (lots of people saw them while snorkeling but I only saw one while diving). They also have a $3 water taxi to West End which is great so you can see that part of the island and go to other restaurants, try Tong's Thai Restaurant it's amazing. The food is actually quite good at the hotel, but there are less expensive options down the beach, also try Bite on the Beach. The pool is great with a swim up bar. We met quite a few of the owners and they were all super nice. The only advise I can give is bring lots of bug spray and put it on liberally, all over your body, no joke, any spot without bug spray will get bit. It'll save you from itching. I would definitely come back to this great hotel and island.", "title": "Great hotel with an amazing reef", "helpfulness": 1, "user": "travelalot68", "date": "December 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 89087139}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "My husband and I spent 4 nights at Infinity Bay before we left to spend another 4 nights at Palmetto Bay Plantation. We wanted a variety of hotels and we definitely got that. IB is gorgeous. The people were great. Carlos, Freddy, and Kevin gave us great service, always happy and smiling. The room was nice, super clean but we didn't spend much time there because the snorkeling was amazing. We brought our own gear and would just walk out from in front of the hotel and snorkel for hours. We saw starfish, turtles, rays, barracudas, and at least 15 different kinds of fish. The fish swam with us and it was absolutely gorgeous. We met Captain Brooks on the beach and he took us deep sea fishing and snorkeling....caught 4 tuna, one was 15 pounds and we all shared it with the kitchen staff at Palmetto Bay. DELICIOUS! We took a water taxi from IB to West End ($3 per person) and ate baleadas ($2 each) at Chapi Catrachas. Delicious local food. Vintage Pearl is a great restaurant, excellent food, wine and service from Christine. We rented a motorcycle from Murray at Captain Van's for the whole week so we could tour the island. The roads are fine, but you do need to watch for potholes, spped bumps, and the occasional stray dog that will wander across the road. The cruise ships are there on Tues, Wed, Thurs, and Fri. That was the only drawback to IB. We had Sunday and Monday quiet and to ourselves, then the waves of people and children came in. Most of them did not snorkel though, so that was nice. They did however put up a big blow-up slide and trampoline for the kids just to the left of the hotel. It was a little annoying if you are not a kid person, plus it blocked the beautiful view. Lots of beach vendors, but they are really nice and not pushy at all. In general, we had a GREAT time, check-in, check-out was smooth and easy and Infinity Bay is a really nice place to go and we would definitely return. ENJOY!", "title": "Perfect Weather, AMAZING beach, Wonderful People", "user": "JLB01", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88764098}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "5 of us stayed at the Infinity Bay resort over Thanksgiving week spending from sat to Sat at the Resort.", "title": "A very perfect stay", "user": "Dijobi", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88587651}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The room was all and more than described on their web site. We had the 3 Bdr Pent house and it had all the amenities we could want. Plenty room, excellent furnishing and just the greatest view.", "title": "Best in West Bay-Perhaps all of Roatan", "helpfulness": 2, "user": "MoparMan52", "date": "November 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 87068694}], "location": {"country": "Honduras", "continent": "Central America"}, "stars": 3.5, "variance": {"poor": 15, "average": 61, "very good": 199, "terrible": 14, "excellent": 550}, "aka": "Infinity Bay Spa And Beach Hotel West Bay", "slim_ranking": 0.181818181818, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Location: West Bay Beach, Roatan, Bay Islands, Honduras, Central America (15 minutes from airport). Accommodations: Condo, 2 Bedrooms + Convertible bed(s), 2 Baths (Sleeps 4-6)Keywords: Luxurious Condo Resort 2BR/2BA at Infinity Bay Roatan. Planning a vacation now to leave in the fall? Location Location Location. The most beautiful upscale resort which is called Infinity Bay Resort located at West Bay Beach, which is one of the top beaches in Roatan, Honduras and of the Caribbean. The reef is only yards away, which is the second largest coral reef in the world. Swim with the turtles and an abundance of marine life, go diving and discover more, or use our complimentary kayaks. Local activities, include scuba diving, sailing, fishing, canopy tours, horseback riding, and much more."}