{"user_rating": 4.5, "review_count": 1085, "name": "Inkaterra Machu Picchu Pueblo Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "of all the places we stayed in our 10 nights in Peru, this was just ok. The others were the Ramada at the Lima airport, Sol y Luna, Inkaterra in Cusco, and Aqua Expeditions on the Amazon. The room was nice and of adequate size. We were able to sleep on the bed. We made a fire and I had some of the provided Pisco brandy. We played cards with our friends in the bar. Dinner and breakfast were interesting but not the best we had in our stay. I did have cuy. It was close to the train station and had several good places to sit and admire the country. They can charge their fees since they are likely the best place in Agua Calienties.", "title": "Inkaterra near Machu Picchu", "user": "tugokc", "date": "April 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 129067284}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We had an overnight stay at this hotel but would have loved an extra night there. Our bungalow was spacious and comfortable and even had a fireplace which we used until the fire went out. Never was a boy scout! The common areas were also spacious and comfortable. The grounds are beautiful with various types of gardens including an orchid garden. Hummingbirds abound. So plenty of exploring whilst not visiting Macchu Picchu. The restaurant food was excellent with breakfast being more than adequate. Staff were friendly and helpful. Only complaints are that reading light in the room was poor, especially for us older people at night, and the safety deposit box instructions were back to front in relation to buttons A and B. What really impressed us was the seamless arrangements for luggage upon arrival and departure. Our luggage was collected by hotel staff at the railway station and taken direct to the hotel while we boarded one of the many shuttle buses to visit Macchu Picchu. Then on departure the luggage was delivered direct to us at the railway station after we had passed another morning visiting magical Macchu Picchu. Definitely the place to stay at Aguas Calientes.", "title": "Peaceful setting handy to Macchu Picchu", "user": "geonic", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129000762}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We have just returned from our honeymoon in Peru and had originally booked one night at the ElMapi hotel however after making the Inkaterra group aware of the fact it was our honeymoon they very kindly upgraded us to the Inkaterra Pueblo Hotel which was truly wonderful! We live in the Middle East where there are some exceptional hotels however the Inkaterra definitely came in at no.1 for us both in terms of the rooms and facilities but also the extra care the staff took to recognise our special occasion.", "title": "Wonderful hotel in fantastic surrounding!", "helpfulness": 2, "user": "SaraLewin", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128974247}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel is set away from the main centre and so it truly feels like you are staying in natural surroundings in the jungle whilst still being of 2 minute walking distance to the town! The rooms are so stunning and cosy and the small touches such as the hot water bottles being placed in at night-time and the wood fires in every room made it so special and quaint. We also loved sitting in teh hot outside spa in the evening after a long day trekking!", "title": "Beautiful natural surrounds!", "user": "Jim255350", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128561585}, {"rating": 5.0, "title": "Wife says best of trip", "text": "We will always remember this hotel and the great stay we had there.", "user": "jeffMissoula", "date": "April 24, 2012", "id": 128556970}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My wife and I stayed at this hotel for two days. This was our base for visiting Machu Picchu. It is definitely not a conventional hotel. The rooms are scattered amongst several small bungalows in the woods, along the river. The underlying theme for the hotel is rustic. The rooms are comfortable and furnished with products made out of natural ingredients. Very little plastic or man made materials were in sight. Our room overlooked the river. It was wonderful to sleep to the sound of the running water. The whole property is home to several species of birds and a variety of orchids. We took advantage of the bird walk offered by the hotel. It started at 6:30 am and lasted for an hour and a half. Our guide/naturalist was full of interesting information about the various species of birds and was able to point those out to us. Seeing the humming birds up close was a delight. A photographers dream indeed!", "title": "A Unique Hotel In A Unique Location", "user": "curiousrover", "date": "May 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129646467}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel staff picked up our luggage at the train station and had it available at the platform for our return journey.", "title": "An Excellent Experience", "user": "BluePhantom", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129521328}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The dining room is very picturesque. Our dinner was a memorable one. The food and the service was outstanding.", "title": "Bliss..................", "user": "TulltheTraveller_8", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129443397}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "My only regret is that we did not stay long enough at this hotel. It was a great experience.", "title": "Two night stay here while visiting Machu Picchu.", "helpfulness": 1, "user": "gdmyers", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129264668}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We stayed at the Inka Terra for three nights starting April 22. The arrangements were made by Peru For Less and included both breakfast and dinner. A hotel rep met the train and took care of our bags while our guide accompanied us up to Macchu Piccu. We returned to the hotel, checked in, and had a nice lunch in the Inka Cafe. Our room was No.9 which was on the second floor with a great balcony from which we enjoyed many an adult beverage ( purchased in town). The room was very spacious with a comfortable king sized bed and nicely decorated. The grounds were gorgeous. Dinners were three courses and very enjoyable. Beer and wine by the glass were very reasonable. The breakfast buffert were more than adequate. It was just a beautiful way to end the day after hiking and touring. It was the best hotel experience of our trip. We would gladly recommend to anyone.", "title": "Lovely stay at Inkaterra - great showers!", "helpfulness": 1, "user": "WMerrill", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129190882}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for one night after arriving by train from Urubamba where we stayed at Tambo del Inka. The difference between the two hotels is like night and day (Inkaterra being the \"night\"). Although the setting of the hotel is attractive, the two rooms we were shown were shockingly small and spartan (and the bathroom was extremely basic). This hotel, even considering its \"naturalistic\" setting and atmosphere, in no way qualifies as a luxury property. The pillows in the room were cheap foam (with no feather available), there was no heat (other than by using the fireplace), the blanket was wool (not down). When calling for service by telephone, we received a consistent \"busy\" signal for more than 10 minutes. The bellman brought us to the wrong room and did not even have the key. We had to sit on the steps and await his return. We did not consider the meals to be among the better dining experiences we had on our trip (especially in conrast to Tambo del Inka and the restaurants in Cusco). If we had been paying $200 per night, we might not have been disappointed but at $600+ (including breakfast and dinner), we felt that we had been robbed. Tambo del Inka in the Sacred Valley was less than half the price, the rooms were truly luxurious, the food was wonderful, and the staff was helpful and friendly. We only wished that we had been returning there after our Machu Picchu excursion. Inkaterra has a captive audience (with only a couple of other hotels to compete at Aguas Calientes) and they are truly taking advantage. If you regard this review as super-critical, I invite you to read my other reviews and I believe you will find that I am extremely fair-minded and do not have unreasonable expectations.", "title": "Inka-terrible", "user": "DCRE", "date": "May 15, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 129989361}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "This is a charming hotel a few minutes walk from the railway station and bus stops to Machu Picchu ruins. It is located in a 12 hectare park with wonderfully cosy rooms/mini suites with firplaces all with great views either of the park or the fast flower river. Charming restaurant with good food (included in the price) and staff. The hotel prides itself on being carbon nutral. They have a number of free excursions including orchid walk and nature trail, both being hightly interesting lead by enthusiastic guides. The park boards its own tea plants, which are served complimentary in the afternoon. A GREAT PLACE TO STAY. It is without doubt the best in the town and HIGHLY RECOMMENDED. Check out my best find restaurant the Tree House.", "title": "THE PLACE TO STAY - GREAT", "user": "GOWITHTHEFLOW10", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129943566}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed at this wonderful hotel for only one night but would have liked to have stayed longer. We booked the hotel as our base for visiting Machu Picchu but in hindsight we wished we had stayed for an extra day to enjoy the hotel as a destination in itself. The hotel blends into the surrounding environment and has its own nature walks which are conducted for no charge by the hotel staff. Humming birds frequent the numerous feeding stations, We had a room with an open fire place which was lit for us when we returned from dinner. The main restaurant was one of the best we encountered during our time in Peru and there is also the cafe next to the train station which served an excellent lunch.", "title": "Amazing Hotel", "helpfulness": 2, "user": "NSMKMelbourne", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129731253}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "My brother and I stayed here for 1 night in October 2011. Inkaterra is expensive but totally worth it. The only hotel in Aguas Calientes that can even come close is the Sumaq. The location is fantastic, tucked away from the main square along the river. The grounds are beautiful and the rooms extremely comfortable. It was so nice to return to the Inkaterra after a tiring day of exploring Machu Picchu. Dinner was probably the second best meal we had in Peru and breakfast was excellent as well. This hotel has earned every bit of its Travel & Leisure Top 100 rating.", "title": "Great Experience", "helpfulness": 1, "user": "Europefan17", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129706044}, {"rating": 5.0, "title": "Blend into nature", "text": "Blend into nature and wake up with the sounds of birds and the waterfall. This eco resort overlooking the Urubamba river has it all. Sorrounded by lush greenery, the villas have two adjoining suites with comfortable beds and open fireplaces. Free excursions are available with qualified English/Spanish speaking guides. You have the choice of Nature walk, Orchid walk, Bird watching and Tea Plantation.", "user": "Sriyani", "date": "May 10, 2012", "id": 129689479}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "On arrival I was told they had upgraded my room – on reviewing my reservation details I now realise that was not the case. A few niggles - all the electricity cables need to be at ground level or buried - currently they significantly disfigure the site. Despite phoning and emailing in advance, my room did not have as good a view as expected; that was my main disappointment. Rooms have showers and not baths - given I'd been trekking for 4 days to Machu Picchu I wanted a bath. There are mosquitoes so don’t forget to take insect repellent. Despite these problems I still liked the hotel and thought the staff excellent.", "title": "excellent staff, very disappointed with the view", "user": "SeriousTraveller01", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 128538492}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "I guess they do not need to try very hard when they have a somewhat captured audience.....as a solo traveller i never felt noticed let alone important or special...they seem to focus more on groups. The room i had was simple but clean and nice...none of the rooms, only the suites have baths which is a shame as i needed a bath after hiking Wayuna Picchu. I did have a massage that was ok, but a bit expensive. The breakfast was good but service at dinner and lunch was dreadful. At both meals i was in the middle of my starter when my main was delivered to my table and left there! Hopeless. Not many choices in this town....just do not expect much.", "title": "Over-rated, average service", "user": "maxtedandlily", "date": "April 23, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128437418}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Rooms: The rooms are large, plenty of light and with great toiletry products. If travelling with kids or aged people it could be a good idea to ask for a room near the front desk or restaurant as the terrain is hilly.", "title": "Very good hotel in the middle of a beautiful tropical garden", "user": "maremtovi", "date": "April 22, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 128362093}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Food: We had dinner and breakfast, both were delicious and with delicate presentation. Service at the restaurant was very good. Ask for the \"quinua pancakes\" at breakfast, absolutely exquisite.", "title": "A garden paradise", "user": "owl4000", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128300847}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Service: overall service is very good, the only complain was during registration at our arrival, we didn't feel welcomed.", "title": "Not Enough Handrails for the Steps", "user": "SueKot", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 128190523}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "If you are contemplating where to stay as you spend time at Machu Picchu, and you love beauty and nature and want a luxurious environment without spending $2000 per night --or being \"stuck\" on the mountain-- at the Sanctuary, then this is your spot. Fantastic property!", "title": "Beautiful, upscale way to visit Machu Picchu region", "user": "NomadicNina", "date": "January 2, 2014", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 189330975}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Couple of bits of wisdom that I am sharing, however. Our suite was INCREDIBLE--outdoor divan, own pool (too cold to use), spacious room, great bathroom. HOWEVER---our kids' rooms were not well cleaned, so check out your room before they deliver your luggage. Also, service at both restaurants on property (Cafe and dining room) was abysmal--we had three meals and even tho food was quite good, and views unparallelled, the wait staff clueless that we might want to actually catch a bus or a train and glaring miscalculations on bills each time! .", "title": "Wanted to stay longer", "user": "luxtravgal", "date": "January 1, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189271879}, {"rating": 5.0, "title": "Amazing place, worth an extra day", "text": "My biggest piece of advise: stay two nights. we had zero time to explore trails, orchid gardens, birdwatching adventure, etc on this majestic magical spot. Ideal is two nights here and two nights in Cusco with one night at a third great spot in Sacred Valley, if possible.", "user": "Amritava D", "date": "December 31, 2013", "id": 189173182}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "What a beautiful property! Had I known how special this place was, I would have arranged to stay longer. The hotel is set in a beautiful jungle like setting and the hotel offers numerous options to explore the area with a naturalist - which we didn't have time to do. I would have enjoyed walking through their orchid walk - but the path was always locked. I guess you could only do it with a naturalist. Rooms are spread out in various buildings. Our was very large and had a working fireplace. The bathroom is very spacious. There is no air conditioning, but wasn't a problem for us. (Note: expensive Sanctuary Lodge at the entrance to Machu Picchu doesn't have air conditioning either, save for a few rooms overlooking the entrance and diesel fuel smells). Dinner and breakfast were included in our rate. The restaurant was busy in the evening and the food very good. Enjoyed walking around Aguas Calientes; exceeded my expectations. If you come here, be sure to schedule time to enjoy everything this property has to offer.", "title": "Special Place To Stay", "user": "MadMamW650", "date": "December 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189108377}, {"rating": 5.0, "title": "Wonderful location", "text": "I came here with my parents who were already tired from catching a 6 AM train from Cusco followed by a 3 hour comprehensive tour of Machu Picchu. The restaurant was perfect, the food was great, the English spoken was perfect, and the staff went beyond with the service. The room didn't have a facility for heating water for tea, but everytime we called they delivered a jug of hot water with 3 cups to the room free of charge.", "user": "Pwcrafton", "date": "December 29, 2013", "id": 188946231}], "location": {"country": "Peru", "region": "Cusco Region", "continent": "South America"}, "stars": 4.5, "variance": {"poor": 26, "average": 44, "very good": 197, "terrible": 17, "excellent": 801}, "aka": "Inkaterra Hotel Machu Picchu", "slim_ranking": 0.105263157895, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "This enchanting Andean village hotel is located within 12.3 acres of pristine cloud forest. The spectacular grounds are laced with paths that wind past waterfalls and trails, and organic gardens that wander through the misty forest. A place to relax, while exploring nature and encountering the wonders of the Incan civilization, experiencing authentic travel. Our suites are part of Relais & Châteaux."}