{"user_rating": 4.5, "review_count": 343, "name": "Inle Princess Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We arrived by road, from Heho airport via Nyaungshwe and the excellent Red Mountain Winery. We arrived at a \"service area/staff quarters\", and had a longish walk through this area to reception. Our \"Lake View Chalet\" actually doesn't have a view over the lake, which is perhaps half a mile away, just over a water channel - pretty enough, with some beautiful birds and dragonflies. Nice verandah on the chalet, but several problems internally; the aircon unit was poorly sited, and completely ineffective, and the ceiling fan did about 5 rpm, so didn't help at all - the staff provided a free-standing fan, which DID help; there was no shower, just a hand-held shower head in the bath, which I find extraordinary in a so-called \"first class\" hotel. The bathroom and separate toilet had large picture windows looking out over the main footpath, so even if you just wanted a pee you had to draw the curtains. The windows should be masked, screened, or have a reflective film applied.", "title": "Disappointing, particularly given other reviews on here", "user": "Samthetax", "date": "March 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 156170187}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Food at the hotel was excellent, including one of the nicest meals I've ever had - steamed chicken in coconut milk in banana leaves. The bar and restaurant are beautifully designed nd decorated.", "title": "Perfect peace", "user": "Dabblings", "date": "March 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155438554}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Apart from the food we were very disappointed with this hotel.", "title": "Perfection", "user": "katharinejg", "date": "March 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155312229}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "These chalets by the lake were absolutely beautiful. Very comfortable bed, beautiful bedlinen, lovely touches like hibiscus flowers on bath robes, on bed, on piles of towels. Everything worked, the restaurant was very good, & considering that you were a captive audience, it wasn't expensive. Breakfast was excellent. The staff were extremely helpful & gave wonderful service. we hired bikes & cycled up to Red Mountain Winery. A little on the hairy side, & do remember the entrance to the hotel on the way back as it isn't marked! Don't believe them when they say there's a little hill up to the winery, it's a mountain!! We hired a sampan with leg-rower for an hour up to sunset, who took us through the floating gardens. It was lovely. The next day we hired a long-tail boat & driver through the hotel, $38, & had a day visiting many attractions on the huge Inle Lake. We particularly enjoyed Indein village & pagoda & the stupas that are being taken over by the jungle. The lotus & silk weaving place was very interesting. I would have loved a lotus & silk scarf, but they were very expensive. I did buy a silk scarf which is very attractive. The fishermen on the lake were fascinating to watch, & the villages on stilts were fascinating. A super day.", "title": "beautiful beautiful resort hotel", "user": "buffalogal2012", "date": "March 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155215682}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Diverting off the lake into an alley of bright green vegetation the boat passes through a village of stilt houses before cutting its engine, taking on board a leg rower and serenly gliding James Bond style to the black wood hotel. Elegant, romatic,aesthetically pleasing, this is a well designed, relaxed, friendly hotel. Worth every freshly minted dollar! I would stay no where else if I came back. The spa is bliss. MAssage undid all the cheap beach massages that had criscked my neck in the first place! The staff are friendly and relaxed. The food was lovely. The room perfect. Walking in the countrylanes bucolic. Booking it was difficult as it's so popular - we only got one night. This is a far cry from HuPIn on the otherside of the lake!", "title": "need to refurnished", "user": "xilefCH", "date": "March 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 155144499}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Inle Lake is a magical kind of place. This feeling is enhanced by your arrival at the hotel. A quick motor boat run from the jetty in town turns into a silent leg rowing approach for the last 1/4 mile.", "title": "heaven looks a bit like this", "user": "seasidevally", "date": "March 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154404555}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "the bungalows are set in beautiful gardens around stunning lily ponds, some are quite a walk to the restaurant . the rooms are huge with lofty ceilings. Our's had a wooden boat shaped bath in an enormous bathroom, an outside shower and a wrap around verandah with loungers to catch the sun/ or shade.", "title": "A peaceful place", "user": "Scampston", "date": "March 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 154173941}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The restaurant was good, the spa was exceptional and the possible boat trips out to see life on the lake were fascinating. We were expecting mosquitoes to be a problem but they were not. The sun is fierce though especially when you are on a boat so do take a hat and use the umbrellas that are on all the boats.", "title": "A dreamy place", "user": "NewYorkBulldog", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153883222}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The altitude makes the climate perfect in early March although beware - you need plenty of sun lotion. The hotel rooms, each semidetached chalets, need more light and would benefit from having the lavatory in a separate room. In our case it was a long walk between our chalet and the reception/dining areas.", "title": "Just about perfect", "helpfulness": 1, "user": "kenokids", "date": "March 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153767078}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Food OK but nothing special.", "title": "Great place", "user": "Tobyiow", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153689330}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Arriving at the hotel by longboat, past local houses on stilts and with the lake wildlife adding its own welcome is a delight.", "title": "BEAUTIFUL LOCATION, SO DIFFERENT", "user": "davidfisher", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157241624}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Nice accommodation, our party had three adjacent lake rooms so we could gather on one of the terraces for tea or a drink before dinner.", "title": "Great hotel", "user": "fownog", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157195277}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This is another hotel where there's a certain lack of privacy in the bathroom as the wall doesn't go up to the ceiling.", "title": "Layout could be improved but top hotel", "user": "Michael_Anderson107", "date": "April 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 156573143}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We took the hotel bikes for a delightful ride to a nearby village, and also to the Red Mountain winery - the reds are better than the whites.", "title": "A fantastic place to stay.", "user": "Winnie999", "date": "April 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 156339027}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Very helpful staff organised a memorable day by boat covering various parts of the lake and we were also fortunate to be there at a major Full Moon celebration when hundred of monks and thousands of people gathered at a local monastery for rice presenting ceremonies, very memorable.", "title": "One of the nicest hotels I have stayed in", "user": "traveller2148", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156276433}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Our 3 day stay at the Inle Princess was one of the highlights of our holiday in Burma. I agree with most of what has already been said. We were there towards the end of February and it was very hot so we enjoyed the cooler evenings and mornings. Our room (facing the lake) was very hot and the air conditioning machine and one fan were not really up to the job. Certainly no need of the fire! We had our evening meals, which were delicious, on the restaurant terrace and also our breakfasts, when we watched the staff arriving in longboats. The croissants and pains au chocolat were gorgeous and not what one would expect in Burma! We walked round the village behind the hotel and watched the sugar cane being brought in from the fields on bullock carts and talked to some of the children. We had two full days out on Lake Inle and visited one of the five day markets, at Inthein, which was fantastic. We would certainly recommend Inle Princess to others.", "title": "Three wonderful days", "helpfulness": 1, "user": "JFTW", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154954262}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "A lovely hotel in a stunning location. If you visit Inle Lake and your budget allows, this is the place to stay (colleagues stayed elsewhere and we compared notes). Challenge is you must book far in advance and possibly have a connected travel agent", "title": "Inle Princess Hotel", "helpfulness": 2, "user": "Margaret P", "date": "March 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154803110}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We stayed in the Princess chalet. Again, if you can go for it and have the experience of a lifetime. If not, request a lake view chalet when making reservation as they are limited in number. Looking out and seeing the lake from anywhere in the chalet and walking out of your porch to sit and watch the water made this stop extra special. It is a serene and beautiful place", "title": "This is what every hotel should be about", "user": "Furfantis", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154700610}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Restaurant is quite good and has lots of local food. Try the salads (if your stomach allows) as they are delicious and feel healthy. The green bean and banana blossom salad were standouts. The lemongrass tea was unusual and tasty. They claimed it didn't have sugar and assuming that is the case, it is a standout. Even a good wine list!", "title": "beautiful and peaceful", "user": "Loves2travel53", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154576888}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Breakfast buffet is plentiful. Local fruits great; try the soup if they have it. Omelets - well you can get them anywhere!", "title": "Delightful spot", "user": "Ed N N", "date": "March 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154413520}], "location": {"country": "Myanmar", "continent": "Asia", "city": "Taunggyi"}, "stars": 4, "variance": {"poor": 5, "average": 13, "very good": 84, "terrible": 2, "excellent": 239}, "aka": "Inle Princess Hotel Taunggyi", "slim_ranking": 0.142857142857}