{"user_rating": 5.0, "review_count": 418, "name": "Inn at Monticello", "reviews": [{"rating": 5.0, "title": "Great stay at the Inn", "text": "Five of us stayed as the Inn in Monticello and we were served delicious breakfasts and had a superb standard of accommodation. Beautiful gardens surround the Inn and it was so peaceful sitting on the veranda sipping a cool glass of complimentary wine in the late afternoon sun having spent a busy day touring. We would highly recomend the Inn to anyone who will be travelling to this area. Rose from Ireland", "user": "A TripAdvisor user", "date": "June 29, 2005", "id": 3618988}, {"rating": 4.0, "title": "Peaceful and friendly at Charlottesville, VA", "text": "The Inn at Monticello offered a relaxing, coddled atmosphere for our 25th anniversary celebration before the big-party celebration! The decor, parking, location, breakfast, and even pets were bed-and-breakfast delightful! The very best part was a surprise: the guests themselves were a joy to meet, converse with, and hear life stories of interest. Nearby restaurants offered quality meals at reasonable prices. Charlottesville is a lovely area to visit!", "user": "A TripAdvisor user", "date": "June 28, 2005", "id": 3618262}, {"rating": 5.0, "title": "Peaceful and Relaxing", "text": "B & C S. of Columbia, MD", "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3614891}, {"rating": 5.0, "title": "Lovely Virginia Country Setting", "text": "We loved the Inn at Monticello. We found the Inn extemely warm and inviting (as was the hostess.) Everything was excellent. Our favorite part was lounging on the large front porch. We'll definitely recommend this to others.", "user": "peapicker", "date": "June 27, 2005", "id": 3614791}, {"rating": 5.0, "title": "Loved the Inn", "text": "We arrived at this beautiful country inn travel weary and hot. We were cheerfully greeted, guided to our room and provided a refreshing beverage. After we had rested a bit, we were given helpful hints on finding a restaurant with further guidance in getting reservations and driving directions. We rested deeply in this quiet setting and arose to a beautiful and delicious breakfast. The hostess made us feel like family and facilitated our successful planning for the day's touring of Monticello. We have fond memories of this inn where we celebrated our 40th anniversary!", "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3614041}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "My wife and I spent two nights at the Inn at Monticello and had a wonderful time. The location couldn't be better if you intend to visit Jefferson's home, just a mile up the road. The inn itself is a 19th century building surrounded by beautiful grounds, giving you the feeling of stepping back in time. We slept well in a quiet, well appointed room with a very comfortable bed. The inkeepers, Becky and Norm, will give you a warm welcome and have great suggestions for dinner and what to do in Charlottesville and the surrounding area. Last, but not least, the breakfasts are wonderful and will start your day off right. If we return, we will stay here again.", "title": "Great location and breakfast", "user": "jab31151", "date": "July 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3655607}, {"rating": 5.0, "title": "home away from home", "text": "hosts were gracious, guests were fascinating, facilities were outstanding. It was like being in a very very nice version of our own home.", "user": "A TripAdvisor user", "date": "July 10, 2005", "id": 3654685}, {"rating": 5.0, "title": "A great B&B", "text": "Extremely comfortable B&B, with polite, friendly staff and terrific location for reaching points of interest in and around Charlottlesville. A delicious breakfast. We will try to stay there again next time we overnight at that location.", "user": "A TripAdvisor user", "date": "July 4, 2005", "id": 3635584}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We stayed at the Inn at Monticello for our anniversary in June, 2005, and really enjoyed it very much. Patti, subbing for the the innkeepers, was very friendly and made us feel right at home besides giving us much helpful information about the area. We had a beautiful bedroom with a 4 poster bed and private bath on the first floor. The front porch was so peaceful in a very pretty setting watching the birds and sipping our afternoon wine. The breakfasts were delicious and we enjoyed conversing with the other guests. We would recommend this B and B to anyone touring the Charlottesville area. There is much to do in that area between the historical sites and visiting wineries.", "title": "Loved the charm of the Inn at Monticello", "user": "Mariners04", "date": "July 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3631520}, {"rating": 5.0, "title": "Our anniversary stay", "text": "The Inn is in a perfect setting, with friendly folks running it, and food is second-to-none. A short two-mile walk/hike/run to Monticello added to the experience. Inn-keepers are quite knowledgeable about local area, attractions, and even made dinner reservations for us. Olde Towne of Charlottesville a short 15-minute drive, and several wonderful winery/vinyards within 30 minutes. The lawn was beautiful, setting quiet, and the private porch on our room was perfect for a tranquil afternoon tea and book. We would highly recommend this as an anniversary getaway to any of our friends and family!", "user": "A TripAdvisor user", "date": "June 30, 2005", "id": 3622654}, {"rating": 5.0, "title": "Great Inn", "text": "We enjoyed the atmosphere and the feeling of seclusion at this inn. But within a few minutes driving, we were downtown where several shops and excellent food awaited. The inn itself is beautifully furnished with private bathroom facilities. The breakfast was excellent, and was served promptly every day. There is so much history in the region, and several historic places to visit, such as Monticello, Thomas Jefferson's home. We thoroughly enjoyed our time there -- and getting to know the owners' three cats!", "user": "A TripAdvisor user", "date": "June 26, 2005", "id": 3612472}, {"rating": 5.0, "title": "Romantic Weekend", "text": "We had a wonderful weekend in a beautiful room with a large four poster bed. The room also had its own private back porch which was nice. The breakfasts served in the mornings were a highlight - loved the special french toast. The location was perfect to see Jefferson's Monticello and UVA as well as being close to excellant restaurants for dinner.", "user": "A TripAdvisor user", "date": "June 12, 2005", "id": 3544473}, {"rating": 5.0, "title": "Really nice place to stay!", "text": "Pulling in to the Inn at Monticello, you quickly leave your road cares behind", "user": "A TripAdvisor user", "date": "June 9, 2005", "id": 3542592}, {"rating": 5.0, "title": "Delightful experience!", "text": "as you see a very attractive house with a large grassy front yard and several beckoning trees! The Inn is nicely decorated without over doing it.", "user": "A TripAdvisor user", "date": "June 9, 2005", "id": 3542488}, {"rating": 4.0, "title": "very nice inn", "text": "Our room was spotless, the bed huge and comfortable, and we had our own private back porch to relax in. The owner and Innkeeper Becky offers information when you want it and can give you as much or as little as you need which is just what you want!", "user": "A TripAdvisor user", "date": "June 7, 2005", "id": 3537979}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "The Inn at Monticello is such a charming place. It is obvious that the owners truly appreciate the Charlottesville area. The Inn is located in a perfect location - close to downtown Charlottesville, The University of Virginia and Monticello as well as other wonderful attractions. The innkeepers serve an excellent warm breakfast and provide a brief, but thorough background of the area and sites to see.", "title": "Loved the Inn at Monticello", "user": "ghhelp1", "date": "June 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3613931}, {"rating": 5.0, "title": "Historic Getaway", "text": "We truly enjoyed it and will be sure to stay there again when we are in C'ville.", "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3613369}, {"rating": 5.0, "title": "Helpful Hospitality", "text": "Loved the historic getaway. The stay was personal and professional We were afforded fabulous hospitality and great breakfasts. The little things likt local directions to town, favorite restaurnats, and yahoo map quest to get to our next destination were some nice touches. We also met some great people that also stayed there and we will be in touch from the West. Highly recommend the Monticello Inn to anybody. The package bed and breakfast along with the tickets to Monticello was well worth the trip. Thanks again.", "user": "A TripAdvisor user", "date": "June 27, 2005", "id": 3613327}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We enjoyed our 2 day stay! The food was excellent, and the hosts were very helpful with suggestions and directions. We certainly will return if we visit the Charlottesville, VA area again, and will recommend the Inn to our friends and co-workers.", "title": "Loved the Inn at Monticello", "user": "ghhelp1", "date": "June 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3612856}, {"rating": 5.0, "title": "High Recommended Inn", "text": "Originally, we made reservations at the Inn in Monticello in March. An important family event overrode our plans. The wonderful hosts of the Inn let us cancel and rebook without the loss of the deposit. We were very impressed.", "user": "A TripAdvisor user", "date": "June 26, 2005", "id": 3612626}], "location": {"country": "United States", "city": "Charlottesville"}, "variance": {"poor": 4, "average": 11, "very good": 54, "terrible": 1, "excellent": 348}, "aka": "Inn At Monticello Hotel Charlottesville", "slim_ranking": 0.1875, "description": "The Inn at Monticello in Charlottesville VA is an upscale historic bed and breakfast inn located 2 miles from Thomas Jefferson's Monticello, and just a few minutes from other historic sites, wineries, the University of Virginia, and the Historic Downtown Mall's shops, theaters and fine and casual restaurants. The Inn sits on 5 landscaped acres with mature trees and a creek running through the property. Inside, guests are treated to fine antiques, lovely linens, gourmet breakfasts, and Virginia wine in the afternoon. Recently the Inn was noted in AAA Magazine's article on Monticello and was also the subject of a feature article in Charlottesville Woman Magazine."}