{"user_rating": 2.5, "review_count": 14, "name": "Inn on the Bayou", "reviews": [{"rating": 1.0, "title": "not that good", "text": "The rooms were not very clean. They were in need of repairs. Needing some remodeling. They look good from the outside it is the inside that needs work. A bit pricey for the condition of the rooms and no real amminities. Dirty carpets, bad grout in the bath. Just kind of dirty. The front desk wouldn't do anything about the people up stairs making noise at 3:30 in the morning, thier reply was, \" what do you want me to do about it?\" Are stay was on 9/16/05. room 21 & 22.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 24, 2005", "id": 3936419}, {"rating": 3.0, "stay_parameters": "Stayed November 2004", "text": "We stayed at the Inn on the Bayou in Lake Charles, LA in Nov '04.", "title": "Pet Friendly, Nice Value", "helpfulness": 13, "user": "raider", "date": "November 30, 2004", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 2855086}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Having a conference next door, I stayed at the Inn on the Bayou as it was the less expensive overflow hotel. It's an older style motel, long and plain looking with outside corridors, mired in a sea of concrete, but my room had been recently remodeled: nice carpet, decent furniture, tasteful decor. Because of the way the motel sits, few rooms will have any kind of bayou view, not that you really want one as it is tucked in between a busy street and I-210, meaning there's always a lot of traffic going by (though I heard no traffic noise in the room). My room had a microwave and a fridge, but no coffee pot. Wireless internet worked well. Room was reasonably clean, but not spotless. Towels were incredibly cheap and flimsy; it was hard to get dry with one and I'm a small person.", "title": "It is what it is", "user": "Twoprofs", "date": "April 25, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 62368078}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "I have no major complaints, but if I were in the area again, I would choose a more modern property.", "title": "Oh my god I am not happy", "helpfulness": 1, "user": "wal1809", "date": "February 15, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 56046723}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "Pictures posted are not of what you will find at this nasty hotel. I went for a nice vacation Valentines weekend with my wife and based on the pics we rented a room with a king bed sitting area overlooking the bayou. Sounds nice huh? NOPE there are no king beds, there are no sitting areas. If and when you can see the bayou it is trash layden. Nasty!!!! Boom boxes all night in the parking lot. NOw the best part of it all. It was 39 degrees outside and no hot water for a shower. Cold shower on valentines day makes for an angry wife. I have called and called trying to get this resolved with the manager. No word as of yet. Stay there if you like but consider yourself warned.", "title": "Surprised...Very Pleased! Great Location! Beautiful view of the bayou from our room!", "user": "kagreen50", "date": "September 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 41903258}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "We went to Lake Charles for a wedding...After reading the reviews on line I was almost tempted not to stay here...but decided not to be a party pooper....Once we arrived I was very surprised & pleased starting with the front desk to the room. Its not a 5 star hotel but for the money and location I recommend the hotel for a weekend getaway.", "title": "Don't be fooled by the pictures", "helpfulness": 2, "user": "lshevonneh", "date": "September 5, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 1.0}, "id": 8659055, "likes": {"liked": "— Proximity to casino", "disliked": "— Parking lot and locale"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The photos looked real nice on the internet, but don't let that fool you. My husband, kids, and I stayed here one night while attending a family reunion. The property grounds and parking lot were trashed with lots of potholes. The Bennigans onsite looked so shabby, I did not want to eat there. The room itself was small, but reasonably clean. The front desk staff wasn't the friendliest nor the most helpful. The iron was broken and leaked water all over my clothes. The TV remote was missing the back. The area was back away from the freeway, and I did not feel safe in the surroundings. I would not stay there again.", "title": "do not stay here", "helpfulness": 1, "user": "lainaz", "date": "July 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 8232530, "likes": {"liked": "— Nothing", "disliked": "— everything"}}], "location": {"country": "United States", "city": "Lake Charles"}, "variance": {"poor": 2, "average": 2, "very good": 4, "terrible": 6, "excellent": 0}, "aka": "Inn On The Bayou Hotel Lake Charles", "slim_ranking": 0.785714285714}