{"user_rating": 4.0, "review_count": 392, "name": "Inn at Venice Beach", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Fantastic location, really close to the beach and the pier. You can walk to muscle beach in about 10 minutes. There are bike hire places really close which is a good option to cover more distance. If you're tight on budget there are public buses from outside the hotel that can take you to LAX for $1.50 (much cheaper than any taxi, shuttle etc), the ride takes about 30-40mins.", "title": "Great location (but with lots of noise)", "user": "anzac1", "date": "September 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 8667620, "likes": {"liked": "— location to beach", "disliked": "— Construction site opposite - noise"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Breakfast was supplied and there was a good selection. Available were waffles, cereal, toast, bagels, fruit, yoghurt, coffee, hot chocolate to name a few items.", "title": "Honest Maids!", "helpfulness": 1, "user": "tommyup", "date": "August 22, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8471747}, {"rating": 5.0, "title": "Great Hotel at the Beach", "text": "Don't stay on the main road side of the building though. There is a multi-level construction site opposite the hotel and they start with the jack hammers at 7.30am!!! This is the only negative to this hotel. If you can't get a room away from the construction site, then I'd suggest stay elsewhere if you want to sleep in past 7.30am. I'd guess there is a few months of building work to go yet.", "helpfulness": 1, "user": "DCTraveller40", "date": "July 3, 2007", "id": 8051254}, {"rating": 3.0, "title": "Cute Place", "text": "Overall, this is a plesant hotel to stay in. Clean with helpful staff and a good continental breakfast. I'd recommend a stay here as long as you weren't opposite the construction site.", "helpfulness": 1, "user": "rlkenny", "date": "June 17, 2007", "id": 7868358}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "My girlfriend left a gold necklace in the room after we checked out. She realized it the next day when we were headed to the airport but she wasnt sure where she left it.", "title": "Very good experience", "helpfulness": 1, "user": "porjotok_Boston", "date": "June 9, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7818062}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We chose this hotel based on the excellent recommendations at Tripadvisor. We stayed one night and our overall impression was that the place is somewhat overrated. We got a room on the road side and it was terrible noisy. Also, there is a building site vis-à-vis the hotel and they started working early in the morning. The price we paid for our room was definitely too much due to these circumstances - not very good value for money. If you are going to stay here, ask for a room to the inner courtyard. However, the staff is friendly and helpful, and the complimentary breakfast was very good. There is also a very good french restaurant nearby and the beach is close.", "title": "Friendly staff but overpriced and noisy", "helpfulness": 1, "user": "GermanExplorer", "date": "March 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7237007, "likes": {"liked": "— Friendly staff", "disliked": "— Noise"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "My boyfriend and I stayed here for a 1 night stopover from New Zealand to the UK. We chose Venice Beach because we were arriving at 10 in the morning after a 14 hour flight and wanted a quick taxi ride so we could crash for a few hours and rest.", "title": "Good for long haul stopver", "helpfulness": 1, "user": "Ginger_Rachel", "date": "March 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 7217523, "likes": {"liked": "— Close to the airport... but not an airport hotel!", "disliked": "— Extra early check in charge"}}, {"rating": 4.0, "title": "Nice property, good location, good value", "text": "After booking, I emailed ahead and asked if we could check-in a few hours early (we arrived about 11.30). We were told we could, however when we turned up to check in, they added an extra cost for early check-in (about $15). Not a huge amount I know, but I was annoyed this hadn't been mentioned to us before. However being so tired we just paid it.", "helpfulness": 2, "user": "PriscillaBeachGuy", "date": "March 16, 2007", "id": 7171537}, {"rating": 5.0, "title": "loved this place, great base for exploring area", "text": "The room was huge with a good size bathroom. Nice and clean. We discovered later on in the evening that it wasn't overly quiet as we could hear the noise of someone showering in the next room.", "helpfulness": 1, "user": "jaime2202", "date": "March 12, 2007", "id": 7147484}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The outdoor breakfast area looked lovely although in January it was a bit too cold to eat outside. Free breakfast was good - the indoor breakfast room was quite small though. Plenty of fresh fruit, cookies and juice available in the reception area which was lovely (we had warm cookies mmmm) and changed regularly. Staff pleasant.", "title": "Great for long haul recovery", "helpfulness": 4, "user": "nomadic_family", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 6817112, "likes": {"liked": "— Outstanding service, great location", "disliked": "— Showing a few signs of fading glory"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Easy to find, plenty of food and shopping within walking distance, and a very nice overall property.", "title": "As Advertised", "helpfulness": 2, "user": "Irwish", "date": "May 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 16441641, "likes": {"liked": "— An overall pleasent experience", "disliked": "— Paying to park"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "I had a nice room overlooking the patio area. The room was bright and cheerful which went along with the hotel staff who were a nice change from some places I have stayed at in the LA area.", "title": "Fantastic hotel", "user": "Buzz73", "date": "April 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15368360}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The breakfast offered was nice but would not call it \"sumptuous\" as noted on their web site.", "title": "Friendly staff, good location", "user": "Jeanette_8", "date": "April 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0}, "id": 14991541, "likes": {"liked": "— Location", "disliked": "— Getting stuck in the lift (albeit for a short time!)"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "My meetings were in Malibu, so staying in Venice Beach did add about 15 minutes to my drive, in rush hour vs staying in Santa Monica. The differance this grade of room would have been a minimum of $50.00 more not counting breakfast.", "title": "Calm and nice hotel", "helpfulness": 1, "user": "jeanmiz", "date": "April 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 14830959}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "My only complaint is the $7.00 parking fee that's charged. Although this is $18.00 or so cheaper than any Santa Monica Hotel I still feel parking should be included in the cost of a room that costs north of $150.00 a night.", "title": "Great spot", "helpfulness": 1, "user": "nursenancy03", "date": "April 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 14722550}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "My family of five stayed here for a short summer trip. The room was clean and nice size. The staff was great and the breakfast in the courtyard was a great addition to our stay. This hotel is steps from the Venice canals, several restaurants and a five minute walk to the beach. Great spot for family since Santa Monica Pier is just a short drive and great getaway for a grown up vacation too. Hotel parking is only $7.00 and warm chocolate cookies at checkin. We will be back!!", "title": "Great Location at good price!!!", "user": "FamofFive_10", "date": "July 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 70069299}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We stayed here over Memorial Day weekend. We had no idea about the Venice Beach area but heard it was a fun place to stay. We chose the Inn at Venice Beach because of the location and price. From the time we checked in, the staff was friendly and extremely helpful! Breakfast is included and was a step above the average continental breakfast-included bagels, waffles, and hard boiled eggs. Wi-fi is also included for free and it is a fast connection. The Inn is two blocks away from the beach, and about three blocks down from Muscle Beach....some really great people watching!!! There are some really great restaurants in walking distance. We really enjoyed C & O Trattoria...great Italian for a great price. We had pizza delivered one night...Lenzini's Pizza. Fast delivery at a great price. Overall, we were extremely satisfied with The Inn at Venice Beach!!!", "title": "Great location, excellent staff, clean rooms, lots of amenities included!", "helpfulness": 1, "user": "JHENHAPL", "date": "June 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 65989744}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "Okay people. This review is waaaaaay overdue. Searched and searched for a hotel in the Marina Del Rey area and came up with this renovated boutique hotel. Was concerned about where to stay because our trip was 9 days long. Must say that I am a cleanliness freak. Did I mention \"cleanliness freak\"?! Traveled with a friend and stayed in one of the loft rooms. Very convenient. Room at the back of the hotel. Queen size bed upstairs. Queen size pull-out bed downstairs. It worked out perfectly. Only had one issue upon arriving and that was quickly taken care of. Our room was cleaned well everyday. Everyone was friendly. EVERYONE, from the maintenance man to the housekeepers to the front desk, especially Alfonso. He really made the stay nice. Must love the breakfast. Lots of bread-type goodies. Hard-boiled eggs. Juices. Hot and cold cereal. And, fresh fruit...bananas, apples and oranges. It reminds me so much of Europe. There was a wonderful courtyard, but we never sat in it because of the weather being a bit chilly. Next time. Would recommend this hotel to anyone and everyone. And, I'm picky. Was sick while I was there. The housekeepers always made sure that I had extra towels and extra pillows. If you're looking for the big-time chain hotel, this is not that. But, if you're looking for something different that is close to the beach and near good restaurants, chose this hotel. I cannot say enough good things about it. They really made my stay enjoyable. The next time I'm in the Marina Del Rey/Venice Beach area, I will definitely chose the Inn at Venice Beach. Hey! I'm a card-carrying Marriott member, which is only about 5 blocks away. I must have really enjoyed myself to say that I would rather stay here than earn points. Inn at Venice Beach. Be about it!!!", "title": "Simply...loved it", "helpfulness": 1, "user": "Chanteuse_16", "date": "May 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 64666622}, {"rating": 4.0, "stay_parameters": "Stayed May 2010", "text": "I stayed at this hotel with two family members for 6 nights. We rented the loft room and they took the bed in the upper section while I slept on the futon on the main level. We had a third floor apartment facing Washington Blvd. The loft room had a small kitchenette where there was a mini fridge, a sink, and a coffee maker.", "title": "Very pleased with this hotel - I would stay again", "helpfulness": 1, "user": "Until_It_Sleeps", "date": "May 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 64178564}, {"rating": 4.0, "title": "Inn at Venice Beach", "text": "The hotel seemed like it was in fine shape. First and foremost, the hotel had a great location. The walk to the Venice pier, the beach, and the boardwalk was only 2 or 3 minutes. Santa Monica was only a few miles to the North as well. The carpets in the hotel may be a little old but the rooms, blankets, and towels all smelled clean. Everything was nicely cleaned in the kitchenette and bathroom as well. There was a large CRT TV on both levels of the loft.", "user": "Rgray813", "date": "May 9, 2010", "id": 63674107}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "We just returned from a fabulous trip to the Los Angeles area! We took in just about everything available - even went to the Red Carpet Premier of Shrek 3!! Anyway, Inn at Venice Beach was a very nice, clean and friendly hotel! Four of us stayed in one room but it was not crowded at all. They have a really good continental breakfast every morning which helped us get an earlier start to our trip. It's only two blocks from Venice Beach and there are some very good restaurants in the area. I would highly recommend this hotel. Thanks!", "title": "Inn at Venice Beach", "helpfulness": 2, "user": "newpal15", "date": "May 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7587495, "likes": {"liked": "— Easy access", "disliked": "— Sometimes we had to ask for washcloths"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "This is my first official review; I figured it was about time since I have taken full advantage of all the great perspectives out there in TripAdvisor forums.", "title": "Comfy stay in Venice", "helpfulness": 1, "user": "Krista.Suzanne", "date": "May 2, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 7492723}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The Inn at Venice Beach was a pleasant and comfortable place to stay within walking distance of everything we needed. The hotel is standard and is situated next to The Venice Canals, a beautiful part of Venice with the name speaking for itself. The houses are right on the water and it's a great route to walk from the hotel to the beach.", "title": "Great location", "helpfulness": 2, "user": "aussie_amber", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7392952, "likes": {"liked": "— close to the beach", "disliked": "— cigarette smell in the room"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "As far as the room goes, the bed was pretty small (queen) and not that comfortable. The rest of the room was spacious with a vanity and bathroom, tub/shower. We were satisfied.", "title": "Horrible experience at the Inn at Venice Beach", "helpfulness": 4, "user": "CanadaMelanie", "date": "March 29, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 7246938, "likes": {"liked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "Your stay includes a decent continental breakfast (better than most) complete with do it yourself waffles, cereal, and toast. We felt like the hotel rate was affordable since it included breakfast.", "title": "Great overall", "helpfulness": 4, "user": "oceaniaguy", "date": "March 29, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7246812, "likes": {"liked": "— Location, Free Wireless Internet, Staff"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "It is difficult to understand how other TripAdvisor devotees could find The Inn at Venice Beach acceptable. It is aging, barely renovated former beach apartment house.", "title": "á Real Flop House", "helpfulness": 1, "user": "Mel_Paris", "date": "August 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 74381367}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The good part: It is well located, near the beach. The beds are very comfortable even though they are queen size. There are a number of nice, if funky restaurants nearby. The hotel has adequate parking. The staff is friendly if somewhat amateurish.", "title": "Great location, rooms are comfortable, clean, and roomy.", "helpfulness": 1, "user": "skecanj", "date": "August 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74113408}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The rest: One is greeted upon entry with a sign warning that the building contains toxic materials that can be dangerous to one’s health. When I asked for the brochure describing these toxic materials, the clerk could not locate a copy. He mumbled something about proposition 65, but never produced an explanation of the toxins.", "title": "Great Location, Wonderful Service", "user": "BARB54Narberth", "date": "August 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 73916895}, {"rating": 2.0, "title": "Great location but not worth the money!", "text": "The building is old, funky and in serious need of renovation. The bathroom was so small that one had to navigate to get in and out. The bathtub / shower combination was old with lots of black mold growing between the tiles. The blankets on the beds were stained and torn. A true flop house.", "user": "naturegirlmeetschic", "date": "August 4, 2010", "id": 73832653}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Our room was on a corner was so noisy that we could not sleep. There was noise from traffic, from people walking on the sidewalks, and from the interior halls of the hotel. A true insult. The ventilating fan in the bathroom would have put a Mack truck to shame. The room was dark and poorly lighted. Only one of the two floor lamps worked. The small refrigerator tucked into an alcove added to the noise pollution. But, worst of all was the old through-the-wall air conditioner. Its noise level rivaled a jet aircraft taking off. We turned it off rather than suffer the noise.", "title": "Best deal for beach hotel", "user": "TBalsar", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 71961556}, {"rating": 5.0, "title": "Awesome price in a very nice part of Venice Beach!", "text": "This hotel is ideal if you like feeling less tourist as you usually feel in a hotel. The price is unbeatable for what you get. Cute little breakfast, parking on the property, very nice staff. Totally worth it!", "user": "willth78", "date": "April 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 62627264}, {"rating": 1.0, "title": "Awful front desk and rude management", "text": "For the price you pay to stay there you'd think they'd be able to do the most simple thing like answer the phone. I had to call 3 times before someone picked up, and when I did it was loud. I could barely hear the person on the phone, all I could hear were other people laughing and talking in the background.", "helpfulness": 1, "user": "CostalTraveler55", "date": "April 27, 2010", "id": 62615102}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "I tried to speak with a manager but I was questioned like a criminal about why I wanted to speak with someone and then when I talked to the manager I was dismissed. Won't ever stay here, won't have clients stay here, won't even let my dog walk by here ever again.", "title": "Great location & friendly staff", "helpfulness": 4, "user": "Dromomaniac", "date": "March 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58325044}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "We stayed at the In at Venice Beach for 3 nights in January and really enjoyed our stay. It's a quirky little place - and it is an older motel that's had a makeover as someone mentioned, but it's been done very well, so why would that matter? The rooms are clean and fresh, the beds are extremely comfortable and the bathrooms have been renovated. They put loads of pillows & cushions and lovely crisp, white cotton sheets on the beds, which we really liked. We were given a corner room, and our family of 5 plus 5 large suitcases fitted easily.", "title": "Four out of five ain't to shabby", "helpfulness": 1, "user": "Montereyblue2", "date": "March 11, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "service": 4.0}, "id": 58307230}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Venice Beach is an expensive place to stay, so I think that the rates at the Inn were very reasonable. Venice Beach is a quirky area & I really think that the hotel is well suited to the area. If you're looking for a large international, impersonal hotel, then this isn't the one for you. It's small, comfortable and friendly. Our room was at the back of the hotel & we didn't hear any street noise at all in the 3 nights we were there. My husband & daughter used their little gym & liked it. They also included a very good continental breakfast, with various fresh toasts and pastries, cereals, boiled eggs and a variety of juices, teas & coffee.", "title": "Not worth the money", "user": "pdxworldtravelers", "date": "March 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 57791537}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "This a cute, non-chain hotel, that is in a good location even without a car. Rooms are nice, bathrooms are sufficient, although the tub/toilet portion is pretty cramped.", "title": "Good location even without a car, nice for Venice.", "user": "Susanloveshotels", "date": "February 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 57122694}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "The front desk clerk could perhaps do a better job of giving you the impression that you are not actually interrupting her personal phone call when you have a question, but will help you with what you need.", "title": "Comfortable, great price, good value.", "helpfulness": 1, "user": "TerinaSydney", "date": "January 31, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 54814269}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The owner was very helpful when I got held up on an appointment in Malibu and couldn't make it back right in time for check-out, and allowed me another hour.", "title": "AMAZING!!!", "helpfulness": 1, "user": "Karey512", "date": "January 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53565854}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "Breakfast was good, coffee was good, parking was easy, wifi reception was good as well.", "title": "Nice hotel in a good location", "helpfulness": 1, "user": "global_traveller_888", "date": "December 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 51707442}, {"rating": 4.0, "title": "Great customer service, value and comfort!", "text": "This hotel is good value for the area, and way more fun than a chain, without the gritty edge of Venice.", "helpfulness": 1, "user": "KrisPeanut", "date": "December 3, 2009", "id": 50598737}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Pro:", "title": "Nice place", "helpfulness": 1, "user": "travelviking", "date": "July 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18278514, "likes": {"liked": "— Spacious, location", "disliked": "— No pool"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Room divided in two storeys (good for families)", "title": "OK hotel", "user": "Ghost", "date": "July 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 18185673, "likes": {"liked": "— pleasant room", "disliked": "— continental breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Very spacious", "title": "Great hotel and good location", "user": "TravlinJerry", "date": "July 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 18106840, "likes": {"liked": "— Helpful Staff, Covered Parking", "disliked": "— Noisy courtyard in the morning."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Good breakfast included - in pleasant courtyard", "title": "Great Value", "helpfulness": 2, "user": "Finn-Mike", "date": "June 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 17078650, "likes": {"liked": "— The low price", "disliked": "— Lack of pool"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "5 minute walk from the Venice Pier", "title": "Great Hotel", "helpfulness": 2, "user": "Chappaqua_travelers", "date": "June 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16991524, "likes": {"liked": "— Spotless", "disliked": "— Nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I agree about the excellent location and what other review mentioned. Although the staff is friendly however useless. It's their financial benefit (commissions and tips) to advise travelers on excursions and trips. They were not knowedgeable or helpful. ie there is a boat trip to Catalina from nearby Marina Del Ray. I wanted them to book it for me. They said there was no such of a trip. They wanted to send me to Long Beach.", "title": "go somewhere else", "user": "Jeff'swife", "date": "February 25, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "business": 2.0, "cleanliness": 2.0, "rooms": 3.0, "location": 5.0}, "id": 13828273}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Another example, I told them to book a Spa treatment at the the one they're associated with called reative Chakra Spa(which btw is fabulous). They screw that one up as well.", "title": "Great Location, clean rooms", "user": "krram", "date": "February 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 13395376, "likes": {"liked": "— Location!", "disliked": "— Rooms a tiny bit run down."}}, {"rating": 5.0, "title": "Inn at Venice Beach - a really nice place to stay", "text": "As with other reviewers, I found this hotel to be a great bargain. The rooms are a little bit run down, but very clean. The staff was very friendly, and the free breakfast and cheap parking were both perks. The location really cannot be beat. It's not right on the beach, but it takes 2 minutes to walk there. We found this hotel to be well worth the money, and would definitely recommend it to friends.", "helpfulness": 1, "user": "oxfordmike", "date": "January 25, 2008", "id": 12987084}, {"rating": 4.0, "title": "Quirky little gem", "text": "Stayed in the Inn at Venice Beach for four nights.", "helpfulness": 2, "user": "JennyNZ", "date": "January 24, 2008", "id": 12946029}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Got there straight from a 12 hour flight and initially the outside looked distinctly down-market and it seemed to be on a major road rather than being \"on the beach\". However very nice friendly welcome and pleasant quiet room started to make us think it was not so bad. Then found that the \"major road\" was only 100 yards from a dead end at Venice Beach where there was a cluster of great bars and restaurants. Next morning had an excellent relaxed continental breakfast that had everything we wanted, went for a fantastic walk down the Venice Canal (only a few paces from the hotel) and back down the beach).", "title": "I recommend Inn at Venice Beach.", "user": "MZ_308", "date": "January 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 12781483, "likes": {"liked": "— Location for the money.", "disliked": "— Room decor"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I visited this Inn in March 2013. First of all, the front desk staff are warm and friendly and the general manager, especially, made certain that all my needs were satisfied. The decor is funky and eclectic, perfect for the Venice Beach ambiance. Speaking of which, the Inn is 2 walking minutes from the beach and boardwalk - with an added bonus of having good restaurants, also within minutes of the Inn. My room was very comfortable and, importantly, spotlessly clean. It took me awhile to get out of the bed each morning - it was so comfy. Love the breakfast amenity out in the Italian motif courtyard. I definitely will return to this hotel!", "title": "What a cheerful hotel", "user": "ScarletLily", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156396042}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We stayed here at the beginning of March and were very happy with the room, service, and amenities. Parking is relatively cheap at $11/day (way cheaper compared to more central locations). The staff were always smiling and greeted guests with genuine interest. The free breakfast every morning was also a nice bonus. Lastly, the rooms were well furnished, clean, and I loved the toiletries (Philosophy!). The only downside was the street noise; however, we were so tired from running around every day that we slept soundly in our big comfy bed till morning.", "title": "Comfortable, close to the beach, contemporary", "helpfulness": 1, "user": "amy_ami", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 154533327}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Our stay at the Inn at Venice Beach was very comfortable and pleasant. The Inn is well located, just a few blocks from the boardwalk. The room ( we enjoyed the retro decor) was along the side street across from the Mexican restaurant but still quiet enough. Beds were firm and comfortable and everything we needed was provided. There is a charming interior courtyard (right outside our door) adjacent to the breakfast room which we didn't use due to the cool weather but it looked like a great place to sit with morning coffee. Convenient parking. Staff was always pleasant helpful. In all, just what we wanted, reasonable rate, great location, a bit of character!", "title": "Funky by the sea.", "user": "egerstan", "date": "March 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 154358245}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Maybe you should never go back to somewhere that you've had an exceptional stay in the past. How could it ever meet the impossible standards set by your own fond memories? Well the Inn did a pretty good job! It's had a major re-model since our last stay - funky 60's retro which was a little over the top for our liking however the basics haven't changed. It's still a good location not far from LAX and within walking distance to Venice pier, the canals and Marina del Rey. Don't be fooled by the name - it's not in the hub of Venice Beach, and it's further than we remembered from Santa Monica. There are numerous bars and restaurants at the foot of Washington which, as it turns out, wasn't as much fun to be around on a weekend. We're many years past the \"margaritas for breakfast\" stage of our lives and found the beach bash scene more annoying than entertaining. Wouldn't have been fun with kids either! But don't let that stop you checking into the Inn. Nice, smaller hotel and part of a good group of \"boutique\" establishments called Pacifica Hotels. Check them out. Loved their Laguna Beach location too!", "title": "Return to the Inn", "user": "ontheroad2006", "date": "March 10, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 154213294}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I found the Inn at Venice Beach on TripAdvisor and I the rave reviews were right on. The newly refurbished room had a funky, hip decor (with our own personal Slinky). The bed was comfortable and I LOVED the pillows. Our room was along the front, or Washington Blvd., So, we heard traffic noise, but it wasn't annoying. The Inn does have interior rooms.", "title": "Excellent value", "user": "Bachlein7", "date": "March 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153630887}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "A very nice inn with upgraded rooms that had a good standard. The bathroom was kind of outdated, but not to bad. The inn has free parking which is great. Also a free continental breakfast which was surprisingly good. Free breakfast at hotels are usually poor, but this one was not to bad with fresh juice and several types of bread. The location is great just a few minutes walk from crazy venice beach. We had an evening walk in the canal area straight behind the hotel, that was a very nice walk and very peaceful.", "title": "Good location, nice rooms", "user": "brister", "date": "April 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 158082503}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Great location, kind service, close to the sea, peaceful area and friendly staff, especially Rasha for the nice service and information !", "title": "The Best !", "user": "Ivo40", "date": "April 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157675108}, {"rating": 4.0, "title": "Great Location", "text": "We will come back !", "user": "Craig H", "date": "April 8, 2013", "id": 156975376}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "best regards, Ivo, Hilde and Elias EVERS Belgium Europe", "title": "Great location", "helpfulness": 1, "user": "Stephen S", "date": "April 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 156493938}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed here as a family of 4. The room was large, spacious and a half reasonable view out towards the west. The hotel staff were very friendly and helpful. They offered us freshly baked biscuits each afternoon we stayed.", "title": "fun trip", "helpfulness": 1, "user": "tilly345", "date": "April 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156461283}, {"rating": 5.0, "title": "Lovely Hotel & great staff", "text": "My wife and I decided to spend a few days in LA to break up the journey back to the UK following a cruise we had taken. We chose the Inn at venice beach for its location and the reviews we had read on this site. We were not disappointed.", "helpfulness": 1, "user": "MariaSteve S", "date": "October 22, 2007", "id": 10233141}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "On arrival by taxi from LAX, and a little weary following a long night flight, we were greeted with a very warm welcome from the chap at the front desk. His name was Emad. A special thankyou to him for making our stay so enjoyable. He recommended lovely places to eat, advised us on trips and generally organised everything we required. First class.", "title": "Felt welcome from the moment we arrived.", "user": "fabians", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10095568, "likes": {"liked": "— Fantastic staff", "disliked": "— Street noise"}}, {"rating": 4.0, "title": "very nice and sweat", "text": "The location was everything we had hoped for, 150m from the pier and with plenty of resturants to choose from catering for all tastes. We arrived on a Sunday morning and decided to take a stroll down to Santa Monica. It took a couple of hours but we were bemused the whole way by the many street entertainers.", "user": "koiko", "date": "October 7, 2007", "id": 10048371}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "The hotel is a jem. Very clean, has a nice courtyard were you can have your complimentary breakfast and also provides free speciality coffee, fruit juice, cookies and fruit in the reception area.", "title": "Very nice hotel", "user": "Ocean G", "date": "September 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8726472, "likes": {"liked": "— Close to beach and great shops on Main Street & Abbot Kinney Blvd.", "disliked": "— Some noise, standard hotel pillows/mattress"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "Our first time in LA and we will go back and definitly stay at the Inn at Venice Beach.", "title": "Nice & close to beach", "user": "MinamiRinkan", "date": "September 8, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 8673508, "likes": {"liked": "— Price, location and staff."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "We've come before and we just reserved to return in April. A couple of blocks to good restaurants and the Venice boardwalk. Staff are always very professional and friendly. They have wi-fi now, and are almost finished some renovations. Clean, convenient, and priced for those of us who like small hotels but have small budgets too. Little details like cookies and fruit at the desk. Breakfast has many choices, and can be eaten in the outdoor Atrium on warm days. They charge $4 a day additional for parking, but that's minor compared to others in this area.", "title": "Still great", "user": "MsAudubon", "date": "March 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14396758, "likes": {"liked": "— Professionalism and location"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled solo", "text": "Yes, there was renovations going on while I was there. And I used to live in LA, so I didn't need any resources the average tourist might need.", "title": "loved my stay", "user": "TexasLemming", "date": "March 15, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14300041, "likes": {"liked": "— Location", "disliked": "— Currently under renovations"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "But the location, the amenities, the price - all combined made it a fantastic bargain.", "title": "Very Disappointing", "helpfulness": 1, "user": "annbg", "date": "March 12, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "location": 4.0, "rooms": 2.0}, "id": 14244094}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "3 Blocks from the beach (1 block from the canals), close to the airport, easy to get on the 405, easy to get onto Lincoln Blvd (and to Santa Monica), plenty of good restaurants within walking distance.", "title": "Don't Worry About Renovations, Still Great", "user": "maranasam", "date": "March 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14105707, "likes": {"liked": "— Location", "disliked": "— All good!!!!"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "It may not be for everybody, but it was perfect for me. I will stay there again.", "title": "Probably not again...", "user": "Emma1975", "date": "March 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 1.0}, "id": 13997759, "likes": {"liked": "— Location", "disliked": "— Rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We've stayed at the Inn for many years because it is a good deal and is within easy distance of the Getty Villa and the Getty Center - our favorite sites. I had heard of their renovation and was happily surprised with the personalized, bright, well lit room we stayed in. They really work to make your stay a pleasant one. Being a short walk from the Venice pier is a HUGE plus.", "title": "Great Renovation of a Classy Beach Hotel", "user": "JJtheScrivener", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161331310}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I was always happy with the Inn at Venice Beach - Now I'm a Fan!", "title": "Great place to stay on a great vacation in LA", "user": "NSG_13", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161138395}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed for a week here on our first visit to LA. So pleased we stayed at the Inn, the staff were so helpful, the rooms clean and comfortable and breakfast in the courtyard just a great way to start the day. Can't wait to come back to LA and to stay at the Inn again.", "title": "beach ambience with LA access", "user": "Nancy S", "date": "May 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159740358}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We thoroughly enjoyed our stay at the Inn. Extraordinary personalized customer service, including emails in advance asking if we needed recommendations for restaurants, tours, etc. The entire facility was very clean, reasonably-priced parking @$10/night was provided, and the gentleman who ran the adjacent bike shop in the building was very accomodating. The Inn is not far from the airport ($30 cab ride) and just a few blocks from the beach and the strand for walking/running/biking and all the crazy/fun activities. Access to a variety of restaurants within a few blocks was a plus. Our room faced the street in front and street noise kicked in during the day (but we were gone most of the time) and it quieted down surprisingly well at night. The Enterprise car rental place was not far away and we were able to rent a car for the day to go into LA to hit a few of the tourist sights. Be forewarned that car rental places generally close at noon on Saturday and are not open on Sunday, but cars can be returned to LAX just a few miles away 24/7. This cute, boutique hotel was a much better choice for us than an upscale, downtown hotel in the LA urban setting.", "title": "Great Little Hotel in Venice", "user": "Stephen B", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159364469}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Inn at Venice beach was the perfect place to recover from our international trip, excellent service, really nice rooms, and a good breakfast each morning. Staff were really friendly and helpful, parking was easy, really great value for money, handy to the beach, Santa Monica and Malibu.", "title": "Thanks to the Staff at Inn at Venice Beach", "user": "Petal W", "date": "April 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159182798}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Had a fabulous experience with the Inn at Venice Beach, I must compliment the staff on their exceptional customer service, general kindness and overall amazing attitude. Fabulous boutique hotel, newly renovated with charm & funk, quiet & clean. Could not say anything bad about this charming hotel!", "title": "Great Experience!", "user": "francesca a", "date": "February 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153386910}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Gracious & helpful staff!", "title": "Great place for a quick layover in LA!", "user": "landxrover", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153332125}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Thank You Inn at Venice Beach for a lovely stay!", "title": "Best place in Venice", "user": "JJCMJR", "date": "February 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 153327658}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We really enjoyed our one night stay here. Hotel is clean with super friendly staff. They totally went out of their way to help us with a late checkout. Sometimes you feel like hotel staff are just putting on a smile for you but these people seemed to genuinely enjoy their jobs.", "title": "Great Hotel for a stopover", "user": "202marcol", "date": "February 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153077456}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "They had a really great breakfast. There’s not a ton of selection but what they do offer is of high quality. Really that’s much more important to us than having lots of different breakfast options.", "title": "Great little hotel near LAX", "user": "flebinski", "date": "February 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152902182}], "location": {"country": "United States", "city": "Los Angeles"}, "stars": 3, "variance": {"poor": 12, "average": 31, "very good": 169, "terrible": 11, "excellent": 169}, "aka": "Inn At Venice Beach Hotel Los Angeles", "slim_ranking": 0.0673076923077, "description": "This European-style Inn is within two blocks of Venice Beach and the Boardwalk, and Marina Del Rey is four blocks away. The hotel offers a daily Continental breakfast, wireless Internet access throughout the hotel, and a fitness center. Guestrooms at the Inn at Venice Beach include refrigerators, coffee/tea makers, cable/satellite TV, and in-room safes."}