{"user_rating": 5.0, "review_count": 42, "name": "Inn at Wintersun", "reviews": [{"rating": 5.0, "title": "One of the two best B&B's in North Carolina", "text": "My wife and I, who are fortunate to be able to choose relatively upscale locales and properties for vacations (though we're certainly not in any millionaires' club of exclusivity, by any stretch of the imagination), had the privilege of spending two nights recently in the Wintersun Suite at The Inn at Wintersun (in Fairview, NC, just a few minutes south of Asheville). I found the place on bbonline a couple years ago, and I knew right away I wanted to experience the Wintersun Suite, but it wasn't until just recently that the opportunity presented itself. (We were going to be in the Asheville area anyway on some other family business, and I figured we could afford the steep tab for the Suite if it was only going to be for the couple of nights we were going to be there.)", "helpfulness": 10, "user": "afrinl", "date": "June 20, 2005", "id": 3578457}, {"rating": 5.0, "stay_parameters": "Stayed January 2005", "text": "If there's one thing that needs to be said about The Inn at Wintersun, it's that their website (neither their listing on bbonline nor their own website) doesn't even *begin* to do the place justice. You have to see this place to believe it, because the text and few photos available on the web completely fail to convey the magic that's here. Words simply cannot adequately convey how exquisitely lovely -- and extraordinarily well maintained -- this property is (including both the acres and acres of grounds and the inn itself). If the owners want to increase occupancy to 100%, they simply need a better website that more convincingly demonstrates that guests absolutely will get their money's worth.", "title": "If you want privacy...this is the place.", "helpfulness": 9, "user": "CindynGA", "date": "July 1, 2004", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 2249107}, {"rating": 5.0, "title": "Fabulous", "text": "A word, too, about the interior decoration: I'm a guy and thus not ordinarily attuned to the finer points of interior decoration (as long as the structural timbers are covered with sheetrock, I'm happy), but I have to say, the interior decoration of the Inn is nothing short of magnificent. Again, words and photos fail -- you either have to see video or, far better, see it in person.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "December 28, 2002", "id": 829217}], "location": {"country": "United States"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 1, "excellent": 41}, "aka": "Inn At Wintersun Hotel Fairview", "slim_ranking": 1.0, "description": "Close to Asheville. Close to Perfect. \"Romantic Mountain Elegance\" Welcome to The Inn at WinterSun where you will be treated as part of our family. We hope to make your experience here as comfortable as you would feel in your own home. Start your morning with a delicious homemade breakfast prepared by Nina, the Innkeeper/Owner. Breakfast is served seven days a week at 9:00am in our Formal Dining Room.Don’t worry about all those extra calories because after indulging, you can easily work it off by enjoying the beauty of the estate. We are surrounded by 117 acres of wooded hiking trails, open meadows, creeks and streams.Yes, there are trout in Cane Creek, so remember to bring a fishing pole.You are always welcome in the kitchen should you like a snack… or pack a little picnic lunch to enjoy the peace and harmony of nature! Should you want to take a drive on the Blue Ridge Parkway, it's just 6 miles away, downtown Asheville is about 8 miles. There is so much to do and see in Asheville and the surrounding areas, you’ll always find plenty to do and explore. If you are hoping to recharge and get some peace and quiet, just stay at the Inn and enjoy the sounds of nature with a glass of wine on the Veranda."}