{"user_rating": 3.5, "review_count": 266, "name": "Inn on Destin Harbor", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "The Inn on Destin Harbor was a refreshing change and a great place to stay. Noelle was such a pleasent lady when she checked us in. It was just a pleasent experince with nice people!", "title": "diamond in the ruff", "user": "lawrence026", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103621843}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We were given VIP treatment! We just walked in and decided to stay based on the way we were treated by the staff at the front desk. We were given a warm greeting right when we opened the door to enter the hotel. The lobby and view were the best in Destin! If you can, pay the little extra and stay bay view - AMAZING! This hotel reminds me of walking into someones beach side home and you forget you are staying in a hotel. Kudos to Noelle for doing such a great job with her gracious Southern Hospitality. You rock!", "title": "THE STAFF ROCKS AND THE HOTEL SHOULD BE 5 STAR!", "user": "ablack2000", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 103002249}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "My family and I just checked in at The Inn on Destin Harbor. Noelle, at the front desk, was so sweet and helpful. Our room is pretty basic, but neat... But our view from our balcony overlooking the harbor is beautiful! For the money, we got much more than I expected! This place is a great deal. Plus, we LOVE that we got to bring our pet shih tzu with us!", "title": "Suce a pleasant surprise!", "user": "karabrakefield", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 102693981}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "First let me say the staff was WONDERFUL!!!! Friendly, helpful, informative etc... EXCELLENT STAFF! The rooms were older, but kept very clean. The views of the harbor are beautiful. I think every room has a balcony with chairs and a small table. I loved sitting on the balcony at night with all the lights and boats right below. They had a cute little beach with umbrellas and chairs and a nice pool area with chairs and tent/awning. Very cute and quaint! The pool and grounds looked very clean and well kept up. We had a small problem with the toilet and they sent someone up right away within 2 minutes! They let us check in several hours early after a long drive which was WONDERFUL! The rooms were not 4 star luxury but as I said very clean and well kept. I will definitely stay again!!! Quiet at night and parking was a breeze. Several restaurants and shopping within walking distance.", "title": "GREAT SERVICE - GREAT BREAKFAST - GREAT VIEWS", "user": "rcneal", "date": "March 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 102221745}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "This is the best place in Destin to stay! The rooms were very clean. Bed was very comfortable! Staff was nice and friendly and helpful! Beautiful view of the Destin Harbor. What a great way to wake up. Don't listen to all these bad reviews on this place. This place was great!!!!!", "title": "Best place in Destin!!!!!!", "user": "LadyChantie", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101529214}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "This hotel is walking distance to several nightspots which was exactly what my friends and I were looking for. However, the hotel is in need of some major fixing up.", "title": "Good location for resturants and bars but needs to be updated.", "user": "DuffyDo", "date": "May 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 109492391}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "The room we were originally given, had long black hair in the bathroom (sink and tub), the phone didn't work, one of the beds appeared to been slept in already and the sliding door to the balcony didn't work. The staff was quick to move us to another room, which was better than the first, but still left a little to be desired (i.e. this balcony door didn't open either) and just appeared old.", "title": "Expected better", "helpfulness": 1, "user": "Vis78759", "date": "May 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 109339222}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "The hotel servered it's purpose for this trip; however, in the future, we will stay elsewhere and just cab it to the bars/nighspots.", "title": "Great value in the right spot", "helpfulness": 2, "user": "NewOrleansSuzanne", "date": "May 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 107428430}, {"rating": 2.0, "stay_parameters": "Stayed April 2011", "text": "The first thing I noticed when we walked in to the lobby was the amazing view of Destin Harbor. The girl at the front desk was very nice and recommended some places to eat and sight see which worked out very well. Wednesdays they have free wine tasting which I read about but forgot, so that was a nice surprise. Our room was on the fifth floor and the view was fantastic. The bed in our room was one of the most comfortable King's we have slept on while away from home. Hotel location was close to all.", "title": "Not a roach motel, but certainly fell below the expectation.", "user": "TheGypsyTrail", "date": "May 2, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 106570813}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "There were some things that we felt could have been improved upon. The elevators were down for maintainance for a day. Being that our room was on the 5th floor, that was somewhat inconvenient. Added to this was the fact that no towels are provided poolside, another trip up to the 5th floor without elevators. Again, a small inconvenience, but an inconvenience none the less. I would assume that the clerk knew about the repairs when we checked in and could have mentioned that.", "title": "Try somewhere else", "helpfulness": 1, "user": "pickypickypicky", "date": "April 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 4.0, "rooms": 1.0, "location": 5.0}, "id": 106139425}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I have stayed at several mid-priced vacation properties in Destin on literally over 50 - 60 separate trips (about 150 - 200 nights) in the past 2-1/2 years while visiting with family. I and my daughters now stay at this boutique hotel most of the time.", "title": "Great value. Short walk to Harborwalk. Surrounded by good restaurants. Big bucks view. Very Friendly.", "helpfulness": 2, "user": "RePetetheDad", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 105953810}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "No value priced hotel is perfect compared to a real 5-star property, but this property has what it takes where it counts most and exceeds expectations in some categories. The harbor view is fantastic (isn't that the sort of thing we came for). The lobby and breakfast area, pool and small beach are very attractive and overlook the harbor. My young girls often enjoy watching the dolphins play in full view.", "title": "Stay Once and You'll Be Ready to Return Again and Again!", "user": "dakitten2", "date": "April 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104678646}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The staff is eager and very friendly and helpful. They have been very kind to my children. Ownership is very attentive and gives the property a real personality. Free wine bar on Wednesday eve and free champagne on Friday eve. Continental breakfast is just fine. Coffee is very good. Nice selection of teas.", "title": "Destin's best kept secret...", "user": "SteepleChase11", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104439296}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The rooms are a little dated (small older bathrooms and sliding doors that could work better) and ownership is upgrading where it is possible. There have been a few spotty housekeeping moments, but that is the exception. There has also been some genuine thoughtfulness. They called a plumber out on Easter Sunday to fix a problem in my room, so they care.", "title": "Wonderful Experience!", "user": "tj251", "date": "April 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 103893895}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "I personally enjoy meeting the other guests. There is an atmosphere of friendliness that is promoted and I have met many visitors from here and abroad. I noticed that many people are repeat visitors, so that tells me something. Some volunteer their appreciation of the hotel and it's staff.", "title": "Great service from people who really care", "user": "jcyaheardme", "date": "April 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103739714}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Ok. the location of this place is amazing. The views are incredible BUT the rooms are in need of some work. If minor details bother you, this is NOT the place to stay. The shower head is loose, no one has vaccumed in the corners for a LOOOOONG time, the WiFi router is in an unsightly jumble in the hallway and did not work consistently on our floor, and the bathrooms are tiny, but the price is good. Additionally, the free continental breakfast is average, we had to request housekeeping (and, even then, they only brought 2 towels and one washcloth), the couch in our room was dirty and the cushions were put in backwards, and we could hear the neighbors having sex through the paper-thin walls. Clearly, the management lacks emphasis on attention to detail. On a positive note, when I complained about the lack of housekeeping service, they took care of my requests and were pleasant about it. To sum it up, I would NOT stay here again, but the inadequacies did not ruin my trip either. Great place for someone on a budget who does not mind sacrificing some things - but I think you might be able to find a good deal elsewhere without having some of these issues that I had.", "title": "Think Twice", "user": "Lilysnap", "date": "March 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 100667080}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The Inn on Destin Harbor is the only place my wife and I will stay when visiting Destin. We are so thankful to the wonderful staff at the Inn for the world class service we've recieved for the past 3 years. Our room was always spotless and cleaned with care. Housekeeping was so kind to help me surprise my wife with an anniversary gift this year. Check-in was an absolute pleasure as always. The pool area was always clean and orderly with plenty of comfortable chairs. The sunset views from the Inn are the best in Destin. A nice glass of wine to sip while watching the sunset at the Inn is a world class experience. The Inn's location makes going out to dinner or for drinks so much easier. You are a short walk from anything you'll need or want. We went the entire day twice without ever getting in the car. Each year the experience gets better and we plan on returning for years to come.", "title": "Best Sunset, Rooms, Pool, and Value in Destin", "user": "Maroon0410", "date": "March 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99025195}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The Inn on Destin Harbor is great...the location is ideal, the amenities are fine and we had a really good time. They let us have a family reunion, basically, right in the lobby...there was never any tension from the staff and I would definitely go back again.", "title": "We Loved this Hotel...", "user": "khufu61", "date": "February 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 97590333}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Over 60 family members, from 7 different states came for a two day surprise Birthday party. The Management and Staff helped the organizer any way they could from suggesting a local bakery to doing what was needed behind the scenes setting up and helping to keep the out of state guests hidden until everyone arrived. Not to mention doing their best to keep track of all of us! As soon as breakfast was over on Saturday, we were allowed to transform their lobby and breakfast area into a 50's Soda Shoppe complete with wall murals. The party was from 3:00 to 9:00 P.M. and other guests staying at the Inn were welcome to join us.", "title": "All you have to do is ask ...", "user": "SantaClausHouston_TX", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 97528783}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The rooms were re-done since the last time we were there ~ freshly painted and new carpeting. The bathroom tile and fixtures looked new as well. The bed was just as comfy as the last visit!", "title": "Wonderful Experience", "user": "chyrilaz", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 97479312}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 31, "average": 34, "very good": 67, "terrible": 33, "excellent": 101}, "aka": "Inn On Destin Harbor Hotel", "slim_ranking": 0.578947368421, "detail_rating": {"service": 4.0, "cleanliness": 3.5, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "- Located in the heart of Destin, Florida, directly on Destin Harbor- Walking distance to award-winning Destin waterfront dining- Waterfront pool with spacious deck overlooking Destin Harbor- All rooms are non-smoking, each with a private balcony- Ever-changing panoramic views of Historic Destin HarborOffering Scenic Views and Sumptuous Service- Accommodations include complimentary continental breakfast with a waterfront view of the Destin Harbor- Perfectly located accommodations for the Destin hotel or motel traveler, ideally suited for leisure, military, or corporate travelers- Pet-friendly rooms are available, please ask when booking your room- 24-hour concierge service"}