{"user_rating": 4.5, "review_count": 343, "name": "Inn at Whitewell", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "and anyone else, too - if you can manage without air-conditioning and can cope without being near a shopping mall and feel like a taste of the Best of Idiosyncratic Britain, then I insist that you make a detour to this hostelry. It lies in one of the most beautiful and peaceful parts of the country half way between the English and Scottish capitals. Family-owned for decades, it is furnished with a random but interesting collection of pieces including a quirky selection of elaborate Victorian and Edwardian baths. The place is definitely stylish - it shelters under the 'shabby/chic' umbrella. Many rooms have working fireplaces. We called the hotel with our ETA and the peat fire in our room was burning merrily on arrival. There are books everywhere, Wifi is free (how dare hotels in the U.S. charge for that?), mobile reception is patchy - this place is remote. Few cars pass and it is heaven to experience deep quiet at night. Service is a delight - the warmth and natural friendliness of the staff are in marked contrast to the hotel-school taught cool efficiency. The food is excellent and sourced locally and reception is housed in a cramped corner of what appears to be, and is, a vintners. You are unlikely to have stayed anywhere like this before. I cannot commend it enough for its originality and charm. The bed was comfortable, linen was good, towels plentiful, Molton Brown 'products', but you must be prepared for worn carpets, scuffed skirting boards, creaking floors. Higgledy piggledy it may well be but the Inn at Whitewell, if you have a soul, will give you untold pleasure.", "title": "Any Americans out there, listen up -", "helpfulness": 1, "user": "Shellfire", "date": "March 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155304283}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "3rd visit, we're about 60 miles away & stopped over for wedding anniversary. Peat fire, huge comfy bed. Fab restaurant food, etc etc.... other reviewers have said it all.", "title": "and reeeeeeeee lax !", "user": "Rufus1952", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155229774}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "Not cheap but staff attitude & quality shines through ........ having said that the bar food is fab too, so if passing call in & treat yourself.", "title": "Wow!! Everything about this place is amazing!", "user": "Nicola L", "date": "March 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154959897}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "A word about the local roads ... LCC must have lost the repairs file, broken up surfaces and potholes gallore (end Feb 2013), managed to break a spring on return journey .....", "title": "An absolute gem", "user": "Pam N", "date": "March 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154760942}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This place leaves me speechless!", "title": "Beautiful place with fab food!", "helpfulness": 2, "user": "bigmacsmallfries", "date": "March 6, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 153899547}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "My wife and I went to the Inn a month ago with my parents - we were so impressed we went there again last night with our boys. We ate in the bar area next to the log fire and over a couple of pints of excellent ale we perused the local menu.", "title": "Eating at the Inn", "user": "Bruce_Preston", "date": "April 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "service": 5.0}, "id": 157500972}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The service was swift, food piping hot and very, very tasty. We could not fault anything here.", "title": "Great Stay", "helpfulness": 2, "user": "jmys", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157107898}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I hadn't been back to this Inn for 20 years and had never stayed. We needed a break so there was a fair bit riding on it. The stay, food and location were brilliant. We loved the reception being in the midst of a fine wine store - way too tempting. Dinner was great (roast monkfish so tender) but the real star was the room. We decided the view was a painting as it was so idyllic. Toiletries, linen and furniture all 5 star. And all this for less than the corporate 4 star anonymity we had endured in London the week before. See you soon.", "title": "A Great Experience", "helpfulness": 1, "user": "William4599", "date": "April 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157088235}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We decided to stay at this Inn based on the recommendations of other Tripadvisor reviewers and were certainly not disappointed. The room was a good size with a four poster bed, an open fireplace and the most amazing bathroom imaginable.", "title": "Retirement Lunch", "user": "martiboy123", "date": "April 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 156987736}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "We were expecting a great experience and that is what we enjoyed.", "title": "A little gem", "user": "iano_11", "date": "April 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 156975407}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed three nights after originally booking two. We spent one night in Room 3, two in Room 5, and both were wonderful with fantastic views and loads of space, not to mention really great objects to look at in each room. Also appreciated the MP3 player.", "title": "Loved it", "user": "JeffStranks", "date": "April 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158894457}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We loved the relaxed atmosphere - the bar, the restaurant, the reception / wine shop, the pictures and posters and cuttings everywhere, the log fires (unfortunately needed, even though it was mid-April). The food is not cheap but very good quality, we thought.", "title": "Nice room average food", "helpfulness": 1, "user": "gary t", "date": "April 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0}, "id": 158201124}, {"rating": 4.0, "title": "What a find!", "text": "Would go back in a heartbeat. Don't go here if you're into chain hotels/bars - but do go here if you want to have a really relaxing time in a quite unique place.", "user": "Matthew C", "date": "April 18, 2013", "id": 158144106}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Been to the Inn at Whitewell many times over the years and eaten there, but last night I felt that standards are slipping. Upon arrival I asked for a drink with a lemonade mixer - I don't know how to say this but there was no lemonade in the building!", "title": "total relaxation", "helpfulness": 1, "user": "Helen D", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158113917}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Ordered my steak medium rare and asked for a 10 minute gap between starter and main, received my main meal but the steak was cooked medium not as I asked for and in my view the chips were brought in ready prepared - i.e frozen or chilled. I was assured by a staff member that the chips were prepared from a potato and put through a machine but given that I have bought frozen and chilled chips by the tonne over the years I am not too sure. This is not acceptable for a dish that cost nearly £20 - I may as well go to a well known national chain of pubs/restaurant and go on their steak night of which I have had a better meal. On a plus side the staff were very attentive and the hot salad was very good. Overall average.", "title": "So relaxing", "helpfulness": 1, "user": "JanetW49", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157643538}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Just had a couple of days' break here, and it's a lovely place. If you want to get away from a hectic world for a bit, come here. It's blissfully peaceful with beautiful rooms surrounded by some gorgeous countryside. The Inn itself is really welcoming, all the staff are efficient and friendly, and nothing is too much trouble. We ate in the bar each night, simply because after a long afternoon walk we were too tired to get our act together and make ourselves a little more respectable for the restaurant..and all our meals were lovely - the mussels were some of the best we've ever had. There are walks or rambles across fells and through farmyards right on the doorstep - it's great that farmers still trust the public to use their land responsibly. The Inn is dog-friendly and child-friendly, ideal for all, young or old, who want to do as much or as little as possible. Go and enjoy.", "title": "Lovely place, lovely people, lovely break. Go and enjoy!", "user": "swamp-pokey", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156702058}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Wanting a ride out over Easter ,for lunch, with the dog , we picked the \"INN\" out of a guide to dog friendly places. We were delighted with everything about the Inn. The staff , food , surroundings were wonderful . I cannot speak highly enough of the welcome to us and the dog. We will be back to stay over.", "title": "Very Dog Friendly", "user": "Mancunian_13", "date": "April 4, 2013", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0}, "id": 156600255}, {"rating": 5.0, "title": "Definition of relaxation", "text": "We got married here 2 years ago and went back last year for our anniversary and have just come back from celebrating our 2nd anniversary here. It is pure heaven. There are many of the same staff still there who give excellent service-nothing is too much trouble. The setting is idyllic. The decor works so well-old matches modern in perfect harmony. We stayed in room 16 which had perfect views-waking up to it is wonderful. As for the food it is amazing but get to dinner early if you are dining in the bar as it is so popular with residents and locals. We went down about 7pm and they don't even take orders till 7-30pm but there were only 2 tables left. Our table was \"creaky\" which all adds to the character and ambience of the place. I haven't had the fish pie here for a while but it was as good as ever. All in all the Bowman family provide us with a pure gem of a place to remember our very special day every year-thank you!!", "user": "Steve E", "date": "April 2, 2013", "id": 156373022}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed at The Inn at Whitewell December 20th 2012 in the top floor suite. My fiance had spoken to the staff before we arrived to have them light the fire in the lounge area which was lovely when we got in on a cold day.", "title": "Engagement Stay", "user": "artyniki", "date": "April 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156241375}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We had a lovely lunch there and enjoyed a fish pie i think the hotel is pretty famous for! We asked the manager if she knew of any local walks and she personally guided us through the route from the back of the hotel.", "title": "I just wish we lived closer!", "user": "PennyPurples", "date": "April 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156228934}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 18, "average": 30, "very good": 78, "terrible": 8, "excellent": 209}, "aka": "Inn At Whitewell Hotel Whitewell", "slim_ranking": 1.0}