{"user_rating": 4.0, "review_count": 332, "name": "Inn at Pelican Bay", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We have stayed at this hotel 4 times and it is always the same great service. If you want a relaxing time this is the place to visit. This small boutique hotel offers value for money. The rooms are spacious and very clean. The staff are very helpful. The pool area has recently been refurbished and is very peaceful and a calming area to relax especially with the lake and fountain to look onto. Breakfast offers a good selection for a continental buffet. You are only a mile away from the beach and there are plenty of restaurants and shops very close by. I would recommend this hotel.", "title": "Excellent hotel", "user": "Foreversunshine1", "date": "December 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148314016}, {"rating": 3.0, "title": "Disappointing", "text": "Booked this as a boutique hotel. Not sure that they've got the definition right. It has many rooms. We were upgraded to a lake view room for our anniversary. But it wasn't great opposite the lift shaft and by the maids store room. Very noisy. We complained and they grudgingly moved us at 11.30 at night to one of the best rooms, which was better but not worth$289 plus tax. Breakfast was fine, but a very cramped eating area. Staff service was indifferent to the point of surliness. We checked out early.", "user": "Carosnave", "date": "December 29, 2012", "id": 148308630}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Recently, my wife and I visited friends in Naples, Florida. We stayed at the Inn at Pelican Bay for three nights, never having stayed there before. The property is pristine and the amenities are first class. Free breakfast each morning and soft drinks and beer at night. The rooms are good size and the pool and hot tub are great. We had a lakeside room which offered a beautiful view of a fountain within a lake. The property is about one mile from Vanderbilt beach and there is a free shuttle from the inn to the beach. The inn is located adjacent to a huge plaza with shops and restaurants a mere 5 minute walk away. Also, it is only about a 20 minute drive from the Ft. Myers airport. Our price was $170/night for a lakeside room and that includes tax. I highly recommend this boutique hotel for travelers to the Naples area.", "title": "Excellent location and amenities", "helpfulness": 1, "user": "mpd444", "date": "November 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145592134}, {"rating": 3.0, "stay_parameters": "Stayed November 2012", "text": "Stayed at this hotel for 2 nights. We were given a room on the first floor. Room had a musty smell to it. They were also doing painting/construction and it was a little noisy during our first day. Luckily, we didn't spend too much time in the room. Also, when we arrived back to the hotel at 215pm after spending the day out in Naples, our room had still not been cleaned. When I inquired at the front desk, Ron informed me that \"housekeeping works all day\" and that was the end of it. I had to specifically ask to have our room cleaned, which they did within 15 minutes. Overall, I was a bit disappointed with our short stay and expected more based on the prior reviews. By the way, breakfast was nice.", "title": "Disappointed", "helpfulness": 2, "user": "las1138", "date": "November 11, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 145132770}, {"rating": 5.0, "stay_parameters": "Stayed November 2012", "text": "This hotel was very nice for the price I paid. Hotel grounds were beautiful and rich with color. Hotel staff are very nice and accommodating. Our room was very spacious and tastefully decorated...and very clean! The continental breakfast was just right.", "title": "Wonderful boutique hotel!", "helpfulness": 1, "user": "Stacy B", "date": "November 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144453545}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Inn at Pelican Bay gets 4 stars on many sites, and has many positive attributes. It however, does have some areas that fall short, and depending on your personal preferences, you could find your expectations not being met.", "title": "This is a property you need to check carefully before booking", "helpfulness": 2, "user": "joylama", "date": "January 14, 2013", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 149677913}, {"rating": 1.0, "title": "Never again", "text": "First, the hotel is conveniently located in North Naples, in the Vanderbilt Beach area. It is about a 45 min drive from RSW airport in Fort Myers. The parking lot (parking is free) is not very clearly marked from the US 41 (which is the larger road) or Vanderbilt Road and appeared to require a U-Turn to get into the property, though we might have missed a more direct entrance.", "helpfulness": 2, "user": "japple2", "date": "January 12, 2013", "id": 149535487}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The property is neatly kept and adjacent to a local shopping center with a drugstore, grocery store and a few restaurants within walking distance. The lobby is small-ish, but nicely furnished with artwork consistent with a 3-4 star property. There is a restaurant and pool area behind the main lobby. The pool is also not large, but it appeared nicely renovated and had room to sit and dine or lounge. The property backs on to a manmade lake with a fountain, and while not an unattractive view, it is not anything noteworthy.", "title": "Needs updating", "user": "Takeachance270", "date": "January 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 149079110}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Staff at check-in were friendly and efficient, there are two stations at check in so there could be a bit of wait if more than two people are ahead of you, particularly if one has questions. The hallways and elevators are clean and updated nicely.", "title": "Nice hotel, close to Mercado", "user": "nrush", "date": "January 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 149031422}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The rooms, however, appear to have missed the update. The room was large enough, but felt like a motel instead of a 4 star hotel. Everything was clean, but the furnishings were bland and felt cheap. The bedding appeared worn, and the bed was not comfortable. The heating/cooling unit was a typical motel wall unit type. The bathroom was the area that dissappointed the most. There was a shower, separate tub, and toilet in a tiled room with a door, and then a long sink with a formica countertop outside that room with a closet. There was no safe in the room. The fixtures were clearly low end as was the closet hardware.", "title": "Best Around", "user": "jar1807", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148743233}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Perfect boutique hotel - staff is wonderful - rooms are spacious and exceptionally clean - balconies overlook the pool or lake. Close to everything in Naples including the beach with complimentary shuttle to beach - definitely will return!", "title": "Best kept secret in Naples", "user": "Debbi T", "date": "September 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141689765}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Debbi", "title": "6-day stay was excellent!", "helpfulness": 2, "user": "Schnauzer-guy", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141345333}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We selected the Inn at Pelican Bay based on reviews found prior to our trip. My wife and I loved the place. It was very clean and well maintained, even the stairways which we tend to use in lieu of elevators. There is a shuttle to the beach or you can take your car and park ($8 all day) in a covered lot next to the beach. The lot attendant leaves at 5pm so the garage is open for free after that time. Nice to drive down and watch the sunset.", "title": "Cindy B", "helpfulness": 1, "user": "Cindy R", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 140715964}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The free breakfast was nice but typical of a free breakfast. (hard boiled eggs, fresh waffles, fresh fruit salad, yogurt, cereal, nice selection of donuts, breads and bagels, juices, coffee) Free local and USA today. We're retired so free is nice.", "title": "Much better than expected for the money", "helpfulness": 2, "user": "Bradley B", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140447576}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Staff was very helpful, rooms were kept very nice throughout our stay. Pool was clean and not chemically overdosed (ultraviolet treatment maybe) towels available poolside.", "title": "Excellent quality for price", "helpfulness": 1, "user": "Randy A", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140443174}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Spendt two nights at the Inn at Pelican Bay for a little get away.", "title": "A little gem", "helpfulness": 1, "user": "Suziejacuzzi", "date": "October 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143861354}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The facility is about 15 years old, but is continually upgraded and very well maintained. The room we had was spacious with a very comfortable King size bed, along with a microwave, refrigerator, couch and desk. It was tastefully decorated and very clean. They offer afernoon tea - which is tea, coffee and cookies. The continental breakfast is typical - make your own waffles, fresh fruit, cereal, yogurt, hard boiled eggs, but includes a lot of yummy fresh pastries, breads, bagels and juices. There is a small bar open in the evenings. It has a small but lovely pool, along with a hot tub. It's not a resort where you would bring children or spend a week, but it is very comfortable to spend a few nights. It is located across the street from the Mercado - shopping with restaurants and a movie theatre. The Inn is a great place to relax and be close to all the Naples action. You can't go wrong.", "title": "DO NOT HAVE YOUR WEDDING HERE!", "helpfulness": 3, "user": "Rachel S", "date": "October 10, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 142487733}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I have never complained about a hotel before but I could not help myself this time. I have never met a more rude staff, unorganized management than I have experienced here. THe day of our wedding there were absolutely no managers present. As we came in from our offsite ceremony- the front desk staff stopped us in the hallway asking for a credit card for the bar.They wouldn't allow us to go up to our room without it. My newly husband had to go outside to all of the guests during our cocktail hour and find a credit card amongst our family members because they wouldn't allow us to get it from our hotel room. I have NEVER experienced such a horrible, rude, inconsiderate, disorganized hotel and staff in my life. I have traveled all over the world and I had to warn any brides- to be about this. I spoke to the hotel manager the next day and expressed my concerns quietly and he was defensive and unapologetic. So instead of celebrating our anniversary there next year we will never be going back there. I wish corporate would go there and look into how they run their venues.", "title": "Getaway", "user": "BrendaHefty", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142380973}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "The size of the hotel seemed perfect and the elegance of not only the common spaces but also the rooms was so inviting and comfortable. The setting and location were perfect as well. We wanted to be near the shore, the Naples art museum and preferred restaurants and shopping.", "title": "Comfortable and Low Profile", "user": "Mike B", "date": "October 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142149148}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "This week I'm in Naples, FL for business and staying here. I prefer boutique hotels over places like the Ritz Carlton, and this was the perfect choice.", "title": "Quiet and Comfortable", "helpfulness": 1, "user": "IAMAPI", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141902230}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 18, "average": 31, "very good": 99, "terrible": 15, "excellent": 169}, "aka": "Inn At Pelican Bay Hotel Naples", "slim_ranking": 0.423728813559, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "The Inn at Pelican Bay, Naples Premier Boutique Hotel is located in the prestigious North Naples community of Pelican Bay. Nestled between both Naples Ritz Carlton Resort Hotels places the INN at Pelican Bay blocks from Vanderbilt Beach and one block from Naples newest shopping and dining district the Mercato! Guests at this boutique hotel can enjoy upscale amenities, impeccable hospitality service, and tropical landscaping. The Inn at Pelican Bay also offers daily beach transportation, hot breakfast served lakeside, wifi, newspapers, full liquor lounge, on site parking, local calls, private lakeside terrace, perfect for business or social events."}