{"user_rating": 4.5, "review_count": 1048, "name": "Inn on Biltmore Estate", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I just returned from a long weekend at the Inn on Biltmore. From the time we arrived, we experienced amazing service. The accomodations were luxurious and so comfortable. We booked a Premier King room which is a little larger than their average room. When we arrived we were offered a mountain view room wheich was perfect. We enjoyed the breakfast buffet in the main dining room each day. It was delicious! Having unlimited access to the Biltmore Estate during our stay was a nice perk. My biggest complaint (and it's not that big at all) is that there was no where to sit and read a book outside and not be completely in the sun. The beautiful rocking chair porch is used for dining after 11 am. The reason for our trip was to celebrate my completion of radiation for breast cancer. The radiation has caused my skin to be extremely sensitive to the sun. I would have loved a shady place to be outside. But really, thats just a small complaint. We had an amazing time and look forward to returning in the future.", "title": "Mountain Paradise", "user": "thechandlers", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138734122}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Drive through the gates and following the winding road past the security checkpoint to the Inn on Biltmore Estate. The setting is magnificent and convenient for those wanting to tour the Biltmore estate. The rooms are nicely appointed though somewhat dated. The flat screen TV is hidden in a large wooden piece of furniture. The shower had great water pressure on the seventh floor. Shower curtain was straight and not bowed out, giving a slightly claustrophobic feeling that even most Hampton Inns now avoid. Bed was very comfortable, the room quiet through the night.", "title": "Location, location, location", "helpfulness": 5, "user": "carotidguy", "date": "August 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138719106}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Enjoy a drink or casual dining in the bar/lounge on the lobby level. I recommend outside weather permitting to enjoy the views and sunset.", "title": "Once is enough", "helpfulness": 6, "user": "COmomma77", "date": "August 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 138676875}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Time constraints did not allow us to enjoy the spa on the property.", "title": "Modern American luxury with a genuine European feel...", "helpfulness": 2, "user": "NCDawgFan", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138570949}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Concierge assistance was spotty. Our first night we were not told that there was a tasting menu in the more formal dining area. This menu changes on Thursdays. They did recommend a great diner establishment: Corner Kitchen in Biltmore Village just outside the main gates.", "title": "Very nice hotel but noisey hallway", "helpfulness": 2, "user": "traceygirl", "date": "August 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 138528382}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled solo", "text": "For the views, friendly professional staff, amentities, food and after hours access to the Biltmore Estate, it is one of my favorite places to visit and stay.", "title": "Well worth the price.", "helpfulness": 1, "user": "James M", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138120534}, {"rating": 1.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "It is like being a guest of the origonal owner of the Estate,G.W. Vanderbilt. The decendants, the Cecil's, still live on the Estate and oversee all elements of operations. They provide numerious activites to see and do both at the Inn and the Estate itself.", "title": "Pretty ... Awful", "helpfulness": 7, "user": "Galen S", "date": "August 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 137952624}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "This hotel has a lovely exterior and nice view. The grounds are very nice. The interior common spaces are clean and attractive facades, finishes are nice but largely fake. It feels a lot like Disneyland.", "title": "Next best thing to staying at The Biltmore House", "helpfulness": 1, "user": "wlrlwr", "date": "August 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137676619}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The rooms are small and poorly appointed for a 5 star hotel. I stayed in a room with two double beds. The double beds were terrible! Hard, unsupportive and the springs were pokey. The bed was so bad that after several hours of tossing and turning and trying to get comfortable I gave up and went for a walk. The night manager was very nice and promised to have the mattresses in our room changed out. She said no one had ever complained that the mattresses were hard (she said people often complain the beds are too soft). Housekeeping however refused to change the mattresses which came out after they had lied and said the mattresses were already changed. They insisted all the mattresses were the same. Instead they brought a thin low quality feather duvet to place over the mattress (think a layer of feather on concrete, it was worse than that!)", "title": "Asheville Biltmore Great 1st Class Hotel", "helpfulness": 2, "user": "Lakehouse258", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137577683}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Should have checked out right then but I tried to make it work, didn’t sleep at all again. When I let the manager know that we were checking out early and why they initially refused to refund my third nights stay, then eventually refunded 1/3 of one nights stay and expected me to feel grateful they did not charge me an additional nights fee for early check out.", "title": "Great Hotel", "helpfulness": 2, "user": "Fltraveler31", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137541545}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Our recent (Aug 22-26) visit was just as awe inspiring as our last visit in Aug of 2009. The Inn and the Estate should be on everyone's Bucket List. The whole operation is managed in an outstanding manner. The Staff and amenities topped anything we have seen in Europe. Kudos. Looking forward to our next visit. The Tiffany exhibit located at Antler Village was outstanding and was included in the price of our room reservation as well a valet parking, shuttle service to and from the Estate.", "title": "Back again and looking forward to next visit", "helpfulness": 1, "user": "vacationer209", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117554135}, {"rating": 5.0, "title": "Just what we were looking for", "text": "After coming from the Grove Park Inn (wonderful hotel, by the way, just not the rooms--see my other review), the Inn on Biltmore was a welcome haven. The room was fantastic: it was spacious, beautiful, had a giant bathroom with a great jet tub, and a perfect bed. They upgraded us to a mountain view with a balcony, which I wholeheartedly recommend. It was so nice to sit out there with a cocktail at sunset before dinner and coffee in your robe in the morning.", "helpfulness": 2, "user": "ellaviaja", "date": "August 29, 2011", "id": 117430001}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Aside from the room, I was surprised at how much there was to do on the grounds--certainly too much to do for this visit, so I'm hoping to come back someday, because when we were on the grounds, we spent most of our time in our room. I would think you could stay here for a long weekend and never leave the grounds and never get bored. I was here for less time than that and so I certainly didn't get bored.", "title": "We'll be back!", "helpfulness": 2, "user": "Julia R", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117414563}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We didn't eat on the grounds except for room service breakfast, which was as good as could be expected for room service breakfast (i.e. just fine--nothing extraordinary). For the other meals, we ventured out to Asheville and the Highlands. Do note that the Highlands is a ways from Asheville, but is nice if you're in the Highlands for the day, have dinner, and then come back to the Inn. On the Verandah in the Highlands has a nice, intimate setting with great food.", "title": "Everything was Impeccable", "user": "kjchavis", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117403770}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Overall, the Inn was excellent, and I am already looking forward to returning someday.", "title": "The dining room was fabulous!", "user": "SalemToesocks", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 117277248}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The rooms were very nice, but the real plus is the wonderful outdoor seating overlooking the wispy blue mountains in the distance. So relaxing, and friendly. I was there with three teens and they loved the workout facility, and the circular outdoor pool and hot tub. Very nice rooms, very nice grounds. Friendly staff, especially in the shops.", "title": "Southern Hospitality", "helpfulness": 14, "user": "bouldertraveller", "date": "July 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3685576}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "The food we ordered in the library, sandwiches and desserts, were not up to the standards we were experiencing everywhere else. They should make sure the offerings are fresh and the best quality breads and salads they can find. As is, we'd suggest skipping snacks and enjoy a nice meal downstairs at the restaurant instead.", "title": "Beyond all our expectations", "helpfulness": 11, "user": "zolar16", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3655417}, {"rating": 5.0, "title": "The beautiful Inn at Biltmore.......", "text": "A glass of Biltmore Reserve chardonnay on the palazza, or \"porch\" will make up for that small downfall. Can't wait to return with my husband for a few days in the \"other\"mountains.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 29, 2005", "id": 3620597}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "My husband and I booked a balcony room for seven nights at the Inn for our honeymoon. From the moment we pulled into the driveway of the hotel, we felt privileged and pampered. We had a beautiful view of the vineyard and the mountains. The lobby and bar area are so elegant, and every outdoor area had a wonderful view. Our room was clean and bright, and the bathroom is huge. Service was impeccable; everyone called us by name, and we loved how we could call Valet and have our car waiting when we came downstairs. The concierge was so helpful, and we got driving directions for our day trips and restaurant recommendations from them. The Estate shuttle runs on time, but we found it faster to drive to the House ourselves than to take the shuttle. If you come outside and find you've missed it, you'll be waiting another 15 minutes for the next one. That's more than enough time to hop in your car, if you have one, and go wherever you want to go on the property.", "title": "an incredible experience", "helpfulness": 5, "user": "jbtraveller2000", "date": "June 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3615999}, {"rating": 5.0, "title": "The ONLY place to stay in Asheville!!", "text": "One downside: we thought the food offered at the Bistro and the Dining Room (for lunch and dinner only) was a little too trendy for our tastes. However, we found many great restaurants nearby, like the Tupelo Honey Cafe, Mayfel's, La Paz Cantina, and The Greenery. Breakfast in the Dining Room is wonderful, and months later, I still find myself wishing I'd asked for the recipe for the Orange French Toast Strata. Don't miss tea in the Library, it's worth every penny! We are looking forward to our next trip to Asheville and our next stay at the Inn on Biltmore Estate.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "June 20, 2005", "id": 3576547}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Recently had a wonderful stay at the inn. I booked the estate escape package which included a great breakfast buffet, valet parking, estate transportation and estate admission for the entire stay. I thought this was a good value. The room was tastefully decorated, very clean and comfortable. Service was top notch with all of the staff being extremely friendly and helpful. We ate in the dIning room, library, Cedric's and the Bistro. Meals were a little pricey but always delicious. Overall, an incredible stay and look forward to returning.", "title": "the perfect weekend", "user": "docscott17", "date": "August 25, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117233998}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My husband and I went for our 25th Wedding Anniversary. I went with friends for Candlelight Christmas last December and wanted to take him back for our anniversary. It was a splendid trip. Our room was great and all the staff were great. We toured the house, ate at The Stable, had tea at the Inn. The breakfast buffet was included in our package along with a tour of the estate and a behind the scenes butler's tour.", "title": "We had a marvelous time!", "user": "JennRoteWill", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117203596}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I love the Inn and plan on taking my hubby to Candlelight Christmas in the future.", "title": "Absolutely Beautiful!!!", "helpfulness": 1, "user": "buddyl158", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117187231}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed for three nights at the Inn on Biltmore from 16-19 August 2011. THe hotel is gorgeous, the rooms well kept and the service and friendliness of the staff was outstanding! In the three days we were there, we never left the estate as we had originally planned. There is so much to do and the surroundings are just beautiful. My sister-in-law had a massage in the spa which she raved about. There are numerous activities on the estate as well as restaurants in the hotel and on the estate. The food prices are surprisingly reasonable - especially for a resort. Bottom line-- we can't wait to go back again.", "title": "A perfect 10th wedding anniversary!", "helpfulness": 1, "user": "LizCincinnatiOH", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117143761}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "My husband and I stayed here for our tenth wedding anniversary this year, and we were thrilled with our romantic getaway package. We enjoyed dinner, a bottle of champagne, breakfast on the patio, a tour of the estate, and a walk around the vineyards. The restaurant was one of the best dinners we have ever had, and we felt pampered throughout our stay. We look forward to returning for another special occasion in the near future.", "title": "Worth Extra to stay on the Estate", "user": "CMMNYC", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 117054114}, {"rating": 5.0, "title": "A great Stay", "text": "Can't remember the year but it was the first of the Hotel opening and it was in November. My wife and I needed to get a way for a nice week-end. We had been to the Biltmore Estate before but now they had a hotel on the site location. We booked the tower suite or room with the balcony and it was worth every penny. The view was great with the view of the vineyard and winery, the geese flying passed and all the other fall colors. This was the most we had ever spend on a two night stay but we both feel it was worth it and will return some day.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "November 11, 2005", "id": 4105527}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "Stan Phillips", "title": "Very expensive/worth the price?", "helpfulness": 26, "user": "Charlotte W", "date": "September 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 4.0}, "id": 3844205}, {"rating": 5.0, "title": "Once again, Wonderful!", "text": "Palm Harbor, Florida", "helpfulness": 13, "user": "A TripAdvisor user", "date": "August 23, 2005", "id": 3801335}, {"rating": 5.0, "title": "Great service and facilities", "text": "The Inn is very expensive. We purchased the Vanderbilt package which meant we were supposed to have the best of everything. I enjoyed my private tour of the Biltmore Estate very much. My guide was very attentive, and offered to taylor the tour to my interests.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "August 13, 2005", "id": 3759482}, {"rating": 3.0, "title": "Very small pool, food is not really fantastic", "text": "My husband found the site transportation haphazard at best. Some van operators drove pokey smokey while others took the hair pin turns so fast you'd have thought you were at Nascar. Also vans were very hot..it was July afterall. We should have had transportation with a/c with what we were paying!", "helpfulness": 13, "user": "A TripAdvisor user", "date": "August 9, 2005", "id": 3747802}, {"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "We spent three spring nights at the Inn on the Biltmore Estate, and found it pleasant in most ways. The handsome new/old architecture was well in keeping with the rest of the Estate's history, and seemed to encourage interaction between guests. I was fascinated to see people playing board games by the fire in the parlor, rather than hiding out in their rooms. The proximity to gardens and miles of footpaths was lovely. Staff was, without exception, very courteous and accommodating. The room was quite comfortable, the shower separate from the jacuzzi-tub was a nice touch, the amenities were ample, the parking lot view was-- a parking lot view. (somebody's got to have those rooms, right?) But in its favor, there was a nice meadow of daisies on the other side of it.", "title": "Inn on the Biltmore Estate", "helpfulness": 14, "user": "ATR", "date": "May 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3510425}, {"rating": 5.0, "title": "Gorgeous!", "text": "A meal at the winery's Bistro was somewhat disappointing; very nice atmosphere and decent service, but we didn't love the food. In our opinion, and we consider ourselves reasonably sophisticated diners, it tried too hard to be imaginative, and succeeded in being merely startling.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "May 20, 2005", "id": 3488660}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "My main beef with the Inn is the tacky nickel-and-diming. Have a pocket full of dollar bills when you check in- and keep them handy. Everybody expects a tip. Want to make a phone call? Fifty cents. Want internet? $12/night--plus a $15 deposit for the loan of a connector cable. Want movies? That's more, too. It seems to me a hotel that charges several hundred dollars a night should pay the help sufficiently well that tips are not expected. If it costs an extra $10 a day, I'd rather pay it, than have to decide how much is appropriate for showing me where the light switch is. Furthermore, the hotel should throw phone service, movies, and hookups in as part of the service they provide, a way of letting guests feel pampered, not having to decide, 'do I have $12 worth of e-mail to check today?'", "title": "2004 Damsels in De-Stress package", "helpfulness": 9, "user": "joonbugmaryland", "date": "April 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3401383}, {"rating": 2.0, "stay_parameters": "Stayed April 2005", "text": "Partly because I grew weary of the chintzy policies, I decided to move to the Grove Park Inn for the rest of my stay in Asheville. Ahhhhhhh.", "title": "Great potential, not quite there yet.", "helpfulness": 47, "user": "mciordan", "date": "April 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 3395752}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "This is the perfect example of luxary! The Inn is beautiful and spacious, with wonderful dining. We purchased a package and ate in the Dining Room one night, at the Bistro located in the Winery the next, and the food and service in both were exquisite! Such a lovely, romantic place to stay! The room was beautiful, with a large whirlpool tub and our balcony looked over the winery, so special. I highly recommend the Inn for a pampering time!", "title": "Romantic 25th Anniversary @ The Biltmore", "helpfulness": 21, "user": "gret", "date": "March 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3302846}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Our room was a tad smaller than we would have preferred. Very livable though.", "title": "It's all about service!", "user": "Ben P", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117794644}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This inn more than made up for it with absolutely the best service we've ever experienced. Better than Nemacolin if you can imagine that.", "title": "Beautiful", "helpfulness": 1, "user": "minnerColumbus_OH", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117722581}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "And we found that level of service extends to the entire property.", "title": "Plan B- Biltmore", "user": "Janmd4", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 117678642}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "A delightful stay.", "title": "3 out of 3 great stays at the Inn at Biltmore", "user": "steven g", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117664081}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Absolutely will return. Probably soon!", "title": "Absolutely perfect", "user": "dotnbri1", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117563189}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Our wedding anniversary is July 4th so we try to go to the Biltmore in Asheville. It's VERY pricey, but oh so special. The big draw for us is that they have private fireworks on the grounds of the hotel just for the guests. They have ice cream (free), drinks (extra) and put a checkered blanket in your room to lay out on the lawn during the fireworks display - just in case you can't get one of the adirondack chairs.", "title": "So Special", "user": "Tbelle", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117992980}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The only problem with staying there is that it's so expensive we can't afford to stay very long - just a couple of nights. They do run specials, but it's still crazy expensive - especially in this economy. If it were a bit less, we'd stay 4 or 5 days. LOVE it. Staff and everyone are very accommodating. Two slight negatives - we wish it were pet friendly as we have a small dog. And, it would be nice if they had a refrigerator in the room (most hotels offer this now) but other than that, it's perfection.", "title": "Another great stay at the Inn on Biltmore Estate", "user": "swfloridian", "date": "September 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117990361}, {"rating": 5.0, "title": "What a Trip to the Mountains Should Be!", "text": "The Deer Park Village restaurant was a disappointment though. Not a good value for the money. Can't remember the name of it.", "user": "jimbobwe", "date": "September 9, 2011", "id": 117884350}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Although pricey the Inn on Biltmore Estate is first class in accommodations, service and ambiance.", "title": "Nice room, great surroundings-- at a price", "user": "Sutter", "date": "September 9, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 117867002}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This time I reserved Dining room slots ahead of time and was not disappointed.", "title": "Absolutely loved it!!! We are planning a return trip very soon.", "user": "OhioJulia", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117850007}, {"rating": 5.0, "title": "Wonderful weekend", "text": "We spent a wonderful weekend at the Biltmore during a college looking swing through the area with our son. What can you say about the Biltmore? Beautiful rooms, gorgeous views, wonderful service, lovely restaurants, etc. our son had a sporting clay shooting lesson one morning and I think it was a trip highlight. Breakfast is not to be missed - still wish I'd managed to get the recipe for the French toast bread pudding! Make sure to go to the terrace bar and enjoy a glass of wine in the rocking chairs on the terrace. Relaxing is the adjective to describe our stay.", "helpfulness": 2, "user": "dbbourland", "date": "August 18, 2012", "id": 137507575}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "My husband and I purchased a Sniqueaway deal for our trip to Asheville. The deal included a night at the Inn and two tickets to tour the Biltmore Estate and Winery. While the room was very nice and the service excellent, I'm not sure I would have had the same impression if I had paid the usual nightly room rate.", "title": "Try to find a rate discount", "helpfulness": 2, "user": "anela_2010", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 137449109}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "Our room was comfortable and clean, but the bathroom had a TINY shower (3'x3' square). Neither my husband nor I are very tall, which came in handy with the shower because we both struggled a bit to move around and not bang our elbows on the wall or hit our heads on the shower head itself. The bathroom did have a standard size tub with jets, but no body wash or bubble bath was available - just bar soap. And it was a one person tub, so keep that in mind if planning a romantic getaway.", "title": "The Biltmore", "helpfulness": 3, "user": "TravellerStLouis", "date": "August 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137363456}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The bed was VERY comfortable though. We chose a room with a single king and were pleased.", "title": "If you're going to the Biltmore, stay at the Inn on Biltmore Estate", "helpfulness": 6, "user": "Jane C", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137202426}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The staff at the front desk and in the dining room were friendly, kind, and helpful - which is something that I encounter with less frequency all the time.", "title": "Excellent", "helpfulness": 3, "user": "SuzieQ042", "date": "August 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 137164573}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We were in Asheville the last week of December 2005 and loved the Inn at Biltmore. We had a package deal which included our breakfast and dinner each night and it was well worth it. The Bistro at the Winery was our favorite. Enjoyed the tours of the Winery very much. As a guest of the Inn you do not have to wait to enter the House, which was great considering the week we were there was one of their busiest weeks. We loved the rooms, very quiet, well decorated, loved our balcony with views of the mountains. The entire staff was friendly and helpful. We probably would never stay anywhere else again when visiting Asheville.", "title": "Great Place to Stay", "helpfulness": 13, "user": "cmoye", "date": "January 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4320854}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "We just returned from a wonderful stay at the Inn on Biltmore. Having read some of the reviews here at Trip Advisor, we were not sure what to expect, especially since this was winter time.", "title": "A wonderful hotel", "helpfulness": 18, "user": "torpeedo", "date": "December 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4306392}, {"rating": 3.0, "stay_parameters": "Stayed December 2005", "text": "We were extremely happy with all aspects of our stay. It met and exceeded expectations for any hotel. The Inn was beautiful and tastefully decorated for Christmas. The staff were exceptional and very professional. Our room was exceptionally clean with very warm decor. The furnishings and draperies were top notch. You could definitely spend a lot of time in your room. The colors were soothing and warm. The bathroom was very large with generous marble throughout. The view was majestic. You could spend an afternoon reading and looking out at the mountains and blue sky. Parking was very easy with the Valet ( however you CAN self park if you would like). Your vehicle is stored in an indoor heated garage. Very nice to receive your car warm on a winters morning.", "title": "Just OK...", "helpfulness": 12, "user": "Ira_N", "date": "December 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "service": 5.0}, "id": 4216650}, {"rating": 2.0, "title": "Dont' go there.", "text": "We had no problems at all with the shuttle and so glad to have this amenity. The shuttle will take you to any number of points of interest on the estate. The drivers were extremely courteous and provided some narative while driving us around the estate. Guests at the Inn on Biltmore are taken right to the front door of the Biltmore House. No waiting in any lines. Preferential treatment is given to Inn Guests throughout the Estate. You can buy tickets to any activities at the Consierge desk.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "November 27, 2005", "id": 4146408}, {"rating": 5.0, "title": "A perfect fall stay and ChristmasCandlelight Tour", "text": "We had dinner in the Dining Room at the Inn. Advance reservations are recommended. We made our reservations a week before arriving and had a lovely table by the fireplace. Food was outstanding as well as the service. A very memorable dinner. We also had breakfast in the Dining room which offered a buffet. Wonderful breakfast with an omelet station as well as a full buffet of specialties.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 11, 2005", "id": 4106572}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "As you enter the gates and drive the long gorgious road toward the Inn, you instantly know you are going to be amazed! The hotel is lovely, treat yourself to a room with your own terrace with gorgeous views of the mountains and the estate! Definitely purchase the breakfast package as every breakfast is 5 star gourmet with dining outside with views to take your breath away but not your appetite! Get the daily package deal that gives you unlimited access to the entire property which includes unlimited access to the mansion, winery, village, etc. The shuttles are small and the drivers are friendly and full of interesting information about the estate. The winery has free wine tastings of over 28 wines! The Biltmore Mansion should be on the US must see top ten list as it was the most incredible tour I have ever been on with the amazing home that took 7 years to build. The surrounding gardens are beautiful and take an entire day to explore.", "title": "Perfection Inside and out!!", "helpfulness": 1, "user": "marjorietwin", "date": "August 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138397727}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "There are a few words you're going to think when you step into the Inn on Biltmore Estate. Some of them will probably be \"Wow\" \"Elegant\" \"Beautiful\". It gets even better as you walk the property. The gardens and the views are breathtaking. There is so much history and fairytale wonder in each corner of the estate that you'll want to make every minute of your visit count. I literally wanted to take a piece of it home with me. The wine tastings and tour of the winery is a must-do. It is beautiful to learn how the family has maintained tradition and shared it the way they have. Of course, the Biltmore Estate is an incredible sight that makes you marvel with each room, piece of furniture and intricate detail. We enjoyed learning about this family and getting a glimpse into the amazing life they led. There are several restaurants to choose from, either the Dining Room at the Inn itself or in the village. I will be writing a post in a couple of weeks on my site at http://adventuresofthefoodaholic.blogspot.com on our experience at the Dining Room. It was like nothing I've seen before- from the food, to the service, to the ambiance. The rooms are beautiful and the grounds are immaculate. There is shuttle service to take you around the property and it runs frequently. Although it may be pricey, it is an experience you want to treat yourself to at least once in a lifetime, if not more. I can't wait to return!", "title": "Astounding Views and Service", "helpfulness": 5, "user": "dinentravel", "date": "August 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138346913}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "I will keep my review of the Inn on Biltmore to some basic things you need to know. It is elegant. It is pricey. The rooms are very small. You are best off purchasing a package deal on their website which will then include the day pass which is $59 per person if you purchase without staying. When staying at the hotel, this pass will allow you to stay on the grounds the day you arrive and the day you leave, so this is your best option. When you purchase a package, expect you will get a room that faces the back...you will not get a view overlooking the property that you see on the website and you will not have a terrace.", "title": "Elegance...", "helpfulness": 3, "user": "Linda G", "date": "August 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 138257906}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "In the room, you will have free wifi, however, everything else in the room, water, etc is at a cost. We did not eat in the hotel as it is fine dining and we would have had to dress up. Instead we preferred to stay more casual and eat at the other two very good restaurants at Biltmore village.", "title": "Great views, great service, very relaxing", "user": "JoeF41", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138163632}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Biltmore is a lovely experience. The estate is gorgeous, well kept and well worth a visit and we were able to find much to do during the two days on the estate.", "title": "Great holiday destination", "helpfulness": 2, "user": "TravelDuo3943", "date": "August 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 138155592}], "location": {"country": "United States"}, "variance": {"poor": 19, "average": 39, "very good": 153, "terrible": 14, "excellent": 823}, "aka": "Inn On Biltmore Estate Hotel Asheville", "slim_ranking": 0.0172413793103, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Experience Biltmore's tradition of warm, gracious hospitality as an honored guest at the Inn on Biltmore Estate. Choose from 213 beautifully appointed guest rooms including nine elegant suites. Flawless service. Fine dining. Marvelous mountain views. A relaxing veranda. Afternoon tea in the library. Other amenities include an outdoor pool and hot tub, fitness center, access to Biltmore--America's largest home--and much more. Concierges eager to assist you. Carefree transportation around the 8,000-acre estate."}