{"user_rating": 4.0, "review_count": 172, "name": "Inn at El Gaucho", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Stayed there over a long weekend and I agree the service was friendly and attentive. Hotel is in a great location in Belltown, and it is located near many interesting shops and restuarants. I would give this place another try, but there were some things that could use improvement.", "title": "Good, but....", "helpfulness": 8, "user": "mamizs", "date": "June 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 5.0}, "id": 5366446}, {"rating": 5.0, "title": "Stay at El Gaucho", "text": "To their credit, the staff tried to remedy my biggest complaint which was a very loud air condtioner that hissed, started, stopped, etc, every 2 to 3 minutes. When it was quickly obvious that their own maintenance staff could not fix it, they immediately called a professional who came out on that same Saturday to fix it...he kind of fixed of it, but even admitted that it was not completely right. For just under $200 bucks a night, the AC should work. Period. In addition, the toilet paper holder was falling off the wall and the remote (batteries?) died. Not all bath products were replaced and ran out of soap.", "helpfulness": 4, "user": "Pulaskicountytourism", "date": "June 20, 2006", "id": 5364173}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Stairs are a pain to navigate, especially since you have run in and out as their no vending machines or gift shop to purchase water, snacks, etc located on the property.", "title": "Best Hotel EVER!", "helpfulness": 11, "user": "ssshn18", "date": "May 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5221469}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "I was searching online for a place to stay prior to our cruise.", "title": "Wonderful Surprise", "helpfulness": 2, "user": "Hutzpoffer", "date": "July 23, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5500331, "likes": {"liked": "— Beautifully appointed suite, the fresh flowers, very clean.", "disliked": "— No elevator"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "I came across the Inn at El Gaucho. We only stayed one night, but it turned out to be great. A room upgrade awaited us after a long plane flight. The evening lights across Puget Sound were beautiful.", "title": "Great Experience!", "helpfulness": 1, "user": "lmcdaniel", "date": "July 22, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5497828, "likes": {"liked": "— location, cleanliness, luxury", "disliked": "— staff at desk"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2006, traveled on business", "text": "Attention to detail - fresh flowers, beautiful bed linens, comfy robe, etc.", "title": "The Worst Hotel Experience To Date", "helpfulness": 20, "user": "beckster72", "date": "July 13, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 5464233}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Our dinner at El Gaucho Restaurant was excellent.", "title": "Redefines the meaning of hospitality", "helpfulness": 1, "user": "unicornn", "date": "July 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5448177}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Conveniently located to Pike Street Market, waterfront, great shopping and restaurants.", "title": "Cozy Room at the El Guacho", "helpfulness": 3, "user": "Honeymooner04", "date": "June 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5412696}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Stayed at the El Gaucho for three days mid-August 2006. I travel frequently, stay at rather higher end hotels and B & B's. The reviews previously here were the only thing that led me to find this wonderful hotel. The staff was exceptionally friendly and helpful. The Inn itself is stylish, exceptional rooms that seduce you - very romantic, plush and at the same time comfortable. Beds, linens, pillows are awesome. Leather couches/chairs, plasma TV. Bathrooms as comfortable and stylish, amenities are great. The neighborhood is bustling, plenty of great eats, conveinent to Pikes Market, downtown, the waterfront and Seattle Center - all close walks. Neighborhood was safe, greatly so, for a large city due to the activity of cafes and restaurants. Note there is no elevator and a good set of stairs up, but the staff is very helpful. Valet parking was fine and not overly expensive or inconvenient for a city. I was greatly impressed and would make it my choice over Marriotts, Westins, Hiltons and the like for it's style and exclusive feel.", "title": "Outstanding", "helpfulness": 4, "user": "kasey363", "date": "August 18, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5622141}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My husband and I stayed here recently (along with 3 other couples) while we were in town for a wedding. The inn is both charming and unique, and different than what we expected. It definately has a retro feel, as evidenced by the small white tiled bathrooms, but with plenty of modern touches. While what one other reviewer said is true (about having to go up a flight a stairs), it didn't bother us or the rest of our friends. The beds were so comfortable, and we loved lounging on the leather furniture, watching our flat screen, and drinking wine out of Riedel glasses. We were given fresh chocolate chip cookies, a CD, and bottle of water at check in, which was a nice touch. We were escorted to our room and shown how each of our 4 remote controls work for different features in the room (fan, AC, stereo, TV). The staff was friendly and helpful, and the location is a short walk from Pike market. The rate of $169 (weekdays) was also much better than anything else comparable I came across in town. Try and visit the Music Experience Project by the Space Needle when in town, it's well worth the $20 entrance fee. Viva El Gaucho!", "title": "Viva El Gaucho!!", "helpfulness": 7, "user": "love2travel29", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5611847}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "I booked El Gaucho on the back of this site and was not disappointed. I couldnt think of a better place to arrive after a long haul from London. One of the most comfortable beds and duvets Ive ever had the pleasure to fall into, stylish decor and room layout, very usable flat screen and bose system.", "title": "Outstanding in all areas", "helpfulness": 5, "user": "Beardtours", "date": "August 8, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5577497}, {"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "A traquil oasis of harmony right in the heart of bussling Belltown. Make your visit to Seattle complete and book it!", "title": "Disappointment at El Guacho", "helpfulness": 6, "user": "TravelingCple", "date": "August 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "location": 2.0, "rooms": 2.0}, "id": 5574931, "likes": {"liked": "— Anticipation based on writeups and hotel web site"}}, {"rating": 5.0, "title": "Affordable Luxury! We love the Inn at El Gaucho!", "text": "We had high hopes for our stay based on the reviews we had read on this site. However, disappointment set in upon arrival. The hotel site does not mention that the only way to access the hotel is via long steep conccrete steps and that if you arrive at a non peak hour there may not be a valet out front to help park your car or take your bags up to the room. You have to trek up to the front desk and announce your arrival to set things in motion. We booked a sound view room and found that the view is over nearby roofs and fairly limited. If we had known how poor the view was, we would not have paid the premium. The first room we were given had some sort of loud mechanical noise above. The staff was very accomodating and immediately switched us to another room. That room, although rather small, seemed fine until the next morning when we discovered that the tub drain was extremely sluggish. It was to remain that way for our entire three night stay, despite requests each day to have it repaired. The rooms are clean and well appointed, however the queen bed seems small to those of us accustomed to king beds at other \"better\" hotels. The staff is extremely friendly but were unable to meet our request for tickets to a popular show playing the weekend we were there. Dinner reservations were made efficently, but feedback was not given that they had been made unless we asked. A phone call to the room confirming them would have been a nice touch. In summary - the staff is friendly and inspires confidence but the follow through is less than good. Decent value for the money, but not a place we would return to.", "helpfulness": 3, "user": "PixKris", "date": "August 1, 2006", "id": 5534911}], "location": {"country": "United States", "city": "Seattle"}, "stars": 3.5, "variance": {"poor": 12, "average": 17, "very good": 50, "terrible": 9, "excellent": 84}, "aka": "Inn At El Gaucho Hotel", "slim_ranking": 0.52688172043, "description": "Seattle's Luxury Urban Inn.Step back in time, to an era of uncompromising service and total indulgence. With its \"retro-swank\" fifties décor, the Inn at El Gaucho will give you the kind of responsive attention and personal pampering that only a 17-suite, exclusive Inn can provide.Located in Seattle's ultra-hip Belltown district, the Inn is minutes away from landmarks such as the Pike Place Market and the Space Needle. Whether you're a visitor to the city or a local spending a night on the town, the Inn at El Gaucho will serve up a memorable stay you'll cherish forever."}