{"user_rating": 4.5, "review_count": 129, "name": "Inn at the 5th", "reviews": [{"rating": 5.0, "title": "#1 in Eugene by far!!", "text": "Our second stay at this boutique hotel was as good as the first. First rate, friendly service, beautiful rooms and great location.", "user": "Msk6261", "date": "December 2, 2013", "id": 186582281}, {"rating": 5.0, "title": "Fantastic Place with amazing service!!", "text": "The beds, linens and towels are wonderful and the room was quiet and private. We were concerned when we were located right next to the elevator but we never heard it at all!", "user": "Dfeingold623", "date": "November 29, 2013", "id": 186284052}, {"rating": 5.0, "title": "Relax in Style in Eugene", "text": "The 5th Ave. area is developing nicely around it as it is becoming the destination to shop in eat in Eugene.", "user": "Kevin C", "date": "November 20, 2013", "id": 185351509}, {"rating": 5.0, "title": "A great sense of Welcome", "text": "I can't give the Inn a high enough rating. First, the service from top to bottom is amazing. Not in a high brow way but just in a sincere and thoughtful manner to take care of guests. Staff is plentiful and there is not a thing they won't do to take care if you. The rooms are renovated an updated and spotless. The shops in the same plaza are also amazing. Great luxury for the price!", "user": "Frequent_Visitor547", "date": "November 18, 2013", "id": 185096337}, {"rating": 5.0, "title": "Wonderful Hotel", "text": "We stayed as a family of 5 at the Inn at the 5th on a business trip. There was something for everyone.", "user": "Annvjones", "date": "November 11, 2013", "id": 184414118}], "location": {}, "stars": 4, "variance": {"poor": 4, "average": 3, "very good": 22, "terrible": 1, "excellent": 99}, "slim_ranking": 0.030303030303, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 5.0}, "description": "Inn at the 5th is a \"very special boutique hotel\" offering elegant accommodations and the ultimate in personal service in the bustling heart of Eugene, Oregon. Our luxurious boutique hotel echoes all that makes Eugene unique, from its artistic, sophisticated design to the high-end dining, spa and shopping available onsite at the 5th Street Public Market."}