{"user_rating": 4.5, "review_count": 58, "name": "Inn At Buck Hollow Farm", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Its well off the beaten path and likely a very good place to get away from it all. Our goal was to use it as a stopping point along the way between home and the east coast.", "title": "A bit out of the way", "user": "simpme", "date": "September 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 78404411}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Breakfast was nice. Room was OK but the A/C unit was just too noisy (The weather did not permit opening the windows). A very well stocked common room, a pool and a hot tub were some of the nice features.", "title": "Great place to stay, made us feel like family", "user": "jcarpen213", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76488531}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Found the owners to be very friendly and helpful, Brad had some very good ideas for sight seeing, antiquing, and many other activities. Jacquie went out of her way to change ingredients in the breakfast for a customer's dietary needs. The breakfasts were all extremely tasty and my wife wants her recipes. I found the INN very clean and homey. if you like animals you wil love the very well behaved pets. I will definitely go back and recommend this INN to anyone", "title": "Welcome from Inn at Buck Hollow", "helpfulness": 1, "user": "Countryone", "date": "July 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71102789}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Upon arrival the one thing that stands out is the Inn's homeyness and beautiful setting. Far better than the website pictures can depict. Excellent food, accommodations , conversation; as if one were home. Many thanks to the wonderful Hosts and the enjoyable pets.", "title": "Comfortable Inn with gorgeous surroundings and friendly hosts", "helpfulness": 1, "user": "grnmtnmama", "date": "May 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 64819552}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "This is our second stay, but the first with two young children. We stayed in the suite, which had a queen bed and a fold-out futon--both were very comfortable and had high thread-count sheets and down pillows. The suite had a private deck with easy access to the backyard, which was great for the kids...plenty of space to run around. We even startled a juvenile black bear on our walk! So exciting!", "title": "Keep driving: this an unfriendly unhelpful B&B, although in a lovely spot", "helpfulness": 2, "user": "BonjourduCanada", "date": "April 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 60735435}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "I have to say that the Inn at Buck Hollow Farm in Fairfax, Vermont is the best place we've stayed at yet! My husband and I have had our share of inns and motels but, truthfully, this is the best one.", "title": "Best Inn We've Stayed At Yet!!", "helpfulness": 1, "user": "jchristian1958", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 41427917}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "The inn is adorable, very clean and the people are extremely friendly, The owners provide a full breakfast in the morning and, it's delicious! If you have only one more place to stay at during your trip, you have to spend it at the Inn at Buck Hollow Farm in Vermont. You won't be sorry!", "title": "Spectacular", "user": "serolod59", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32888436}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We had a magnificent time at the Inn. The staff was wonderful and very accommodating to our needs. Brad even supplied us with gas when we ran out!! What a host! To us, this was truly Vermont. Thank you so much.", "title": "Beautiful setting, relaxing, superb breakfast.", "user": "virungas", "date": "June 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32865788}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We spent two wonderful days at the Inn at Buck Hollow in Fairfield, Vt. This dog friendly inn also provides two host dogs who romped with ours. Gizmo also led us on the property hike- great fun for all. Breakfasts were delicious. This inn was probably the best buy on our two week trip.", "title": "Out of this world fall foliage and beautiful country setting", "user": "concerned-mom-of-2", "date": "January 22, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23790517, "likes": {"liked": "— Too many things to limit to just one but probably the overall setting of the Inn itself and the outdoors", "disliked": "— didn't get to stay there long enough"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This was only my second experience with staying at a B&B and I am so glad we chose The Inn at Buck Hollow Farm in Fairfax, VT. I do alot of traveling for work and I have stayed in a wide variety of hotels, but this trip was for pleasure so I looked into B&Bs in the St Albans, VT area. The website for The Inn at Buck Hollow Farm was easy to use and had some great pictures of the Inn and the setting. We went in October 2008 and the fall foliage was unbelieveable. My sister, my daughter and I, all stayed in the foliage room. It was small but very homey. It had it's own bathroom and had a nice, large, comfortable bed. The television is tiny, but who stays at a B&B to watch TV? The room had a very country feel to it. They also had a sunroom that was open for everyone to use and an outdoor hot tub that my daughter and I had all to ourselves. I almost forgot to mention that the grounds for the Inn are wonderful for a morning hike. It was just a short drive from The Inn to Burlington, VT, which is a wonderful city to visit. It is also close to St. Albans, Vt which is a quaint little town where many of my family members were born. Brad and Jacquie were wonderful hosts and made you feel right at home. Jacquie's cooking is fantastic and I am an extremely picky eater, so I'm not easy to please. She served a homemade, delicious breakfast every morning that we were there. I wanted to stay an extra day, just so we could have one more breakfast before we had to leave! My family and I will be sure to return to this B&B when we am fortunate enough to be in this area again.", "title": "PETS At BREAKFAST", "helpfulness": 4, "user": "santa911", "date": "September 27, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 3.0, "location": 3.0}, "id": 20418597, "likes": {"liked": "— nothing", "disliked": "— pets at breakfast"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I had a terrible and upsetting experience with Buck Hollow and I would never recommend it to anyone.", "title": "Rude staff, not recommended", "helpfulness": 3, "user": "Amarante_Robert", "date": "September 20, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20225283, "likes": {"liked": "— Outrageously poor service"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "Unfortunately I had to cut my trip short and had to cancel my reservation (so I never actually stayed there). When I did, I was contrite and apologetic and the response I got was a very rude \"Ok\" and then they hung up on me!", "title": "Comfortable rooms but distant owners", "helpfulness": 8, "user": "JazzMatazz73", "date": "September 20, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8828229, "likes": {"liked": "— The room", "disliked": "— The fact that the owners seemed inapproachable"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "When I wrote the owner of Buck Hollow, Brad, to discuss how I had been treated, he told me that his staff was curt because they were very busy at the time ... as if their being rude was somehow understandable!", "title": "Misleading website", "helpfulness": 11, "user": "Sidwnaht", "date": "November 3, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 1.0}, "id": 6051647, "likes": {"liked": "— The dogs in residence", "disliked": "— The bedroom"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2004", "text": "He then told me that they were charging me the full amount for the room and that there cancellation policy was in place to protect them from people like me!", "title": "Inn at Buckhollow Farms is a Great B&B", "helpfulness": 5, "user": "VaBelle35", "date": "June 24, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3609135}, {"rating": 4.0, "title": "Wonderful Inn - Great Price", "text": "I am truly agast at the way they treated me. You'd think that I had tried to set the place on fire or something. Absolutely appalling behaviour on their part. Buck Hollow takes poor service to a whole new level.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 19, 2003", "id": 859201}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The rooms are in a wing off a Vermont farmhouse in the middle of a working farm in beautiful, hilly farm country. Our room and private bath were clearly recently renovated (or brand new), absolutely spotless and in perfect condition. We had a number of fun conversations with the proprietors Jacquie and Brad and the other guests in the guest common area and dinning area. The food is great. We cross-country skied out the back door on snowmobile trails, but quickly found untracked logging trails for back-country skiing. There’s an outdoor hot tub. My wife and I will have permanent fond memories of the weekend we spent there.", "title": "A genuine Vermont country experience", "user": "AndyMagruder", "date": "February 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55666250}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We live in Florida and wanted to get away for a cozy weekend, and the Inn At Buck Hollow Farm surpassed any expectations we had. We chose Buck Hollow out of recommendation from friends of the family, and their stay was just as enjoyable as ours. We were slightly concerned about the animals because of our allergies, but we had no problems what so ever. We loved our stay and will be back as soon as time allows.", "title": "Peace and Comfort", "user": "thechailife", "date": "February 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55610655}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Warm and cozy place. Perfectly decorated in vintage style. Jacquie and Brad are so friendly that after one day you feel like an old friend. We were during snow and cold weather and the place looks promising during summer or fall.", "title": "The place that gives you the taste of some more", "user": "ranash160", "date": "February 1, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54887063}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Super people! Dont believe the whining me-me's,, its all about me. (if in fact they are even real guests) These folks are real nice . We've been to Buck Hollow Farm many times over the years. They do have dogs and cats and I will admit they did let then into areas in the past. (usually a guest did by mistake) But they make all efforts to keep them out of the guest areas all the time. The food is just good...AND They have made us special meals because of allergy issues. Its just plain \"compfortable\" at the Buck Hollow Farm Inn.. We've had many family visits there as well.", "title": "This is like being with Friends and Family", "user": "Oliver_Vermont", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54508582}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Keep up the great work Brad & Jacquie! We will be back..", "title": "Stay away from the Inn at Buck Hollow", "helpfulness": 2, "user": "Val079", "date": "January 18, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 53754088}], "location": {"country": "United States", "city": "Fairfax"}, "stars": 3, "variance": {"poor": 1, "average": 6, "very good": 6, "terrible": 5, "excellent": 40}, "slim_ranking": 0.5, "description": "A small Vermont country inn, we combine the amenities of a country inn with the affordability of a bed and breakfast. With 400 acres to explore, we are truly a country inn in the country. Guest enjoy the fact that while we are rural, we are still within easy reach of Burlington (30 minutes) or Montreal (90 minutes) and the ski slopes (30 minutes). Our full breakfasts are delicious and filling."}