{"user_rating": 4.0, "review_count": 472, "name": "Innisbrook, A Salamander Golf & Spa Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My husband and I honeymooned at Innisbrook many years ago and decided since we were going to be in the area to stay again. We were so surprised at how big the resort had become. As others had mentioned in prior reviews, the lodges were a bit musty/moldy smelling when you first enter, but this was not the case in the rooms. The executive suite where we stayed was perfect -the kitchenette was fully stocked ready to use. We were happy to have access to the fitness center and used it every day--it was a full fitness center with access to many types of equipment. We spent one morning biking around the facility and enjoyed the serenity of the area. Since we were close to the beaches we decided to spend a really relaxing day at Honeymoon island-it was so beautiful! When we tired of the beaches we enjoyed the Lochness Pool area complete with 2 or 3 waterfalls which made it very easy to sit back and relax. They even have a small sandy beach on the shallow end of the pool. We spent many hours relaxing by the poolside! We were so happy and impressed with our stay at this reort that we will be going back some day soon. The staff were the friendliest of any place we have ever stayed--we felt welcomed by every one of them. They responded very quickly to anything we needed! We highly recommend this place if you want to get away...and you don't have to be a golfer to enjoy it! We never stepped foot on the greens (although we enjoyed their beauty)!", "title": "What a way to celebrate an anniversary!", "user": "iam12xcel52", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80471223}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "I chose this property based on reputation as well as proximity to the offsite event I was attending. I was positively surprised at the value/dollar that I received. Having a kitchen was necessary to my family and this one was well provided. I even managed time for spa and the pool. Easy access, great property layout, very pleasant staff. Registration was very quick and check out a breeze. Will be back next month!", "title": "Exceptional resort facility at an affordable price.", "user": "nmtcenter", "date": "September 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80261411}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We were a party of three and reserved a 2 bedroom, 2 bath suite with large balcony", "title": "PAMPER YOURSELF", "user": "mahjongg_10", "date": "September 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80218606}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "fantastic plush beds, nicely furnished. we stayed in the \"latham \" which was right by the loch ness pool.the staff is superior, you get the impression they all came to work just to serve you and make your stay all that you had hoped for. can;t wait to go back", "title": "Loved it and will be back", "user": "touchofeurope", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78956181}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We spent a week at the resort and enjoyed it very much. Very attentive, friendly staff, excellent service. Nice amenities, comfortable rooms and beds, everything clean and well cared for.", "title": "We all got flea bites from our room & the room wasn't very clean!", "helpfulness": 1, "user": "rosiemarc", "date": "August 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 75223227}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We (family with 2 college kids) stayed here for a recent family gathering in the area. Overall we were very pleased and would stay here again in a heartbeat. We had a 2 bedroom suite which was very roomy, comfortable and nicely furnished. We didn't spend much time on the property, but from what we did see, the property overall seemed lovely. The shuttle service was excellent and fitness club very good.", "title": "Best place in Palm Harbor", "user": "mfnyc", "date": "January 18, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 93568722}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The only negatives would be that housekeeping came very late in the day, and it always seemed to be when we were back in the room (after spending the earlier part of the day out). Also we arrived at night. The property is dark, and driving in from 19, we didn't realize that it was still a bit of a ride from there to the registration building. We did find it, but for a moment or 2 thought we may have missed a turn.", "title": "Very Relaxing", "user": "LoveVacations34678", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 92213281}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Our last morning, we had a family breakfast gathering off-site. I asked if we could have a late checkout and that was not a problem.", "title": "Tennis and racquetball every day", "user": "klg_Centreville_MD", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 91465244}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I went with my wife for a few days just to relax and get away. Our great stay started before check-in. The security guard Marrah, gave us directions to our room as well as a map of the property. We asked her where we should eat for dinner and she suggested Packard's. We had a great meal. Check-in was a breeze. When we got to the Clubhouse to check-in it was like they were expecting us. The grounds are gorgeous and the Spa was a dream. We will be back.", "title": "Great getaway with lots of Green Space", "user": "billanddeb34683", "date": "December 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 90797957}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "We stayed here primarily to enjoy the tennis and racquetball facilities. Unfortunately, it was so cold during our stay, that we didn't get to use the pools or bikes. If it was any warmer, we would have used more of the facilities.", "title": "Beautiful Rooms!", "user": "jennifer_kcvb", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 89735774}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My husband and I stayed at Innisbrook for a long weekend to attend a wedding in Tampa. The grounds are beautiful and the landscaping is well-tended. My husband played golf on the Island, North and Copperhead Golf Courses and said that all courses were in great shape. The public buildings are modern and attractive and all the employees are very friendly and accomodating. We also spent time at the main pool and the Island pool which were also very clean and comfortable. Our one-bedroom suite was clean with nice bedding and towels and very quiet. As many other people have mentioned, the rooms may be a bit outdated but the views and locations make up for the 70's look. Tampa Airport is 35 minutes away and Clearwater Beach was 25 minutes. There are many restaurants and shopping nearby too. All in all, it was a good choice.", "title": "Beautiful and Serene Setting", "user": "swimnsnorkel", "date": "October 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 82376567}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Innisbrook takes every opportunity to make your experience at their resort memorable. The staff is professional, friendly, and helpful. The grounds are kept in pristine condition. Overall service is amongst the best in the hospitality business. The recreation, especially the golf, is outstanding. I look forward to returning to Innisbrook.", "title": "A very pleasing experience for either personal or business objective.", "user": "jljazz", "date": "September 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81598563}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Very nice and quiet golf resort. High standard service. Very nice room with nice furnitures and kitchen. Swimming pool in front of the residence. Very good service for money.", "title": "Very nice and quiet golf resort", "user": "balou105", "date": "September 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 81507877}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Advice : situated 2 minutes from Wallmat supermarket, that very convenient !!!", "title": "Excellence at it's finest", "user": "mikemcwhorter", "date": "September 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81489450}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "we did a 3 day golf package with another couple.We found the price to be extremely reasonable and the 3 courses we golfed on were immaculate", "title": "This is an AMAZING place to take your family! The BEST!!", "helpfulness": 1, "user": "danelletony", "date": "September 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81275243}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "One night for Thanksgiving- great place to cook (we got a full kitchen) and relax with family. Also really like the new clubhouse/bar/patio area. Good tv, draft beer, and cigars (outside of course). Also enjoyed the fire pits since it was cool outside. Staff was great- even though they had to work on thanksgiving. Will definitely return. I think we're headed back in two weeks!", "title": "Wonderful Thanksgiving Stay", "user": "Kappabrewer", "date": "November 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88565652}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The staff was excellent no matter what part of the facility you were using. The food was excellent. The fact you could play four top notch courses and stay on property with good transportation was a real plus. The rooms were very good and the bed was excellent. We used the meeting facilities also and we were well taken care of. I would highly recommend this resort.", "title": "This place has it all; weather, golf, good good convention facilities and great staff.", "user": "twalker42", "date": "November 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88357371}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Stayed 4 nights in early November at the conference rate of $139 per night which, with taxes and the $15 per day resort fee, came to $172 per night.", "title": "It was fine if you like this sort of thing", "user": "drc225", "date": "November 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 86674807}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "You either like this sort of place or not and I'll confess up front that it's not really by style. I hate being 'trapped' and having no option but to use the resort's overpriced bar and food facilities. Having said, if you like this sort of thing, then it's fine, even good.", "title": "Wonderful Stay", "user": "rqh", "date": "October 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85297113}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The first thing to understand is that the place is huge. So large they have their own busses to drive you around. I didn't bother and simply walked around. But it is large and miles from anywhere so you are effectively 'trapped' on the property.", "title": "great resort", "user": "ibigstock", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83489881}], "location": {"country": "United States", "city": "Palm Harbor"}, "stars": 3.5, "variance": {"poor": 32, "average": 37, "very good": 154, "terrible": 14, "excellent": 235}, "aka": "Innisbrook, a Salamander Golf Hotel", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "The resort offers everything from golf courses to water slides."}