{"user_rating": 3.5, "review_count": 160, "name": "Innkeeper's Lodge Edinburgh, South Queensferry", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "City centre hotels tend to be very expensive, and in a hot spot like Edinburgh the quality often fails to live up to the price. On a recent visit we spent a couple of nights at the Hawes Inn in pretty South Queensferry for £130 B&B. The location couldn't be more dramatic, under the Forth Rail Bridge, the room was spacious and clean, free view channels on the TV and the staff were laid back and friendly. Breakfast was a good spread of cereals, yoghurts, pastries, toast and fruit. The Hawes Inn has plenty of parking and its a 10 minute walk from Dalmeny Station where theres 2 or 3 trains an hour into Waverley for under £4 return (about 20 minutes). The pub itself does a well piced menu and serves a good pint of Belhaven. If you want to do Edinburgh without the cost of city centre hotels and parking hassles then the Hawes Inn is a great alternative.", "title": "A great alternative for Edinburgh", "helpfulness": 1, "user": "Wirralmember", "date": "March 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26697427}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Only went in for Evening meal. Had to ask for the table to be cleared.... staff standing about.... Beer glasses and empty crisp packet removed.", "title": "eating at Hawes Inn", "helpfulness": 1, "user": "dave12321", "date": "December 2, 2008", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "service": 2.0}, "id": 22376378}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Had to go back and ask again for table to be cleaned of crumbs and marks of previous customers. Very surly barman took spray, cloth and cleaned table without as much as a smile or a sorry.", "title": "Enjoyed the Hawes Inn", "user": "Ian B", "date": "October 7, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20694058, "likes": {"liked": "— Friendly staff and good value accommodation", "disliked": "— Some noise from trains"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Food was ok and service from waitress also ok , but I wont be back or recommending the restaurant to anyone.", "title": "Cosy historic inn, but could do better!", "user": "andesig", "date": "August 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 19110007, "likes": {"liked": "— The location", "disliked": "— The breakfast and the thoughtless management style"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "Stayed here in October 2008 as a base for exploring Edinburgh. Good welcoming atmosphere and very friendly staff. The continental breakfast was generous and the hotel also served tasty lunches and evening meals at reasonable prices. Stunning views of the railway and road bridges from the dining rooms.", "title": "Very enjoyable stay", "user": "Hatt", "date": "July 29, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 18384602, "likes": {"liked": "— Location & staff", "disliked": "— Going home!"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I have visited the Hawes Inn several times for lunch or dinner and have found the food quality variable. On our last visit a week ago, when we asked about making a room reservation for a few weeks hence, we found we were unable to do so and were instructed to visit the Inkeepers Lodge website. I attempted to make a reservation on-line but found that there were 'restrictions' for the date in question and indeed for every weekend in May. I then tried to make the reservation by phone and was told that I could only book for 2 nights, not for 1. There was no expIanation nor apology forthcoming and the person I spoke to was completely disinterested. I am very disappointed that Inkeepers Lodge are so un-accommodating and I will not be recommending the Hawes Inn to friends or family.", "title": "Customer Service at the Hawes Inn South Queensferry", "user": "Fiona P", "date": "April 2, 2012", "detail_rating": {"value": 3.0, "service": 1.0}, "id": 127137659}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Having looked at the great reviews about the Hawes we were looking forward to our 1 night stay.We were given a disabled room and that was fine as we had paid extra for a front room.Unfortunately it made showering a bit difficult as the shower-head was so low down.The disabled seat in the shower was also a bit dirty.We went to dinner and I chose the beef and ale pie and my husband had the chicken and leek pie.Mine was\"nt nice,the beef was very tough and scarce and my husband did not enjoy his.We went down to breakfast and again a wee bit disappointed.We knew we were having a continental breakfast but again this was sparce.We are not typical complainers and said nothing but have decided from now on we will be giving our feedback on bad meals etc on the day.Its in a great location and sitting having a drink by the real fire was great,just think some attention needs to be given to the meals .", "title": "Wee bit disappointed with the meals", "helpfulness": 1, "user": "stephkate", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 126619772}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "We stayed three nights and after a disturbed night's sleep the first night, due to the close proximity of the trains on the Fourth Rail Bridge we settled down and ended up really enjoying our stay. The staff were very friendly, the only problems encountered were with our somewhat complicated booking in process, once that was sorted we were happy with the service. We were part of a large party and all our rooms were full of character and clean, albeit a little tired in places. However, the unique setting and character of the hotel made up for any deficiencies, not to mention the views from the rooms at the front of the hotel. We didn't eat any evening meals in the hotel but others in our extended party had positive comments to make about the food. The one big gripe we had was that no cooked breakfast was on offer, on two mornings we skipped the continental breakfast offerings and found superb cooked Scottish breakfasts elsewhere in South Queensferry. On the last morning we sampled the somewhat uninspiring offerings, however, our disappointment in the food was made up for by the lovely friendly waitress. If Vintage Inns decide to offer cooked breakfasts at The Hawes Inn, then we would not hesitate to recommend a stay at this uniquely placed hotel below the Forth Rail Bridge.", "title": "Unique hotel in a unique setting", "user": "The2JsEssex", "date": "March 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 126415195}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Had an excellent stay in room 10. The room was huge with excellent views of both bridges. The steps from the hotel to the train station are a killer but you soon recover from the climb. Trains every 15 mins to Edinburgh in the morning. Will come back and stay again and hopefully sooner rather than later", "title": "Excellent Hotel", "helpfulness": 1, "user": "StewartLove44", "date": "March 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 126084991}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We really enjoyed our overnight stay at the Hawes. The moment we arrived we were pleased to find a big car park in the back which was free to park in. The lady who checked us in (Kim) was really helpful and got us booked in for a meal in the restaurant for later that night. Our room was really big and very clean. It was separated into a bedroom area and a living area with a little sofa and desk. The bathroom was nice and clean too. For the price we paid we were really pleased with the standard and cleanliness of the room.", "title": "Lovely room at a brilliant price", "user": "peachy1989", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 125718603}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My wife has a Forth Bridge fetish, she thinks it is the most beautiful thing in the world ! We stayed for three nights in a comfortable room with a view of the bridge. The staff were helpful and the overall service was very good. The continental breakfast included in the b&b rate was good. There's plenty of choice on the evening menu and the food was good. My only minor gripe was being charged £2.75 for five onion rings. Would definately stay there again but I'll give the onion rings a miss!", "title": "Great view of Forth Bridge", "helpfulness": 2, "user": "acorntours", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129327785}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The service was second to none, the room was excellent and the food was superb. Our 3rd visit and won't be our lastx", "title": "Fabulous weekend", "helpfulness": 2, "user": "Brenda O", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128424294}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I;ve stayed in this hotel a few times now. in different rooms both at the front and the back of the building. I;ve and always found the rooms clean and well serviced and appreciate the coffee / tea making facilities. The meals have been fine for my palate and the self-service continental breakfast excellent. As for the noise from the trains? that has never been a problem for me personally. South Queensferry is also a nice wee place with a selection of eating places should you need a change from the hotel fayre.", "title": "lovely setting", "user": "Jiff1e", "date": "April 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 127694415}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Have stayed here a couple of times prior to flying off on holiday, we love it, parents also booked a room this time and were equally impressed. We both had family rooms and ours was at the front with great views! Both rooms were really spacious, clean and had everything we needed but with added value of views that are amazing!", "title": "Unique Inn with great views of the Forth and the Bridge", "helpfulness": 1, "user": "cburg46", "date": "April 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127467426}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "These rooms are at a great price and having stayed at other more expensive hotels nearby we will keep coming back here!", "title": "our toddler loved this place as much as we did!", "user": "Ohmydarling", "date": "April 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127343855}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "My husband, two teenage daughters and myself stayed at this location for three nights and we loved it!! Hawes Inn has been an active pub/hotel for over 400 years and is mentioned in R.L. Stevenson's book \"Kidnapped.\" The ambience is incredible and the food in the pub/restaurant was very good.", "title": "Historic delight", "helpfulness": 7, "user": "olycomrocks", "date": "April 14, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 7352078, "likes": {"liked": "— The historical ambience, location, comfort, good food and price", "disliked": "— I'm not sure what help is available to hotel guests after the restaurant closes (if needed)"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Rooms very good we had room 10 which was very large", "title": "Brilliant Break", "user": "ParkBoltonEngland", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124954681}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Breakfast very good selection", "title": "FAULTLESS", "user": "Megan D", "date": "February 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 124623647}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Food in restaurant was good we had venison (excellent)", "title": "Enjoyed it so much we came back", "user": "AlanHouston", "date": "January 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 123725280}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "OK, I don't usually write reviews but I felt I had to set the record straight.", "title": "Good for the price", "user": "HamishHaggishunter", "date": "January 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 123656948}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We were looking for somewhere new to go for a nice valentines meal! We came across the Hawes Inn on-line and everything looked lovely, THEN when we read some of the reviews we started to have second thoughts. However we do like to make our own mind up about things and so decided to give it a try. I cannot stress enough what a great evening we had. From the second we walked in the door we were made to feel entirely welcome and special. ALL of the staff were absolutely lovely, with a special mention to our waitress who's name was Stephanie. She couldn't do enough for us and really seemed to go the extra mile. The food was DELICIOUS and served promptly, with the two of us being slightly fussy - everything was just as we asked and we were not made to feel like we were causing any hassle or fuss! All courses were fantastically tasty and we certainly left on a very high note! (and not just because the bill was less than we expected to pay - particularly with the occasion!!) We cannot recommend the Hawes Inn enough or thank the staff for making our night special. We will most definitely return!", "title": "Great Location Fab Value", "helpfulness": 1, "user": "Nic-and-Julie", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123154208}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Stayed here to go to a concert in Edinburgh. South Queensferry itself is a beautiful lttle place and would have no hesitation in recommending the town. The weather was warm (in Scotland!) and the heating in the hotel was on so windows open to get some air and there was the constant traffic and train noise throughout the night - so very little sleep. The breakfast is not worth bothering with and there is no real reception so you have to queue at the bar to book in.", "title": "A warm night in Scotland!", "helpfulness": 1, "user": "MirrenGlasgow", "date": "July 25, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 18225726}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We went to the Hawes Inn in March and it was great. The rooms were lovely and very traditional looking.", "title": "Great traditional B&B", "user": "MrAndMrsMonkey01", "date": "July 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17954864, "likes": {"liked": "— Traditional look and feel", "disliked": "— Noise from the occassional passing train (really not that bad!)"}}, {"rating": 2.0, "title": "Great time, just some problems for children", "text": "The pub itself was very good and had a nice atmosphere. In terms of location you cant get much better, the train station is a 5 minute walk away and there are regular, cheap trains to Edinburgh.", "helpfulness": 1, "user": "daviddvd", "date": "June 11, 2008", "id": 16843983}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The views across the river are great and there are many nice walks you can go on around the area.", "title": "loved it!", "user": "jimboMontreuilSurMer", "date": "May 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16330775, "likes": {"liked": "— real character", "disliked": "— the room was a wee bit noisy"}}, {"rating": 5.0, "title": "Hawes Inn-Superb!", "text": "The only downside is you are very close to the Forth Rail Bridge and you can sometimes hear the trains going past. However we can honestly say this did not bother us at all while we were there.", "helpfulness": 3, "user": "specgirl", "date": "February 20, 2008", "id": 13694960}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This was our third stay at the Hawes Inn - yes, we like it.", "title": "A warm welcome", "user": "Wirralmember", "date": "June 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 131945974}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "A good measure of a place is how they look after you when things go wrong and our 3 night break didn't start too well when we arrived at 9.00pm on a Friday, after a 4 hour drive, to be told that they didn't have a room for us for the first 2 nights due to a flood that had put a couple of family rooms out of action.", "title": "Great place to stay", "user": "Daveom", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130900025}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "But fair play, they had tried to contact us at home earlier in the day, and having not been able to reach us they'd booked us into the Prem Inn about 5 minutes away. We were still welcome to go down for breakfast, which we did, and they told us to pay the Prem Inn and then bring the bill with us the following morning.", "title": "Poor", "helpfulness": 1, "user": "David P", "date": "May 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 130566819}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "They offered us various options by way of apology (including a free weekend stay later in the year) and we settled on a full refund of the cost of the 3 nights at the Hawes Inn plus a complimentary 3 course meal on the final night when we had a room there, so effectively the break cost us the £24 difference for 2 nights at the Prem Inn. They couldn't have been more apologetic about it - not their fault if a guest decides hes an amateur Saniflow engineer! - and other staff were made aware and were truly welcoming when we went down for breakfast etc. Leah (hope I've spelt that right), who looks after breakfast, went out of her way to make us feel at home, but then she always does...one of the reasons we'd always head back there when we're in that part of the world.", "title": "Amazing food, brilliant atmosphere.", "helpfulness": 2, "user": "Jonathan G", "date": "May 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 129916135}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The room we had for our third night, although not a \"family\" room was bigger than its equivalent at the Prem Inn with comfy beds and nice decor. Breakfast was as ever plentiful and varied.", "title": "c&g on tour", "user": "geoff s", "date": "May 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129826260}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 22, "average": 27, "very good": 54, "terrible": 11, "excellent": 46}, "aka": "Hawes Inn Vintage Inn, Innkeeper`s Lodge South Queensferry Hotel Edinburgh", "slim_ranking": 1.0, "description": "Few hotels in and around Edinburgh can match this lodge for its views or place in literary history. Many of its 14 cosy rooms look out over the iconic Forth Road Bridge and the Firth of the Forth estuary, and it's said that legendary author Robert Louis Stevenson wrote part of his famous novel Kidnapped here - there's even a mention of The Hawes Inn in the book.Just 10 miles from the city centre, the South Queensferry lodge is an ideal base for visiting Scotland's historic capital, where you can explore Edinburgh Castle, the shops of the Royal Mile or the city's many museums and restaurants.Also perfect for golfers, it's within striking distance of Carnoustie and St Andrew's and close to the birthplace of golf at the East Neuk of Fife. The Tudor Gothic Dalmeny House and Georgian Hopetoun House are also well worth a visit."}