{"user_rating": 4.5, "review_count": 201, "name": "Innova Sultanahmet Istanbul", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I had great time in Istanbul. Hotel was amazing and clean. Best hotel at that price!", "title": "Great vacation!", "helpfulness": 2, "user": "Said A", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125005081}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We had a great 3 night stay here in February 2012. Innova hotel is only a short walk from the nearest tram stop on the main T1 line and is within 10 minutes walk of Hagia Sophie, Blue Mosque, Topkapi Palace and Grand Bazaar so a great location. We took the metro and tram from the airport and it was just under 1hour travel, a really easy journey.", "title": "Great hotel in central location", "helpfulness": 4, "user": "Nicola B", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124911880}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Our room was really clean, spacious, with an amazingly powerful shower and a safe. They provided complimentary fruit and half bottle of wine for us to enjoy.", "title": "Hotel Innova Sultanahmet", "helpfulness": 3, "user": "deepblue74", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124873153}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Hotel staff were all increadibly helpful and friendly giving excellent restaurant recommendations and hamam recommendations.", "title": "Innova Sultanahmet Istanbul", "helpfulness": 3, "user": "Barry B", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124216637}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "While in Istanbul we ate at three great restaurants - Leb i Deyra in Kamraci (a great rooftop restaurant with delicious food), Sarnic Restaurant (a characterful restaurant in an old water cistern in the city - just behind Hagia Sophie) and Sur Balik fish restaurant (delicious fish and hotel staff made a reservation for us and organised a restaurant taxi pick up.)", "title": "Innova Sultanahmet Istanbul", "helpfulness": 7, "user": "Barry B", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123540979}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "My friends and I stayed for 3 nights at the Innova Sultanahmet at the end of December in the old city area of Istanbul. We all thought it was a great hotel, very new and clean in a fantastic location really close to the blue mosque, hagia sophia and the amazing grand bazaar!", "title": "Great location, excellent service!", "helpfulness": 5, "user": "steven r", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123156838}, {"rating": 2.0, "title": "I was going to give a \"5\" until...", "text": "I was more than prepared to write an excellent review for this after my first stay of 2 nights in end of April 2012. Like most first-time visitors to Turkey, we chose the same hotel for entry and departure for convenience. After our wonderful stay, we have no hesitation whatsoever and actually looked forward to the return to Innova on conclusion of our wonderful trip in Turkey. It was on our return that the problem occurred. We arrived at around 10:30am, after an early morning flight from Izmir. We did not request early check-in, but the gentleman, who was also the one who greeted us on our first trip, apparently recognized us and enthusiasticly offered us another hotel in Sultanahmet because (1) Innova was very fully-booked and they needed more than usual time to clean up; (2) he did not want us to waste time on waiting, which should be better spent on sight-seeing; and (3) the hotel he now offered (Lenvi Spa - which I will submit a separate review) is much much better in terms of room size and deco and we would \"forget about Innova\" right away. He said Lenvi has available rooms right away and he could arrange to have us transferred there by taxi. In order to minimize inconvenience to both, we conceded and agreed to be taken there. Unfortunately, when we arrived, we were told, not at all in a courteous manner, that (1) no room was ready; (2) check-in time is 2pm (we were actually almost given a lesson on standard hotel check-in time); and (3) Innova has not communicated with them on our unexpected arrival! It seemed to be our fault to have landed at their entrance without prior notice.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 7, 2012", "id": 129492910}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We told Levni to call up Innova and the guy just kept apologizing on the other end but did not offer to take us back. After some heated argument we were finally showed a room which was being cleaned. Since we did not want to have any more dealings with Innova, we agreed to stay at Lenvi for our last night in Turkey. By the time we checked in it was noon.", "title": "Elegant but friendly hotel", "helpfulness": 1, "user": "Alice C", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129256264}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I am saying all these to alert fellow travellers that this sort of service is unacceptable by any standard. On reflection, we should not have agreed to leave. Innova was probably heavily over-booked (thanks at least partly to the excellent reviews at Tripadvisor) and given we had booked months ahead at a very good rate (140 euros per night), they might as well turn us away for better prices. To be fair, the hardware of this property is very good - large and quiet rooms, nice shower, clean, safe, excellent breakfast (variety may be limited but the quality is excellent, much better than Lenvi's), very convenient to sights (except the steep climb to the tram stop); but you will have to give a second thought on the soft side, particularly if, like me, you have made a booking at a good rate. Or else you just turn down whatever \"attractive\" offers they make to try to turn you away.", "title": "Excellent hotel..centrally located, yet nestled away from all the chaos", "helpfulness": 2, "user": "Divz", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129149203}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The Innova is wonderfully convenient to all the unmissable sights in Istanbul: Topkapi, the Blue Mosque, Hagia Sofia, the Spice Bazaar, the Grand Bazaar, the seaside -- you name it. Staff is helpful, polite and friendly, rooms are modern and spotless. Although the actual street is not elegant, the hotel is. And you feel cut off from the noise and street traffic a few blocks away.", "title": "Excellent hotel in Istanbul", "user": "Izzet Z", "date": "April 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128532804}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We spent 5 night at the Innova,with absolutely no glitches, recently (april end, 2012).", "title": "What a nice hotel!", "helpfulness": 2, "user": "Tiara K", "date": "April 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127419987}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I spend 3 nights in this hotel in april 2012.The best quality for the money i spend(366 EURO FOR 3 night).The hotel is new and absolutely clean,rooms are quite big,very good sound isolation-it is especially important for istambul-noisy city.Reception is very polite and absolutely friendly.Breakfast is great.I would reccomend for sure to stay in this excellent hotel.", "title": "excellent hotel", "helpfulness": 2, "user": "yulia363", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127199612}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Despite, I have been travelling very often during the last 10 years, time to time, I still find hotels that can surprise me with the very good professionalism of its staff and general presentation of the instalations! Innova Sultanhmet is surely one of these good Hotels that I could enjoy all things that someone that it is abroad he is expecting to find. Besides this, it has the fortune to be located nearby to one of the most important historic places of Istanbul", "title": "Still getting good surprises", "helpfulness": 2, "user": "Vasco G", "date": "March 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126980632}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This was the best hotel I have stayed at. The view is beautiful, they had great service. The rooms are huge and they are clean, and they are cozy and comfortable.", "title": "Excellent", "user": "salabdul", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126918262}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I would recommend staying at this hotel when you visit Istanbul", "title": "New hotel, excellent service", "helpfulness": 1, "user": "Andriana S", "date": "March 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 126390277}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I visited Isanbul in Feb 2012 and stayed at Innova Sultanahmet. My stay was fantastic, lovely rooms, beautiful decor, excellent breakfast. I will definately recommend it!", "title": "New Hotel In the center of old town", "user": "Catvics", "date": "March 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 126225737}], "location": {"country": "Turkey", "continent": "Europe"}, "stars": 4, "variance": {"poor": 6, "average": 14, "very good": 59, "terrible": 1, "excellent": 121}, "slim_ranking": 0.12543554007, "description": "Located in the historical Sultanahmet district of Istanbul's old city, this hotel is only 500 metres from the Blue Mosque. Innova Sultanahmet Istanbul offers luxurious accommodation, spa centre, panoramic rooftop terrace and free Wi-Fi throughout the hotel. The comfortable rooms of Innova are well proportioned, elegantly decorated and have tasteful modern furniture. They all feature extra large beds, air conditioning, LED TV, minibar, complimentary tea and coffee making facilities, en-suite shower room finished in full marble and with most rooms enjoying a private balcony. Guests can enjoy a rich breakfast buffet in the morning with both traditional Turkish and continental cuisine on offer. Meals are served during lunch and dinner at our à la carte Revan Restaurant and our Mey Bar and Lobby Bar offer both alcoholic and soft drinks. The spa centre of Innova Sultanahmet Istanbul offers a fitness room, a traditional Turkish bath, a sauna room and spa treatments including massage. There is a conference/meeting room with capacity for 100 people and there is also a cinema room on site. The hotel is just 800 metres from the Topkapi Palace and 600 metres from Hagia Sophia. Cemberlitas Tram Stop is only 100 metres from the hotel, offering easy access to many other sites of interest in Istanbul."}