{"user_rating": 4.0, "review_count": 561, "name": "InterContinental Hotel Tokyo Bay", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "Snagged a rate of $500 for a three-night stay in late June on their website. Booked a \"city view\" (rather than the more expensive Bay View room), and got a pleasant view of the city and the river. Expedia rate wasnearly twice as much, so we knew we were getting a good deal. Room was large (for Japanese standards), with two double beds. Had we not been jetlagged, we might have asked for one queen bed (which was what we had requested), but we are both skinny so we just used one bed. Bed linens were gorgeous and bed heavenly. Bathrobes were provides, as were Elemis bath products. The huge (for Japan standards) bathroom contained both a shower and a lovely deep bathtub. Free internet upstairs in the \"business center\"; there were only two computers but we never had to wait. Room service at what appeared to be reasonable prices available at all ours. Faultless staff. Hotel was ten minutes' walk to the Hammamatsucho JR station; two minutes walk to the Takeshiba station. Area was close to the water nd not at all crowded. Overall, a GREAT deal. especially for the deeply discounted rate. Of course, a cheaper business hotel or tourist class hotel would have been cheaper, but it was wonderful yo have such luxury by paying just a bit more.", "title": "I wish I could live at the Intercontinental Tokyo Bay", "helpfulness": 1, "user": "PT1976", "date": "July 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 34281781}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "Positive:", "title": "Japanese exquisite service", "user": "magoulet", "date": "June 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 32323444}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled on business", "text": "Rooms are normally sized, the bathroom is excellent. Marble counter, electronic toilet, therapeutic bathtub, corner shower with glass walls. Very good selection of soaps, lotions, etc... The breakfast selection is very impressive. Excellent quality food, including Japanese and Western styled breakfast items. Extremely quiet rooms. Amazing view from the higher floors. The Business Support Center offers good drinks and quality food, along with the expected Japanese service for all your needs (translation, reservations, insights about the city, anything to make your stay comfortable).", "title": "Excellent", "user": "SunitaMumbai", "date": "June 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 31360215}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Negative:", "title": "Wonderful property on Tokyo Bay", "user": "robertocusato", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 31359165}, {"rating": 4.0, "title": "Very good and convenient", "text": "Spent 6 nights at the Intercontinental as part of a business trip. Several travel guides had warned against the Hotel somehow isolated location, but in reality the Hotel is very well connected through the JR Yamanote line (Ginza in 5 minutes, and easy connections to Shinjuku and Roppongi). I also had business in Odaiba for which it was convenient as well. The room was spacious and had great views of the harbour. Service was good like it is often the case in Japan, but room service (in room dining) was really efficient as well as dry cleaning. I would certainly consider staying there again when in Tokyo.", "user": "MCMember", "date": "December 8, 2006", "id": 6348922}, {"rating": 5.0, "title": "Very nice", "text": "Rooms are clean, modern, if small, and some have great views of the rainbow bridge and Tokyo Bay. It is a pleasant 10+ minute walk away from JR station, and right next to the hotel is a smaller, privately operated metro line which is more expensive than JR but provides a faster link to city centre from this hotel.", "user": "A TripAdvisor user", "date": "May 23, 2006", "id": 5204690}, {"rating": 4.0, "title": "Good Hotel.. with some Minor Grumbles", "text": "Food and drink were not as expensive as we feared in the lobby restaurant, but the nightclub on the higher floor needs more dough. Delicious food!", "user": "sg_tripper", "date": "May 12, 2006", "id": 5064758}, {"rating": 4.0, "title": "Off the beaten path but wonderful hotel", "text": "The limousine bus service was 3000 yen from NRT airport and took 1,5 hours due to many other stops on the way (we were last on the bus when it finally reached the hotel).", "user": "JLF923", "date": "April 29, 2006", "id": 5017865}, {"rating": 5.0, "title": "Awesome by the bay!", "text": "Would definitely stay again. The location would remain the only slight negative point.", "user": "swash", "date": "January 20, 2006", "id": 4366472}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Stayed here as part of a recent trip to Japan for 2 nights. Location is so so, as it is near a train stop, but not a very useful one. To get anywhere you have to either walk 10 minutes to a subway or change trains a bit, but this is not a major issue. Hotel lobby was elegant and very quiet. We saw no one pretty much in the lobby area at any time we were in the hotel. Check in and check out were very painless with a friendly staff. Received a very nice room with a spectacular view of Tokyo Bay. Room was very nice, clean and had a spacious bathroom, with a tub that was right next to the window so you could overlook the bay. Club lounge was adequate and served a satisfactory breakfast, but nothing extraordinary. Overall, a nice hotel and for the 18,000 yen I paid per night, very much worth it.", "title": "Quiet hotel with great views of Tokyo Bay", "helpfulness": 1, "user": "antonius66", "date": "April 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 4.0, "rooms": 5.0}, "id": 27777485}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "My first time to Tokyo and I had no idea where to book a hotel. I had read a review that I should get a room with an overview of Tokyo Bay and so I did – Thanks it was fantastic. Instead of looking into a wall or another building you now have a magnificent overview of the Tokyo Bay harbor. It’s about 25 min walk from the shopping street “Ginza”. Our room was big with a spacious bathroom.", "title": "Fantastic view", "user": "Ksvaneborg", "date": "February 12, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 24511552, "likes": {"liked": "— Tokyo Bay overview", "disliked": "— No free internet"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "On a one night stop in Tokyo on my way to Singapore I stayed at the Intercontinental Tokyo Bay. The hotel staff was very friendly and the view from the hotel was amazing. As a girl traveling by herself through Tokyo I was a bit nervous at first but the hotel staff was very helpful. The morning that I was there I woke up very early to go to the Fish Market. The concierge gave an overview of the market, called a taxi and gave me the card to the hotel in case I were to get lost I was to show the card to the taxi driver. In the mornings you can get a awesome view of the sun rising over the Rainbow Bridge and in the evenings you can enjoy a relaxing time at the Sunset Lounge while watching the Rainbow Bridge display it's lights.", "title": "Fantastic Hotel", "user": "YRamos82", "date": "October 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 20649254, "likes": {"liked": "— Views and staff", "disliked": "— Not in thte center of the action"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I would stay here again in a heartbeat!", "title": "Fantastic hotel in Tokyo -- great hub for families not only business", "helpfulness": 1, "user": "S3CR3T3X3C", "date": "August 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18492469}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This is a really nice hotel. I stayed there with family in July 2008. The rooms were HUGE for Tokyo and if you can get a room facing the bay the views are to die for. The rooms are spotless, immaculate and feature those amazing TOTO washlets (look it up ;-).", "title": "Beautiful View", "user": "defreitasgirl", "date": "January 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12742171, "likes": {"liked": "— The view and location.", "disliked": "— Nothing."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "Family of 4 (Parents & 2 teens) - 10 nights in Tokyo. Did the research and as expected, rates at Ryokans and hotels were numbingly expensive. Ryokans averaged maybe 7000y -20,000y per person per night", "title": "Surprisingly good choice for family vacation", "helpfulness": 8, "user": "family-mcbirnie", "date": "October 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10384901, "likes": {"liked": "— View, Room, location, staff, price, service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "(converting to avg Au$70 - AU$200 per person per night), and hotels were quite restrictive in # persons per room (max 2 or 3 with rollaway). With Ryokans, we would most likely be in the suburbs (so allow extra for transport), sharing bathroom facilities, living in a spartan environment - difficult with 2 restless teens. Took a punt and emailed Intercontinental TB after reading reviews, and got a great rate for Tokyo of 17,500y+tax per night hoping that the room would accommodate 4 persons. Err I may have not mentioned that we were a party of 4.", "title": "Nice hotel", "helpfulness": 2, "user": "Ash7777", "date": "July 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8203094, "likes": {"liked": "— service level, views", "disliked": "— was a bit old for intercontinental standards"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "Let's see the positives:", "title": "Well looked after at the intercontinental", "helpfulness": 3, "user": "lindsay56", "date": "June 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7804259, "likes": {"liked": "— excellent service,good food", "disliked": "— no pool"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "- Great view of Tokyo Bay: - 17th floor: a huge plus after a long day of sightseeing (being in a country where we can't communicate makes touring doubly exhausting)", "title": "Jaw Dropping Views", "helpfulness": 2, "user": "AWOS1244", "date": "April 9, 2007", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 7301947, "likes": {"liked": "— View from room, cleanliness, amenities.", "disliked": "— Lack of comfortable walking distance to restaurants, shops."}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "- Luxe bathroom amenites (and not just one each of the little bottles, but 4 of each item!)/ comp chocolates/ comp plate of fruit on arrival, and again during our stay.", "title": "Not to Inter-continental Standards", "helpfulness": 5, "user": "allthroughoutasia", "date": "February 7, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 6752631, "likes": {"liked": "— View of Tokyo Bay from the bathtub", "disliked": "— Dirty and well-worn carpets and common areas in the hotel."}}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 19, "average": 87, "very good": 270, "terrible": 8, "excellent": 177}, "aka": "Intercontinental Tokyo Bay", "slim_ranking": 0.239130434783, "description": "You can practically feel the heartbeat of the city from the impressive InterContinental Tokyo Bay. Convenient for business or pleasure travel, the hotel puts you in easy reach of business, shopping and entertainment centres including the World Trade Center Tokyo, Shiodome and Ginza. The Imperial Palace and Shiki Theatre provide tastes of culture."}