{"user_rating": 4.5, "review_count": 2043, "name": "InterContinental New York Times Square", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "I stayed at the hotel for a conference, and while staying in a hotel 5 miles from my house in my least favorite neighborhood was not my ideal, InterContinentals are pretty swank and I was looking forward to a nice stay on the company dime. The hotel was quite beautiful, but some of their setup decisions made the stay less comfortable rather than more. The lobby was very sleek, but that sleek desk left only enough space for two workers - not nearly enough to efficiently check in the volume of conferees trying to check in. When I got the room, I did my usual scoping of the room, including the mini-bar. One of the boxes was not as readily labelled as the others so I picked it up to see what it was - turned out to be a \"Passion Kit.\" I only then saw the sign that anything picked up from the tray would automatically be charged to the room. Oops, didn't want that showing up on the bill when I do my expense report. It took 2 calls to reception (I was hung up on once) and talking to 3 (THREE!) people to get the charge removed. The cool modern sink has a design flaw in that the towel bar is located under the sink, leading to lots of forgetting to get the towel before I washed my hands and getting myself wet grasping for the towel afterward. Also, while the straight-down shower was cool looking, it also made it inconvenient to adjust the water temperature before fully getting in (my boss ended up drenching herself, fully clothed, because she didn't notice the setup in time). Lastly, they have a computer in the room, which is cool, until you realize you need to pay if you intend to use it to do basic things like check your email. So, a big chunk of desk space ended up being taken up by something I never used. If you're a big fan of obnoxiously modern decor you'll probably love this hotel, but I just found it a bit annoying.", "title": "Form over function", "helpfulness": 1, "user": "parslane", "date": "September 28, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 118717119}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We have stayed here a few times and we are always very happy. The location is great if you want to be near the theaters and Times Square. The rooms are of typical size for NYC but they are well appointed and have really comfortable beds. We did not have any contact with staff with the exception of check in, so I can't comment on this. We also did not eat there because it is very expensive. The hotel is also expensive but sometimes you can get a good rate if you shop the websites. I would never stay here if I had to pay the regular rates. (Or anywhere for that matter!)", "title": "Great hotel, great location", "user": "Barnaby050", "date": "September 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 118693425}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Hotel and rooms are lovely. Bed was super comfortable and temperature control of the room perfectly worked to set and keep the temperature to what you desire. Bathroom was immaculate and the city view from 31st floor was unbeatable. Todd English bakery connected to the lobby is one of the best in NYC. One particular person at front desk was a bit grumpy at 6 am, but all others were cordial or friendly and very helpful. Location is and is not a plus. Great for walking to time square, theaters, etc. But if you catch a taxi out front on 44th, you wil get stuck in the traffic craziness of Time Square. Of course, you can easily walk a few blocks to catch a cab on another street. My only complaint is that I never got another email back from the entertainment concierge who was supposed to help with nighlife reservations.", "title": "Beautiful room, great location and fabulous bakery on site", "user": "pariscoh", "date": "September 27, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118638530}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I was scared in searching for a NYC hotel since there are so many reports of bed bugs.... but with this hotel being on the newer side I decided to try it out. (I'm generally very loyal to Marriott and Hilton - but wanted something newer in the heart of NYC.) I was very happy with the hotel. It is a great location (walking distance to nearly everything, and on the quieter side of Times Square, more towards Hell's Kitchen), decent sized rooms, and nice staff. I very much enjoyed the concierge team and they were fantastic at pointing us in the right direction for restaurants. They do have some \"sneaky charges\" like having a computer in the room, but charging you to use it (that isn't made clear), and leaving water and snacks out with no real sign to say how much they are (with sensors, so they charge you if anything is moved/touched) but since I travel often I am skeptical of anything in the room and never use it/touch it, etc... So just be careful! But good hotel - I'd stay again. And the Todd English restaurant in the hotel (Ca Va) is also great! (There is also a Shake Shack at the bottom of the hotel, as well as a Subway Station.) :)", "title": "Nice NYC Hotel. Great for personal or business travel.", "helpfulness": 1, "user": "AXO1010", "date": "September 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118619926}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I'm becoming a big fan of Intercontinental hotels, the beds are incredibly comfortable and huge. Service fantastic as usual, great food, and only a few minutes walk from the centre of times square.", "title": "couldn't have asked for a better hotel", "user": "dannn88", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118558669}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Stayed here for 3 nights for a business trip. Excellent business hotel, close to times square and walking distance to fashion district as well as Javitz centre. Checkout Smiths across the hotel, relaxing live music and reasonable hotel.", "title": "Excellent business hotel", "user": "Jay S", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 143319748}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Spent five nights last month at this hotel with my wife on a vacation trip to NYC, and loved it. We had an upper floor \"Sky Suite,\", I believe it's called, which offered a special view of NYC. What I mean by that is that this column of rooms juts out a bit from the rest of the building so that you have windows on three sides. So, great views looking uptown and downtown, as well as to the east. Given the towers surrounding the hotel, you by no means have an unobstructed view even from a high floor. But looking out toward various other skyscrapers and bright lights is fun.", "title": "Great vacation visit", "user": "Southside", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143299191}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Sorry I can't recall the exact room number, but I'm sure hotel reservations staff will know what I'm talking about for those who want to specify this", "title": "Great central location @ X2", "user": "Lokum123", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143289746}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The room itself was very fine. It basically is one big room, with a dressing area kind of divider between the bed area and living area. Two nice tvs. Situated at the end of the hallway, certainly quiet, though from a previous stay (reviewed previously) I don't recall noise being a problem at all in the hotel anyway.", "title": "3rd stay - Staff are a credit to the hotel", "user": "TrekkieStar", "date": "October 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143283150}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Free and fast internet access by virtue of my Priority Club Platinum and/or Intercontinental Ambassador status. The latter also got us a free movie, which was a nice little perk.", "title": "Efficient and comfortable.", "user": "david p", "date": "October 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 143117013}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "Very nice property centrally located at the corner of W 44th Street and 8th Avenue just a block from Times Square and a number of theaters, shops and restaurants. Received an instant upgrade upon check-in to a corner SkyView room on the 31st floor thanks to being an Ambassador member. The room featured a very comfortable deluxe king bed, floor to ceiling windows offering superb views of the city on dual windows along with a very nice bathroom. The room however wasn't as large as I was expecting compared to other InterContinental hotel properties that I've stayed at. The restaurant on site \"Ca Va\" was very nice. The food was outstanding along with the service. Will not hesitate to stay at this hotel again.", "title": "InterContinental New York Times Square", "helpfulness": 1, "user": "evvtraveler", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143422890}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I should stipulate that this hotel is out of my normal budget, for both personal and business travel. I stayed on a Friday night after business meetings, using a free night voucher that I had from IHG. (Sign up for their great credit card, which gives you platinum status and a free night each year.) My room would have cost around $540 including tax, if I had paid for it.", "title": "What's not to like?", "helpfulness": 2, "user": "AndyAtl", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143406702}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "The room was decently sized, not large but just right -- unlike closet-sized rooms I have had in NYC in the past. The bathroom was very large and included a huge shower stall with a rainfall shower. All the furnishings were very high-end and tastefully designed. It was just what I would expect at this price point. I also enjoyed great soundproofing to go with the fantastic view toward the Hudson River. I slept like a baby.", "title": "Amazing location!!!", "user": "emzfairydust", "date": "October 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 143378637}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The hotel's location is just far enough from Times Square to be out of the chaos there, but close enough to get to Times Square or anywhere else in town quickly. There is a subway station right next door to the hotel's entrance (A-C-E lines for north-south travel). 46th street \"restaurant row\" is a short walk away.", "title": "Good business hotel", "user": "Snobs_Travel", "date": "October 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 143355053}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "I invited some friends to meet me in the lobby lounge, We sat near the fireplace and enjoyed a bottle of wine before going elsewhere to dinner. And of course we had to visit Times Square late in the evening. I have to tip my hat to Mayor Bloomberg. His recent land-grab in Times Square, which drastically reduced the number of available lanes for vehicles, has created a vast pedestrian plaza where taxis used to roll. I have been to Times Square many times, usually at night, and the sidewalks were always so crammed that I could barely move -- much less enjoy the view. Now there is space for thousands of people to mingle in a low-stress way. And most of the billboards are now enormous HD displays. Very impressive.", "title": "Great atmosphere", "user": "Valerie S", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 143339332}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "The Intercontinental has definitely kept up with the times... staying here definitely changed my mind about the hotel brand. The design is contemporary (but not stark) and I felt as if I was in someone's beautiful home. The beds and bedding are fabulous and the bathroom was beautiful as well (not your typical hotel decor - so much better!). There is spectacualr fireplace in the lounge where you can sit and relax after a long day out. The restaurant is so warm and comfortable and the food is top notch! I would recommend this to anyone coming to the city for business or pleasure - what a treat!", "title": "The I/C Times Square ROCKS!", "helpfulness": 2, "user": "FPearson", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143059304}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "My husband and I stayed at the InterContinental NY Times Square to celebrate our 15th anniversary, and the hotel was everything we hoped it would be, and more. We were put in a corner room on the 17th floor, and the floor-to-ceiling windows offered us a great view of the city. We were just a minute walk to Times Square, and a subway entrance was right out the front door of the hotel. We mentioned to the employee checking us in that this was our anniversary, and he offered to send up a bottle of champagne, but we told him that we don't drink. The next day we came back to our room to find a plate of chocolate-covered strawberries! In fact, all the employees were helpful and friendly.The bed was probably the most comfortable hotel bed we have ever slept in. We ate at the nice onsite French restaurant, Ca Va, and the food was wonderful.", "title": "Wonderful stay!!!!", "helpfulness": 1, "user": "Emily R", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143039297}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Do not hesitate to book this hotel!", "title": "Perfect hotel, Perfect Location - Highly Recommend", "user": "Mary Jane C", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142961229}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Recently stayed at the InterContinental NY Times Square - didn't want to leave! You will love their comfy beds and walk-in rain showers. Perfect NY location for a Broadway Show, Pre- or Post-Cruise visits, a business meeting, or just sightseeing and superb dining, - this is where you want to stay! Near Restaurant Row, although we dined in the hotel's Ca Va Brassiere (operated by Chef Todd English) which was excellent and not overly expensive for New York. If you are taking a cruise from New York, add at least one night here, it's a short cab ride to the port.", "title": "Great location and new hotel!!!!!!", "user": "HAP-TRAVEL-Canada", "date": "October 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142959829}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Room was $600 per night. Great location 5 minute walk to Times Square and less to several Broadway Theaters. One block away from bustle of Times Square so bit more quite at the hotel. Close to Central Park just 10 blocks north, and short cab ride to Soho and the Village. The Hotel is 2 years old and the rooms are nice. Comfortable beds, pillow choice, in-room dinning (24 hours), mini bar, and nice sized washrooms. Staff was helpful and friendly. Needed a few items and they were promptly brought up to the room. The concierge was quick to get a taxi or limo with a few minutes’ notice. High speed elevator to our rooms on floor 33 and we did not have to wait. There was no pool and you have to pay $11 per day for internet PER item. It was cheaper to upgrade to ambassador club ($200 annual fee) for our 4 night stay (4 kids each with an item) and get the free internet. We had room service breakfast each day and it arrived on time, hot, and tasty. I would stay here again.", "title": "Very enjoyable stay", "helpfulness": 3, "user": "noplacelikehome617", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142865928}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We spent 2 nights at this hotel. It is a couple blocks outside Times Square, which I knew beforehand because I would never stay right in Times Square - too crazy for my taste. But the overall location is wonderful, easy to get around from there. The hotel is just a year old, as many of the staff proudly told us. Right near all the theaters.Shake Shack on the corner, but the line always looked long and we never had time, sadly. We arrived early (about 1 PM) and our room was ready, which was great. The room itself was a corner room on the 25th floor with fabulous views west to the Hudson and north. The views were just outstanding! The room had one king and was comfortably furnished, with a desk and a computer already there, and plenty of outlets around the room (important for two people who each travel with their own computer). Very pretty fabrics used in the drapes and upholstery. The bed was a little squishy for me but my husband loved it. BIG TV. The bathroom was gorgeous, lovely choices of blue and white tiles and travertine counter, and a really large shower with overhead rain shower and handheld shower attachment as well. Lots of towels and nice Gilchrist and Soames products. We had room service breakfast both days, and the food was very good. In addition, we ate at the bar twice and at the restaurant once. The bar menu, which is also by Todd Engllish, is excellent. Waitstaff are friendly and helpful. The restaurant, Ca Va, is very good. Because of insane traffic due to the UN, we probably used the hotel restaurant more than we usually would in NYC, so we were glad that the food was very much above average. The staff at this hotel are uniformly friendly and helpful - the bellmen, who called many cabs for us and always recognized us, the room service staff, the bar and restaurant staff - everyone we dealt with seemed genuinely happy to be there and to help you. The bar/lounge area is comfortable and attractive and the lobby has a dramatic outdoor courtyard area behind the front desk. Intercontinental has really done itself proud with this hotel, and I would definitely stay here again.", "title": "This is a terrific hotel!!", "helpfulness": 1, "user": "Cambridgtravler", "date": "September 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118456593}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We choose the Intercontinental because of it's name and it's location. If you want to be in the center of things, this is one of your choices. Service is really bad. We found ourselves calling 3 times every time we needed something. Cleaning? A joke. They just change your towels if you need and that is that. Waiters were kind, but the rest of the staff are not even polite. And we were paying more than $600 per night.Rooms are average sight, no bathtubs, very little place to put our things.", "title": "If you want the location and all the rest dowsn't bother you", "helpfulness": 2, "user": "Mifiki", "date": "September 21, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 118431235}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I don't know the other hotels in the nearby, but I will be trying something else next time.", "title": "Honeymoon at the InterContinental New York Times Square", "user": "micchris", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118430806}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Good luck.", "title": "Lived upto expectations", "user": "doublechin", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118367204}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We had a fabulous time at the InterContinental. The hotel room was spotless, quiet no street noise, scented air circulating, and the service was fantastic. We mentioned that it was our honeymoon and received complimentary champagne & chocolate covered strawberries:) The bed was fitted with nice bedding and a gorgeous bathroom. Really enjoyed our stay and would definitely recommend it.", "title": "Expected first-rate service, was not disappointed", "helpfulness": 1, "user": "allmedia8", "date": "September 19, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118314093}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Right near TIme Square - only about 120 yards. Walk past Pizza, Pasta restaurants, Fine dining, the Broadway Shows - right close to Lion King - about 5 minutes walk. Large pharmacy and mini mart with Fresh fruit in Time square - good when travelling withb kids and just need a few things. Direct access to Subway - One Stop from Penn Station so safe easy access to airport Air train via Jamacia LLH Line. Direct access to teh Hop on hopp off buses in Time Sqaure - no problems with taxi finding your hotel. Rooms were elegant, modern and the bed was amazing. Super quite because of double glazed windows, large floor to ceiling windows - stunning rooms. Computer in room set up for Internet was a stunning idea - check out activities. Shower was amazing - no wate saving devices here. Luxury robes & slippers. Vladamir was great welcome guy and could get a cab at any time.", "title": "Great Location elegant, safe haven, heavenly bed", "user": "MushuAnd", "date": "October 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142833563}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I stayed at the Intercontinental Times Square over one night, for a business meeting. The first room I was assigned was on the 17th floor, facing the street. The room itself was very nice: Large TV, generous size working desk, a decent size bathroom with walk-in shower. All seemed new and clean. However, if you are sensitive to noise, you will find the street-facing rooms somewhat loud as the windows are not sealing off the traffic noise. This is mid-town NYC so noise is somewhat expected if you choose to stay right in the middle of it... But perhaps better windows would have done a better job with this. I called the front desk and within minutes was moved to another room, which they said was \"facing the river\". The river could not be seen but the noise was gone and I was very happy. All in all, I really liked this hotel - had a good night sleep in a modern hotel with an unbeatable location, if midtown NYC is where you want to be.", "title": "Nice place, modern and very well located", "user": "Traveler_Eyal", "date": "October 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142741745}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "In all my trips to New york i regularly stay at the Intercontinental Barclays, but in my last trip I went on a family vacation and decided to stay at the Intercontinental Times Square, the choice could have been more successful. The rooms are in perfect condition and the service in all levels (from reception to maid) was outstanding!!", "title": "Excellent!!", "helpfulness": 1, "user": "RicardoMuci", "date": "October 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142734981}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Stayed with the family. Great corner room with floor to cieling windows. Great location just minutes from Times Square. No noise. Go to Hells Kitchen just blocks away for great food! But be prepared for a small room which all hotels in this area have.", "title": "Absolutely great hotel", "user": "SALEM_JOHN", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142674956}, {"rating": 5.0, "title": "No problems", "text": "My girlfriend and I stayed at this hotel a romantic three day break. I could not fault this hotel. The room was trying enormous and the bed was also Enormous. The staff were all very friendly and went out of their way to please us. My only criticism would be the bar where two orange juices cost $15! The hotel is in an amazing location, About two minutes from Times Square!", "user": "Camjito", "date": "October 11, 2012", "id": 142552043}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed twice over a 10 day period at the Intercontinental Times Square New York City. The two periods were separated by a one day trip to North Carolina. This is not my first time staying at this hotel, having been here a couple of times before. However, I must say that my experience and impressions this time round were disappointing enough to make me post this review here.", "title": "A whole lot of attitude in this hotel!", "helpfulness": 4, "user": "SingaporeGuy10", "date": "October 5, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118962074}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "First the positives - excellent location within the heart of Times Square, next to the Subway, lots of eateries nearby, etc. The hotel is modern and generally clean and well maintained. Rooms are however, small though this is quite average by NYC standards.", "title": "Friendly Staff", "user": "Mike E", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118931892}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The negatives - its really mostly about the attitude of the staff. From the front desk, to the restaurant staff (with the exception of the great concierge and bell boys) it seems that everyone has this bad attitude towards hospitality. They really need to learn from the likes of Ritz Carlton or even some of the better family run hotels. You get the immediate and distinct impression that they are so cold and \"above it all\". Hardly any smiles from the reception staff and certainly no apologies when mistakes are made.", "title": "Great NYC city hotel", "helpfulness": 2, "user": "DrBob5", "date": "October 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118866153}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "For example, I highlighted to one of the front desk staff that when I got my room, there was a half filled bottle of mineral water sitting in the minibar area. There was no apology made! Housekeeping staff were a little better, though not much.", "title": "excellent hotel...staff has to improve - breakfast try somewhere else", "helpfulness": 1, "user": "camarotte", "date": "September 30, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 118788111}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "For such an expensive room to stay in, you should expect better, warmer and more hospitable service from all staff.", "title": "Great location", "helpfulness": 1, "user": "SueL_10", "date": "September 29, 2011", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 118738655}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Location is exellent, near Times Square/ theaters, good restaurants nearby (9th avenue). Our room had a magnificent panorama view over Manhattan, good size, clean, great beds, barthroom ok. But..everything is very expensive: rooms, minibar, restaurant, above all the breakfast, no buffet available, just a la carte. The breakfast was not included, but that`s, I heard, is usual in NY. We had dinner at the hotel restaurant once, and it was nothing special, except the price! Our room had a pc, but we didn`t use it. Television was ok, but the remote control didn`t work from the bed, you had to be about 1 m distance. The lobby staff was courteus and helpful. Good design in the hotel, but maybe they are trying to be too contemporary. If I come again, I will propably choose an other hotel.", "title": "Overestimated hotel?", "helpfulness": 1, "user": "Leenav", "date": "September 24, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118541285}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I travel every week for work and this has been the worst experience ever. The staff is extremely unaccommodating, borderline rude! I have NEVER experienced anything like it. My husband and I went to New York for my birthday and they ruined it. I will never stay at an Intercontinental Hotel again.", "title": "Worst Experience Ever!", "helpfulness": 13, "user": "Frogrotti", "date": "September 24, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118540611}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I've stayed in a lot of hotels in NY, and this is among the best. Good sized room, clean, great bed & pillows, well-designed and large bathroom, professional and courteous staff. The decor of the rooms and hotel is modern but warm. It has a hip restaurant run by celebrity chef Todd English, and the food was excellent. The guest rooms come with computers to access the internet or other on-line services. The location is a block from the heart of Times Square. I will definitely return the next time I need to stay in the Times Square area.", "title": "First Class Hotel in Times Square", "user": "SoCalTMac", "date": "September 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118528779}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Pretty darn perfect. The staff was very helpful, friendly and fun. Nice bar, again great service --- but closed a bit too early. The room was typical contemporary for now a days, but very comfortable, great bed, and was always spotless. It's all a class act, and a block away from the energy of Times Square. This is nice, because that block gives you respite from the noise and hubbub. Easy walk to shows, tours and restrauants.", "title": "Not a surprise", "user": "Mike90275", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118496799}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I checked into IC/Times Square with my girlfriend to have a night-out in the city. They gave us room assignment with a sheet of paper. It said that there will be a power outage between midnight and 8AM. I was a little puzzled that a 4 star hotel can have no electricity in the room for an extended period. The desk clerk said, when asked \"Is this real?\", \"Won't you be sleeping?\". Then I read the fine print that indicated it is only for 5 floors or so out of 30 floors they have! Of course I protested (why would I check into Manhattan hotel if I were to sleep all night?) and the clerk without any resistance changed our room to high floor with no electricity interruption without saying anything. She was smiling all through, but in retrospect, they were trying to con me? I had made the reservation through their own website, so it was not like I used priceline. What they attempted was that without warning or anything they just assigned a room which they knew because of the power problem was not going to be sold at a regular price and hoping we will just take it unknowingly or thinking it's just the way it is. Some foreigners might even have language problem and don't understand the situation fully. What they should have done was maybe offer the customer these rooms for half the price with explanation. What they did instead was one of the lowest class act I have ever encountered at a hotel - not to mention 4-start hotel. Although the room was okay, being modern and clean but small, just to think that we were almost robbed didn't make us feel good.", "title": "Beware of what they tell you", "helpfulness": 5, "user": "Art-Anais", "date": "September 22, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 118468162}], "location": {"country": "United States", "city": "New York City"}, "stars": 4.5, "variance": {"poor": 52, "average": 165, "very good": 675, "terrible": 35, "excellent": 1116}, "aka": "Intercontinental New York Times Square Hotel New York City", "slim_ranking": 0.217194570136, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Opening July 2010, InterContinental New York hotel ~ a new landmark in Times Square, stands 36 stories offering panoramic views of Manhattan's skyline, Hudson River and Broadway. At 44th Street and Eighth Avenue, it’s convenient to 39 theatres in the Broadway Theater District. Enjoy the onsite French inspired brasserie, from Celebrity Chef Todd English. The InterContinental New York is the place to meet with more than 10,000 square-feet of flexible New York meeting & event space."}