{"user_rating": 4.0, "review_count": 368, "name": "InterContinental Sanctuary Cove Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "We had not stayed here since it was a new Hyatt back in the Eighties. Although there appears to be some refurbishment going on, the externals of some of the buildings are in need of attention. The expansive gardens are looking very tired. The rooms are a pleasant surprise and very clean and comfortable.", "title": "Worth another visit", "user": "Oscar371", "date": "December 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 188828296}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The pools are delightful and helps make this an excellent choice for families although it suited us retirees fine. We were so impressed at day 1 we invited our kids and grandchildren down for a night. The staff are mostly very good with one or two strange exceptions. We had a silly incident over a food order going missing which the Duty Manager, Carlos, made excellent reparations for.", "title": "Loved it", "helpfulness": 1, "user": "Jo C", "date": "December 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188753385}, {"rating": 5.0, "title": "Great place to relax.", "text": "The breakfasts are very good almost on par with some of the excellent Singaporean hotels. The bar snack (Bites) are fair enough but you can do better value and flavour down in the marine village. Although between Christmas and New Year and the hotel being reasonably full, the village was never crowded. Some may say it lacks a buzz but it was a welcome change from the usual Gold Coast squeeze. There are plenty of choices for food and drink outside the hotel amongst the beautiful boats.", "user": "Louise M", "date": "December 27, 2013", "id": 188732040}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "As a boatie, I am sure I will avail myself of this hotel and its surrounding village, again very soon.", "title": "Best for everything", "user": "Angry1961", "date": "December 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187907324}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Just spent five nights here and wish we could have stayed longer. Fabulous location and plenty of places to eat within walking distance. The pool was fab, a huge lido with beach. It was very peaceful and we loved our suite. The staff couldn't have been more friendly and helpful. It might not be the newest or the poshest but we both agreed it is our absolute favourite hotel we have stayed at ever. Really hope we get to visit again one day.", "title": "Awesome location with old colonial style grandeur", "helpfulness": 1, "user": "Lisa R", "date": "December 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 187638511}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 19, "average": 61, "very good": 141, "terrible": 6, "excellent": 141}, "aka": "Hyatt Regency Sanctuary Cove Hotel", "slim_ranking": 0.25, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "InterContinental Sanctuary Cove Resort is inspired by the grandeur of a beautiful Queenslander offering an elegant and stylish timeless design. Set in beautiful surrounds the pristine white sands of the resorts famous one acre salt-water beach lagoon pool is the backdrop to a resort filled with relaxation and sophistication. Escape to a world of comfort, style, luxury and relaxation."}