{"user_rating": 4.0, "review_count": 1464, "name": "InterContinental San Francisco", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Stayed at the Intercontinental for a weekend getaway. We had originally booked a standard king room, but decided to upgrade to the executive king room, for an extra $60 per night. I thought it was well worth it, since the view of downtown was amazing, especially at night. I never felt cramped in the room like I do at other hotels. Liked the little touches, such as the robes and sensor lighting when you entered the room.", "title": "wonderful views", "user": "salaciouscrum", "date": "January 13, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 3.0, "value": 4.0, "rooms": 4.0}, "id": 23536305}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Only snafu was with the bill since we wanted to split it between cards. Upon checkout we noticed there was one card being charged. But we brought this to the clerk's attention and it was fixed. Didn't go to the bar or restaurant, but the gym and spa looked pretty nice. Don't understand why they charge for wifi. I guess the area can be a little seedy at night if you're not used to an urban setting; otherwise a fantastic stay", "title": "Comfortable Hotel with excellent service", "helpfulness": 3, "user": "Traveller73London", "date": "January 11, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 23450257, "likes": {"liked": "— Huge room with view and great service.", "disliked": "— The grey beige wallpaper in the living area....."}}, {"rating": 3.0, "title": "Nice Hotel with \"Modern Problems\"", "text": "Stayed six nights at the Intercontinental SF. Upon arrival were upgraded to a one bed suite on the 32nd floor as part of our Ambassador Priority club package. Great room with separate sitting room and one and a half bathrooms, very handy when one of you cannot adjust to time difference and the other is still asleep!! Great views of the city and - when the fog cleared on the third day- a glimpse of the golden gate bridge and the bay.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "January 10, 2009", "id": 23432855}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Our suite was spotlessly clean, everything worked fine and it had the most comfortable bed and a wonderful bathroom complete with TV! There was ample storage space with two closets and heaps of drawers. The one cup coffee maker meant having to run it twice to make coffee for two but no big deal. The room decor was distinctly 'Intercontinental' which can verge on the conservative 'grey-beige' but the room layout and views make up for this. The decor in public areas is more exciting.", "title": "Fantastic Hotel. Will definitely return", "user": "SR32", "date": "January 8, 2009", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23384260, "likes": {"liked": "— Comfortable Bed", "disliked": "— Pricey Internet Access"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "At first we thought the hotel was a little out of the way but after a couple of days we felt that the location was pretty good - very close to the streetcars on Market and the cable cars on Powell. Close to Union Square and of course the Westfield shopping centre. For us, tourists on our first trip to San Francisco, the location turned out to be ideal. The two other advantages of the location are that the area is fairly flat around the hotel if you are not used to the steep hills and you have the great views from the hotel as there are no tall buildings close by.", "title": "Great place for our anniversary", "user": "SFShush", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 23271875, "likes": {"liked": "— Accomidating and friendly staff, cleanliness", "disliked": "— A little close to a shady part of town, subpar views"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I know this hotel has decent reviews, and it's a nice hotel -- modern, pretty, well-located. However, I can't give it more than one star because things were biting me. In our room, we found not bedbugs, but FLEAS. I didn't even know what they were, but apparently fleas jump. And they weren't on top of the bed, they were in the sheets.", "title": "Itchy", "helpfulness": 3, "user": "yyzcupcakes", "date": "September 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 78661473}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The hotel was accomodating and moved us to another room, but by the time we left the next day, I had seven or eight bites on my body. Whether they were from the fleas, or something else, I have no idea... but I'd never stay here again.", "title": "Really nice hotel", "user": "travelingtills", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78570492}, {"rating": 4.0, "stay_parameters": "Stayed September 2010", "text": "Really this was a very swank hotel. The staff was very efficient and professional. Food was good, very clean rooms. Really great concierge who got us booked on a tour with two days notice which got us to alcatraz, if it werent for the hotel an alcatraz run would never happen since you cant get tickets except for weeks in advance. The tour was very good. If you're just seeing the city with the family like i was, then i'd recommend the whole deal, hotel, tour, all of it. The hotel was walking distance from really good shopping and restaurants, and its 20 bucks for a cab to fishermans wharf. Great hotel.", "title": "Great stay", "user": "amymichelle", "date": "September 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 78520559}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We stayed here for three nights on the last leg of our California trip. The hotel is beautiful and the hotel bar had great pork sliders (had them for dinner twice in three days). I usually don't eat at hotel restaurants, but made an exception on this trip because we had good food at the Sheraton we stayed in before we came to San Francisco. I'm glad we tried the hotel bar-as I was too tired at night to go exploring to see what other food options were near by. There was a Bucca De Peppi (sp?) across the street, but I'm not big on food chains--I'd rather eat local. The room condition was good--but at night we could definitely hear the calls for the taxi to pick up other guests--especially the last night when there was a whistle. While the location was good, a block closer to Union Square would have been perfect. I liked Union Square a lot as a base and the hotel was close to the Cable Cars and bus (recommend the 3-day bus pass). The concierge were great! They recommended good places in China Town, Italian area, and I'm glad we were able to walk everywhere and take the bus/cable cars. The hotel was very clean but had some quirks--with the double bed, the person nearest to the shower can't sleep when someone else is in the shower because of the light reflection--but the rooms were overall very nice. I'd recommend to others traveling in the area--as long as they walked towards Union Square and not away. All in all, I'm happy I booked this hotel especially for the hotwire rate I got and I'm so glad we didn't stay in Fisherman's Warf. My only real San Francisco complaint was that it was so fogged in we didn't get to see the Golden Gate Bridge--which would have been cool to see. Had a great time other than that and the hotel can't be faulted for the weather--especially when we read that San Francisco is often pretty foggy.", "title": "Great hotel in San Francisco", "user": "bajanboy66", "date": "September 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78061736}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "We stayed two nights on our recent ten day trip down the CA coast. It is an excellent hotel in a good location. Near to restaurants and the railcar stop at Market Street. Service was good, very clean and helpful staff. We soaked our weary bodies in the Jacuzzi. Only downside is parking is $60 per night. Otherwise I highly recommend this hotel.", "title": "Clean, comfortable, great location, & friendly staff", "user": "smarmydave", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77879582}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Our reservation was made by a travel agent at a group rate of $199 and the reservation specified one king bed. The single person before us received a room with a king bed and he offered to go to a smaller room, but the desk agent told him it was not necessary. When we got to our room, we had two queen beds. After calling the front desk, we were told that there were no king bed rooms available. I was very disappointed with the lack of accommodation. The view was also not very nice. The hotel is located next to the convention center and very near Market Street. It is a long walk to the wharf, but doable. As far a I know, there was no coffee place in the hotel, so we had to walk a few blocks for a lighter breakfast. There is a bar and restaurant on the premises. There is also a gym. The Internet service is not free. The area around the hotel can be sketchy in places. There are a lot of homeless people on Market Street and nearby, so safety may be an issue. Overall, it is a fine place to stay, but nothing special.", "title": "3.5 because of service", "user": "kimjim", "date": "August 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 174006632}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This a lovely hotel. The bedroom and bathrooms are first class. The staff were attentive and informative. We had lunch in the bar, breakfast in the dinning room, both were excellent. We had room service for dinner, the food came quickly and was hot and good quality.", "title": "Lovely hotel close to shopping areas.", "user": "Dublinlady28", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173733556}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The spa in this hotel is very functional and efficient. The atmosphere is not very relaxing and there is a waiting room and no relaxation room. The massage was ok but not great.", "title": "Booked thru Travelocity? Prepare to be treated poorly", "user": "TracyAcc", "date": "August 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 173711726}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "This hotel is very central to Union Square and the shops, all only a few minutes away.", "title": "Attentive staff. Clean rooms. Good amenities. Pricey.", "user": "Marty_TAMG", "date": "August 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 173694939}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The Fishermans Wharf area is not within walking distance. It took about 15 minutes in a taxi.", "title": "Intercontinental Hotel San Francisco", "user": "Adrianne M", "date": "August 21, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "rooms": 4.0}, "id": 173428999}, {"rating": 4.0, "title": "Very good", "text": "I stayed here for 4 nights and it is a nice modern business hotel. I generally like staying in a business hotels as I don’t necessarily need to mix with children and tourists.", "helpfulness": 2, "user": "leeabbey", "date": "July 20, 2012", "id": 134900517}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "It’s around 10 minutes walk to the main area which is good as I don’t always like to be right on top of things. The rooms are a nice size and modern. The club lounge is also nice after a day’s shopping to relax and have a glass of wine. It also has a big modern gym. All in all I can’t fault this hotel. It was a good standard.", "title": "fantastic!", "user": "An0nym0us88", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134864305}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I recently stayed here to celebrate July 4 in the city. This was the perfect spot for our destination and easy to haul cabs. I don't remember which floor we stayed but it was a great view!!! The room was perfect, all the amenities needed was available in the bathroom, the ice machine was across the way from our room. Room service took it bit long but it was also very late at night, so no harm done. Staffs at the front desk very courteous, helpful, and nice. The rooms could be a little pricy but we found a great deal especially on July 4! I would definitely stay here again!!!", "title": "Excellent hotel!", "user": "Ioana S", "date": "July 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 134794676}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stayed there for a few nights in 2011 and I can say, without hesitation, that it's everything one could expect from a new and modern hotel. The rooms (beds included) are very confortable and the glass walls add brightness and cosiness to the more \"business-oriented\" hotel style. As others have mentioned, there is a slight problem with the location: although it's very close to the Union Square, it's also one block away form a bad neighbourhood. If you follow reception's advice you will be just fine. All in all, I fully recommend it and it's good value for money!", "title": "Great rooms", "helpfulness": 1, "user": "Islanddiva7", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 134785292}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The hotel is about 5 yrs old. Modern, clean and spacious rooms. I had club access which is great - includes breakfast, lunch, drinks, and a nice spot to relax. The hotel staff is amazing - in every department. Everyone is so pleasant and courteous. Very close to Moscone center.", "title": "Not a hotel for families, even on the weekends.", "user": "rorden", "date": "July 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 134753501}, {"rating": 2.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Typical convention hotel with a nuance that was a first for me. I've been without hot water, but never without cold. Repaired some how, no explanation.", "title": "No COLD water?", "user": "cardio-2", "date": "October 31, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 119995626}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Room had items left over from previous occupant, the a/c rattled and groaned like some 3rd world country unit.", "title": "Much better than we expected", "user": "supertraveler24", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119970701}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Room service was poor and the restaurant \"Luce\" seemed offended we wanted a to go bag late at night.", "title": "Terrific Staff", "user": "USCanTraveller", "date": "October 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119799693}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "There are much better in SFO", "title": "5 stars.....what a joke", "helpfulness": 3, "user": "pbrory", "date": "October 26, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 119774593}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "We stayed for 7 nights, Sept. 2 to Sept. 9, 2011 in a large, king room on the 38th floor with floor to ceiling windows and an amazing view of the bay and the bridges with the city in the foreground. It was absolutely gorgeous. The room was very large, the bed outstandingly comfortable. The bathroom had wonderful amenities and huge, plush towels. The front desk staff and concierge made restaurant suggestions and were helpful and accommodating. We especially enjoyed The Grove restaurant, a casual breakfast and lunch restaurant with a very nice menu and outstanding quality of food. The tv inthe room was a very, large, flat screen. There was a pod coffee/, tea making machine. The bedding and linens were very upscale. We travel very often and stay in all lmanner of hotels and this was one of the all around nicest hotels we've stayed in. We will certainly return to this hotel when we are again in San Francisco.", "title": "Peaceful stay in lovely hotel", "user": "LynneC52", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119678924}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel was only a few blocks from Union Station, BART and the cable cars. As this was my first time in San Francisco (from Texas), I kept looking for hotels that included free parking. The parking rate was $60, but I realized I didn't need a car in the city and used public transportation during my two day stay, returning to the Oakland airport for a car to travel through Napa Valley. The service at the hotel was outstanding. Our room was quiet, even though it was on the corner with floor to ceiling glass on two sides. The beds were extremely comfortable with down comforters and lots of pillows. I booked a very good rate on hotwire, which made the stay even better. I definitely would stay there again.", "title": "luxurious hotel", "user": "SharonHouTX", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119373709}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "The hotel is adjacent to the Moscone Convention Centre. It always appears to be very busy. The rooms are large clean and have floor to ceiling windows which provide a great view. Compared to most hotels the rooms are very quiet (including the airconditioning system).", "title": "Great rooms, beautiful view", "user": "bd007", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 119355220}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The beds are incredibly comfortable.", "title": "No complaints", "user": "bruno68", "date": "October 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 119309542}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The breakfast in the main restaurant ($28 for buffet), is great. I guess you get what you pay for.", "title": "Consistently good", "helpfulness": 2, "user": "onedude", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 119278124}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "The gym is large has alot of equipment and a pool.", "title": "Shabby, over-priced and poor service", "user": "worldwidemark", "date": "October 12, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 119214828}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "My husband was in San Francisco for a conference and we stayed at the Inter-Continental SF for five nights. The hotel is modern, sleek and convenient located - right next to the Moscone Convention Centre, 2 blocks from the cable car terminal, 1 block from Bloomingdales and Nordstrom and a 10-minute walk from Union Square, where more shops await.", "title": "Convenient location, good service, modern and clean", "helpfulness": 1, "user": "HK_Amanda", "date": "March 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26036113}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The room was spacious, clean and modern, equipped with flat-screen TV and i-pod dock. The only complaint is that the shower was very weak - it was one of those fixed ones (as opposed to a hand-held one) and there was no temperature control, which was rather surprising for a new hotel. Our package came with breakfast included so we enjoyed their buffet breakfast every day. The selection was limited and remained exactly the same for our entire stay.", "title": "One night on the town", "helpfulness": 2, "user": "paulandsteven", "date": "March 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25641911}, {"rating": 5.0, "title": "Best hotel stay in a LONG time!!!", "text": "Staff were helpful and attentive, especially the concierge who provided us with excellent tips and recommendation.", "helpfulness": 1, "user": "Julie A", "date": "March 2, 2009", "id": 25468872}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We live in San Francisco and had an event downtown that we wanted to stay downtown for. The hotel was amazingly clean and modern. Floor to ceiling windows with awesome views of the city. The service was impeccable. They came to the room twice, once to help with the phone and once to push the right button on the coffee maker. This was done politely, not letting me know I was an idiot. Pricy, but a great experience. The rooms were very quiet. I stay at very expensive places where you can hear the people next door.", "title": "Great for a weekend getaway", "helpfulness": 1, "user": "gcjones", "date": "March 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25461583}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "From the moment of arrival, every staff member acknowledged us and made us feel welcome. The hotel is very modern and in a great, convenient location. Check in was a breeze. We had a great view in a Queen bed room on the 27th floor. The room was on the small side, but as a couple, we didn't need any more space. There was a huge wall-mounted plasma tv, which was great for watching a movie at the end of the night. We were able to get an in-room movie that was a movie that is still in the theaters. It was great!", "title": "Nice modern hotel", "helpfulness": 1, "user": "VictoriaLA", "date": "February 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25221342}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We overall enjoyed our stay at the Intercontinental. Great location: downtown next to the Moscone Center, but a little tucked away from the craziness of Market St. The room was good sized and comfortable. It was definitely a business traveler hotel, as the extras were costly: !4/day for internet, fee for printouts in the business center (although boarding passes were free). One unexpected perk: we needed a Zipcar for a trip to Napa and found a car parked in the hotel garage that the valet retrieved and returned for us.", "title": "Comfortable, great location, business hotel", "user": "iduj", "date": "October 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119521656}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "This hotel was great for my conference at the Moscone Center. Very convenient to conference center and to many other hotels and restaurants. It is a bit far for Fisherman's Wharf and Chinatown, but it is a quick cab or trolley ride away. The hotel is clean, professional and everyone was courteous. Highly recommend for business.", "title": "Great for conference", "helpfulness": 1, "user": "roseguinea", "date": "October 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 119486679}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We have been loyal Intercontinental customers for too many years I care to remember...When in San Francisco, we usually stay at the Mark Hopkins, but their customer service has been declining ever since they became part of the Holiday Inn chain and especially since they moved their Club lounge from one of the higher view floors to the lobby level. This is the second time we tried the Intercontinental on Howard Street. The hotel is less elegant and serene than the Mark Hopkins. It is situated in a crowded area by the Convention Center close to the Tenderloin district. The first time we stayed, we were impressed by their friendly front desk and their willingness to accomodate our needs. When we wanted a weekend getaway, we decided to try them again. When we checked in, we were met with an efficient, but unyielding clerk who was unwilling to give us the room and services we needed. I was ready to move to another hotel when Janet, another front desk person, took over. Janet went out of her way to get us a beautiful room similar to the one we had on our previous visit. Her courtesy, efficiency and tact restored our faith in the Intercontinental brand. The service we had this time was comparable to the outstanding service we received at the Amstel, Manila, and Bali Intercontinental; it was top notch!", "title": "Great business hotel which can also be a fun vacation getaway", "helpfulness": 1, "user": "sonnet4", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119407606}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I highly recommend the corner rooms on the higher floors for a panoramic view of the city. The floor to ceiling windows give the rooms a spacious, airy feeling not found in the regular rooms (which are mediocre at best). The buffet breakfasts are quite tasty, but they are not quite as delicious as at the Mark Hopkins! I missed the eggs benedict on Sunday morning! Parking rates here are as exorbitant as at the Mark Hopkins, but here there is a parking lot across the street which is much cheaper, but it has no in and out possibilities at night. We had free parking with our package deal which made things much easier.", "title": "Amazing hotel, large well decorated rooms and great service", "user": "Toffee80", "date": "October 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119392731}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "One advantage of the hotel is that it is around the corner from great shopping and that it is right by the Chieftain, a great Irish pub, should one require a tasty libation or some Irish stew cooked in Guinness! For anyone daring to venture into less desirable neighborhoods near the hotel, there are superb Thai restaurants nearby.", "title": "Great Stay", "user": "vanbecky", "date": "October 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 119377028}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Pros:", "title": "Great location and superb service", "user": "kitty811", "date": "November 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120252062}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "- Ambassador membership provides welcome fruit, nuts and water (usually Evian). Water replenished daily. Also a free in room movie per visit, wifi and room upgrade", "title": "Great Hotel!", "user": "SoCALcanuck", "date": "November 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 120235732}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "- Excellent gym with nice equipment plus water, towels, fruit and magazines", "title": "Disappointed. Expected more for the Price, Expensive WIFI", "helpfulness": 1, "user": "juliette1953", "date": "November 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 120126136}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "- Luce restaurant has delicious dishes", "title": "LOVED this hotel!!!", "user": "Californiaboy101", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120095023}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "- Rooms are large and well-appointed. Super comfy beds and roomy bathrooms", "title": "Modern luxury at a reasonable price", "user": "Lovesvacations66", "date": "November 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120075146}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "I really don't do too many chain hotels... as I prefer smaller boutique style hotels, but we had a day to fill in SF and didn't know where to stay... the SF Intercon was clean, efficient and had excellent staff!", "title": "Nice surprise", "user": "materialboi", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 80524284}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Would definitely return!", "title": "Affordable luxury modern hotel", "user": "Courtney65", "date": "September 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 80503103}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "I requested a quiet room and we were given a corner suite on the 28th floor which had spectacular views over the city. The room was a good size with a very comfortable bed and Frette linens. You are supplied with towelling robes and slippers which I think is a nice touch. The location is two blocks from busy Market Street and close to the cable cars, buses and BART. The concierge is very good and the staff are all professional and polite without being in your face for tips like you get in some places. The gym is well equipped and has a water machine and complimentary apples. We didn't eat, drink or use the pool so I can't comment on those. This hotel made our stay in San Francisco the best and we had the best nights sleep here of our whole holiday.", "title": "Nice location", "user": "doe1976", "date": "September 21, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 80462101}, {"rating": 4.0, "title": "Great Hotel, but parking charges excessive", "text": "4 nights stay in september 2010, location is really nice, pretty close to market street and all shops), room on 9 floor nothing specials, bathroom was big and clean and bed was really comfortable.", "user": "cchri1p", "date": "September 18, 2010", "id": 80096698}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Moscone center is very close, rate was high due to Oracle convention during my stay (booked with PL).", "title": "Super Service and comfortable rooms with great views", "user": "sonnet4", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 79435386}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I came here for a weekend getaway. I must say the pictures does not do this place justices. I was very impressed when I walked up. The staff was very nice. From the bellman, front desk, and concierge. The hotel lobby is very nice and clean and modern in design. It's truly a luxury hotel. We got comped a upgraded room on floor 31. It had great views of the city. The bathroom was very nice and clean. The bed and linens were nice and clean. We ate at the Luce restaurant for breakfast only - and the food was delicious. The waiter was very nice and accommodating and gave us extra fruit. :)", "title": "Nice hotel!!", "user": "da1dara", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134069770}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The Bar 888 is my new favorite place. The drinks were fairly expensive - costing $12 for mojito's /and martini's. I will be back! The hotel is only blocks away from Market/Powell street and it was an easy walk to the Bart and to all other forms of transportation.", "title": "Excellent Hotel-The total package!!", "user": "labonvoyer", "date": "July 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134067835}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Overall I am really happy i chose this hotel to stay in.", "title": "Real deal", "user": "nfrasercolumbia", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134027565}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "My husband wanted to stay here after a co-worker recommended it. I booked a package deal that included valet parking and breakfast. Wow..the total package. Incredible service, beautiful rooms, outside space, a full length 2 lane lap pool, nice work-out room and good central area of the city.", "title": "Good location, modern hotel", "user": "tahna_p", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133963710}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "When you book on line, they have several offers that may be available at check in and you have the option to sign up for them (they may or may not be available and you find out at check-in). I was able to obtain 2 half priced 50 minute Swedish massages. The Spa staff were incredible. There was a slight price mix up on the massages. When I went to check out the 2 massages were billed at full price. The hotel manager said he would look into it and deleted the spa charges and later e-mailed me the correct amount for my review before re-billing my credit card.,", "title": "First Class Hotel", "user": "chicagofan71", "date": "July 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 133918006}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "This place is great! This is my second time here and they have excellent customer service, amazing views, very clean hotel, and it's just an overall amazing experience everytime. I would definitely recommend this place.", "title": "I love this place!", "user": "Mariel I", "date": "September 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175319611}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "My friend and I wanted a place close to Union Square and transportation. We found this hotel to be both. The concierge staff was fabulous. Nelson, Lane and everyone there helped us so much and we a lot of fun. We would come back from our day and they wanted to hear about our experiences. The bell people were great. Dorian gave us good recommendations and was so friendly.", "title": "Great Experience", "helpfulness": 1, "user": "fabtrips4us", "date": "August 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 175029707}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "We liked our room. Clean, modern and spacious, especially for San Francisco. Workout facility had everything we needed.", "title": "Consistently delivers", "helpfulness": 1, "user": "gunnerbairn", "date": "August 27, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 174285723}, {"rating": 3.0, "title": "Greedy", "text": "This was our fourth stay in the last six years and once again we enjoyed the hospitality that goes with booking a room that gives club lounge access. The club lounge staff cannot do enough to help and even when we asked to be moved from our lovely one bedroom suite near the lift shaft, they managed to find an excellent corner suite even although the hotel was extremely busy. Location is great - just a two minute walk to Market Street and the Westfield Centre.", "helpfulness": 2, "user": "Christian P", "date": "August 27, 2013", "id": 174264128}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Nice hotel, beautiful room, good location.", "title": "Stuning rooms, service and location!", "helpfulness": 1, "user": "Tom K", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174169361}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We have stayed at the Intercontinental before. The room we had this time was a king bed standard room. The hotel offers all the amenities that most large chain hotels offer. Printing of boarding passes is free. Parking at the hotel is high at $56/night with in and out privileges. Blue Bottle Coffee is just down from the hotel on Mint Street off 5th Street. They offer a limited breakfast and good coffee. The hotel is close to MOMA, the Moscone Center, the new Jewish Museum and Yerba Buena Park where you can find some nice spots for lunch. The hotel often offers deals through Travelzoo, Orbitz, Expedia and other online sites as well as it's own website.", "title": "New hotel in upcoming neighborhood", "helpfulness": 1, "user": "Butcher.T", "date": "March 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 26918589}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We got a really good deal on our room, a very large room with king bed. Clean, nice bathroom and shower. The usual amenities for a hotel of this caliber, including morning paper delivery outside room door, large flat screen TV, iPod docking station. I was merely surprised at the fee to use the internet at the business center. However, one was able to view and print boarding pass for no charge.", "title": "Modern hotel with pleasant, helpful staff", "helpfulness": 1, "user": "Ruebrezin", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "location": 4.0, "service": 4.0}, "id": 26755190}, {"rating": 5.0, "title": "Fabulous stay at the Intercontinental San Francisco", "text": "Would stay again.", "helpfulness": 1, "user": "Desertbrat4now", "date": "March 21, 2009", "id": 26564099}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "My husband and I just returned from a great two night stay at the Intercontinental San Francisco. We are very hard to please, but I must say, our stay was way, way beyond expectation. The hotel was immaculate, the service five star...in fact, everything was five star. I loved the room, the view, the bed, the dining room and room service. The best part...it was quiet...it was away from the hustle of Union Square...all those sirens. We actually got good sleep....incredible. Thank you....a job well done.", "title": "One of the best hotels I've ever stayed in!", "helpfulness": 1, "user": "lucidlilies", "date": "March 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 26236250}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I have stayed in many hotels for business so I have seen my share of good and bad hotels. However, nothing compares to my stay at the Intercontinental San Francisco! The bed is seriously the most comfortable, luxurious bed I've ever been in, hands down. They use a feather bed and a feather comforter which makes it very hard to get up in the mornings. Also, although I wasn't in the room much, the view from the room was spectacular (had a view of the bay). Try to get one of these rooms on the upper floors.", "title": "Modern hotel close to Convention Center", "helpfulness": 1, "user": "ijjy", "date": "March 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 26228039}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed 9 nights and loved every minute of our trip Several months before the trip, and before we made the reservations we joined the Ambassador Club, which is partly the reason the stay was so wonderful. Although joining the club costs $200, it was completely worth it, as we were given a free weekend night ($260), a free room upgrade (to a \"Junior Suite\"), access to the Club Level Lounge, free internet access and late checkout (4 pm).", "title": "Impeccable Service", "helpfulness": 1, "user": "lawg8r", "date": "September 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79370212}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The upgraded room was huge - there were two entire walls of floor to ceiling glass, giving us amazing views. The decor is modern and clean without being cold. The king-sized bed was the most comfortable hotel bed I've ever encountered. The housekeeping staff was attentive and almost invisible (in a good way).", "title": "Overall, a very good stay with a few minor annoyances", "helpfulness": 2, "user": "Bella213", "date": "September 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 79238030}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The Club Lounge was a perfect place to unwind and relax after a long day of walking around the city. We'd enjoy a cocktail and rally to go out for dinner. There was always coffee and soft drinks available, and usually some delicious food to snack on. Above all, the staff in the lounge were the most helpful people. Shehani and Regina made us feel so welcome and comfortable - they were the most delightful women!", "title": "I loved this hotel", "user": "Starzee78", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79065479}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The hotel bar specializes in grappa and served some interesting drinks made with it. We did not eat at the hotel restaurant, but I have heard it is very nice. The spa was very posh, although I recommend making reservations there well in advance.", "title": "Nice stay", "user": "Pat46655", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78764918}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "We took the red eye back to Florida, so we had several hours to kill after we checked out. While our suite was not available to stay in past the 4 pm late check out, Shehani found a room for us to stow our luggage and freshen up before we left, which was most appreciated.", "title": "excellent Moscone Center location", "user": "longhorn_mike", "date": "September 7, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 78706832}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We have been to San Francisco many times but never have we had the level of service that we received at this hotel. from the bell desk to the Concierge we were treated exceptionally well. Very, very impressed!!", "title": "Modern hotel with phenomenal staff!", "user": "Lawlady66", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134240599}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The Intercontinental in San Francisco has consistently surpassed my expectations. The location is ideal to the Marcone Center and just a few minutes walk to the Ferry Building. The hotel is modern and very tastefully furnished. It seems that they have spared no expense to make their guests comfortable. The thing that makes this hotel better than the Ritz is the people who work here. They are genuinely interested in making you comfortable, find the right restaurant for you, or just making sure that you have anything that you need. I am especially impressed by their guest services personnel. Shehani and Gina always find a way to brighten my day. Thank you.", "title": "Better than the Ritz !", "helpfulness": 1, "user": "NRB22066", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134239380}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I've stayed at many of the San Francisco area hotels, but ever since I started staying at The Intercontinental San Francisco, I will never stay anywhere else. From the minute I arrive from a long cross-country journey, the staff makes me feel welcome immediately. They greet me by name and always ask about my business, my co-workers, where I plan on dining, or just general questions that make me feel at home. I am ALWAYS impressed at how the staff seems to know so many of their frequent guests by name. From Ernest, the Bell Captain, Bill, the Head Concierge, Luis in the Intercontinental Club, and the two beautiful young ladies, Shehani and Gina, who always make my trips special! It is truly because of the extra efforts of these wonderful people that I thoroughly enjoy this property and am always suggesting it to my friends who are traveling to the Bay Area. Also, the rooms are new and inviting. And the location is perfect!", "title": "They treat me like a King!", "user": "javajunkie13", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134238929}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "We had just driven 10 hours from Oregon on our trip back home to SoCalifornia, so stopping at the halfway mark in San Fran was the perfect choice. After all that driving with two kids ( ages 14 and 7), we would have been happy with ANY hotel at that point. A hot shower and a bed was all us parents wanted ( kids wanted cable tv lol).", "title": "We really liked this place :)", "user": "Renee r", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134161600}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "I originally booked this hotel because it was one of the few that actually had a pool, and being indoors was a great selling point because the weather that week was a little cool. Thankfully I booked directly through the hotel, because I was able to purchase a \"California Staycation\" package that included free parking ( woohoo! That saved $60) and two free breakfast buffets.", "title": "Great Hotel/Location not so great", "user": "America T", "date": "July 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 134156009}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The staff and interior are all great and what you'd expect. The location, as others have mentioned is a few blocks from most of the other hotels and sites, although there is good dining and shopping without crossing market street. Good internet.", "title": "Great Hotel", "user": "Aj N", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134743841}, {"rating": 4.0, "title": "Never lets us down!", "text": "Been to this hotel three times in the last year- service is wonderful, modern accommodations, close to most SF attractions. Travellers should be aware it's not in the best location - a few blocks and the neighborhood gets shady. If renting a car, hotel parking is $$$- try the 5th and Mission parking garage, better price for overnight parking and 2 blocks from the hotel! Oh and if the bar is closed try the Irish Pub across the street, it is great for a night cap and a sing along!", "user": "Elizabeth G", "date": "July 17, 2012", "id": 134588124}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "This was a really nice hotel. Very classy! I found it was a bit overpriced, but the location was excellent for everything you wanted to see in San Francisco.", "title": "Nice Hotel", "user": "MooseGalore", "date": "July 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134582917}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "As other reviewers have stated, the staff at this hotel is exceptional. The rooms are nice - sort of bland and corporate but spacious with comfortable beds and crisp linens. The location isn't scenic or charming, but it's a quick walk to Union Square, Moscone and lots of transportation options. When you leave the hotel, just make sure you're properly oriented and walking in the right direction as it is quite close to some seedy areas.", "title": "Solid Choice", "helpfulness": 1, "user": "sanfrandlle", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 134475395}, {"rating": 5.0, "title": "Fantastic Hotel with Great Location", "text": "I have stayed at the InterContinental San Francisco on business in the past. This trip was for a long weekend get away for my wife and I and another couple. The hotel was outstanding from the reception desk, to housekeeping, to the doormen. The hotel is very clean, contemporary, and has an outstanding staff. The cost was very reasonable (we found a special for the weekend). We arrived early (11am) and they were glad to set us up in a room (an upgraded room no less). The view was fantastic.", "user": "es_in_tx", "date": "July 15, 2012", "id": 134460419}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The location and comfort level were great, but the lack of complimentary in room or lobby coffee was a negative. Internet service is not free either. Their own restaurant was pricey. We had good,decent food at the corner Irish pub \"Chieftain\" and also across the street at the Italian restaurant \"Bucca.\" The room was very quiet, we were on the 23rd floor. Convenient transportation.The F line bus to go to Fisherrman's Wharf was 2 blocks away. Took the Bart from the airport to Howell and Market and the hotel was a short walk from there. The SF Visitor's Center is in that location also.", "title": "Great hotel, location and concierge service but", "user": "KathyC82", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77663439}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "If you're thinking of going, purchase a Go Francisco Card on line. It's a great deal.", "title": "Awesome", "user": "Enanita", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77653932}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My husband had a convention at the Moscone Center and we tag alone to spend a couple of days in San Francisco. Great hotel , excellent location ! We loved it ! Shopping was amazing! Rooms are nice and so clean, service was more than nice ( friendly staff), from housekeeping till the concierge. The food at the room service was really good ! and the concierge suggested to eat at Lulu ( 2 blocks away) Amazing Food !!!!The hotel stay contribute to a lovely trip in an amazing city. LOVE IT !", "title": "Fabulous hotel", "user": "Miss_Veronica", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77568582}, {"rating": 5.0, "title": "Almost too comfy", "text": "We had a corner room on a high floor which allowed for great views. The room was well sized, very clean, modern, and bathroom was great as well. Location was very good, maybe not the best since you have to walk 5-10 minutes to get to Powell & Market and Union Square, where you can find the cable cars and lots of mainstream shopping, but still good enough. Ordered room service once and was very good. Front desk receptionist was very friendly. Only two complaints: 1. The price of $15 per night for WiFi is quite steep for a hotel of this caliber, especially since it's a business hotel. 2. One doorman/bellman was rather unhelpful and unfriendly, not to say rude, but in general staff was quite nice. Overall, a very nice hotel, with a great value for money ratio.", "user": "fasaxc", "date": "August 30, 2010", "id": 77433380}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Due to a slight mix-up at check-in (they didn't realise I had a reservation and so checked me in without taking it on board) we ended up staying in a King Deluxe. The bed was so comfy and the curtains so dark (a good thing IMO) that we almost slept in a missed breakfast! View was excellent from the 23rd floor and the room was quiet and swish.", "title": "Comfortable stay", "user": "Coba5", "date": "August 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76393203}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "Really enjoyed my second stay at the InterContinental San Francisco and look forward to my next visit. The property is very nice and in a good location- walking distance to shopping, dining, public transportation and more. Because of being an Ambassador member I was upgraded to a corner room on the 28th floor, received complimentary in-room wifi and a free movie during my stay. The bed was very comfortable but the pillows were not as soft as I hoped. Floor to ceiling windows allowed for superb city and bay views but the window by the desk looked like it hasn't been cleaned in a while from the outside. Enjoyed breakfast twice and lunch once at Luce on the lobby level. The prices especially for the breakfast buffet of $30 seemed quite high but the food and service were good. This hotel is still my pick for San Francisco, CA.", "title": "InterContinental San Francisco", "user": "evvtraveler", "date": "September 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 176367766}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Special thanks goes out to the hotel concierge for helping me get to the America's Cup at Marina Green.", "title": "Would have loved a few more nights", "user": "NicoleBrisbane", "date": "September 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176252528}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We loved our stay at the Intercontinental. We purchased our stay with flights from LA on an Expedia package. We got a taxi from the airport $45USD. Chris at the desk was great and upgraded us to a corner room, which has huge windows and is 30% bigger than their standard room. It was lovely. The bed was one of the most comfortable I have ever stayed in. The TV was huge! I loved that this hotel is a green hotel and they have a recycling bin in the room. The water pressure in the shower isn't great, but it's a small price to pay for a green hotel.", "title": "EXCEPTIONAL SERVICE AND GREAT LOCATION", "user": "WENDYS_WORD", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175970040}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We didn't use any amenities in the hotel, they are priced as you would expect and there is so much around this location that there wasn't any need. I did pay for the Wi-Fi though which is not cheap, but cheaper if you purchase a 3 day package.", "title": "High Quality Hotel", "user": "Clint L", "date": "September 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 175838473}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "The location is great. So close to Westfield with a great food court for a cheap breakfast, lunch or dinner and hundreds of shops. We took the trolley to Fisherman's Wharf (too far too walk) which was really busy so you're lucky if you get on the outside to take photos. On the way back, we just decided on a taxi which was $20 with tip vs $12 for the trolley.", "title": "Hotel Review", "user": "Jookerr", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175785520}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Having read all the prior reviews i imagined this would be a hotel in the middle of the business district a long way from the sites of San Francisco, with limited appeal. Actually this is in a great location, 300 yards from the heart of the central shopping areas, 300 yards from the main tram line and a yet not noisey at night. Compared to the hotels down by the wharf (Blackpool on a Sunny Day) this is a great base to ensure you see the rest of the City. Although very expesive at the hotel bar ($20 for 2 drinks). I would recommend the saloon on Powell street just before Union square for $2.95 Margaritas, the cheapest bar in town and right in the middle of the restaurant areas. Lefty O'Doulls on Geary Street is also a great place for a cheap lunch with a nice pint. The concierge in the hotel are exceptionally knowledgable and helpful and we made ful use of them. The breakfast at $28 is unreasonable, but Little Joes restaurant 200 yards away on 5th street has all you can imagine for a third of the cost.", "title": "Short Break Away", "helpfulness": 1, "user": "Peter M", "date": "February 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24816760}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "What I really liked in this hotel was that it was a brand new one. Great lobby, great spacious double room and very nice view from the wide windows of the 21 floor, especially at night. The rooms were always clean.We had the chance to get a very nice price since we booked at least 4 months in advance (189$).The only thing that really bothers is that the internet was not free. quite convenient location, close to cable car, shopping malls, moma etc, but anyway transportation in san francisco is very easy no matter where you stay. However I must say that during my long honeymoon trip in the states, I liked more smaller and more \"warm\" and \"friendly\" hotels.", "title": "quite good", "helpfulness": 1, "user": "nataliamaridaki", "date": "February 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 24501628}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "I stayed at the Intercontinental in San Francisco for 2 nights on business. The hotel is about a year old and very modern. The room was large and the bed was comfortable. There was a huge flat screen TV which was great. With floor to ceiling windows, there's a nice view. The bathroom was big with a large glass enclosed shower with good water pressure (14th floor). There was a bathroom scale and this is the first time I have ever seen one in a hotel. The food in the hotel was ok but the breakfast buffet is very expensive, about $40. I took a cab to Fisherman's wharf for $12 and it was well worth the trip. There is lots to see and do. Great restaurants too. You can see Alcatraz from the dock and there is a ferry that takes you there for a tour. It costs $26 and is a great tour with audio headsets in every language. I wish the hotel was closer to the wharf, because with limited time, I couldn't see everything.", "title": "Very Modern", "helpfulness": 2, "user": "saturncmc", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 24098395, "likes": {"liked": "— The cleanliness", "disliked": "— the location"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "Hold on to your pocketbook. While the rooms here are adequate and the views outstanding, I was shocked at the level of pilfering that starts when you walk in the door. $14.95 for an internet hookup in the room? It only starts there. When we went downstairs where my company had booked a meeting room....the price for internet access was $80 plus a fee to turn the service on. A polycom phone. More than $300! A projector? Let's just say it was cheaper for us to go buy our own. No kidding, that's what we did. Add the indifferent service and you've got a promise that my company will never do business here again.", "title": "Hold on to your wallet", "helpfulness": 3, "user": "Ed-Bogus", "date": "January 30, 2009", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 3.0}, "id": 24026782, "likes": {"liked": "— The view", "disliked": "— Everything else"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We spent 6 days at the Intercontinental in San Francisco and the hotel consistently delivered on all counts. The hotel is fairly new, and this shows in the modern design and spacious rooms. Our room was on a high floor, and we had a good view across the city and further on to the bay. The bed was very comfortable, and the room also had a large 42\" lcd. the bathroom has a large walk-in shower, but no bathtub. The whole length of one wall in the room is lined by windows, making the room very bright and airy.", "title": "Excellent rooms, good view, a few minutes away from Union Square", "helpfulness": 3, "user": "Cooki", "date": "January 15, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 23581432, "likes": {"liked": "— The brilliant rooms", "disliked": "— Cold bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "This hotel exceeded all expectations from check-in to check-out. The only negative was the price of parking (over $50 per day). The staff was lovely, every single person. Even the hotel operators, probably the most overlooked person on the hotel staff. The rooms were perfect with gorgeous views over the bay. The price was very reasonable for a four star stay. Location was perfect, across from the Metreon and a 20 minute walk to the Ferry building, lots of restaurants nearby.", "title": "Great hotel in every way!", "user": "TiTiTG", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175569469}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "I would recommend this hotel to anyone.", "title": "Excellent", "user": "Chrolm", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175538896}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Stayed for 2 nights. We had a corner junior suite. The room was excellent - the bed was one of the best hotel beds I've had in a long time. The room was bright and modern - everything was up-to-date. Bathroom had a good size. They're a bit on the expensive side with amenities (minibar, water etc), but the room prices was fair for a luxury hotel. Valet parking is expensive, so watch out for that. It has a good location for Market street as well. Highly recommended.", "title": "Great location", "user": "cool t", "date": "September 3, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 175537458}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "This hotel was very mice and close enough to union square and walking distance from a lot of things. We could easily catch the bus/train to go to pier 39 and a lot of other places. The hotel itself is very big and the staff specially the concierge people were very friendly and helpful. The room wasn't too big but it was good and had keurig coffee machine. Sometimes we could hear thebaby in the room next to us cry but iI guess that can happen anywhere. Would recommend", "title": "Great place to stay in San Francisco!", "user": "Maria F", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175487692}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Very nice rooms with all the amenities that make you feel really comfortable. Great views from the higher floors: to the bay or to the city. Warm pool for daily exercise. Just few steps from the moscone convention center. Also great shops and restaurants nearby. Bart and transit system very handy.", "title": "Wonderful Staff and Excellent Location", "user": "Samer J", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 175327641}], "location": {"country": "United States", "city": "San Francisco"}, "stars": 4.5, "variance": {"poor": 61, "average": 151, "very good": 499, "terrible": 38, "excellent": 715}, "aka": "Intercontinental San Francisco Hotel San Francisco", "slim_ranking": 0.157446808511, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "InterContinental San Francisco is the Bay Area s newest upscale hotel destination. The 32-story glass tower sparkles high above the city, standing sentry over the South of Market (SoMa) area. The smoke-free hotel is convenient to everything, including the Moscone Convention Center, Union Square, Chinatown and the Powell Street Cable Car Turnaround."}