{"user_rating": 4.0, "review_count": 2015, "name": "InterContinental Chicago", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013", "text": "Great location on the mag mile, staff was cheerful and helpful, hotel is beautiful. Great amenities. I couldn't believe how quiet the rooms were too - being down town in the hustle and bustle.", "title": "Holiday Season Perfection", "user": "Ssuhar", "date": "December 16, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 187842116}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Thank you Angela Vasquez and team for your wonderful hospitality!!", "title": "Great Propety, Service, Staff, and Location", "user": "Javier C", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 187838691}, {"rating": 5.0, "title": "Excellent service and so polite", "text": "As a frequent client of The InterContinental Chicago, I look forward to hosting our Chicago meetings at this hotel and working with their staff. The sales and conference service staff understand our needs and make sure that our meetings are flawless.", "user": "Panowicz", "date": "December 16, 2013", "id": 187836804}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "My husband and I stayed for 3 nights...from the minute we arrived up to the second we left Arron and Will were the most respectful...fun..helpful guys they not only made it extra special and fun but hard to leave...We will definitely be back!", "title": "Outstanding- Will the doorman is fantastic", "user": "Joe K", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 187826446}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Your friends,", "title": "BACK AGAIN", "user": "JeffandCarolyn", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187814433}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Although we live in the Chicago area, we stayed one night at the Hotel InterContinental to celebrate our anniversary. I'd booked the room on Hotwire, but we called ahead of time to let them know it was our anniversary and hopefully get a nice room.", "title": "Magnificent pool & health club", "helpfulness": 2, "user": "almabalma", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 135093252}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "When we arrived, just before the 3pm check-in time, we were told our room wasn't ready, but that they would call us in \"30 minutes or less.\" We left our suitcases with the bellman and headed across the street to the Shops at Northbridge. One hour later, and still no call, we came back. A different staffer apologized for the delay and said our room still wasn't ready and she couldn't say when it would be. However, she handed us 2 drink coupons and invited us to relax at the Michael Jordan's restaurant bar in the lobby. We whiled away another hour or so before checking in again with the front desk. Finally, our room was ready.", "title": "Stellar location and service", "user": "NavyGuy337", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135078596}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "The view from the 25th floor end-of-hall room was lovely and we were delighted to receive a bottle of Champagne, chocolate and strawberries as an anniversary gift from the hotel. All our frustrations at the delay melted right away!", "title": "Wonderful Two Nights", "user": "Sherry D", "date": "July 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135029212}, {"rating": 5.0, "title": "What a treat", "text": "pros:", "user": "YaelHE", "date": "July 21, 2012", "id": 135026702}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "The room was on the smaller side, but nicely furnished. The king size bed was deliciously comfortable and was made with luxury linens. The bath was nicely appointed and the TV had plenty of channels and was of decent size. We were never bothered by noise from the hallway, adjoining rooms or the outside.", "title": "Great location and service!", "user": "herzog00", "date": "July 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 135025760}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "Was in town for a convention and brought my wife with me for a little get-away. Perfect location - right on Michgan Avenue. Perfect for shopping and dining. The hotel rooms are just OK. We had an upgraded room but it was just a normal room with not much of a view. The staff was friendly and helpful. Parking is expensive, but typical for this area. We will come back again.", "title": "Great place to stay", "user": "Bob B", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 187810276}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The InterContinental on Michigan Avenue was one of the best parts of my stay in Chicago! Every time we entered the hotel we were greeted by an wonderful man named Will who was always willing to help us with questions or get us a taxi. He is the first impression that you get of the hotel when you enter and he is absolutely amazing! He even sent my daughter to the front desk for a special gift which made her day! The service overall was great and the staff was always so friendly and helpful. The hotel is also located in a great spot so you are in walking distance for many of the Michigan Avenue highlights. I will definitely choose the InterContinental for future Chicago stays - and I hope to see Will every time!", "title": "InterContinental Chicago Magnificent Mile", "user": "Jill U", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187793432}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "The InterContinental Hotel in Chicago has to be the most welcoming hotel we have ever stayed at!!! As we arrived at our destination on a very busy Michigan Avenue we were calmly greeted by a porter named Will who immediately took our luggage and car and told us where we needed to register. He answered all our questions and said we might enjoy the bar/ restaurant while the luggage was delivered to our room. We went inside and were enjoying ourselves in the relaxed atmosphere when my husband realized that he had left a bag in the car containing some of his medication. It was then that we met Aaron. Aaron quickly offered to retrieve the bag and deliver it to our room These two men took the time to make us feel at home and we would like to thank them for their efforts!!!! The hotel itself is beautiful and our view from the 21st floor of the historic tower was fantastic!!! The room was huge and spectacularly appointed!!! Can't wait to return when we can stay longer!!!", "title": "Luxury on Michigan Avenue", "user": "Deborah D", "date": "December 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187743655}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "Stayed at the Intercontinental for my husband's conference... I got to have a vacation. The hotel is very nice - clean and friendly. The breakfast buffet at The Continental is one of the best buffets I've been to. Orlando, the omelet station chef, was fantastic! He greeted me and my children every morning with a smile. His omelets are unbeatable... he also creates waffles, pancakes, breakfast sandwiches, breakfast burritos - you name it, he made it - and all with a friendly smile. Thanks for a nice stay.", "title": "in town conference/vacation", "user": "ecfackler", "date": "December 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 187654766}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The service here was absolutely amazing - we stayed here on our trip in to watch the Chicago Bears CRUSH the Dallas Cowboys...everything was great from the room, all of the amenities (chocolates, fruits, etc), location is as CENTRAL AS IT GETS and the service was perfect. The housekeepers, waiters, front desk folks and up through to the managers - everyone we met was really professional, efficient and nice. Midway through the trip we wanted to go to 2nd city for a comedy show - of course, the hotel booked this for us in about 10 minutes! It is really a fantastic hotel - this is the first review i'm ever leaving (or feeling compelled to leave) on tripadvisor - so that says it all...", "title": "Wow, I felt like a celebrity", "user": "scho1018", "date": "December 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187579817}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "My family took a vote during this trip and we will only stay at this InterContinental when we visit the Magnificent Mile from now on. We have visited Chicago a couple of times a year for the last 10 years and have stayed at a majority of the hotels along the strip. We have had some great experiences at those other hotel, but they fail when compared to this InterContinental. I will explain why we voted to always stay here and have given up on trying any of the other hotels.", "title": "Our only choice from now on", "user": "sigs99", "date": "December 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188133826}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled on business", "text": "1) Service/staff: The service that we receive from the staff is over the top. I have yet to be treated poorly by any member of the staff while staying here. Our heart felt thank you goes out to Martina. She always makes us feel like a valued guest whenever we book a stay. Our check in at the Ambassador desk was flawless and the free chocolates were a hit with my daughter. The guest service member could not have been nicer. We were also greeted by a very nice man(I am so sorry, but I lost his card and can not give his name in order to give him the proper credit that he deserves) who asked what we had planned for our stay. He gave us some great advice on the local attractions and told us if there was anything that we needed to just give him a call. I also had a nice conversation with the maid service staff one morning. They were very polite and friendly.", "title": "Outstanding for a Board Meeting", "user": "asoule2013", "date": "December 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188126540}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "2) Location: It is ON the Magnificent Mile...it doesn't get better than that.", "title": "Great Location!", "user": "mpeterson", "date": "December 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188095131}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled solo", "text": "3) Food: We had to eat at Michael Jordan's once again. Chalk up another awesome meal and some killer drinks.", "title": "Good hotel in downtown Chicago", "user": "Matthew B", "date": "December 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 188085582}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "4) Pool: If you have not seen this pool then you are really missing out. Check out the photos of this massive indoor pool with tons of seating. The water was warmer than last year which we really appreciated.", "title": "Fabulous close to home getaway", "user": "plefker", "date": "December 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188082398}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We just stayed three nights at the InterContinental on Michigan Ave. The location is top notch, it is great; however, I really couldn't believe how much they nickel and dime you. The gym is not free and is quite expensive ($12 a person/day or $16 a person for the entire length of stay), there is no free coffee, newspaper, or business center. I wanted to print something out but I would have had to rent the computer (fee) and pay for the paper I used. Bob, the concierge was very helpful and friendly. Unfortunately, I can't really say too many other workers were that friendly. The telephone manners at this hotel need a lot of help. After someone is finished helping you they just hang up abruptly. Our room was nice and clean with a great view and was rather large, so that was nice. The only thing I can't understand is why it's a 4.5 star hotel? I can see the 4 star, it's nice like a Hyatt, but that extra .5 star is beyond me. If the price is right I'd recommend this hotel, but be aware that all the extras cost a lot in the long run.", "title": "Not worth the money", "user": "rebcherry88", "date": "December 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 188072612}, {"rating": 2.0, "title": "So far not so good.", "text": "Not even arrived yet but have called to confirm booking to discover I have been allocated rooms with insufficient beds to sleep the party I booked for. The guy on the phone was rude and unhelpful. What would have happened if I had just trusted that the booking would be okay.", "user": "Mark W", "date": "December 19, 2013", "id": 188057319}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This hotel was everything we expected it to be--nearly flawless. The staff and service were first class. After having stayed at some other \"high\" end hotels, we finally found one worth praising! Thank you for treating your customers with the highest regard.", "title": "Great Experience!", "user": "Mindy F", "date": "December 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 187998487}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Beautiful hotel in an unbeatable location. Swimming pool is great. Hotel front desk was helpful in giving us a nice room in the newer area, facing the lake. Nice view. The historic part didn't look as fresh, but could be a matter of taste.", "title": "Beautiful hotel, but cheap service", "user": "Travelista2006", "date": "December 18, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 187952389}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "However the service is rather cheap. Internet was charged even though we had been told it is free, gym pass is charged. If you ask room service to bring you normal cups (not the styrofoam! you have in your room) it is charged.They will charge you if you move around the in-your-face tray with all the pre-packaged stuff you pay if you consume. So it takes a bit of soft-talk at checkout (of course if you didn't check it stays on your bill, is it what they expect?). Food was pathetically cheap. I ate one breakfast and chose other spot for the remainder. Concierge disappears somewhere for hours and needs some prodding to help.", "title": "Bears Game and Birthday Celebration", "user": "Bob B", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187842345}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "My best friend was in town visiting and I decided to have a \"staycation\" weekend with her downtown. We chose InterContinental, and we absolutely loved our stay!", "title": "Fantastic exp", "user": "Marisa B", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134737874}, {"rating": 2.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Some of my personal favorite aspects of the hotel would be the fitness room, the beautiful pool, the perfect Mag Mile location, the convenience of having a top Chicago restaurant/bar (MJ Steakhouse) AND a Starbucks right in the hotel lobby, and the gorgeous facilities in the historic building. I can't think of one negative thing to say about the hotel and our experience over the weekend.", "title": "INCONSISTENT SERVICE AND LOTS OF ADD-ON SURCHARGES!", "helpfulness": 2, "user": "UpperWestGal", "date": "July 18, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 134676982}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Simon and Sean were very accommodating throughout our stay. :) We'll be back and I'll always recommend friends/family to stay there when coming in to Chicago.", "title": "Not the 4 star I was expecting", "user": "3Seadogs", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 134651957}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "I stayed here while in town for a wedding -- NEVER AGAIN!!!", "title": "Great location", "user": "Liz B", "date": "July 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134590476}, {"rating": 3.0, "title": "They charge you for acess to the internet.", "text": "Yes it's true that it's great location and the facility is nice enough, and clean. However, we did NOT enjoy--", "user": "mr c", "date": "July 16, 2012", "id": 134574376}, {"rating": 3.0, "title": "Tired, but still Grand!", "text": "We stayed here after booking on Hotwire. The magnificent Mile location is great, but the room was disappointing. We were in the newer wing (ie not the heritage tower), but the room was small and the oversized furniture was well-worn. The bathroom was clean and functional but also in need of updating. We wondered if Hotwire guest get the worst rooms, but the receptionist told us we had one of the better ones!", "helpfulness": 1, "user": "English-Exile", "date": "July 21, 2012", "id": 135023986}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "We did not use any of the hotel facilities but having visited friends staying in other hotels on The Mile, there are better and newer hotels in this price group in the area. We wouldn't recommend it on value.", "title": "What's not to like", "helpfulness": 1, "user": "udvudy", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134911307}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I walked by the Intercontinental back in 2008 and looked at the location and the Starbucks right next to the lobby and decided: Next time I'll stay here! So I did, and really have nothing to complain about. Great room, perfect location and friendly service. Unfortunately, the pool was closed at the time. We were free to go to the pool at the Marriott across the street if we'd like. Had a decent burger at MJ Steakhouse and my morning coffee at Starbucks.", "title": "Unforgettable Weekend", "helpfulness": 3, "user": "Paul D", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134846821}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I however do agree that any hotel these days should have free internet, but many just used Starbucks. My plan was not to stay in my room too long anyway.", "title": "Taste of Chicago", "helpfulness": 1, "user": "Chase1973", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 134759016}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The InterContinental Hotel Magnificent Mile made my engagement more memorable and romantic than my fiancé could have ever dreamed. The hotel staff was more than accommodating and professional; additionally they ensured that we had a great time away from the hotel and with the recommendations of the concierge, we were able to enjoy everything the Windy City had to offer. Simon the Director of the Front Office really helped make our engagement weekend spectacular. The room itself was absolutely fabulous, they even sent up a lovely bottle of champagne to celebrate. The other amenities are everything that should be expected of a hotel of this caliber. I highly recommend this hotel and I’m looking forward to my next stay in the near future.", "title": "Parental advice...", "helpfulness": 1, "user": "Ben P", "date": "July 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134745712}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "This hotel has a great location, comfortable beds, is clean and has a great pool for swimming laps. However, it did not live up to the 5-star rating. We did not receive a wakeup call as requested when checking in late the night before. The concierge was going to try to book a reservation for us and leave a message. He did not follow through. The robe had a hole in it. There was no safe in our room. \"We're converting to a newer safe. I guess you're in the transition group that have been removed but not replaced yet.\"", "title": "Not 5 Star Service", "user": "ActiveTempo", "date": "July 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 134380608}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Parking can be handled by the hotel, or there are several options nearby. Stayed for one night in February 2012 with my wife and 7 year old.", "title": "Location, location, location!", "user": "BDEurope", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 134316546}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "You can't beat the location! Very convenient to everything in downtown Chicago.", "title": "Great Location", "user": "ctoneill93", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134297191}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "The hotel room was obtained via a name your own price site. Granted, you get what you pay for, however, for a total of $129 a night, the room was just adequate. Very small, dark, with a view of the building (fun to watch the neighbors when night falls) and a huge gaping hole in the cabinet (where the minibar used to be). I understand that lower rate paying customers get the lower run of the house, however, should hotels auction off rooms to consolidators when the customer is ultimately getting shorted.", "title": "Super Clean Hotel", "user": "Telecommie", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134280961}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Check-in was efficient and the receptionist was extremely helpful and friendly. Made you feel welcome.", "title": "Extremely professional and helpful staff!", "user": "Moorerk", "date": "July 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134279391}], "location": {"country": "United States", "city": "Chicago"}, "stars": 4.5, "variance": {"poor": 135, "average": 287, "very good": 623, "terrible": 75, "excellent": 895}, "aka": "Intercontinental Chicago Hotel Chicago", "slim_ranking": 0.361445783133, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "InterContinental Chicago is a lot like the city itself: historic but hip, refined but relaxed, cultured but comfortable. A member of Michigan Avenue s architectural elite since 1929, our hotel is within easy reach of Chicago s incomparable museums, stores, theatres and restaurants. Navy Pier, Shedd Aquarium and Oak Street Beach are minutes away."}