{"user_rating": 4.5, "review_count": 1918, "name": "InterContinental Miami", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Quality hotel with quality people......will return!! THX", "title": "Made Miami Come Alive", "user": "traveler1239", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124717497}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "This hotel is huge. We stayed in a suite, which, in our case ws little more than a regular room,and well worth it. The suite was huge, and very comfortable, and totally quiet. We also had access to the Club Lounge, which included a free very nice breakfast buffet, and an equally nice free cocktail hour. The staff here is superb-uniformly pleasant and helpful, especially the doormen and valet parkers.", "title": "Excellent,huge hotel,but a few drawbacks", "user": "nippnsc", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 124710392}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Downsides:", "title": "Nice surprise", "user": "WesternGardener", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124545958}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "The hotel has many inappropriate charges:", "title": "Great location best view in downtown", "user": "Diazcruz", "date": "February 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124532312}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "1) $24 per day for Internet usage", "title": "Luxurious Miami weekend", "user": "tbecker2359", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124529429}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "If you are coming into town and need a place near the airport that has great food by room service and just a comfortable room this place is fine. However, it bills itself as high end and is very noisy and the halls have no ice makers. Rooms are clean and it's near lots of \"stuff\" on that end of town. I only give this place an average rating.", "title": "Best in the area, but...", "user": "Nexttripflash", "date": "February 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 124501868}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Entire party loved the hotel. Visit was excellent.", "title": "pre-cruise stay", "user": "sk84fungirl", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124452508}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "There were 4 in our part and we had two rooms the Friday night before Labor Day. We took a taxi from MIA to the hotel for about $25. There was some traffic, but nothing major.", "title": "Great hotel option in downtown Miami", "user": "davidbruce", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124429888}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Two in my party had never been to Miami before and loved everything about the hotel and the location. Our view was of the downtown skyline. It was very nice.", "title": "perfection", "user": "MonicaMiami", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124403298}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The room was very clean and beds quite comfortable.There is a small store in the lobby. Looked to have some specialty items and was a little pricey. We walked to Bayside for drinks and hung out for a while. As we went back to the hotel, someone was having a white party. A boat was docked next to the hotel where many were parking before boarding. Lots of lobby foot traffic.", "title": "An extraordinaire Brazilian Culinary Festival experience...", "user": "Jose B", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124354375}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "My sister and I stayed at the Intercontinental five nights in April. She was there on a business trip I tagged along for, so fortunately I didn't pay anything to stay here.", "title": "Okay", "user": "bdyl2133", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 160075783}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Pros:", "title": "JASMINE JEAN- ROOM SERVICE ATTENDANT", "user": "Cynthia C", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 160011199}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "- There's a park right outside the front door (would be great if you're here with kids)", "title": "Great location", "user": "Chefblack_13", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 159946586}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "- Nice views of the water", "title": "Nice Hotel", "user": "Mark J", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 159937047}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "- Pool area small but nice, and clean", "title": "Great stay - Strange Staff", "user": "Katyjoy32", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 159933834}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Once again we stayed at the InterContinental before a cruise and it was perfect again. Our room was upgraded overlooking the water and we were able to wake up and see the ships waiting for us to board. A solid performer every time with comfortable beds, convenient location and great staff.", "title": "Excellent stay once again", "user": "IRB33785", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161148136}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We booked this hotel for a change of pace, we normally stay at the Holiday Inn Biscayne Bay before we cruise out of Miami but looked forward to our stay at the Intercontinental. Prior to arriving I read that a guest had been charged $100 to be able to check in early and when I booked back in the Fall I was told that early check in wasn't a problem and that was important since our flight arrived at 11am. I wanted to double check so I emailed the hotel directly and my email was forwarded from Eduardo to Stephanie R and this was the response \"We can put a request on your reservation for early check in without any extra fee at 12pm.\" Let me start by saying I completely understand that this response was not a guarantee of an early check in.", "title": "Not the best experience", "helpfulness": 2, "user": "Irish68Boston", "date": "May 18, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161096379}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "We arrived via an airport shuttle and the employees out front of the hotel were amazing, they were quick and efficient. We went to the check in desk and were told we were eligible for an upgrade to Club Level, this would be $27 and included a room on the 27th floor or higher/access to the evening cocktail hour and breakfast in the morning both held on Floor 29, it sounded great so we accepted. We were told our room wasn't \"quite ready\" and they provided us a card to utilize for access to the Club Level offerings, they also included a sheet detailing the places within the hotel that would offer a 15% discount for the \"club level upgrade\". The woman checking us in said our room would be on the 27th floor but the actual room # wasn't available yet, she asked for a cell # and said they should have something within the hour so we headed to the pool bar for lunch/drinks.", "title": "Amazing property, amazing views, and amazing staff", "user": "neveradullmoment87", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161058520}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "The bartenders at the pool bar were very nice and accommodating and the pizza and salad were delicious as well as the delicious Mojitos. After lunch we checked to see if we had received a call but we hadn't so we decided to have another drink. When we received our bill I asked about the 15% off that we were told about and the bartender said we needed something other than the \"Club Level Key Card\" they offered us at check in with the sheet telling us where the 15% was honored. After talking to another staff member the bartender kindly gave us the discount. Nearly two hours passed and we figured we would go down and check on the status of our room. We were told \"sorry it still isn't ready but will probably be ready within a half hour, so we walked to the Starbucks in the lobby and had an iced coffee and hung out in the front lobby area for another hour,.", "title": "Lovely hotel", "user": "ChiFT", "date": "May 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 160934764}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Now we were seeing plenty of people coming in with luggage and checking in and receiving room keys and heading on their way, we patiently waited for another 1/2 hour and I decided to go check once more since we were tired and really wanted to change so we could meet our family who were driving down. I waited while two couples checked in, both receiving room keys and heading on their way, one was actually given a room on the 27th floor. The person that helped me was so kind and apologetic, she tried very hard to get us a room. The person that helped me next said she didn't see anything in my reservation about the early check in and asked if I had the email, I said I didn't print it but knew it was from Stephanie, she said they had more than one Stephanie and asked if I knew her last name, I didn't but told her I could locate the email via my phone and pulled it up. Two people looked at it and acknowledged that they knew \"Stephanie R\", they proceeded to go out back and came out with a lady who introduced herself as the person who responded to my email inquiry, her first words were \"I never said early check in was guaranteed and I certainly never promised you the 27th floor\". I was taken aback because I never once said she promised me either, but to be told our room would be ready soon on three separate occasions was frustrating. I said you are correct, you didn't say the 27th floor and I never said you did, I said your staff said we would be on the 27th floor but an actual room hasn't be assigned, she didn't say she was sorry for coming at me with that accusation. I brought up the fact that now it's after 3 and you just offered a room on the 27th floor to someone who just walked in to check in. I was then told they were very sorry but so many guests had chosen late check out that day which was affecting the turnaround of the rooms, I patiently although quite frustrated at this point returned to the lobby and decided to sit there until 4pm which is their listed check in time. I went back up to the desk and was surprisingly told the room still wasn't ready, this was ridiculous you tell us we're eligible for an upgrade to Club Level, floor 27 with no specific room # 4 hours ago and for some reason we still can't get an assigned room at the listed check in time but plenty of other guests can.", "title": "Glad to have found parking alternative", "user": "Rick L", "date": "May 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160629215}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "A repeat visit to this hotel to one the roooms that has been upgraded. Decor is fresh and bright in the corridors of the floor and the rooms have certainly benefited. Furniture is modern and comfortable and well-thought out and the electronic control panel for two types of blinds is a real plus. Bathroom was improved too with elegant new fittings, and dressing room area made for extra space. Upper floors facing the harbour made for an interesting view.", "title": "Room upgrade is excellent - but get real with the wifi", "user": "BerkhamstedJules", "date": "February 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124239639}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The hotel thrives on conventions and so lacks a bit of personality with few areas to sit in the public spaces apart from those awaiting their ride to the airport. The bistro restaurant is good, but I felt was pricey, especially the breakfast. They exploit the lack of easy walkout alternative options.", "title": "Watch your bill", "helpfulness": 1, "user": "Elllie E", "date": "February 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 123958645}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Club floor was out of action for the refub when I was there and this was a real negative for me - it's a cost-effective way of having light meals without hefty bistro bills.", "title": "A luxurious sleep", "user": "NickyWLondon", "date": "February 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123950359}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Our deal gave us access to the wifi inclusive, but its one of those sytems that only lets you attach two devices - why oh why?? Most of us on the roead have a laptop, a pda/smartphone and an iPAd or equivalent. Also why make us log on every time we connect? It's just annoying in the extreme and totally unnecessary. These are the hassles that you remember and make you choose to go elsewhere where they get the business of working on the move.", "title": "Excellent location and great service", "user": "DavidmWigan", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123902287}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "AS frequent client of this hotel, it was sad to see how they socked it to us in one of our recent stays in charging outrageous prices ($380 per night, plus parking, taxes etc = >$450 night) when we normally would pay half. The recent renovations are not becoming and so they must be making loyal patrons pay up. Club floor looks like a Motel 6. Will consider the Biltmore next time and start giving them some of our business. Stayed at the Intercontinental in NYC (across from the Waldorf) at Christmas and it wasn't even this high and we got a Jr Suite for so much less.", "title": "By far the best hotel in Miami", "user": "Janet L", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123882884}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Nothing to complain about for this hotel. Friendly staff, great rooms with great view. We used priority points to stay one night pre-cruise because others were staying here also. I understood why with its closeness to the port, shopping, dining, etc. We will stay again when we are doing a pre-cruise stay. Only drawback was paying for parking and internet but most high end resorts charge for those items that should be free.", "title": "Great place to stay", "helpfulness": 1, "user": "IRB33785", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124927549}, {"rating": 5.0, "title": "Great Stay", "text": "Last week stayed at the Intercontinental Hotel - Miami and just had an excellent experience. The room was comfortable, the Priorty Club lounge had a wonderful breakfast and in the Happy Hour in the evenings had a party atmosphere. All-in-all I would tell anyone headed to Miami to give it try; you won't be disappointed.", "user": "Chris C", "date": "February 20, 2012", "id": 124864521}, {"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I stayed here on November 4, 2011 right before a cruise for one night. We booked it through Last Minute Travel and got a decent rate. As soon as we arrived at the hotel, we tried to check in. Granted, it was early - 2pm. They claimed not to allow early check ins, but a friend had checked in early just minutes earlier. Of course they have early check ins....for a price. This then started the upsell that continued throughout our stay. They asked if we wanted to upgrade to a bay view for $20. I asked if that would get us into a room now. Of course it would! So, we took it. We figured we had already saved about $60 by booking through another site and we were super tired from traveling. We were also offered an upsell on some other frequent traveler thing, which we declined.", "title": "Just Average Pre-Cruise Stay", "user": "kaf1968", "date": "February 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124836352}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We got to the room, which was quite nice at first glance and was well-appointed with furnishings, a mini bar (which we did not partake in), toiletries, etc. Nice big bathroom. Great view and worth the money.", "title": "Great view...plumbing needs attention", "user": "mjpino", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124832676}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We rented a car right from the lobby to go to an event in Boca Raton. That was super convenient, but the hours are very limited. Be prepared to pay $35 per night to park. Yikes.", "title": "Magical", "user": "Lawtraveler084", "date": "February 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124724275}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Loved the Hotel. Was there at a discount for a conference. Otherwise pretty pricey. Location is great. Can walk to the bayside marketplace with food, shopping, nightlife etc. Rooms were clean and comfortable although and cool enough as even in April is was 85 degrees. Breakfast buffet in lobby restaurant $24.95 per person which was no way worth that. There is a Starbucks however if you want a cheaper option.", "title": "Very nice views and location is great", "user": "cindyb", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159919402}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The hotel is a proper business hotel providing easy access to the downtown Miami area. The hotel is away from the beach and the party scene in Miami which also means that the surroundings are calm and quiet at night. It overlooks the bay and offers good views of the docks. The promenade right beside the hotel offers a peaceful place to sit by the water reading a book or just taking a stroll.", "title": "Good business hotel", "user": "guamit", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159861716}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Rooms are clean and spacious. They offer most amenities that you would require. Sleep quality is good with a comfortable bed and quiet surroundings. Food is decent but if you end up staying longer it starts tasting just the same. Service could have been better with the staff at the concierge being slow and not willing to go out of the way to help out. The hotel has a good bar in the lobby and is a good place to hang out after work. The hotel is walking distance from the AA arena so if you are planning to catch a game, it could be a good option. The concierge could help you out with the tickets.", "title": "Excellent stay / Impressive hotel", "user": "Karelle V", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159848473}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Would want to try out something closer to the beach next time.", "title": "solid luxury hotel with super staff", "user": "arid2923", "date": "May 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 159755678}, {"rating": 4.0, "title": "Beautiful Hotel, great location, just a little \"cold\" atmosphere.", "text": "We arrived at the hotel pretty early and our room was ready! the room was spacious, comfortable and with a great view! it was my friend's birthday and we received a birthday cake and champagne! Very nice touch.. very delicious food at the restaurant toro toro and at the room service! The order taker was really friendly and the fried rice is my favorite! the sangria at the bar pool is the best I had in a very long time! The hotel is gorgeous modern and very clean! The concierge as well as the front desk were helpful and efficient. The club lounge servers are really nice and offer nice breakfast. Very nice location! Perfect for business as well as family or friends trip! Will definitely be back! THANKS", "user": "A TripAdvisor user", "date": "May 5, 2013", "id": 159726642}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The stay at the InterContinental-Miami Hotel was a great wonderful experience and a super super awesome birthday gift for my wife. She and the family enjoyed the stay. We will like to thank Mr. Rosello Chief Concierge for the excellent service in expediting the reservation for our stay at the Intercontinental. This hotel has professional staff and service. Highly recommend... On behalf of myself and family.", "title": "Excellent Experience!!!!!!!!!!", "user": "anibal c", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160616868}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed the night before our cruise and the staff was wonderful. When we checked in Yessica took great care of us and upgraded our room when we told her it was our anniversary. Nice little park outside the hotel with a short walk to restaurants. Would stay again.", "title": "Great Night Stay", "helpfulness": 1, "user": "jenniferjmoats", "date": "May 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160377700}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "This hotel is well-located near Brickell Key and the AA Arena--where the Heat play-- and many other attractions, restaurants, shopping and just a short ride to the causeway to Miami Beach. The lobby is large and ultra modern with an active bar and restaurant. Our room was large and well-furnished; bathroom shower had two massage water heads and the closet was conveniently located in the bathroom area. Great views from the 25th floor. There were plenty of staff members around the hotel to help with directions to locations or to answer questions. Definitely a good place to stay.", "title": "Happening Place right Downtown", "user": "RichardLBrown", "date": "May 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160296526}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "I cannot rave highly enough about this hotel. This year I have stayed at IC's in NYC/Boston/Melbourn/Sydney/Singapore and Jakarta and, with the exception of the other (terrible) IC Doral in Miami they have all been knock out.", "title": "Superb", "user": "Frequent Traveller from Scotland", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160263928}, {"rating": 5.0, "title": "Great value for money", "text": "This property also takes some beating. From a great welcome at check in, one signature, key card and then room (unlike the torture of checking into the Doral IC.) And what a room. Incredible. Superb view, lots of really nice touches....oh so comfortable bed and a bathroom to die for.", "user": "LozHill", "date": "May 9, 2013", "id": 160128925}], "location": {"country": "United States", "city": "Miami"}, "stars": 4, "variance": {"poor": 89, "average": 165, "very good": 486, "terrible": 43, "excellent": 1135}, "slim_ranking": 0.0458015267176, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "A Shining Star Among Downtown Miami Hotels Miami is truly one of the world's most vibrant tropical playgrounds. In this stunning locale, a pulsing nightlife, brilliant white-sand beaches, and sizzling culture combine for the perfect getaway. Stay at the InterContinental Miami to savor the best of this colorful city. Our alluring downtown Miami hotel offers richly appointed accommodations and breathtaking views of Biscayne Bay. Immerse yourself in luxurious elegance - just minutes from South Beach, the Port of Miami, Coconut Grove, and Coral Gables. Boasting 641 newly redecorated guest rooms and suites, we're an oasis of sophistication and world-class service. Discover this enchanting downtown Miami Florida hotel, in a magical setting: * Overlooking Biscayne Bay, in the heart of Miami, Florida * Minutes from South Beach, the Port of Miami, Coconut Grove, and Coral Gables* Only 7.5 miles from Miami International Airport (MIA)* Just 25 miles from Fort Lauderdale International Airport (FLL)Indulge In Unrivaled Luxury At Our Hotel In Downtown Miami Our 34-story downtown Miami hotel provides dazzling views and spacious guest rooms and suites. Take advantage of 101,000 square feet of meeting space. Rejuvenate in our state-of-the-art fitness center and mySpa. Whether you're visiting for business or pleasure, this deluxe hotel in downtown Miami offers everything you need for an unforgettable stay."}