{"user_rating": 4.0, "review_count": 1097, "name": "InterContinental Resort Tahiti", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed here in November on 2 separate stays. We were here on Nov. 9-11 and Nov. 17-19. I can say that both of our stays went on without a problem.", "title": "2 great stays", "helpfulness": 2, "user": "sigs99", "date": "November 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 186253162}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Rooms: Both of our rooms were very clean and comfortable. We had fresh fruit and flowers when we arrived. The views of the ocean and Moorea were unbelievable to say the very least.", "title": "Great \"airport\" hotel", "helpfulness": 2, "user": "Trvlshuz", "date": "November 28, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 186130713}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Check in: No issues. Greeted with fruit juice which was very nice. Got an upgrade. No waiting in line. The bill was correct on both stays.", "title": "Great 1st step to Polynesian holidays", "helpfulness": 1, "user": "DelphineDty", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185881479}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Views: UNREAL!", "title": "Great facilities, terrific staff", "helpfulness": 2, "user": "goldie01", "date": "November 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 185753058}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Food: The food at the restaurants was very good. We were happy with the portions. Service was slow at the main restaurant, but we did care as we were on vacation in paradise.", "title": "Expensive!!!!!!", "helpfulness": 1, "user": "Janice0826", "date": "November 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 185745426}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We stayed at the IHC tahiti as brief overnight, between a flight arriving from Tikehau, and our flight out to LAX early the next morning. Our transfer time was at 0540 am so we did not get to have our free breakfast buffet this time around (this was our second stay here). Reception did say that we could have arranged to have the lobby bar provide us with breakfast early in the morning, but we decided not to do this. However, this was a nice touch and very considerate as the hotel had noted how early we had to depart.", "title": "Good location near airport", "user": "surreygrl", "date": "November 18, 2013", "detail_rating": {"sleep": 4.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 185115465}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This hotel is now my preferred hotel for waiting for the next flight out. It is very close to the airport (15 minutes drive maybe) and is a very nice property. With ambassador club benefits, we were upgraded to an overwater bungalow (very nice view- sunset with the other huts, mountain views -?is it Moorea, kayakers, very nice). Fruit and water was provided, and some very nice vanilla cookies. This is fact tied us over to the next day as we were then not hungry for dinner.", "title": "The ideal entry gate", "helpfulness": 1, "user": "Than P", "date": "November 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184937149}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "The oddest thing about this hotel was that the number of mosquitoes encountered was the highest in all the hotels that we stayed in this time around, even higher than at the Tikehau open air airport. Oh well. Bring your \"Off\".", "title": "Great place to crash after a long flight from the States", "helpfulness": 1, "user": "ABQTravelers", "date": "November 16, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 184932169}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This hotel is the best cure for the fatigue of very long-haul flights. Should you land at night or in the wee hours of the morning : have a nap, and then open the curtains when the day has come. It is an explosion of colors, from the garden below to the lagoon, the ocean and the green island of Moorea capped with an eternal little cloud. Panoramic rooms are highly recommended. Lovely swimming pool, excellent bar, exuberant Tahitian dance shows, and a gourmet restaurant that is probably the best in Tahiti.", "title": "A must stop before or after your Island hoping!", "helpfulness": 2, "user": "facosmo", "date": "November 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 184787802}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "We stayed at the Intercontinental Tahiti for one night after flying in from the USA. The hotel is very close to the airport, so it was just a quick van ride over. This was great because we were pretty beat after traveling for about 22 hours. The grounds of the hotel are very beautiful. We had a nice room with a lagoon view, which was apparently a free upgrade from the garden view room we had booked. The pools at this hotel are awesome. We enjoyed swimming quite a bit. The one thing I really didn't like much about the hotel is the service in the restaurant. It's pretty slow and the staff seemed very aloof. Otherwise, we had a great stay. Probably not a place to stay for more than 1 or 2 nights, however, as there isn't much in the way of beach access, or much else to do at the resort other than swim in the beautiful pools and lagoon.", "title": "Disappointing for an Intercontinental", "helpfulness": 5, "user": "morgini", "date": "November 11, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 184401204}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "After a very comfortable flight at the pointy end of the plane from Los Angeles to Papeete on Air Tahiti Nui, we spent 3 nights in the Intercontinental Papeete in a Panorama room overlooking the sand bottomed swimming pool - We just could not justify the over $600 for an over-water bungalow as we were going on a cruise. This hotel was rated 4.5 - 5 stars. I would suggest after experiencing the hotel that some major work needs to be done on the resort, as it is very “tired” in appearance. Our room was in need of renovation and a few other people that we spoke to around the pool commented similarly. We ate breakfast in the hotel one day which was awful and extremely expensive at $50 a head! Our rating for this hotel = 3.5. Oh by the way, my wife was unhappy at having to pay over $50 in the spa for a nail varnish colour change, something that costs her at most $15 at home.", "title": "Major renovation needed!", "helpfulness": 1, "user": "Rugby_Nut_Canada", "date": "June 16, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 1.0, "service": 2.0}, "id": 113914381}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We ate dinner in the “gourmet” Le Lotus restaurant, we are foodies and were looking forward to this - This meal was a joke! Startlingly expensive for overly fussy, pretentious, reasonably presented but failed miserably to deliver in almost every aspect except the setting. My wife’s meal was truly dreadful, mine slightly less dreadful - We didn’t ask for dessert! You can dress up a dog to look good but in the end it is still a dog!", "title": "Good choice for Tahiti but rememer you're not in Bora Bora anymore!", "helpfulness": 3, "user": "ISPpilot", "date": "June 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 112929979}, {"rating": 4.0, "title": "Much better than expected!", "text": "Speaking of dogs, if you are a dog lover you'll be quite upset by the way staff treat stray dogs that may venture onto the property - this seems to be a cultural thing and not specific to this hotel!", "helpfulness": 8, "user": "WrldTrvlr37", "date": "June 1, 2011", "id": 110907618}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "All in all, we were glad that we only had 3 nights here before embarking on our cruise.", "title": "Great for a short stopover", "helpfulness": 8, "user": "alegria310", "date": "May 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 106928367}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Stayed here at the end of a wonderful trip visiting Bora Bora, Moorea and a cruise on the PG. We were a bit nervous about the poor reviews but we were not disappointed. Yes, the hotel is old, built in the 1960s and doesn't have that \"new car smell\" with bells and whistles of the newer Bora Bora resorts. There isn't much of a beach but Tahiti is not known for majestic beaches. We were upgraded to the Antares suite due to my Royal Ambassador which was a nice treat. The room was huge, spacious and clean. No mold, broken furniture or walls that needed painting. Everything in the bathrooms worked, including the jacuzzi bathtub. Check in was quick, efficient and friendly. Was offered a 4 pm check out without even asking. We had really nice views of the beach and Moorea. Too bad Moorea blocks the sunset but of course this is not the hotel's fault.", "title": "Poor Value for Cost of Room...Go Somewhere ELSE!!!", "helpfulness": 4, "user": "vai", "date": "April 29, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 106139913}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed here for four nights after a Tahitian Cruise with Princess. The resort was fantastic with its own man-made lagoon for snorkelling. The Tahitian Dinner Show was amazing also, but the rooms were outstanding. We didn't pick a water bungalow, mainly due to cost, but we did get to see inside one. The Garden View Rooms are, in our opinion, much nicer at this particular resort. Overall, it was spectacular. Would definately recommend to all and hope to return there again in the future.", "title": "Post Cruise Stay - Amazing", "helpfulness": 1, "user": "MariaSteve S", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114826081}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Practical, close to airport, perfect solution to stay in transit for other islands", "title": "Very nice", "user": "Mancio74", "date": "June 24, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 114716219}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We stayed two nights at the Intercontinental enroute to Moorea. The pool (no beach) and grounds provide the focal points of the resort and are exceptional. From the open-air lobby, the view of the pool area and Moorea is superb. The garden-view room was purchased at the lowest rate and was well-appointed with a lanai and a view through the trees to the water. The hotel was used as a base for the exploring the island, however, it seemed to offer a comprehensive list of activities. The food is very expensive, however, the ala carte portions are generous and could be split between two people. My wife was impressed by the Polynesian show. The island of Tahiti, while appealing away from Papeete, could be compared to one of the Hawaiian islands in terms of development while the less populated islands in the chain still retain the beauty and isolation that make this travel experience unique.", "title": "Beautifully Designed Resort", "helpfulness": 1, "user": "jfoote", "date": "June 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 114655018}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stopped over at the IC Tahiti on our way to the Four Seasons Bora Bora and also on our way back after a stay at the IC at Moorea. While this hotel is better than the IC Moorea (which is not hard) we were disappointed. The hotel is old and in desperate need to a renovation. They market to out side tourists to come to the evening shows so the whole resort lacks exclusivity and most nights there is a constant line of tour buses dropping outside tourists to the hotel for the dinner show.", "title": "Circa 1980", "helpfulness": 2, "user": "Alreadybooked", "date": "June 22, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 114641922}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The pools are lovely but the food prices are exorbitant. We had a rental car so preferred to spend our money at outside restaurants where the food and atmosphere was much better. We ran into other guests in the pool who were complaining about the cost of meals and drinks.", "title": "This is a dive of epic proportions!", "helpfulness": 3, "user": "ToastyJ", "date": "June 19, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 114401583}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "Nice hotel, with a beautiful swimming pool, gardens and beach spaces. Buildings and rooms a little bit old. If you get a good price for room is Ok. To pay a expensive price it is not value for money. As everything in French Polinesia it is very expensive food and beverage.", "title": "Nice hotel", "helpfulness": 1, "user": "RobertoChile", "date": "February 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 13915273, "likes": {"liked": "— Swimming pool and gardens", "disliked": "— Old rooms and bathrooms furnitures."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Travel experiences depend heavily on where you're coming from, both literally and figuratively, and no place better exemplifies this principle than the Intercontinental Resort Tahiti. If I had paid this much for a similar resort in, say, Southern California or Hawaii I would have given the Intercontinental a lower rating. But every time a hiccup presented itself during the three days we were there I just couldn't bring myself to get that exercised about it because of the overall atmosphere and trip-of-a-lifetime location. If you've wanted to visit Tahiti for twenty years and you finally find yourself there while the folks back home in Seattle are spending New Year's huddled in damp fleece jackets watching the televised fireworks in Times Square, how bad is it really if the waitstaff can't figure out whether breakfast is included in your room rate? (It was, and they did ultimately get it right.)", "title": "A few flaws, but you're in Tahiti!", "helpfulness": 18, "user": "schippk", "date": "February 3, 2008", "detail_rating": {"front_desk": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 13235388, "likes": {"liked": "— Grounds, view, pool, room", "disliked": "— Airport noise"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "That said, this is not the place to go if you expect absolute perfection in every detail, and calling it \"five-star\" is a stretch. My husband and I were there on a post-cruise stay, so we had already experienced some of the best that the other islands in French Polynesia had to offer. The Intercontinental is on the outskirts of Papeete, and while the property's lush and gorgeously-maintained landscaping provides an illusion of seclusion, that tranquility was shattered every night at around 11:00PM by Air New Zealand and Air Tahiti Nui. The hotel is disconcerting close to the airport, and for reasons that remain mysterious to me all international flights arrive and depart in the middle of the night. We had a room in the wing closest to the airport - I've talked to people who stayed on other parts of the sprawling property who said they never heard the planes. The noise lasted for less than an hour every night and was not catastrophically loud (my husband slept through it), but it was a bit of a nuisance.", "title": "perfect honeymoon", "helpfulness": 4, "user": "juanca123", "date": "January 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 12623624, "likes": {"liked": "— The scenery", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "More annoying to me was the discovery that the hotel's famous Le Lotus Restaurant and swim-up bar had closed for renovations the day before we arrived. I had been immensely looking forward to both experiences, and I pouted for about half an hour when I found out about the closures, but I can't say that I would have stayed anywhere else had I known in advance.", "title": "Great place, but pricey.", "helpfulness": 7, "user": "AHunta", "date": "January 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12391692, "likes": {"liked": "— Very clean and friendly staff", "disliked": "— high prices and only 1 English TV station (CNN); the rest were French."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "On the plus side, the Intercontinental has an unforgettable setting. I defy the world's worst curmudgeon or most jaded traveler to be unmoved by the sight of the sun lighting up the Sea of the Moon before setting behind the peaks of Moorea, a spectacle we enjoyed every evening from our room's large balcony. The hotel has a webcam that can be accessed from its Internet site. I've been torturing myself watching this sunset on my computer since I've been back.", "title": "In a word.......SPECTACULAR!!!", "helpfulness": 10, "user": "Hoopefloop", "date": "January 6, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 12391638}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "My husband suprised me with a trip to Tahiti for our 25th wedding aniversary.", "title": "Trip of a lifetime!", "helpfulness": 2, "user": "suzannemirabelle", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10698695, "likes": {"liked": "— the views", "disliked": "— not a thing!"}}, {"rating": 5.0, "title": "A Great Stay", "text": "This was the most amzing hotel, from the minute you arrive you are treated like gold.", "helpfulness": 1, "user": "AlaskaMan2006", "date": "November 7, 2007", "id": 10681167}, {"rating": 4.0, "title": "Very pleasant stay", "text": "I cannot say enough nice things about this hotel, its service was beyond compare.", "helpfulness": 5, "user": "Bohemien", "date": "November 7, 2007", "id": 10669879}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Bravo!", "title": "One night stay one the way to Tikehau", "helpfulness": 2, "user": "cas0325", "date": "October 31, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "value": 4.0, "rooms": 5.0}, "id": 10463777, "likes": {"liked": "— Grounds", "disliked": "— None"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My wife and I just returned from FP and stayed at the IC in Tahiti. The place was close to the airport (easy transfer), no jet noise, beautiful grounds, and nice pools. We were only there for one night and arrive very late. Staying at the IC was a great way to start the vacation. What you pay at the IC is a good value compared to resorts at other islands.", "title": "Looked like the best hotel on the island", "helpfulness": 4, "user": "cmb2", "date": "October 26, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 10358002, "likes": {"liked": "— Good value for cost of package special offered", "disliked": "— Cost of Polynesian dinner show & given wrong start time so we missed half the show"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "After a harrowing experience with Air Tahiti Nowhere - because that is exactly where you can go with them - no where - we finally made it to Papeete via Air France. Our 3 AM arrival was not a problem with the good people at the Intercontinental, promptly checking us in, driving us and our luggage 300 meters or so to our room which turned out to be a gorgeous panoramic view of the sand bottom pool, with infinity edge that really felt like you were in the ocean, with out the surf. We began our honeymoon spending the day on the beach and never felt like we had to leave the resort. The swim up bar was extremely convenient, but a bit pricey...the cost of paradise I guess...Food was excellent but pricey - I am from Las Vegas and am used to tourist prices, but even the sandwiches and pizzas were topping the $20 mark (darn exchange rate). Be sure to take advantage of the nightly happy hour at the tiki bar - 2 for 1 drinks - while watching the Sunset. Very nice indeed! After our negative experience getting to Tahiti, this piece of paradise was the perfect remedy to put our honeymoon on the right track!", "title": "Relaxing in Paradise", "helpfulness": 2, "user": "yoonrj", "date": "October 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10150156, "likes": {"liked": "— complete facilities, never have to leave if you are there for rest and relaxation", "disliked": "— little to no nightlife / extra entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We recently stayed at the Intercontinental as part of our honeymoon. We stayed for two nights prior to visiting Bora Bora and one night post Bora Bora.", "title": "Great hotel for a short stay", "helpfulness": 3, "user": "aussietraveller82", "date": "September 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 2.0}, "id": 8726164, "likes": {"liked": "— Swimming pools, restaurant, dance show", "disliked": "— Lack of beach, garden view rooms, airport noises"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "We found this hotel to be a great stopover hotel as it is very close to the airport (around a 10 minute drive). The hotel has some really nice facilities including a sand bottom swimming pool and a lagoon filled with coral and tropical fish.", "title": "Recommended 100%", "helpfulness": 3, "user": "IaOranaSpain", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8718992, "likes": {"liked": "— The staff is very helpfull, they made you feel part of their family, and the beauty of Tahiti", "disliked": "— nothing to complain about"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We were quite disappointed with our Garden View king sized room during our first stay. The first night we had two single beds pushed together and the second night they moved us to a room with a king bed. The bathrooms in both rooms were quite average and the aircon didn't work in one of the rooms. However, on the way back from Bora Bora we were upgraded to a Panoramic Room. We were extremely happy with this room and strongly recommend the upgrade. We didn't have an opportunity to see inside the overwater bungalows but they looked quite average from the outside (compared to what we saw at Bora Bora).", "title": "Start your trip at the Intercontinental", "helpfulness": 4, "user": "Stonewell", "date": "September 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8603745, "likes": {"liked": "— concierge and 2 pools", "disliked": "— no water view from room, only from part of balcony"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "On Sunday nights this hotel has an excellent dance show in the restaurant. The service and menu selection at dinner was great. The menu has a number of less expensive options for dinner (such as steak sandwhiches and pizzas) - which we were very pleased with.", "title": "Great view", "helpfulness": 9, "user": "NormalHeightsGirl", "date": "August 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8394955, "likes": {"liked": "— The view of Moorea", "disliked": "— Roosters crowing all night. But, they are found on every island, so this is not unusual."}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled solo", "text": "After visiting Raitea, Bora, Rangiroa and Fakarava I stayed for two days in this hotel. It's crowded, noisy and the staff is terrible.", "title": "This isn't Polynesie", "helpfulness": 4, "user": "DivingDutchman", "date": "November 29, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 11137446, "likes": {"liked": "— Nothing; the checkout", "disliked": "— Everything"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "So if you plan to visit Polynesie don't go to this overpriced hotel.", "title": "Good for a stopover hotel", "helpfulness": 5, "user": "heb999", "date": "November 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 11098195, "likes": {"liked": "— Views of Moorea", "disliked": "— Very busy"}}, {"rating": 1.0, "title": "dont go!!", "text": "Stayed here for two nights. The first night we arrived at about midnight after a US$20 / 5 minute taxi ride. Check-in was speedy and friendly. Our room was a lagoon-view one. The room was dated but everything worked. Unlike the last review, we did not have a bathroom with a window facing onto the corridor, instead ours faced back into our own room, which was a bit strange. The bed was comfortable and the room was clean. The major disadvantage of the room was that it faced the nearby airport and so we experienced some noise.", "helpfulness": 2, "user": "jalonzo", "date": "November 26, 2007", "id": 11076819}, {"rating": 4.0, "stay_parameters": "Stayed October 2007", "text": "The main pool area was large but the sunbeds were positioned so close together around it that it was impossible to raise some of the parasols. The pool service was efficient and friendly. The other pool had a swim up bar but the sun loungers were not so comfortable as those around the main pool. Our main annoyance was the noise from the many children playing - it certainly was not a romantic setting.", "title": "Very nice hotel", "helpfulness": 6, "user": "Clydeview", "date": "November 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10959977, "likes": {"liked": "— The Lotus Pool", "disliked": "— The safe breaking down"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The concierge was extremely helpful as were all the staff.", "title": "nice hotel", "helpfulness": 2, "user": "quickybird", "date": "November 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 10782282, "likes": {"liked": "— nice pools and lagoon", "disliked": "— food prices"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "It couldn't have been a better experience. The property is as pretty as a picture and the bungalows on the water are a little bit of heaven on earth. We had lunch a delicious lunch in one of the restaurants that was presented beautifully and our bungalow was so nice we decided to order supper and eat on our spacious balcony. The prices were comparable to any upscale hotel I have stayed in in Europe or the United States.", "title": "Paradise in paradise", "helpfulness": 3, "user": "Chick B", "date": "November 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184263937}, {"rating": 2.0, "title": "Disappointment", "text": "InterContinental Resort Tahiti is a large hotel, with two swimming pools, several reataurants and bars and small lagoonarium. Also is located in close proximity to busy airport which means that most of the time is full of people transferring to other islands or to cruise ships. Our situation was the same, we were spending there just one night before our flight home. And it was nightmare. When we arrived, the reception was full of people, we had to spend one hour standing in the queue as there was no chairs available at all. After that we went for lunch and spent another half an hour just waiting for a free table. Then, exhausted, all we wanted was cool down in the pool. The bigger one was out of questions, as a wild crowd was in and around the pool, with no place to sit down. But fortunately there was another one, smaller, but so much more relaxing, with pool bar. But it was already late afternoon, and what was supposed to be lazy, take-it-easy day, turned out to be total misery. It seems to me like the staff or hotel amenities were not prepared for that amount of guests to make everyone stay enjoyable.", "helpfulness": 4, "user": "Justeen77", "date": "October 31, 2013", "id": 183011334}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "What to say about my stay there??? I will start with the good part as it will be quick : thank you Teiva and Heitaina for their support during my stay as they made feeling really home despite all the bad experiences I faced during the stay!!! Speaking of which, I absolutely recommend to avoid this hotel for several reasons : very old rooms very far away from Intercontinental usual standards; the activities are so out of ages, and still the same year after year; the hygiene is really worrying as i found hair and insects few times in my food; the attitude of staff and managers is really unexpected as they always tried to deny first my concerns before admitting them facing my evidences. JUST ONE ADVICE: do not come to this property!!!", "title": "An experience to forget", "helpfulness": 4, "user": "Ruben U", "date": "October 30, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 182999578}, {"rating": 3.0, "title": "Request a room far away from the bar", "text": "We had a long layover in Tahiti on a flight from New Zealand to the United States. This is the closest hotel to the airport. The airport is small and open-air, so we stayed at the hotel to relax, shower, and take a nap.", "helpfulness": 4, "user": "JustPassingThrough22", "date": "October 30, 2013", "id": 182916209}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "If you stay at this hotel, I recommend that you request a room that is as far away as possible from the jazz band in the bar.", "title": "Tranquil and Scenic", "helpfulness": 3, "user": "OldseadogOxford_UK", "date": "October 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182819930}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Following our over-water villa in Bora Bora, we were ready for a more conventional hotel and the Intercontinental did not disappoint. We were upgraded without asking from a Lagoon View to a Panorama View with a fantastic view of Moorea. This is a large hotel with over-water villas if that is your preference. The Panorama room was spacious, generously appointed and the housekeeping service was exceptional. We tipped the housekeeper early on -- I believe it was only 1000 fpf -- and she took great care of us...fresh flowers in our room every day and turn down service every evening.", "title": "Tahitian Excellence", "helpfulness": 8, "user": "anasoll", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105083090}, {"rating": 1.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The \"beach\" pool and the main pool are very clean and well maintained...and there are plenty of staff circulating if you need a drink and a snack. We found the food to be surprisingly good and the service in the main restaurant was friendly and faster than most other Tahiti dining spots. They served the best fish & chips I've ever had, anywhere. If you wish to bring in some food, there is a refrigerator in the room and there is a Carrefour (European equivalent of a Wal-Mart) about a 15-minute walk down the road just past the Maeva Beach Resort. The carryout is excellent, there is beer and French wine at reasonable prices. You may also find some relatively cheap souvenirs.", "title": "Worst Hotel Ever!! Bad end to Honeymoon!", "helpfulness": 5, "user": "tashacromp", "date": "April 20, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 104726395}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We dined at Le Lotus, the on-site 5-star restaurant that is over the water. Great service, English is spoken and the dining lived up to the rating. If you are going to have one big night-out dinner, this is highly recommended...expensive but worth it.", "title": "Very pleasant stay", "helpfulness": 1, "user": "balmac", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104324642}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We went to the water sports center and boated out for a helmet dive. The guide was great with my wife who is not a water afficionado -- she enjoyed it very much as a sting ray and some black-tipped sharks swam by. The cost was about $150 for the two of us and we would gladly spend that again for this 2+ hour experience. There is scuba available and the staff clearly is experienced and highly professional.", "title": "Mediocre at best", "helpfulness": 3, "user": "RAM07", "date": "April 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 103977388}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The dance troupe that entertained was not the typical hula/Hawaii type entertainment. This was a Marquesa troupe and their routines were dramatic and war-like rituals. They invite audience participation and end with photo ops if you wish. We've experienced several of these both in Tahiti and Hawaii, and this was far and away the most dramatic and entertaining. I was reluctant to attend another one of these, but am glad I did.", "title": "A Nice Introduction to French Polynesia", "helpfulness": 1, "user": "SteveTait", "date": "April 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103933890}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Tahiti is gorgeous and amazing, but it is wonderful to stay at a hotel that is a paradise unto itself. The natural lagoons, views of Moorea and the fab food and drinks, makes this a \"must see\" location for anyone traveling in the South Pacific. I felt that this is how the entire world should be!", "title": "Paradise In Paradise", "helpfulness": 1, "user": "Stewart S", "date": "November 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185587181}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This is overall a beautiful and relaxing place with gorgeous views. The staff are friendly and try hard to be of assistance. However, it is very expensive and everything is an extra cost. Very few people spoke English although they seemed to understand it. Overall service in the restaurant was extremely slow but food was delicious. We had a very difficult time getting water as I'm sure their preference was for us to order drinks. We had a very late flight when leaving and asked to stay in our room for a late check out. They wanted to charge us for this and offered a \"changing room\" for our use when we left. After packing everything up, going to desk to check out and reluctantly opting for the changing room they did agree to let us stay in our room.", "title": "Tahiti", "helpfulness": 1, "user": "NancyKC40", "date": "November 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 185501822}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "The BeachComber is a very good place to stay when traveling to Tahiti. The hotel is close to the airport which is very convenient. The offer offers many facilities like one large swimming pool, on sand made swimming pool, a diving center (TopDive)... Polynesian shows happen on Wednesday and Friday. I love so much the firm mattresses. However, the wifi is incredibly expensive ! Even gold members have a free restricted access (only 2 devices per room).", "title": "Best hotel in Tahiti", "user": "Pierre L", "date": "November 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 185475461}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "My wife and I arrived totally jet lagged after a miserable flight on Air Tahiti Nui from LAX. Just walking thru the lobby made the suffering worthwhile. Lovely local staff, great food and service and a beautifully appointed and a killer view. The complex overlooks a beach and reconstructed coral lagoon and an on-site dive centre.", "title": "Stunning first impression", "helpfulness": 1, "user": "michaelh409", "date": "November 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185359231}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "This is not a bargain hotel, but a great treat when transiting to the rest of French Polynesia.", "title": "Unbelievably beautiful!", "helpfulness": 2, "user": "victom", "date": "November 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 185254238}, {"rating": 2.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "How is it possible that this hotel is rated 4 stars??? I am seriously considering writing a long complaint letter to Intercontinental hotels. Luckily, we only stayed here for one night as we were transferring through Tahiti, and had an early flight to catch in the morning.", "title": "Terrible, only ok if you are in transit", "helpfulness": 5, "user": "helsinkiblush", "date": "April 8, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 103246920}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We spent our last night in French Polynesia as part of our honeymoon at this hotel. The change in atmosphere and service after previous hotels was incredibly stark. Staff really didn't care, and I felt like we were at some tacky family/kids resort stuck in the 1980's. The hallways were really run-down, and our room was in what seemed like a very old part of the hotel. We were checked in by a trainee who was not very knowledgeable, or very friendly. Our room was clean, but noisy and the minibar was empty. Bed was comfy.", "title": "Superb Resort", "helpfulness": 1, "user": "Sha-sas", "date": "April 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103139709}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We had lunch in the main restaurant downstairs and it felt more like a school cafeteria. The food was ok, there was also an all-day buffet to choose from.", "title": "Intercontinental-pleasantly surprised", "helpfulness": 2, "user": "bmford", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 103086139}, {"rating": 2.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "The left part of the hotel feels more modern and new. The buildings and rooms (at least from the outside) looked marginally better. The infinity pool with a sand bottom was cool. We had dinner at the restaurant on the left side of the resort, which was much nicer than the main restaurant.", "title": "Dissapointing and tacky", "helpfulness": 5, "user": "SAM585", "date": "March 31, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 102269799}, {"rating": 4.0, "title": "Perfect honeymoon destination", "text": "When checking out at before 5am to catch our flight, there was an elderly gentleman (about 80 years old) checking in. He was told his room would not be ready until 2pm the next day. In the Tahitian hot weather, I found this really rude from the staff! This is a large hotel and it was off-season, so I am sure there were rooms free. I think they found him something in the end, but the staff could have handled it so much better.", "helpfulness": 1, "user": "Offaly_Steve", "date": "March 16, 2011", "id": 100357850}], "location": {"country": "French Polynesia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 70, "average": 158, "very good": 425, "terrible": 45, "excellent": 399}, "aka": "Intercontinental Resort Tahiti Hotel", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "The resort has a total of 253 rooms and bungalows, comprising 172 fully renovated garden and lagoon view rooms, a separate wing with 60 panoramic view rooms for the top achievers and VIPs, a suite, and 32 over-water bungalows. All units are air-conditioned, with international facilities and amenities. Located in 32 acres of gardens, the Polynesian style resort offers views of unforgettable sunsets and volcanic peaks of the sister island Moorea, just 12 miles across the sea of moons. The resort offers 2 restaurants including gourmet over water restaurant and an all day dining restaurant featuring the best Tahitian shows on the island, 2 bars, 2 crystal clear, fresh Water overflow swimming pools, and a host of activities to entertain just about everyone. The property features an activity center including tennis, water sports and the largest scuba-diving center Special mention about the huge lagoonarium where guests can swim in a protected area and enjoy Polynesian exceptional sea-life. The Deep Nature Spa by Algotherm is open since the end of 2008\" is also equipped with a great gym"}