{"user_rating": 4.0, "review_count": 825, "name": "InterContinental New Orleans", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "This hotel has a relatively pretty, but old-feeling lobby, kind of like being at a nursing home. There was very little buzz in the bar and restaurant the entire time at the hotel. It just wasn't a very exciting or provocative ambience for a supposed 4 star hotel.", "title": "Decent room; not much else to this hotel", "user": "GlendaleCA", "date": "November 16, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 21920733}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Service and staff were friendly at check-in.", "title": "Nice Place", "user": "cyl70e", "date": "November 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21710248, "likes": {"liked": "— Location", "disliked": "— Internet was slow and in/out, plus you had to pay for it."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "As for the room, it was simple and clean, yet a bit outdated.", "title": "Good Location, that's about it", "user": "sarapac", "date": "November 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 21674910, "likes": {"liked": "— location", "disliked": "— not a good value for price paid"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled on business", "text": "The location is decent for getting into the FQ, and I would suggest this hotel if there is a very good price. You will get a safe, clean environment, but nothing much more than you would find in a limited-service hotel like a Hampton Inn/Courtyard, etc.", "title": "Definitely does not deserve it's star rating", "helpfulness": 1, "user": "DrSavant", "date": "November 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 21574628, "likes": {"liked": "— Proximity to the French quarter", "disliked": "— Everything"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Staff: Interacted with several of the staff and only one was rude, but its expected at any non-5 star hotel.", "title": "WAY below our expectations - 10/30/08-11/2/08", "helpfulness": 2, "user": "B.G._Chicago", "date": "November 3, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 21504912}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We spent 5 nights in December here with only one being a weekend night. Our room was very clean, spacious, and was as expected and at $59/night (before tax) really couldn't be beat. We did not eat in the hotel so cannot comment on the food. We found that ~$35 for internet the whole time we were there to be very reasonable and the NY Times delivery was a nice touch. The room also has wine glasses and a corkscrew which is very convenient.", "title": "Great Value", "user": "keepinitreal9874", "date": "December 11, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22635819, "likes": {"liked": "— location"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "The location was ideal as mentioned in the other reviews as I enjoyed being able to leave the french quarter. Our room was very quiet (11th floor). The only disturbance was on the first night in which the room adjacent to us must have had the alarm clock reset and it went off at midnight, but within minutes of calling the front desk this issue was addressed. In general the concierge and front desk were extremely friendly.", "title": "Nice alternative to the French Quarter", "helpfulness": 1, "user": "Irish89", "date": "December 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22468766, "likes": {"liked": "— location", "disliked": "— Parking expense and lack of ability to handle big crowds"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Overall a very good experience and would definitely recommend this hotel for business or leisure. A minor point of concern was that our bed was bizarrely soft and while this doesn't bother me if your a very finicky sleeper I would keep this in mind.", "title": "Intercontinental a good choice", "user": "digtravel", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 22410908, "likes": {"liked": "— Large comfy room", "disliked": "— Shower curtain caused water to get all over the floor"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We got our room through Priceline for $50 a night. For that kind of money, this place was quite the deal.", "title": "Thanksgiving in New Orleans", "user": "everfair", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 22350977, "likes": {"liked": "— The staff was great", "disliked": "— Internet was expensive"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008", "text": "It is an upscale hotel with all the amenities (and expenses) which one would customarily expect. They clearly take good care of and great pride in their hotel. Like another reviewer, we were there during the Bayou Classic. Not only were the elevators overtaxed, but so were the dining facilities. The guy at the bar told me that we could order food, but it would take about an hour and a half to get it! I would think that a hotel which is within easy walking distance of the Superdome would know how to handle these big crowds a little better. Perhaps not.", "title": "pretty hotel", "user": "BIG_SOS", "date": "November 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22233804, "likes": {"liked": "— bed", "disliked": "— cold pool"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Generally speaking, the quality of the hotel was fine. Front desk staff were friendly, concierge was helpful, room was clean and reasonably well appointed. Room service food was disappointing, but about what I'd expect from a hotel.", "title": "Streetcar noise!", "helpfulness": 1, "user": "sjpottawa", "date": "October 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 20528588, "likes": {"liked": "— Convenient safe location", "disliked": "— early morning streetcar noise!!"}}, {"rating": 5.0, "title": "loved it", "text": "However... my room on the 5th floor was *NOISY*. At 5:30am, the noise from the streetcars starts - and it was loud enough to wake me up both mornings. I mentioned it to the front desk staff after the first night and they offered to move me to a quiet room, but I was flying out early the next morning and was planning on waking up at 5:30 anyway.", "helpfulness": 1, "user": "ljfine99", "date": "September 14, 2008", "id": 20048107}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "There may be other rooms that aren't affected by this, but I won't take the chance.", "title": "Exceptional staff!", "user": "Melinda065", "date": "September 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19745991, "likes": {"liked": "— Staff", "disliked": "— Can't think of a thing"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "First I'd like to wish all well in the Gulf Coast. Secondly, I'd like to thank everyone that contributes to this site. So, i landed in N.O on 8/19/08. The cab ride is appr. $15 pp, & there were 2 in my party for that ride. We stayed at the New Orleans Intercontinental Hotel, located on St.Charles st. Lovely hotel! I haven't anything bad to say about the place. As soon as I checked in my friends and I went seeking Pat O'Brians thanks to this site. We were looking for the infamous \"Hurricane\" drink. Sorry to say that it left little to be desired. Not at all what i expected. Now, if you want a REAL hurricane, then I suggest you head over to a little spot on Gravier st. It's next door to the Holiday Inn and it's called Dominic's Bar. It's 2 blocks from the hotel. Trust me when i tell you that you really only need one. I had 2 in one day and missed a date with a nice guy. Bourbon st. is another world. We went during the day, and it was a regular neighborhood, few people out and about. At night, OH MY GOODNESS!!!!! it was a COMPLETELY different world. Seems like most everything is legal on Bourbon. There's a spot right next to the hotel (if you come out and go to your right) cheap breakfast. I forget the name but it's the first place that you can buy food if you come out and turn right. Had breakfast at MOMMAS. Really good food. My friends did the Katrina Tour, I declined. Just don't feel comfortable giving my money to a bus company when it doesn't benefit the victims. Anyway I didn't get to do half as much as I wanted to. I will say that I LOVE NEW ORLEANS!!! I can't wait to go back, and have 1/2 of a Hurricane! PS. The pool in the hotel was clean and enjoyable, as was the fitness center.", "title": "Good not Great", "user": "Oyster4", "date": "August 14, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 18960974, "likes": {"liked": "— Location"}}, {"rating": 5.0, "title": "Very Nice!", "text": "We didn't arrive until around 2 a.m. the first night, but from the moment we stepped out of the cab until we left our experience was nothing less than perfect. I can't say enough about the staff, especially Michael the concierge, so knowledgeable!. We were married during our stay and he made sure a surprise flower arrangement from my fiance was waiting when I arrived in our room. He went above and beyond to make our stay comfortable. We never encountered a single staff member who wasn't smiling and friendly. The beds were great, nice and plush. The housekeeping staff was very accomodating as far as waiting until we had left for the day before they came to clean, we never had a knock at 8 or 9 a.m. to disturb our sleep.", "user": "funtravelfamily", "date": "August 4, 2008", "id": 18625115}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We had a lovely stay at the Intercontinental in New Orleans. Conveniently located. Accommodating staff who were helpful at every turn. We could not have been more pleased with the reservations, check-in, valet parking, directions to attractions, cleanliness and attention to detail. We were delighted with our stay and would book there again. However, our decision to visit the in house restaurant for a Saturday morning breakfast was a terrible mistake. The very expensive breakfast buffet was awful. The table service was, at best, absent. The buffet items were mediocre, if present. The expensive, special cooked items were inedible and arrived after all had finished their meals and some had left the table - A travesty in food oriented New Orleans. After a very long wait for our check, we were told that the credit card machine was broken. The whole restaurant is broken! By all means stay at the New Orleans Intercontinental Hotel. Avoid the in house restaurant at all cost!", "title": "Terrific stay/terrible breakfast", "helpfulness": 1, "user": "claude46", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 21458154, "likes": {"liked": "— The helpful staff", "disliked": "— The restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "I was only in Nola for two nights (sadly) to attend the Voodoo Music Experience. I had booked the Intercontinental a few months earlier via Priceline and got a fantastic rate of only $64. plus tax per night. Arriving at the hotel I saw a tour bus parked outside and quite a few people in the valet area. I overheard that the hotel was fully booked that night and that many musicians were staying there. When I checked in I was told that I was being given a complimentary room upgrade to a King Deluxe.", "title": "Beautiful, Comfortable, and in a Perfect Location", "helpfulness": 1, "user": "Remgirl1", "date": "October 30, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21413351, "likes": {"liked": "— The location.", "disliked": "— The connecting room doors."}}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The room I got looked exactly like the one in their photos. I was on the 11th floor and had a huge balcony that overlooked the courtyard. The bed and pillows were very comfortable, the towels were large and plentiful, and the shower was great. The temperature controls were easy to adjust, however the alarm clock had me stumped so I simply requested a wake up call.", "title": "Beware!", "helpfulness": 3, "user": "zuki13", "date": "October 27, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 21305791, "likes": {"liked": "— The room", "disliked": "— The staff"}}, {"rating": 5.0, "title": "Perfect Location, Perfect hotel", "text": "I ordered room service for dinner two nights in a row after getting back from the music fest. I know a hotel is not the place to get an authentic (or cheap) shrimp po' boy in Nola, but I was starving and wanted to get away from the crowds. Let me tell you, my Po' Boy was delicious and huge. Two people could've made a meal of it. I liked it so much I got it both nights.", "user": "goodtrips4meandu", "date": "October 21, 2008", "id": 21072877}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "As for location, the Intercontinental is in the perfect spot. Its at the border of where the central business district and the French quarter meet. This was a quiet area yet only a five minute walk to bustling Canal Street. The St.Charles and Canal streetcars are easily accessible, as well as public bus service, and the area itself is safe to walk at night.", "title": "Nice Hotel and Great Location!!!!", "user": "beechmi", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20712870, "likes": {"liked": "— Good value and location.", "disliked": "— Interior design is dated and in need of renovation."}}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 4, "variance": {"poor": 78, "average": 150, "very good": 326, "terrible": 34, "excellent": 237}, "aka": "New Orleans Intercontinental", "slim_ranking": 0.58, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "InterContinental New Orleans enjoys one of the city s most coveted locations: two blocks from the French Quarter, four blocks from Harrah s New Orleans, six blocks from the riverfront and come Mardi Gras time a front row spot on the St. Charles Avenue parade route. The Morial Convention Center, Uptown and the Louisiana Superdome are also nearby."}