{"user_rating": 3.5, "review_count": 651, "name": "Inter-Continental Presidente Ixtapa", "reviews": [{"rating": 1.0, "title": "I will NEVER stay again in this 1 star hotel...", "text": "We had an Awful time there, we just stayed 3 days instead of 10 in the room reserved (1504) because we couldn't stand it.", "helpfulness": 2, "user": "pacofresan", "date": "July 18, 2007", "id": 8183219}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "1.- They DON'T have Internet access on rooms, they only have in the lobby and they offer you chairs, NO desks! Therefore I wasn't able to Work... this cause me a big economic loss.", "title": "Very important!!!! Please read!!!!!!!!!", "helpfulness": 3, "user": "RBresident", "date": "July 6, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 8069571, "likes": {"liked": "— The hotel was very clean", "disliked": "— the customer service and the food"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007", "text": "2.- The food service was absolutely bad. When we arrived on Friday at 11:30 am, ALL tables were already reserved for Friday night and Saturday night... we were only able to eat dinner at the hotel on Sunday. Dinner on Sunday was Mexican Fiesta, it was raining and all the food was soaked because they did this special event outdoors. Therefore we weren't able to eat dinner at all at the hotel those 3 days.", "title": "Not what I expected", "helpfulness": 4, "user": "chrsimage", "date": "May 22, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7669442, "likes": {"liked": "— BBQ on the beach and Lourdes at the lobby bar", "disliked": "— Food, illness as a result"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "3.- There were ants in our room, the bath tub was broken and it wasn't draining the water. The air conditioning was not working, we spent those 3 days at 95° (35° Celsius). There was a big whole in our bedroom to the bathroom so all the smell from the drain was going to the room.", "title": "Great Value During Off Season For Families", "helpfulness": 1, "user": "playalovers", "date": "April 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 7486300, "likes": {"liked": "— room view, staff", "disliked": "— Weekends were very crowded by the pool"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "4.- We couldn't enjoy the ocean because some people are using the hotel beach front to park Jet skies and they come in and out constantly passing, no kidding, 3 feet from people's heads. I didn't want my children to suffer an accident.", "title": "Good stay - Rooms old", "user": "ckoleaz", "date": "April 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 2.0}, "id": 7394650, "likes": {"liked": "— Service was good", "disliked": "— Rooms are old and tired"}}, {"rating": 4.0, "title": "Great time for the family", "text": "We returned with our daughters to Ixtapa after 15 years and had a great time at the Presidente. The staff was friendly and helpful and our suite was clean. The concierge Maria helped us with restaurants and fun things to do with the kids. There were lots of activities for the family and our girls loved the Mexican Fiestas. The Beach Club staff (Samuel) was wonderful and kept our cooler full of cervesa and water as well as Pina Coladas. We thoroughly enjoyed our stay and it was worth every penny. If you're looking for a great value for your dollar we highly recommend this resort.", "helpfulness": 4, "user": "lyndaDelaware", "date": "August 7, 2007", "id": 8368802}, {"rating": 5.0, "title": "Please read!!!!", "text": "John and Lynda", "helpfulness": 5, "user": "dfjsf", "date": "August 3, 2007", "id": 8283169}, {"rating": 2.0, "title": "Think about it! \"And check around\"", "text": "I have just returned from the greatest vacation ever! I spent twelve days in Mexico. During the first four days and three nights, I stayed at the InterContinental Presidente in Ixtapa Zihuatanejo. By far, This was the best experience that I have ever had at a hotel! From the moment that I stepped out of my taxi, I was treated like a king. Everyone that I encountered was extremely friendly and always had a smile on their face. I speak very little Spanish, but that was OK, because everyone spoke both Spanish and English. My room was magnificent, complete with a breathtaking view of the ocean. I almost didn't want to leave my room; that in itself was a mini vacation, but eventually, I did. The food was spectacular, from the French restaurant and breakfast buffets to the hamburgers and hotdogs! The great thing about it, is it is all inclusive. I have stayed at \"top notch\" hotels before, and I have had the free food, and it usually tastes free, meaning tasteless, bland, and cheap, but not here. The food was was well made and done with care. The waiters and waitresses were always there, and very pleasant to be around. Several times, I forgot that my meals were all inclusive and got ready to pay the check! Aside from the room and the food, the hotel had all the comforts of home, including a business center, where I was able to go online, check my emails and pay my bills. There was also a great gym an a plethora of activities to sign up for. I really enjoyed the bike tour which consisted of a 12 mile tour to the Marina. Anytime that I needed something, there was always a smiling face waiting to help me out.To top it all off, the hot weather and the beach made my experience a dream vacation. I would recommend this hotel to anyone looking for a great vacationing getaway, for the entire family! There is much more that I can add to this review. I would like to thank the staff at InterContinental Presidente for offering the ultimate vacationing experience. I will be back!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 27, 2007", "id": 8243345}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "July 19, 2007", "title": "Great vacation!", "helpfulness": 6, "user": "xicana76", "date": "July 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8242398, "likes": {"liked": "— All Inclusive - everything was right there and free - beach, pool, food, drinks, activities...", "disliked": "— Leaving"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "W.F.", "title": "Needs immediate renovations", "user": "sexynana", "date": "July 22, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 8218200, "likes": {"liked": "— Didn't have to walk far to get around resort", "disliked": "— Employees spoke very little English / resort needs to be updated."}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "Spent three days at the Hotel and enjoyed the short vacation in general on an all inclusive basis. For my taste, the cuisine was outstanding (everything was very fresh). The rooms, well, that was a bit under the expectation towards a so called five star hotel, bathroom quite stingy (e.g. towels), no minibar, no ironing board, no coffee maker in room, no newspaper service, a lot of other things you usually get offered in a five star hotel (e.g. in the Indian Ocean or Middle/Far East region) were just not there. Rooms are not noise-protected, ruthless room neighbours made incredible noise at two o'clock in the morning in the adjacent room and our phone to call the reception, operator or security was out of order, but alas, in the morning, the phone worked again. Staff friendly. Swimming pool is designed for children (only about one meter deep), and in the Ocean it is mostly impossible to swim (dangerous waves). Animation bearably discrete, and there is a quiet zone. What really was a nuisance was the \"Club\" promotion touts who try to lure you into a 30 year kind of contract for USD 30'000, really ridiculous kind of concept, they are really pushing and didn't actually respect our wish to just spend leisure and they wasted almost three hours of our precious holiday time. Any next time I will say \"No, no, no\" to such promotions from the beginning. By the way, weather was beautiful, not to hot and not to cold, just right. Transfer from Zihuatanejo airport to Hotel was about 25 minutes.", "title": "Direct Beach Access and Excellent Cuisine", "helpfulness": 7, "user": "Frequentvoyager", "date": "November 17, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 10877098, "likes": {"liked": "— Sea View, Television with CNN", "disliked": "— Club promotion, Bathroom and noise from neighbour and no assitance at 2 AM."}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007", "text": "My sister and I were very disappointed. They talk about having the restaurants of the steak place and italian and sushi and french. They never opened the steak house for the 8 days we were there. And then the other ones were only open for 1 day of french and 1 day italian. The other we had the buffet which one was suppose to have seafood buffet the only thing they had every night there was the same fish that was not even worth it. The buffet was almost the same thing every day for breakfast, lunch and dinner. And to order room service you had to pay $2 per person even though it was all inclusive. The only way we got good service is when we tipped. The rooms were outdated and bed spread and blanket had a horrible smell. The pool that was for relaxation had kids all over there and they were suppose to go to the family active pool area. We have been to many places in Mexico this was by far our worst vacation ever.", "title": "Never again", "helpfulness": 5, "user": "vacation2007Houston", "date": "August 26, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 8509849, "likes": {"liked": "— nothing", "disliked": "— everything"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The front desk allowed us to check right in but when we got to our room we found mold growing on the bathroom floor in the grout of the tiles. When we wnet down to get lunch the bees were swarming the soda machine to the point the were going up inside the dispenser. We chose not to stay stay at this hotel and be transfered. I would not send my worst enemy to this hotel.", "title": "One of the Worst", "helpfulness": 2, "user": "vacationerchicago", "date": "August 26, 2007", "detail_rating": {"front_desk": 3.0, "location": 3.0, "value": 1.0, "rooms": 2.0}, "id": 8509666, "likes": {"liked": "— It was gross. I really don't like mold in my bathroom!!!!!"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The outside was nice, the rooms and the majority of the customer service was horrible. The rooms we had, the airconditioning would not work, and the power went out every single day we were there...just in our room. The front desk service was very slow and the staff were extreamly rude. When we asked to speak to a manager they said no. We had our best time outside of the resort on the entire trip. On the other hand, Jesus our server out by the pool was wonderful. After all the headaches and everything else, I would never return to this resort, nor reccommend it to any after the way we were treated.", "title": "not worth the money or headache", "helpfulness": 2, "user": "JVucenich", "date": "August 25, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 8503728, "likes": {"liked": "— the service, the rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "GO ELSEWHERE... A COMPLETE DUMP...", "title": "Go elsewhere... A complete dump...", "helpfulness": 1, "user": "HodgesFish", "date": "August 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8450505, "likes": {"liked": "— the service (staff) was good", "disliked": "— the facilities were horrible (in dire need of remodeling...)"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Terrible! We booked a ocean view room and our price total was $450 night for three (inclusive.)", "title": "Checked out after first night", "helpfulness": 2, "user": "Hawaii1CH", "date": "April 14, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 7351918, "likes": {"liked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "The room had a tiny window with no balcony.", "title": "Best holiday ever at the Presidente", "user": "EnderbyTuffys", "date": "April 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 7285658, "likes": {"liked": "— Lots to do", "disliked": "— Can't think of anything."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The first thing the staff does is ask for your credit card and charges the entire stay right up front. They do not even ask. Fortunately, we booked our reservations direct and we did not select the prepayment option even if it was less expensive. We were allowed to check out the next day after we insisted on reversing the remaining nights and requested they credit our American Express Card.", "title": "Excellent vacation - will be returning", "helpfulness": 2, "user": "DAVE_373", "date": "April 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 7281112, "likes": {"liked": "— staff", "disliked": "— draft corona....lol"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The food was not good. The potatoes tasted like flour powder. The sausages was not cooked and boiled.", "title": "Great Location, Nice Beach, A lot of fun", "helpfulness": 5, "user": "a2trip", "date": "March 25, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 7217696}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We felt very uncomfortable. We normally would put up with it, but we just could not stand staying at this hotel and we did not to ruin our vacation...so we switched to NH Krystal and we had a Fantastic time from then on.", "title": "family resort \"NOT\"", "helpfulness": 1, "user": "banderso", "date": "March 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 7216110, "likes": {"liked": "— location", "disliked": "— noise at night"}}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 4, "variance": {"poor": 66, "average": 105, "very good": 196, "terrible": 73, "excellent": 211}, "aka": "Intercontinental Presidente Ixtapa Hotel", "slim_ranking": 0.285714285714, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}