{"user_rating": 4.5, "review_count": 958, "name": "InterContinental Buckhead Atlanta", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "My husband and I stayed for a short weekend (4/28-4/30) at the Intercontinental Buckhead.", "title": "Classy Hotel", "helpfulness": 2, "user": "MrsTraveler", "date": "May 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5028170}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "We didn't spend a lot of time at the hotel because we were in Atlanta for a friend's wedding. From the little time we spent there, we can tell you that the hotel is classy and beautiful and the staff very professional. Check-in was smooth. We got the room we requested (King bed and non-smoking). We were on the 3rd floor with a street view. The building right outside our window (across the street) was under construction (looked almost done) but probably because it was a weekend, there was no construction going on. The room size was average but very nicely decorated.", "title": "Wonderful stay!", "helpfulness": 8, "user": "amash", "date": "April 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5022571}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "The bed was comfortable with HUGE pillows. I usually don't like thick pillows because my neck ends up hurting but those pillows were actually comfortable. The bathroom was also very nice. It had a HUGE tub and a separate shower stall. Our only complaint was the shower water pressure (low) and its water temperature (could never get it as hot as we like it). The Intercontinental has a fitness room and a spa but we didn't check those out. We did the breakfast buffet one morning and it was good. The buffet is what you'd find at any big hotel. Cost: $17.95/person. If you have a rental car, make sure to tell the Front Desk and they'll encode your room key card so you can get in and out of the parking garage. Parking is $15/day.", "title": "Nice But Not Exceptional", "helpfulness": 1, "user": "dapwilson", "date": "April 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 5019200}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Bottom line, this is a strong 4* hotel and we'd recommend.", "title": "Wonderful hotel!", "helpfulness": 6, "user": "Kim C", "date": "April 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4967543}, {"rating": 5.0, "title": "Had a great night at the Intercontinental", "text": "My husband and I just returned from a night at the Intercontinental Buckhead. Since we were celebrating an anniversary, I emailed Reservations requesting a king bed, since it was not guaranteed with our Hotwire reservation. I received a promt reply that our king reservation was confirmed. LOVELY! Great start.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 29, 2006", "id": 4774070}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Everything was perfect at this hotel and I will definetely stay here again. The rooms are great, the bathrooms are large and the service is awesome.", "title": "Great Hotel", "helpfulness": 1, "user": "jyd85", "date": "March 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4742091}, {"rating": 4.0, "title": "Loved the room!", "text": "The Intercontinental was great. The rooms were nicely furnished and quiet. The bathroom was spectacular with both a large soaking tub and a large standing glass-enclosed shower. We were especially pleased because we booked via Priceline and got rooms for $69/night! No mention of Priceline at check-in and the agent even asked for my Priority Club number. Parking is a little expensive at $15/night! I requested a King or Queen room at checkin but we were relegated to a room with 2 Doubles. But no problem with that. Evening turndown service with flowers and chocolate on the bed. Overall, it was an excellent stay and highly recommended!", "user": "A TripAdvisor user", "date": "March 21, 2006", "id": 4721333}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Here is the next installment of my USA wide Hotel reviews. My Girlfriend is from Atlanta and she wanted to go and visit family and friends but we also wanted to be close to the action. This hotel is super close to the action in Buckhead. It is a true five star hotel. The decor is modern and perfectly maintained. The hotel staff was friendly and very very prompt. We needed a corkscrew to open a bottle of wine and room service was there in under five minutes. The room has a tiled shower and a huge tub. A large bed and awesome views. Room Service runs 24 hours a day and you can get an awesome steak at three in the morning. Stay here I promise you will be happy. Well worth the cash outlay.", "title": "High End Hotel Go To Buckhead and Stay Here", "helpfulness": 1, "user": "zymurgy1234", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4721283}, {"rating": 3.0, "title": "Classy and a Definite 5-Star Potential, but smells of smoke...", "text": "This hotel is class from when you step out of your vehicle. The staff are always kind, generous, and proper. My wife and I felt like movie stars or rich oil barons. The room was wonderful with a very comfortable bed. The bath was very spacious and clean. The tub was huge and the glass walk-in shower was great. The water pressure was a little low, so you couldn't take advantage of the massage head in the shower. Bathrobes and slippers were included with the room. They were not as soft as the Westin's, and one had tears from too much use.", "user": "A TripAdvisor user", "date": "March 5, 2006", "id": 4585232}, {"rating": 5.0, "title": "Amazing hotel!!!", "text": "The biggest problem with our stay was once we stepped off the elevator, the cigarette smoke smell almost knocked us over. The hallway of our floor and the room itself somewhat, reeked with smoke smell. The rooms and floor were noted as non-smoking, but it obviously wasn't enforced. Otherwise, the hotel was a great experience and would consider staying again if the smoke smell issue was taken care of.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 4, 2006", "id": 4582279}, {"rating": 3.0, "title": "Not the Ritz", "text": "I have stayed at this hotel at least 20 times since they opened. The hotel is nice but the room are average to me. The fitness center is very small and crowded. The staff is very average and tends not do go out of the way to help with anything. The club foor is a joke for $150 more per night. Parking is around $30 per night. This is a wanna-be 5 Star hotel. After, my last trip I have decided to go back to the Ritz Carlton.", "user": "A TripAdvisor user", "date": "March 2, 2006", "id": 4569650}, {"rating": 1.0, "title": "Better service anywhere else", "text": "Promises one thing offers another. Hotel staff plays the blame it on someone else game rather than solving problems. They rang bell and barged in without waiting for us to get the door and I was naked. We checked out two hours after arriving and stayed at the Westin which is a real classy hotel. Email me for more details. If you choose to stay somewhere else it will be well worth the money that the staff said I couldn't get back.", "user": "AmyBinder", "date": "February 19, 2006", "id": 4470307}, {"rating": 5.0, "title": "Our new favorite hotel in Atlanta.", "text": "New hotel designed for the comfort of the people who stay there. Beds are fabulous. Rooms are pretty. Floor to ceiling windows let you know you're in Atlanta. Great bathrooms with glass shower and a deep, sparkling bathtub that made me want to take a bath, something I don't often do in a hotel. In room safe has electrical outlet so you can plug in laptop and/or cellphone. Staff were friendly and helpful. French brasserie on premises is pricy but good. Bar is a visual treat. Self parking is reasonable for location at $15.00 day - we paid more across the street when we stayed at Doubletree. All in all, a great property and one we will certainly try and stay at in Atlanta. For Priceline bid below $80, it was a fabulous bargain.", "user": "A TripAdvisor user", "date": "February 6, 2006", "id": 4417337}, {"rating": 4.0, "title": "not a true luxury property", "text": "The Intercontinental is ATL is a sort of faux luxury property. Everywhere around, one finds details that seem glitzy (carpet, fixtures, bedding, decor), but are in fact cheap - and speak volumes about the mass market pedigree of Holiday Inn/Intercontinental. The hotel was not long open when we stayed there, so I hope that explains the scattered, unorganized service. This is particularly the case at the french bistro attendant to the hotel - a real shame given a nice setting and qulaity menu. In addition, one guy at the bellstand was so rude it was unbelievable. In fact, the whole valet area at this property is a type of cheesy \"social scene\" - I was left wondering how many grammys I had to win to get my car out of the garage.", "user": "A TripAdvisor user", "date": "January 27, 2006", "id": 4391816}, {"rating": 4.0, "title": "Very Nice", "text": "In short, this property can only compete with the Four Seasons and Ritz in terms of its similar room rate.", "user": "sonnylax", "date": "January 24, 2006", "id": 4373645}], "location": {"country": "United States", "city": "Atlanta"}, "stars": 5, "variance": {"poor": 36, "average": 52, "very good": 216, "terrible": 22, "excellent": 632}, "aka": "Intercontinental Buckhead Atlanta Hotel", "slim_ranking": 0.0310880829016, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The InterContinental Buckhead sets new standards of luxury with international flair and southern elegance. A Peachtree Road address puts you close to Buckhead s thriving business and shopping districts and provides easy access to attractions such as the Georgia Aquarium, the High Museum of Art, the New World of Coca-Cola and the CNN Studio Tour."}