{"user_rating": 3.5, "review_count": 436, "name": "InterCityHotel Munich", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2005", "text": "The hotel adjoins the main train station. The rooms are clean and fairly quiet, but very small. The décor is plain. The surrounding neighborhood appears to be fairly safe, but is slightly seedy. The U-bahn & S-bahn just are a few steps away. The hotel includes a free pass to the public transportation system as part of the cost of the room. The center of Munich, the city hall & etc., is about a 10 to 15 minute walk.", "title": "convenient location", "helpfulness": 6, "user": "34isit", "date": "November 23, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 4140162}, {"rating": 5.0, "title": "Great hotel, great price", "text": "This hotel is PERFECT for the traveler(s) who are taking the train and have some luggage they are toting while trying to stay on a travel budget! It is right beside the train station, literally around the corner. I was hesitant to book it at first but after reading the reviews and finding and AWESOME deal online (75 USD for double bed room!) I went ahead and did it. Although you are literally beside the loud train station, it is not a big deal because they have double paned windows which get rid of ALL of the noise! no problems there! The rooms are very contemporary and bathrooms/entire place is very clean and neat. Does not seem like a less expensive hotel. Rooms are average size for Germany- not large like rooms in US, but standard for Europe. Hotel staff was EXTREMELY friendly and accomodating. upon checkin you receive a free in town transportation pass which is very helpful and saves you 11 euros per person per day. If you have 2 ppl in the room, they give you 2 passes per person per day that you are staying with them. That is like 22 euros savings for 2 ppl per day! do the math! that perk is worth it to stay there! PLUS no worries for a taxi if you took the train there because it is right there, even if you have a lot of luggage. Very nice walk to the Marionplatz area which is the tourist area. Not a problem to get around, you can even take the underground train to get to the city center in minutes! WONDERFUL hotel!! Would definitely stay there again!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 6, 2005", "id": 4089103}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 34, "average": 119, "very good": 200, "terrible": 19, "excellent": 64}, "aka": "Munich Intercity Hotel", "slim_ranking": 0.486979166667}