{"user_rating": 4.0, "review_count": 607, "name": "InterContinental Seoul COEX", "reviews": [{"rating": 5.0, "title": "Excellent, Clean, Modern, Friendly, Great Location", "text": "Stayed for 7 nights on first business trip to Korea. Rooms very clean and modern. Spotless, cleanest hotel I have ever stayed in, no mold or grunge in bathroom, it was impeccable. Great location on top of Coex mall, which is a huge underground mall in the center of the city. During down time could spend hours walking the mall, with hundreds of restaurants and eateries, including U.S McDonalds, Pizzaria Uno, TGI Fridays. Walk to other end of mall to pick up subway system- which was again clean and very safe- excellent way of getting around all over the city. The gym was one of the best features, it is not your typical hotel closet gym, but a full fledged health club with all amenities and service personnel. Good free weight room, universal equipment, treadmills, full swimming pool. Breakfast at hotel great international buffet- but costs $33. Good for first morning, after that walk down into mall early [even if escalator turned off- it is OK] and find coffee, bakery shops [or McDonalds]. Hotel had the friendliest and most helpful staff I have ever seen, very polite people as are all Koreans. Takes time getting use to someone bowing their head to say \"hello\" or good-bye. I will not stay anywhere else on next visit.", "helpfulness": 4, "user": "gtpatton", "date": "May 29, 2006", "id": 5230561}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "The COEX is well located, good rooms and nice gym. The hotel is expensive. While we were able to get a great room rate, the extras, food in the cafe, and $7 USD coffee became a bit of a joke with us. They have a very nice sauna but the $30USD pricetag kept us out. I would recommend the hotel for the business traveller but it was lacking charm and amenities for the our short break vacation", "title": "Functional but not spectacular", "helpfulness": 3, "user": "gregcmorley", "date": "May 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 4.0, "service": 3.0}, "id": 5227860}, {"rating": 4.0, "stay_parameters": "Stayed November 2005, traveled on business", "text": "Great hotel for business travelers -- spacious, nice, clean rooms; great gym and pool; great breakfast buffet included as part of business room price; helpful service; Coex mall attached to hotel which includes great Korean and non-Korean options, cafes, and convenient store.", "title": "Great hotel", "helpfulness": 7, "user": "gs3", "date": "December 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4248353}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Only problem is the food at a few of the restaurants is not that great and avoid getting a room facing the temple across the street - you may hear the gongs that go off at 4:30 in the morning.", "title": "Highly Recommended", "helpfulness": 7, "user": "lax2bkk", "date": "December 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4217163}, {"rating": 4.0, "stay_parameters": "Stayed July 2004, traveled on business", "text": "This was the hotel of my choice on my recent trip to Seoul in 5 years based on location and advance rates of $153/night. It turned out to be a wise one. There is another Intercontinental Hotel adjacent to the City Airport terminal which is more crowded, more flamboyant, and more businesslike atmosphere. If you want to avoid all the crowds, this hotel is for you. It's newer, smaller, well appointed, and well serviced. I purchased business room upgrade for $40 a night which includes internet access, spa use, and daily buffet breakfast on higher floor for better view. Internet access alone costs $25 and $30 for breakfast after tax. Clearly, $40 upgrade is worth it if you use internet and eat breakfast here. The breakfast was superb for a buffet. Yes it is much better than Bellagio or Caesars Palace in quality and variety of menu such as abalone porridge, fresh juice (carrot, kiwi, orange, tomato)squeezed to order, bakery, kimchi fried rice, smoked salmon, and so on. The staff is always eager to help. This is the closest hotel to the COEX convention center as the entrance is right next to each other. The overall experience was very nice and would definitely be the hotel of my choice again when I go back Seoul.", "title": "Nice Hotel", "helpfulness": 10, "user": "wallyQ", "date": "September 22, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3931221}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "I stayed at the hotel while participating in a conference, and was very pleased with my experience there. Located on the 22nd floor, my room was of reasonable size, with a king size bed, and had a very modern bathroom. The hotel lobby, gym and restaurants (\"Brasserie\" and \"Skyline\") are superb and well above average for Asia. Staff was exceptionally pleasant and courteous. The hotel is conveniently located adjacent to a huge mall (COEX Mall), and about a 10 minute walk to the subway.", "title": "Very nice hotel", "helpfulness": 11, "user": "BaldBureaucrat", "date": "August 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3798866}, {"rating": 5.0, "title": "Great", "text": "I would recommend this hotel to anyone going to Seoul and expecting a 4 to 5 star hotel experience.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "March 27, 2005", "id": 3305797}, {"rating": 5.0, "title": "as good as it gets", "text": "The hotel was fabulous! The service, food, and the hotel room. The rooms were posh, immaculate and comfortable. The location is convienant as there are tons of shops, restaurants, and bakeris below the hotel. The food was great... fresh fruit every morning!", "helpfulness": 14, "user": "ABCABCABCABC", "date": "January 24, 2005", "id": 3060438}, {"rating": 5.0, "stay_parameters": "Stayed January 2005, traveled on business", "text": "The only negative associated with this hotel is the surrounding traffic in Seoul. I don't think anyone in Seoul can escape the traffic.", "title": "Outstanding place but make someone else pay the bill!", "helpfulness": 20, "user": "mmerdock1", "date": "December 23, 2004", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 2919698}], "location": {"country": "South Korea", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 12, "average": 70, "very good": 290, "terrible": 10, "excellent": 225}, "aka": "Intercontinental Seoul Coex Hotel Seoul", "slim_ranking": 0.0703125, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.0}, "description": "InterContinental Seoul COEX is part of the massive World Trade Center Seoul, the country s one-stop business destination. You ll walk to COEX, Korea City Air Terminal and the COEX Mall s underground 16-screen theatre and more than 200 shops. Well worth a short drive are the Namdaemun Market, the Namsan Hanok Village and the Korean War Battlefields."}