{"user_rating": 4.5, "review_count": 1585, "name": "InterContinental Bali Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My husband and I spent 7 wonderful nights at this hotel. We stayed in the Singarajah wing and were so impressed by the cleanliness of the resort in general, the wonderful staff - so happy to help with anything - and the facilities. We felt safe, comfortable and were regular attendees at the Sunset Bar happy hour. We also had a wonderful beach side bbq at the Sunset Bar. All resort activities are well posted and the 24 hr concierge in our wing was a great resource - as was the genuine interest in your day, complimentary juice/coffee/tea/snacks available whenever you felt like it. Breakfasts were legendary and catered for all nationalities and tastes. At our first breakfast sitting we piled our plates high - eyes much bigger than our bellies!! - by the end of the week we were a little more restrained. Our dinner in the restaurant (can't remember the name - was next to Sunset Bar - was exquisite. Service second to none and food just wonderful. We spent most of our days eating out as the local food is also great but it was a real treat to go to the restaurant. The lobby is very impressive and we felt really special the whole stay. I would recommend this place to everyone - the people are what make Bali so special.", "title": "Safe & Luxurious", "helpfulness": 3, "user": "DJDHobart_Australia", "date": "August 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19136351, "likes": {"liked": "— Attention to detail/luxury", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Sometimes I have a tendency to think negative reviews are being too harsh, and can occasionally discount them in favor of the positive ones. I really wanted to believe that this Resort met or exceeded all the praise I read on this site, but in the end, I left a little disappointed.", "title": "Should Have Heeded Negative Reviews", "helpfulness": 3, "user": "kidscomingwith", "date": "August 18, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 19058931, "likes": {"liked": "— The pools", "disliked": "— The Ants"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "There were definite positives, but there were definite negatives that shouldn't be overlooked.", "title": "Beautiful resort, 5 star treatment", "helpfulness": 1, "user": "funtnt", "date": "August 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18981880, "likes": {"liked": "— FIVE STAR TREATMENT, BEAUTIFUL RESPORT", "disliked": "— expensive"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "First the Positives: The grounds of the hotel are spectacular. The swimming pools are beautiful, and the beach was kept very clean. Security along the beach was noticeable, and the entry security was reassuring. The massages at Spa Uluwatu were mostly good. I had three, and two were good, one was mediocre. The spa facilities were mostly nice. The jacuzzi for use of couples was very well maintained, but not at all secluded, and staff paraded through constantly. My husband and I were offered use of it, but we didn't feel comfortable, and just lounged beside it instead, wrapped in the sarongs. The sauna in the women's area was well maintained.", "title": "A perfect honeymoon", "helpfulness": 1, "user": "pinkburrows", "date": "August 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18976029}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The restaurant beside the main pool was great, but way too expensive. We ordered a bunch of the grilled seafood dishes, shared a couple beers, and the tab was over $180 US. In contrast, the beach restaurants immediately beside the property charged us $45 US for almost the identical meal, minus the dessert. The service at the pool restaurant was good, though, and the live music was pleasant, but not Balinese at all.", "title": "Loved the experience", "helpfulness": 2, "user": "Aussie_traveller120", "date": "August 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18827981, "likes": {"liked": "— spacious room", "disliked": "— not as clean as it could be"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Decided to head back to Jimbaran after staying at the Ritz Carlton in March. Thought we would stay at the Intercontinental for a change.", "title": "Great Location and Good Service", "helpfulness": 5, "user": "PerthLIz", "date": "September 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 20467432, "likes": {"liked": "— Location", "disliked": "— Pool bed service could be better"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "When we first arrived we were a bit surprised at the amount of guests staying at the hotel and the size compared to the RC. I think though this was due to the high season. It was a bit difficult to secure a sunbed and definitely not the same service as the Ritz Carlton around the pool.", "title": "Near Perfect Service", "helpfulness": 2, "user": "sharonyp", "date": "September 27, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 2.0}, "id": 20422600, "likes": {"liked": "— The service. The courteous, obliging and smiley staff", "disliked": "— NOTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "However after a few days it seemed to get quieter and we just I think got used to the hotel being a bit busier than the RC.The room service was excellent - nice big rooms. Breakfast was first class lots of variety. The Intercontinent l is in a great location - lots of little restaurants near and not too far to Kuta.", "title": "Most of the wrinkles are gone", "helpfulness": 2, "user": "Thompsons-Abroad", "date": "September 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 20191087, "likes": {"liked": "— The new rooms", "disliked": "— The odd mozzy!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Overall this is a lovely hotel, a bit big but on the plus side in a great location right on the beach at Jimbaran and not too far from Kuta for shopping and different restaurants. The service is excellent (apart from the pool area) and all the staff are very helpful. We had a few meals at the hotel which were very good and which were the same price as the other 5 stars. If you are heading to Jimbaran this is the perfect spot.", "title": "Big luxury hotel", "helpfulness": 6, "user": "Vmi M", "date": "September 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 19671237}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We find that the service at Intercontinental Bali is superb, almost perfect. We didn't feel comfortable in the first room allocated to us because it was on the ground floor, near to the Singaraja lounge. The front-desk immediately checked and offered us another room on the 1st floor, facing the pools, which was much more decent. When the front-desk discovered that my friend's birthday falls on a day during our stay there, they immediately arranged for a cake to be delivered to our room on her birthday. Upon checking-in, we requested a super-glue as the sole of my friend's sandal was coming off. The housekeeping staff appeared within 10 minutes with the super-glue!!!! The housekeeping responded to all our other requests within a reasonable time-frame. And all their staff are courteous and smiley. The only 1 incident that sort of tainted our views slightly is a staff at the Singaraja lounge. I requested that staff to help me make a reservation for massage at Jari Menari. I believe he pretended to call Jari Menari and subsequently dialled the telephone number of another spa. When he put down the phone, he told me that Jari Menari was fully booked for that day and he quickly recommended repeatedly another spa to me, emphasizing that that spa does pick-up from hotel. The speed at which he promoted another spa made me suspicious. When i went back to my room, I called Jari Menari directly and found that they actually have slots for that day!!! Luckily, this happened on the 2nd last day of our stay.", "title": "Best beach hotel in Bali", "helpfulness": 1, "user": "TK_NAK", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19582257, "likes": {"liked": "— Beach and the sunset"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We just spent three nights at the Intercon in Bali. For a family with two young children, the Intercon is ideal, as our kids really enjoyed the pools and the club they have for kids. For us adults too, the facilities were excellent. The gym was great and we enjoyed the pool and various food establishments too as the quality of food was excellent. The beach isn't as beautiful as others say it was, maybe we are too spoiled having been to various beaches in Australia, Thailand and others. Nice for the kids for playing in the sand. Service was in general attentive with some annoying lapses, e.g., at breakfast, we had to ask a number of times for coffee. Other things we did not like (for a 5 star): internet cost was approx. US$10 per day per laptop (we had two) whereas in other hotels we stayed at, the cost was per room; we were supposed to get a daily newspaper but did not; rooms did not get tea bags (although the coffee machine was great) and milk for coffee was not consistently replaced by housekeeping; service at the poolside cafe was a bit slow; sending a postcard using their business centre cost a highly-inflated US$1.10 per card. Overall though, we enjoyed the hotel and its beautiful landscaping thoroughly, though because of the few gripes we had, we will try other well-regarded places first before returning to this one.", "title": "Great with a few gripes", "helpfulness": 3, "user": "sazzbear", "date": "July 8, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17674615, "likes": {"liked": "— prettiness of hotel", "disliked": "— internet. expensive and kept dropping out"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "My partner and I spent a week at the Intercontinental.", "title": "Beautiful hotel.", "helpfulness": 1, "user": "Travellers286", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17276499, "likes": {"liked": "— Complete and utter relaxation, excellent service.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We booked a club level room, and were given a Club Duplex Suite - a fantastic room over two levels. The club level booking includes invaluable assistance through immigration at Ngurah Rai airport, transfers to/from the airport, and access to the club lounge at the hotel 24 hours a day.", "title": "Nice Hotel - Good Value", "helpfulness": 2, "user": "SidSingapore", "date": "June 19, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17053156}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The hotel itself is a large complex, however it is spacious and did not appear to be too crowded, even at more than 60% occupancy. The gardens are superb, the beach is beautiful, and club guests have exclusive use of the lovely club pool, located in a quiet part of the grounds.", "title": "great week at the Intercontinental", "helpfulness": 2, "user": "vilda", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17027059}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "The club lounge is a quiet place for breakfast, light meals at any time of the day, and complimentary drinks and canapes from 5pm to 8pm. The Inspirational Space, an offshoot of the club lounge, offers internet services, books and DVDs.......even iPods for entertainment at the club pool.", "title": "Nice staff and nice beach", "helpfulness": 3, "user": "tripaddictor", "date": "June 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 16920600}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I stayed 5 days in Bali and split that between 3 at the Grand Hyatt and 2 at the Intercontinental. I am going to try to compare and contrast between the two. I will put this review under both hotels.", "title": "Very very nice", "helpfulness": 8, "user": "Cartman72", "date": "June 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16775401, "likes": {"liked": "— Service, location, beach", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Grand Hyatt Bali. I stayed at the Grand Hyatt first and my initial reaction was \"WOW!\" The hotel, the room, the gardens, and the pool were just beautiful. The breakfast was ok, but the scenery was, again, beautiful. We were sitting right by the fish pond during breakfast, and I was able to feed the fish from our table (very fun!).", "title": "This is a great resort!", "helpfulness": 5, "user": "blschwar", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 16527246, "likes": {"liked": "— Beautiful Hotel Grounds!!", "disliked": "— The bed - way too soft!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "Intercontinental: Having stayed at the Grand Hyatt first, I was initially a little disappointed with the pool and the gardens. The Intercontinental is much smaller than the Grand Hyatt, and I don't think as pretty. However, by the end of my stay, I came to like the Intercontinental a bit more than I did the Grand Hyatt. The Intercontinental has little thoughtful touches that the Grand hyatt does not.", "title": "Pure heaven on earth", "helpfulness": 2, "user": "kaikai60", "date": "May 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16364042}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Rooms. I do not think you can go wrong with either hotels' rooms. I liked the rooms at the Grand Hyatt more, my travel companion liked the rooms at the Intercontinental more.", "title": "Very expensive", "helpfulness": 3, "user": "woddnq", "date": "May 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 16122339}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Pool and gardens: The Grand Hyatt property is much bigger. The Grand Hyatt has things like water slides, basketball nets in the pools, etc so I think is much more kid friendly. The pools also snake around the property and has a lot of areas where it is hidden from view. There is also a hot tub and a cold plunge right nest to the pool. The pools at the Intercontinental are all rectangular and the main pool has a very nice swim up bar. Although I did not think it was as nice as the Grand Hyatt pools initially, it grew on me the more I stayed there and by the time I left, I kinda liked the Intercontinental pools a little more than I did the Grand Hyatt pools.", "title": "Beauty of Bali", "helpfulness": 5, "user": "jimx22", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16090849, "likes": {"liked": "— Beautiful Property", "disliked": "— Not much option for Vegetarians"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008", "text": "Spent 10 days this July at the Intercontinental. The location, Jimbaran, is fantastic if you like having the wonderful pools of the hotel AS WELL as the beach. During the day, the beach is quiet, and you can walk from one end to the other, about half an hour, and only pass several people. In the evening, the beach comes alive with local kids playing impromptu soccer games and amazing small fish restaurants. The restaurants are more like huts with dozens of tables situated on the sandy beach. Go to the hut, pick a fish or lobster, and sit back down only to have a delicious BBQ meal delivered to you 10 minutes later.", "title": "Attention to every detail", "helpfulness": 3, "user": "TravelcatsSF", "date": "August 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18763242}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Enough about the beach. The sprawling grounds of the IC are immaculately maintained. People watering, picking up freshly fallen leaves, and raking sand.", "title": "Great property....", "helpfulness": 1, "user": "SSS2005", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18602737, "likes": {"liked": "— Staff!!!!!", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The service is extremely good and personalized. It will shock you at first in that staff will constantly ask how you are by name, did you like the chicken you had for dinner last night, or how was your day in Ubud? How do these folks even know whom I am???", "title": "Club perfect...", "helpfulness": 2, "user": "M626", "date": "August 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18519044, "likes": {"liked": "— Club and resort layout", "disliked": "— Room size adequate not big"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "We spent several days at the Oberoi on Lombok, and while it's very beautiful, the value at the IC is far better overall when you consider cost.", "title": "Paradise!", "helpfulness": 1, "user": "HollyStar", "date": "August 1, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 18489881, "likes": {"liked": "— Service", "disliked": "— price of breakfast"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Highly recommend the IC!", "title": "Very Relaxing", "helpfulness": 1, "user": "holidaysrus-xyz", "date": "July 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18451735, "likes": {"liked": "— The Pool areas", "disliked": "— Nothing"}}], "location": {"country": "Indonesia", "continent": "Asia", "city": "Jimbaran"}, "stars": 5, "variance": {"poor": 36, "average": 98, "very good": 401, "terrible": 30, "excellent": 1020}, "aka": "Intercontinental Bali Hotel Jimbaran", "slim_ranking": 0.258064516129, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Secluded within the boundaries of the exclusive neighbourhood of Jimbaran Bay on Bali's southern coastline, InterContinental Bali Resort embraces 14 hectares (35 acres) of tropical landscape. Blessed with an endless stretch of white sandy beachfront as its stunning backdrop, the resort integrates ornamental ponds, a winding lagoon and aesthetic stonework. Suspended between heaven and earth, this 418 luxury room resort was designed to blend modern convenience with elements of traditional Balinese architecture. Complementary Wifi ServiceWifi service is available throughout the Resort covering all room, suites , meeting facilities, public areas and even the beach. bandwidth coverage of 12MB is one of the largest on the island of Bali with over 150 wireless internet point spread across the propertyThere is an obvious sensitivity towards the surrounding environment, whilst respecting the rich culture of the island, its fine artistry and Hindu heritage. InterContinental Bali Resort has an alluring appeal with just enough versatility to cater to the needs of couples, families and business travelers alike."}