{"user_rating": 4.5, "review_count": 155, "name": "Inver Lodge Hotel", "reviews": [{"rating": 5.0, "title": "Wonderful food", "text": "We recently ate at the Inver Lodge for an evening meal, although we weren't staying there. The food was absolutely wonderful - fantastic menu to choose from, everything cooked to a very high quality. Lots of the ingredients are locally sourced. Service was warm, friendly, efficient and just exactly right. The view from the dining room is stunning - overlooking Loch Inver and out to the Western Isles. A wonderful location, excellent food and fantastic service. Can't praise the Inver Lodge enough.", "user": "Catriona M", "date": "June 17, 2012", "id": 132140062}, {"rating": 5.0, "title": "Very high quality Highland hotel", "text": "I obtained a late booking for a luxury night on a Highland road trip. Very high quality accommodation with excellent views across the bay. The staff were extremely attentive and very efficient. The bar has a good collection of malt whiskies. I was travelling solo so did not have dinner in the hotel but very much enjoyed a breakfast Arnold Bennett omelette. Definitely somewhere I want to return to with my wife in the future.", "user": "JLAshVale", "date": "June 11, 2012", "id": 131778082}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Really enjoyed our stay in this lovely hotel in such a beautiful location which even provided sunshine every day of our visit! The staff are very friendly and helpful from the reception, to the housekeeping staff, to the dining room staff.", "title": "Lovely location, fabulous food, superb staff, restful rooms.", "user": "seadragonUk", "date": "June 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131751841}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "The bedroom was spacious and well equipped with a lovely view down to the harbour and a very comfortable bed which would have been hard to leave in the morning if it wasn't for the thought of the delicious breakfasts which awaited downstairs.", "title": "April Special", "user": "Diabaig", "date": "June 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131236991}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The food was definitely a highpoint. As well as the amazing breakfasts we had three evening meals during our stay and thoroughly enjoyed each one. A special mention for the 'fish of the day' when it was sole with an almond butter and 'crushed' potatoes which is now in my top three meals of all time!", "title": "Thoroughly Recommend a Visit", "helpfulness": 1, "user": "Yvonne I", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131207118}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This was such a lovely place to spend the weekend and in most ways exceeded our expectations. The lobby and rooms are cozy. We had a large double overlooking the harbor (and I think all rooms do overlook the harbor), and it is a fantastic view indeed. The town of Lochinver really is very special. It is not totally given over to tourists, but is a working harbor as well, with ships going to and from Europe (although we did not see any on the weekend). There is also a great tourist information office with an interesting museum detailing history of the area. A couple of nice restaurants in town and a wonderful and useful news agent complete the scene in town.", "title": "Lovely setting", "helpfulness": 1, "user": "kingsroadgal", "date": "August 7, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136516129}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The hotel makes visiting Lochinver a great experience. Our rooms had totally fresh and new bathrooms, although our shower was a little on the small side. In addition, I have never stayed in a place with hotter water. Hot water is not normally a bad thing, but this water was so hot that you could actually scald yourself. When you combine this with a small shower, where the temperature knob can be knocked easily, there is potential for disaster. Be warned and ready to jump out of the way.", "title": "A warm welcome awaits", "user": "KentUKSunlover", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136414718}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Bed linens were great and lying in bed and looking at the great view of Lochinver was pleasant! One complaint I have was that the internet service was patchy, although the hotel says it has wireless. Only some of our devices received the \"guest\" service, and even then, only some would connect. I've never really had this issue anywhere else. When we called down to inquire about the problem, we were told that the problem must be in our devices (which were new and newish Apple computers, Iphones, and Ipads) or in our faulty technical skills. I did find after this initial lack of helpfulness that the staff did try to reset the system, although to no avail. It was not until the next day that the internet seemed to be working properly, although we never could connect my husband's phone. I do think the staff could use a bit of a review on how to deal with guest concerns, and possibly they could do with a bit of review on how to repair their wireless, as this is an essential item in a top-rate hotel.", "title": "Old Fashioned", "helpfulness": 1, "user": "herefirst", "date": "August 5, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0}, "id": 136333585}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "Our first night was also marred a bit since the heat seemed to go off at some point. Both the in-room heater and the bathroom became chilly. Although this was July, it was quite cold. On the second night, the heat stayed on, which was appreciated. I was surprised to not have heat on the first night in a hotel of this type.", "title": "A Great Place to Stay", "user": "AlwaysOnTheAirplane", "date": "July 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135705758}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Another thing I did not like about the hotel was the seating policy in the restaurant. Although we were paying for two rooms (including one of the largest rooms), we were seated right next to the kitchen at both breakfast services. The management sets up seating for you, and I believe that if you do not eat dinner at the restaurant, you are allocated lesser seating, even if you are paying for two rooms! On the second day we did not feel like sitting by the swinging kitchen door again, and we were moved, but we were still far from the window. In my opinion, this seating policy should be reconsidered. The restaurant was all in all very nice, but we had eaten quite enough on this trip, and the dinner was really more than we needed at this point. And again, as we were paying for two rooms, I don't think we should have been allocated the worst table in the restaurant.", "title": "Absolutely wonderful", "user": "Diana891", "date": "July 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135448875}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This hotel is exceptional in every way - we were very sorry we could not stay longer than the one night we had booked. When you pull into the car park a member of staff walks out to greet you which doesn't happen very often these days. All the staff are so courteous, helpful and hospitable, and the Manager, Nick Gorton is a charming gentleman with a wide knowledge of the area and beyond. Our large room overlooked the busy harbour, was beautifully appointed and we were thrilled to look out at dusk and see wild deer having their supper of grass just a few feet below. And last but by no means least, Chez Roux deserves every accolade available - both dinner and breakfast were a culinary delight - scrumptious! We particularly enjoyed our first Omelette Arnold Bennet. If you are visiting the dramatic Highlands of Scotland do try and spend a night at Inver Lodge.", "title": "Absolutely superb", "helpfulness": 1, "user": "Herdwicks", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131008046}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We have just returned from a wonderful stay in this delightful part of North WEst Scotland. The hotel is just fantastic and the staff make it more so. They just can't do enough for you. The hotel is comfortable with incredible views of the amazing scenery and harbour of Lochinver. They run a very fair system no matter the room you have as they try to give everyone a seat at the front of the dining room for the views. Loved the whole experience and will return this year. I give it 5 plus stars", "title": "Best hotel in the North", "helpfulness": 2, "user": "Maggy S", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130846704}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Lovely hotel with stunning views over the bay. Dinner was superb and staff friendly and attentaive. Will be back", "title": "Top class hotel", "user": "DAVID M", "date": "May 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130296371}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Stayed for 1 night in May, and booked in for a touch of luxury following a day of hill walking and mountain biking to Sandwood Bay. It's a relatively small, country house style of hotel, with really exceptional levels of hospitality and welcome, and great accommodation and service. We particularly liked the luxury, modern, clean lines bathroom, great after a long day on the hills and on the bikes. The rooms are a little old fashioned, but spacious and comfortable, with excellent views of the harbour and out to Lewis in the distance. Excellent quality food and service, and a great hotel if you enjoy a touch of luxury to go along with some local sporting or outdoor activities.", "title": "Fabulous views and bathroom", "user": "weenieScotland", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130157660}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "As mentioned in other reviews, the functional outside of the hotel dowes not do justice to the experience of staying here. This hotel is exceptional in the quality of personal attention to guests shown by all its staff. The staff cannot do enough to help and are really interested in their guests. The room we had (Canisp) was absolutely perfect,.with beautiful views to Suilven and Canisp and also from the other window, to the harbour and sea; warm attractively furnished and spacious also. We knew the food would be exceptionally good and we were not disappointed! The breakfasts were the best I'd ever seen. The policy of ensuring everyone had if possible an opportunity to enjoy the view to the sun setting over the islands was wise and tthoughtful. We would certainly want to go again and recommend it strongly as the perfect hotel from which to explore this dramatically beautiful part of Scotland.", "title": "Excellent hotel in every way", "user": "LGaberdeen", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130121009}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed for three nights and thoroughly enjoyed it. Reception was excellent and the entrance with log fire very welcoming. Views from the bedroom and dining room are gorgeous. Breakfasts and dinners are lovely, well presented and served by wonderful staff. Room was immaculate. It is expensive but well worth it. It is however \"urban chic\" in a very rural setting so this might not appeal to everyone.", "title": "Excellent Hotel", "user": "Rogerh2012", "date": "July 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134855041}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Stayed for 2 nights for a special celebration in July and loved it. How refreshing to receive a genuine scottish experience in very comfortable surroundings.", "title": "Wonderful Experience", "user": "Lancashire67", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134272230}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "The food was a real treat and exquisitely presented each evening.", "title": "An exquisite dinner with perfect service!", "helpfulness": 1, "user": "iainandanna", "date": "July 12, 2012", "detail_rating": {"cleanliness": 5.0, "location": 5.0}, "id": 134229287}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We are honeymooning in the region and were able to eat here this evening. What a treat! The food was delicious, the views lovely and the service perfect and polite. We would certainly consider returning when next in the region, this was a major highlight of our trip. We especially enjoyed the pike mousse with brown prawns, and the steak was immense! The lemon tart was the best I've ever had!", "title": "Great dog friendly hotel", "helpfulness": 1, "user": "DylanKia", "date": "July 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 134226359}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Having previously stayed at this hotel, we were a bit disappointed to find our room was not as nice as the previous one, but we think we may have been luckily upgraded last time.", "title": "Great hotel, excellent food and good facilities for disabled", "user": "tickerbrum", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132655187}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 2, "average": 9, "very good": 24, "terrible": 0, "excellent": 120}, "aka": "Inver Hotel Lochinver", "slim_ranking": 0.666666666667, "description": "21 Sea facing bedrooms, 2 also with mountain views. Spacious public areas and our Chez Roux restaurant has panoramic views over Lochinver bay and on towards the Isle of Harris."}