{"user_rating": 4.5, "review_count": 105, "name": "IQs Charming House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This was our first visit to Venice and wanted to choose a hotel that helped create happy memories of our special break - IQs Charming House certainly did that. Anna met us on arrival and was the perfect host, providing us with very useful local information and restaurant suggestions, all with a big, welcoming smile!", "title": "Perfect - home from home!", "helpfulness": 2, "user": "larab123", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130320646}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The room was perfect, in a really convenient location with a spacious living area, ample-sized bedroom and a roomy bathroom with possibly the best shower in the world! We travelled with our 10 year old son, who was delighted with his king size sofa bed!!", "title": "Best place & warmest hospitality", "user": "NoiBangkok", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129151843}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We overlooked the canal and thoroughly enjoyed sitting with the windows open listening to the gondolas glide past, quite often with music or a singer. Just beautiful.", "title": "Our stay at IQs made our trip memorable!", "user": "AprilKeenan", "date": "March 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125757181}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We were apprehensive about having breakfast prepared in our room, but we needn't have worried. Fresh bread and pastries, with cheeses, preserves, cereals and fresh fruit was ideal, delivered each morning by Anna. Also, not to mention the Nespresso coffee - we love our Nespresso machine at home so this just topped off the facilites for us.", "title": "OUR STAY IN YOUR HOTEL WAS A GREAT EXPERIENCE!!", "user": "IsraelRachel", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125332701}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "We have already passed on details of this hotel to two friends and will continue to do so. We had a truly wonderful time in Venice, helped by our fabulous stay at IQs Charming House and we would definitely stay here again, for sure.", "title": "Amazing service!", "helpfulness": 1, "user": "priya s", "date": "January 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 123659097}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "Arthur Miller said that, \" Maybe all one can do is to hope to end up with the right regrets\" . My family have just spent 4 days in the city staying at Charming House IQs, a small hotel with 4 rooms/suites. The stay was excellent. Once we found the hotel, discreetly non-signposted and over it's own Venetian bridge, one is met by reception staff ( Nadia and Anna) of great charm and helpfulness. Good restaurants booked, advice provided on places to see, routes to get there , but left to one's own devices if not required. The water taxi delivered us to the hotel's own private jetty- the coolest entry into a city ever! The location is central but hidden away. In short one couldn't wish for better, and whilst there is no room service, the essential Nespresso coffee maker helps with the espresso boosts on needs when one is flagging. The hotel ensured that the visit to Venice did not register as one of life's regrets.", "title": "The right regrets- Charming House IQs- Venice", "helpfulness": 2, "user": "simon088", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119676926}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "If you are looking for the perfect ecclectic getaway, then I Q is the place for you. While perfectly situated in the heart of Venice, it's nested in a private remote area for you to unwind and get away from the loads of tourists. The suite is spec'd to perfection and the staff are tremendously accommodating. The suite truly feels like home and I wish I could have stayed longer.", "title": "A must stay in Venice", "user": "hotelguru2011", "date": "October 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119480965}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Room was vey beautiful with a modern deisgn and cosy. We bought some food from nearby supermarket and cook dinner on one of the night.", "title": "fanstastic property!", "user": "sygg", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 119143615}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Staff provided excellent service during our stay and the breakfast in the room was really enjoyable.", "title": "Charmed by Charming House", "helpfulness": 1, "user": "NanajanPerth", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119131155}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Very close to san marco and rialto ~ 10mins walk.", "title": "What a fabulous place", "user": "T N", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117116296}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "For us, the highlight of staying at the Charming House IQ was the concierge, Anna. Right when we walked in the door, she greeted us when genuine hospitality and helpfulness. She made herself available each morning to answer any questions that we might have had, providing information and guiding us in our plans to enjoy Venice. We are very thankful and appreciative of Anna's assistance during our time in Venice. It was as of this hotel came with it's own tour guide.", "title": "Amazing concierge, and comfortable room", "user": "bbjj0827", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 142602002}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The hotel itself was just shy of one star in perfection. The location was ideal - far enough away from St. Mark's Square to avoid the crowds but an easy walk to most locations. Finding the hotel wan interesting adventure as we decided to take the public transportation boat from the airport to the closet stop to the hotel (rather than spending 130 EURO on a boat taxi). Walking through Venice for the first time, finding the hotel - was interesting but yet fun. One caveat is that the hotel does not have a sign ....... we were standing in front of it wondering where it was .... only later realizing that we were standing in front it. It does have it's own little private bridge (adorable - see picture) with an awesomely large wooden door.", "title": "Perfection in Venice", "user": "DanMcCormack", "date": "August 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136778600}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "I should add that if we decided to take a boat taxi, we would have taken it right into their lobby (check out picture).", "title": "Home away from Home!", "helpfulness": 1, "user": "Paula L", "date": "July 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135890266}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Our room was one of the smaller ones ...... but it still seemed quite large to us, given that rooms in US cities (i.e. New York) are much smaller. The bed was gigantic ..... but the mattress was a bit too hard for us. I did wish the bed was more comfortable - but nevertheless we slept well having walked and doing too much each day in Venice.", "title": "Hidden Gem in Venice", "user": "Mandi C", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132588585}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "The bathroom rocked - best shower ever! A two-person shower that felt like rain ..... I loved it!", "title": "A Charming Place", "helpfulness": 3, "user": "rafi7", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131348677}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We had a very pleasant stay in the Charming House iQs which is a beautiful design hotel ! The staff is charming. Venice is a lovelly place and it's perfect for 3 or 4 days. Perfect for a romantic getaway ! Thank you very much Chiara, we'll come back to see you ! We'll maybe try the other place of the hotel next time...", "title": "A very nice place", "user": "Jen R", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123096795}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "IQs Charming House was a beautiful introduction to Venice. From the moment we arrived we felt like a local. On arrival you have to press a button to let you into the House, which features two main security gates. At check-in you are handed actual door keys, as if you truly are a local. Our suite overlooked a canal where the main gondola's travel past, we left the window open to hear all the sounds. It was fascinating just watching the action along the canal.", "title": "A beautiful boutique introduction to Venice", "helpfulness": 3, "user": "MrMsOz", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121688533}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The suite was extremely spacious, exactly what we needed after our long journey. Large couches surround the lounge area, candles, decent magazines, iPod dock, excellent kitchenette, Nespresso bar and a dishwasher! You could easily stay here for a week. The bedroom was contemporary with a decent wardrobe. Our bathroom was a little too small for us and had minimal natural light, not too good for shaving and putting on make up.", "title": "Truly charming", "helpfulness": 1, "user": "Naomio28", "date": "November 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121117955}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "IQs Charming House reception area is minimalist, as per the photos on their site. Reception staff are there until late, and they are all very knowledgeable. We were given some amazing recommendations for activities and dinner.", "title": "out of category", "user": "Peter L", "date": "November 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 120848803}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Breakfast was excellent with lots to choose from - A great range of healthy and not-so-healthy items.", "title": "Great service", "user": "Paul Q", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 120457651}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "variance": {"poor": 2, "average": 3, "very good": 21, "terrible": 2, "excellent": 77}, "aka": "Iqs Charming House Hotel", "slim_ranking": 0.152230971129, "description": "The Qs are the latest addition to the Charming House family. It is a place where you will feel like at home, where you can offer yourself the luxury of unique suites, behind Piazza San Marco, with canal view on the famous Rio di Santa Maria Formosa, right where its waters take a turn before meeting the Gran Canal under the Bridge of Sighs. The interior is a Gothic courtyard with a well-curb. Contemporary design and art complete the wonderful location. Whether you are traveling for business or pure pleasure, the Charming House i Qs is the ideal place for you."}