{"user_rating": 4.5, "review_count": 888, "name": "Iron Horse Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We live in nearby Chicago. We drove to Milwaukee to attend a Brewers-Mets game. We stayed at the Iron Horse Hotel for 1 night. I understand why the reviews are overwhelmingly positive. It's a very cool hotel and they make a great sangria! :)", "title": "Great hotel", "user": "MrsTraveler", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 169503682}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My husband and I were blown away. The attention to details and serving up any guest's needs are just what these people do. From the time we checked in to the time we left we were bathed with great customer service. Breakfast was a delight. Eating in a sunroom of sorts with the natural light was great. Karen and Jason were on their game. We later that evening had cocktails and dinner in the restaurant and again everything was exceptional. He had remembered our names from breakfast and upon walking up to have dinner we were personally greeted and welcomed as we were \"A-List\" diners. Thanks for making this trip such an awesome experience and treating every guest this way shows just why your hotel is the best in Milwaukee and maybe in the country. We will be back very soon and will share our story with anyone who will listen", "title": "Amazing Experiance-Kudos to the Managment Team", "user": "Rose H", "date": "July 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 168958863}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "Great room, really cool decor. Great outdoor bar and lounge. Outstanding bed and linnens. I'll be back next time MKE calls. The room service is a smidge pricey. About a 10 minute walk or a $5 cab ride to town. the in room coffee maker offers single serve that was super weak. Next time I'll just bring my own coffee.", "title": "Hip, comfy, urban swank.", "user": "Paul G", "date": "July 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 168896828}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I fell in love with this place! staff is friendly! you get a complimentary drink when you check in. they are pet friendly which is a plus. the rooms are so clean and spacious! there is a bar and restaurant in the building. All the bath products are from h2o which is a great! The bath room is modern and clean. It is pricey but if you can afford to stay there you definitely should!", "title": "AMAZING!!", "user": "Jenny O", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168788349}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My husband and I own a Harley motorcycle and had planned to spend part of our vacation going to the Harley Museum in Milwaukee. When I found out the Iron Horse Hotel catered to motorcycle riders, I checked into the price of a room. We found it pricey compared to other hotels, but decided to stay since it was so close to the museum. This hotel is so unique and beautiful! It is upscale, yet cozy. Even though we walked in sweaty from our ride and had tossed hair, we felt welcome. We were able to park the motorcycle right in front of the hotel, which was well lit at night. Our room was large with a king size bed. One wall had a large mural painted and another was exposed brick from the old building. Our only complaint was the shower. There was a rain-shower head and a handheld. I am not a fan of the rain shower and we both felt the handheld needed to be up higher on the wall. We only ate one meal there, which was in their bar. Our waiter was attentive and the food was great. Great place to stay!", "title": "Great stay", "helpfulness": 1, "user": "Paula F", "date": "July 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168786414}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Enjoyed the personal touch/his & her quality bathrobes. The interior", "title": "Director/Guest Services- James Valona & Mona make your stay stress free, Falcon/guest", "user": "Birddog2", "date": "July 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167555832}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "design of the Hotel has so much character! Took pictures to share.", "title": "Fantastic Hotel", "user": "Yvonne R", "date": "July 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167523631}, {"rating": 3.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "The food & beverages top notch!", "title": "I want you to be 5 Stars", "helpfulness": 3, "user": "Patty V", "date": "July 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166920297}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "James & Mona/Guest Services", "title": "A MUST if ever in Milwaukee", "helpfulness": 1, "user": "trapogo", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166779754}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "great & attentive for your Hotel concerns. Irreplaceable!", "title": "A 1st class visit to a 1st class Hotel", "user": "Kevin B", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166681484}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This hotel is great.Great service by everyone. Every employee had a smile on their face and an attitude asking what else can we do for you. The room was great. we had a top floor room with high ceilings open venting anf a beautiful bath.If you are looking for a hoted near th HD museum this is the one. Although it caters to motorcyclists anyone would feel welcome. the hotel features a restaurant, bar and patio. we ate at the bar and the food was good.", "title": "Great Milwaukee Hotel", "helpfulness": 1, "user": "Marvin W", "date": "September 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 140514791}, {"rating": 1.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Marvin W", "title": "How clean can it be?", "helpfulness": 3, "user": "profofphil", "date": "September 16, 2012", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 140443563}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Stayed one night at the Iron Horse Hotel in Milwaukee. There are plenty of things I could say about the place—some pro and some con—but the two I will mention strike me as very important. Two things seem paramount: at a hotel one should be able to sleep when tired, and the hotel should be clean.", "title": "Unbeliveably one of the best hotels around!", "user": "Mike B", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 140160854}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The walls in the hotel, at least in certain places, must be fairly slim. At 1:30 in the morning I began to hear talking an adjacent room. I waited a while for it to stop, but when it didn’t I put on the earplugs that we found in the room when we arrived. The flyer behind them indicated that they were in case we were bothered by at train that runs nearby. We actually heard the train earlier in the evening, and it wasn’t a problem. The real problem, and I now suspect (but don't really know) that the earplugs were provided for this reason, was that one could hear ordinary conversation, to the point where it was clear what was being said, in the next room. We were on the sixth floor, in an otherwise quite section of the hotel. Walls shouldn’t that thin. The conversation went on until 3:30, and sleep was interrupted by it intermittently. They occupants seemed to be talking at a normal volume.", "title": "Great Spot for A Special Occasion", "user": "john P", "date": "September 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139993373}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The second problem is rather unpleasant to write about, but here goes. The Iron Horse is a “pet friendly hotel.” When we left our room to check out, we rounded a counter. As I walked I felt my foot slip. Looking back, I saw that a dog had defecated in the hallway, and we discerned that my wife and I both walked in, and latter discovered that the wheels of our luggage had rolled though, the mess. (She was several feet beyond me when I made the initial discovery. We continued down the hall, to the elevator, and from the elevator to the front desk—not fully comprehending the extent of the mess.) We then examined ourselves and our luggage, and reported exactly what happened and asked that our shoes and luggage be cleaned off. There was excrement on the 6th floor hallway, the elevator, the walk from the elevator to the desk and the mat in front of the desk—as well as our shoes and luggage wheels. Housekeeping was called in. The man from housekeeping then did a terrible job of cleaning our shoes and luggage. (We ended up cleaning our shoes.) In addition, when he “cleaned” the luggage he laid it on the soiled mat, where it acquired a little more filth. I asked him to be sure the luggage was clean. He said he did. (I learned when we went outside waiting for our car that he’d done a very pour job.) We pointed out the mess on the mat, and the woman behind the desk, got some spray to clean it up. We apologized for the mess. She sort of laughed, shook her head, rolled her eyes, and said. “It’s certainly not the first time.” She told the housekeeping rep about the mess on the 6th floor. How clean it got after that we do not know. (Did I mention there was some on my pants. It was not the most solid effort a dog can make.)", "title": "Amazing!", "helpfulness": 1, "user": "Amy B", "date": "September 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139925488}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband and I chose to stay three nights at the Iron Horse on trip to Milwaukee for a friends' wedding. Neither of us had ever been to Milwaukee, nor will we likely have a reason to return so we figured we'd choose a place that had some history and character to it. The Iron Horse certainly has both and is a beautiful and very classy hotel. The rooms are quite nice, although I was disappointed to find the quality/comfort of the mattress only average compared to other hotels - in other words, too hard. The hotel was booked for the entire weekend while we were there - a wedding and a class reunion both going on. We were given a 2nd floor room and quickly learned that it is NEVER quiet on this floor. We could hear loud music from either of the bars until at least 2am and it started again by around 8am from the lobby. The lobby is open to the 2nd floor, so all of the noise goes right upstairs. We did not ask for a change of rooms since we knew the hotel was booked and fortunately since we were on vacation we just stayed up until we were tired enough to sleep through the noise. If you are here for business or are a light sleeper, be sure to ask for a room on the higher floors.", "title": "Ask for upper floors if you like to sleep", "helpfulness": 3, "user": "Brandy H", "date": "September 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 139739992}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Another tip: this is not a hotel for kids. There is explicit sexuality in the theme of the hotel. Be sure to ask before booking - I'm sure it was coincidental, but there happened to be an art show going on in the lobby the weekend we stayed of erotica photography. The first thing you saw when walking in the door was a very large photo of a topless woman and the lobby was full of more of it. On the other hand, as other reviewers have mentioned it is a great place for couples!", "title": "special occasion", "helpfulness": 1, "user": "Denise K", "date": "September 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139670880}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "While the hotel is beautifully restored and quite classy, our room earned no more than three stars. I can't speak for the rest of it.", "title": "THE place to stay in Milwaukee", "helpfulness": 1, "user": "dam6296", "date": "September 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 139647949}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled on business", "text": "My husband and I stayed one night for a milestone anniversary. We arrived on our Harley, had excellent parking. The hotel decor was really unique and fun to walk around and take pictures. The room was very spacious, and comfortable, very nice bed. The staff was friendly. We had a 6th floor room with an excellent view.", "title": "cool hotel, built for couples", "user": "Tom M", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139606219}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "I was disappointed by the fact that I signed up on line, for our special interests or .... not sure how to word this. I was asked if this is a special occasion I said yes our 30th anniversary and also asked what snacks (sodas and chips list to choose from) would we like in our room. I was expecting a little something special, maybe a free desert or something, and only seen the snacks in the basket that we had to pay extra for, I assumed they would be complementary.", "title": "The place to stay if you are a biker visiting Harley heaven", "user": "Trams1957", "date": "September 6, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 139579143}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "I travel extensively for business and pleasure and this was truly one of my most favorite experiences. The interior design was fab , the people really nice and accommodating , the restaurant Delish. I will definitely be back. I will find a reason to return to Milwaukee just to go here. Trust me. You don't want to stay anywhere else !", "title": "Amazing!", "user": "ckellycara", "date": "August 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172435475}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Our first stay and not our last. Don't let the out of the way location turn you off. It is within walking distance of great restaurants and the river walk, and an easy walk to the lake front.", "title": "Love this 'biker' friendly hotel.", "user": "barryandjoan", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 172130363}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Loved the funky rooms, very comfortable beds and lots of great pillows.", "title": "Too Costly For Experience", "user": "Vueve D", "date": "August 12, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 171956526}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Hooks for jackets and benches for helmets. Great rain shower! And a first for a hotel, dimmer switches everywhere. The valet staff went out of their way to accommodate our big truck and trailer. Every staff member we encountered provided exception friendly service.", "title": "Nice Stay in Milwaukee", "helpfulness": 1, "user": "jracleveland", "date": "August 12, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171870815}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "They even provide ear plugs because there are train track nearby, but we never heard the train but the inroom refrigerator did produce a loud hum so the ear plugs came in handy.", "title": "THE place in Milwaukee to stay", "user": "CalvinMills21", "date": "August 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171814381}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I am a lifestyle photographer and I booked The Iron Horse as a location and stayed there for two nights this past January. The staff was amazing! We had a little gear we had to haul around while being mindful of the guests and it couldn't have been easier. Everyone was so accommodating.", "title": "Fantastic Boutique Hotel with an Edge", "user": "Heidi G", "date": "July 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166440476}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The public spaces are masculine and handsome and made for an excellent backdrop for shoes and models. The finishing touches scream modern yet vintage. I stayed in a Premium Loft on the top floor and it was spacious yet cozy! How is this possible?! The linens were fantastic and the view of MKE was incredible.", "title": "So glad we ended up here!", "user": "wi_bay_girl", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166222611}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "It rained hard both nights and it was just soothing and wonderful to hear the rain pounding on the roof. The rooms have great showers and fabulous large scale photography of real MKE women.", "title": "Love The Iron Horse", "user": "amyashby86", "date": "July 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166222361}, {"rating": 5.0, "title": "Wonderful!", "text": "The breakfasts at Smyth were delicious and memorable. I had the Tofu scramble twice because it was THAT good! This is a classy and fun place to stay in Milwaukee and one of your only choices for a boutique experience. Bonus: They welcome pets with open arms.", "helpfulness": 1, "user": "MrsM-7-4", "date": "July 3, 2013", "id": 166194293}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "Booked this online at one of those sites that doesnt say which hotel you are booking - we were SO excited to get into the Iron Horse. They must have had a last minute cancellation because its always booked! We loved our room - comfortable bed, great shower, funky but appropriate decor. Great location too! We walked to Summerfest and felt very safe. The next day we walked to the public market and all through the third ward shopping district! free wi-fi worked great and ALL of the staff were super friendly. Hope to be able to stay at this hotel again!", "title": "The Little Engine The Could (because there is nothing better in MKE)", "helpfulness": 2, "user": "JoshuaSims", "date": "July 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 165983336}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "A 1907 warehouse converted into a superb hotel full of character. The staff and service are next to none. The ambience is kind of \"industrial-chic\". Great attention to detail has been paid in all areas of the hotel, and many of the original warehouse features have been conserved to enhance its industrial atmosphere.Spacious, well equipped, comforable bedrooms. Business travellers mix with Harley Davidson bikers (the Harley Davidson Museum is almost next door), and the bar is a lively meeting place in the evening. I stayed for 4 nights, and could not have been more satisfied. I am definitely coming back again!", "title": "Quite simply Superb!", "user": "BraddyBarcelona", "date": "September 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 176868472}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I stayed at the Iron Horse recently and was overwhelmed with the incredible service and attention to detail. The staff was friendly, professional and very attentive - this wasn't easy because I know I was not the most important person in the hotel at the time - but I certainly never felt that way. The rooms were impeccably clean and refreshed. Add to that the unique design and architecture and this experience was over the top. The front desk was always happy to help however they could. It was a fantastic experience that left me wanting more and anticipating my next trip. All staff are completely in-tune through the head sets, if I called a cab, it was clear outside who I was. The restaurant was fabulous with a wonderful selection of food and drink and of course service. Great job - I will definitely be back and tell everyone I know!", "title": "Iron Clad Hospitality!!", "helpfulness": 1, "user": "AvidTraveller444", "date": "September 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 176598646}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I recently had an issue with a charge to my credit card. My wife and I contacted the Iron Horse to discuss the issue on three separate occasions. The Iron Horse did not provide even the courtesy of a return phone call to discuss the issue.", "title": "Don't be Misled by this Hotel -- It is not Guest Oriented", "helpfulness": 1, "user": "joepaulNAshville_TN", "date": "September 6, 2013", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "sleep": 5.0, "location": 1.0, "service": 1.0}, "id": 176037475}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "In April 2013, I booked a room on-line for an August 2013 visit. I learned in late July 2013 when I called to re-confirm that I made a mistake and the reservation was erroneously made for a room on the day the booking occurred. My credit card was charged $250. I contacted the hotel to discuss the situation. I was not anticipating or necessarily looking for a full refund. But when I made contact I was expecting to find a polite and understanding hotel employee willing to discuss an equitable way to apply the amount charged to my credit card.", "title": "Hog Wild for Iron Horse", "user": "FastGirl39", "date": "September 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175982924}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The first person I spoke with was an employee named Mark. He was extremely rude and arrogant. Mark had no interest in understanding the situation. He quickly let me know he thought I was an idiot and basically told me I should have been more careful when booking the room in April. Of course, he was absolutely correct but my carelessness was no excuse for his rudeness or his apparent need to rub my mistake in my face", "title": "Like no other hotel", "user": "Sheryl P", "date": "September 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 175868170}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "who would have thought you'd find such a cool joint in Milwaukee? Will concur with prior folks who stayed here, can't fathom staying at another property when we return to a vastly underrated city. Great mix of people, awesome customer service, all at reasonable prices. Dog-friendly property within walking distance of the Harley-Davidson Museum (never rode a chopper in my life but still a lot of fun). Property is 10 minute drive from Miller Park with no traffic. Choose no other accomodation.", "title": "Believe the hype", "user": "scoremedia", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141883591}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I decided to stop at the Iron Horse Hotel for dinner two weeks ago. We had a drink inside Branded, which was a great atmosphere. Then we walked into Smyth (which is the fine dining restaurant inside the hotel), and had drinks and dinner at the bar. Our bartender inside Smyth, Dallas, told us that she was a 'newer' employee, but she was very helpful and provided plenty of entertainment throughout our dinner. Unfortunately, the outside patio was closed but from the looks of it, it was beautifully decorated. Ultimately, I would LOVE to stay a long weekend there. Ambiance, staff, food, and overall presentation was great. We will definitely be back.", "title": "Iron Horse Hotel was beautiful, will definitely be back.", "helpfulness": 2, "user": "Michelle M", "date": "September 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0}, "id": 141606813}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The Iron Horse Hotel is a very unique place offering the best of service. Every member of their staff knows the meaning of 'above and beyond'. The decor is absolutely beautiful. We were in Milwaukee for a ball game and some shopping. The Historic Third Ward is a short walk from the hotel and a great place to spend the afternoon. Hope to be back someday.", "title": "Awesome stay!", "helpfulness": 2, "user": "teboSudbury", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141311382}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I chose this hotel to stay for our 2yr anniversary. It was once a manufacturing plant so we were intrigued from the beginning. To begin with, the hotel is beautiful. If has a darker look to if and there is hard wood everywhere. The ENTIRE staff is amazing and treat you as if you are royalty. We stayed in your basic room and were overwhelmed by how gorgeous it was. It was spacious and the wall was painted with a lovely mural! Everything was super clean and accommodating. We stopped at the bar in the lobby where the bar tenders were fantastic and knew how to make a drink! We got a pizza for lunch there and it was delish! We purchased the stay and brunch package so the next morning we grabbing brunch at Smyth. The food was yet again amazing and not very expensive. The waiters we very attentive and you almost never had to flag someone down for anything. The hotel is also dog friendly! If you have the means and time I HIGHLY recommend this hotel. I know my husband and I will for sure be returning soon!", "title": "Fell In LOVE!", "helpfulness": 4, "user": "MattyVan", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141170117}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "My husband and I stayed at the Iron Horse for our anniversary in July. We chose the hotel for the convenience to the Harley Davidson Museum and Miller Stadium. Turns out the hotel is destination enough! Friendly staff at every turn, the bar staff beyond compare and the food excellent.", "title": "Fantastic choice!", "helpfulness": 1, "user": "HappyJerseyTravelers", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141168857}, {"rating": 5.0, "title": "Cozy and awesome", "text": "The hotel is cozy and tucked away from other hotels. We arrived on a Sunday so we received a mid-week special rate. Also, because it was a Sunday, we were able to park on the street. The Valet workers gave us the phone number for the Milwaukee police to call and let them know we'd be parking on the street that night. We ate dinner out on the patio and it was lovely and the food was great. Our waiter was funny and took good care of us. We stopped in the bar for a drink before heading to our room. The bar was also nice and the bartender was very friendly. The room was very classy and the sheets were wonderfully soft. I would highly recommend this hotel for a great place to stay in Milwaukee.", "user": "Jennifer54601", "date": "July 18, 2013", "id": 168039633}, {"rating": 5.0, "title": "Loved this casual upscale hotel!", "text": "Prior to the Eagles announcing their Chicago dates, the closest venue was at Summerfest in Milwaukee. I had been planning a large party for a big birthday for my husband 6 days after the Milwaukee show and thought it would be fun to surprise him with these concert tix and sneak in a short get away just prior to the party. I was looking for a very nice hotel, close to Summerfest. When I saw the Iron Horse, I knew it was perfect!", "user": "MarciaB10", "date": "July 16, 2013", "id": 167775277}, {"rating": 5.0, "title": "Wouldn't stay anywhere else...with or without the Harley", "text": "We were not disappointed. Such a cool hotel! The loft rooms are exactly as shown in the online pictures. I loved the casual feel of this upscale hotel! We arrived just a little after 3 on a Sunday and our room was ready. I had booked a king loft, at checkin they said we were getting a upgraded room . I think this upgrade was to a slightly larger room on a higher floor. It was spacious and very clean. The bathroom was also very large. Loved the high ceilings and the bed was very comfortable.", "user": "Bramin", "date": "July 15, 2013", "id": 167720623}, {"rating": 5.0, "title": "Get Your Motor Runnin' To This Place!", "text": "We had a late lunch at the loft shortly after arriving. Great food with live music.", "user": "durangotravelers", "date": "July 15, 2013", "id": 167717183}, {"rating": 5.0, "title": "FABULOUS...Don't bother staying anywhere else!", "text": "Took a cab to Summerfest, but afterwards hard to find one and it was an easy walk back.-just about a mile.", "user": "LRobish", "date": "July 15, 2013", "id": 167714199}, {"rating": 5.0, "stay_parameters": "Stayed September 2013", "text": "Got here on a Monday night for a little break from work and a concert and the second I walked in, I knew it was different. In a great way.", "title": "One of the most unique and alluring hotels I've been in!", "user": "Tootsie1841", "date": "September 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 175720033}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "The restaurant was serving food until 11 pm so we went down and had a fantastic dinner, great menu.", "title": "Favorite place!", "user": "winefreak", "date": "September 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 175690439}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "Our room had pillow-top mattresses and tons of pillows on each. Large tv, long counter top, mini-fridge, wine, tasty snacks and an incredible shower. I slept like a rock each night. There is a large picture of a woman on the main wall, with an artists note on the counter top.", "title": "Motorcycle trip", "user": "JessPA", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 175584795}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "All of the staff was very friendly and quite helpful. They opened the gift shop for us and sent up a new remote for the television after it was reset.", "title": "Charm, character and artwork", "user": "amry", "date": "September 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 175561482}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The decor is incredible here!! So many things to look at and many comfortable couches in the lobby to perch on while enjoying a drink. I highly recommend this place, you won't be disappointed in the slightest!!", "title": "wow", "user": "422juliem422", "date": "September 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175362847}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I stayed at The Iron Horse Hotel with my wife and two teenage girls during our first visit to Milwaukee. We were taking our son to the University of Wisconsin in Whitewater from Boston and needed to stay in Milwaukee for one night and we were all very pleased with the service experienced at the hotel.", "title": "Great stay in Milwaukee", "user": "R F", "date": "September 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175146701}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "The hotel has a great design and the room was very spacious, you feel like home. The service that the staff provides you is really great and we were amazed by the details; not many places offer you a cold drink in a hot day during your check in process.", "title": "Amazing Experience", "user": "Clinton J", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174330979}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The food, which we appreciate, was outstanding and you can tell that the produce are fresh. My wife and I had dinner in one of the restaurants that is outside and the ambience was terrific, live music with a great band. We ordered pork for dinner and it was absolutely great, tender and juicy. The staff was also amazing.", "title": "Awful", "helpfulness": 3, "user": "Amanda D", "date": "August 26, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 174145777}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We had breakfast in the other restaurant that is inside, believe is named Smyth, and the menu was great. All of us enjoyed the food.", "title": "Changed my mind", "helpfulness": 1, "user": "Michele K", "date": "August 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 172993021}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Our girls ordered room service and they were also very pleased. My eldest one had Filet Mignon and she complemented the quality.", "title": "Simply amazing!", "user": "tmvpd", "date": "August 17, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 172603510}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "My husband and I get a kick out of trying out different highly rated boutique hotels in different cities as a fun weekend get away, so when a friend suggested Milwaukee and the Iron Horse and we checked the reviews, Conde Nast, etc, we quickly made reservations. We weren't disappointed---AMAZING hotel. Cool, friendly, comfortable, hip---the list kept growing as we settled in and continued to grow as we stayed. In fact, the city has a lot to offer but we hated leaving the property since we were so happy right there. We found ourselves happily sitting in the lobby/cozy-hip-living-room to people watch. Our room (603) was great as it overlooked the city skyline, and we could hear the rain pitterpat on the roof during a rain storm. The IH even supplied ear plugs lest you were bothered by the very real railroad screaming by at night---we weren't because strangely it added to the ambiance. LOVED the bar too. Restaurant (Smyth) was okay---a little unnecessarily stuffy but the food was good. I will add that my husband is a guys-guy so the masculine feel of this place made him feel right at home---there have been places we have stayed where he seemed afraid to touch anything lest it break but this place with its leather covered headboards, solid wood benches and glistening gears on light fixtures made him feel right at home. LOVED IT.", "title": "Just about the best boutique hotel in the US---or maybe it IS the best?", "helpfulness": 1, "user": "Ann L", "date": "September 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141135727}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "If you are a motorcycle buff , this is the place to be. The staff is great and it is the place to be. The Harley museum is a short walk or ride from the hotel. The yard is always happening and the parking lot has plenty of cool rides. See you 2013 at the 110th anniversary party.", "title": "Motorcycle Heaven", "helpfulness": 1, "user": "Robert M", "date": "September 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 141080107}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "First off, I didn't get to stay overnight here. The Iron Horse was the destination of a recent business convention and they booked up so fast, I had to stay elsewhere, which was not only a disappointment, but a huge inconvenience for me. So, I was not a happy camper when I walked in. The problem was, they fell over themselves being so nice to me that I tried to stay mad, but couldn't. We had a very tight schedule all day Thursday that went late into the evening, so I called my other hotel for a late check-in (which was The Hilton downtown Milwaukee, see that review too). I decided to leave my truck at the Iron Horse Hotel and take a taxi to the Hilton later on, this saved me on another parking fee. The parking attendant guys were the nicest guys ever, opening the door, greeting you, they pulled up my truck at the end of the night, got my luggage out, called the taxi all with a smile. It doesn't end there, the next morning, they pulled up my truck again, put my luggage back in and re-parked the truck until 2:00 Friday afternoon, all for $24.00. These guys not only deserve good tips, but made an unhappy person feel a whole lot better. Being a woman, alone in an unfamiliar city, they made me feel at home. I truly wished I could have stayed there, everyone was commenting on how comfortable the beds were, so I did have to pout a little. At the end of Thursday evening our convention had free drink tickets in the bar. I tried talking to some of the folks in our group, but was just feeling sorry for myself and sat at the bar, well the bartender was like an entertainer, before long I was laughing and having fun watching all that was going on in this very busy bar and how they handled it all. This boutique hotel is first class, but laid back, which is exactly what I liked most about it - it feels like home. The lunch they served was excellent too. I will be back and next time I'm staying there! They are dog friendly too, biker friendly. It's just the coolest, hippest place and I'm bringing my girlfriends for a girls get away. We usually stay in downtown Chicago, but the parking and room fees are getting to be a little too much and this is closer to home for me. Check it out, you won't be sorry.", "title": "I Was Mad & Pouting - How They Changed My Opinion", "helpfulness": 1, "user": "bjtours", "date": "September 23, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 141051196}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "My trade association met in Milwaukee last week. Since many of the meetings were at Iron Horse, several of us stayed there as well. What a wonderful experience! All the staff were so friendly and helpful, the food we had was very good, and the lobby and rooms were outstanding! One of the owners of the hotel spoke with us to explain their renovation of this historic building - built in 1907. When renovation was underway, wonderful wooden beams and 18 inch posts were uncovered, hand-sanded and saved, adding to the charm of the finished product. Each of the 100 rooms has an enlarged photo mural of a Milwaukee woman which has been hand embellished by the artist. The bed was comfortable and the decor (especially the shower) was very unusual and added to the boutique quality of the hotel. Drinks were expensive - but that was to be expected in such a high-end hotel. My only complaint was the toilet paper - not as soft as one would expect in such luxury. OK - so I'm fussy! The hotel was planned with bikers as well as business people in mind. Jeans, leather and business suits are all acceptable attire. The motorcycle in the lobby was beautiful - plus the Harley Davidson museum is within walking distance. We'll be certain to return.", "title": "Great hotel but bad TP", "helpfulness": 1, "user": "WI-Hilda", "date": "September 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140942875}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We booked a night at the Iron Horse for the night after our wedding. We live in WI but had never stayed at the Iron Horse. I have to say we thought it was amazing!! I travel quite a bit all over the country for work and this is my favorite hotel! It is so unique, the rooms are very cool without being over the top modern. We want the bed and pillows in our room. They were so comfortable!The staff was very nice and Bonnie was very helpful. Since our stay less than a week ago I keep telling all of my friends that a night at the Iron Horse is a MUST DO!! Thank you for making our wedding night stay extra special.", "title": "Best Stay Ever!!", "helpfulness": 1, "user": "Michelle B", "date": "September 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140848628}], "location": {"country": "United States", "city": "Milwaukee"}, "stars": 4, "variance": {"poor": 9, "average": 24, "very good": 117, "terrible": 9, "excellent": 729}, "aka": "Hotel Iron Horse", "slim_ranking": 0.0384615384615, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "The Iron Horse Hotel is Milwaukee's most chic and sophisticated property - the transformation of a 100-year-old downtown warehouse into a modern luxury boutique hotel. As the industry's first upscale hotel geared for business travelers and motorcycle enthusiasts alike, The Iron Horse Hotel meets the distinct needs of both corporate and leisure guests with its special services, unparalleled amenities and 100 loft-style guest rooms."}