{"user_rating": 4.0, "review_count": 517, "name": "Isa Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We arrived quite late, the hotel having arranged a good airport transfer with a nice driver who came in a huge SPV thing and whisked us into Rome in 30 mins from FCO. Check-in was quick and the staff efficient and friendly. Our family room was a 2 bed suite basically, both with large en-suite bathrooms, my only minor disappointment was that I booked about 4 months in advance and asked on several occasions for the modernised family room and we got the old school one, but actually it was fine, and had a more classical Italian feel anyway. AC was ice cold luckily as 40deg most days! Breakfast on the roof terrace was as expected, plentiful, included in the price AND with stunning views. Free interrnet use on the ground floor was a perfect addition too. The hotel has a lift but a few steps lead up to it. Its truly a beautiful old building that has been carefully modernised. Walkable to the river and the centre in 10/15 mins, there is no restaurant onsite but good ones locally. We would definitely stay here again!", "title": "Great Location, spacious family room, good value", "user": "Tonia_R", "date": "September 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 41596257}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Great location--very comfortable walk to Lepanto metro stop as well as Vatican, Pza Navona, etc. Just outside of the overrun tourist area, which made it very pleasant. Loved the breakfast buffet on the terrace--like a wedding breakfast. Room was great--normal size for Europe but with a running shelf alongside the walls to place stuff--providing more surfaces than you get at typical American hotels. Strong air conditioning and ventilation. Didn't quite get the ironing board thing, but I didn't bother to ask. Reception was helpful. We called America using an 800 number calling card. For Italy, all calls (brief) from the room phone were not more than 1 Euro. The great find for us was a Sicilian gelateria and eatery with arancine--wow. Located a few blocks away on Via Cicerone on the way to the Lepanto metro stop.", "title": "Loved it", "user": "cinzian", "date": "August 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 39001125}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I spent 3 days at this hotel pre-cruise. We were very satisfied with this hotel. We booked a superior deluxe room. The room we were given was on the fifth floor and was clean and spacious -- in fact, it is the largest room I've ever stayed at during my many trips to Europe. Everyone we encountered there -- the receptionists, the maid, the workers at the buffet -- were very friendly and efficient. We loved the location -- while not in the middle of the tourist area, it was a 10 minute walk to the Piazza Navona, and near a very lively avenue where the locals hang out at night for dinner, gelato, or a stroll. I highly recommend this hotel to anyone who has plans to visit Rome.", "title": "Great Stay at Hotel Isa", "user": "Arbet", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37097464}, {"rating": 4.0, "title": "Hotel Chic", "text": "Air condtioning saved our lives as hot hot hot.", "user": "jenxie", "date": "July 10, 2009", "id": 34380158}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "Small room but adequate - the lift worked- breakfast was excellent. Quiet location but good for Vatican and Piazza Navona.", "title": "Great Hotel in a good location", "user": "brownie1973", "date": "June 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 33600077}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Hotel Isa is a three star hotel with delusions of being a four star. The Lobby is very attractive and modern and rooms on the second floor have been renovated. Problem is that they either ran out of money or are slow in doing rest of hotel. Rest of rooms look like early 60's Red Roof Inn. We booked six months in advance but were given a", "title": "Mixed Bag", "helpfulness": 1, "user": "gsdc", "date": "October 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 46001084}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "closet sized room. It was on the second, renovated floor but it was tiny, even my European standards. We were assured that we could change rooms on the second", "title": "Great Hotel - Except for smelling like Poo...", "user": "MarkE007", "date": "September 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 45539823}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "day but when we checked we were told there was nothing other than an old style room on the 3rd floor with three single beds! Mario assured us that we would receive an extra special room on the 3rd night. Guess what - it never happened! The rooftop terrace does have a wonderful view of St. Peter's and the restaurant staff could not have been nicer but even up there it could do with a little remodeling. Location was a bit of a walk to things but certainly doable. If you book here, be very careful to request a room on the second floor - any room other than Room 203!", "title": "Nice hotel but didn't love location", "user": "Jennall", "date": "September 29, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 45454849}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "My Fiance and I just came from Greece and Hotel Isa was a great value with a pretty good location (with a nice, cheap, italian restaurant around the corner). Just get ready to walk a lot. Amazing service, good size rooms (compared to the rest of europe), friendly staff also no problems with english. HOWEVER... We stayed there 4 nights and we didn't nail the stench down until the 3rd night but there is a definite air of sewage in the Hotel. It wasn't on the street outside, but inside the hotel, especially in our TWO rooms we stayed in (one on the first floor, another on the 5th). We wouldn't mind staying there again next time if it wasn't for the stench.", "title": "Great location, lovely stay at Isa!", "user": "Malena55", "date": "September 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 44612081}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "We had high expectations given the 4 stars on hotels.com and the price. But we were a bit disappointed. The lobby is very nice; the rooms are small and decent. Not too much to write about the rooms besides just small! One huge positive is the breakfast and rooftop terrace. The food is very good and the views of St. Peter's are really great. The chef on the top floor is very friendly and helpful as well.", "title": "A nice hotel as long as you are on a renovated floor", "user": "sargeAlexandria_Va", "date": "September 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 44557371}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "great location. rome is very walkable and fun to tour on foot. having isa as a base worked out well. it seemed to be in the more quite part of rome, separated from the drones of tourists and obnoxious middleschoolers with mullets.", "title": "expect what you pay for", "user": "xplrmor", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26680504}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "when we booked this hotel, and booked the cheapest room, i did not expect to get the room which is shown on the website, nor did we get the room that was on the website. what we did get was a nice, spacious room, which was clean, comfortable and safe. my only complaint are that the doors and walls are thin and would be dreadful if you had noisey people on your floor.", "title": "Very well placed hotel - super breakfast but in cold weather wear a coat!", "helpfulness": 1, "user": "50scoupleManchester", "date": "March 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 25745963}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "the staff was friendly and the rooftop was a nice place to relax with a drink and overlook st. peters.", "title": "Great value for money!", "helpfulness": 1, "user": "machapuchare", "date": "December 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 22719906, "likes": {"liked": "— great value for money!", "disliked": "— ----"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "bottom line, dont be dissappointed if you book the cheapest room and you dont get whats on the website.", "title": "We loved Hotel Isa", "user": "M3lyssa", "date": "November 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 21709119, "likes": {"liked": "— Breakfast on the roof.", "disliked": "— The lobby and stair well did get noisy."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with friends", "text": "The rooms in Hotel Isa (3 couples - 1 room on 2nd floor and 2 rooms on 3rd floor) were quite adequate. We did not have a bath in these rooms and after walking all day around Rome it would - on reflection - have been nice to have a soak.", "title": "GREAT Hotel!!!", "user": "SunflowerDublin", "date": "October 13, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20838551, "likes": {"liked": "— Location", "disliked": "— No complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We spent 4 nights in the Isa Hotel on our recent trip through Italy. It was clean, very new, and very comfortable. The location was perfect - just outside the really crazy tourist area, but close enough to walk to almost everything. The windows blocked out the light and most of the noise - I'm a very light sleeper and was satisfied with it. The bathroom was very modern, and the room had ample space for luggage, etc.", "title": "Great location, great hotel - highly recommended", "user": "adabrown", "date": "May 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 30672575}, {"rating": 5.0, "stay_parameters": "Stayed May 2009", "text": "The staff spoke English and were sufficiently helpful. There was a computer in the lobby which was free to use, which was really nice. The staff even printed out a reservation for a tour for us. The breakfast buffet had a huge variety to choose from and made your coffee/espresso/cappucino to order. LOVED the freshly squeezed OJ!", "title": "Italian hospitality in a beautiful setting", "user": "wife-o-chris", "date": "May 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 30233283}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We booked our hotel using reviews from TripAdvisor - they were pretty acurate, and the pictures from the website were true. Overall this was a great hotel - I would recommend it to anyone.", "title": "Not a hotel I would recommend!", "helpfulness": 1, "user": "Kenny79", "date": "May 15, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 30039928}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We spent 4 nights at the hotel and were really glad we had chosen it, there were so many to chose from in Rome. The front desk staff was super helpful, the maids were really nice and the staff at the rooftop terrace was over the top great, especially the chef who seems to work constantly! The breakfast was a real crowd pleaser for our our group (5 adults) because once we got on the street we walked and explored all day. The rooftop is a bar in the evening and it was the perfect place to meet up and regroup while overlooking the dome of St Peters. We would stay there again, it was great to be on that side of the river rather than in the busy heart of Rome.", "title": "Really good city centre hotel- Friendly and clean", "user": "teemoretraveler", "date": "April 17, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 28192172}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "When we arrived our room was not ready and we were asked to come back in an hour to check in. We came back and were given the key to our room. The housekeeping staff seem to be the only ones allowed to use the lift during the day, so we had to drag our case up 3 flights of stairs, only to find that our room had not yet been cleaned. So back down the stairs to reception who made no apology and asked us to come back in another hour.", "title": "More than the comforts of home", "helpfulness": 1, "user": "kakrn", "date": "April 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27260619}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "stars": 4, "variance": {"poor": 19, "average": 56, "very good": 233, "terrible": 15, "excellent": 194}, "aka": "Isa Hotel Rome", "slim_ranking": 0.13937007874, "description": "Hotel offering modern, comfortable accommodations, popular amenities, restaurant and lounge; near Castel Sant Angelo."}