{"user_rating": 4.0, "review_count": 1486, "name": "Island View Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "ISLAND VIEW IS AN AVERAGE HOTEL IN A NICE POSISTION.", "title": "BASIC", "helpfulness": 1, "user": "RUGBY8", "date": "April 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 14707055, "likes": {"liked": "— Comfortable sun beds by middle pool", "disliked": "— Food and drink."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "ROOMS ARE LARGE (SUITES) BUT ARE IN URGENT NEED OF A REFURB! Beds ok and cleaners good but bathrooms very old.Small baths with no plugs!! and poor showers.", "title": "Fantastic holiday!", "helpfulness": 3, "user": "PhattBloke", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 14680327}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "FOOD BASIC AND VERY DISORGANISED ...basically a free for all to get and keep a table and food average ITALIAn was good andEgyptian ok. DRINKS ARE NOT PREMIUM BRANDS but local Egyptian brands which although I generally drink anything were un drinkable.Beer ok and wine ok but only in a'la carte restaurants! POOLS OK although 1 slide was closed alll week all areas very clean. WOULD NOT RECOMMEND THIS HOTEL. STAYED IN KIROSIEZ last year and that was better..", "title": "Great Holiday", "helpfulness": 5, "user": "Jonesy191080", "date": "March 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 14340954, "likes": {"liked": "— Food, drink and weather", "disliked": "— Room required updating - more 3*"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "Well, to the guy from Hong Kong who gave this hotel a bad review - i'm sure you've written a review for the wrong hotel. Or you were desperately unlucky.", "title": "Rude staff - expect tips first, then give service", "helpfulness": 1, "user": "ADDHongKong", "date": "March 5, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 14058853, "likes": {"liked": "— Snorkeling", "disliked": "— Rude staff and cleanliness"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "This was by far and away one of the best holidays i've had in a long time. There were 7 of us that went - 6 adults and one 9 year old lad. The rooms are more than adequate. We had 3 junior suites, and the rooms were large, clean and comfortable. The only minor downsides were the beds were hard and you weren't supposed to put any toilet paper down the loo. I agree with some other reviewers that its not a 5* hotel, but any minor issues were solved quickly, and reception always called to find out whether the issue had been resolved to our satisfaction (in our case, the balcony door didn't lock properly).", "title": "Amazing!!!", "helpfulness": 1, "user": "HILNewcastleUponTyne", "date": "March 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14041623, "likes": {"liked": "— beach and pools", "disliked": "— nothing at all!"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Spent a week at SIV from 27/12/07. This hotel is well laid out with lovely gardens and water features and our room was spacious. However, the bathroom was in need of some refurbishment with the bath being quite degrained. We also had brown water for two days but this was sorted after being reported. I am not a fan of all inclusive hotels and the SIV is a prime example why. The food was very mediocre and apart from the freshly cooked pasta was generally on the cold side. A few trips to Naama Bay were called for to get a decent meal. The service I found to be very slow and can only think that they are trying to minimise the amount of food/drink that is distributed by slowing the service. These guys wouldn't last long in Starbucks !!! As i've stated above, this hotel is wasting it's potential as it requires a good bit of refurbishment and a rehash of the catering regime. This is in no way a 5 star hotel. I stayed in the Hyatt Regency in Sharm last April and that is more like it. On the plus side, the New Year gala evening was quite good and showed that the catering staff could put on a good show when presented with a better standard of raw material. Along with a few othewr reviews I have read I should report that several upset tummies were encountered during our stay.", "title": "Potential wasted.", "helpfulness": 3, "user": "TheDruid", "date": "January 9, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 12479208, "likes": {"liked": "— spacious", "disliked": "— bathroom"}}, {"rating": 2.0, "title": "more a three star hotel", "text": "Got back on 7th Jan. After having been to other all inclusive hotels in other countries I can say that this is not a 5* hotel. The grounds are fantastic, the rooms are tired and the food is very average. The problem with the food was that it was never really hot. After speaking with the hotel manager several times he agreed that they were trying to remedy this as it was a general complaint from the English. It seems the Russians, of which there were many, never complain about the food and that is all they do all day - eat and drink! A lot of people were very ill with 'the runs'. In fact the pharmacy across the road from the hotel ran out of their remedy for this. The entertainment was very amusing, pity it wasn't meant to be!! The snorkeling was excellent off the jetty which is just off the man made beach of the hotel. It may be handy for the airport (ten minutes away) but at times it felt like we were sleeping on the runway, the noise was so loud from the aircraft. The staff were very pleasant and helpful but very understaffed in the restaurants. In the no smoking restaurant there were never any plates so we always had to ask for them which seemed a hardship for some reason.", "helpfulness": 4, "user": "rossendalelass", "date": "January 8, 2008", "id": 12444465}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with friends", "text": "Breakfast was the best meal of the day, probably because it is more universal. On the whole a nice hotel if you don't pay over the odds for it and perhaps have bed and breakfast.", "title": "Excellent experience", "helpfulness": 4, "user": "onthebeach1979", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 12014518, "likes": {"liked": "— Level of service/standard of hotel", "disliked": "— not directly on the beach"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "This was an excellent hotel. The hotel was superbly kept, clean and tidy and staff could be regularly seen maintaining the public areas. The rooms were spacious and had everything you needed, the maids were excellent and cleaned the rooms to a very high standard every day.", "title": "the food ha ha", "helpfulness": 1, "user": "BoltonSpeedy", "date": "December 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 4.0}, "id": 11707186}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The staff were very good and couldnt do enough to help in all areas of the hotel, The annimation team were very friendly and helped where ever they could (although if you participate in one thing, expect to be asked to do everything!)", "title": "Spoilt by poor service", "helpfulness": 2, "user": "DanTheMan73", "date": "December 15, 2007", "detail_rating": {"front_desk": 4.0, "service": 1.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 11576235, "likes": {"liked": "— the coral reef", "disliked": "— poor service"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "this is the 5th time i have been to Egypt - 2nd to Sharm, and would highly recommend this hotel to anyone. The grounds are very well looked after, 4 pools to choose from. Beachfront is really good too.The staff are always very friendly and helpfull and nothing is too much for them. The Ultra inclusive hotel means 24 hours you can get a drink, and the food choice was very good too. although the hotel is very near to the airport, you hardly notice the planes coming in.", "title": "great place", "user": "stevene31", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14009843}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "There is a supermarket across the road, and a set of shops 2 minutes walk to the right of the hotel where you can find more supermarkets, and a cashpoint & bank, although there is a cashpoint in the hotel by the terrace bar where you will also find the hairdressers.", "title": "great holiday would def go back", "user": "titch262003", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14004741, "likes": {"liked": "— clean and luxurios", "disliked": "— n/a"}}, {"rating": 4.0, "title": "Value for money", "text": "You can get a blue and white taxi into Naama Bay for about 50 Egyptian pounds which is approx £5 and they will pick you up at the end of the night too - though make sure that you do barter for this.", "helpfulness": 1, "user": "bettysnevets", "date": "February 23, 2008", "id": 13793684, "likes": {"liked": "— cleanliness", "disliked": "— Nothing it was fine for us"}}, {"rating": 5.0, "title": "Brilliant- sunrise island view", "text": "Overall had a great week, just wish that it had been longer", "helpfulness": 2, "user": "saraanne35", "date": "February 1, 2008", "id": 13169543}, {"rating": 5.0, "title": "best holiday i have ever had", "text": "This hotel is pure luxuary, we went for honeymoon and the food was great, room fantastic and clean, waiters and staff remembered orders and tables from first day and could not do enough for you. I will def be visiting again. naama bay was a great town to visit with the whirling dirvish a great attraction. we went snorkling in the red sea and had a great day.", "helpfulness": 5, "user": "spirery", "date": "January 16, 2008", "id": 12708492}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "We got back 27th November, the weather was pretty warm but colder towards the end of the week.", "title": "Not bad good points and bad points", "helpfulness": 2, "user": "picasso72", "date": "November 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 11156268, "likes": {"liked": "— spacious room", "disliked": "— food halls and general organisation"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with family", "text": "The hotel was nice but the catering organisation was pretty bad, dirty tables and disorgainsed system, often you were eating from a dirty table with missing cuttlery and no napkin. If you don't like rude Russians don't go to this resort.!! they are everywhere and pretty full on.", "title": "Disappointed", "helpfulness": 10, "user": "Jo S", "date": "November 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 10966534, "likes": {"liked": "— The friendly staff", "disliked": "— Over crowded and shabby"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "The room was great, we had a suite, nice relax area with English TV, comfortable beds and cleaned daily. The pools were nice but entertainment pretty lame. I went to Sharm to relax and swim in the sea so it didn't both me too much but if I was with a family or a group of girls I would have found the entertainment very limited.", "title": "Better than expected", "helpfulness": 6, "user": "Joshsdad", "date": "November 12, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 10767032, "likes": {"liked": "— Rooms.", "disliked": "— Thomas Cook trip to Cairo."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "There were allot of things about the hotel which I felt was lack of attention to detial, smells from rubbish, light bulbs missing, lack of cutlery and glasses, all things which was annoying and so uunnecessary but I guess its the mentaility there. One has to go to these countries with an open mind, they do things different there and if you go expecting the creature comforts of home you wont survive, by general impression of the hotel and complex was fair, surely not our 5 star standards, I would so a good 3 star. the gardens and pools are really well maintained, some parts of the hotel are beautiful. I would say the dining halls and food orgainsistion was the downfall.", "title": "Almost there!", "helpfulness": 13, "user": "Waynes_dad_Mickey", "date": "November 1, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 10498962}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "would i go again.....? I went to marsalam last year and the barrier reef was far better, the hotel was quieter and everything was newer but then again if you are looking for excitment and activities marsalam is limited, there is good and bad with each resort. My friends have been ot other hotels near by and say the service is better, like dreams or coral bay, 4 seasons but all in all I enjoyed myself got a super tan and saw some lovely underwater life. Excursions.....Ras Mohammed is beautiful but all in all you swim for about 30 minutes, rip off! Cairo, too long and too disorgainsed, quad biking....a must, great fun and take your camera! and a bandana for the dust. Diving....use the diving ccentre for snorkling trips but be preapred for the usual tourist rip off.... dont bother to buy the films they make in the desert or snorking they are bad quality and almost boring unedited etc.", "title": "Hot, hot!!", "helpfulness": 10, "user": "littlemo01", "date": "October 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 10091175, "likes": {"liked": "— The deluxe suite was spacious and had a huge queen size bed", "disliked": "— Needed more sun beds and stop reservations on them"}}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa"}, "stars": 4.5, "variance": {"poor": 85, "average": 189, "very good": 437, "terrible": 42, "excellent": 733}, "aka": "Sunrise Select Island View Hotel Sharm El Sheikh", "slim_ranking": 0.235807860262, "detail_rating": {"service": 4.5, "cleanliness": 4.0, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Directly located at the splendid Shark Bay with its own house reef you will find in this \"Ultra All - Inclusive\" 5 star (country category) Resort everything you wish. The four large pool areas, the splendid arranged garden, with water falls and canals, the spaciously designed rooms and junior suites are the ideal venues for your family vacation."}