{"user_rating": 4.0, "review_count": 188, "name": "Isrotel Royal Garden", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "A family with a 3 year-old stayed at Royal Garden for 6 nights. In summary, this hotel is perfect for kids. Our toddler absolutely loved the kids' pool (has sand, shallow water, etc). The \"grown up\" pool (i.e. lazy river) has a cave, where you can sit and cool down. It's a nice feature for both kids and adults. Our 3-year-old loved sitting there with mommy & daddy.", "title": "PERFECT for kids", "helpfulness": 1, "user": "mgk703", "date": "May 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 65786221}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The rooms were very clean and functional for a family with kids. The kitchen allowed us to prepare home made food for our son, although the restaurants downstairs had kid-friendly options.", "title": "Great service even over the hectic passover", "user": "jeff1996", "date": "May 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 64354603}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Breakfast was a typical Israeli hotel breakfast--too much food! There were plenty of options for everying, including kids.", "title": "Immaculate and disappointing", "helpfulness": 1, "user": "DerBish", "date": "January 25, 2010", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 54299080}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "We really didn't have anything to complain about with this hotel. Our toddler loved it, we loved it and will definately come back until he's a teenager!", "title": "Great place for families", "user": "mp94", "date": "January 15, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53558066}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Spent 5 days over Pesach at the hotel and enjoyed great service and great food despite the hotel been at max capacity. Interleading rooms were supplied as requested which often doesn't happen to travelers during peak season. Location was very good and we spent evenings strolling through the bustling markets and stores along the beach front. The Eilat beach is shocking and we spent days by the poolside unless sightseeing at the dolphinarium, aquarium or taking a day triptop Petra in Jordan (which I recommend) . As far as resorts towns go there's better places than Eilat but thats not the hotels fault.. But for a kosher passover you could do a lot worse.", "title": "great place for families", "user": "lisdorOslo", "date": "December 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 51601231}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "we have just returned from staying in the royal gardens where we had a wonderful time. We found the hotel very clean and the staff helpful and prompt with requests. The air conditioning was excellent and we didn't notice any perfume scent in the lobby as someone previously had. The hotel does get very busy at times and noisy with a lot of children running around in the reception area but this is a large area and there is still lots of space and the bedrooms themselves are quiet. The sound on the main tv was a bit dodgy but everything else spot on. I look forward to staying there again.", "title": "great place to stay", "user": "priscillaq", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18857927, "likes": {"liked": "— location", "disliked": "— too many noisy kids"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We have recently returned from a 9 day holiday in Eilat statying at the Royal Garden Hotel on a self catering basis. We had a fantastic holiday and the hotel service and facilities were execellent. The hotel staff were very efficient and friendly and the place was very clean and tidy at all times. The only thing I would say is that upon check-in they should go through the facilities available within the complex as we didnt have a clue what was available until we found out ourselves but apart from that this is a beautiful place to stay and we will definitely go there again. The pools were really nice and clean. We also watched a very good show which was put on by the hotel. We visited the dolphin reef where my daughter and I snorkelled with the dolphins which was an execellent experience and very efficiently done. We did full day tours to Jerusalem and Petra which were amazing both with execellent tour guides. All in all a great holiday was had by all - 2 adults aged 43 and 40 and one child 12 years old. We will definitely be going to Eilat again and we would love to stay at the Royal Garden Hotel. Debbie from Hudds", "title": "Fantastic Vacation", "user": "Debbz_8", "date": "August 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18836411, "likes": {"liked": "— Cleanliness and Customer Service", "disliked": "— Not given enough information regarding the hotel facilities upon check-in"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "This is the second time we stayed at this hotel and were expecting great things from our previous experience of a few years back.", "title": "Disappointing to the extreme", "helpfulness": 4, "user": "BANL", "date": "April 8, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 14879283, "likes": {"liked": "— Service was lousy"}}, {"rating": 4.0, "title": "A Real Vacation", "text": "Unfortunately the hotel did not deliver this time. The rooms felt tired with all cooker and air-con controls worn away. The bath didn't hold water and had to be fixed twice, the taps didn't stop running and one light switch was broken.", "helpfulness": 2, "user": "vacationingbob", "date": "March 6, 2008", "id": 14090324}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "This is a family resort. Had a patio garden suite which was nice. Not overly plush for the price but comfortable & well appointed. Lovely pool area. Buffet breakfast was incredible with its huge selection & variety. Generally very quiet at night & good for sleeping.", "title": "Very nice resort", "user": "Luvtotravel7", "date": "October 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 83945424}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The hotel rooms are basic and a little bit tired in my opinion. We stayed at one of the pool level suites which included one bathroom, master bed, bed couch and baby bed. Unfortunately, due to the fact tha the room was adapted for handicapped guests, the shower head only reached our waists (which bothered me....why can't they also install a normal level shower head for non-handicapped guests). The facilities are great and include shopping (e.g. a minimarket), 3 restaurants, internet room, children's club, a swimming pool with real sand, etc. The staff was really helpful/friendly with a high level of service. Staff was constantly cleaning after guests. Food was quite good with a great variety.", "title": "Excellent facilities, reasonable rooms, great service.....", "user": "EricRehovot", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 81796025}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We stayed at the Royal Gardens earlier this year with our 3 kids aged 4-8 .", "title": "Nice family friendly hotel", "user": "EBB608858650", "date": "September 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78353456}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The Hotel is self catering with a more than adequate kitchenette but with its own resurants on site. It has its own bakery which is great value for money and very good quality.", "title": "Nice hotel with great internal area pool and garden", "user": "valeanna", "date": "July 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 70664480}, {"rating": 4.0, "title": "The best hotel for families in Eilat", "text": "The pool area is amazing. The hotel has three pools . One with waterfalls and caves which the kids loved. The second is an artificial beach which was cute but nothing special and there was also a very nice covered toddlers pool. In addition there is a water slide open a few hours every day but only to kids who can swim and is above a certain height. The pool area is large with nice grass areas and a very tranquil setting .", "user": "Dundun0101", "date": "June 24, 2010", "id": 68499116}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "just came back from weekend in hotel Royal Garden, it was a wonderfull weekend, we got a family suit with 2 bedrooms plus livingroom and very well equipped kitchen . all was very large we had also a very nice porch with excelent view. the kitchen had every thing you need from teaspoon until dishwasher. the pool was very good and relexing for the children and the adults. their was a supermarket at the hotel, so we can buy their all the things we needed. we will defenetly come back.", "title": "best hotel in eilat", "user": "TelAvivSar", "date": "August 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36731050}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The room is actually a suite: kitchenette, living room sofa included, bedroom with en-suite bathroom and additioanl twin bedroom which is small and has no closet but does have en-suite shower. The hotel concept is children oriented, the pool is great for the very young and up to ages of 12. They also have a burger restaurant on the pool, which can deliver to the rooms.", "title": "Royal Garden - convenience for families", "helpfulness": 1, "user": "RachelIsrael", "date": "May 20, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 30398578}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "One drawback is that the hotel actually does not have a lobby, and the dining room is very noisy. Don't bother eating there, use the kitchenette and the various takeaway services around.", "title": "Know the rules, and you cant go wrong...", "helpfulness": 9, "user": "milesw", "date": "April 11, 2009", "detail_rating": {"cleanliness": 2.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 27819964}, {"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Ok folks, the regular proviso; I stay in top tier hotels (Ritz-Carltons, Four Seasons, Mandarin Orientals, etc) for over 150 night a year across the globe, and I am top tier card member of all the major hotel groups, so would suggest that I know a few things about what makes a good or bad hotel. I have also stayed in my fair share of Holiday Inn Expresses and Travel Lodges, as well as family resorts with my young kids from Disney in Paris to Breakers in West Palm Beach. So hope I am well versed in every kind of hotel one can imagine!", "title": "An overpriced ripoff", "helpfulness": 4, "user": "family-man1000", "date": "December 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 23048767, "likes": {"liked": "— location", "disliked": "— price, value"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We (two adults and a 8 +11 year old) have stayed at the Royal Gardens every year for more than five years, and always at Passover time (which is the peakest of peak seasons for Eilat).", "title": "Loved the Royal Gardens Hotel, Eilat, Israel", "user": "DocDavid", "date": "August 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 19562965, "likes": {"liked": "— Excellent facilities", "disliked": "— We couldn't take it home with us!"}}], "location": {"country": "Israel", "continent": "Middle East", "city": "Eilat"}, "stars": 3.5, "variance": {"poor": 12, "average": 21, "very good": 61, "terrible": 8, "excellent": 86}, "aka": "Isrotel Royal Garden Hotel", "slim_ranking": 0.276923076923}