{"user_rating": 4.0, "review_count": 1294, "name": "ITC Mughal, Agra", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "stay at ITC Mughal for one night only for visiting Taj Mahal. The hotel has great location and beautiful facility. Restaurant has great food. However, the most impotant is the way it treats guests. Since I lost my luggage coming to India, the hotel was able to do a complementary lanudary with 4 hours turn around. Sanjay, the GM, also tried hard to help me retrieve the luggage from airline after finding out my problem. Definitely recommend it to all my friends.", "title": "great property at historic location and great management", "user": "Shanghai123-13", "date": "March 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154143866}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "i stopped in agra to visit taj mahal. i stayed there for 1 nite…it's a budget travel and supposed to find a hostel but couldnt really find an ideal one. finally , we booked ITC and i think i made a good choice. bf is tasty, service was good and i got upgraded to suite, and it's close to taj mahal.", "title": "no better choice", "helpfulness": 1, "user": "Coffeelui", "date": "March 9, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 154069933}, {"rating": 3.0, "title": "Nice rooms - amazing spa", "text": "I have seen some comments below saying that the rooms were old and in need of refurbishment. I think I would agree with those comments and add that while clean the rooms were not spotless and shining as perhaps they might be. They are nice rooms though, just a bit old really and it has the feel of the excess of an age of the first really bling hotels which has only been partly refurbished.", "user": "Michael O", "date": "March 7, 2013", "id": 153966248}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The spa is brand new however and is rated as the finest she has ever been in by my girlfriend. I just sat by the pool which I found pleasant enough.", "title": "Great service", "user": "Laura R", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 153827604}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "There is a bit of an issue with the staff not being as perfectly helpful as they might be though. I don't mean this in the sense that they do not care but rather that they are a bit too happy to stick you in a hotel car or something rather than answering your question. We were heading out on two occasions as a taxi was dropping people off and the staff refused to allow us to grab the taxi as it was heading out as they wanted to call one themselves - bizarre really as we just walked outside and grabbed a tok tok. Also the hotel guy tried to convince me to use him to bring us to the taj first thing at 7am ( we wanted to go at 6.30 but he was already booked), even though I told him I wanted to be there for sunrise, rather than just helping organise someone to bring us at the time we wanted. Not on really that he is trying to persuade people away from going when they want to so that they can line their pockets.", "title": "Rooms desperately need a refurbishment", "helpfulness": 1, "user": "Sypiner", "date": "March 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 153610763}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed in Jan 2013 at this hotel.. It was a lovely experience at the hotel.. After a long drive in Fog from Delhi we arrived late at this hotel.. Luckily we were upgraded to Mughal Suite Room.. And as the name says its truly a Mughal Delight.. All the stress was gone looking at the room & ambience.. The feel of the room was very beautiful.. Worth the price & value.. Very near to Taj as well... Overall experience was good..", "title": "A Beautiful Stay!!", "user": "Rohu8", "date": "March 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 154600726}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "The entrance and the lobby was beautiful! You can feel a sense of luxury. The interiors were up to date and modern. However, this hotel needs to be managed well! The courtyard needs some serious gardening although that was not the highlight of this hotel. It still feels luxurious but needs to be managed well. Would definitely book again here if I'm gonna see the Taj Mahal again for the second time. :-)", "title": "A Grand Entrance", "user": "mynameisimman", "date": "March 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154279211}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Stayed at the ITC Agra Feb 25th while visiting the Taj. What a great stay. The front desk staff was amazing and so helpful. I loved this property. The rooms were spacious, very clean, and very upscale. The service here was the best I had in all my travels throughout India. The staff needs to be commended on their quality of providing great service.", "title": "Amazing Hotel", "helpfulness": 1, "user": "nkonowal", "date": "March 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154272013}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Stayed in a Moghul suite we got through Expedia. The welcome was very nice although we got a few too many knocks on the door in the first half hour.", "title": "Very comfortable", "user": "Lyn&MarkfromOz", "date": "March 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154225055}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Suite was very good and although the comments about the hotel needing a refurb are true, our room was very good. Bed comfortable, best aircon we had in India. Everything we needed.", "title": "Impeccable house keeping services!!", "user": "Krish-on-holidays", "date": "March 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 154220895}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The ITC is a luxury hotel in Agra. We had a large room, with enough space for an extra bed, and a nice bathroom. Everything was clean. The kids enjoyed the pool very much, and all the great gardens and outdoor spaces that aren't commonly found at Indian hotels, in our experience. The breakfast, which was included in our room price, was outstanding. A great mix of Western and Indian food, and the service was outstanding. It seemed nothing was impossible! We ate at Peshawar restaurant in the hotel and while it was nice, it was overpriced for similar food in Delhi. The hotel dinner buffet was much better value.", "title": "Posh, but what does it all mean?", "helpfulness": 1, "user": "worldstrider", "date": "April 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60101553}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "You can glimpse the Taj from the roof but it is a poor view. Much more interesting is to watch the pigeon fanciers training their pigeons from the rooftops of nearby houses at dusk.", "title": "Beautiful and Exceptionally Well-Run Hotel", "user": "DCRE", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59952870}, {"rating": 1.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "My one beef with the hotel was the constant demand, on the part of the staff, for tips. (This comment excludes the excellent hostesses at the front desk.) One example: during the day, my son's extra bed was unmade and the bedclothes stored away. Each night, the \"room boy\" would come and set up the extra bed again. And wait for a tip. Even when he had to wait a long time because I was giving my son a bath! Because of the way that the signal lights near the door function (these are outside the room door), staff can tell that you are in there and believe me, the room boy never came when we were at dinner. Before we vacated the room, another \"room boy\" appeared and demanded a tip. Others downstairs wanted tips for loading the luggage onto our car (we had brought the luggage downstairs). I could go on and on. While we would have tipped as a matter of course, I found it offensive to be subject to these demands all the time.", "title": "Crap service in an upclass setting.", "user": "ryanontour", "date": "March 30, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 59945021}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "This situation is NOT the fault of the people working at the hotel. Rather, it is the fault of the hotel management that they do not pay their employees enough so that they have to resort to what amounts to begging. If the management considered the comfort of the guests, they would realize that it is a hassle to always have change on hand to pay their workers. At other hotels we stayed at, a final tip was given to all the staff, and this was divided among them. It was at these places where we had the best, most genuine service, and the most enjoyable stay.", "title": "Place to be in", "user": "Anirban410", "date": "March 30, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 2.0}, "id": 59920568}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We were very pleased with this hotel in all respects. As Starwood Platinum members, we were upgraded to a beautiful suite, even though we were using points for our stay. We were also treated like royalty. A butler, Trevor, was assigned to us and he anticipated our every need, escorting us to the dining room and pool, keeping the suite pristine, suggesting a departure time to view the Taj at sunrise, etc. We had dinner at Peshawari and thought the food and service were excellent. We loved the spa facility and its separate pool, which was terrific for long-distance continuous swimming. We were very glad that we did not opt to spend $500+ per night at the Oberoi simply to have a close view of the Taj. The Mughal has a viewing platform but this really isn't necessary since you will be going there anyway! All in all, this was a great hotel!", "title": "You can't get a better personlised stay than what ITC Mughal offers..", "user": "Sumeet_Kapur", "date": "March 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59914034}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Mughal is fantastic hotel to stay. it's very nearby to Taj . Price wise it's bit expensive but at the same time it's too good to resist.", "title": "fantastic", "user": "pravsg", "date": "March 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 58866585}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The hotel is really amazing. Good Business facilities and really comfortable rooms. Have some good restaurants. The taj mahal is just about 2 kms away.", "title": "Excellent Service", "helpfulness": 1, "user": "Zach84", "date": "February 28, 2010", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "rooms": 5.0}, "id": 57330649, "likes": {"liked": "— The service was excellent. Hotel staff was really friendly and supportive. We were arranging a conferene there.", "disliked": "— nothing as such"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Great hotel, we had a fantastic room (no Taj view- but we didnt miss it a second) and everything was very clean and tidy. Loved the pillows and proper duvet that we were given, it made a great change to the blankets we had in other hotels. The hotel makes you forget that you are in India - which actually can make for a nice break after travelling the country for a while. The spa is beautiful, the pool area as well. Food in the Indian restaurant is really good and we can certainly recommend it. We found all staff very helpful and service was great. If you are staying in Agra - which in my view is an appalling city - then this is a great hotel to stay in for a night or two.", "title": "Very occidental and a great place to recharge", "helpfulness": 1, "user": "triptrip007", "date": "February 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56360891}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "One of the best hotels in Agra if not the one. The rooms are nice and spacious. Though need a little touch up. The entire compund is fantastic with a lot of things to do. The Spa on the property is truly a marvel and makes the hotel worth a visit just for that. Truly amazing. Lots of things to do for the kids and a great place to hang out. The bar is rather unispiring. Also the resteraunts on the hotel property are really over pricey and worth a pass. Though the breakfast is elaborate and top notch.Also the pillow menu they have is very good. Overall a great place to stay when on a visit to Agra.", "title": "Good Hotel. Great Service", "helpfulness": 1, "user": "kunsieshah", "date": "February 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 55969847}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "A hotel with all the facilities under one rood and a excelent spa. I recommend this hotel for Young singles, An amazing honeymoon, A romantic getaway, Girlfriend getaway, People with disabilities, Older travelers, Great pool scene, Families with young children, Tourists.We were visiting the golden triangle with our kids and this place was suggested by our travel agent. We reached in mid afternoon and both our kids were suffering from upset stomach. When we reached our room it was very spacious and the extra bed was already there which was very comforting. We requested the room service to make khichiri, a rice and pulse porridge for our kids they just complied, though it was not in their menu. That was really touching. The hotel itself is very close to Taj and you can actually seen it from the roof. The hotel has a lot of greenery and feeling of openness.The restaurant is awesome with wonderful spread. In all it was a pleasant experience.", "title": "loved the omni", "helpfulness": 1, "user": "hp_singhs", "date": "February 14, 2010", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55930809, "likes": {"liked": "— quick services", "disliked": "— nature"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "This hotel is unbelieveable! Loved every minute of my stay. Very impressive! The hotel grounds are very immaculate and beautiful. The hotel's public areas are very grand and the spa which is the largest in Asia is top notch! Very nice rooms and great breakfast buffet. Was able to see the Taj Mahal at sunrise from the hotel's balcony, spectacular!One of my best hotels stays.", "title": "Paradise found!", "user": "ajie", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59059290}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "This hotel is really worth its prices.", "title": "Excellent hotel!", "user": "lizabetNL", "date": "March 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58972380}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Our suite was stunning, the bathrooms beautiful.", "title": "Average rooms need some updating", "user": "PandaHouston", "date": "March 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 58969999}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "There was a cheese platter , the only one I saw in all the hotels that we stayed in during our trip.", "title": "Taj Mahal best view ITC Mughal", "user": "SUDHA_SUDHEER", "date": "March 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 58948157}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "A massage chair in the room!", "title": "Indulged in beauty of taj without any worries!!", "user": "msrahul", "date": "March 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 58896295}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "2. The rooms above had loud maintenance work going on in the evening after 7pm. I called the hotel desk at 7pm and asked them when it would stop and they said 'immediately'. At 7:30, I called again and was told that someone would be sent over right away. At 8pm, nobody had come by and the noise hadn't slowed. Finally, I called the desk again at 8:30 and yelled at them - when they finally sent someone over to apologize and told me that the noise would stop immediately. It finally stopped at 9PM.", "title": "Nice hotel, nice location", "user": "HDLBruxelles", "date": "March 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59123019}, {"rating": 3.0, "title": "Great lobby but my bathroom needed desperately refurbishment", "text": "Entering the lobby, my impression was that, eventually, I go to an Indian hotel rating 5 points!", "helpfulness": 3, "user": "Travellersfromswitzerland", "date": "March 21, 2013", "id": 155288775}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The outside entrance is Mughal-like impressive (these whispering pools along both sides of the passage), the lobby is elegant with a bar instilling a desire of comfort and cooling exotic drinks!", "title": "Fabulous hotel property", "user": "Yasoo97", "date": "March 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 155283559}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled solo", "text": "Unfortunately, on your way to the room you are back to reality! There seems to be no elevator for guests and definitely endless corridors making serpentines on each floor before you get to your room! The corridor walk evokes visions of a totally different world: a world of old carpets cut in 3m-length pieces, visibly unglued, creating bumps in the center; a world of narrow staircases and scratched doors of house keeping sections...", "title": "Short stay but enjoyed it", "user": "kelapa44", "date": "March 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 155237234}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "Too bad for me, I was not among the happy TA guests that have reported upgrades to new (?) and elegant suites. My room (633) was standard, but very correct, I must say. The view was not amazing; on the positive side, there was no direct source of noise.", "title": "Needs remodeling", "helpfulness": 1, "user": "PatUNC", "date": "March 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 155166066}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The bathroom looked fine at first sight, but finishing of bath and shower section was more outdated than any other during my stay in India. I attach some images for your own judgement.", "title": "short break", "user": "DINESH_G", "date": "March 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155050290}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "I had good time. stayed there for two night. The room was quite big and slept well. Breakfast was big heavy and not great, but it is just standard for agra.", "title": "Good choice in Agra", "helpfulness": 1, "user": "churachura", "date": "April 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 61099036}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The swimming pool changing room was bit dirty. However new spa area was really nice. If you are staying for 2 nights, have massage on the first day and then you can use the spa facility which include beautiful swimming pool whole your stay. As I did not know, I did not do it which was a shame.", "title": "Mughal takes you to mughal era", "user": "DelhiNatasha", "date": "April 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 61050051}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "good coutious staff , amazing food - never say no to pershavary restaurant - amazing morning walk.", "title": "Best Hotel in Agra", "helpfulness": 2, "user": "SKSinghLko", "date": "April 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 60917707}, {"rating": 4.0, "title": "nice amenities", "text": "Hotel Mughal Agra is one of the best hotel in Agra. Managed by ITC, hotel is located very near to Taj Mahal, the world famous monument.", "helpfulness": 3, "user": "rituaggarwal1988", "date": "April 10, 2010", "id": 60880096}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "It’s an amazing hotel. I had a great stay. The people are friendly and welcoming. It’s definitely the best hotel I have ever stayed in.Beautiful hotel with spacious lobby, excellent American-type rooms and 3 different restaurants. Service is courteous and the grounds very well kept with pools, fountains and plants with flowers matching the romanticism of this city.", "title": "Nice stay", "user": "hiadit", "date": "April 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 60661071}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "a hotel with all the facilities under one rood and a excelent spa", "title": "awesome rooms", "helpfulness": 1, "user": "spml50093", "date": "February 4, 2010", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 55214119}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "a nice hotel , beautiful pool .the breakfast did not enthusiasm me.", "title": "a beautiful hotel", "user": "NedaAthens", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55041054}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We were visiting the golden triangle with our kids and this place was suggested by our travel agent. We reached in mid afternoon and both our kids were suffering from upset stomach. When we reached our room it was very spacious and the extra bed was already there which was very comforting. We requested the room service to make khichiri, a rice and pulse porridge for our kids they just complied, though it was not in their menu. That was really touching. The hotel itself is very close to Taj and you can actually seen it from the roof. The hotel has a lot of greenery and feeling of openness.", "title": "incredible great place for family", "user": "RDhasmana", "date": "January 31, 2010", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 54806080, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "The restaurant is awesome with wonderful spread.", "title": "family in agra", "user": "20rahul20", "date": "January 30, 2010", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 54749415, "likes": {"liked": "— everything", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "In all it was a pleasant experience.", "title": "Absolutely Superb!!", "helpfulness": 1, "user": "MaunderingMuser", "date": "January 22, 2010", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 54110650, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "title": "Wonderful stay", "text": "We stayed at ITC Mughal Agra in first week of March. The spring was in full bloom. We had a warm welcome by very lively staff. Rooms were excellent. Breakfast Buffet was very nice specially the Indian foods. Our 3 nights stay was very comfortable.", "user": "asimiq", "date": "March 18, 2013", "id": 154981075}, {"rating": 2.0, "title": "Awful customer experience", "text": "We stayed in March 2013 with two adults and two children for three nights. The rooms were very clean, comfortable, wifi worked well. We enjoyed both the full-service Indian restaurant and the buffet restaurant on the ground floor where breakfast is also served. The buffet for lunch and dinner (between 1000 - 1500 INR per person with kids half price) includes Indian, European and Chinese cuising - great for our family. Location is good for visiting Taj Mahal and Agra town. There are several stalls on the road outside and three banks with ATMs on the other side of the road within 5 mins walk. There is a recreation room on the ground floor (two hotel rooms) with a table tennis table and a pool table. And the pool is well-appointed (though service not at all attentive; you have to try hard to get a drink!).", "user": "TravellingSince75", "date": "March 17, 2013", "id": 154867938}, {"rating": 5.0, "title": "Excellent stay", "text": "On the first night we slept terribly as there was a conference on and in the room above ours there were six men up all night moving around, and the furniture (with no felt feet) screeched terribly on the hard floor every time they moved a chair or table. At 1 am I asked them to keep it down a bit as they had woken us and our kids, which the guests promised to do but then didn't. OK we fully understand that there is a different acceptability of noise in India than in Europe (say). But it is no good to us to pay for an expensive hotel and then not get a decent night's sleep. We spoke with the hotel management the next morning, and were told that either the guests would be moved to a different room or they would get their written confirmation that they would not move furniture around at night. The duty manager gave me his personal assurance - \"I guarantee you that you will sleep well tonight\". We were told that it would not be possible (or necessary) for us to move rooms.", "user": "kachtem8870", "date": "March 16, 2013", "id": 154806120}, {"rating": 4.0, "title": "Great location, excellent spa", "text": "At midnight we were woken again by the same guests, same furniture screeching. Evidently neither commitment from the duty manager had been honoured, as also confirmed to us by teh night duty manager. We insisted on moving rooms immediately, which was then done to a junior suite where an extra bed was put in. The next morning the lock on that door ceased to work (the electronics were broken), so we were out of a room again. We were pretty frustrated by now, and when the guest relations manager said \"I give you my personal assurance.....\" we were less than trusting after sleeping 2hrs on night 1 and 5 hrs on night 2.", "user": "claudiaWirral", "date": "March 15, 2013", "id": 154631467}, {"rating": 5.0, "title": "Beautiful property with a feeling of luxury ...", "text": "When we returned in the evening we had been upgraded to a lovely suite, in which we spent 10 hours of which 8 were sleeping (by this stage we would probably have slept well in the garden...).", "user": "wonderin_wanderer", "date": "March 15, 2013", "id": 154602650}], "location": {"country": "India", "continent": "Asia", "city": "Agra"}, "stars": 5, "variance": {"poor": 59, "average": 178, "very good": 391, "terrible": 25, "excellent": 641}, "aka": "Itc Mughal, Agra Hotel", "slim_ranking": 0.04, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}