{"user_rating": 4.5, "review_count": 714, "name": "ITC Maratha, Mumbai", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Frankly I did not expect, from what is probably largely an \"in transit\" or short stay hotel - such a feeling of friendliness. For me, more than the horels luxuriness or comfort (both of which this ITC hotel has in abundence), I like to feel \"at home\" in a hotel, even if it is for only one or two nights. The staff at most hotels smile and are polite - but usually you feel this is just skin-deep - scratch it and it is gone! Here, almost without exception, you had the feeling that staff actually cared.", "title": "Above and beyond the call of duty", "user": "WAGS_13", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 168363430}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I will definitely, if the circumstances arise again, return to this fine hotel - it is the people who ork their that make the difference.", "title": "The Good , the bad and the ugly", "user": "Taru D", "date": "July 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 167323163}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "So, This review is coming quite late. but I just had to do it.", "title": "Please remodel", "user": "shefpat", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 1.0, "location": 5.0}, "id": 167068789}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "I have stayed in ITC Maratha a number of times in the past year. Thanks to my husband's platinum membership , we get a lot of free nights over there.", "title": "Disappointing Stay", "user": "Del_Cuore", "date": "July 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 166678906}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Although most of my stays have been extremely pleasant. This one time I was so disappointed that I really wanted to voice it out.", "title": "Fantastic", "user": "mencoh", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166595696}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "Halted briefly (15 Hours), in between flights at this very conveniently located hotel near the airport. It had the trademark stamp of warmth and hospitality of ITC hotels, written all over, from the airport pickup to the airport drop and everything in between. The ITC One rooms are well appointed and reek of comfort with luxury. The staff are attentive and caring and every detail was looked into. Both the Resident Manager and the Duty Manager took personal interest in making me feel at home. There are several restaurants that cater to your taste buds and the ambiance just adds to your your feeling of comfort. Had lunch at the All-Day dining restaurant...a bit mediocre in service and food taste, but the Pan-Asian restaurant at dinner was very charming, great service and food. All in all, a satisfying experience.", "title": "Another Memorable stay", "user": "Parvez K", "date": "July 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168800589}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "together with my wife, we went to four days of leave which is true enough but it is always something that we got a large room with a bathroom clean and nice, I really liked how cool it is and atmospheric, the food delicious and the price average, location is ok internet access and telephone , the room is a large window with a nice view, I recommend", "title": "i like it", "user": "oleczek1", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168579657}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "this was non official stay with family", "title": "SUPER AWESOME", "user": "Deepakamarnani", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168542043}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "great property to stay", "title": "Bad Service in a very elite place", "user": "Sachin196", "date": "July 22, 2013", "detail_rating": {"value": 2.0, "service": 1.0}, "id": 168490316}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "well connected", "title": "Customer Delight", "user": "Tech_Evangelist", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 168480367}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I stayed here on business and found the hotel and room met all of my expectations. The location is very convenient to the airport which makes life easier on arrival and departure. The staff in the hotel were very friendly and helpful. I ate breakfast and lunch in the main hotel restaurant and found both to be of a very high standard. The hotel seems to be very well established and a bit of a local landmark. This is reflected in the style of the buildings and interior. It is not the most modern, but is in no way below standard - I disagree with some other reviews that suggest it needs refreshing. I would have no hesitation in returning. I ate in Dum Pukt restaurant in the hotel as well and have reviewed separately - a truly great meal and tastes of India.", "title": "Very pleasant oasis in Mumbai", "user": "Trav-london", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171180474}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I am not a stranger to ITC Maratha; my business takes me to Mumbai very often and I prefer to stay at Maratha all the time. During the last week of June I took my family with me and we stayed there. It is one of the most memorable trips to my family. Though the stay was short the entire family enjoyed the hospitality of ITC Maratha. Right from reservation to check in and check out the staff treated us very nicely. The children wanted to enjoy the swimming pool; unfortunately they didn’t carry the swim suits and were turned down from the pool. My special thanks to Ms Dinpuii who made it possible by arranging swim suits and ensured the children had good time at the pool. Thanks Ms Dinpuii for the wonderful time you had given to my children. I have to equally thank Ms Richa Gupta & Mr Swamy for arranging Spa at short notice and to Miss Priyanka for taking care of even the small things to make our stay very comfortable. My special thanks to Miss Aarthi Iyer for guiding us to choose the right restaurant in the hotel to suit us and giving us a good dining experience. It was a memorable stay; the rooms, the food and the hospitality and my family enjoyed every moment of our stay. Thank you Maratha.", "title": "A PLACE I WOULD LOVE TO STAY IN MUMBAI", "user": "Srijanakas", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170701257}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Srinivasan Sundar", "title": "Ladies and gentlemen serving ladies and gentlemen", "user": "Unnikrishnanraj", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 170643215}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Itc Maratha is truly a great experience starting right from the guest relation staff at checkin to the bell boy at check out. The staff is extremely courteous and they ensure you don't miss home at any point during the stay. The preferences made once is being noted and implemented the next time you check in. Food is tasty and the ambience is royal. Certainly a good hotel to stay especially for frequent travellers.", "title": "BHD", "user": "BHD1367", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170315619}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "I have been staying in this hotel for many years when i visite Mumbai becuase it is very close to International airport and my customers.", "title": "Awesome food", "helpfulness": 1, "user": "imswaminathan", "date": "August 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 170256068}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "During my last two visits to Mumbai in quick succession, I stayed at the ITC Maratha, which has always been my most preferred hotel in Mumbai. Though I have stayed here on many occasions earlier but a continued positive experience is compelling me to share my thoughts with other frequent travelers. As they say – “Better late than never”. Apart from the convenience of access from both international and domestic airports and from business perspective, what keeps me bringing back to this hotel is the warmth, hospitality, friendliness, positive approach and professionalism of the staff. From the reception at the airport to the check-in to stay to check-out, the procedures are so seamless and there is always someone from the guest relations who reaches out to you with a genuine smile and concern to know as to how the stay is and what they can do to make it more comfortable. You get a feeling of being a “wanted guest” and not just “a guest”. I do not know whether it is appropriate or not but I cannot resist myself in extending my special compliments to one of the guest relations executive Ms Aarthi who is a very pleasant personality and made me feel like a wanted guest taking care of even the smallest issue. I also observed her interacting with several guests at the same time so that none felt neglected and I have no hesitation is crowning her as the “face of ITC Maratha”. The other staff as well be it at the concierge or the atrium coffee shop or the Durbaan at the entrance, are all warm and genteel. As for the food, I have tried all their restaurants which offer you different cuisines to suit your taste and liking and the staff and chefs make sure that you don’t miss home food. The rooms are very well furnished and cater for all the needs. I must also compliment the senior management and the senior leadership of the hotel for training their staff so professionally and setting such higher standards of excellence. For me personally ITC Maratha is a “Home away from Home”……Col Mahendra Sehgal", "title": "Home Away from Home", "user": "Mahendra S", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170239872}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "The hotel is practically right next door to the airport as it took me less than 10mins to get to the hotel.Lobby wasnt big like the other bigger chain hotels and it had a homely feel to it.Lots of staffs around to assist people.", "title": "Comfortable convenient excellant staffs", "user": "AsianWorldTraveller", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 169815388}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "Nice lobby cafe just behind the lift lobby where you can have a lovely buffet breakfast with a wide range of western and indian cuisine.Once you get of onto your floor you will need to take a few seconds to get your bearings as there are many long corridors which to take to your room.Huge atrium looking down to the cafe.", "title": "Till now my best experience", "user": "DjVas", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 169806970}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Room was spacious and clean with all the amenities that you can find in a 5star hotel.Nice king size comfy bed.Bathroom had a his and hers sink and separate bathtub and shower.Nice small spray bottles of aromatheraphy placed on the bed.", "title": "Excellent", "user": "prill0", "date": "July 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 169350418}, {"rating": 4.0, "title": "Nice place...", "text": "As it was late when i checked in i ordered the chicken tikka maratha from room service and it was really very delicious.This hotel is very generous with free mineral water bottles.There were 4 bottles in my room and with the order of room service another bottle.No other hotel that i have stayed provides this.", "user": "Bigtoys76", "date": "July 27, 2013", "id": 169258908}], "location": {"country": "India", "region": "Maharashtra", "continent": "Asia", "city": "Mumbai (Bombay)"}, "stars": 5, "variance": {"poor": 13, "average": 60, "very good": 209, "terrible": 10, "excellent": 422}, "aka": "Itc Maratha, Mumbai Hotel", "slim_ranking": 0.0246575342466, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "ITC Maratha is one of the leading 5 star deluxe hotels in Mumbai, the commercial capital and dream city of India. The highlight of the hotel is its architecture and interior spaces. 1.75 lakh sq feet of stone, each hand carved has been used for its cladding and pillars patterned on the 18th and 19th century. The interiors are muted and subtle, with elements of both Victorian as well as Maharashtrian inspiration. It is in close proximity to the bustling business districts of north and central Mumbai, the NSE Exhibition Centre, and is a short distance from Film City, the Bombay Museum, and Borivili National Park. In addition, The Maratha is only a stone throw from the airport (2 km from the international terminal and 5 km from the domestic terminal) making it convenient for the transit traveller."}