{"review_count": 612, "slim_ranking": 7.0, "name": "Ivan's Bar & Restaurant At Catcha Falling Star Hotel", "reviews": [{"rating": 4.0, "title": "A delightful romantic meal under the stars", "text": "We considered doing the Night of 100 Candles but in the end we booked a table on the patio overlooking the water. I would recommend arriving closer to 5pm then we did as you will catch a beautiful sunset. We tend to find ot hard to get off the beach so early so arrived closer to 830 when it was already dark. I was disappointed with our table considering we had booked a month early and then followed up when we arrived in Negril. Make sure you are specific when booking a table and request one of the more romantic settings overlooking the water. We enjoyed the food, atmosphere and service. Especially the cocktails, lobster thermidor and the curry dishes.", "helpfulness": 1, "user": "yyz_kat", "date": "June 11, 2013", "id": 163701606}, {"rating": 4.0, "title": "Ambiance", "text": "We had dinner here. This restaurant is all about the ambiance. Our table was over looking the beach. There is also a table that sits treetop. If possible, reserve that table. It was absolutely beautiful. Then there's the 100 candle table. We counted, and there were actually 100 candles.", "helpfulness": 1, "user": "dkvacation", "date": "June 11, 2013", "id": 163673051}, {"rating": 1.0, "title": "Very disappointed", "text": "The food was good but not the best we had in Negril.", "helpfulness": 1, "user": "Rissa0713", "date": "June 10, 2013", "id": 163582488}, {"rating": 4.0, "stay_parameters": "Visited June 2013", "text": "Several people suggested Ivan's from our hotel so we went for dinner one night - although the service was good I would not recommend visiting. The quality of the food was poor, and it was not reflective of the Jamaican cuisine we were hoping for. Very disappointing", "title": "great views and good food", "helpfulness": 2, "user": "lizingb", "date": "June 8, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 163349642}, {"rating": 5.0, "stay_parameters": "Visited May 2013", "text": "My friend and I travel every year to Jamaica and one of our only negatives is finding restaurants that we both love. My friend has a more limited dining range than myself so we're always looking for places that she feels comfortable too. Ivan's Bar does this. She had the Jerk chicken skewer (which they will do in mild to hot). I had the mushroom chicken, Both were very good and you can't beat the views.We were not staying at Catcha so you can only do dinner after 5 pm.", "title": "Great Ambience", "helpfulness": 1, "user": "travellinggirl014", "date": "June 7, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 163297717}, {"rating": 5.0, "title": "Always first class with friendly smiles", "text": "Spent another 10 days at Catcha this time for our wedding, we had 32 guest there with us that should tell you how much confidence I have in the staff and food at Ivan's. check out my other reviews for the resort also top notch. It is the staff and the food that totally make Ivan's, the atmosphere and the view are the best. The food for our reception was delicious and we also enjoyed meals there on 3 other nights. Our favorites are the Eye of the hurricane and the Jerk chicken penne pasta. The staff are so friendly and the bar staff have plenty of smiles, songs, and great drinks. I write a lot of reviews and I try to be as honest as I can good or bad. I don't prop places up that don't deserve it and I don't rate them down for spite. I'm giving it to you straight and the word on Ivan's is nothing but good! Get there early enjoy the sunset, losses up,with a drink at the bar, then have a great meal. Make sure to hit the bar again for lots of fun later. There is a reason this place is rated well consistently, a reason the local business men make it. Place for a good drink, and a reason that you might catch the occasional Jamaican celeb. But don't take my words on that get to Ivan's and enjoy it first hand.", "helpfulness": 1, "user": "MJarman", "date": "May 26, 2013", "id": 161940249}, {"rating": 5.0, "title": "Excellent food and excellent view", "text": "We found the food at Ivan's are definitely the best on the island. We had meals at Ivan's a couple of times during our vacation. They were consistently good. They gave free soup which also tastes very delicious. I would definitely recommend it to anyone who is travelling or is going to travel to Jamaica.", "helpfulness": 1, "user": "Emilaki", "date": "May 25, 2013", "id": 161837540}, {"rating": 4.0, "title": "Ok food, but great atmosphere.", "text": "Ate here twice and unfortunately the main courses we had were mediocre at best. Now it might be because of a bad night or wrong choice of dish, but their are much better choices eating at one of the jerk shacks. If you are eating here I would highly recommend the flambé and catcha conch. Absolutely to die for,unbeknownst to us at the time but Jamaicans can do miraculous things with conch!", "user": "patterd7", "date": "May 25, 2013", "id": 161753934}, {"rating": 4.0, "title": "Great food, but iffy service, mon. Don't arrive hungry.", "text": "The ambiance is amazing! Get there for sunset from high above the ocean on top of the cliffs. At night the little white twinkly lights and rustic setting make for a very romantic scene.", "user": "First_Timer_Mon", "date": "May 24, 2013", "id": 161660803}, {"rating": 5.0, "stay_parameters": "Visited May 2013", "text": "We hired a van service with three other couples from our resort so sampled a wide variety of their great wines and food.", "title": "Great place.", "helpfulness": 1, "user": "Jennifer K", "date": "May 20, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 161281490}, {"rating": 5.0, "stay_parameters": "Visited November 2011", "text": "Food, excellent. Service, excellent. View/atmosphere.... Wow. We stayed a bit down the road in a different resort, and ate here a few times on our last stay. Each night, the menu offered something different, and plenty of variety to keep an adventurous eater like myself happy. Drinks were not watered down, portions were good sized, but not ridiculous, desert was very good (This is not always the case in Jamaica in my experience). This is a cliffside resort, and has among the best views of the sunset possible. Between that, the waves against the rocks, and just the general feel of the place, it was alomst surreal. After multiple trips to the island, I will honestly say this is my hands down favorite place to eat.", "title": "Not one single thing to complain about.", "helpfulness": 1, "user": "Hussyband", "date": "June 3, 2012", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 131198348}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "Prices are reasonable. It was about $60/couple with drinks and tip. Not exorbitant, and very well worth the $$.", "title": "Best place for a very romantic dinner", "user": "FExSTEVE", "date": "June 1, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 131104850}, {"rating": 5.0, "title": "Best food we had in Negril", "text": "Small piece of Jamaica culture for you as well... Every night, ~ 7pm, the peanut man was either at the gate, or headed just down the road from the resort. It was sort of neat to buy freshly roasted peanuts from the cart after dinner. You'll hear him coming for about 5 minutes before he gets there if you are looking to buy.", "user": "Lautrev", "date": "May 29, 2012", "id": 130867392}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "just got back from another amazing trip to Jamaica. My husband and I were looking for a good place to celebrate our 14yr Anniversary and somewhere outside our resort. Im so glad we did. And now we have a new place to stay next yr. The pumpkin soup was very savory and delicious. Everything was superb, including the service which was a very welcome change from the all inclusive we stayed at. if your a romantic like Me dont pass Ivan's up.", "title": "Great place to enjoy the beautiful setting.", "user": "jahyellowbird", "date": "May 29, 2012", "detail_rating": {"value": 5.0, "service": 4.0}, "id": 130856945}, {"rating": 5.0, "stay_parameters": "Visited April 2012", "text": "Great meals. Perhaps a few dollars more than other places, but worth it. Fantastic view. Friendly staff.", "title": "IVANS: Finally a vacation restaurant/bar that lives up to the hype!", "helpfulness": 1, "user": "gerry123", "date": "May 28, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 130822430}, {"rating": 3.0, "title": "AWESOME VIEWS, food okay..", "text": "This place has some of the best views I have ever seen! The grounds are equally as beautiful. It is a must see! We went for drinks and got an appetizer. The drinks were okay and the appetizer was a little disappointing. The bartender waited on us and he was friendly. I would return again for a drink or two and to see the AMAZING view but I wouldnt eat there, The entrees were super pricey too.", "user": "JacqAsh81", "date": "June 5, 2013", "id": 163134163}, {"rating": 4.0, "stay_parameters": "Visited May 2013", "text": "Ivan's has a wonderful sunset view across the water. We had no trouble getting a table close to the water (it was low season).", "title": "Great view, delicious food", "helpfulness": 1, "user": "SteelCityCouple", "date": "June 1, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 162637266}, {"rating": 5.0, "title": "what a view... Did I mention the food ???", "text": "The shared appetizer was delicious; every bite was happiness. The meal seemed to take a long time to arrive, and when it did, the appetizer had blunted our appetite. The portions are generous - we should have shared a single main dish, and that would have been plenty.", "helpfulness": 3, "user": "Mikeyups", "date": "May 29, 2013", "id": 162370584}, {"rating": 5.0, "stay_parameters": "Visited May 2013", "text": "The service was attentive (they can't pull dishes out of the kitchen until they're ready).", "title": "Ivan's - Ambiance is an A-Plus... We'll be Back", "helpfulness": 1, "user": "SSWinSJCA", "date": "May 29, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 162298161}, {"rating": 5.0, "stay_parameters": "Visited May 2013", "text": "The decor is fairly plain - a lot of concrete - but the sky and the sea and the view of the cliffs more than compensate.", "title": "Wonderful last dinner in Negril", "helpfulness": 1, "user": "mmiller001", "date": "May 27, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 161981772}, {"rating": 5.0, "title": "Great dining", "text": "Amazing cocktails with fresh juices, entrees were amazing along with the desserts.", "user": "randykushner", "date": "May 28, 2012", "id": 130815697}, {"rating": 5.0, "title": "Very good", "text": "My husband and I went to Ivan's twice for dinner and each time it did not disappoint. The food was delicious and reasonably priced for the type of dinner you are choosing to eat. We were visiting Negril during the slow time, so we did not have reservations either time and chose the time we wanted to eat The location and views are amazing and we enjoyed wine and dinner as we watched the sun set.", "user": "Amy B", "date": "May 28, 2012", "id": 130807525}, {"rating": 5.0, "title": "so good!", "text": "2nd time and still just as good. Didn't have reservations, but they got us right in with a beautiful table. Husband had the papaya boat with snapper and I had the mahi mahi. All was delicious. Cant wait to go back!", "user": "Strongs", "date": "May 28, 2012", "id": 130713301}, {"rating": 4.0, "title": "Very nice", "text": "My husband and I went there for dinner. It was a fantastic atmosphere. We felt like we were there by ourselves because of how the seating is set up. We had the jerk trio appetizer was good, we especially liked the conch.", "helpfulness": 1, "user": "josunMn", "date": "May 26, 2012", "detail_rating": {"value": 4.0, "service": 3.0}, "id": 130646826}, {"rating": 4.0, "title": "Great food", "text": "For dinner we both had the jerk chicken pasta and it was very good but very spicy.", "user": "AlbaT1", "date": "May 25, 2012", "id": 130556905}, {"rating": 5.0, "title": "Great Views and Even Better Food!!!", "text": "The staff was friendly, the views incredible, and the food FANTASTIC. We went as a party of 12 and EVERYONE absolutely LOVED their food. Only a couple addresses down from the famed Rick's Cafe, offering many of same (non-partying) amenities as Rick's Cafe...including sunset, cliffs, pools, and loungers...but with food experience that was unrivaled. DEFINITELY GO...", "user": "Harvey-Priscilla", "date": "May 20, 2012", "id": 130298030}, {"rating": 5.0, "title": "Great", "text": "A group of 12 went for dinner and were taken care of so well!! The food was fantastic. The views are to die for. Can't wait to return", "user": "sheila_mike", "date": "May 20, 2012", "id": 130269097}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "My husband and I ate at Ivan's on our last night in Negril with two other friends of ours. We loved everything about this place from the views, to the service, atmosphere and of course the food. We also couldnt have asked for a better table, the view of the sunset was unreal and so beautiful. We ordered the trio appetizer platter along with the pineapple chicken dish and mango chicken dish. They were both super tasty. This place is by far a better alternative than going to Ricks and you get the same view and way better food and a more authentic Jamaican experience.", "title": "Great way to end our stay in Negril", "user": "TravelSabs", "date": "May 18, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 130191938}, {"rating": 4.0, "title": "Beautiful view!", "text": "If you are in Negril and want to see the cliff's and have a great meal do not hesitate to check out Ivan's.", "user": "HeatherThurber", "date": "May 18, 2012", "id": 130183381}, {"rating": 5.0, "title": "Lovely dinner", "text": "We booked our reservation dinner at Ivan's and were treated like rock stars! We were given the best table in the house with a gorgeous view of the sunset! ( table six) our waitress had decorated the table beautifully with sea glass, shells, and twelve candles for every year we'd been married.", "user": "Debra S", "date": "May 18, 2012", "id": 130167935}, {"rating": 4.0, "stay_parameters": "Visited May 2012", "text": "My wife and I visited this restaurant during our honeymoon in Negril, Jamaica.", "title": "Good food, good dessert, good atmosphere", "helpfulness": 1, "user": "Zionite86", "date": "May 24, 2012", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 130500533}, {"rating": 5.0, "title": "Outstanding!!!", "text": "The views and the atmosphere are great. The main meal was ok, but not brilliant. The dessert was actually my favourite part of the meal- I had the peanut butter frozen cheesecake. I'd say it was my second favourite dessert during our stay in Jamaica.", "user": "AnotherRealm", "date": "May 23, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 130495307}, {"rating": 5.0, "stay_parameters": "Visited May 2012", "text": "The service was good and the experience was enjoyable overall.", "title": "Excellent food, service & of course the view", "user": "jacksgarden", "date": "May 23, 2012", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 130490570}, {"rating": 3.0, "stay_parameters": "Visited May 2012", "text": "We probably wouldn't visit this place more than once, but it was still a nice dinner out. Thanks to the staff and chefs!!", "title": "Vibe Trumps Food, But Vibe Alone May Be Worth It!", "helpfulness": 1, "user": "fashionistamommy", "date": "May 23, 2012", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 130484670}, {"rating": 4.0, "stay_parameters": "Visited May 2012", "text": "First time venturing out of Negril on this trip to Jamaica. Heard someone at our hotel talking about it and decided to try it. WOW, am I glad we did. The food was fantastic, the service was top-notch, and the view is simply breathtaking!!! Definitely want to be here before sundown for some of the best sunsets in Jamaica!!", "title": "Great Flavor", "user": "Carla_Michigan", "date": "May 22, 2012", "detail_rating": {"value": 3.0, "service": 4.0}, "id": 130396865}, {"rating": 4.0, "stay_parameters": "Visited May 2013", "text": "We had special reservations and a lovely table off to the side at Ivans. Just a word to the wise, these were higher chairs and you have to climb into them (little awkward with my sun dress). Beautiful view, a few mosquitos though.", "title": "Nice Anniversary Dinner at Ivans", "user": "jodi_123", "date": "June 24, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 165081372}, {"rating": 4.0, "stay_parameters": "Visited February 2013", "text": "We had a conch appetizer that was really, really good. Then my DH had a nice seafood curry and I had the Jerk Chicken Pasta. The curry was great. The pasta was really spicy. I had asked for it really spicy and they can spice it up! It would have been nice to have a few veggies thrown in the pasta dish, it was all pasta, sauce and chicken. Or some bread or something with it to cool the heat.", "title": "Ivans is all about location the outside tables are great if not too windy.", "user": "Kelly D", "date": "June 23, 2013", "detail_rating": {"value": 4.0, "service": 3.0}, "id": 164964571}, {"rating": 4.0, "title": "Great views, very good food", "text": "Service was stellar. No island time, spot on and attentive.", "user": "Wally K", "date": "June 23, 2013", "id": 164961394}, {"rating": 5.0, "stay_parameters": "Visited June 2013", "text": "Really a good place for a special dinner and beautiful surroundings. Take some time to come early and enjoy a walk around the gardens/cliffs.", "title": "A must for a romantic dinner", "helpfulness": 3, "user": "Bill B", "date": "June 13, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 163900842}, {"rating": 4.0, "stay_parameters": "Visited May 2013", "text": "The bar and candlight tables make this worth coming to. I did not think it was the best food I ever ate in Jamaica over the years of going there but the snapper was great! It is nice spot for a nice dinner out while in Negril. The bar staff and great. I loved flipping through the photo albums and hearing @ the history of the rebuild post Ivan.", "title": "An after thought on Ivan's upon my second visit two months later", "helpfulness": 2, "user": "Kmoore", "date": "June 12, 2013", "detail_rating": {"value": 3.0, "service": 5.0}, "id": 163799404}], "location": {"country": "Caribbean"}, "variance": {"poor": 9, "average": 32, "very good": 135, "terrible": 4, "excellent": 432}}