{"review_count": 47, "slim_ranking": 163.0, "name": "Ivanhoe Hotel", "reviews": [{"rating": 1.0, "title": "over priced basic food and drinks", "text": "over charged on the food, nice pub but get real and serve decent pies, and put meat inside the pastry.", "helpfulness": 2, "user": "ToonGrimreaper", "date": "April 9, 2012", "id": 127556550}, {"rating": 5.0, "stay_parameters": "Visited September 2011", "text": "Called about lunchtime. Had a glass of beer and sandwiches. well priced and tasty.", "title": "A very nice Hotel and well priced food", "user": "holtbob2", "date": "September 25, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 118582988}, {"rating": 4.0, "stay_parameters": "Visited August 2011", "text": "Had seen the restaurant going to the sealife centre, so went with friends and family a couple of nights later. Had a steak night on. Food was very good and staff very friendly and helpful. New owner and he's having it refurbished. Seems like he's doing a good job. My two criticisms are that we were seated separately (9 in our party) right next to a leaking window (part of the refurb to do). and that my steak and ale pie was a bit salty. Were given complimentary onion rings and mushrooms to start and my only thought for that was due to the separate tables. Will go again.", "title": "Enjoyable", "user": "Christa92", "date": "August 29, 2011", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 117406612}, {"rating": 2.0, "title": "What a con!!", "text": "I have visted the Ivanhoe for many years with my children and was pleased with the food, service and cleanliness of the pub. However, my recent visit to the Ivanhoe was a complete disaster. The main reason why my last visit was a disastor is because there is nothing for the children to play with. Before the new owners took over there were toys to for the children to play with in the conservatory and a play bus in the car park but now these facilities had been removed; which i can assure on this it is a huge mistake. The young women behind the bar that stated she was the \"manageress\" said that we couldn't sit in the conservatory as it was too cold! After these diasapointments i decided to order the 'Fresh fish of the day cooked in their home made batter' so the menu stated. Due to my fondness of fish i knew that the fish i recieved on a plate that was to small for the food to fit on was not actually fresh and it certainly was not cooked in home made batter. For the price i paid for the meal i atleast expected to receive the meal stated on the menu!! My 6 year old decided to oder the so called 'fish stars'. However, the fist stars were more like mash potatoe in bread crumbs. All in all a told waste of money and i will NOT be revisiting the Ivanhoe Hotel again!", "helpfulness": 1, "user": "anonymous3606", "date": "January 18, 2011", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 93632375}, {"rating": 4.0, "title": "Menu Choice", "text": "Very good choice including the specials, nicely served, hot and delicious food. Pleasant atmosphere, cheery staff.", "user": "marabooka", "date": "August 5, 2012", "id": 136266844}, {"rating": 2.0, "stay_parameters": "Visited July 2012", "text": "We used to stay in the Ivanhoe every time we visited Scarborough and booked in this time with our 2 children remembering how child friendly the place was.", "title": "Not like it used to be!", "user": "S V", "date": "July 24, 2012", "detail_rating": {"value": 3.0, "service": 3.0}, "id": 135270841}, {"rating": 1.0, "title": "worst food ever experienced", "text": "How wrong were we!, the fun bus and kids play areas have all been removed and replaced with an area full of animals all caged in with dangerous netting with sharp edges, untidy gardens and rubbish bags everywhere.", "helpfulness": 2, "user": "lynne s", "date": "July 1, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 133152607}, {"rating": 1.0, "title": "BE WARNED", "text": "We booked a family room and where advised on arrival that a member of staff had made an error with our booking and undercharged us, then the manager firmly reprimanded the member of staff in our presence and said she wouldnt charge us any extra as though she was doing us a favour! (very unprofessional)", "helpfulness": 3, "user": "xxzzxxzz", "date": "April 24, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 128551653}, {"rating": 1.0, "title": "STAY AWAY", "text": "We were shown to our family room which was very small with a double, single and a small spot for us to place our travel cot, and a bathroom with no bath just a shower, which is not very good with small children, a family room it was not :(", "helpfulness": 2, "user": "Sizzli", "date": "April 23, 2012", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 128466486}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 5, "average": 4, "very good": 16, "terrible": 11, "excellent": 11}}