{"user_rating": 4.5, "review_count": 664, "name": "JA Oasis Beach Tower Apartments", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I spent 4 nights in OBT and was thoroughly satisfied! I traveled with my wife, son and my parents. Before even arriving, I had a lot of interaction with the reservations staff as I was expecting a FedEx package delivered before I would have arrived. The service was outstanding and I was reassured that everything would be handled. First thumbs up here for Ms. Merry - fantastic individual, who knew just how to help her guests. Merry accepted the package on our behalf and even paid the duty that had to be paid, all without even knowing who I was - that is very commendable. Although she was off when we arrived, we made it a point to see her before we left and she was just as pleasant in person.", "title": "Amazing customer service and awesome location", "user": "Mohammed B", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 157288831}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "When we arrived, we were greeted by Kim at the reception desk who was a pleasure during the check in process. Very courteous and very friendly. During check in, Mr. Mohammad Naeem came and talked to us and proceeded to upgrade us to a larger room overlooking the water, without saying anything - with a continuous smile.", "title": "Oasis Beach Tower Review April 2013", "helpfulness": 1, "user": "Unali", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157281378}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The apartment was very large and airy. There was a full service kitchen, 2.5bathrooms and even a small laundry room. The french windows in the living room were excellent, and we were able to open the doors and walk out onto a small balcony overlooking JBW. The furniture was a bit on the old side in the living room, but it was comfortable. The bedrooms didn't have anything especially wow but they were good for a comfortable sleep.", "title": "Our choice in Dubai", "helpfulness": 3, "user": "Ske443", "date": "April 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 156624352}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The breakfast was very good and all of us thoroughly enjoyed it, much more thanks to Katherine who looked after us every morning, making sure we had everything we needed, especially with a 2 year old.", "title": "Oasis Beach Tower Apartments", "helpfulness": 2, "user": "Ann M", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156575115}, {"rating": 5.0, "title": "Excellent Quality Accommodation", "text": "The location is perfect - you take the elevator right on to JBW. You feel like you're in Europe somewhere with cobble stone streets and eateries to satisfy every person's palette. There are many shops along this corridor as well and we spent a few evenings just walking on the drag and enjoyed people watching while sipping on coffee.", "helpfulness": 1, "user": "JARED M", "date": "April 3, 2013", "id": 156519742}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We stayed at a two bedroom apartment with three little kids. The apartment bedrooms were very spacious and modern. The bathrooms both had bathtubs with the master bathroom having a shower as well. The apartment had high quality amenities and fixtures along with good toiletries in the bathrooms ( Sage and Peppermint shower gel).The kitchen had all the basics, coffee makers, oven, microwave, dishwasher, washing machine and dryer. There was even a \"mud room\" to wash sand off from the beach. The location was fantastic, just a short walk to the beach, the restaurants and cafes. The rooms all had wifi in it. The only downside was that the two bedrooms (unlike the pictures) did not have any direct view of the ocean. The living room and bedrooms face the back of other hotels and buildings, Staff were friendly and the heated pool was great particularly for families with smaller children. Overall a good place to stay at Jumeriah in Dubai.", "title": "Great Location with Quality Rooms!", "user": "Georgas9", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 157774767}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Hi, I have just recently come back from a 10 night stat at OBT. This was my second visit with the first being with my friends last year. The service is top class. I need to thank all in particular Syed from reception, Risper from house keeping and all the team in the concierge. I am for sure looking forward to my trip again in the future staying again at the OBT.", "title": "Great Family holiday", "user": "Imran K", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157771189}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Great hotel, great location. Very nice especially when you are with a large group. Large rooms, great living area, large kitchen, excellent view, friendly staff and everything you need close by. When the room is not ready at check in you can go the waiting area where there are drinks and snack or go outside because you are on \"the Walk\". The only thing is that the reception is not at the front so when you visited the hotel for the first time it's a little bit confusing. They don't have valid parking but you can leave the car at the front so you can check in and then drive the car to the parking garage under the hotel.", "title": "Love it!", "user": "Seeandenjoy", "date": "April 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157656935}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We've stayed for three nights at this hotel, at the 41st floor. The appartment was fabulous (huge), and the view very nice, even if it wasn't on the see as we were expecting. The breakfast was excellent as well. The problem is at the end of our stay our bin was completely full, and lots of sand on the floor. No cleaning at all during the day (even if we were out all day ). The cleaning lady came every time after we've arrived and asked if we needed something. Of course you don't want the appartment to be cleaned while you are inside, so we've just asked for the towels. The first day it was surprising, the second day it was annoying. But it was our last day and we didn't make any remarks. We've asked for some sandwiches for the last morning since we had to quit the hotel at 6am. It was impossible, even if we were premium guests (I still don't know what they mean with premium, we haven't seen the lounge since we were not informed before the check-out). We've asked for a taxi for our arrival, we didn't get any confirmation, so we took a taxi and arrived at the hotel. They called 30 minutes afterwards to say the hotel shuttle was waiting for us at the airport since the transfer was included. We've asked for the shuttle to leave on the last day. One lady said no problem, another guy said we have to pay like 280 dirhams. The guy never called back. Luckily the lady confirmed us the shuttle and we had it. The person who was supposed to come to pick our luggage and bring them to the shuttle just called at the precise time when we were expecting him and asked if we needed assistance ! So we took our five luggages and hurried to the lift. We had the shuttle and the driver confirmed he expected us at the airport at the arrival, he said the job of the coordinator was not briliant at all !", "title": "Fabulous building, poor service", "user": "Nicole S", "date": "April 13, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 157629598}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We have just returned from the Oasis Beach Apartments in Dubai, we are a family of 5 & stayed in a 2 bedrooms apartment and cannot recommend it highly enough!! The apartment itself was out of this world! Huge, all the amenities you could ever need, beautifully equipped and cleaned until spotless every day!!", "title": "Wonderful accommodation!!!", "helpfulness": 1, "user": "rosefam6", "date": "April 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157494854}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I write this review while staying at this property. Our planned stay is for 4 nights and today is the last day of stay, due to check-out tomorrow.", "title": "Luxurious apartments!", "helpfulness": 3, "user": "Parag J", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161232777}, {"rating": 5.0, "title": "Outstanding", "text": "Our 3BR Superior Apartment is very spacious with lavishly spaced master bedroom and bathroom. All bedrooms ensuite is a big advantage. There is no queuing up pressure on other bathrooms. An extra powder room provided in living room for a \"quick last-moment visit to the loo\".", "helpfulness": 3, "user": "Duncan_mcdermid", "date": "May 13, 2013", "id": 160518714}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Fully equipped kitchen with cooktop, oven, microwave, Lavazza espresso-maker. A starter kit is provided for first day that includes 2 packs of SanRemo pasta, bread loaf, milk, butter, fruit yogurt, pack of 6 eggs, Ceres Juice, Lavaazza Espresso capsules and unlimited supply of tea, coffee and water. That's plenty of stuff and if you want more, a mini supermarket in the same premises.", "title": "Excellent stay", "user": "Nicefollow", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160288677}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Location.......Wow.....right on JBR walk, in the middle of hundreds of shops, restaurants and cafes with al-fresco services. For Indian vegetarians, Sukh Sagar of Mumbai just one block away and I must say, South Indian fare is a lot better than what they serve in Mumbai.", "title": "Excellent stay", "user": "Nicefollow", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159901016}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Breakfast spread is huge with lots of choice between international fare, mezze etc. Having been pampered with fairly extensive Indian fare at Moevenpick Bur Dubai and at Millennium Abu Dhabi, here we got only fried rice with same vegetarian curry all the days. No rotation of menu here. This is despite so many Indian families staying here at any point of time. Having stated that, this is the only minus for Indians.", "title": "Gorgeous! For family, for friends, for everyone!", "user": "Alevtina_Sh", "date": "May 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159867742}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "I have just returned from a fabulous holiday in Dubai , we stayed 6 nights at this hotel and it was brilliant. On arrival , we recieved outstanding service, having arrived early about 9 am we were offered a choice of apartments, either one on the 30th floor with a balcony or one on the 40th+ floor with more spectacular views. We opted for the views and had an apartment on the 42nd floor. The apartments themselves are beautiful clean, and so spacious. We had a two bed apartment and we actual had 4 bathrooms We had fabulous views over the Palm and the Arabian Gulf.. The kitchen included a small selection of starter groceries , excellent for just having been on a night flight and it included, tea, coffee, milk, jam and cereals. The kitchen was well equipt with all the right thing you should find in an apartment including non stick pans. There was even a washer/dryer and ironing board and iron. The apartments also have very high standards of appliances and general crockery, the china was Villeroy and Bosch. You were also given two complimentary bottles of water everyday . The hotel has a free gym and a pool, on level 2, i used the pool which had very helpful staff, you can borrow toewls , beach mats and umbrellas for the beach. The hotel is situated on the walk and there are lots of places to eat and drink . Also near by is the Dubai Marina Mall which has a Waitrose and other english retailers. If you need a supermarket there is one in the mall next to the hotel and another on the upper level of the walk. The Hotel also provides shuttle buses to the Emitates Mall and the sister hotel. I would recommend a visit to the sister hotel as it has a private beach and was really nice with brilliant service. The public beach is just across the road and is really nice, lots of families and the sea is very clear. The hotel is really well situated, so close to the beach and with lots of cafes and restuarants , and there are some really nice markets in the evenings too. I cannot praise this hotel enough, everyone was so helpful and friendly , the service was exceptional and cannot wait for a return visit.", "title": "Fantastic Stay", "helpfulness": 2, "user": "Diwinny", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124865058}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "We spent 3 nights at Oasis Beach towers and did not want to leave. We were a group of 8 adults and totally enjoyed our 4 bedroom, 4 + 2 bath apt with a great view of the Arabian Gulf. Each bedroom had its own bath which worked out well for our group of 8 friends. It was better than having 4 individual hotel rooms since we had the very large living room, dining area and kitchen for socializing in our group. The staff at Oasis beach were wonderful- Galina was in touch with me months ahead of time. She was able to find out info on where we could watch camel race practices (a highlight of our tour around Dubai) and made dinner reservations for us at Mango Tree so we could watch the fountain show from our table. We were celebrating my 50th birthday and the hotel sent us a delicious chocolate mousse cake that was devoured by our group. The apt was very spacious and we were glad to have a balcony that overlooked the tourquoise Gulf. The front desk staff were very helpful and the hotel arranged for us to have a 12 seater van with driver for a day tour. We booked our desert safari with Arabian Adventures who have a desk in the hotel. The breakfast package in the apt came in handy since we did not have to waste time going to breakfast in the morning . We were able to buy more eggs at the grocery store in the bottom level of the building. We did not have time to use the pool but we hope to come back to this great hotel someday soon. We selected the hotel based on all the great trip advisor reviews.", "title": "fabulous stay at Oasis Beach Tower Apts", "helpfulness": 1, "user": "smgapp", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124614740}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Very good you get what you paied for,so if you are visitting dubai the oasis beach hotel is the best place to stay in. It's next to marina walk way (JBR). You'll see all sort of pepole cars and many other things. It's very nice to spend the night in that area. All you have to do is to get out off the hotel and you would find your self in the arab chansela. I mean it's amasining ( pard my bad spilling). Yes i would recomed it ver strongand good luck.", "title": "1", "user": "Ibrahim A", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124478679}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I am a Swedish Volvo employee who stayed 1.5 years in a 2-bedroom apartment at Oasis Beach Hotel in Dubai.", "title": "Great place for long-term stay", "user": "Peter R", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124341174}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The apartments are comfortable and spacious and offer great view over the Marina and Arabian Gulf, the Tower also features free gym with excellent view over the beach.", "title": "Simply The Best", "user": "Rumpelstielschen", "date": "February 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124245819}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We are an Italian couple who decided to move to Dubai for few months, in order to escape the European harsh winter. From the very beginning we were warmly welcomed and instantly felt at home. The apartments are comfortable and spacious and offer great view over the Marina and Arabian Gulf, the Tower also features free covered car park space which is certainly an added value considering that also most of the clients travel by car from other Emirates especially over the week end. Great location, easily accessible to the main attractions and personally since my wife and I are golfers is a bonus to reach the main golf clubs in approximately 20minutes. The Oasis Beach Tower also offers a great gym and pool area all this is complimented by friendly staff who always greet you with a warm smile and offer their assistance, especially Elena Giordano, Front Office Manager who constantly and punctually assist us from booking a car to, or booking a table in one of our favourite restaurants.", "title": "Fantastic place, great for either long and or short stay", "helpfulness": 1, "user": "Stefano M", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124139662}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "All in all I have no doubt in recommending this property.", "title": "Terrible reception service", "user": "Mansoor80", "date": "February 4, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 124098485}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "I was disappointed by the front desk sevice and the way they deal with customers. Very small front desk and employees very rude with customers. The rooms are perfect but the service experience is terrible. I advise the hotel to teach the employees especially front how to talk and deal with customers. I will really think again to come back.", "title": "Excellent location, stunning views, excellent hospitality but monotonous breakfast......", "user": "ardenttraveller108", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124061511}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "WE were a group of nine friends, visiting the OBT just last week. As everyone here in this forum, we too were taken by the stunning property. We were early for the check-in but were graciously offered the facilities of the premium lounge, including refreshments, from the moment we presented ourselves at the reception. The four bedroom premium apartment on the 36th floor was the perfect blend of coziness, comfort and spaciousness. Top this with the breathtaking ocean view, available from all the rooms, including the kitchen and the living area and you can not ask for anything more. It was a relaxing and invigorating stay for four days. There was a complimentary breakfast thrown in in the package. The breakfast, though filling and toothsome, was a bit of a spoilsport due to its complete and absolute repetitiveness. Day in and day out the same spread was presented without even an attempt to bring about variety. After the first couple of days, at least half of our group refused to comedown for breakfast, and made do with the snacks that we had carried from home. This small aberration notwithstanding, a memorable and enjoyable experience. The JBR walk itself makes you wonder whether you are in a gulf country or in some European town, with its cafe terraces, the exotic aroma of gourmet cuisine and exotic beauties with their never ending legs! Thumbs up!", "title": "One of the best hotels I have ever stayed in.", "helpfulness": 2, "user": "getmeabeer", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123881233}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Upon arrival we where told our room was not ready so was upgraded to a 3 bed room. That has breathtaking views. The fridge had been stocked with a selection of breakfast itimes free and there was a large bowl of fruit and sweet selection waiting in the living area.", "title": "Oasis beach Tower Apart Hotel Dubai", "helpfulness": 1, "user": "Gina080562", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123826551}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "four of us stayed in a two bedroom appartment ( one was on a wheelchair) from before we got there the communication was excellent , any questions I had were immediately replied and everything was done to make the appartment suitable for us ... The staff were extremely friendly and jovial.", "title": "Delightful", "user": "Amby786", "date": "April 22, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158436568}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "On arrival we got a complimentary tray with goodies that we would need along with bread, milk and eggs", "title": "2 NIGHTS STAY", "user": "Tofozzul R", "date": "April 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158321061}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Would most definitely stay here again., highly recommended , delightful", "title": "Great hotel to live in, very difficult to find", "user": "Shamel_Rashad", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158090191}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "my stay her for 2 nights with 5 friends her was an absolute highlight of our holiday in Dubai purely because of the excellent customer service provided especially by Erwin the duty manager, I could not fault a single thing. Upon arrival Erwin let me check in 3 hours prior to our check in time on top of that he gave us an upgrade suite from the 3 bedroom deluxe apartment to 3 bedroom premium apartment and such an amazing view. My only regret of our 2 night stay would be that there is construction going on right oposite the hotel which may block the view and every thursday, friday and saturday night there is allot of music coming from the meydan beach hotel oposite oasis which is a nuisance as it ruins the image of Dubai as this is a place not made for clubbing. Its a real shame as it is becoming more of clubbing scene on the JBR location. all in all I really really enjoyed our 2 night stay and all the construction and loud music has nothing to do with oasis and I shall be returning back next year. many thanks especially to Erwin", "title": "Great apartments in ideal location!", "helpfulness": 2, "user": "Ian W", "date": "April 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157921839}, {"rating": 3.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "I stayed for 3 nights at Oasis Beach Tower. The apartment was great, a 2 bedroom one with all the amenities one could ever need and can easily accommodate the 4 people it's meant to accommodate. The breakfast is also great, very good quality food to be found there. Service is very good, prompt and highly helpful personnel who did their best to make the stay enjoyable with optimum response time.", "title": "Great service just a few issues", "user": "Melanie F", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 157821700}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This is a great place for anyone new to Dubai -- located on the JBR (Jumeriah Beach Residence) Walk, it is just steps away from a variety of great restaurants, shops, and the beach. We had a spacious 2 bedroom apartment overlooking the gulf and marinara. The staff was very friendly and efficient and the entire property was spotless. Easy access to taxis and free transportation to the major malls. Highly recommended for an extended stay.", "title": "Wonderful Apartment Hotel", "helpfulness": 2, "user": "Bob R", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123454258}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Oasis beach tower beach is a very nice for family, I have two kids, we got two bed rooms in a high floor and we stayed for four nights, the appartment is well equiped with all what we needed. the breakfast was very nice and the atmospher in the resturant is freindly and we all loved it. The location is in the middle of JBR walk where if BF was not included in our room rate we could just walk and have it in any of the many resturants around. it has a nice swimming pool with warm water. definitly I will come back to this place in the coming years. the wifi is free and located in the living room only!", "title": "excellent apartments in the best location", "helpfulness": 2, "user": "Talal A", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123291905}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We have always stayed in a hotel when travelling to Dubai but on this occasion we booked Oasis Beach Tower and were not quite sure what to expect. We were pleasantly surprised when we checked in and we given an apartment on the 45th Floor with breathtaking views of the Jumeriah Beach. The Apartment was an extremely spacious 3 bedrooms with en suite bathroom for each room but an extra toilet and shower room. The family area was very large and didn't feel crowed as we had 4 adults and 2 children. We were given a welcome pack of food and drink when we arrived which was very much needed with hungry children.", "title": "Fabulous Stay - Highly Recommend", "helpfulness": 2, "user": "Rachel H", "date": "January 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123243526}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The staff were extremely professional, friendly and helpful. They always made sure we had a baby seat in our car when booking taxis. The pools are very nicely heated and perfect for small children and lots of sun loungers for parents to relax. There are lots of shaded areas as well which is needed with a small baby and they have a lifeguard/s on duty at all times. The beach is only a 5min walk away if you fancy a dip in the ocean....", "title": "excellent stopover", "helpfulness": 2, "user": "usandthe2kids", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123221316}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "We are converted as a family and will no longer stay in hotels in Dubai and will be returning to the Oasis Beach Tower very soon! We highly recommend you stay.", "title": "Stunning Everything!", "helpfulness": 3, "user": "Enchanted09", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123162775}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "Great upscale apartment hotel, extremely roomy and some of the most fantastic views of the Jumeira Palm. We stayed for New Years last year Dec2010/Jan2011 (please ignore the other date as the system did not go back that far) and were awed with the number and quality of fireworks we could see. And that is not all, you are steps from the beach and The Walk with a great selection of restaurants as well as the restaurants that form part of the hotel. 10 to 15 minute cab ride from Emirates Mall, Marina Mall, Wild Wadi, Atlantis, Medinat Jumeira Souk and Ibn Batutta Mall. If you are staying for a minimum of three nights, most definitely the place to stay. You are also 45 minutes away from Ferrari World in Abu Dhabi.", "title": "Location, location, location", "user": "GeorgeOMuscat", "date": "January 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123113186}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Really nice clean apartments in a great location right on the beach on JBR walk. We were there for a birthday celebration and eat @ Frankies next door which is highly recommended. Apartments are very modern and come with all mod cons you’d need. Each one has a balcony looking out to sea. Couple of issues though are 1. The pool rarely gets the sun as they have ‘cashed-in’ and built an office block which blocks the sun apart from maybe an hour or so and 2. We went out for dinner and came back to find our front door wide open!! After phoning reception they knew nothing of it and said there was nothing on the cctv either! Very strange but thankfully nothing was taken. We found the staff very average", "title": "decent clean full fitted apartments in great location", "user": "mheeaad", "date": "January 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123054580}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayedf for 8 days at the Oasis Beach Towers in Dec 2011. From check in by Tina and Nazim to check out we have nothing but compliments for all at Oasis Beach Towers. We were upgraded to a higher floor as requested. Views are fantastic and one can clearly see the Palms. Nothing was too much trouble. Rooms are as depicted on the website. Very spacious and 2 ensuites.The welcome pack of food essentials for breakfast was a nice surprise They even came at 11.30pm to open our safe after the kids had jammed the safe. We had a late flight and they allowed us the use of the pool and gym showers to freshen up prior to our drive to the airport. 24 hour supermarket is about a 5min walk and another supermarket which is open until midnight is a 2 min walk. The Metro is about a 15 min walk. Lots of restaurants are just outside the hotel. The lady at concierge (forgot her name) was extremely helpful as well with lots of practical tips of when to visit Ferrari World & Atlantis & how to get there.Complimentary wifi available in the multiple sky lounges within the hotel.The hotel also has complimentary bus shuttles to the Gold souk and popular shopping malls. We understand the shuttles to the malls are not operated by the hotel itself so these shuttles can be full by the time they get to Oasis Beach Tower. We also spent an enjoyable day at the sister property in Jebel Ali which has magnificent beaches and pools- real island holiday feel at the Jebel Ali resort. We will definitely recommend Oasis to our friends and will stay there again", "title": "Fantastic place to stay", "helpfulness": 1, "user": "SQU", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122960018}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We stayed the OBT (Oasis Beach Tower Apartments) for 5 nights this time and have stayed there once before approx 4 years ago. The apartments are still very high quality but the sum of the whole experience is not what it was.", "title": "Not as good second time around", "user": "Kevin H", "date": "January 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 122944497}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "At check-in we were asked to sign an inventory of the contents of the apartment kitchen, (crockery, cutlery etc), despite the fact that we had not even seen the room yet. I expressed some concern about this and the reception clerk then said he could give me a copy of the inventory, although I still had to sign it. Just as well because my wife checked the kitchen contents as soon as we got into our apartment and found several items missing.", "title": "Fantastic stay", "helpfulness": 2, "user": "CMR777_10", "date": "January 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122837515}], "location": {"country": "United Arab Emirates", "continent": "Middle East", "city": "Dubai"}, "stars": 5, "variance": {"poor": 10, "average": 22, "very good": 87, "terrible": 8, "excellent": 537}, "aka": "Oasis Beach Tower Apartments Hotel Dubai", "slim_ranking": 0.0213219616205, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "This sophisticated beachfront property with its iconic exterior, features 180 luxury serviced and self-catering apartments. The spacious apartments each have a fully equipped kitchen, living room and dining area plus 2, 3 or 4 ensuite bedrooms. Guests may enjoy stunning views over The Palm Jumeirah and Dubai Marina, restaurants, a swimming pool deck just steps from Jumeirah beach and access to the private beach at Jebel Ali Golf Resort."}