{"user_rating": 5.0, "review_count": 99, "name": "Jacaranda, studio & suite", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "It could not be in a best spot, a few blocks away from every attraction in the beautiful and pleasant Palermo. Jacaranda is small, just 3 apartments with different sizes: 2 studios for couples and a suite with 2 bedrooms, ideal for a couple and 2 children. Lilian and Alfonso, the owners, take care of every detail. There is no reception, they wait for you there and provide all the details, including vouchers for breakfast in a nice bistro near by. The place is clean and comfortable and it has all you need. They usually prefer to rent the apartments for longer periods of time, so you might not be able to book too much time in advance if you are planning to stay for just a couple of days. There is a computer connected to Internet in the lobby and wifi in the rooms. And also it is plenty of guide books on Buenos Aires attractions.", "title": "Excelent alternative in the heart of Palermo", "helpfulness": 1, "user": "Pianta", "date": "April 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127486078}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Charming place and charming host - Lilian and her lovely husband. Stayed 4 nights in the Suite. Very clean and comfortable. Excellent location close to everything you need. Fantastic value.", "title": "Charming stay in BA", "user": "TomekWu", "date": "March 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126360094}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "Thank you Lilian, we'll be back !", "title": "Why stay anywhere else?", "helpfulness": 1, "user": "trevorandfiona", "date": "March 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 125672755}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "I must confess at the outset that we have checked into Jacaranda five times in the past - whenever we are in Buenos Aires I will always stay there. Why? Because we think it is just about perfect.", "title": "Great location, best value in BA", "user": "ManchesterKimandDave", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123027405}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I have stayed in each of the three available apartments in this quiet leafy street in bohemian Palermo. All were lovely, clean and well equipped. The smallest, the Studio, has a reasonable - sized bedroom and a separate bathroom. The new Garden Suite (my favourite, if it is available!) has a large bedroom, excellent bathroom and private secluded patio garden. It is cleverly designed with a kitchenette in a cupboard. The largest apartment, the Suite, has a huge bedroom, a living room that can sleep more people, a mini kitchen and a large bathroom.", "title": "A Wonderful Place", "user": "PatricioNewYork", "date": "January 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122984804}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We stayed at the Jacaranda in January 2011 prior to boarding a cruise. Although Lilian was out of town, she and her staff were still able to meet all our needs. The Jacaranda is located in a safe neighborhood and you can easily walk to great restaurants, shops and galleries. It was nice having free internet service, using their computer in the hallway. We stayed in the ground floor studio, liked our \"kitchen\" facilities which allowed us the choice of dining in our private courtyard rather than going out. Only negative - it was hot and Americans tend to take lots of showers which require lots of towels. Problem easily solved - a Chinese laundry is 1 block away which provides same day service and is very inexpensive. We plan to return to Buenos Aires and will definitely try to stay at the Jacaranda again - a great place to come \"home\" to.", "title": "Quaint and Great", "user": "ElMur0", "date": "January 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122927152}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "As it was Christmas we treated ourselves to this little gem in a different area to where we stayed last year. We were slightly surprised that we had to sign a contract, but you need to view this as a studio apartment and not as a b&b.", "title": "Great apartment style accomodation", "user": "goodtogethome", "date": "January 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 122465799}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The ground floor studio was well designed, and Lilian the owner has certainly thought through exactly what you will need. A wardrobe door opens to reveal small sink, fridge, microwave, toaster and kettle. There are just enough plates and cutlery to enable you to have a small meal and the outside terrace made the whole area seem quite spacious. (Was somewhat surprised that the outside space is shared by the gallery, and the whole gallery overlooks the patio......so no sitting out in your jim jams or sunbathing naked).", "title": "Lovely apartment. Great location. Good value.", "helpfulness": 1, "user": "LostMyWander", "date": "December 16, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 121809661}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Lack of storage other than the area in the entrance hall meant you had to be quite tidy so as to be comfortable. The shower had its own boiler so water was always hot. Soap and shampoo were provided as was a hairdryer which was a bonus.", "title": "Plenty of good advice", "user": "AndrasP", "date": "December 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 121467194}, {"rating": 4.0, "stay_parameters": "Stayed November 2011", "text": "In the entrance hall is a computer, novels, books on Argentina, as well as useful leaflets for all 3 apartments to share. Each apartment has its own safe. There is a daily maid service, though she never changed the sheets or towels both of which were good quality. Bed is comfortable, television has English language channels and there is a free phone (local calls only) and free soft drinks in the fridge. Breakfast was with vouchers at two local bistros. One was closed and the other one kept sending us away as we got there too early at 9. Finally had breakfast at 10 and decided probably best to do our own as theirs wasn’t particularly good anyway. Negotiated with Lilian a reduction on the price and did our own for the last few days.", "title": "Cheap, well located b&b", "user": "Bonniebe", "date": "November 27, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 121091839}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The stay at Jacaranda was perfect. Lilian gave us a lot of useful information about Buenos Aires. The apartment was small, clean and nicely decorated. A small kitchen is integrated, and the owner thought of anything you might need (shampoo, free welcome drinks in the fridge, an umbrella etc). Breakfast was included - you had the choice between two cute cafés across the street. Palermo is a safe neighborhood and comfortable to stay. I would definitely stay at Jacaranda again.", "title": "Perfect stay in Buenos Aires (Palermo)", "helpfulness": 1, "user": "Antje M", "date": "November 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120574554}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "I stayed for 2 nights in the small studio and it's a really charming place to stay. There is room enough for 1 person and for a couple too, the only problem can be the basic wardrobe if you are going to stay long time. Bathroom is small but ok. There is a frigde, microwave, tea/coffe facilities and excellente wi-fi too, in addition to the common Pc.", "title": "Charming room", "user": "Bito22", "date": "November 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120415815}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "You get a daily voucher for breakfast at any of the 2 closest restaurants. It's really well located at Palermo in a quiet area.", "title": "Best place in the center of Palermo Soho", "user": "Kakowood", "date": "August 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 5.0, "service": 4.0}, "id": 116823334}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Owners Lilian and Alfonso are really kind and helpful.", "title": "Simply the best", "user": "beetsWashingtonDc", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116084670}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "We spent a week at the Suite in Jacaranda with the family and we loved it. Very convenient, easy access to public transportation (you do not want to drive in Buenos Aires traffic), walking distance to the best Restaurants in Palermo. Lilian and Alfonso played the perfect hosts, speak flawless English and made us feel right at home. The suite has a queen bed on the master bedroom and two twins in the spare room. Full bathroom & kitchenette completed a very convenient accommodation. Breakfast was provided at \"El Frances\" a sun bathed corner bistro a block away. Full maid service every day took all the worries away, with plenty of time for sightseeing and enjoying the great food of Buenos Aires. We do recommend Jacaranda Suites for any length stay in Argentina.", "title": "Hidden treasure in Palermo", "helpfulness": 1, "user": "Xounette", "date": "June 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 114831352}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "My wife and I met our 2 daughters for a week’s stay at Jacaranda in Buenos Aires in May. We had a fantastic week in Buenos Aires and the suite we lived in was perfect for our family reunion. It was our family home for the week; cozy, clean, private, and comfortable; very different from the large hotel experience. Also, its location is great. We ate several times at places that were within walking distance. And, we frequented a market that was only 2 doors down.", "title": "One Great Week at Jacaranda in Buenos Aires", "user": "ChrisAnneCarlson", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 113527996}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Lilian is the ultimate concierge. She set us up for several events and outings, all of which turned out perfectly (She interviewed us at length to make sure she would be sending us to the perfect Tango Show).", "title": "nice room, great location, excellent hostess", "user": "dkhu", "date": "June 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 112984056}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We highly recommend a stay at Jacaranda in Buenos Aires. Book quickly though. I think the word is getting out.", "title": "garden suite very petite!", "helpfulness": 1, "user": "traut25", "date": "May 19, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 108997916}, {"rating": 5.0, "title": "Great location, great accomodation.", "text": "Chris and Anne Carlson", "user": "nicksmith10", "date": "April 27, 2011", "id": 105857006}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "this is a great place to stay. safe neighborhood, walking distance to great restaurants, shops, and bars. it is a bit of a walk to the subte, but not bad.", "title": "Home in Palermo", "user": "lecass", "date": "April 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103319769}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "variance": {"poor": 0, "average": 2, "very good": 16, "terrible": 0, "excellent": 81}, "slim_ranking": 0.068085106383, "description": "Jacaranda consists in 3 apartments in an old house recently renovated, 1 on the ground floor with access to the courtyard, and 2 on the first floor overlooking the garden.The Suite is a lovely 2 rooms apartment, spacious and sunny, excellent for families or group of friends.The Garden Studio is a lovely one room apartment, with private access to our courtyard.The Studio is a compact apartment, excellent for singles, but also ok for a couple.All the apartments have air conditioning, cable TV, CD player, free Wi Fi, fridge, microwave, electric kettle, toaster, safe box, hair dryer, towels heater, between others services. There is no lift.Sheets and towels are 100% cotton, excellent quality.Twin and Queen beds are set upon request.Continental breakfast is served in a nice Bistro, crossing the street.There is a computer connected to Internet in the hall, that our guests have free access.There is a place to keep safe your luggage after check out or before check in.There is no front desk, so it is necesary to organize check in time in advance."}