{"user_rating": 4.0, "review_count": 1177, "name": "Jacaranda Hotel", "reviews": [{"rating": 5.0, "title": "Best holiday in a long time", "text": "Before going on this holiday which was a 40th birthday treat for my best friend I looked at various feedback records. I would like to know if the person who only rated it 1 was in the same Hotel Jacaranda as I was. I found the hotels cleanliness second to none, food variety excellent (although saying this I think they could cater for children a bit more) and the staff more than friendly. I had also read negative reviews about travelling with Thomas Cook. Again I cannot fault them at all. The crew on the flight were very helpful both there and back.", "helpfulness": 2, "user": "DawnieNorthampton", "date": "December 30, 2008", "id": 23101365}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "All in all a first class holiday which I would recommend to anyone.", "title": "Great Hotel", "user": "UkTweetyPie", "date": "December 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 22998593, "likes": {"liked": "— Good location - good food - comfortable room", "disliked": "— Animation team evening show..."}}, {"rating": 3.0, "title": "Sunshine was a bonus", "text": "Dawn - Northampton, December 2008", "user": "blue145", "date": "November 30, 2008", "id": 22311773}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "We've just returned from a fortnights holiday AI at this hotel and would highly recommend it to others. It's in a good location - a pleasant stroll to the nearby beach, shops, bars etc.", "title": "perfection!!!!!!!!!!!!!!!!!!!", "helpfulness": 2, "user": "Traveller's Cheque", "date": "November 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22158610, "likes": {"liked": "— large beds and great food", "disliked": "— rooms ideally only sleep two adults"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "The quality of food at the Jacaranda is excellent and there is a good variety for everyone. I was also able to enjoy a nice bottle of wine with my meals at night - on previous AI holidays I've found the wine pretty rotten...but I was very pleasantly surprised on this holiday. Initially when we booked we chose to go Half Board - then upgraded to AI. For anyone going to Tenerife on a budget, I would recommend AI as the price of alcohol seems to have increased somewhat since we were there last year.", "title": "great hotel", "user": "ScotlandJoey", "date": "November 12, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21777111, "likes": {"liked": "— It was spotless and clean everywhere", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Stayed for a week in January and the temperatures were a surprising 22-24deg C all the time we were there. The rooms were up to a very good standard with nice comfy beds. The maids were in every day and we had clean towels every day as well. We stayed half board and the food was pretty standard fare for hotels but we could always find something we liked. The evening meal is divided into 2 sittings and the choice of which one is taken at initial check-in. There is a quite large piano bar opposite reception which always seemed busy on a night mainly used by the retired guests or guests who were staying all-inclusive. The reception was fine adn there was always someone to help or answer any questions u have.", "title": "Enjoyable stay at the Jacaranda", "user": "peter494holland", "date": "April 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28259702}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The location of the hotel was fine. Fairly central in Costa Adeje. The beach was down a fairly steep hill and was about 300-400 yards away. Having said that virtuallt anywhere u go in the Canaries is either up or down a fairly steep bank. The hotel has a busy road outside and is right on a roundabout but there is adequate crossings about the place. There are plenty of restaurants, bars, shops etc around the hotel within 5 mins walk and all in all we had a nice relaxing stay at this hotel.", "title": "Tries hard to hit the mark", "user": "SadsackCornwall", "date": "April 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 28092275}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We stayed at the hotel for a week at Easter. Things did not start well when we were given a room overlooking the road. We asked to be moved to a quieter room but was told that there were none available. Following a sleepless night I went back to reception and was given a quieter and larger room that day. The location for the resort centre is excellent. The food is of a good standard. The choice for children is limited and the desserts were disappointing. Lunch is served in the main restaurant and it is a shame that there is not a snack bar alternative for those who do not want to use the restaurant. There are two pool areas. The one on the bottom level is very enclosed and surrounded by the hotel. The sunbathing area is very confined with little space to spread out. The pool area on level five is much better for having more room and the guy running the pool bar does an excellent job. The pools are small, more plunge pools than swimming pools. The hotel posts a strict no reserving of sunbeds rule which is ignored by everyone, so you have to be up early if you wish to reserve beds. The bar service is relatively good despite my son being given a rum and coke instead of just coke. Luckily he told me it tasted funny. The animation team does a pretty good job with the daily activities if this is for you. The accommodation is clean but lacks drawer space. The safe is an extra E15 per week and if you want to use the fridge to keep your drinks cool then this is an extra cost. Bottled water is freely available from the Piano Bar, however you are not told this. I took my son to Siam Park. The free bus stops just down the road from the hotel. Tips: Get to the bus stop 20 minutes before the pick up time, pre book your tickets - saves queueing at the park and go early and hit the main slides as the park does fill up quickly. We bailed out at 2PM as the queues were huge and we had done the slides at least twice each. The slides are good fun and it is a good water park. Go early, do the slides then lunch followed by sunbathing or playing in the wave pool. In summary we had a good week and the hotel tries hard to hit the mark but doesn't quiet make it. We preferred the Bahia Principe at Playa Parasio, even though it is more remote and would recommend this hotel if a central location was required.", "title": "The Jacaranda masquerades as a 4 star hotel", "helpfulness": 1, "user": "willo8660", "date": "March 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 26726715}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "We have just returned from a weeks stay at the Jacaranda. Whilst I accept that the hotel probably ticks all the boxes for the Spanish Tourist Board to be a Four star hotel, it has the feel of a three star hotel where any extra you require is a bolt on at a price.", "title": "Gorgeous Hotel, Wonderful holiday", "helpfulness": 1, "user": "Shoesnclothes", "date": "March 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 25562104}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "On booking in I requested the usual safety deposite box, which I thought might be included in this 4 star hotel. Nope. Its 15 Euros a week. Now if the crime is such a problem in this hotel why are they not included?", "title": "was ok hotel food is horrible", "user": "ScotlandScotsman", "date": "January 17, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 23631566, "likes": {"liked": "— loacation staff", "disliked": "— food not fit for a zoo"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "We stayed for a week in the Jacaranda hotel 3rd Oct 2008, I went with my mum active 75 years and my two children aged 3 and 2.", "title": "Good Hotel", "user": "LancashireTrippers", "date": "November 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21505574}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "I was a little nervous about what I should expect after reading some of the reviews, but I needn't have worried.", "title": "Fab Hotel !!!!!!!!", "user": "nessa_babez", "date": "November 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21450205, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "All I can say there must be some very fussy people out there. Our room was massive ample room for the 4 of us, it was cleaned everyday without fail.", "title": "Absolutely fantastic time", "helpfulness": 2, "user": "sunny2107", "date": "October 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21424583, "likes": {"liked": "— All round great family holiday hotel.", "disliked": "— Not much. Lack of storage, charge for safe & fridge, sunbed race!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Reception staff where helpful, the restaurant staff where very nice and the food was good bearing in mind I had with me 3 quite fussy eaters (we always had full plates and they where always empty by the end of the meal) which is a good sign, and what I found brilliant a microwave was available for warming childrens meals and milk.", "title": "Superb once again!", "helpfulness": 2, "user": "CharlotteTroon", "date": "October 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21024496, "likes": {"liked": "— Spacious rooms", "disliked": "— Having to pay for a fridge and safe"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Pool area was nice but the it did get shaded in the afternoon and with being enclosed in the centre of the hotel there was no breeze, but we visited the pools on the 5th floor which we thought where much nicer and you got more of a breeze.", "title": "OK hotel, had better, had worse!", "helpfulness": 1, "user": "lovinthesun1", "date": "October 8, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 20728223, "likes": {"liked": "— Location, pool, some nights food!", "disliked": "— Unhelpful staff, some nights food!"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We have just returned from the Jacaranda in Adeje after spending two weeks on honeymoon.", "title": "Not for everyone.", "user": "G04it", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 1.0, "service": 2.0, "rooms": 2.0}, "id": 31113779}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The booking - We made our booking via Thomas Cook in Newcastle Under Lyme.", "title": "not all inclusive", "user": "petertyl", "date": "May 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 30716593}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We had originally booked to go to Mexico on 12th May and had arranged to stay in a honeymoon suite on an all inclusive basis, but due to the outbreak of swine flu we were told that the holiday was cancelled.", "title": "A Pleasant surprise", "user": "tigletzone", "date": "May 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 29453543}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "On Wednesday 29th April we were told by Glen, the Manager, that we could re-book another holiday, but would have to be quick because holidays were being snapped up (due to the flu outbreak) and there wasnt much choice left.", "title": "food", "user": "lynnegy", "date": "April 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29043314}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "We were told that we could not have a refund at this point in time, and the only possibility of a re-fund would mean waiting until 5th May, after which time a re-fund would be made, only if the foreign office were still adviseing against travel. However if the foreign office had lifted the warning, then we would have to have the holiday to Merxico - No Thanks.", "title": "definately not a four star", "user": "chezny", "date": "April 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 29043162}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 4, "variance": {"poor": 102, "average": 231, "very good": 452, "terrible": 56, "excellent": 336}, "aka": "Hotel Jacaranda Tenerife", "slim_ranking": 0.666666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 4.0, "location": 4.0}}