{"user_rating": 3.5, "review_count": 70, "name": "Jackson Rancheria Casino Resort", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "Had it not been a long day, we would have left. After purchasing concert tickets for a wonderful perfomer, we decided we would make a weekend of the concert. We booked our hotel room in advanced and requested a non-smoking room. Upon our arrival, navigating an awful parking garage, we checked in. We decided to check out our room prior to getting our luggage. What we found was an old, poorly decorated and decaying room. Not only that, it was a smoking room. We went up to the front desk and asked to be moved. We were told there was nothing available. We were apparently booked into a Studio in the old part of the hotel. The room was falling apart, furniture peeling, caulking missing from around tub, etc...you get the picture. When booking the room we were told it was a great room with a whirlpool tub. We were not told the tub was in the bathroom facing the toilet!! What a disappointment. Not only that, but smoking is allowed almost everywhere, which took us by surprise.", "title": "Not so great!!", "helpfulness": 28, "user": "Lawin4cr", "date": "October 16, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 4026377}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "The concert performer was outstanding, but what they consider concert seating was actually banquet chairs tied together. We purchased 3rd row seats not knowing this.", "title": "The Jackson Rancheria Hotel", "helpfulness": 16, "user": "LizaLou", "date": "September 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3880926}, {"rating": 5.0, "title": "My Great Escape", "text": "Other than the performance, the only highlight of our weekend get-a-way was the restaurant, Lone Wolf. Outstanding food and service. I highly recommend this restaurant.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 27, 2005", "id": 3703588}, {"rating": 5.0, "title": "pleasant surprise", "text": "So, we dropped over $800.00 at this place. What with concert tickets, room, dinner, and gambling.....don't think I would recommend staying there again. However, the concert (besides the seating) and the Lone Wolf restaurant are worth attending.", "helpfulness": 37, "user": "A TripAdvisor user", "date": "December 3, 2004", "id": 2861638}], "location": {"country": "United States", "city": "Jackson"}, "variance": {"poor": 4, "average": 11, "very good": 25, "terrible": 10, "excellent": 20}, "aka": "Jackson Rancheria Casino, Hotel And Conference Center", "slim_ranking": 0.428571428571, "description": "Of course, we offer all the comforts you'd expect from a first-class casino and hotel. But at Jackson Rancheria, the difference lies in our service. Stay here - and let us amaze you. As our guest, you'll enjoy complimentary valet and bell services and so much more. Relax in the pool or hot tub. And if you prefer to travel by RV, you can enjoy all these amenities in addition to those of our RV Park. Stop by the Coffee Bar in the Lobby for Sandwiches, Wraps, Pastries, Donuts, Fruit & Yogurt Parfaits, Cookies, and more. Open daily 6 a.m. to 1 p.m. Book Your Banquet Now - We are accepting bookings for our banquet facilities. The moment you hit the casino floor, you feel the energy. 33 Gaming tables, 9 Poker tables featuring Texas Hold 'Em and over 1,500 slot and video poker machines. Action that happens around the clock. Sit down to a game of Blackjack or EZ Pai Gow (no commission). Give a spin to the most popular progressive and video poker games. Visit our 24-hour Poker Room. Here, you're sure to find the most fun and friendly staff anywhere. Jackson Rancheria has more MegaJackpot winners than any casino in Northern California. Step inside, and let your imagination run wild."}