{"user_rating": 4.5, "review_count": 426, "name": "Jaipur Marriott Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Marriott Jaipur is a well thought out hotel. The modern yet tastefully done up rooms help you immediately feel at ease. It has all the amenities you expect of a \"Marriott\". The is located close to the airport which makes it convienent for travellers, but slightly far away from the city for sightseeing. The food at Okra is very good and you will not necessarily look for eating options outside of the hotel.", "title": "Modern hotel in traditional Jaipur", "helpfulness": 2, "user": "funkypratik", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 181336580}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The banquet halls hosting the functions are well done up and the staff is extremely efficient. Irrespective of the no. of guests, there is never a lax in service quality.", "title": "Ultra Modern Hotel with Spectacular Service", "user": "Chefindro", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181124477}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "A thumbs up to this property!", "title": "Relaxed stay", "user": "PramilaManoharan", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 180880143}, {"rating": 4.0, "stay_parameters": "Stayed October 2013", "text": "We stayed at the Marriott, Jaipur just for a night and the hotel was accommodating enough to extend late check out courtesy to us as our flight was in the evening. Keeping up to their brand name, Marriott, Jaipur has done a fantastic job and it is one of the best modern place to stay (if you do not like to choose palaces/ Haveli for your stay). The location (drive to the airport is just 5 minutes) of this hotel makes it most preferred by travelers but that's not all. The rooms are carefully decorated and utilized maximum space to give enough space within. The main restaurant \"Okra\" has been our all time favorite and chefs/ Managers make sure you have everything you could ask for. Chef Sahil Arora has been a darling meeting all our needs not only pertaining to food but everything else. Bhawani, the Restaurant Manager is another person to mention as he has been a great help throughout our stay. Though it was a very short stay for us, but we thoroughly enjoyed the hospitality extended. The only time I got a little worried at the time of check out when after calling for more than half an hour, our luggage were not brought down and we almost missed our flight hadn't it been delayed. But I suppose the Bell desk staffs were extremely busy with some group check in and they hurried their way as I made noise in the reception", "title": "Okra restaurant is awesome", "user": "coconawty", "date": "October 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 3.0, "rooms": 5.0}, "id": 180837242}, {"rating": 4.0, "title": "Small but Interesting Stint ", "text": "I had stayed at Marriot during my official visit to the city. The stay was fantastic. After the hectic meetings, the ambience of the hotel gave us much more relaxed experience as though we were in holiday. The restaurant was good. The staff were very friendly. On the whole very good experience.", "helpfulness": 1, "user": "Muman087", "date": "October 10, 2013", "id": 180475462}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Nice Modern Hotel", "title": "Great Place", "user": "yatriraja", "date": "October 10, 2013", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 180424799}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Rooms were nice though view is not the greatest", "title": "New kid in town", "helpfulness": 1, "user": "Ajay24", "date": "October 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 180128820}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Swimming and Gym facilities are also good as is the Sauna / Steam.", "title": "Stay at Marriott Jaipur", "user": "AashishC", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179829163}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "Food variety and Taste is very good", "title": "Great modern, clean hotel, perfect for my short trip to Jaipur", "user": "Corinne1977", "date": "October 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 179792123}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Only Issue - is the charge for Internet, though I was not charged as I am loyalty member.", "title": "Third visit and same friendly staff and service", "user": "vman63", "date": "October 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 179659371}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled on business", "text": "I have stayed in this hotel to attend a business conference, it’s a good hotel in Jaipur. Rooms are spacious, Food was good. Overall it’s very good hotel to stay. They need to improve entry of vehicles when there is any social gathering as security and relevant staff are struggling to allow vehicles inside premises and operating quite unorganized way and due to same outside traffic getting disturbed and delaying entry of Guests. It was taken about 20minutes to enter in hotel premises for us.", "title": "Very Good Hotel in Jaipur", "user": "RAHULVORA", "date": "October 26, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 182422927}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This is my 2’nd time at the Marriott in India. This time in Jaipur and frankly it is EXCELLENT and more! Everything is perfect! The hotel is modern, well decorated, and very clean, with a very professional staff that somehow manages to make you feel at home. The rooms are beautiful and quite large. The internet runs smoothly and it’s free if you have a Marriott card (you can get it at the reception). We arrived at midnight and the receptionist was lovely. Very professional and even at this late hour. The breakfast buffet and dinner buffets are just stunning! Great food and lovely staff. I am used to stay in palaces and believe me, the Marriott has stolen my heart. I am now a big fan of the Marriott.", "title": "Wordless", "helpfulness": 1, "user": "MarianPhel212", "date": "October 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 182340561}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Very good overall experience. We went there for our off-site. Very difficult to find things to complaint about. The food was high point. We had six buffets and each of them were amazing. The spread is good and the food tastes yum. The swimming pool also worth mentioning. Its long and well maintained. The Jacuzzi can used for free and provides a relaxing experience. Overall a very nice experience. Will definitely recommend!", "title": "Loved every moment of my stay", "helpfulness": 1, "user": "ksmnta", "date": "October 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181645542}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Uniquely been to the strange mixture of Water in form of fountains & pools and Earth in form of teh unique stone carvings of Rajasthan,the bl;end was really awesome this was our last 2 days of the golden triangle trip and we enjoyed to the max,the food was excellent,the service was mind boggling and u have that aroma of sandtone and marble filled everywhere,Saffaron and OKra restaurants were good ,with health concouos breakfast items too,the rooms were spacious enough-will surely recommend for best stay in jaipur when it comes for touring the pink city", "title": "Mixture of Water and Earth in the Pinkcity", "user": "Arun Alex E", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181552883}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Difficult to fault. The property is located on the fringe of the city (v close to the airport), making it some way from the old town, However, a number of other 5 star properties are nearby (not walking), so this may be a town planning issue.", "title": "Outstanding....", "user": "GRJ61", "date": "October 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 181475327}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "I stayed at the Marriott in Jaipur twice in the space of a couple of weeks on a recent trip to India. I couldn't fault this beautiful hotel. Rooms are spacious and clean. Pool area just gorgeous, but would have liked a pool restaurant or bar. Dinner in their restaurant was one of the best meals I had in India and breakfast was wonderful. Free internet topped off a wonderful stay.", "title": "Wonderful hotel", "user": "Kathy C", "date": "November 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183164726}, {"rating": 5.0, "title": "Stunning hotel", "text": "One of the highlights of our trip to India was Jaipur, and the Marriot didn't disappoint. The elegant rooms, fantastic service and outstanding food justifies the 5 star rating. A special thank you to chef Rahul who enthusiastically explained the different cuisines and got us to try delicious new dishes. We were very sad to leave and look forward to returning.", "user": "Varsha B", "date": "October 29, 2013", "id": 182784403}, {"rating": 5.0, "title": "A fantastic hotel, with excellent rooms", "text": "The Marriott Jaipur was the first hotel out of 4 that we stayed in on a 10 day road trip, and the only unfortunate part of it was that it set the standards very high for the rest of the trip! The rooms were superbly modern and brand new, with all the necessary amenities. The bed was fantastic - in fact, I had the best two nights of sleep on the Marriott bed out of all the other hotels in the trip! The breakfast features an amazing spread, with a wide range of variety, complemented by a truly helpful and professional staff who went out of their way to make sure I had everything I needed to eat. There are only three things I didn't like, but there's little Marriott can do about it:", "user": "eLeCtRiKbLuEs", "date": "October 29, 2013", "id": 182776444}, {"rating": 4.0, "title": "Review", "text": "- The approach towards the hotel through the Jaipur town, via the Bypass, isn't possibly the best route into town, and so if you are navigating by GPS, it's best to avoid this route as much as possible.", "user": "Rahul T", "date": "October 28, 2013", "id": 182673168}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "- The view from the hotel (at least from my room) was of a bunch of temporary settlements across the road in an empty field. Perhaps when the area develops further this will improve.", "title": "Welcome Haven in a Frantic City", "helpfulness": 1, "user": "IanPawson", "date": "October 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182595992}], "location": {"country": "India", "region": "Rajasthan", "continent": "Asia", "city": "Jaipur"}, "stars": 5, "variance": {"poor": 6, "average": 30, "very good": 135, "terrible": 6, "excellent": 249}, "slim_ranking": 0.0650684931507, "description": "Jaipur Marriott Hotel is entrenched with the cultural legacy of the Pink City and complemented by inviting spaces that stand for refined elegance and a contemporary look. Strategically located near the airport, guests can delight in spacious guestrooms adorned with traditional characteristics, yet complete with modern amenities. Well-equipped to offer guests truly elevated experiences, Jaipur Marriott offers 43,000 sq. ft. of internal and external spaces ideal for meetings, conventions or theme weddings. The hotel offers one of the city's finest culinary experiences with a range of food and beverage outlets. Guests can enjoy the all-day dining service at the 'Times Food Oscar' awardee restaurant 'Okra'; discover authentic Indian cuisine at 'Saffron'; indulge at the city's best bakery 'Jaipur Baking Company'; or unwind at its high-energy lounge bar 'Lounge 18'. Guests looking to relax and recharge can indulge in the revitalizing services at the hotel's O2 spa. The hotel also features a world-class fitness center with the latest equipment, certified instructors and facilities such as Sauna, Jacuzzi, among others."}