{"user_rating": 4.5, "review_count": 380, "name": "Jakes Hotel, Villas & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Jake's is the perfect place to get away from it all. Our room was wonderful and fairly secluded. We did have one of the units that had air-conditioning & was right on the water, not all have it. The room was clean, had feather pillows & a good bed. Not much else other than the sounds of the waves crashing on the rocks.", "title": "Get Away from it All", "helpfulness": 4, "user": "kncoradi", "date": "May 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7587943, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We did have netting around the bed and there were screens on the windows. I will say if you have problems with bugs, this might not be the place for you. I would classify it in the eco tourism realm of travel. Every night when we walked out of our room we did have to watch out for hermit crabs & during the day you would always hear the lizards/geckos scampering around. There are 3 small resident dogs that roam the property. Just like at home they plop themselves right under your table when eating. They never barked or begged for food. Just roamed around and welcomed any affection shown to them. They truly did make it feel like we were at home, without all the distractions.", "title": "Relaxing Calm Place", "user": "KandKconnection", "date": "April 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7478889, "likes": {"liked": "— Location and people", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Artistic paradise", "text": "The food was wonderful very carribean european & extremely fresh. It was nice having a changing menu every day. The pizza at Jack sprat's is great & they have a nice variety of ice cream too. Andy is there to help accommodate any active excursions you would want, biking, hiking, snorkeling, kayaking, he can do it. The staff is wonderful and really treat you like family. We always felt safe and never worried about \"valuables\". There is really not much to do other than relax, they do have satellite TV if you get the urge. The wireless internet was out more than it was up, but the staff was always welcome to go to the office if you really needed to access it. Jakes does have a small gift shop & bug spray should you need it. But as a rule bring what you need as there is not much around.", "helpfulness": 4, "user": "Tolstoi", "date": "March 7, 2007", "id": 6928887}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Jakes is great for getting away from it all. An excellent value. We would definitely go back. The only part of our stay that was not so great is that it takes another 2.5 hrs to get to jakes once you arrive at the airport. The road is very curvy for about 1/2 the drive. If you have a tendency to get motion or car sick take some medicine along. The road up & over the mountains puts the road to Hanna in Hawaii to shame.", "title": "Exceptional", "helpfulness": 4, "user": "Davegins", "date": "February 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 6815726, "likes": {"liked": "— The views", "disliked": "— Mosquittos"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Tips are included in the bills. We were there for a full 4 days & our meals & excursions totaled just shy of 550 USD.", "title": "A little piece of heaven", "helpfulness": 12, "user": "Mokolino", "date": "January 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6654467, "likes": {"liked": "— Beautiful individual place to stay, in the heart of the local community, friendly staff and the puppies!", "disliked": "— No dislikes"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We just returned from a 6 day vacation at Jake's. It was the best. We were a little worried about mosquitoes but they weren't bad. We used bug repellent and incense sticks plus the nets around the beds at night.", "title": "Just the best !", "helpfulness": 1, "user": "laglick", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8451081, "likes": {"liked": "— beautiful setting", "disliked": "— mosquitos"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We couldn't have been happier. The entire staff from our driver,ONeil, to the guys doing work around the grounds were the best. They were polite and did whatever was needed to make us feel at home.", "title": "Unique cottages & great weekend base", "user": "purplesnack", "date": "August 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8370549, "likes": {"liked": "— So unique!", "disliked": "— Mosquitos.."}}, {"rating": 3.0, "title": "Watch out for mosquitoes", "text": "The food at both Jake's and Jack Sprat was wonderful. Don't miss the grilled lobster. It was to die for.", "helpfulness": 1, "user": "lizasheville", "date": "June 26, 2007", "id": 7999374}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Sally was done an awesome job designing and decorating and putting together a topnotch staff.", "title": "Greatest Vacarion that we ever took", "user": "TripLoverNorthEast", "date": "June 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7976904, "likes": {"liked": "— The pool side drinks and the food", "disliked": "— hot water is solar powered so not always hot"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "If you are looking for a vacation where you can relax and enjoy good food in a beautiful setting this is the place to go.We just pray that Hurricane Dean doesn't do too much damage to this beautiful location.", "title": "Best place in Jamaica", "helpfulness": 3, "user": "nocal1", "date": "May 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7640901}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "this was our 3rd trip to Jake's. We love it, we stay at one of the cottages on the sea that is about $300 per night, all of the cottages on the sea are similar but not excactly alike, we always stay at the same one because it's like our little vacation home. Don't really want to give the exact name because might be harder to reserve next time, but they are all really cool. We are in our late 40s. We love sleeping with the windows and doors open and the sound of the sea crashing on the rocks. Hadn't had any trouble with bugs our previous trips but this time we had a couple rainy days and had some bug and mosquito bites. Would take along some \"off\" and something to put on bites to keep them from itching in case you need it. The people here are fabulous, so very nice. Got to meet Sally and Jason, the owners, this time and they were so nice. Yvonne, the manager, always goes out of her way to give us the best treatment possible, she's great. Dougie @ the bar is the best bartender in the world, we love him. Jake's wouldn't be Jake's without him. Andy took us horseback riding and snorkeling, it was a blast, about an hours drive. Best \"Jerk\" is walking distance outside the gates, only on Friday and Sat. it's called \"Delven's\". Get you some. Andy also does bike and kayak tours, he's a great guy. If you want to go on a boat to Black River or \"the pelican bar\" ask for Joseph, another good guy who'll take care of you. Our driver to and from the airport was the nicest guy you'll ever meet, his name was Keven, he even took us to meet his beautiful family and had his mom share some recipe and instructions on cooking \"Jerk\" style. The drivers we've had in the past on the almost 3 hr drive from \"Mo Bay\" have not been as nice as Keven, ask for him to pick you up at Mo Bay. Went to \"Shirley's Steam Bath and Massage\", it was great, only wished we'd have done it the 2nd day we got there instead of waiting until the 5th and last day. The trip to Shirley's is a great experience that takes you to another world. Loved it. This trip we stayed 5 nights and our bill for food and drinks for my wife and myself was $1000, so that gives you an idea of cost. Loved the food at Jake's, very good. Pizzas at \"jack sprats\" are great too. We always took Dougie a couple slices, he enjoys Jack Sprat's pizza too. Bevin took good care of us at the restaurant, very nice guy, good waiter. Already looking forward to our next trip. Thanks to everyone at Jake's for being the best.", "title": "paradise", "helpfulness": 6, "user": "RedRyderMyrtleBeach", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6635416, "likes": {"liked": "— on the water"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Myrtle Beach, SC", "title": "Wonderful Adventure OUTDOOR SHOWER!!", "helpfulness": 6, "user": "suestravel.org", "date": "January 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6551327, "likes": {"liked": "— The outside shower, the inexpensive wonderful food", "disliked": "— pool"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2003, traveled as a couple", "text": "Jakes was so wonderful!!! It was an adventure to get there through the tropical seaside roads. We were literally washed in, It was just before Christmas and after dark. The rain was falling as our heroic driver - Nelson got us through some awful roads, roads that only the true Jamaica Driver could navigate.", "title": "Total Relaxation", "helpfulness": 8, "user": "Ling_and_Jason", "date": "November 1, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6035633, "likes": {"liked": "— Very exclusive and reclusive environment", "disliked": "— It is a bit of a hike from the airport"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "We arrived just after dark and ran in the rain down a cobble stone sidewalk and came upon a red curtain, I opened the curtain and walked into what seemed like a Caribbean winter scene, Sally - the owner and designer, was just finishing off the last touches on her \"funky Caribbean Christmas tree\" a tree with just bare branches and lovely tangerine colored flowers. So festive and elegant. Our bags were whisked off and we were escorted with umbrellas to our new home. Arriving after dark is always a mystery, I could hear the rain falling and the sea splashing against the rocky coast and was so excited to see the bungalow which I had only dreamed about. We walked in to a pink and purple fairytale room, the bed fit for a Caribbean princess, with a unique purple stone and colored bottles placed as accents on the head board. The dark wooden shutters on French doors and windows were closed to keep the rain out. We sat in our room and wondered where are we? We could here the roar of the sea hitting the rocks just beyond the French doors, we opened the doors!! It was a bit scary, the unknown, the vast sea right at our door step, just less than 10 feet from the foot of the bed. It was dark and all we could see was the white water splashing against the rocks and up on our patio. It was amazing!! We were a bit hungry and head out to Jake Sprats for a wonderful dinner of fresh lobster and a red stripe beer. What a perfect start!! The next morning we awoke to the sounds of birds outside and the romantic rhythm of the Caribbean sea as it splashed against the shore. This was the moment we were waiting for! The sun was rising and we flung open the dark wooden doors to see a sight you only see on Corona commercials, two lounge chairs sitting there awaiting, the vast sea in front of us, just feet from the end of our bed. It was like we died and went to Jamaican heaven!!! Then there was the outdoor shower. The most unique experience ever!! The shower was just off the room, designed with Sally's artistic touches of conch shells and colored bottles, It was open to the sky above and just high enough on the Caribbean side to hide your private parts from passing kayakers and fishermen. I had to try it first, it was like going skinny dipping, I felt a bit silly at first but as the water streamed down my face and the warm Caribbean breeze brushed my body, I felt at peace with all of Jamaica mon!! The roof top sundeck was hot and steamy and we would sit up there in the evening to watch the beautiful sunsets. We felt so welcomed and comfortable there. It was more than I could have imagined. Thanks to Yvonne the resident manager for being so wonderful!", "title": "Mosquito Madness", "helpfulness": 13, "user": "LH69", "date": "October 17, 2006", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 5963571, "likes": {"liked": "— Their Pina Coladas", "disliked": "— Mosquitos in extremely hot room"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The perfect romantic hideaway in a part of Jamaica that is untouched by tourists!!! -", "title": "Slightly shabby round the edges, but lovely nonetheless", "helpfulness": 10, "user": "JMuk", "date": "September 22, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 5821587}, {"rating": 4.0, "stay_parameters": "Stayed July 2006", "text": "We immensely enjoyed our stay at Jakes from July 1-4, 2006. I've been reading some of the negative reviews, and it seems they were only negative because the poster did no research, and thus were not prepared for this type of hotel experience. I'm not able to rate the hotel as excellent, only because it is not a luxury type resort, however, our experience was exactly that. A wonderful, perfect, not-think-about-anything-at-all, laid back experience.", "title": "Fabulous Stay!", "helpfulness": 21, "user": "englishharbours", "date": "July 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 5470848}, {"rating": 5.0, "title": "Jake's, a true treasure", "text": "We picked up an Air Jamaica package with transfers included. Although the price was right, I would recommend paying a bit more and hiring a driver directly from Jakes. Air Jamaica uses JTL tours, and the drivers are \"you get what they got at the time\". Which was not to say the drivers were not very friendly and knowledgeable, the transportation itself on the way to Jakes was less than desireable; an old Toyota mini-van with no shocks and insulation and a 60 mph ride through the mountains for two hours. Which we expected, but not at such speeds and with such an old taxi. The ride back was different as we were picked up in a new Toyota Camry. This ride is not for the faint of heart, so beware. Most of the roads sustained damage during Hurricane Ivan and have not been fixed, so there are many, many potholes and not a whole lot of room to avoid them; very narrow roads, and people walking all over; makes one a bit nervous when a tractor-trailer is coming your way on the other side of the road and the roads are very narrow.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "July 14, 2006", "id": 5466620}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "When we arrived at Jakes and checked in, we were immediately impressed by the wonderful staff. I expected to have to put a depost on incidentals as is usual, but not here; we were greeted by name and immediately shown to our cottage, Cockles, the downstairs unit. We had originally reserved a garden view room for $95 per night, and then upgraded to an ocean view deluxe one-bedroom for $195.00. I am so very glad that we did this; when we arrived at the cottage through a meandering, beautiful walkway and entered our cottage, the french-style doors were thrown wide open onto a small tiled terrace with Adirondack chairs, and then a nice-sized wooden deck with loungers, and right off of the deck was the Caribbean Sea. Just a spectacular view! It was very windy the entire stay, thus, the ocean was more silver grey than Blue, but the waves crashing up and spraying on the rocks was just great to watch; almost hypnotizing if you sat there long enough. The sound from the ocean was loud enough that we had no idea that there were guests upstairs until we happened to see them one day.", "title": "Jake's is a quite and relaxing oasis", "helpfulness": 11, "user": "MoSmileyCA", "date": "July 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5448764}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "I have to be honest and say that the room itself was very small, probably no more than 150 square feet; however, it was just perfect for two if you weren't entertaining, which we were not. The floor was dark plank flooring, the queen sized bed was very comfortable and there was mosquito netting. When I made the reservation I had specifically requested air conditioning which worked like a charm. I don't do well with sleeping in warm temperatures, or mosquitos, based upon the other reviews I'd read. Well, the ocean breeze was enough to keep the skeeters away, and my husband was so comfortable that the first night he slept right on the deck. However, if you go out after dusk, be sure to spray up as there are also some nasty no-see-ums that will eat you.", "title": "Uncomfortable stay", "helpfulness": 7, "user": "b-my-guide", "date": "July 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 2.0}, "id": 5421230}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "The bathroom was inside the cottage, with a big ol' terracotta tub with tiled walls, small sink and small window, and, of course, a toilet. The door to the bath, which was not a door but rather a folding door, never did stay shut, and the lighting was poor, with one bulb being out. But, seeing as this vacation I wore not a stitch of makeup, no problem, mon! I guess I would say that the cottage was more luxury camping than resort hotel, which was fine, as I had read that, and we have camped many times before. But as the reviews say; if you want Sandals, go to Sandals. Because of the drought conditions on this side of the island, the water would at times trickle, and at other times be non-existent. One quick call to the front desk on our cell (which, by the way works there) and the situation was remedied.", "title": "Not for the luxury minded....", "helpfulness": 8, "user": "larach", "date": "June 13, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 4.0}, "id": 5341995}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 14, "average": 17, "very good": 71, "terrible": 13, "excellent": 265}, "aka": "Jake`s Hotel, Villa Hotel", "slim_ranking": 0.166666666667, "description": "\"Chicest shack in the Caribbean\" – Vogue Magazine. --- \"Welcome to one of Caribbean's funkiest resorts, where reggae and rock stars, doctors and lawyers, writers and artists come to taste the real Jamaica.\" - Island Magazine."}