{"user_rating": 4.0, "review_count": 168, "name": "Jam Suites Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "This is perfectly positioned in a quiet area of Palermo, just a few minutes walk from some of the nicest steak restauants I have every been to.", "title": "Warm and friendly. Great staff and a real boutique feel", "user": "JordanKellyLondon", "date": "June 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 68894497}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "The hotel feels like a very trendy converted house with every bedroom decorated in its own quirky style, a bohemian style lounge and small but well designed garden.", "title": "Not the best, not the worse.", "helpfulness": 2, "user": "ecakes", "date": "April 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 61748259}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The staff are really helpful and will talk to you for ages about local hot spots, food, what to do and what not to do etc.", "title": "Nice to look at, but not to stay", "helpfulness": 1, "user": "FabioOz", "date": "March 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 59701537}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "You can use the fully decked out communal kitchen to make your own food but I would suggest venturing out into Palermo where you can't really go wrong.", "title": "Great hotel, but one big problem.", "helpfulness": 2, "user": "NickyAZ", "date": "March 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 58293943}, {"rating": 4.0, "title": "best cup of coffee \"with milk\"", "text": "This hotel really teeters between good and bad.", "user": "A TripAdvisor user", "date": "February 9, 2010", "id": 55526661}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This place is amazing...to the point that this is going to read like an advertisement!! lol.", "title": "Honestly the coolest place that i have ever stayed", "user": "Apple_traveller", "date": "September 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39530675}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "We rocked up to Jam suites without a reservation and no idea what to expect (having chosen it on location and price alone without even having seen their website) and struck gold*. The walls are littered with black and white pics of musicians, the shelves are lined with great albums and the stereo is constantly playing amazing music.", "title": "Magic", "user": "marcodacapri", "date": "July 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33769304}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I also cant rave enouh about the staff. They were super cool, friendly, helpful and some of the warmest people we met in BsA.", "title": "Not at all a good choice", "user": "lapompe", "date": "April 27, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 28902155}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "My husband and I stayed at Jam Suites for 1 night, after arriving in Buenos Aires and before taking an early morning flight to Rio the next day. Upon first arriving, my thoughts were that the space was really cool - you walk in to this townhouse, see the airy common area that looks out upon a garden and the stairs to take you up to the rooms. The owner was very nice, and the 24 hour staff was very helpful (those that didn't speak english didn't have any qualms about using google translate to go back and forth with us about needing a taxi to the airport early the next morning.) Restaurant recommendations were good nearby and it was extremely walkable to a lot of great spots in Palermo (we were back in BA later during our trip and wishing we had the same location.) Our room, the suite, was very large - the sauna didn't work but we didn't expect there to be a sauna so no loss there.", "title": "Very cool space", "user": "Alybyzrp", "date": "January 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 94202266}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Jam Suites was a great part of our trip to Buenos Aires. Right in the heart of Palermo, close to nice shops and very good bars for nightlife! Super helpfull people, with nice smiles for the start of the day! Our room had views to this nice and peaceful garden! all you need to relax and have a fun time in Argentina!", "title": "Very nice place! Very relaxed atmosphere... it really feels like home!", "user": "hmb091", "date": "January 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 94018380}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Our stay at Jam Suites was a very enjoyable one! The staff were incredibly helpful and welcoming. The building itself has a great quirky feel to it with framed prints of Jazz musicians and a great garden out back for relaxing and eating your tasty breakfast! Best breakfast we had during our stay in Argentina - fresh and varied with plenty of Argentine treats on offer! Small negative - walls are quite thin so we could hear our neighbours occasionally but not enough to disturb us. Location is great, Palermo Soho is a fantastic place to base yourself for exploring the whole of BA, loads of great bars and shops within walking distance and a tube station about 15 min walk away. Would definitely recommend this hotel to a friend.", "title": "Great people, Great garden, Great breakfast, Great location!!!!", "user": "Polly098", "date": "January 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 93970308}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Words can't explain how much I love this hotel. It is a cozy boutique hotel and the moment you arrive, you feel like you are at home and the staff is your family. I travel a LOT, so I look for specific things when I stay at a hotel. Jam Suites exceeded my expectations! Our room was beautiful and spacious, the hotel internet was available to us all the time, the breakfast was delicious, and the kitchen downstairs was at our disposal so storing and reheating food from outside was easy. We cried when we were leaving because the staff truly became our family. This hotel is centrally located in the dining and shopping area of Palermo Soho so was had the chance to walk off all the yummy food in Buenos Aires. I look forward to going back to Buenos Aires so that I can stay at Jam Suites again. I HIGHLY recommend this hotel for anyone who goes to Buenos Aires.", "title": "My new home and family in Buenos Aires!", "user": "sherforceone", "date": "January 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92805388}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I think this is a great little hotel to stay in for one night, but I wouldn't have wanted to stay any longer than that. It's basically a house turned into a hotel, very funky, filled with pictures of musicians and books. The room was pretty small with no closet (just a hanger rack) and a tiny bathroom that stank - that rancid pipe smell. The room was 'ok' clean - not spotless and not dirty. We stayed one night and that morning there was only hot water in the shower (the cold water pipe broke) so we couldn't take a shower. Manager didn't offer any discount for the inconvenience of not being able to shower. I thought this was a misstep but he probably figured we wouldn't be back anyways.", "title": "Funky in more ways than one", "user": "gabysf", "date": "December 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 89019448}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "There's no sign with the heavy metal doors in front of Jam Suites Bou­tique Hotel, yet as soon as you enter the cozy corridor behind the doors there's no way not feel very welcome. It's front desk is way more of a living room than a formal front desk, and this feel is extended all the way until you check out. I checked the availability and prices on the Internet, and the cost-benefit ratio seemed nice from the first moment.", "title": "Excelent cost-benefit ratio", "user": "algiesbrecht", "date": "November 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87145948}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Before departing from Brazil I learned I could order the transfer service from the airport directly with the hotel, and my e-mail asking for more details was answered in less than five minutes. When finally deciding for it, the e-mail exchange was also very quick, and the service worked fine, even when we arrived after midnight. We arrived at the hotel at 1h30 am, and very tired. The lack of check-in bureaucracy was something we appreciated A LOT due to the conditions.", "title": "we had such a great time here!!", "user": "cleben", "date": "November 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86514697}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "The seven suites the hotel offers aren't known by numbers, but by jazz-related names. Our suite, one of the three simplest, was named BB Queen. Despite the name, there was no music-related decoration, and even the books on the room's three shelves were about Politics and Economics, not jazz and jam ses­sions. The room is very small, as is its bathroom, but its box bed ahd a wonderful mattress and the room feel is of a good mood. The view from our window was to the entrance corridor, with lots of green. There was no way to see the street, but it was possible to have a view of the Buenos Aires sky, which was really blue when we were there.", "title": "great location, nice room, friendly staff", "user": "defunkedraf", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84461879}, {"rating": 4.0, "title": "Excellent choice!", "text": "The \"dining room\", where breakfast is served (which basically is also the \"front desk\") is also cozy, with either its tiny tables orthe big coffee table beside the sofa, which can be used to have breakfast as well. The breakfast is simples, but it has all the basics, and the guest can buy stuff at the market and store it in the collective fridge, way bigger than the fridge available at each room.", "helpfulness": 1, "user": "jujulouro", "date": "October 18, 2010", "id": 84000563}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled on business", "text": "Besides being the place for breakfast, the living/dining room is the hotel's heart. It's not rare to see the owner or hotel employees talking to the guests and even giving some tips about the neighborhood. While this happens, jazz music keeps being played in a volume that doesn't bother anyone in the room or the rooms — the doorbell or telephone, on the other side, is easy to listen from the rooms, especially during the late nights and early mornings.", "title": "Really nice and friendly atmosphere", "user": "Katinka1", "date": "September 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81339725}], "location": {"country": "Argentina", "continent": "South America", "city": "Buenos Aires"}, "stars": 3, "variance": {"poor": 12, "average": 25, "very good": 70, "terrible": 8, "excellent": 53}, "slim_ranking": 0.229787234043, "description": "Jam Suites Boutique Hotel is the starting point to enjoy Buenos Aires lifestyle. Located in the heart of Palermo Soho, it has seven exclusive suites joined to the exuberant nature of its garden and a space dominated by arts and melodies generating a unique atmosphere."}