{"user_rating": 3.5, "review_count": 127, "name": "Jameson Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Clearly, the Hampton Inn Brunswick has undergone a makeover, based on reviews from 2005. First of all, we were staying over a big Spring Break travel weekend, but got a $34 bid accepted on an online travel service that accepts bids.", "title": "Luxurious Bedding", "helpfulness": 6, "user": "Marti", "date": "April 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 5018824}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "PROS: the convenience to I-95, the surprisingly quiet setting (you wouldn't think that upon approaching, since there are so many restaurants and hotels within a thousand yards), the service (the ladies at the desk were the essence of southern hospitality), the free breakfast (among about 20 other choices, they had breakfast pizza the day we were there), the lobby/breakfast area (really nicely decorated and arranged), but mostly...the bedding! Wow, I'd love this for my house! It was pure white and about 6 inches \"fluffy\". The pillows were the most comfortable I've ever slept on. The bed was perfect. I can't say enough about the bed and bedding!", "title": "The White room....", "helpfulness": 5, "user": "Marion G", "date": "April 12, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 4967668}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "CONS: Nothing. Not a thing. I would pay $90 for a room like this and assure you I've paid way more for 1/10th the quality or experience. Sure, it's not on the ocean or with a marsh view (which you can get for hundreds of dollars a night within about 10 miles of this hotel) but it's a great travelers' hotel/motel. We had an exterior entry and that was not a negative.", "title": "I Guess They've Cleaned Up Their Act!", "helpfulness": 2, "user": "cbblades", "date": "March 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4594729}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "We arrived here at the Hampton Inn in Brunswick Ga, last Thursday on the way back from Florida driving North. We were tired and hungry and looking forward to a good rest. The room was clean, the carpet looked new, the bathroom was unusually presentable and very clean and the price was right. $90. It was an all white room, white comforter ( a down comforter so comfy) and the sheets were a pristine white the carpet was a soft tan and the bathroom was all white....hence the white room...We meant to get something to eat, but we were so exhausted we just fell asleep.", "title": "Worst Ever", "helpfulness": 2, "user": "VAGirl85", "date": "August 9, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3749089}, {"rating": 2.0, "title": "Hampton Getting Old", "text": "However, I did hear the morning breakfast was delish. Oh well next time we will wake earlier and take advantage of the meal included.", "helpfulness": 5, "user": "tarleton", "date": "June 5, 2005", "id": 3530101}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 12, "average": 19, "very good": 30, "terrible": 17, "excellent": 49}, "slim_ranking": 0.444444444444, "description": "Easily accessible off of I-95, Jameson Inn is a relaxing retreat within miles of the many historical, cultural, shopping and recreational attractions in the heart of the Golden Isles. We invite you to experience and return to southern hospitality."}