{"user_rating": 3.5, "review_count": 282, "name": "Jazz on South Beach Hostel", "reviews": [{"rating": 5.0, "title": "Best all around", "text": "This hotel was the best, the best location, far enough from all the noise when you want to sleep, but close enough to be in the heart of all the fun. The best deal it was so reasonable and the rooms were cozy and looked exactly like the picture. The staff was incredibly nice, always got a greeting coming and going. The best part of all it's only a block away from Ocean Drive and the beach. It was the best all around, stay here you won't regret it", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 5, 2005", "id": 3440104}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "After reading other reviews, I find it necessary to add my opinion. We stayed at the Atlantica on 4/28/05 on our way to the Key West. Everything about the hotel was accurate from reading here, however an important piece was left out..... Don't stay on the 100 level!!!!!! The people above us sounded like a herd of elephants when they got back to their room at 5AM. The floors are concrete and not insulated well at all.", "title": "Great hotel for the price", "helpfulness": 2, "user": "jt4244", "date": "May 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 3.0}, "id": 3438365}, {"rating": 4.0, "stay_parameters": "Stayed May 2005", "text": "Other than that, it was great! The continental breakfast was good, one block from the beach and an easy 20 minute walk to Lincoln Road shops.", "title": "Great value with European flair", "helpfulness": 2, "user": "Kapkid", "date": "May 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3437181}, {"rating": 1.0, "title": "Atlantica Hotel was a horrible experience", "text": "We just returned from a 3 night stay. This is a wonderful budget hotel. It reminded me of the small hotels that I stayed at in Europe--right down to the continental breakfast with good bread and butter/jam. The rooms are very clean and QUIET. I never heard a door slam! It was fully booked when we were there (there was a big hip-hop event in town). The staff was very helpfull--especially when a tour company forgot to pick us up after a boat tour. We easily walked the block to the beach (rent a chair and umbrella for $18 a day) and to resturants and clubs. We sat on the front patio and \"people watched\" with the couple we traveled with. There is even a small bar that serves beer, wine and soda at very reasonable prices. We plan to stay at this hotel again next year (book early)", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 2, 2005", "id": 3431902}, {"rating": 5.0, "title": "Very well done!", "text": "This had to be some sick joke that this hotel is in business. The staff was very rude. We were constantly harassed, the owner did absolutely nothing to fix the situation, in fact, he was just as insulting. Refering to us as liars. We had no housekeeping service, We had to get clean towels and toilet paper our self. Breakfast was awful with stale bread and half rotten fruit. The rooms were very dirty and had a terrible smell. The location is not good either. It's on a dark block and we felt very unsafe coming home in the evening.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 14, 2005", "id": 3358141}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Very clean and quiet hotel in a great location. My wife and I are young and like to go out and party, but when we want to sleep, we want to leave the party behind. Which is exactly what this hotel offers at a great price. It is within walking distance of all the South Beach party scenes, but far enough away to avoid the 24/7 noise. Breakfast is served later than most hotels, so even if you want to sleep late you can still grab some food (which is way better than most hotel continental breakfasts). I would highly recommend this hotel to anyone searching for a clean, quiet, affordable place to stay in South Beach.", "title": "Great value", "helpfulness": 2, "user": "sfogary", "date": "June 7, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 4.0, "value": 5.0}, "id": 3537819}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "I and my wife and my brother and his wife came from Norway to visit our son and his wife in Miami in March. We were also to meet my mother in law who is 80 and my brother in law and his wife who live in Albuequerque and Chicago.", "title": "Super friendly", "helpfulness": 2, "user": "FredMjondalen_Norway", "date": "June 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3518548}, {"rating": 5.0, "title": "Another good review", "text": "I found this super friendly place on the internet after searching for a reasonable and nice place to stay for quite a while.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 29, 2005", "id": 3508228}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "The staff was super friendly and helpful, rooms clean with great beds, good breakfast and best of all the outside area where we had breakfast and gatherings in the evening before going to dinner and also late coming back.", "title": "Great little place", "helpfulness": 5, "user": "najjer", "date": "May 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3488849}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "Having the opportunity to sit outside having cocktails and talk late in the evening really made the differnce for our family reunion.", "title": "excellent value", "helpfulness": 1, "user": "missmetro", "date": "May 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3448581}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "We visited Miami for the 1st time and had used tripadvisor's recommendations for staying at Atlantica. We found the hotel clean, the breakfasts were good and filling, parking was convenient and the main strip/beach was close enough to walk down. There was no loud noise at night and we slept peacefully. I would recommend anyone to stay there when visiting South Beach. It is true what they say about not staying on the main strip - it is expensive, overpriced and noisy. On the contrary Atlantica is totally affordable. But make sure to book early bc it gets booked out fast.", "title": "Great place, excellent location", "helpfulness": 4, "user": "PickyTravellers", "date": "September 21, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 3.0}, "id": 3930647}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Just got back from Hotel Atlantica in South Beach. My wife and I stayed there based on the reviews posted here and were very pleased with the accommodations. We wanted a clean place to shower and sleep and thats what we got. The rooms are a little small and not real fancy but they were very clean, well kept, commfortable, and quiet. A nice location as well. The breakfast was nice also. We had to leave early because of approaching hurricane, but are glad we found this place. We will definately return!", "title": "Good Value", "helpfulness": 2, "user": "FloridaFly", "date": "September 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 3924379}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "this is my second time in south beach. i chose this hotel because of the reviews on this wesite. the reviews were good. the room was good for a single traveler. the bathroom was very very clean; althoug, i could not use the tub for a bath, no stopper. it is located on 4th and collins, a block and a half from the beach. you will have to walk or take a taxi to get anywhere else. linclon road is way more than 20 minute walk. the air conditioner worked well, but it was a little loud. all in all, it is good for the price. there are double locks on the door, but traveling as a single woman, i would have felt more save with a key card. staff was friendly, and helpful.", "title": "it was okay for the price", "helpfulness": 2, "user": "solara", "date": "September 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3841026}, {"rating": 2.0, "stay_parameters": "Stayed August 2005", "text": "This was our first time in Miami, so can't compare this hotel to others for value or quality, however we were disappointed.", "title": "Okay", "helpfulness": 9, "user": "AJM48", "date": "August 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "rooms": 3.0, "service": 4.0}, "id": 3757229}, {"rating": 5.0, "title": "Great Hotel", "text": "We booked this hotel after reading the recommendations on this site, as we always do, and so were expecting it to be wonderful.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 31, 2005", "id": 3724946}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "This was my second time staying here within the last 6 months and again I had a fantastic stay. This hotel is located in the perfect place....its 2 blocks from everything...the beach...the Ocean Drive Strip with all the bars and restaurants...etc...but since its not directly in the middle of the action its a very quiet and peaceful place to stay. Its also in a very safe area. My room was small, but adequate for what my needs were. The place was very clean, and my room was kept very clean. The bathroom looks like it was very recently renovated and has new tile and a new shower stall in it. The free breakfast was a nice touch, and was basic, but just enough to get the day started off...it consisted of bagels, bread, cereal, hard boiled eggs, orange juice, coffee, tea, jams, cream cheese, butter...etc....some fresh fruit...usually bananas...etc. This is not a \"party\" hotel, and the house rules make it very clear what is accptable at the hotel...and I like that they have these rules...since the hotel was always very quiet, and I never heard any of my neighbors in any of the rooms at all. They also have a free computer to use in the front lobby to access the internet, e-mail, etc.... The owners are very nice and professional, and the staff was excellent. The parking situation is not that bad, for South Beach, since they have a deal with a Parking garage 2 blocks away that lets you park for $ 10 a day, with in and out priveledges, and for South Beach this is a good deal....most other hotels in the area charge $ 20 -30 a day to park...and many don't allow in and out....IF you are looking for a clean, comfortable, and a very reasonably priced hotel in South Beach the Hotel Atlantica is the place to stay. There is nothing fancy or glamorous about this hotel, and there is no pool. But I would rather save my money and spend it on other things...like drinks...dining out in South Beach...etc...Also, regarding the one or 2 negative posts that were posted about this hotel....my guess is that these were some young teenagers expecting a party hotel or something...I'm not sure....but I can't find anything to complain about the Hotel Atlantica....this place is the best bargain in South Beach !!!! I have also posted some photos I took of the hotel and my room...etc...If anyone has any questions about this place you can e-mail me direcltly...I would be more then happy to give you more details about my stay there.", "title": "Another Great Stay At Atlantica ...This is the best deal in South Beach !!!!", "helpfulness": 17, "user": "djgaryb11", "date": "July 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3721083}, {"rating": 5.0, "title": "This place is excellent - fully deserves 5 Stars", "text": "Trust us - this place is for real.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "July 25, 2005", "id": 3699069}, {"rating": 4.0, "title": "Good for the money", "text": "I cannot fault this hotel - before I booked it, I did a lot of research. At first I was suspicious of all the 5 star ratings - but after staying there for 8 nights, this hotel deserves it high praise. It feels very safe and is only 5 mins max walk to the beach (we were carrying deck chairs, umbrella and other stuff too!). This is Miami and when you consider the price, it is a fantastic deal. Before I waffle on, here are the good and bad points:", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 9, 2005", "id": 3650683}, {"rating": 5.0, "stay_parameters": "Stayed November 2004", "text": "Good:", "title": "Had a wonderful time at Hotel Atlantica", "helpfulness": 5, "user": "rina123", "date": "June 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 2.0, "service": 5.0}, "id": 3619603}, {"rating": 5.0, "title": "Great Location for South Beach Accomodations", "text": "-VERY friendly staff", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 12, 2005", "id": 3544495}], "location": {"country": "United States", "city": "Miami Beach"}, "stars": 3, "variance": {"poor": 27, "average": 30, "very good": 92, "terrible": 40, "excellent": 93}, "aka": "Jazz On South Beach Hotel Miami Beach", "slim_ranking": 0.538461538462}