{"user_rating": 4.0, "review_count": 466, "name": "Jedermann Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We recently stayed here one night and were very happy with the choice. The hotel is about 5-10 minute walk from the train station and very close to the center. The staff at the hotel was very helpful and explained the best way to get around town. They even sold us tram tickets and told us to catch the tram right in front of the hotel. The breakfast is generally superior to other hotel breakfasts I've had at this quality/price. Multiple types of breads, cheeses, meats, jellies, etc. The hotel also offered free wi-fi in the rooms which made it convenient to let everyone back home that we made it to Europe. This is a top-end three star hotel and I would stay here again without hesitation.", "title": "Great value and location for a short stay", "user": "badwaiter", "date": "September 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 78514276}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We agree with the majority of the reviews, this hotel offers good value and service in a good location. The hotel is 10 minute walk from the main train station and 20 minutes to the centre (Marienplatz). For people visiting the city for Oktoberfest, you are practically on its doorstep. Very clean hotel, polite and friendly staff, good continental breakfast (although the breakfast room can get busy) and free internet access and safety deposit box. The decor is old fashioned but all the normal amenities for this price range of hotel are there. If you are looking for a swanky newly decorated hotel look elsewhere but if you want a confortable, good value stay then I would definitely recommend this hotel.", "title": "Good value and service", "user": "noddyworld", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 78375802}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "This is the second time we stayed here, the previous time was apparently four years ago. The receptionist reminded me as they had my details still on file.", "title": "Second time stay, good value, good feel, few negatives", "user": "fdKen", "date": "September 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 78051895}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The receptionist on checkin wasn't as friendly as she could be, but all other staff were fine. Don't get me wrong she wasn't nasty just not as welcoming.", "title": "Lovely 3* hotel", "user": "RhysA", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 77351458}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Both times we have stayed we have walked from train. Then discovered all day tram tickets, and the group one are incredible value. You should research that before you go and buy a ticked and get a tram to the hotel. It is walkable but it isn't a picturesque walk.", "title": "Only okay", "user": "JYee26", "date": "August 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 77339248}, {"rating": 5.0, "title": "Best hotel for the value", "text": "The Hotel Jedermann is a great inexpensive place in Munich. Definitely far better then hotels that are even twice the price in the USA. The staff are great. They are extremely friendly and helpful. They have an excellent traditional German breakfast (think of it like a really good continental breakfast) and the rooms are kept extremely well. They have about 22'' Samsung LCD TVs in each room. One complaint that I do have is the fact that they have some floors with shared bathrooms. Where I stayed, in a double room on the first floor there was an extra single bed, so any couples that come can share the room with their child or something. My son stayed in a single room. The interesting thing about that room is the fact that there are two single beds separated by a divider at the foot of the beds. The only problem was parking. They do not have their own garage so you must park around the corner. The Jedermann is a great hotel and I would recommend it to anyone.", "user": "masterchef1123", "date": "August 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 74700906}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Great hotel , friendly staff , good location near the Tram ,great breakfast, reccomended.", "title": "Best place to stay in Munich", "helpfulness": 1, "user": "Liron078", "date": "August 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 74174790}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "great hotel at a great price", "title": "Great hotel!", "helpfulness": 1, "user": "Lucyw_123456", "date": "July 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 72735365}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "10 min walk from main station", "title": "Ok - But Nothing Special", "helpfulness": 1, "user": "review5Uk", "date": "July 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 71539343}, {"rating": 4.0, "stay_parameters": "Stayed July 2010", "text": "great breakfast", "title": "Central, Nice and Neat", "user": "fishle", "date": "July 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 71467296}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "The hotel is close to the main rail station in Munich, but is a reasonable walk from the main shopping area of Munich (fifteen minutes approximately). The hotel itself presents as well-maintained but a little old, and my single room was small. However, the room was spotless, the bathroom was fine and the staff were helpful. The breakfasts were excellent, typically Bavarian, with lots of meats, breads and cheeses. I would stay there just for the value of the breakfasts, but overall I found the value to be very good. As I was leaving I was given a small bottle of bubbly as a memento, which was a great last impression of the hotel.", "title": "Good location, great breakfasts.", "helpfulness": 1, "user": "europe2009", "date": "July 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 71292744}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "My husband and I visited Munich for three days. We had a very good time in hotel Jedermann. We arrived at almost midnight, and we had excellent service and hospitality from that minute on till we left three days later. Not a very big hotel, but the rooms were very neat and cosy. The staff were friendly and helpful and we had good breakfasts included. The hotel is not far from the main station in Munich, and the tram stops right in front of the hotel. We can recommend this hotel. We enjoyed our stay and will definitely stay there again if we visit Munich.", "title": "Excellent value for money for any tourist.", "user": "Maretha33", "date": "July 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 71237327}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "From the Trip Advisor reviews, we were expecting more from this hotel for our 2 day leisure stay in Munich for our family of 4. As advertised, the hotel was extremely convenient to the tram into downtown Munich, which stopped almost right outside the hotel entrance. Othewise, the neighborhood was not particularly attractive, and restaurants were about 3 blocks away. The hotel was very clean, which is very important to us. Our room was smaller than most of the quad rooms we stayed in on our trip, and the walls were totally bare, without a single piece of art! The comment that it felt like a clean dorm room were on target. Luckily, we were away from the main street, since we had to keep the windows open due to the heat. As many people reported, the staff was very helpful and spoke good English, but we only found the night manager to be 'warm and friendly'. Breakfast was good and served in a comfortable dining room, but it did not quite measure up to the finest breakfasts we had on our vacation (mostly in 3 star hotels). Wireless was good in the room. Parking was close by in an underground lot, although getting into the garage was a little convoluted.", "title": "OK but did not match glowing reviews", "user": "njfamilytravellers", "date": "July 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 71235610}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled solo", "text": "Overall, the Jedermann is a clean and convenient 2-3 star hotel in a big city, but the rave reviews overrated it.", "title": "Not what I expected", "user": "taxiguy", "date": "July 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 71021268}, {"rating": 5.0, "title": "a great spot!", "text": "I picked this hotel based on reviews from others and must say I was quite disappointed. The location was fine, right on the Bayerstrasse, and a 10 minute walk from the train station. The front desk help was fine, check-in was easy and efficient. Once I got to the room, however, I was not very happy. The room was more like a college dorm room than a 3 star hotel room, with 2 very uncomfortable single beds, The mattresses were far too soft to enjoy a comfortable night on, and the room was right on the street with no air conditioning. The only way to cool down was to open the window, and being on a main street there was a considerable amount of noise. It was the night Germany played Spain in the World Cup, and if Germany had won I would not have gotten any sleep at all.", "user": "carlalalalala", "date": "July 7, 2010", "id": 70003285}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "We stayed at the Jedermann for 6 nights in early spring. We loved everything about the hotel, especially the friendly, helpful service, but also the fantastic buffet breakfast and the fact that we got a German hotel experience rather than the more bland international (hotel chain) experience. The location was within easy walking distance of the main station with a tram stop outside the door.", "title": "Highly recommended for location, cleanliness and helpful staff", "user": "MelbourneKaz", "date": "July 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69973536}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled solo", "text": "The area around the hotel seemed quite safe. It was just far enough away from the station to be away from the 'interesting' characters and 'services' that you sometimes find in a central station precinct (if you know what I mean.)", "title": "Jedermann Excellent Central Hotel in Munich", "user": "John-yyz423", "date": "July 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69905396}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Our double room had a separate toilet and bathroom and there was enough room to put suitcases on the floor and still be able to walk around. The room was warm, especially with the feather bedding that is quite usual in Germany, but we were offered the loan of a fan in case we needed it.", "title": "A great place to stay in a great city", "user": "deaney77", "date": "July 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 69451460}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The hotel, while in an old building, was perfectly maintained and very clean.", "title": "Highly recommended", "user": "zuriga", "date": "June 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68791961}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Front desk staff were very helpful with transport tickets, maps & directions and made us feel welcome. They had excellent English.", "title": "good stay", "user": "shiulee", "date": "June 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 68716884}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 2, "variance": {"poor": 9, "average": 56, "very good": 207, "terrible": 4, "excellent": 190}, "aka": "Jedermann Hotel Munich", "slim_ranking": 0.109660574413, "description": "Traditional charm and modern comfort as well as atmosphere and servicehave been offered since 1961 by the Jenke family and its staff.Cozy hotel situated in the city center, near the main trainstation, in front of the European Patent Office.48 Standard rooms, most facing the quiet court yard, with shower and toilet,towel warmer, hair dryer, modern IP-TV, phone with voice mail and clock radio. Some also with air-conditioning, interconnecting doors and wellness-shower.7 Basic rooms with only wash-basin and clock radio; shower and toilet down the corridor, without any other amenities (TV and phone in the public area).Rooms for a long stay also available."}