{"user_rating": 4.0, "review_count": 276, "name": "Jianguo Garden Hotel", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed in the Jianguo Garden Hotel in Beijing for 3 nights in mid April 2008 and found the hotel to be centrally located and ideal for our needs with the exception of the lack of air conditioning in the rooms. Upon arrival the temperature in our room was approx. 84 degrees (27 Celsius), but upon adjusting the thermostat to cool the room we discovered it wasn't putting out any cool air. We called the front desk and they promptly sent someone up to investigate. When the hotel employee could not get the a/c to work we were moved to another room. This room was older and not quite as nice, but hey….if we were cool we really didn't care that much. Once again we tried to bring down the temperature in the room, but since the thermostat controls in this older room were all in Chinese we had to call for help again. Again, the employee could not get cool air to start generating. Long story short, we finally were told that there was a city ordinance stating that the temperature was not hot enough outside to turn on the a/c to the rooms! Since we found this to be the case in almost every hotel we stayed in during our visit to China I'm not sure if the Jianguo Garden Hotel is 100% fully to blame. With that said, we do find fault in that the hotel advertises that the rooms are air conditioned without any disclaimer that this only applies to certain months of the year. In addition, no other hotel claimed it was a city ordinance (one claimed it was to conserve energy) and our English speaking guide had never heard of such and ordinance. We were disappointed that they could not tell us up front the reason the A/C was not on rather than go through the trouble of moving us to another room. We think the reason we were moved to a different room was to give us a room where the window opened – the fact that it only opened a few inches and let in the Beijing pollution and the sounds of construction next door that went on all night long really outweighed any cooling benefits. Didn't think to ask for an electric fan, but it would have helped tremendously as we discovered in the other hotels we stayed in.", "title": "Great....if air conditioning isn't high on your priority list", "user": "WHERESWAUGH", "date": "May 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 15758648, "likes": {"liked": "— Good location - close to Forbidden City", "disliked": "— Rooms not air conditioned"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "One last thing to note - The breakfast buffet was quite good, however we thought it to be a little pricey since it was not included in the cost of our room.", "title": "My bed had fleas", "user": "Coltbridge", "date": "March 24, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 14491765, "likes": {"liked": "— Fleas in the bedding"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My bed had fleas. What more can one say? Try the Regis.", "title": "Room works okay for three adults.", "helpfulness": 2, "user": "DarthAnonymous", "date": "February 3, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 13241964, "likes": {"liked": "— convenient location, cleanliness, breakfast, concierge service, happy hour", "disliked": "— lack of control over room air"}}, {"rating": 4.0, "title": "Very good hotel --Recommended ( too bad \"incidentals\" cost so much...)", "text": "Happy hour at wine bar 2nd floor is a great deal. 78RMB = all you can drink, standard drinks 6pm – 11pm.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 11, 2007", "id": 11473294}, {"rating": 4.0, "stay_parameters": "Stayed July 2004, traveled on business", "text": "Concierge service is a great deal. Hotel is pretty affordable for having a nice full concierge service. It can be busy, but they seem to be there all the time and are fantastic for checking on ticket situations.", "title": "Liked it, but can be improved", "user": "canbagna", "date": "December 1, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 5.0}, "id": 11190604, "likes": {"liked": "— Spacious rooms, Sunday concert, location.", "disliked": "— Nigthlife and beggars neraby"}}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "Spent 5 nights at this hotel in a deluxe room, non smoking floor. An extremely large room with 2 dbl beds, desk & chair and armchair. Decor a bit bland. Bathroom spacious with 2 showers. Only problem I had was the room, which faced south, got extremely hot during the late afternoon. A little quirk was the maid coming in to turn the bed down and putting out slippers about 8.00 every night.", "title": "Luxury on a budget", "helpfulness": 12, "user": "RJT", "date": "April 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4972605}, {"rating": 4.0, "title": "Would stay again", "text": "The hotel is 10 minute walk from Wanfujing Street, 5 minute walk from Oriental Plaza mall and 20 minute walk from Tiananmen Square and not far from the railway station.", "helpfulness": 25, "user": "B57", "date": "November 6, 2005", "id": 4089008}, {"rating": 5.0, "title": "Great Location and Great Hotel", "text": "I am a Tour Manager. Stayed at this hotel in 2006 and when we went back surprised to find that it has undergone a complete renovation of the foyer, reception and restaurant areas since our last visit. The hotel is in a great location near railway station and a short bus ride from Tiananmen Square and great shopping. The breakfast is great and the service friendly. The standard rooms were clean and a good size. We stayed 3 nights this year and could not be happier. Great spot to use as a base for all Beijngs many attractions. Recommend this one .", "helpfulness": 1, "user": "OB1ONE", "date": "September 11, 2007", "id": 8691533}, {"rating": 5.0, "title": "Two weeks at the Jianguo Garden Hotel in Beijing", "text": "My husband and I recently returned from a two week stay in this conveniently located hotel. Our trip was a combination business [for him] and pleasure [for both of us]. We very much enjoyed our time at the Jianguo Garden, and definitely would stay there again. The location is very central. It is a three minute walk to the Dongdan subway station. We bought public transit cards in the station and used them on the subway [3 rmb/trip] and the bus [ slightly over 1 rmb per trip]. There is a 20 rmb deposit on the card that you can only get back at the Beijing Railway station subway station between 7:00 a.m. and 7:00 p.m. The very nice Oriental Plaza Mall is 10 minutes by foot [lots of restaurants] and a fun ‘me ga bite’ food court. The western end of the Mall ends on Wangfujing shopping street. Tian’anmen square and the Forbidden City are only an additional 10 minute walk west.", "helpfulness": 5, "user": "stltraveler_7", "date": "August 22, 2007", "id": 8472684}, {"rating": 4.0, "stay_parameters": "Stayed April 2007", "text": "The service at the hotel was superb. The staff was without exception very friendly and helpful. This was especially true of the front desk staff. Since we like to travel by public transit, we went to many sites [Summer Palace, Temple of Heaven, etc.] by bus. The staff would find out what bus number we needed to take and where to catch the bus. In addition, they would write out in Chinese characters where we were going, so the bus driver [or other passengers] could help make sure we disembarked when we needed to.", "title": "Good Choice", "helpfulness": 1, "user": "ATL_Mommy", "date": "April 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7483722}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The breakfast that was included with our room was excellent, with a wide variety of Western and Chinese dishes. It included eggs made to order, wonderful cut up melons, a pastry and cereal bar, fried noodles and sauteed veggies, steamed dumplings, etc, etc. Tea and coffee are served by the excellent wait staff. [Larger coffee cups would have been nice, but this was the only flaw in an otherwise terrific set-up.]", "title": "Very Pleasant Property", "helpfulness": 2, "user": "burnessis", "date": "April 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7299139, "likes": {"liked": "— Helpful Staff", "disliked": "— Pool under renovation at time of visit"}}, {"rating": 5.0, "title": "Super breakfast", "text": "The room we had was perfectly fine. The King size bed had a very comfortable mattress. Towels were big and fluffy, as were the bathrobes. Two small bottles of water come with the room per day. The room also has a quick heating tea kettle that we used to purify extra water for teeth brushing and drinking. We did not take a chance with the tap water. There is a 110 V outlet in the room for re-charging camera batteries, or whatever you need.", "helpfulness": 6, "user": "Melony", "date": "December 15, 2006", "id": 6444900}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 17, "average": 37, "very good": 146, "terrible": 4, "excellent": 72}, "aka": "Jianguo Garden Beijing", "slim_ranking": 0.0267948455717}