{"user_rating": 4.5, "review_count": 199, "name": "Johann Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Booked the Hotel Johann after reading the good reviews on tripadvsor and haven´t been disappointed.", "title": "Good choice", "user": "golfidian", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 14502385, "likes": {"liked": "— the breakfast buffet, the design", "disliked": "— the bathroom \"door\""}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The area is absolutely non-touristic which we liked and has good links to the U-Bahn and busses.", "title": "Wonderful stay", "user": "Daniele B", "date": "March 24, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 3.0, "value": 5.0, "rooms": 4.0}, "id": 14479924, "likes": {"liked": "— Room, cleanliness, staff, breakfast", "disliked": "— Lack of restaurants in the close vicinity"}}, {"rating": 4.0, "title": "Classy, Convenient and Affordable", "text": "Our standart room was very clean and minimalisitc; the glass bathroom door is probably not one of the best features but the heated bathroom floor makes up for that. The major plus was the extremely nice breakfast buffet and the relaxed, non-hotel-like feeling in the building. We liked it and probably will stay there again!", "helpfulness": 3, "user": "lazlototh", "date": "January 13, 2008", "id": 12566955}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with family", "text": "My family and I stayed at Johann during recent Easter holidays.", "title": "Great place to stay", "helpfulness": 2, "user": "Gulliver_Ron", "date": "January 8, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12448305, "likes": {"liked": "— The room", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "We can in principle confirm the comments of previous travellers.", "title": "Superb Value!", "helpfulness": 5, "user": "SRVP", "date": "November 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 10819944, "likes": {"liked": "— Great rooms and breakfast", "disliked": "— no desk service after midnight"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I chose this place based on tripadvisor reviews and was not disappointed! I booked 4 rooms for a small group, and they were slightly different but all impeccable in their minimalist style, and with a lot of attention to detail. The German style beds (two single together, no doubles) were comfortable, and the frosted glass door to the bathroom was not a problem for privacy. Staff was extremely friendly and helpful, and the included breakfast in the nice dining room was delicious. As others said, the area is safe and quiet (the slightly messier area is around Moritzplatz underground station, but you don't need to go there). Last but not least, we weren't charged a single penny upon reservation or check-in. We paid the whole balance at check-out, and cash payments had 3% discount.", "title": "A gem", "user": "eurotourist75", "date": "May 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 16128505}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "Great breakfast. New building, all rooms refurbished. Bright and clean, close to the metro station \"Hallesche Tor\" and \"Gneisenauer Straße\". You can walk downtown (just follow the Friedrichstraße from the subway stn \"Hallesche Tor\") in about 30minutes. Supermarkets near by. I liked it!", "title": "Quality at budget prices with friendly atmosphere in Kreuzberg", "helpfulness": 1, "user": "Nana81", "date": "May 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 16058370}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Date: 8 May 2008", "title": "Adorable little hotel", "helpfulness": 2, "user": "Florian08", "date": "May 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 15790213, "likes": {"liked": "— Atmosphere, cleaningless", "disliked": "— location"}}, {"rating": 5.0, "title": "Great hotel in a great city", "text": "Reviewer: Tania - Greece", "helpfulness": 2, "user": "Corinne76", "date": "May 2, 2008", "id": 15573429}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We stayed there for 4 days. It is a superbly clean, quiet and stylish hotel, not exactly in the heart of Berlin, but very comfortably located (the nearest metro and bus station are a 5 minute walk away, through a lovely park, along a river canal). Safe and absolutely non touristic area. Just across the hotel there is one of the finest german restaurants (\"Altes Zollhaus\"). The room was pretty spacious, very clean and pretty. The glass bathroom door is not highly recommended for new couples, as it may cause some embarassment..... It also had a small balcony, which for us smokers was pretty useful. The hotel has a very cosy breakfast room (where you should not expect scrambled eggs and bacon, although everything that is offered is fresh and delicious) and also a very nice backyard, where you can take your breakfast, if the weather is good. The owners are simply adorable, extremely polite, but in a relaxed and casual manner and always ready to make you feel you are more than welcome, almost part of a big bunch of friends. I loved it!! You will too, if you fancy small hotels with a relaxed atmosphere and a casual but absolutely professional attitude.", "title": "Good value", "helpfulness": 1, "user": "runningjohn", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 15506629, "likes": {"liked": "— Clean, great value", "disliked": "— Nothing in particular"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Hotel Johann is a really great hotel - the breakfast is fantastic, the rooms are clean and modern and a great size with fab bathrooms. It is in a more residential area but close to the subway which you will need to use if visiting Berlin (its very cheap, efficient and easy to navigate) but the area was no problem - I guess it's worth mentioning if you want to be right in the centre where the museums and galleries are. I will definitely stay here again and heartily recommend it on price, venue and facilities (breakfast, spa, small bar, minibar, bikes available and outside seating). Stay here!!", "title": "Fantastic Hotel", "user": "Sara28London", "date": "August 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 19392377, "likes": {"liked": "— The rooms/cleanliness/Breakfast", "disliked": "— a little off the beaten track but very easy access"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This is a really friendly, quiet hotel. I concur with everything other positive reviewers have described. The breakfasts are exceptional and the staff incredibly helpful. There is an excellent Italian reastuarant if you turn right and right again which is cheap but delicious. I can thoroughly recommend a stay here. There is a swimming pool adjacent to the station, no idea of the quality but it may be worth packing your trunks and finding out. I can also recommend the circular boat trip which departs just a short walk from the hotel.", "title": "An excellent choice", "user": "GerryP39", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 17024057}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "I was in Berlin for 10 days and thoroughly enjoyed my stay at the Johann Hotel. Great breakfasts, lovely room (although I booked one of the small ones), and the service was impeccable. I recommend it without hesitation. You can also rent a bike at a very cheap rate, but make sure you reserve it in advice because they only have 3 available.", "title": "Great value for money", "helpfulness": 1, "user": "raf89", "date": "June 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16916162, "likes": {"liked": "— everything was brand new", "disliked": "— not too close to city center"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "I stayed at Hotel Johann for almost a week during the chilly Berlin Winter. Overall I had a great experience staying here and would definitely do so again. Staff were very pleasant and helpful, my room was impeccably clean with great minimalist decor and the underfloor bathroom heating was a plus. The hotel is off the main tourist track, but close to a selection of good Kreuzberg cafes/shops, also near many public transport options. I rented a bicycle from the Hotel during my stay, which was a great option (only charged me 3 out of my 4 days rental, a nice touch!). Berlin is a wonderful city for cycling and although Hotel Johann is out of the city centre, this made everything very accessible. Good breakfast choices in a pleasant environment, wireless internet access, cosy yet spacious room, beds could be slightly more substantial, though definitely a great choice overall, good value too!", "title": "Loved it!", "user": "WandererWellington", "date": "June 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16631147}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "A super little place in a quiet neighbourhood and within easy access of two useful U-Bahn lines. It's a little off the beaten track but it's easy to get pretty much anywhere. A cab from Tegal costs just under €30 and it's under €10 to the funky areas of Mitte if you're coming back late.", "title": "Perfect little hideaway!", "user": "farnook", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16426716}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We stayed at Johann Hotel for 4 nights. we found the staff friendly and always helpful. Our room was exactly as expected as displayed on the website - spacious, clean and bright. Bathroom door, as pre warned, did not prove to be a \"major\" issue! no complaints! would stay there again!", "title": "Great Spot", "helpfulness": 5, "user": "funfi", "date": "October 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 10029306}, {"rating": 5.0, "title": "A stylish spot away from the crowds", "text": "We chose Hotel Johann based on the strength of the other reviews listed here and were not disappointed. Situated on a quiet residential street in Kreuzberg, the hotel is about a 10-15min walk from the Checkpoint Charlie area, with the high-end stores and wonderful restaurants of Friedrichstrasse, and about a 30min walk from Museuminsel and the Alexanderplatz area. There are a number of transit spots within a 5-7 min walk of the hotel, making this an ideal spot for the traveler who appreciates being able to reach other parts of the city easily, but doesn't want to deal with the crowds in the more touristy areas.", "helpfulness": 8, "user": "pompom79", "date": "July 27, 2007", "id": 8243709}], "location": {"country": "Germany", "continent": "Europe"}, "variance": {"poor": 0, "average": 4, "very good": 62, "terrible": 0, "excellent": 133}, "aka": "Johann Hotel Berlin", "slim_ranking": 0.039039039039}