{"user_rating": 4.0, "review_count": 289, "name": "John Jeffries House", "reviews": [{"rating": 4.0, "title": "Pleasant and inexpensive", "text": "We were looking for an inexpensive hotel in inner Boston which was not a chain. John Jeffries is an old hospital building converted into a hotel. It has a pleasant Victorian atmosphere, but the bathrooms are modern and the rooms pleasant. If one had wanted to prepare food the rooms have a small kitchen attached. The common rooms are lovely. It is accross the street from the T (metro) which is handy and just at the foot of Beacon hill so lots of nice restaurants are around the corner.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 2, 2005", "id": 3431642}, {"rating": 4.0, "title": "A little gem in Boston", "text": "Having based my choice on the reviews of previous visitors I was not dissappointed by the facilities offered at John Jefferies House.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "April 22, 2005", "id": 3398850}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "The location next to the T is excellent with plenty of eating places on the adjacent Charles Street. I used the hotel as a base for the Boston Marathon as the bus collection point to the start was a 20 min walk across the common.The finishing line at Boylsdon Street is also 20 mins away.", "title": "Small but nice rooms and great location", "helpfulness": 15, "user": "AnnMarieS", "date": "April 19, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3376171}, {"rating": 5.0, "title": "Perfect Location, Service, and Price", "text": "The view of the Charles River from my 4th Floor room was excellent. Noise levels were acceptable (mainly noise from the T which stops late at night anyway) Room (single) was well appointed if slightly small and breakfast choice could be improved.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 28, 2005", "id": 3096183}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "The room looked old and smelled musty when we first entered. The mattress was stiff and the bathroom was small.The breadfast was a bit of a joke and was very limited. One gets what they pay for. It is barely okay for the money and location.", "title": "old, musty and just adequate", "helpfulness": 3, "user": "calmkey", "date": "June 11, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5332106}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "A great location and value. Rooms are very clean and very reasonably priced, especially for Boston! The staff is very friendly and the service was exceptional. The location could not be better. The hotel is right across the street from the Red Line of the T. If you are coming from the airport, just take the Silver Line to the Red Line and you'll be at the hotel in less than a half hour. Also, if you are driving into Boston, you get a discount on the parking garage across the street.", "title": "Great Location and Value!!", "helpfulness": 6, "user": "spartanfan2006", "date": "June 11, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5331327}, {"rating": 4.0, "title": "A great find!", "text": "If I ever make it back to Boston, I will stay here again and not even look at other hotels.", "helpfulness": 11, "user": "Sally24", "date": "March 23, 2006", "id": 4726265}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "I found out about this hotel from a travel guide book and then checked out the reviews on Trip Advisor. This hotel had some wonderful reviews, so we went ahead and booked a junior suite (one queen bed and one sofa bed) for several nights in March. We absolutely loved the place, and highly recommend it. The location was right on the edge of Beacon Hill and just opposite a subway station. The hotel had a friendly feel to it, and we loved the free coffee, tea and fruit which was available 24 hours a day in the common room. Continental breakfast was complimentary, and there was always a good selection of pastries. Our suite had a small, but functional kitchenette, and was well equipped. The staff were helpful and made us feel valued as guests. We will definitely return.", "title": "Quaint Boutique-Type Hotel within Walking Distance to Everywhere!", "helpfulness": 12, "user": "frocha", "date": "March 8, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4595666}, {"rating": 5.0, "title": "Great location, beautiful hotel", "text": "Truly one of Boston's best-kept secrets. Beautiful, superbly maintained accomodations. A 56-yr-old couple in just-average shape, we easily walked just about everywhere from this great home base -- North End, Marketplace, Holocaust Memorial, Faneuil Hall, Financial District, Boston Common, Esplanade: Hotel is right at the nexus of Charles St., Cambridge Ave., and the bridge to Cambridge. Check the map --that gets you just about everywhere. Our room had a wide view of the Charles River and Cambridge. We took the \"T\" to Harvard and MIT, as there's a station right out the front door-- but so is the bridge, and we actually could have walked had there been more time. Max. 20-min ride to/from Logan airport via taxi or \"T.\" If you require parking, bellhop service, etc., go dowtown to the Parker House. But if you can make your own creative alternative arrangements for any vehicle you might have, can wheel your own luggage upstairs on the same carts they use at the Parker House, and want a place as tastefully decorated and meticulously maintained --for less money and more strategic location-- stay at the John Jeffries House. A lot of street construction at adjacent intersection greeted us when we arrived, and the chute of an elevated section of the \"T\" --unsightly wherever that is. But take ten steps from the door up Charles St. or Cambridge Ave., and you realize where in Boston you're really at. So don't let the unfortunately-situated city-maintenance grittiness faze you --and just wait until you step inside the hotel. It's refined, downright fancy, and gorgeous/spotless everywhere you look. No place else we'd want to stay when we return to Boston.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 20, 2005", "id": 3688884}, {"rating": 1.0, "title": "Someone had duplicate key and invaded my room at nite and woke me up!", "text": "Another guest across the hall keys fit MY ROOM. Their key unlocked my door and I was awoked in the middle of the night scared to death. If I had a gun, they may have been shot. They were as distrubed as I was; however, the staff and manager acted like it was nothing and did nothing to rectify the invasion. IT WAS NOT SAFE and I had to stack up chairs against the door which still did not correct the unprofessional handling of this matter. They didn't even reverse the charges of a room of which I left as soon as it was daylight and found another SAFE hotel.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 28, 2005", "id": 3617293}, {"rating": 4.0, "title": "Great place, location and price", "text": "This is a very nice place to stay with an excellent location and rates that are great for Boston. We stayed six nights in mid-May and had a great time. The \"T\" (MBTA) stop is right across the street and Boston Common is just six short blocks down Charles Street. There are several great restaurants on Charles St and downtown, the North End and Back Bay are just a short \"T\" ride away.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 3, 2005", "id": 3523356}, {"rating": 4.0, "title": "Great location and reasonable...", "text": "The staff was great- we took the red-eye from California and arrived at the hotel at 11 a.m. We had e-mailed ahead and were told they would try their best but couldn't guarantee the room would be ready until 2 p.m. But upon arrival, our room was already ready and we had the impression it had been one of the first rooms made up that morning.", "helpfulness": 6, "user": "traveleradlib", "date": "May 25, 2005", "id": 3499180}, {"rating": 4.0, "stay_parameters": "Stayed July 2004", "text": "The room had a micorwave and small refrigerator which was very nice to have. Our room had a queen bed and a sofa bed, both were very comfortable. The rooms are converted from the orignal nurses dormitory for the Mass Ear & Eye Infirmary and the place has a great charm because of this. The gathering room on the 1st floor is a great place to sit and read or meet folks. The contienetal breakfast was ok, enough to get us through to lunch, but if you want a big breakfast, there are several good places near by.", "title": "A great place to stay", "helpfulness": 4, "user": "greenbranches", "date": "May 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 3489311}], "location": {"country": "United States", "city": "Boston"}, "variance": {"poor": 19, "average": 30, "very good": 147, "terrible": 11, "excellent": 82}, "aka": "John Jeffries House Hotel Boston", "slim_ranking": 0.478260869565, "detail_rating": {"service": 3.5, "cleanliness": 4.5, "value": 3.5, "sleep": 3.5, "rooms": 4.0, "location": 5.0}}