{"user_rating": 4.0, "review_count": 202, "name": "Johnston Canyon Resort", "reviews": [{"rating": 1.0, "title": "dissapointed", "text": "I booked a getaway weekend for myself and my boyfriend for september long weekend. Got very very excited and then checked my email randomly and received an email saying that \"We're sorry but the cabin you booked is unavailable.\" \"oh but you can have this other cabin for 219 a night\" (i booked it at 150). so if I never checked my email i wouldn't have even known. THANKS for ruining my weekend we were very very excited about. Now all hotels and accomadations are very overpriced due to the long weekend. very dissapointed.", "helpfulness": 1, "user": "jess2ewing", "date": "July 9, 2013", "id": 166992613}, {"rating": 2.0, "title": "Very Disappointing", "text": "We were very excited when we booked a cabin at this resort but we were very disappointed during our stay. We arrived at 2:30 to check in but we couldn't get in until 4:00 which is understandable so we went to restaurant to have something to eat. The food was terrible and the servers weren't friendly. When we went to check in they told us it would be atleast another hour before we could get into a cabin! Not impressed seeing as how we were travelling with two small children and were paying over $300.00 a night. When we finally did get a cabin it was nice and cozy but FULL of mosquitos! The hike to the falls was gorgeous but we were not pleased with the resort, we will not be staying here again.", "user": "Janda W", "date": "July 5, 2013", "id": 166411381}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "not wanting to stay in busy banff townsite, we booked a \"4 person classic bungalow w. kitchen\" at johnston canyon resort, which we tracked down on the internets. we booked the room online and over the phone in the spring, and paid ahead for the cabin (i forgot about this, so was pleasantly surprised to learn that our stay was 'free', in the sense that i didnt have to pay (again) for it).", "title": "into the mountains, june 2013", "helpfulness": 2, "user": "sebastian t", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164896046}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "we arrived just before dark, which was too bad, as it would have been quite nice to walk around the grounds a bit more than we did. we had bought groceries in golden, and got to work making dinner in the thoughtfully-furnished kitchen.", "title": "Super scenery and good value", "helpfulness": 5, "user": "Lisanne D", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161630271}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "the ladies in our party loved the slipper tub in the large 3-piece bathroom, and it was very nice to have a 2-piece washroom too. the rooms were amazingly nice -- my partner kept commenting on how nice the bedding was. we enjoyed using the gas fireplace, and if it hadnt been raining we would have tried the wood fireplace! options galore. the cabin had a wonderful historical feel to it -- the recent renovations blended in quite nicely, but without trying to 'fake' the heritage look.", "title": "Enjoyable Stay and Wonderful Location", "helpfulness": 9, "user": "Fran L", "date": "April 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158319900}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The Johnston Canyon cabins have a great character and fit right in with the rugged landscape. This is not luxury but it is an experience. A good variety of cabins to meet different needs, some have more space and facilities than others. Good location between Banff and Lake Louise. The canyon trail is a good activity. Only complaint was the staff, the girl at registration seemed inexperienced and was not friendly, the room cleaning was inconsistent. Great place, We have stayed there many times over the years and will definitely be back.", "title": "A unique Rockies experience", "user": "sloach", "date": "July 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170034805}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We arrived to find our cabin filthy and full of mosquitos. I had to clean the fridge, the sink had cherry stems and rotting blueberries in it and there was scum on the floor of the shower and our tub! Yuck! Not impressed...then to top it off the last morning we are there, I am searching under beds and behind furniture for our own belongings, only to find a pair of women's underpants and a bottle of half-drunk water. How deplorable. For the cost of these cabins I would expect a very clean establishment. This is not the first time we have stayed here and the first was excellent, so I am very disappointed at the conditions this time.", "title": "Very Disappointed", "helpfulness": 1, "user": "Courtney K", "date": "July 29, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 169551040}, {"rating": 1.0, "stay_parameters": "Stayed July 2013", "text": "The views were stunning and cabins were basic but the hospitality was beyond brutal. The staff were very unaccomodating. We tried to check in 30 minutes before the unadvertised check in time and the reception would not even check if our cabin was available to check in. The girls merely brushed us off and claime they were short staff and told us we could order food at their restaurant on site while we had to wait. We went to their restaurant and were greeted by the waitress after 10 minutes of sitting down. We asked for water and menus. She left and returned to greet another table 10 minutes later and didn't even have drinks for us because she probably forgot. It would be understandable if it was busy but there were only 4 other tables seated in the entire place. Later that day, we tried to eat at the restaurant for dinner and the waitress rudely told us that dinner isn't served until 6 and we can eat in the diner if we wanted food. So we went to the diner and it wa absolutely brutal. I would not even call the girl a waitress. She messed up my food order , and thee food that we had was undercooked. She was very busy in the kitchen as well. We heard lots of screaming and yelling. We could tell the other tables were unhappy as well with her service. Her name was elyse. Her customers kept rolling their eyes as she walked away. 95% of employees overall have no consideration, accountability, or hospitality. 4 star cost for -10 star service. I am the type of person that is nice and this is honestly my first time ever posting something so negative about anything. I dont ever expect to br pampered but i do expect people to be caribg and considerate, especially in the hospitailty and tourism industry. Never coming here again except to hike.", "title": "Terrible hospitality", "helpfulness": 3, "user": "Danielle M", "date": "July 28, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 169545053}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "he classic cabins were comfy, clean, and", "title": "Great place to visit again!", "helpfulness": 2, "user": "Jeremy S", "date": "July 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 169169692}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "timeless. We want to thank the staff and", "title": "Rugged and Righteous", "helpfulness": 1, "user": "Senor-Brian", "date": "July 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 169154221}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Johnston Canyon is a great place if you are self sufficient and don't want marble floors and fancy powder rooms. We have stayed here for years and years and love it. We like the rustic cabins and the staff are generally pretty good. There are some staff that could use a tune up though. We had some pretty poor service in the dining room this year . Not impressed by this considering we have never had a complaint till now. There should be more staff in the dining room to accommodate patrons properly. Spray for mosquitos before the place opens and keep the doors shut for a while. The room cleaning left a bit to be desired this year as well. Make the bed properly and re stock room supplies. Spray for bugs before you leave please! Other than that, we had a great time and will definitely go again for as long as the resort remains.", "title": "Rustic and Scenic resort.", "helpfulness": 2, "user": "Jessie J", "date": "July 25, 2013", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 169004998}, {"rating": 1.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Stayed in multiple places from Calgary, Drumheller, Edmonton, Jasper, Lake Louise, Field, and Banff on a two week road trip around beautiful Alberta. I have taken many road trips, which I plan myself, and rely upon trip advisor in making decisions about where to stay. Trip advisor failed miserably regarding Johnston Canyon \"resort.\" The unit we stayed in was a dump. Paint was peeling off the outside of it, there was a large gap under the door, the bedding was worn, the mattress was lumpy, the pillows were lumpy, the towels were ratty and shredding around the edges, and there was a layer of dust on everything. The windows could only be opened the height of the dowels that were provided to prop them open. When we arrived to check in at 3:45 after a day of driving, sight-seeing, and hiking, we were told that they didn't know about room availability yet as they had a skeleton crew. We could go check out the restaurant for food/drink and come back. We took a drive and magically at 4:05, they could check us in. Basically, they don't check anyone in until 4. The two girls at check-in were rude and didn't even welcome us. We were going to grill, but you need matches to start the gas grills because the starters don't work. I tracked down an employee doing laundry to see if there were any matches or lighters - none. I did see where the towels and bedding were done - scarey. It is an old shed with dirt on the floor and a wooden table with junk all over it. I did not see any clean space for folding and storing what was in the machines. This place has so much potential if someone would invest money in upgrading. The location is ideal. Our unit overlooked the beginning of the trail and creek. Stay at Paradise Lodge and Bungalows in Lake Louise - it will be well worth it. You will see how this property should be maintained. This is a true evaluation of the property. Please heed the advice and do not waste your money by staying here. I question the validity of all of the positive reviews.", "title": "Outdated run-down accomodations to avoid", "helpfulness": 10, "user": "NCRoadTripper", "date": "July 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 168919244}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Recently spent a Saturday night out at the Johnston Canyon Cabins. My wife and I were in Unit 21, not a great view,but it had 2 nice adrionak chairs on the porch , comfy bed, space to sit in the cabin (couch , chair) dated but funny in 1950s way. Gas fireplace which kept the place nice and warm (my wife loved this), small bathroom with shower. They do have a tv with vcr but really your in the mountains people, do some reading. Recommended bug spray! Our wireless service worked well here. It was to bad we couldnt have gotten a cabin with a mountain view or wood fireplace but of course you will pay more. If you are never in a mtn setting then spend the $$$ for the upgrade, my wife and I spend a fair amount of time in the mtns so it wasnt our priority.Bring a candle as the cabin we stayed in was musty but comfy. we brought a cooler full of goodies as it can be costly to even buy ice form the store.We spent the day taking in the Falls and had a great dinner at the onsite restaraunt. Bison/Brie burger was tasty as so was the halibut fish n chips. If you do want to see the Falls do remember that this is a trail that will be busy (hectic) during summer months, Fall is always best for less traffic. The trail to all the fall areas are quite busy but tend to thin out after 530pm or go early AM. The next morning we headed on the trail to the Inkpots. All tho it is an easy hike , bring proper shoes, water, sunscreen and food. You do an elevation climb that will be worthy of a few snacks and beverages. From the start of the falls pathway to the Inkpots (thermal pools which generate different hues of colors) and about 30-60 relax time at the Inkpots you are looking at about 4-5 hour hike time. The views of the open field with the mountain ranges that surround you will mesmerise you. The river last week was running fast and hard and the ravages of the flood water can be seen as some bridges were washed away and plenty of driftwood is piling up. The inkpots werent there usual self as they usally are more vibrant but water was running through spots I had never seen happen before. All in all a great family place or escape for lovers of the outdoors. A nice quiet quick 24 hour break from the rat race. Fall is best as the crowd thins out a ton", "title": "Johnston Canyon charm", "helpfulness": 1, "user": "Vikinghiking", "date": "July 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 168743042}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The place was quaint and nicely secluded. It was", "title": "Majestic scenery and great value", "helpfulness": 4, "user": "Jesse R", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167809761}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "most pleasant to get away from the crowds of the city", "title": "Rustic and very clean", "helpfulness": 7, "user": "sunlover57", "date": "July 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 167732872}, {"rating": 1.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The refund process at this establishment borders on fraudulent. We made a reservation on 10/12/12 for the upcoming summer. My card was charged a deposit on 11/05/12. Due to medical problems we notified JC that we would have to cancel and asked for a refund less the service charge on 1/26/13 by email. Hearing nothing, I sent another email on 2/13/13. Hearing nothing, I sent another email on 3/9/13. I have tried calling directly on 3 different occasions as well but it is not possible to leave a message as \"this mailbox is full\". It is unfortunate that one has to go through such a trial for such a simple transaction. A bad taste will linger.", "title": "Pray that you do not have to cancel your reservation", "helpfulness": 7, "user": "Cathy B", "date": "March 27, 2013", "detail_rating": {"service": 1.0}, "id": 155800516}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We appreciated the service and amenities. The location was great and we found the meals", "title": "Place was great", "helpfulness": 11, "user": "Larry N", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148382477}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "very good. The cabin we had was very well placed and the weather was very cooperative. We were grateful for that as we heard they had a heavy rain that affected the creek awhile ago but offered amazing photo opportunities for the creek levels.", "title": "Room and Setting are absolutely wonderful", "helpfulness": 8, "user": "joseph L", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148167197}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The people were delightful and helpful too.", "title": "A most pleasant outing", "helpfulness": 10, "user": "Jackie L", "date": "December 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 147267747}, {"rating": 5.0, "title": "This exceeded our expectations.", "text": "We found the place very friendly and all the employees were no nice and helpful with our", "helpfulness": 5, "user": "BW82012", "date": "November 27, 2012", "id": 146322735}], "location": {"country": "Canada"}, "stars": 2.5, "variance": {"poor": 20, "average": 17, "very good": 58, "terrible": 11, "excellent": 96}, "aka": "Johnston Canyon Hotel", "slim_ranking": 0.2, "description": "Banff cabin and cottage/chalet rentals between Banff and Lake Louise."}