{"user_rating": 4.0, "review_count": 147, "name": "Jollydays Luxury Camping", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The woodland setting is wonderfully tranquil and easy to find from the main roads around York. The owners were lovely and made you feel welcome as well as being easily contactable via phone if there was a problem.", "title": "We will never do 'normal' camping again", "helpfulness": 1, "user": "Deepestblue", "date": "July 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71936904}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "The tents have a shabby chic style and were as clean as you could expect them to be with all the creepy crawlies around! The little wood burner stove inside the bell tents is brilliant and really kicked out a lot of heat when it got going, making you feel warm and toastie when the inevitable British summer rain comes along.", "title": "Amazing Place, What a fabulous weekend we've just had!", "user": "ThirskBella1974", "date": "July 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 70750563}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The kitchen hut was really well stocked with everything you could need (I can't count how many times I've forgotten the cork screw and tin opener on camping trips), the gas hob worked well and the cool box with frozen hot water bottles is a great idea (though I wish the bottles had been supplied a bit more frequently).", "title": "Not my idea of luxury camping", "helpfulness": 4, "user": "ThomasNorthampton", "date": "July 6, 2010", "detail_rating": {"cleanliness": 1.0, "sleep": 1.0, "location": 4.0, "service": 2.0, "rooms": 1.0}, "id": 69893750}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "The shower and toilet facilities were very clean and tidy and looked brand new.", "title": "Great Nights sleep!", "user": "Dawb", "date": "April 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 62382038}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 12, "average": 8, "very good": 40, "terrible": 7, "excellent": 80}, "aka": "Jollydays Luxury Camping Hotel Scrayingham", "slim_ranking": 1.0, "description": "“Britain’s finest camping experience” Janey Lee Grace, Radio 2 DJ and Best Selling Author This multi award-winning camp was set up by design couple Carolyn and Christian Van Outersterp who had previously masterminded London’s stylish restaurant bar and discreet celebrity hang out CVO Firevault.Jollydays Luxury Camping is the culmination of the Van Outersterp’s 15-year dream to combine a love of camping and chic hotels – it’s an extension of their simplified lifestyle – beautiful surroundings, great food and socialising around a roaring log fire.For the kids it’s heaven on earth (even those addicted to their Playstations).“Fantastic, brilliant… I feel like the favourite son of a Bedouin prince – it’s amazing”. Alexander Armstrong, Comedian and TV Presenter.This is a unique British Camp with a lovely communal feel – a tea tent and campfire are at its heart and the camp appeals to families, couples and groups.The Deluxe Lodges are particularly superb, they have huge wood burners, 4 poster beds, fridges, roll top baths, loos, fully equipped kitchen and an outside dining area.Jollydays is ideally situated close to York (less than 2 hours from Kings Cross), close to the Yorkshire Wolds, an area of Outstanding Natural Beauty and the Moors National Park."}