{"user_rating": 3.5, "review_count": 2314, "name": "Jolly Beach Resort & Spa", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "Rooms: The room that we had to spend the first night in had no ceiling fan but it did have an air-conditioner. Also there was a cockroach in the corner of the room. This was the very first time I had discovered cockroaches in any room. Others have written about bugs in the room at JBR but on our other trips to JBR we had never seen any bugs.", "title": "Personal Review of Jolly Beach Resort, Antigua - Feb 7, 2005", "helpfulness": 6, "user": "seasun", "date": "February 11, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 3179725}, {"rating": 4.0, "title": "I had a great time", "text": "- The second room provided for us was just what we had expected and it was lovely. We only book a Standard room as there is only the two of us and a Standard room is fine for us as we only use our room to sleep in. I did kill a 1” spider in the bathroom and it was four days before the housekeeping cleaned it away.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 11, 2005", "id": 3179350}, {"rating": 3.0, "title": "Not fancy but had a great time", "text": "Food: JBR is only a 3 star resort. But the food is wonderful. There is such a variety to meet everyone’s tastes. If one wants a “Nouveau Cuisine” meal placed before them then all of the ingredients are available for that type of meal in the buffet – assemble your own plate.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 11, 2005", "id": 3179232}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "For breakfast the buffet had available hot omelettes, boiled eggs, fried eggs, scrambled eggs, sausages, bacon, fried potatoes, cereal, fruits of all types, cheese, yoghurt, breads, croissants, buns, and cakes. (We disliked the fried potatoes as they were all soft and soggy.)", "title": "Awesome place", "helpfulness": 10, "user": "newhamsphireof4", "date": "February 10, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3176521}, {"rating": 3.0, "title": "Not the best... but a good time anyway", "text": "For lunch there was a different soup each day (love their soups!), BBQ’ed meat and fish, hot food dishes, cold meat slices, tuna and egg salads, salads of very variety, a pasta hot plate with sauce, desserts of all types, buns. At dinner there was a different type of meat – turkey, ham, steaks, lamb, etc. and all types of salads, rice, potatoes, lasagne, stew, desserts, veggies. I think I ate so many varieties of fish: tuna, mahi, red snapper, swordfish, sole, grouper, salmon – and the list goes on and on. They were all fabulous. I cannot understand why anyone would ever complain about the food at any meal.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "February 7, 2005", "id": 3166896}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "WOW! What a run down, out of date resort! The Rooms were pretty clean, but the staff seemed mostly uninterested. The place outside of the building looked like it was about to be foreclosed on. The main thing that turned me off was the fact that their were small birds all over the breakfast buffet and dinner area. the birds were literally landing on food, and eating it, and don't even think of getting up from your table, or your food is stolen by a barrage of birds! They were even drinking from the taps out of the daquiri machine, and no staff seemed to think much of it! REALLY!!!! If you value your health, stay elsewhere!", "title": "Are they Kidding with this Place?", "helpfulness": 3, "user": "Ken L", "date": "February 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 125371835}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This is a 3 star Hotel can i just remind people ,with one of the best beaches on the island.We have been to Antigua 9 times on the trot and just love this fantastic resort.We have stayed at The Rex 9 years ago St James Beach club Sandals, and Jolly Beach each time we come with the Kids.We have just been for my husbands 60th to JB and again had afantastic time luv to THe amazing Ann Marie and Coffy and all the great staff that make this resort truly value for money we will go back there again nothing will have changed yes it will still be tired but life is a beach and Jolly Beach makes up for everything enjoy", "title": "Jolly Beach Rocks", "helpfulness": 9, "user": "obeedge", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125342921}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We traveled with our 16 and 20 year old sons the week of February 19, 2012. Upon arriving at the resort, we were disappointed to see the state of the beach chairs and chairs at the beach grill. We have done quite a few islands in the Caribbean and while we enjoy beautiful surroundings, we are not overly picky (like some reviewers!). Our main concerns is a great beach, decent, tasty food and a clean room.", "title": "Resort will grow on you as week goes on...", "helpfulness": 1, "user": "ottawa026", "date": "February 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125315574}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Jolly Beach is great - the water turquoise with fine sand. The beach is about 1.5 km in length. The width is also great, with lots of room for chairs - the problem is the chairs are somewhat in disrepair. You can find chairs, however, if you search along the beach in front of the resort. We are not the type to get up at dawn to get a chair....!", "title": "UN-accommodating", "helpfulness": 1, "user": "Jen D", "date": "February 26, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 125260618}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The food was 'ok', nothing more. The breakfast was good, with 2 omelet stations. The grill at the beach served pretty good jerk chicken (not as good as Jamaica!) and burgers/hot dogs/grilled cheeses with lots of fries (not what we like - but a hit with our sons). The a la carte were ok, as was the lunch and dinner buffet.", "title": "Wonderful Beaches!", "helpfulness": 2, "user": "Luvmyfoxtrotter", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125250674}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We had a lovely time, the beach is wonderful. We took the Treasure Island Cruise around the island and had a great day, it was lovely to see the island from the water. We also rented a car for one day and toured the whole island which was a great experience especially when they really don't have any road signs but you really can't get lost as it only takes 45 minutes from one end of the island to the other. We hopped onto the local buses several times and they are great.", "title": "Great value for money wonderful staff", "helpfulness": 1, "user": "TBetchley", "date": "March 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98997175}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "Antigua is a very friendly island and the people are really helpful.", "title": "Beautiful Beach, nice pool, horrific beds.", "user": "Skych8ser", "date": "March 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 2.0}, "id": 98927360}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We would definitely recommend this resort, yes maybe some of the rooms need a lick of paint but everything was cleaned everyday and we certainly had no complaints.", "title": "Jolly good at Jolly Beach", "user": "caribbeans270211", "date": "March 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 98709628}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "The food at all the restaurants was quite fine, we tried all the a la carte restaurants and thoroughly enjoyed our meals. They put on several different evening entertainments which were always thoroughly enjoyed.", "title": "Amazing Holiday", "user": "bobs54", "date": "March 2, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98651912}, {"rating": 5.0, "title": "Great week at Jolly Beach", "text": "We would go back to this resort.", "user": "Yankee63", "date": "March 1, 2011", "id": 98519441}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I arrived a Jolly beach on a Sunday. I stayed for 8 nights. The room was smallish, but I did not go there to spend the trip in my room. It was a room with working A/C, it was clean the shower was awesome, except it leaked all over the floor, and the beds were relatively comfortable. The beach was beautiful, water crystal clear, white sand, and your standard beach vendors bugging you to buy their stuff. There are two pools, one that is on the smaller side, but it is quiet. The big pool had a waterfall, the pool bar and was right at the foor of the beach. The food was actually pretty good. There are 4 resturants. An Indian one, an Italian one, A seafood one and the buffet. It is 25 mins from the airport, and 20-25 mins from Heritage Quay shopping. $20.00 taxi ride one way. The staff was nice, hospitable. I am in school online so I was able to do my classes from the lobby, and occasionally on the beach, but not in my room. I didn't get to have a massage at their spa like I wanted, I guess I just lost track of time. There is a wedding chapel up on a hill over looking the big pool and the beach. I enjoyed myself. I was a single traveler and at no time did I feel unsafe!! Would I go back...yes.", "title": "Amazing Beach, safe for singles", "helpfulness": 7, "user": "kksox", "date": "March 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 126068075}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My husband and I just returned from Jolly Beach. This was our third trip there. I've wrote reviews the last couple of years, so I won't go in to all that again. Over all, though, it is a 3 1/2 - 4 stars. The rooms are lacking in some respects, as with the food, also. But the beach, pool, and entertainment staff more than make up for it. If you go, PLAY the games! It makes it all so much more fun. I have more of a problem with the dead-beat guests than anything else. There were times where it would just be me and a few other people playing with the entertainment staff. Ann-Marie, Sandra Ann, Elroy,and Ranee are loads of fun. They make a point to know your name and remember it. Some of the other staff ( the towel lady! and the reservation women.......not so friendly ) All in all, we've had three great trips there and would deff. go back. We've been to Sandals numerous times and love it there, also, but it's also twice the price. It depends a lot on what is important to you.", "title": "Another Wonderful Time At Jolly Beach", "helpfulness": 5, "user": "IndianaSunnygirl", "date": "March 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125951519}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Our booking at Jolly Beach was a very special getaway for myself and my daughter, and it did not disappoint, giving us a totally relaxing break in a beautiful location, wonderful weather, friendly staff and a trip to remember. We read all the good and bad reviews as well as all the hotel information, and were a little concerned. However right from our arrival on the Island, we were greeted and treated to the warmest hospitality and the biggest smiles - nothing was too much trouble, and the staff at Jolly Beach (in particular Neil, Alwyn and Dwayne) treated us as 5 star guests.", "title": "The most hospitable staff - AMAZING beach - great break", "helpfulness": 7, "user": "sibillini", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 125886953}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The position of the hotel was incredible, beautiful grounds that were well manicured and a beach that was spectacular (one of the best of the 365 beaches on Antigua) and so much more even than Sandals Resort.", "title": "well worth a visit and i would return in a heartbeat", "helpfulness": 7, "user": "aquillath", "date": "March 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 125864405}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "This may be a 3.5 star hotel that provides small, but comfortable, clean rooms but the food was good, especially Lydias right on the beach, and there was always something different. If you prefer a quieter room, check when booking - there are plenty to choose from.", "title": "Bad choice", "helpfulness": 5, "user": "bemacol", "date": "March 8, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 125801236}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Jolly Beach was excellent for a three star resort. We stayed from the 4th of march to the 8th. The staff was very friendly and helpful. We were upgraded from a standard room to a superior room for free, I dont know why.... and I didn't ask. It was very spacious room, not quite as much of an oceanview as advertised, but very nice. Also it was like a 8 minute walk to get to the main resort area, but how can you complain, the grounds are so beautiful and it was good exercise. Food was ok at Hemispheres. Bocillos, the Italian resaturant was excellent we ate there two nights... dont forget you need reservations. The Beach was absoultely BEAUTIFUL, and not crowded... everyone will try and sell you jetskiing and horsebackriding trips, but they are polite when you just say no. The resort puts on entertainment everynight which was great, especially the Antigua Dance Academy, was outstanding. I defiantly recommend this resort to anyone... great value for the price.", "title": "Great Time", "helpfulness": 10, "user": "crk723", "date": "March 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3273324}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "There have been several detailed opinions here which I definitely concur with. Jolly Beach Resort is very tired and in definite need of a total refurbishment. We still tried to have a good time.", "title": "Tradewind Tours and Jolly Beach Resort-March 7-11, 2005", "helpfulness": 13, "user": "maryannesk", "date": "March 13, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 3269892}, {"rating": 1.0, "title": "Words Fail Me", "text": "I have a few details to add which may help others:", "helpfulness": 33, "user": "A TripAdvisor user", "date": "March 12, 2005", "id": 3268270}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "-It may be part of the culture, but I found that the customer service attitude is \"It is, what it is\". There is usually very little push to go the extra mile. For example, Tradewind Tours Company. I made the reservations on Jan 14 through Tradewind Tours because it showed on the Jolly Beach Resort website that all the rooms were sold out. Strange, but Tradewind Tours found empty rooms. As the date got closer, I looked at the JBR website again and saw they now had empty rooms. So, I'm guessing, but it looks like JBR works with the Carribean Tour agencies to hold back the rooms for them. Okay, so working with a travel agency, I should get some advantages. NO! As I said, I made the reservations, Jan. 14. On Feb. 1, I received an e-mail from Tradewind Tours telling us that our USAirways flight reservations were now changed. To sum it up, we would now have a layover of an additional 7 hours at the San Juan Airport EACH WAY. The attitude from Tradewind Tours was, well sorry about that but that's the way it goes. \"We can do nothing about changes the airlines make. You can't get your money back\". I called US Airways and told them that an additional 7 hour layover each way was unacceptable. They told me that an \"Involuntary Change\" which this was, allowed a total refund and the travel agency should know that. Tradwind Tours did not know that.", "title": "Great Vacation", "helpfulness": 11, "user": "Rainy", "date": "March 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3261892}, {"rating": 4.0, "title": "JBR: Three & a half stars", "text": "So, if you're going to JBR, I would say do not use Tradewind Tours-try to directly book your rooms with JBR.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 8, 2005", "id": 3259551}, {"rating": 4.0, "stay_parameters": "Stayed April 2005", "text": "We are just back from an excellent two weeks at Jolly Beach resort and have plenty of good memories from our best Caribbean holiday yet.", "title": "Just returned from Jolly Beach.....", "helpfulness": 28, "user": "......", "date": "April 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3355947}, {"rating": 2.0, "stay_parameters": "Stayed April 2005", "text": "There is a huge amount of things to do and activities to take part in if you so wish but if you plan to have a relaxing holiday on a mile long white sandy beach then this is also the place for you.", "title": "Not Impressed", "helpfulness": 8, "user": "B'sMonkey", "date": "April 12, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 3353155}, {"rating": 3.0, "title": "A Family Resort", "text": "I agree that the rooms are small - we had a standard which was ok for the two of us - certainly not a city size room but adequate and our bathroom door was a bit creaky but the sea view was unbelivable with glorious sunsets over the distant island of Nevis. The room was kept clean and was far enough away from the nightly entertainment for us to get some peace.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "April 5, 2005", "id": 3331616}, {"rating": 4.0, "title": "Great Vacation!", "text": "Having hired a car and taken a few boat trips we were lucky enough to see most of the island's beaches and I believe that Jolly Beach is by far the longest beach and best looking resort on the island.We found the service to be friendly,the food in all the restaurants was good especially Utsav's Indian Restaurant but you have to book well in advance to get any other than Hemisphere's buffet which was quite good most of the time.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "April 4, 2005", "id": 3328126}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Yes there are birds hopping around the food areas but have found this to be a problem in every Caribbean resort we have been to.", "title": "A Great Holiday", "helpfulness": 12, "user": "Eire", "date": "April 4, 2005", "detail_rating": {"cleanliness": 4.0, "rooms": 3.0, "value": 4.0}, "id": 3326970}, {"rating": 3.0, "title": "great time", "text": "My husband and I just returned from JBR Feb.11- 18th. We were not happy with the super saver room, they are very small with no furiture except the bed. The food is fair to good, nothing to write home about. Lydia's Crab Shack was by far the best speciality resturant although the Italian place was good too. Janis and Neal the night time bartenders were great and lots of fun. If any of you are going to JBR tell them hello from Sharon and Dan from Baltimore, Md.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 25, 2005", "id": 3230855}, {"rating": 2.0, "title": "I wouldn't return", "text": "The beach was great although you will need water socks, because the shells are hard on your feet. The offshore Hobie cats are redily available and the sailing was great. There were lots of pool activities and the staff worked hard to show a good time to all with a varity of activities. The cyber room staff are very helpful, but its exsensive to be on the pc's 10.00 US for ten minutes.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 25, 2005", "id": 3230786}, {"rating": 1.0, "title": "Pathetic excuse for a resort", "text": "Consider taking a walking tour to Coco Bay the locals will help you with directions and the walk was a great change of pace from the resort.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3224691}, {"rating": 4.0, "title": "lovely resort", "text": "We went into St. Johns for some shopping. The market stalls pretty much had the same stuff. Save your purchases and hit some of the better shops first. We saw some good deals and the merchandise was of better quality.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3224133}, {"rating": 4.0, "title": "Had a Great Time at Jolly Beach from Feb. 13th to 18th!!!", "text": "If you are into the tours, we recommend the circumnavigation of the island and the snorkle trip to Cades reef as well. The staff on the Wadadili Cats are all very fun. the nightly entertainment was fair depending on the act. Don't miss the steel brum band and join in the fun. All in all, had a great time but we would visit other islands before coming back.", "helpfulness": 7, "user": "awesomedlogtoys", "date": "February 22, 2005", "id": 3215565}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My husband & I stayed at The Jolly Beach Resort from Feb.26-March 4 and this was our first trip to Antigua and also our first stay in a 3.5 star hotel,we usually stay at 5 star hotels.After reading most reviews from here,I wasn't so sure we had made the right choice,but it wasn't so bad after all.The hotel was constructed in 1979 and needs to be updated.", "title": "The good & the not so good", "helpfulness": 11, "user": "Shealeen", "date": "March 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125780417}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "ROOM:We stayed in a standard room with a king size bed with a partial view of the beach.We were in room 3014.Room was clean but needs to be updated.We did have tiny ants in the bathroom,but they were near the ceiling and seemed to come in from the window and headed straight to a small hole in the ceiling and there was always a couple around the sink,but no big deal.Shower was tiny but great water pressure and also you can drink the water and there is no danger.They do not provide bottled water,but you can purchase some at the gift boutique.Maid service was usually late in the day and getting clean towels was usually an issue every 2nd day.", "title": "A fun place with some issues", "helpfulness": 10, "user": "Ottsville_PAJohn", "date": "March 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 125717341}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "FOOD:Buffet food at Hemispheres was good but not much selection and sometimes you had to wait for clean plates.Coffee was terrible.If you want to be seated outside expect to wait,staff are in no hurry to seat you.Seafood restaurant(Lydia's) was beautifully located on the beach,food was very good,but all week they were lacking items on menu such as lobster tails.Italian restaurant was also very good,but there is not a wine list if you want to order a wine at your own expense.The Indian restaurant also had great food.For lunch you can also go to the Coconut Grill located near one of the pools and on the beach and their food was really good,choice of hamburger,hot dog,grilled cheese with or without ham,jerk chicken,fried chicken and served with fries,all items were delicious and prepared on the grill fresh.There is also a bar right next to it and a covered area on a second floor to eat.Meals served in a plastic basket and you can eat on the beach without any worry of seagulls.", "title": "Wonderfull resort, just chill.", "helpfulness": 6, "user": "willyv", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125709397}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "BARS;There are two bars and the service was great at both.Main bars opens at 10:00 and closes at 11:30pm.Rowan and Robin have great personalities and always smiling.Beer is on tap and all drinks are served in small plastic glasses.Bring a thermal type mug if you want & they,ll gladly fill it with the beverage of your choice.", "title": "Bang for your Buck", "helpfulness": 7, "user": "didi1257", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125707626}, {"rating": 1.0, "stay_parameters": "Stayed March 2012", "text": "BEACH:Ok,now there is some good & some bad.First of all there is a lack of beach towels.Try to get your towels at 9:15 when they open and they disappear quickly.They will get fresh towels ahain around 4:30.There is also a shortage of shade on the beach and you have to get your chairs early.Some people go down at 4:00am(crazy) to reserve their chairs,we never did.We usually got to the beach around 9:00 but had to sometimes go far to find a chair and of course no huts were available.Now the water is a gorgeous aqua blue,but it,s milky ALL the time,you CANNOT do any snorkeling on this beach,apparently has something to do with the volcano,but we were very disappointed as we never saw not even 1 fish.On the good side,there was no seaweed,calm waves and the sand was soft.At one end of the beach you can find some really pretty seashells.This is a public beach as are all beaches in Antigua so beware of your belongings.There are vendors on the beach but they are very polite & friendly.", "title": "Terrible", "helpfulness": 7, "user": "Sunloverjim", "date": "March 6, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 125706611}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Spent the past two weeks at JBR with my boyfriend. But first, in answer to several other reviewers who claim that no one could have a good time here who had any travel experience: not quite so. I have travelled extensively for business and leisure over 20 years, staying from 2-star to 5-star, in many countries, up to 240+ nights in one year (although thankfully not so much at the moment). So I DO speak from broad experience. Obviously, I enjoy a 5-star experience but that was out-of-budget for this trip as we wanted two weeks away at a fantastic beach much more than we wanted a 5-star hotel room.", "title": "Great beach, tennis. Other facilities as expected - but fine.", "helpfulness": 1, "user": "SW10UK", "date": "March 14, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 100141275}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Summary: If you go expecting a 3-star experience, and have a good attitude, you will most likely enjoy your trip. We did, and we would return to JBR again if there were a good price on a trip. (Of course, any improvements they make will also be welcome.)", "title": "Budget price yet relaxing with a great staff!", "helpfulness": 1, "user": "ChaseMel", "date": "March 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 1.0, "rooms": 2.0, "location": 3.0}, "id": 99949272}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Rooms: Had a Standard room, recently renovated. Would definitely advise e-mailing about 2 weeks in advance to request a renovated room, as renovations include new bathroom/shower tiles, and a proper dresser/nightstand arrangement which gives much better storage. (Old-style rooms have just concrete shelves.) Had a small wall-mounted TV but we never turned it on. The large balcony with 2 chairs, a table, and a daybed, was a lifesaver for an otherwise small room. Bed was just OK, mattress and pillows a bit dated, but sheets were cleaned frequently and we slept well.", "title": "A Fantastic Vacation!", "helpfulness": 2, "user": "Amherst_wi_Krispy", "date": "March 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99932544}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Housekeeping: Mary and Praise did a fantastic job keeping our room clean and linens/towels well stocked daily. They were always pleasant and smiling, and frequently decorated the room with flowers which we appreciated.", "title": "if it's three star they're not bright stars", "user": "cgbob", "date": "March 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 99891723}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Beach: Gorgeous. Collected shells in amazing colours of orange, pink, and yellow. Always found a sunlounger. The shade parasols were in high demand, but there were also trees along the beach so we were able to escape the sun when needed. Some areas were more shell-covered than others, so if the water access is rough on your feet in one spot just walk a few feet away. The water itself is not clear at this beach due to the very fine sand being suspended in the water. We swam in the sea daily, skipped the pool. Vendors were very low-key compared to my experiences in Jamaica and the Bahamas. Just smiled and said \"no thank you\" when we were not interested. There were days where we were not approached at all, the most was twice in one day.", "title": "Nice hotel", "user": "Meloks", "date": "March 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "rooms": 4.0, "service": 5.0}, "id": 99715302}, {"rating": 3.0, "stay_parameters": "Stayed January 2005", "text": "We have just returned from a 12 night All-inclusive holiday at the Jolly Beach Resort. Antigua. Our holiday was booked through Kuoni and was marketed as a 4 star resort. However, although the location, gardens, pools and beach were superb, the accommodation was rather shabby and in terms of health and safey was hazardous. The bar and buffet area were depressing, and the Italian restaurant bore no resemblance to anything Italian, and was equally depressing with appalling service and food. However the staff in the resort were very friendly and welcoming, and our bedroom was serviced daily and kept very clean.", "title": "Needs a makeover", "helpfulness": 4, "user": "Leeson41", "date": "February 21, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 3213282}, {"rating": 4.0, "title": "Had a blast", "text": "I stayed at Jolly Beach on two separate occasions. I went in March 2004 then I took my mother in May 2004 for mother's day and her birthday, she absolutely loved every minute.", "helpfulness": 9, "user": "1Misssue", "date": "February 20, 2005", "id": 3212863}, {"rating": 2.0, "title": "not so great", "text": "I loved the hotel and the staff. The room I had was very small but since It was just me I was ok. Since it is all-inclusive and you pay for each person separately my mother and I had rooms next door to one another.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "February 19, 2005", "id": 3210962}, {"rating": 5.0, "title": "A Relaxing, Good Time", "text": "I would recommend that you bring your own Iron and blowdryer. They have irons but the service is very slow at times. Electricity also kept going on and off.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "February 14, 2005", "id": 3185550}, {"rating": 5.0, "title": "Great Honeymoom", "text": "The only thing I didn't like was that the entertainment is basically over by midnight. However, the entertainment is good that they provide.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 12, 2005", "id": 3181342}, {"rating": 3.0, "title": "\"but your In Antigua\" - 3 star resort, 5 star beach", "text": "After reading all of the reviews we had a good feeling what we should expect. Family of four (two tweens 14&15 yrs old) Check in was a breeze and headed to our superior room with two queen beds. We stayed in the saint Johns building room 101 - nice location. (near water sport hut) We travel alot - usually in a 4 to 5 star style accomdations - with a 14 and 15 yr old , we choose the JBR due to the activities - which my son participated in all and allowed me (dad) to have a little vacation as well. Non motorized water sports (hobby cats and cayaks) where great -", "helpfulness": 9, "user": "A TripAdvisor user", "date": "March 1, 2012", "id": 125461790}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Room - sub standard - but dealt with it - did not ask to move - this is not a 4 or 5 star resort - two queen size beds , did not get towels every day - but only slept in the room anyway. Opened my back sliding doors on the ground floor and was on the second nicest beach I have seen - (Grace bay in T&C being he best for me). The Beach is really nice - My wife and daughter enjoyed the book reading and sun tanning for all 10 days.", "title": "a great holiday at Jolly Beach.", "helpfulness": 9, "user": "bryan c", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125461740}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Food - Restuarants were ok - it was nice to be served versus the buffet - did the italian and seaford 4 times each. We are not very picky eaters and again, dealt with the menu and ate something different every night - good service - the locals are very friendly people -", "title": "People are too critical", "helpfulness": 7, "user": "whattheheck13", "date": "February 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125420674}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The overall resort is a good value - direct flight from NYC got us there. The Antiguan people are really nice. Service is typical of the carribean - laid back - no rush -", "title": "It does what it says on the tin!", "helpfulness": 7, "user": "Bowen_WilliamsFamily", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125411536}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Other families out side of the resort on a few tours mentioned not much to do at the Saint James Club and their kids where bored. So glad we choose the JBR - not many other options when it comes to the activities and the kids -", "title": "good value for Antigua", "helpfulness": 1, "user": "tojo147", "date": "February 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 125375466}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "Feb 19 to Feb 26, 2005 my wife and I had a most enjoyable experience. I am shocked at the recent reviews. Folks, this is a value-priced resort: we paid 140 dollars US per night, all-inclusive at high season through Orbitz. Even at this very low price, we found this resort surprisingly positive at every turn:", "title": "Loved it, shocked at reviews!", "helpfulness": 33, "user": "millau70", "date": "March 5, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 4.0}, "id": 3253505}, {"rating": 4.0, "stay_parameters": "Stayed February 2005", "text": "-The food was better than expected.", "title": "Honeymoon in Heaven.", "helpfulness": 11, "user": "babybobbi", "date": "March 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3253062}, {"rating": 3.0, "title": "3-star resort with a lot of pluses!", "text": "-The house wine at dinner was better than expected.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "March 4, 2005", "id": 3252496}, {"rating": 2.0, "title": "Beautiful location but left much to be desired", "text": "-The service was better than expected.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "March 3, 2005", "id": 3250097}, {"rating": 4.0, "title": "Great Vacation", "text": "-The beach was better than expected.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "February 25, 2005", "id": 3231092}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Any positive review you will read about this resort are either fabricated by the management of the hotel, or by guests who live in a third world country! I just returned from a 4 night stay at the Jolly Beach Resort and Spa last night and was so disappointed in my experience that I heed to express this so you may be more educated about choosing your hotel on Antigua. Here is my complaint list followed by the good points list for the resort....", "title": "DO NOT STAY HERE!!!!", "helpfulness": 3, "user": "cuisines22", "date": "March 8, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 99476589}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "Complaints:", "title": "island of turtledoves", "helpfulness": 2, "user": "fkdkfaj", "date": "March 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 99435936}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "1) The hotels grounds and overall upkeep has not been touched since the hotel was built in 1979.", "title": "Great beach!", "user": "gailtg", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 99316953}, {"rating": 2.0, "title": "How Did This Place Get Good Reviews???", "text": "2) The staff are lazy and have no idea what customer service is.", "user": "beccanj52509", "date": "March 7, 2011", "id": 99259176}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "3) You have to get in line at 9:15 am sharp every day to make a reservation at one of the three resetaurants, aside from the dreaded buffet which are either closed on that day or already completely booked up, then they give you the option of either 6:30pm or 9:30pm. I know, I know, you're on vacation, why would you have stand in ques all day just so you get a chance to eat dinner!", "title": "Super holiday!", "user": "rickandrobin", "date": "March 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99123898}, {"rating": 4.0, "title": "Great time at Jolly Beach Resort", "text": "My S/O and I have just returned from a stay at Jolly Beach Resort. We were there from February 26, 2005 thru March 6, 2005. We had a great time there. Weather couldn't have been better!! We found the staff very friendly and fun. We had a standard room, which is fine for us; being that we just used the room for sleeping, showering, and changing clothes. The food we ate was all very good; there was enough variety for us.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "March 7, 2005", "id": 3256835}, {"rating": 3.0, "title": "I stayed at the villas ...Jolly beach vacations", "text": "I was a little unsure of the place from the previous reviews I read prior to us going there. I found them to be wrong. Granted it is not a luxurious resort, but I knew that from the start; (we were not looking for that).", "helpfulness": 14, "user": "patbilscot", "date": "March 7, 2005", "id": 3256124}, {"rating": 4.0, "title": "Fantastic Place", "text": "But if you are looking for beautiful beach with breathtaking views, and a very casual atmosphere, THAT IS THE PLACE TO GO!!!!", "helpfulness": 6, "user": "A TripAdvisor user", "date": "March 7, 2005", "id": 3255823}, {"rating": 4.0, "title": "Sunset lsland", "text": "We also met alot of very nice people during our stay.", "helpfulness": 15, "user": "Bazzaengland", "date": "March 6, 2005", "id": 3254472}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Hello, I just returned from my first trip to Antigua. I didn't know what to expect, but I was very well satisfied with everything at Jolly Beach! The people are very nice all over the island which makes one's stay so much more pleasant. The rooms could use a decorative update, but are clean and adequate. We always had hot water when taking a shower. Our room overlooked the beach and bar-pool. The view every morning was breathtaking of both the pool and aqua sea. The beach is calm overall and so very clean. It is a big beach and was not overcrowded whatsoever. There are excursions that leave straight off Jolly Beach which is convenient. The night time entertainment is cool. You will never be without a drink here! Great alcoholic beverages and they don't skimp on the alcohol! The beverages and drinking water are always ICE cold. Food by the pool is always available during the day. The main dining room has something to suit about everyone's palette breakfast, lunch & dinner. The ethnic restaurants are cool too: Italian (don't really bother unless you really crave wine). Lydia's (seafood: Huge Lobsters!! Yum!) and Utsav (Indian cuisine: Amazing!!) You need little if any cash here. Tip where you wish.", "title": "If you go to Antigua, stay here!", "helpfulness": 1, "user": "gypsyqween", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98426040}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "For the cost, this is one great place!", "title": "Nice Vacation Never Mind The Bad Reviews", "user": "Breaktime23", "date": "February 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 98422958}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Bottom line for me and my friends: Natural beautiful beach, relaxation, clean rooms and beds, friendly people, fun & sun = Jolly Beach!", "title": "Fantastic Time at JOLLY BEACH", "helpfulness": 2, "user": "mrsgilon", "date": "February 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 98223885}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled solo", "text": "Just came back from a Jolly vacation. We were very concerned with all the negatives we read about the place but didn`t experienced a thing bad! Food is good at all 3 restaurants and the buffet/breakfast/dinner/lunch no complaints. Service is great, friendly and polite. Rooms are small but clean. The best thing is the beach and the water wow! Yes there are some shells on the beach but nothing to be concern when it comes to stepping on them. Security guards on the beach, safe in the room, the island itself is safe. Didn`t see any jellyfish like someone reported and no flies or no bugs in the sand. Mosquitoes, a bit but not much. The weather was beautiful but it does rain almost everyday for about 5 to 10 minutes. The only thing that we found annoying were the birds,black raven /crow like! Specially in the morning, they`re out for breakfast. Vendors are on the beach and they don`t disturb. Pool is in shape a bit of paint missing but you`ve got to look for it. The grounds are well maintained, clean and no waste lying around. Night entertainment is average, do bring some sort of activity to spend time in the evening. Excursions, trips outside the complexe are interesting, shopping is better in Saint-John`s. Airport and at the hotel, check-in,check-out all went well, not a lot of waiting in line. It`s true that the lobby at the resort is small but efficient. We loved our stay and we will consider going back with our children.", "title": "Enjoyable Holiday", "helpfulness": 1, "user": "michaelquinlivan", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 98017008}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We just got back from Jolly Beach Resort and I felt I needed to write this review to counter all the people who have bashed it. Reading all those reviews we were very nervous about taking our children on their first Caribbean Vacation here. Lo and Behold our hesitation was put to rest once we arrived. This was for our daughters Sweet 16 Birthday - and we can tell you she had a Fantastic and very Memorable vacation.", "title": "Nice Resort, great beach access, overall good value", "helpfulness": 1, "user": "CJinKC", "date": "February 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 97980629}, {"rating": 3.0, "stay_parameters": "Stayed March 2005", "text": "Just returned from a week at Jolly Harbor, and there were many issues that made it far from an \"excellent\" rating. First off, notice that most of the people who loved the buffet food are British. I lived in Britain for a while and know that their flavor expectations are far from those of Americans and other Europeans. The food was bland...even foods that you would think are impossible to be flavorless are at this place. HOWEVER, we sampled all three restaurants, and all were very good food wise. Utsav had good food, but the temperatures inside are stiffling...an open kitchen area and closed off dining section without air conditioning or any type of breeze makes for a hot evening. The other two are worth the time to book a reservation (hint: don't try and book when she opens, wait until mid day, when lines are gone). The grill by the pool has the best jerk chicken I've tasted.", "title": "Mixed Bag...many disappointments", "helpfulness": 14, "user": "pammyk88", "date": "April 3, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 3325643}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "Rooms....well, they are small and can use touchups. They are in states of disrepair. We were first put into a room that overlooked Hemispheres and the nightly entertainment. It was AWFUL...I have no problem with DJ's and steel drums, but if I want to go to bed early, I like to have that option. The entertainment lasts until past midnight and is so loud it will pulsate into your room. After enduring five hours of very bad karaoke the second night, we had our room switched. The front desk staff was very good at honoring our request. By the way, we were in a standard room...very small compared to other places we've visited. We were told on check-in that an upgrade to a junior suite would cost us either $60 or $120 a night, depending on who you talked to. Apparently they all make their own rates there. Also, the bathrooms are amplified due to the cavernous way the rooms are designed. You WILL hear everything that happens in the bathroom from the bedroom, and, unfortunately, you'll know if your neighbors have \"drank the water\", if you know what I mean.", "title": "Don't pay any attention to the bad reviews!!! A+", "helpfulness": 15, "user": "Amy3dee", "date": "March 28, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3308208}, {"rating": 5.0, "title": "Wonderful Time at Jolly Beach", "text": "Service...many of the staff members need to understand what it means to be in a service profession. Many are rude, will ignore you and will make disparaging comments to you if you ask for something that will require them to make an effort. There were a few standouts..the wait staff in the restaurants and Toyston, the bartender, were great. Other than that, not a happy time dealing with them. Even the maid staff was sporadic; sometimes you got towels, sometimes not; sometimes you got shampoo, sometimes not. It was odd.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "March 23, 2005", "id": 3296064}, {"rating": 4.0, "title": "breathtaking sunsets", "text": "Water...yes, it's cloudier than typical Caribbean water, but it does reflect a beautiful blue during the day.", "helpfulness": 19, "user": "Goldie2", "date": "March 16, 2005", "id": 3276587}, {"rating": 3.0, "title": "moer then 3, not quiet 4 stars", "text": "Weather was great. St. John's was a great excursion....do not fall into the hotel sponsored tours. It cost us $1 each way to take the local bus, which is really a minivan, picked up in front of the resort. The people we met in Antigua were very nice and helpful.", "helpfulness": 10, "user": "Willbur", "date": "March 16, 2005", "id": 3276468}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 265, "average": 508, "very good": 910, "terrible": 185, "excellent": 446}, "aka": "Jolly Beach Hotel Bolans", "slim_ranking": 1.0, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}, "description": "The all-inclusive, 464-room Jolly Beach is an exceptional Caribbean experience. Resort offers great year-round value for destination weddings, honeymooners and families. Rates include accommodations, government taxes and service charges, all meals, snacks and afternoon tea, house brand beverages, non-motorized watersports, activities, Jolly Kidz and Teenz Clubs, Think Jolly Family Program, use of the gym and entertainment. All rooms are air-conditioned and face the ocean; each has a patio or balcony, direct-dial phone, TV and hair-dryer."}