{"user_rating": 4.0, "review_count": 281, "name": "Jumeirah Lowndes Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I stayed here for 1 night for a quick break which co-incided with a visit to Gordon Ramsey's Petrus restaurant. The hotel is in a lovely area, Lowndes/Belgravia, easily reached from Knightsbridge tube station. It's in an unassuming building, a new build rather than the beautiful terraced property around Lowndes Square. I appreciate it's classed as a boutique hotel but I expected a high quality boutique service. The staff we encountered were very pleasant but some lacked the Jumeirah customer service skills. I booked an executive room as it was slightly larger than the deluxe rooms and had a balcony (which I thought would be nice to sit out on with a coffee and watch the world go by) We were both amazed by the size of the room. It was very small, with an even smaller bathroom and the balcony actually overlooked the rear air conditioning vents and some buidling work scafolding. Needless to say we didn't use it, so need not have paid the £80 extra for the balcony. In fairness to the hotel, everything was very clean and smelt fresh and clean. We encountered another problem using the bathroom: The overhead shower is so near the ceiling, if you are tall you would have to use the hand held shower hose. There was no bath mat and the bath was so slippy you had to hold the rail with one hand whilst holding the shower hose with the other, not ideal! The Doorman was very helpful and Paolo in the bar made a delicious strawberry daquiri. As a silver sirius member you are entiltled to have continental breakfast free but after telling 2 waiters of this we were still charged for both breakfasts. My husband decided to have a full english and pay the difference. (£30 for full english £19.50 for continental) It was very poor for the money, he waited 30 mins for it and when it came it was luke warm, we told the waiter but he just said \"Oh Dear!!\" After telling reception again that I was a silver sirius they took the bfast charges off the bill. If you stay at the Lowndes you can use the facilities of the Carlton Tower. We may consider staying at the Carlton Tower next time but unfortunately wouldn't stay at the Lowndes again, mainly due to the cost and what you get for your money.", "title": "Not quite what we expected", "helpfulness": 6, "user": "Anoif", "date": "November 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 120202109}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed in a jr suit that was big and nice. The carpet and the furniture were very dirty and the bathtub needs more attention since a couple of times we almost slipped and had an accident. It was nice to have an expresso coffee machine in the room.", "title": "visit 2011", "user": "Irene S", "date": "October 7, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119048505}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "In the restaurant, there was a waiter named Paolo that was very attentive and nice. (he should be on the front desk and not as a waiter.) All the difference with two men named Nasim and Simon, that were not helpful and not very nice at the front desk.", "title": "Good Boutique Hotel in Belgravia", "user": "CanadianThunders", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117835271}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Incredible Location. best neighborhood.", "title": "Good London option", "helpfulness": 1, "user": "TOMM4", "date": "September 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117799006}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We took a roof top junior suite, which we had thought would be bigger, but then again this is in the heart of Belgravia in London, and saved a long terrace that ovelooked a leafy park and the open skies.", "title": "Good value but with some rough edges", "user": "anil d", "date": "August 16, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116815964}, {"rating": 4.0, "stay_parameters": "Stayed May 2011", "text": "We really enjoyed our stay here. It was very clean, but room a little small compared to previous London hotels we've stayed in. Service was lovely. Tea out of a stainless steel vacuum flask at breakfast was very disappointing! Will however stay here again.", "title": "Small but perfectly formed", "user": "lynnesrob", "date": "May 22, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 109271715}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "I love staying in this hotel especially in the summer when they have the bbq at the back of the hotel in the court yard, its very private not so touristy the food is very good and I love the rooms, its a small friendly hotel very clean very good service and probably my fav in london, its around the corner from sloane street and a few doors away from christian louboutins shoe shop so its perfectly located lol....its quiet private and very nice", "title": "I really love this hotel", "user": "phoebewillett", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100823478}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "We stayed at this hotel for 3 nights during a recent trip to London. Having stayed in Jumeirah properties before I was expecting a high standard and got it. The rooms, though small, were well designed and clean. The service was excellent and attentive and the food in the restaurant was of a high quality.", "title": "A well-appointed, beautifully maintained small hotel", "user": "Glengarry3007", "date": "March 12, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 99846969}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The only small gripes I had concerned the lack of an in-room wifi connection (we came armed with iPads, making the in-room cable Internet useless), and the concierge seemed more concerned to spend as little time as possible on our queries, unusually for Jumeirah properties (an example: an urgent request to help us procure tickets to The Childrens Hour at the theatre was met with a stock answer that it was impossible. It then took us 10 mins to buy tickets from a street based agent).", "title": "Wonderful service and outstanding value. Can't wait to return!", "user": "DrewP988", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99282891}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "On e whole though, these are minor complaints and we would certainly stay at the hotel again.", "title": "Wonderful Property! Wish we could of stayed longer!", "user": "Maddogmads", "date": "February 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97513501}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "I had some grand expectations for this hotel.. firstly the brand name is all about luxury and the website and pictures look great, but (for the money) it's not all it sets itself up to be unfortunately....", "title": "Top Location.. but there are better places to stay in this price range", "helpfulness": 4, "user": "JMuk", "date": "December 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 121877561}, {"rating": 2.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Firstly the good stuff:", "title": "Great location, noisy and dirty rooms", "helpfulness": 3, "user": "Sariano", "date": "November 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 121154897}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "The cheapest rooms are an OK size (for London anyway), there's enough room to move around and the bathrooms are adequate. It's OK, no more, I'd rather spend £150 on a premier inn and have more money to spend shopping, or if you want to splash out on a bit of hotel luxury then there are better places to spend your money in this price bracket.", "title": "Fits the bill perfectly", "helpfulness": 1, "user": "laethanta_saoire", "date": "November 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121002030}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled solo", "text": "Good front of house staff.", "title": "Perfect location", "helpfulness": 2, "user": "santon29", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120280777}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "But..", "title": "Lunch Today", "helpfulness": 1, "user": "Lesley F", "date": "November 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 120231991}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "last year we stayed at the jumeirah carlton and this year we stayed at the lowneds <3 we stayed in a suite with a separated living room . the rooms were wide and so clean , the furniters seemed new , the towels were so clean and that's really important to me ... although the bathroom was really small but it wasn't a problem because after all it was perfect , and we had a beauitful balcony the servies was great couldn't ask for more , also the internet was for free . it felt like home =) although it's small and it's 4 stars you get all the benifit that jumeriahcarlton guests get . you could use the spa and everything there . and it's perfect for familys . we really loved it and we enjoyed it .", "title": "loved it <3 we decided to stay there everytime we go to london <3.", "helpfulness": 2, "user": "pippa x", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116134695}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "I stayed here for the past three days prior to a meeting. I loved it! Staff were absolutely wonderful. Friendly, helpful, so kind! Rooms were spotless, great location. Can't say enough great things about it. Thank you to everyone there!", "title": "Loved it!", "helpfulness": 1, "user": "kara o", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116037118}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Just discovered this little gem of a hotel in Knightsbridge/Belgravia/Chelsea (can't figure out which yet, to be honest). From the moment we stepped in the lobby, we were greeted as if we were favored regulars - they guessed the name on the reservation and from that moment forward the service continued to be impeccable. The rooms are smallish, but enough room for two and are nicely furnished with an amazingly comfy bed and a well appointed bathroom. The hotel has a small, full bar downstairs and complimentary wireless. Would definitely recommend and stay here again.", "title": "A great find in London", "helpfulness": 1, "user": "LindaM82", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115146783}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "I stayed for one night at the Jumeirah Lowndes and the reason I chose it was because of its premium location, overall image and branding of the Jumeirah Group as well as due to the fact that in London, hotel rates are so high and even the lousiest and further can cost you about the same price. These are few of the reasons for my choice.", "title": "Not the best yet but deserve better ranking!", "user": "weihao07", "date": "June 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113869832}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The location of the hotel is superb because its right at the heart of Knightsbridge (shoppers paradise and premier district in London). Walking distance of less than five minutes to the underground tube and stones throwaway from various luxury fashion label boutiques and famous departmental stores like Harvey Nichols and Harrods. Those looking for other \"entertainment' can go ahead with throwing some cash at the Park Lane Casino at Sheraton Park Lane about 100metres away.", "title": "Outstanding", "user": "Rileys", "date": "June 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112821758}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 7, "average": 31, "very good": 117, "terrible": 4, "excellent": 122}, "aka": "Jumeirah Lowndes London", "slim_ranking": 0.204460966543, "description": "The boutique Jumeirah Lowndes Hotel is situated in London’s leafy and fashionable Belgravia village. Each of the 87 bedrooms has been beautifully finished in contemporary style and boasts complimentary high speed wired and wireless internet connection, nespresso coffee machine, plasma television, and iPod dock. The hotel features Lowndes Bar & Kitchen - a relaxed restaurant offering all-day dining - and in summer, the Terrace for al fresco dining. Guests also enjoy complimentary access to The Peak Health Club and Spa, located across the road at our sister hotel, Jumeirah Carlton Tower which features full gym equipment, 20m indoor swimming pool and beauty treatments."}