{"user_rating": 4.0, "review_count": 990, "name": "Jurys Inn Liverpool", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "Stayed here as part of bus trip on a DBB basis. Noticed on arrival dining room was closed due to party night. We were dispatched to a cold function room with large circular tables with a serve yourself buffet which was quite frankly dire and cold. No service at tables we were told we could drink our own wine as the bar was too busy and they had no staff serving our group drinks. No tea or coffee served after meal.", "title": "Disbelief...disappointment...disaster.", "user": "M K", "date": "December 2, 2013", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 186546051}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Went down to bar totally deflated and were met by a sign....winter warmer....not in the bar which was as cold as an ice box. Staff brought around hot mulled wine free gratis.....Only time I was warm. Breakfast was also cold. No warm plates and the buffet was bursting with people. No a relaxing weekend.", "title": "Ideal location", "helpfulness": 1, "user": "happytravellers040", "date": "December 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186511015}, {"rating": 5.0, "stay_parameters": "Stayed December 2013", "text": "On the plus side rooms clean and spotless. No fridges for the wine we were expected to drink. Poor show.", "title": "Great location", "helpfulness": 1, "user": "Veronica013", "date": "December 1, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 186429974}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Great location only a couple of hundred yards from the Echo arena and a short 5-10 min walk to the Albert Dock and main shopping area. You can park your car in the nearby multi-storey which costs £10 for 24 hours but with the discount voucher from the hotel you get a reduction of 25% reducing it to £7.50 which is not bad for city centre parking! However, when we paid we were only charged £3.75 for some reason, which was even better. Rooms are clean, modern and compact without being too small and bathroom was a decent size. The breakfast had a wide selection and the quality was good. It is advertised as self service but the morning we were there it was extremely busy so the staff were serving, presumably to speed things up. However, in this instance the service was poor and very rushed and thus the presentation was poor. This was my only gripe in an otherwise pleasant stay.", "title": "Staff that go out of their way to help!", "user": "Rick G", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186415796}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "We stayed for one night as we had booked a show at the echo arena. We parked in the NCP car park which cost 7.50 for 24 hours and was next door to the hotel.", "title": "Good location", "user": "Chepp0648", "date": "November 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 186376978}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "Brilliant location, handy for the docks, shopping (15 mins walk away) and eating places, on the dock try Miller and Carter and in Liverpool one (opposite Lewis store) Browns Bar and restaurant, fab food in both. We were greeted by friendly reception staff, rooms nice only complaint the lighting is quite dull could do with making brighter hence four stars, I can't comment on the food I was poorly while I was there due to a bad back so I couldn't eat breakfast due to nausea because of my painkillers, the staff were brilliant on my last day helping out because I was really unwell, can't thank them enough. Will definitely be staying again in the future.", "title": "Lovely comfortable stay", "user": "pixie1959", "date": "November 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 186366372}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Just had an overnight stay whilst at a show at the Echo arena.Couldnt fault hospitality and friendliness of staff,ate in the restaurant that evening, top class food,well presented and cooked,felt that nothing was too much trouble for these guys.Room very clean and modern,did the job perfectly.Would reccommend to anyone wanting to stay, for convenience of ammeneties and overall quality of standards.", "title": "top marks", "helpfulness": 1, "user": "anne w", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186159672}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "This may end up as a bit of a bull**** sandwich - very good staff in the restaurant. Excellent greeting at the door, and very friendly service.", "title": "Friendly and good service - mostly", "user": "Travelling_Trainers", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 185869578}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "But no room service. Is that all Jury's Inns? Last time we stayed in one it was in Edinburgh and seemed of a higher quality than Liverpool.", "title": "Excellent Service", "helpfulness": 1, "user": "Paul W", "date": "November 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 185848206}, {"rating": 4.0, "title": "Handy location for congress", "text": "Good friendly reception staff and a couple of them were particularly good and helpful about a package I was expecting and Internet.", "user": "Peabrain2013", "date": "November 25, 2013", "id": 185789969}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We booked an overnight stay at this hotel for our 33rd wedding anniversary. We had never been to Liverpool before and thought it would be a nice change. The reservation stated that we could not book in until 16.00 on a Sat but as we got there at 12.00 we though we would check on the off chance that we would be able to book in early. I was greeted at the reception by 2 very pleasant young men and they asked what brought us to Liverpool and if it was for a special occasion. I explained it was our wedding anniversary and he said that he would do his best to get us a nice room. After a little discussion between themselves we were informed that they would upgrade us to a suite. The room was fantastic with view of Albert Dock and the River Mersey. We spent the day at Liverpool one shopping centre which is just over the road and the night at some of the many pubs in Liverpool city centre. I must say that the staff could not do enough for us and they certainly made our wedding anniversary special. Thank You", "title": "Very Impressed", "helpfulness": 1, "user": "Disappointed227059", "date": "December 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187705769}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "We booked this room with friends for its proximity to the Echo Arena ,which couldn't be closer. It is ideal for an overnight after a show.", "title": "Nice Hotel, Shame About the Catering", "helpfulness": 1, "user": "RKF001", "date": "December 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 187704935}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "The hotel is modern, clean and the rooms are comfortable and fairly spacious. The staff were friendly and helpful and could not be faulted.", "title": "Exceptional Customer Service, Facilities & Value", "user": "bfitzptk", "date": "December 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186932521}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "However, the evening meal was a shambles. On a show night they also had a number of Christmas parties running and so the dining room was closed and there was only a limited menu in the bar. The were completely unable to handle this workload.", "title": "Lovely weekend hotel.", "user": "Flisster", "date": "December 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186622143}, {"rating": 3.0, "title": "Good location", "text": "After a wait of an hour - and several complaints to staff - we were finally presented with a meal which in other circumstances we would have sent back. By this time we were both starving and were short of time before the show and therefore ate it. We were offered a free round of drinks after the show in compensation, but by the time we got back to the hotel the bar was so full that we couldn't even get into the bar.", "user": "Colin B", "date": "December 2, 2013", "id": 186579694}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled solo", "text": "Overnight stay due to a work do - £39 room only. First impressions are good: nice bar area and reception and it looks good from the outside. Upstairs it's a bit more disappointing, the corridors are a bit clinical and the white room doors look cheap. I was on the fifth floor and had a good view out on to the Albert Dock which was a bonus. Room was an OK size, and the bed was comfortable. It was all clean and tidy and there was shower gel and shampoo which was handy. Had a drink at the bar and the staff were fine, although I overhead one telling a colleague she was bored. Overall pretty good value.", "title": "OK for the price", "user": "Peejdj", "date": "December 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 188228540}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We have stayed at this hotel several times now and each time has been good.The staff are friendly,the hotel is clean and the food is good.Also they have a well stocked bar.There is a good selection for breakfast.Either continental or cooked buffet style.The hotel is in a great position for all of Liverpool's attractions.I would have no problems recommending this hotel.", "title": "Never a bad stay", "helpfulness": 1, "user": "Superbluesteve", "date": "December 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 188071316}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "We stayed here for one night as we were attending a concert at the Echo Arena. The location was absolutely perfect being directly opposite the arena. We were with a coach party and found that our checking in went very smoothly and with great ease. The room itself was very clean and comfortable.", "title": "Very good value for money in an excellent location", "helpfulness": 1, "user": "karen_manton", "date": "December 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 187982676}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The only downside for us was when we went for our evening meal everything seemed a bit chaotic especially the seating arrangements. The evening meal was quite poor i.e very little choice served on tiny plates! The breakfast was quite busy but once we sat down to eat it, it was very tasty. Staff seemed very friendly, one member who I believe is named Stephen went out of his way to be helpful, serving our meal to the table and then again providing us with items that were running low. Excellent service!", "title": "Surprised", "helpfulness": 1, "user": "sharon010510", "date": "December 16, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 187777787}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Hoping to visit again, very soon.", "title": "Great short stay, ideal location for local concert venue/", "helpfulness": 1, "user": "JonathanMimnagh", "date": "December 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187725124}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 72, "average": 187, "very good": 372, "terrible": 34, "excellent": 325}, "aka": "Jurys Hotel Liverpool", "slim_ranking": 0.397959183673, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}