{"user_rating": 4.0, "review_count": 272, "name": "Jurys Inn Swindon", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I was recently sent on a business trip to Swindon and if I'm honest was hesitant about staying in this hotel. I guess this was down to it being considered lower end?", "title": "Exceeded all expectations!", "helpfulness": 1, "user": "sueparker1001", "date": "November 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86897627}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "All I can say is that my stay (like the subject title suggests)...exceeded all expectations! The hotel was fantastic and would suggest that anyone on business in Swindon gives serious consideration to staying in this hotel.", "title": "friendly hotel in ideal central location", "user": "dosso4", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 83070387}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Reception staff when I arrived were great...very friendly and couldn't be more helpful. Lady on reception clearly enjoyed her job - very unusual these days!! I also had the chance to have a bite to eat in the bar. Bar tender and Irish manager who was overseeing the service exceptional. Again clearly enjoyed their job and I must say pleasure to see in this day and age.", "title": "Should be first choice for Swindon stays", "helpfulness": 1, "user": "UniversalBusinessman", "date": "September 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 81472317}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Rooms were clean, tidy and what you would expect. Again it's not the ritz but then again I would rather stay in a hotel where the service is genuine! It was genuine here!", "title": "Fantastic Hotel!", "helpfulness": 1, "user": "Kerry848", "date": "September 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78084736}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Stayed here for one night before my young daughter performed in a show at the wyvern theatre. Less than 5mins walk from the theatre and other town centre amenities. The staff couldn't have been more helpful upon arrival, we checked to see if the room was available early and didn’t get the usual rooms not available but a good response and a just short wait while they checked. The room soon became available and we got escorted to the room to ensure everything was ok for us. The room was of a good size with flat TV and decent shower/bath, the beds are comfy and the air con is easy to use. Plenty of towels for all the family, and hand wash/shower gel were supplied in large dispensers. The only letdown in any way was the noise from the roads; even with the windows closed you could hear the cars driving up and down all night. I think if we ever go to Swindon again I would ask for a room on the other side of the hotel away from the road. The breakfast was a little pricey £8.50 but the choice was good and the staff wasn’t strict on how much you had. £5 for a days parking may seem a little expensive to some but I was told it was much more than that by other parents. Apart from that you couldn’t ask for much more from this hotel, clean comfy and welcoming.", "title": "Excellent,friendly staff", "user": "LlanelliOldtraveller", "date": "August 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77679534}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "The room was a standard size for Europe, the room and bathroom were clean, the staff was very friendly and helpful. The beds were hard, the furniture a bit dated and hard to sit on. No free internet, it will cost 10 pounds for 24 hrs or 5 pounds for 1 hour. There is no refrigerator in the room, but there is a coffee/tea maker. We didnt eat there, so don't know how the food it, but there is a bar. You control the climate in the room. The room is sound proof from the street below. The price we paid for it did not include breakfast, so I thought it was high and that we could have found better elsewhere.", "title": "Standard Room", "user": "wildlphn", "date": "August 29, 2010", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 3.0, "service": 5.0}, "id": 77400595}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "What a nice surprise! I'd expected a characterless business hotel, but quickly changed my mind. From the reception staff, through to bar, restaurant and cleaning staff, I met lots of lively & helpful people who made my stay much more enjoyable than in the typical business hotel. The young woman 'greeting' people in the excellent breakfast bar was the only sour-faced person I encountered. Other than her, they were fantastic. The food too was good and very reasobably priced (£15.95 for the set 3-course dinner, which I'd recommend). The room was extremely comfortable and immaculately clean. It was also very quiet. If I were in Swindon again I'd have no hesitation in going back to this excellent hotel.", "title": "Friendly, comfortable hotel - highly recommended", "user": "AngusMark", "date": "July 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71142131}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I stayed here overnight on business. The rooms are modern and spacious. Reception was polite and helpful. The parking situation as mentioned in previous reviews is correct. If you don't get there early enough you will have to park in the multi story. Car parking in the hotel is far more convenient and costs £5.50 for 24hours, so get there early if you can.", "title": "Comfortable Hotel", "user": "Abs64", "date": "July 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 69433313}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Title says it all really. Modern chain hotel in an unremarkable location near the city centre. The room itself was clean and smart, the staff were friendly and helpful, and the bed was reasonably comfortable. But there was no radio - you could listen to radio channels on the TV, but that meant the TV screen remained on, preventing the room from becoming darkened.", "title": "Decent room but poor breakfast and ripoff internet", "helpfulness": 2, "user": "John987654321", "date": "May 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 108344046}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "At £5 minimum even if all you do is check a few emails, and £10 - more than most folks pay for a whole month - for 24 hours' access, the internet connection is a gigantic ripoff. What are these Leary-alike types going to inflict on us next - surcharges to use the bathroom?", "title": "OK & good location in Swindon", "user": "EnjoyTravel200", "date": "May 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 108268815}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "The breakfast was poor. The self-service display was OK, but the food tasted as though the materials had come from Asda's budget range (not that we ever buy at that level, so I have admit I'm guessing) - exceedingly weak OJ (tiny glasses), intensely bitter coffee (and a queue for the one machine), sausages made mostly of filler. I couldn't find any bread but I didn't look too hard. On the other hand, the bacon tasted fine.", "title": "Good value, good location", "user": "stry", "date": "February 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97288788}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "So whilst the fabric of the hotel and the staff are both good, it seems that the current management are pennypinching. Recommendable only when that changes.", "title": "Good cheap hotel, close to Swindon Old Town", "helpfulness": 2, "user": "Wintles", "date": "February 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 95387252}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "This is an OK business hotel within an easy 20 minute walk from the train station. The room was quiet and the bed good. Shower was powerful and the room clean. Breakfast was nothing great, and the one meal I ate in the evening was OK, but there is much better food to be had close by in Swindon old town. All staff were friendly and helpful. There is free WiFi in places, however, in the rooms you have to pay £10 for 24hours or £5 for 1 hour -This is shameful exploitation of customers!", "title": "New Years Eve ... Excellent!", "helpfulness": 1, "user": "VFace87", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94525208}, {"rating": 2.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed here to break our journey due to heavy snow on the M4. It seemed good value initially - £59 for the room. Breakfast took it to over £70, and we decided to skip this. The car park was another £5. Their website advertises 'high-speed internet'. Um, well, no - you pay (£5/hr or £10/overnight) for the internet, which is a cable connection not wi-fi, extremely slow (I took a screenshot of the speed we were getting - less than 1/3Mb - not great value for £10!) and kept cutting out. When we mentioned this, they said 'we'll tell the manager' and that was the only response, which is pretty poor customer service. The rooms are clean but poky, and the bed is a double not a king, so not very spacious. The reception staff couldn't raise a smile between them. It's just about OK if you're desperate, but I'd never choose to stay here again, and it has put me off ever choosing to stay in a Jurys Inn.", "title": "Mediocre Hotel with Rip-off Internet", "helpfulness": 2, "user": "beth-and-willl", "date": "December 22, 2010", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "location": 3.0, "value": 1.0, "rooms": 2.0}, "id": 90485168}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "All the staff were friendly and helpful, rooms were basic and there is additional charges for Internet and car parking.", "title": "Breakfast was a let down", "user": "Maxinpompey", "date": "December 7, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 89256182}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We stayed two nights and breakfast was the let down, no white bread on saturday morning and no butter on sunday morning. The hot food was topped up and not replaced so there was no control on temprature etc. Very poor for Jury's", "title": "disappointing", "user": "porkStoke_on_trent", "date": "December 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 89193956}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Stayed in Jurys inn hotels a few times, this was disappointing mainly because of the food. We were on a break with Bakers Coach tour and there was a few other coach companys staying there too. This hotel only had a basic evening meal with hardly any choice and food was not hot, only 1 desssert available (Gateaux which I do not eat) I asked if they had any other choice only to be told no, also hot drinks not available with the meal!. Breakfast was just a joke, the hotel dining area is not big enough to cope with all the coaches, especially when they are all leaving the hotel around about the same time and so everyone is down for breakfast at the same time. This hotel is ok for probably buisness trips but not for coach trips or people who need evening meals", "title": "This was a very friendly hotel supported by by excellent staff throughout the hotel", "user": "mikerbell", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 87985138}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "This hotel is located within walking distance of the train station, town centre and football ground. The front office staff were very friendly and welcoming, rooms were modern and very well equipped for a 3 star hotel, tea and coffee tray, hair dryer , trouser press and", "title": "Friendly, helpful staff offering excellent standards of service", "helpfulness": 1, "user": "Kat33London", "date": "November 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 86946355}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 7, "average": 72, "very good": 119, "terrible": 8, "excellent": 66}, "aka": "Jurys Inn Swindon Hotel", "slim_ranking": 0.566666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}