{"user_rating": 3.5, "review_count": 799, "name": "Jurys Inn Belfast", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "I booked a room using a well known hotel website. Arrived early evening. Staff were very friendly at reception. Asked for a non smoking room. I arrived at a tired room but thought on price alone this is ok. Room smelled of smoker's smoke. I noticed the carpet was unclean and pulled off the bed covering to reveal a clippped toe-nail on the floor and a piece of uneaten crisp (potato chip to Americans) by the top of the bed. Before I'd uncovered the nail/crisp by this stage I'd plugged in my PC and signed up for £5 per hour or £10 per 24 hour DNS high speed internet. I needed to work before having a meeting the following day.", "title": "I almost booked into another hotel", "helpfulness": 3, "user": "N L", "date": "December 20, 2008", "detail_rating": {"front_desk": 4.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 22865130, "likes": {"liked": "— Friendly staff, helpful duty manager", "disliked": "— Just read the review. Never again...."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I called reception immediately. The duty manager arrived and agreed that what was offered was appalling and we spoke about the vagaries of contract cleaning staff. But to me, supervision was lacking and thus a problem. I was offered to have the room cleaned and offered a drink - I declined.", "title": "brilliant hotel, great location", "user": "statusquo08", "date": "December 16, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 22778536, "likes": {"liked": "— the staff and breakfast", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "I asked for and was offered another room. 15 minutes later I was in a brighter, double, non smoking room and again logged in to the expensive internet. I checked behind the couch and found someone's old empty washbag. I didn't call reception... Felt like I was becoming a pain in the [-].", "title": "Ideal hotel for a weekend break in Belfast", "user": "_-_L4UR4_-_", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22745555, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "My room cost was £69 which is not bad for Belfast before Xmas but excluded breakfast which would have been £79 and adding in the internet cost, could have found a better deal somewhere else.", "title": "Basic Hotel, Great Location", "user": "Monty2212", "date": "November 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 22004034, "likes": {"liked": "— Location", "disliked": "— Food"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The Victoria St outside is noisy. So take along ear plugs.", "title": "No problems here!!", "user": "Ali50n", "date": "October 31, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21434728}, {"rating": 5.0, "stay_parameters": "Stayed March 2009", "text": "A friend and my daughter stayed earlier this month as I have family in Belfast and came on a short trip to visit them. We also stayed a few years ago and had an equally great experience at this hotel. For the price we paid i think it is excellent value and the location is a bonus. The breakfast was wonderful, would go back just to eat it again!! We had a room with a double and a single bed which was ideal for our trip and the rooms, in my opinion were quite adequate for what we needed. I found it really helpul that toiltries were provided in the bathroom as on the last occasion we only travelled with hand luggage and could not carry liquids. My only tiny criticism would be that I could hear the 'ding dong' of the lift all night but no cause for complaint considering all the positives. will definately be returning in the not so distant future. Thanks to everyone at Jury's for making our trips so pleasant.....see you soon!!", "title": "fabulous", "helpfulness": 1, "user": "aydan116", "date": "March 31, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27178165}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "To be honest, you do get what you pay for. Our room was as requested, ie furthest away from lift with no passing traffic. This turned out to be a life saver for us because there were a lot of very very drunk football fans staying in hotel for the NI v Poland game. Fortunately we did not see any of the trouble that did occur. Room was ok, got what we needed, although like previous reviewer, you do need two pillows if the ones supplied are a bit flaccid. Bathroom clean, which is the main thing, but we found the room to be very very dusty, carpets needed a very good vacuuming but as we were only there for one night, we were ok. The new 5 star hotel next door (Fitzwilliam) has only been able to negotiate the window cleaning starting early Sunday morning (6am) so imagine having paid their prices to be woken by the very loud machinery (done by cranes from street so very very noisy) If you were on Fitzwilliam side of Jurys you would be woken too.", "title": "Value for money but easy to improve one or two things", "user": "Cgt76", "date": "March 30, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 27086748}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Breakfast was good value to be honest, all very clean and efficient. Reception staff hit and miss and bar full of hens but what do you expect? Brilliant location, taxis right outside, two brilliant pubs across the way, The Crown and Robinsons, both worth a visit. If you are on a budget and want clean and good location, then providing they get their vacuuming act together, this is not a bad call.", "title": "Didn't like", "helpfulness": 1, "user": "fly747", "date": "March 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 27046455}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Hotel is in a good location in the city, situated on a busy road, we went for 3 night and turned up in a hire car which we had hired from the airport and........ 1st hurdle already, where do we park to check in !!! Found a space in a side road next to hotel for 1 hour and for £1.", "title": "Lovely Hotel, in fab location", "user": "DaiseyWales", "date": "March 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26978813}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "Checked in swiftly and the reception staff were efficient, went to the room which was quite a disappointment at first impression. Room was hot and there is No air conditioning, but you can open the window for some air - but you also get the noise from the traffic too. Room was tired looking, but clean, no bars of soap or toiletries but a combined body wash/shampoo in a wall dispenser. There was a hair dryer, TV, kettle. Our room looked inwards straight into other peoples rooms which was horrible, and no rooms had net curtains so you had to keep the main curtains drawn to keep a degree of privacy , so making it dark and dreary during the day. Room could have done with a lick of paint. Pillows were flat and ineffective, but we left a note for housekeeping for 2 extra pillows if possible and our request was met no problem. They also cleaned the room to a high standard every day & left us with fresh towels, even though we were happy to keep our used towels so that was nice.Rooms have internet access.", "title": "Spartan and unwelcoming", "user": "KnowAll", "date": "March 20, 2009", "detail_rating": {"cleanliness": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 26492768}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "On arriving at check in I found the gentleman on reception was quite short with me. As we had just battled with hours of traffic I was really tired and asked him to repeat where the car park several times much to his annoyance. I called the hotel the week before we had a booking and they led me to believe that there was a special hotel rate. There is not- it is the same rate for all. The car park is located in the train station- a bit dodgy.", "title": "Good central location", "user": "VM13", "date": "March 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 25797389}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "The hotel itself is fine-we got a triple room for £84 and it was clean. There was a double bed and a pull out sofa bed which was grand for the one night that we stayed. The bathroom was clean and basic.", "title": "don't get dry cleaning done!", "user": "Dorothy60", "date": "March 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 25538491}, {"rating": 3.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "For the price it was good value and I probably would stay there again for a night for a shopping trip but maybe not for a romantic getaway etc", "title": "Centrally located but quite average", "user": "Kalamaki-Rob", "date": "February 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 25151231}, {"rating": 2.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We have stayed at the Jury's Inn on 2 occasions, once in 2000 and again in 2006.", "title": "Average Hotel. Good Location.", "user": "Glasgow2007", "date": "February 16, 2009", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 24623113, "likes": {"liked": "— Location", "disliked": "— Room Temperature and The Orange Juice!"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "It's a great Hotel in the middle of Belfast and the only reason I have given 3 stars for service is the fact that even though we booked 6 months ahead for a twin room for my sister and myself, on arriving they wanted to give us a double bed with a pull out bed.", "title": "Pleasant stay", "user": "DWhiteBasingstoke", "date": "January 27, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 23938459, "likes": {"liked": "— Central location, good value breakfast", "disliked": "— Thin towels!"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "I stayed here with some girlfriends for a weekend.", "title": "Great Location", "helpfulness": 1, "user": "Angie_Paul", "date": "April 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 28224816}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We booked via laterooms.com as they gave the cheapest deal at the time, espcially compared to booking direct.", "title": "Great Stay", "helpfulness": 1, "user": "GlasgowBrowns", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 27989759}, {"rating": 3.0, "stay_parameters": "Stayed April 2009", "text": "We asked for interconnecting rooms with 3 beds in each, and we got a double and single in each room. The staff were always very courteous and helpful.", "title": "Basic hotel", "helpfulness": 1, "user": "Phoebe78", "date": "April 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 27929588}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Our rooms looked out into Belfast, but remember it is a very busy city so it doesnt go quite, if youre a light sleeper take ear plugs.", "title": "Great location-stuffy/noisy rooms", "helpfulness": 1, "user": "Delta360", "date": "April 12, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 27863969}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The hotel was right in the middle of everything so a great location, the rooms were clean and tidy and had enough towels etc.", "title": "Jurys Inn, not really a family hotel..", "helpfulness": 1, "user": "cowgirl1932", "date": "March 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 27200424}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "Belfast"}, "stars": 3, "variance": {"poor": 82, "average": 191, "very good": 332, "terrible": 38, "excellent": 156}, "aka": "Jurys Inn Belfast Hotel Belfast", "slim_ranking": 0.659090909091, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.5, "location": 4.5}, "description": "Our hotel in Belfast features 190 spacious and affordable bedrooms that can accommodate a single guest all the way up to three adults. If you are staying as a family, we have affordable hotel rooms available for two adults and two children. There is also a hotel bar and restaurant for hungry and thirsty guests.At Jurys Inn, we aim to make sure your stay is as comfortable as possible, so we provide you with fresh bed linen with the option for extra duvets and pillows. All rooms have high speed Wi-Fi internet and a modern television with freeview to allow you to keep up to date with your favourite programmes. Our bathrooms are spacious and modern, and come with fresh towels and complimentary toiletries.We have a number of rooms with increased access for guests who require extra mobility. We also have accessible public toilets for wheelchair users and lifts to all floors of the hotel."}