{"user_rating": 4.0, "review_count": 957, "name": "Jurys Inn London Islington", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "My wife and I spent four nights here in order to visit our daughter who has recently moved to the area. We chose this hotel because of its proximity to the Angel tube and our daughter's house.", "title": "Angel Delight", "helpfulness": 2, "user": "Hispanist", "date": "February 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 56407219}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "We enjoyed our stay and would be happy to return. The hotel does everything well and is all you would expect from a three star establishment. The room was spacious and clean and the service was very good throughout. The buffet breakfast had a decent choice and the bar and restaurant food was reasonably priced.", "title": "Absolutely brilliant", "helpfulness": 1, "user": "SallyLake", "date": "February 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56117401}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "There are plenty of bars and restaurants within easy walking distance. We would recommend the Thai Square near the tube station.", "title": "Nothing to complain about", "user": "Spankin", "date": "February 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55696443}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "My family and I stayed here on our wedding day (only small at the registry office) and the experience was brilliant from start to finish. Firstly I messed up the booking and they accomated me last minute with no quarms whatsoever. The staff both before and during the stay were all expcetional, They were so helpful and knowlegable and friendly. We came back to the bar in the evening after our wedding meal and drank there (they saved us an area). The bar staff weregreat and the drinks and food very reasoable. We live a few miles away from the hotel and will be recommending the hotel to anyone who wants somewhere to stay in London.", "title": "excellent", "helpfulness": 3, "user": "ness97", "date": "February 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55008044}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Thank you very much", "title": "Excellent value, will return", "user": "Muzakhater", "date": "January 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54652742}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "After travelling for 13 hours from a trip abroad i decided to stay in London for the night. I looked online for a hotel near Angel station and this one was the nicest one i could see in my price range. I arrived at the hotel at 10:15 am with the intention of just dropping off my case as i was well before check in time. After mentioning to the staff that i have just been on an 13 hour flight they found me a room and let me check in so i could get some rest and freshen up.", "title": "5 star staff", "user": "fiferforever", "date": "November 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50227826}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I felt they went that bit extra which made my day.", "title": "Great location, average hotel", "user": "Clayre8077", "date": "November 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 49997908}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "The room was lovely, very spacious and clean. It had everything i need and was very comfortable at a very reasonable price.", "title": "Good for groups, ideal for stag/hen or friends", "user": "foxystoat1", "date": "November 17, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 49436027}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "I chose to stay at Jury's hotel in Islington because of the location. The hotel is very close to the tube station & there are lots of great resturants/shops etc located nearby in Upper Street.", "title": "Disappointed", "user": "vicl0u", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 1.0}, "id": 48999403}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "This was the first time I have stayed in a Jury's hotel. I thought it was a little basic, similar to what you would expect in a travel lodge, however I would most definetly stay again. I paid £370 for 3 nights 2 people B&B through travelrepublic.com.", "title": "Shabby, but cheap in London terms", "user": "BigDLondon", "date": "November 9, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 48821322}, {"rating": 2.0, "title": "Never again", "text": "We lived in London for 5 years, in an area very close to Jury's Inn, so we were keen to stay somewhere close to our friends, stomping ground somewhere reasonably priced. The hotel always looked fien when passing so we had no qualms about booking it. Possibly a mistake...", "user": "mariaLimerick", "date": "January 26, 2010", "id": 54411355}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We had been traveling since early morning and were delighted to reach our hotel at about midday. We couldn't go to our room as it wasn't ready to be accommodated so we went away for lunch to give the cleaners a chance to get to our room, which was fair enough.", "title": "Don't stay here if you can avoid it", "user": "Holly_belfast_NI", "date": "January 20, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 1.0, "rooms": 2.0}, "id": 53950780}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "We eventually checked into our hotel at about 3.30pm only to be told that construction work was being carried out in the room above ours and would we mind if we heard noise? We hadn't been informed of this when we booked our room online, and yes we did mind hearing noise, so we asked if our room could be changed before we unpacked. We were asked to sit at reception while they looked for another room for us.", "title": "Rather cheerless comfort", "user": "Commodore", "date": "January 20, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 53950722}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "45 minutes later, we still had had no room updates. When I approached the receptionist and asked him how much longer we'd have to wait, he just handed me the room entry cards which had been sitting on his desk all the time; pity he hadn't made the effort to call to us or come over to inform us. When I told him how foolish I felt to have been sitting only meters away from him waiting for our room when he had it all the time, and would I have been still sitting there hours later if I hadn't approached him, he just shrugged his shoulders and mumbled an apology.", "title": "Clean, quiet, comfortable", "user": "davidh of england", "date": "January 8, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 52911773}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Our room was a bit cold but spacious and confortable; wi-fi was in the room but the hotel charged £5 for an hour which is a complete rip off. The shower head came off in my hand, the view was abysmal and the cleaner walked in on us quite early one morning when we were still in bed. However, we could have lived with all of this and forgotten all about it, but it was hard to see beyond the reception staff - the hotel's interface wit hit's paying customers. The reception staff were abrupt, uncaring and seemed bored of clientele. I felt as thought we were a distraction to their day.", "title": "Highly Recommended", "user": "LeedsLeisure", "date": "January 2, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52381577}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled solo", "text": "I had a good two night stay at this hotel. I arrived at about 12.00 midday but the room was not ready until after 2.00 p.m. This was not a problem however as I was able to leave my bag until later. The young Irish gentleman who checked me in was polite, friendly and extremely helpful. I was given room number 420, which has a corner position with a panoramic view across the rooftops to the Gherkin, Westminster Abbey, The Eye and the Post Office Tower (don't know what they call it these days!). The room was one of the newly refurbished ones and I was extremely pleased with the quality, cleanliness and the view! (Please bear in mind that if you were to ask for this room as a result of my review it is a double room with a double bed - not two singles.)", "title": "Good experience in a nice hotel - would definitely come back!", "helpfulness": 4, "user": "hesketh27", "date": "March 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 58656419}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I didn't use any of the facilities whilst in the hotel apart from my room so can't comment on catering / bars etc... On leaving very early at 5.30 in the morning, the receptionist was efficient and friendly and made me feel that my custom had been valued. The hotel is well placed for Angel tube station and Kings Cross / St. Pancras underground station is only about 10 minutes walk away along Pentonville Road, so if you have a rollercase/bag its a comfortable walk from there too. As you leave the hotel and turn left to walk into Islington, after about 200m there is a small row of shops on the left which has a cafe serving an excellent traditional breakfast for £3.99 (there is a choice of three or four options / combinations). If you are looking for nice friendly bars / pubs there is a wide variety in Islington plus lots of restaurants/ eateries to suit all tastes and budgets. For getting around, the off-peak day tickets are excellent value, you can use them any time after 9.30 in the morning for the rest of the day (or all day Sat / Sun) and at £5.40 for the Zones 1& 2 option which covers everything you are likely to want to get to in central London, they will save you an absolute fortune if you are making several journeys on the Tube. You can order and pay for tube /t ransport saver tickets via thetube.com website and have them sent to you though the post. I certainly had an enjoyable break staying at this hotel, liked staying in Islington (I usually stay in the Marble Arch area) and for the price (£90 per night ) such a nice hotel in London was excellent value. I will definitely stay here again.", "title": "Central, clean and really great", "helpfulness": 1, "user": "trav!!ler30", "date": "March 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 58224909}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I was very impressed with this hotel. I arrived at the hotel around midnight on a busy Friday evening. I was checked in quickly and efficiently and was given one of the newly renovated rooms.", "title": "So so", "helpfulness": 1, "user": "Linsta78", "date": "March 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 57566312}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The room was very spacious with a double and a single bed and it was spotlessly clean. The bed was comfortable and the room was quiet which was great and very welcome as I was there for a conference and had a really early start the next day. . The bathroom is a decent size with a proper powerful shower. There seemed to be loads of towels and perfectly warm.", "title": "Kind of disappointed...", "user": "ostan14", "date": "February 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 57017120}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The situation is good and it’s pretty close to Angel Tube station and loads of buses go straight past it. Also, lots of useful shops like Superdrug or Waitrose are nearby which is handy if you just need to grab a quick sandwich or something.", "title": "Excellent location, great stay", "helpfulness": 1, "user": "I-love-love-holidays", "date": "February 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56526777}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 3, "variance": {"poor": 62, "average": 140, "very good": 462, "terrible": 18, "excellent": 275}, "aka": "Jurys Inn Islington Hotel", "slim_ranking": 0.278810408922, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Hotel situated adjacent to Islington High Street, a few minutes' walk from Angel tube station."}