{"user_rating": 4.5, "review_count": 1014, "name": "JW Marriott Camelback Inn Scottsdale Resort & Spa", "reviews": [{"rating": 5.0, "title": "Wonderful Resort", "text": "We stayed at the JW Marriott Camelback Resort for two days in September after getting a room for $77 per night on Priceline. This was definitely the best Priceline deal we've ever had. We both loved everything about the resort. We were given a huge room with a private patio and a view of Camelback Mountain. The staff could not have been more friendly and helpful, especially the concierge and room service employee, Fitzroy. The grounds are absolutely stunning. We rented bikes from the bell desk for an hour and just rode around the property (it was too hot to go further). We saw about twenty species of birds, including quail and different kinds of hummingbirds. Even though this is a high-end resort, it did not feel at all stuffy. Everyone was dressed very casually, including at the on-site restaurant. One tip: the packaged Starbucks coffee by the coffee maker is not free, and you will incur a mini-bar charge if you use it. I would recommend this resort to anyone and hope to return soon. The ongoing renovations did not detract from our experience in the least. The temporary lobby is very charmingly done.", "helpfulness": 5, "user": "shario", "date": "September 24, 2007", "id": 10000127}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Stayed here as part of our honeymoon trip touring california/nevada/arizona/hawaii. With the exception of the luxor in vegas, this was my favourite hotel out of 12. We booked through skoosh and paid about £50 for one night which I thought was excellent value for money. The property was fairly empty at this time(perhaps due to the heat?). Although it is located more than walking distance from bars/restaurants i really liked the luxurious feel of the casitas. The room was tastefully decorated, it looked very new actually. it also had a fantastic aircon system and the bed, wow. The bed was quite possibly the nicest bed i have ever slept in ever, a real comfort when you have been travelling long distances and are tired out. The construction did not impact on our stay whatsoever, please don't let this put you off. The pool area is clean and tidy and they come round frequently to get you drinks/towels etc. As this was a one night stopover we didn't get to sample many of the other resort facilities so i can't comment on those. My only gripe was with the restaurant, we had particularly bad service in the restuarant near to the pool, in particular the waitress taking a long time to get us things/take our order but i wouldnt let this put you off either. All in all - a lovely hotel, my only sadness is that we only had time to stay for one night!", "title": "Loved it!", "helpfulness": 3, "user": "v1ckyh", "date": "September 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8874852, "likes": {"liked": "— The high quality of the rooms - and also the views of camelback and mummy mountain", "disliked": "— The server in the restaurant"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "I stayed at TCI for one night with my cousin. The rooms were nice with native-american decor. Beds were super comfy and check-in/out was a breeze. I had a hot stone massage at their spa and it was delightful. Big spa with elegant pool/cabanas. We rented a cabana that came with a fan, water and fresh fruit. The weekend we were there the weather was in the mid-90s so it was nice, not too hot.", "title": "i wanna go back again! Great spa....", "helpfulness": 3, "user": "Bananz", "date": "September 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8865565, "likes": {"liked": "— Spa and comfy beds", "disliked": "— Noisy quiet room in spa! Shut up ladies!!"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled solo", "text": "My massage was great. My only complaint was that the \"quiet room\" was really noisy with loud chatter. Lots of gossiping girls just being loud. Not how we spa in CA...that's for sure. Overall the stay was great and breakfast at Hoppin Jacks was yummy.", "title": "Beautiful land, Village un-hotel Atmosphere, Dated rooms", "helpfulness": 3, "user": "clearbluewater11", "date": "September 20, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 8828339, "likes": {"liked": "— The attentiveness of the staff and that you could take out dinner from the restaurant.", "disliked": "— That there's no stores in walking distance and that the rooms offer no privacy unless you black out the windows."}}, {"rating": 4.0, "title": "Fine Resort - Even with the construction/remodel", "text": "Want to go back again for sure. This time I am going to ask the spa staff to come in and shush people in the quiet room!!!", "helpfulness": 2, "user": "djstraveler", "date": "September 15, 2007", "id": 8721107}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I organize meetings for a non-profit group that I belong to so I speak with a lot of hotels every year and have stayed at even more, both through the group and in my own personal business and personal travels.", "title": "Great experience", "helpfulness": 7, "user": "TNConstanttraveler", "date": "September 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8693190, "likes": {"liked": "— comfortable beds", "disliked": "— the cupboards in the kitchen"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The Camelback Inn impressed me (not easy to do). It started off a bit shaky as I spoke with more than one contact during the organization period early on. Later, I spoke with two reps, one for food, one for the meeting. Both were incredibly professional and had a \"can do\" attitude.", "title": "Warm, friendly, top notch", "helpfulness": 5, "user": "rockandroller1", "date": "August 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8535849, "likes": {"liked": "— Beautiful landscaping, intimate feel, resort/property design"}}, {"rating": 4.0, "title": "Solid Overall, But Too Large To Offer \"Wow\" Service", "text": "I picked the Camelback Inn because the rates were incredibly low given the fact that they are undergoing renovations. I must admit though, I was very nervous about picking a hotel in renovation and having my group complain bitterly if it was noisy. I couldn't have been more pleased! I had no idea they were renovating! I heard and say nothing! The room rate was an impressive $139/night and I reserved a 2bdrm (with its own pool) for $179/night!! Incredible!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 23, 2007", "id": 8490000}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "The rooms were a good size, were well equiped, had down quilts (a must in my travels) and best of all had comfortable beds!! You have no idea how many 5 star hotels I stay at that have uncomfortable beds!", "title": "Wow!", "helpfulness": 5, "user": "af847", "date": "August 16, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8432087, "likes": {"liked": "— Scenery, service, details", "disliked": "— Loud air conditioner in room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The staff was incredible.", "title": "Didnt want to leave!!", "helpfulness": 4, "user": "Hot Tropic", "date": "August 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8406355, "likes": {"liked": "— Location to the Mountains", "disliked": "— Distance from Hangouts"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "We flew into Phoenix for the first night of our honeymoon and i had previously booked 2 nights at this resort, per the reviews in Tripadvisor. I knew in advance that the hotel was in transition-mode, but they did a pretty good job of hiding it. We loved our little casita, it as very roomy and the patio was perfect. We had dinner and drinks a couple times at the restaurant overlooking the pool and the mountain. What a view at sunset!!! Absolutely gorgeous!!!", "title": "Relaxing Resort w/ Nice Pool & Spa", "helpfulness": 4, "user": "mainetoday", "date": "October 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10079554, "likes": {"liked": "— Casita Itself and Patio, Pool & Spa", "disliked": "— Long Drive to Get Anywhere... Couple Miles, Nothing In Walking Distance"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "The pool was nice as well, being open 24/7 was a plus, as we usually prefer to swim after dark.", "title": "Fantastic but nickle and dime you", "helpfulness": 5, "user": "BKR-7", "date": "October 12, 2007", "detail_rating": {"business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 10071675, "likes": {"liked": "— Fantastic property and great service", "disliked": "— Added charges for anything you can imagine!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I enjoyed getting up early in the morning and going for a little hike on their trail on the side of the mountain behind the resort, beautiful views.", "title": "Transition Mode - Still Lovely", "helpfulness": 1, "user": "SLYCAST", "date": "October 11, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10067670, "likes": {"liked": "— Decor of rooms", "disliked": "— Construction"}}, {"rating": 5.0, "title": "In all the world there REALLY is ONLY ONE", "text": "We spent a whole day in the newly renovated spa on site. All i can say was that it was very relaxing. Although there are no \"couples massages\", we each had the Swedish Massage and then enjoyed the steam room . Then we spent the day by the private pool at the spa. Great food, great drinks and the big tv in the men's lounge was perfect for Sunday football sneak peaks.", "helpfulness": 2, "user": "chris-1948-surrey", "date": "October 9, 2007", "id": 10057533}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "All in all, i would definately recommend this to anyone that is looking to have a relaxing, mellow vacation to chill out by the pool or go to the spa.", "title": "Beautiful resort despite the building work", "helpfulness": 1, "user": "dundeetripper", "date": "October 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10041979, "likes": {"liked": "— the view and the grounds", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "As a platinum member of Marriott Rewards, we have stayed in many of their top properties. This is not one of them. Friendly staff, spotless grounds, but the rooms were very tired. I was disappointed to see stains on all the furniture in our room. This is not something I would expect at a \"5-star\" property. In fact, had I not know I was in a Marriott room, I would have guessed it was a Holiday Inn. I filled out a survey and noted the room condition, but was never contacted with an explanation.", "title": "Great service but...", "helpfulness": 7, "user": "Waylontdog", "date": "July 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 2.0, "location": 5.0}, "id": 8247869, "likes": {"liked": "— Cleanliness of grounds, friendly staff, great location/weather", "disliked": "— Room was in need of renovation, stains on furnishings, carpet, etc."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "Overall, the service was outstanding and it is a nice property, but the rooms are far too expensive for their condition. I'm surprised they have been able to maintain such a high rating.", "title": "Camel Back Inn - Best in the Southwest!", "helpfulness": 5, "user": "nw1861", "date": "July 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8234890, "likes": {"liked": "— The service staff were some of the friendliest I've encountered", "disliked": "— Did not get to experience the resort when it is not under rennovations."}}, {"rating": 5.0, "title": "Awesome Relaxation", "text": "The service was excellent. Stayed in a Deluxe Casita Room away from the main pool. It was comfortable and clean; bed was heavenly. They were always asking if you wanted a water bottle (it was 110) and made every effort to accommodate requests.", "helpfulness": 4, "user": "toothclean", "date": "July 20, 2007", "id": 8194250}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "Amazing job keeping the renovations the hotel was undergoing out of sight and earshot.", "title": "Wonderful Experience", "helpfulness": 3, "user": "ann080", "date": "July 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8123992, "likes": {"liked": "— service and quality of room"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007", "text": "THE SPA - One of the best! Treaments were great, facilities and spa pool were total relaxation. Eat at Sprouts in the Spa.", "title": "A Relaxing Stay at the Camelback Inn", "helpfulness": 4, "user": "CalfiforniaDude", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8058171, "likes": {"liked": "— Jack Rabbit Pool and Hot Tubs, Beautiful Grounds, Friendly Staff", "disliked": "— Expensive food and drinks, needs more variety of different pool types"}}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 31, "average": 60, "very good": 243, "terrible": 10, "excellent": 670}, "aka": "Jw Marriott Camelback Inn Scottsdale Hotel Paradise Valley", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Unrivaled among Scottsdale resorts, JW Marriott Camelback Inn Resort & Spa remains faithful to its storied history while boldly embracing the future. Located on a breathtaking 125-acre campus beneath Mummy Mountain, this stunning luxury resort features a hacienda style entry, casita guest rooms and impressive amenities that leave guests with the thought of \"In all the world, only one...\" In addition to 24-hour room service guests can indulge in the fresh restaurant offerings including Rita's Kitchen, R Bar, featuring live music and inviting fire pits, or the famed BLT Steak. Golfers will enjoy 36-holes of championship golf at Camelback Golf Club or instruction from the Advantage Golf School. Spa-goers can unwind at award-winning Camelback Spa with a signature spa treatment, or poolside beneath a cabana while overlooking Camelback Mountain. When you are ready to discover the local area, allow the professional concierges to compliment your interests with the perfect activity or attraction. It's easy to understand why families, business luminaries and leaders alike return to Camelback Inn year after year."}