{"user_rating": 4.5, "review_count": 865, "name": "JW Marriott Indianapolis", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Towering 33 floors, the transparent design of the JW Marriott Indianapolis allows it to be seen for miles and makes a prominent mark to the downtown skyline. Check-in for my three night stay for my brothers wedding was a breeze and just took a few minutes. Took the high-rise elevators to the 24th floor not sure what to expect. The room, 2405 was a very well appointed deluxe king room featuring top notch amenities and offered superb views of downtown Indianapolis especially at night. Enjoyed a few drinks at the lobby bar and the breakfast buffet at Osteria Pronto, one of the hotel restaurants. It was a bit pricey but the selection and food was very good. This hotel is situated in the middle of downtown right on the banks of the White River and is very close to many downtown attractions including Lucas Oil Stadium.", "title": "JW Marriott Indianapolis", "helpfulness": 1, "user": "evvtraveler", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132681255}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "There was one thing that I did not like. The elevators at this JW Marriott required you to swipe your key card to get above the 4th floor. After the first night, my card was not being recognized and I had to go down to the lobby a few times to get new keys. This got pretty old if you were constantly in and out like I was.", "title": "better than I hoped for", "user": "RickHawaii", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132526868}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Can’t wait to stay at the JW Marriott Indianapolis again in the near future.", "title": "Good but expensive", "user": "MJordan299", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132483858}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "great, valet parking was expensive but lobby beautiful, registration meets you halfway as you walk in, room beautiful, lobby bars seemed happening, starbucks inhouse, concierge, pool, fitness , internet, italian restaurant, good location , quiet rooms , toiletries high grade, staff pleasant, 24 hour rooms service", "title": "Nice hotel. Few minor Irritants.", "user": "Islander_66_10", "date": "June 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 132464987}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Like the hotel look from outside, room is nice. But I think it's a little over priced.. location is good since it's in city, but city not big at all.. so why so expensive, i don't know", "title": "Great Hotel", "user": "beeechgirl", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132397872}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "A great hotel in a small city. The JW does it all very well. Even at breakfast, when the waiter forgot to enter my breakfast, they did the right thing, took responsibility, gave it to me for free and offerred another free breakfast for the next day. The rooms are bright, large and clean, easy to work in your room, the health club is first rate and the staff is friendly and helpful. Strongly recommend staying at this property if you visit Indy.", "title": "First Class", "user": "alwayswantstotravel", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128966274}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I can't tell you how pleased I was with this hotel. I stayed here for 3 days for a conference. Everything was fantastic - the room was spacious, spotless, and comfortable. And talk about a view! The staff was extremely courteous and helpful. It's a huge hotel but you get treated like a smaller, boutique hotel. I loved the interior design, it was just done well start to finish. If you're planning a conference in Indianapolis for a large group of people, have it here! Our conference had over 500 attendees and there was always plenty of food (delicious food at that!) and helpful staff. I really didn't want to leave - and that doesn't happen very often when traveling for business. Well done!", "title": "Went Here for Business. Finding an Excuse to go Back!", "user": "jracleveland", "date": "April 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128618268}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "This is my 9th year being a Marriott rewards memeber and I have used and gain points over time, but this is the FRIST time that I can care less about the points and say I should have stayed at the CONRAD or WESTIN which I am a memeber there as well.", "title": "Business and I have to go back to this Hotel next year..smh", "user": "I-flyalot c", "date": "April 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128588613}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The Good:", "title": "Real nice place", "user": "RickfromPgh", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128519565}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The Hotel is very clean and the rooms are as well.", "title": "Exceptional room, great service", "user": "townby", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128446281}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The shiny black edifice of this new 1,000 room convention hotel towers over a handful of other Marriott brands within a one block radius. I've stayed in the Downtown Marriott many times on business trips to Indy and was pleased to stay in the more upscale JW on my latest trip. The hotel has all the amenities found in a first class business hotel. The one thing that struck me as being outstanding was the friendliness and helpful attitude of the staff. I can't say enough about the front desk, wait staff and every Marriott associate I encountered during my stay.", "title": "New Downtown JW adds to the Marriott Presence in Indy", "user": "Hotelie1970", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 131516362}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Got a great rate for the Indiana Vintage Wine Festival. Very busy hotel. Front desk person was very friendly. Needed extra towels and had them within 5 mins. Decor was very nice and everything very clean.", "title": "Very nice hotel", "user": "jguynn", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131351949}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "So unhappy with our stay on Saturday, a stay I was very much looking forward to. I booked our room with my debit card, as that is what I had handy at the time. However, when checking in I presented my credit card as my form of payment. Not an unusual occurrence, I'm sure. However, a check of my accounts later in the day showed that the front desk employee who checked us in charged the $50 incidentals fee to BOTH my debit card AND my credit card. I was furious. I NEVER presented the debit card at the time of check in and NEVER authorized it to be charged for anything. When I went down to the front desk to complain (of course, they didn't notice the mistake and let me know proactively), the front desk staff had no clue what was going on. She first tried to tell me that my room rate of $163 plus tax equaled $427 total. Then, after I explained over and over again the problem, another staff person intervened, took down my debit card information and assured me that the $50 charge would be credited within a few hours. That was Saturday night. It is now Monday afternoon. It has still not been credited back. I am about to call the bank and report the charge as fraudulent. I just cannot believe the ineptitude of the front desk staff.", "title": "Incompetent Staff", "user": "Sarah M", "date": "June 4, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 131281400}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Then, when ready to check out on Sunday at 10:30 we called down to valet. The employee who answered informed us that due to the high volume of departures we should proceed down to the valet desk. Fine, no biggie. So we head down, give them our valet ticket and wait. And wait. And wait. Multiple hotel guests who requested their cars after us receive their cars and leave. And still we wait. A super friendly valet attendant checks on us twice regarding our car but it seems to have no effect on our extraordinarily long wait time. Finally, our car arrives and we hastily depart.", "title": "Top hotel in Indy (so far)", "user": "Jamesjcog", "date": "June 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131107919}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Never again JW Marriot! The Conrad is the downtown Indianapolis hotel for me.", "title": "A Tough Stay - Not Yet Ready for Prime Time", "user": "SundayRiver2u", "date": "May 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 131000977}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Best toilet paper in town. It was the only thing I stole from the room.", "title": "Totally Soft", "user": "Jeremy W", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129336335}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Wonderful hotel, immaculate, welcoming, abuzz with music and activity (for a conference) with lots of room to find your little slice of heaven. Great workout room with terrific equipment, too. Room was stocked with bottled water everyday - a definite plus for me. Staff was so welcoming and positive. Couldn't have done enough for you to make you feel special. Location is directly across from the Convention Center with covered walkways connecting it to the Center and other major hotels on the same and next block. Across from the Lucas Stadium, too. About a $40 cab ride from the airport - I think it was about 10 miles or so. Would definitely stay again when back in the midwest. Only negative was the breakfast choice. There is a restaurant in the hotel with not many other choices nearby that charges $16 for the breakfast buffet. Ordering separately off the menu costs even more. Too much food for me to eat so they've \"got you\" for this meal. There is a Starbucks on the 2nd floor with incredibly long lines, but I am not a fan of that coffee, so I was stuck. Otherwise, don't hesitate to stay here.", "title": "A little slice of heaven in the midwest!", "helpfulness": 1, "user": "poneill331", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129166765}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Just returned from a four day conference in Indy. I attended a conference in Indy over a decade ago and was pleasantly surprised by the growth of the downtown area, including many new hotels. The majority of the hotels are attached to the conference center by elevated walkways, a wonderful feature when it is raining.", "title": "Kudos to JW Marriott Indy", "helpfulness": 2, "user": "OTAWAY", "date": "April 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129052081}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Pros: The staff are wonderful - kind, helpful, and empowered to create changes to assist guests. The city's conference center hotel booking service used by my national association failed to provide an accurate hotel reservation request to the Marriott. We asked for a concierge-level room with two queen beds and received a concierge-level room with a king bed. The front desk clerk apologized (mind you, not their fault), changed our room, allowing us to keep the other room and keys until my roommate could transfer her belongings later in the day. Nothing else was available on the concierge floors but he moved us to a lower floor in the same elevator bank and we were able to keep the Concierge services (obviously, paying for them in the room rate). They also comped us for lunch. Food on the concierge level is excellent - better than any hotel I visited. Free internet on the concierge level as well and a computer and printer in the concierge center - used it to print airline boarding passes. They offer a real breakfast that includes hot entrees, as well as cold breakfast selections and dessert at night. They also offer hor d'ourves but I was never in the hotel at that hour and cannot attest to the quality.Take-out coffee cups, water bottles, and soda are available all day along with apples and granola bars. The room was new, clean, large, good mattress, great views from either side of the hotel (we had a city view) through floor to ceiling glass. The hotel is also adjacent to two of Indy's museums. There is a Starbucks on the second level of the hotel next to the walkway to the convention center. This is a large hotel and the elevators are fast, an important feature when everyone is rushing off to a conference session in the morning.", "title": "Amazing hotel", "user": "rhowc13", "date": "April 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129034549}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Cons: Need firmer pillows - seriously. The quantity is not as important as the quality. Ate in High Velocity for lunch twice. First time had a waitress that needs to consider customer service. Example: A colleague asked for coffee, waitress (sighing) \"well, I COULD make a new pot if you really want some.\" Would he have asked if he did not want the coffee? Second time ate at the bar because the seating person did not seem to want one person taking up a table and I was not in the mood to argue with her right before I left for the airport.", "title": "THE place to stay in Indy!", "user": "IndianaOnTheGo", "date": "April 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 129006385}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Wow! I was here for a conference. This hotel is amazing. Words do not do justice to my experience here. I miss it already! I have stayed in multiple hotels over the many visits to Indy and none compare to this hotel. The experience starts the moment you check in. You will be escorted to the elevator and even to your room. No one carries bags here. The staff immediately has someone take your bags and bring them to your room. The rooms are gorgeous and great views to downtown! Totally spacious and new. You will melt into the beds. Dispite the hotel being sold out during the Indy 500 week and weekend, I was never disturbed by noise. The hotel restaurants are really fun and great food and drinks! Service at the hotel bar is great. I was on an Executive level room and the Executive Lounge is a dream. The breakfast..delicious! Every inch of this hotel is spotless. Every hotel manager should visit this hotel and learn customer service. I have never been treated better and my every question and need was met with a smile and they went out of their way to be helpful. Loved every minute of my stay. Internet is fast, the gym is big and wonderful. The pool area is very nice. A stay at this hotel is worth every penny spent. You will not be sorry!", "title": "Top Shelf all the Way! The only hotel I will choose when in Indianapolis!", "helpfulness": 1, "user": "keeptraveling01", "date": "May 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130959083}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We arrived in Indianapolis for a wedding that was being held at the JW Marriott. From the moment we arrived we were made to feel special! The rooms were state of the art, clean and the service was incredible!", "title": "Great Hotel and Wonderful Service", "user": "zarf46", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130909472}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I loved the convenience of the hotel to the sites that I wanted to see. ie, Indiana State Museum and a Starbucks in the hotel. (I love good coffee!)", "title": "Lovely and Convenient", "user": "Jason S", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130637325}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We also recieved a reduced rate because of the wedding, which also made the stay more enjoyable!", "title": "Indy 500!", "user": "Randy L", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130629605}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Stayed here for two days in May and found the practically brand new hotel wonderful in all respects; I will be back for another convention next spring and am looking forward to it! My experience was practically flawless -- from being escorted from check-in to the elevators, to the large and fully equipped gym, to food and drinks at the hotel's restaurants, to the actual conference experience in the on-premises facilities. Very convenient to downtown Indy, the sports arenas, and the convention center (to which you can connect via sky bridge). Would definitely recommend this spot to others heading to Indy.", "title": "Beautiful hotel, excellent service", "user": "burchard", "date": "May 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130598556}, {"rating": 4.0, "title": "Still need to fine-tune the details", "text": "My husband, daughter (4 1/2) and I just spent 3 nights at this property. The property is absolutely beautiful. The hotel staff was very friendly and tried to do their best to meet our needs. Upon check-in, we were told that this JW Marriott is the \"best\" in the world based on customer satisfaction surveys. Unfortunately, they missed the boat in a few areas. Here is a highlight of the stay.", "helpfulness": 2, "user": "China101", "date": "June 19, 2012", "id": 132347080}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "*We were in an executive suite (rack rate is over $1000/night for this room). We didn't ever have turn-down service. We also had breakfast included as part of our room and had tremendous issues getting out \"vouchers\". The hotel did give us complementary parking because of the hassle but even after having a manager \"send up vouchers right away\", the vouchers never made it to our room. Also, the room does not have a bathtub and the design of the shower is such that the floor of the shower is the same as the floor of the bathroom so the floor of the bathroom (mat, rugs, etc.) get all wet from taking a shower. There were 2 adults and 1 child in the room but we never had more than 1 robe and 1 pair of slippers in the room.", "title": "Terrific", "user": "Earl9371", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132240798}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "*The High Velocity Restaurant had great food at reasonable prices. They also had excellent service and Liz, the hostess truly made the stay memorable for our daughter. However, our server on our last night, told us more than we needed to know when he said he never puts a lime in a drink unless it is specifically ordered to \"cut down on costs\". Really, JW Marriott? Also, they were out of children's menus and didn't have the menus the 3 nights we were there.", "title": "Stay at the JW and experience a great business hotel", "helpfulness": 3, "user": "AndrewLoveSydney", "date": "June 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 131901699}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "*The Lobby Bar and Osteria Pronto both had awful service. We had to flag down servers. We had to flag down someone to take our credit card to pay our bill (lobby). The calamari we ordered was a pile of deep-fried veggies hiding a few pieces of calamari. In Osteria Pronto, we were frequently surrounded with plates (from the breakfast buffet) with our server nowhere in sight to clear them.", "title": "Amazing!", "user": "Gould1102", "date": "June 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131842605}, {"rating": 5.0, "title": "Beautiful hotel conveniently located", "text": "*The lobby had flavored waters. Unfortunately, they didn't always have cups by the water. It appeared that the staff was sometimes so busy standing around doing nothing that they didn't stay on top of the basics - similar thing at the concierge desk as all of the maps were gone and no one had reprinted.", "user": "jk67", "date": "June 12, 2012", "id": 131837875}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I stayed two nights at the JW Marriott to attend a conference. Check-in was quick and the room was clean/comfortable. On one of the nights, we had dinner in the hotel's Italian restaurant. The food/wine was great and service was fine. I did notice that even on the higher floors, road noise can be an issue if you are a light sleeper. A room with the canal view may be quieter. This hotel is connected to the convention center. If you don't need this location, the Westin, up the street, is a bit closer for walking to the downtown area.", "title": "May 2012 visit to JW Marriott", "user": "VisitorBob", "date": "May 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 130298814}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I had an event to attend in the JW's Grand Ballroom and decided to book a room so we wouldn't have to drive home to the suburbs late at night. We were very pleased with our experience at this hotel. Check in was quick and very friendly. We were given a park view room on the 30th floor and appreciated the room view from this level. It was fun to look out and see all the way out to the airport and the pyramids on 86th St. The room was clean and all the furnishings were in great condition. All staff members we encountered during our short stay were curteous and professional. I will be recommending this hotel to out-of-town family and friends. Perhaps we'll even vacation downtown more often ourselves as it was just a quick walk to many attractions, restaurants and bars.", "title": "Beautiful Hotel", "user": "bams220", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130037423}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "So, since it opened, I have been intrigued to stay at the JW Indianapolis. We are Marriott Elite members and stay at a lot of Marriott hotels nationwide. Normally our preferences are for JW Marriotts or Ritz Carltons, but we also stay at a lot of Four Seasons and Mandarin Oriental properties as well. It really is just a convention hotel with luxury aspirations though, in my opinion.", "title": "The Highs and Lows of JW Marriott Indianapolis", "helpfulness": 1, "user": "Andrew C", "date": "May 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 129921883}, {"rating": 3.0, "title": "Not the \"jewel\" as advertised", "text": "The manager was good enough to book us in into a great corner room, as there are very little suites on the property as I understand it. We had some great amenities and access to the executive lounge. Upon arrival, we did valet and went inside. My first observation was \"THERE IS A BIKER'S CONVENTION AT THE JW ON MOTHER'S DAY WEEKEND???!?!?!\" To say I was speechless was an understatement. Thankfully we put my MIL at Springhill Suites attached to the JW. While waiting to check in, we heard the F-BOMB thrown around by one of the convention goer's several times. We also heard the derogatory term for the female anatomy and what one does when one attends to the loo. I was not impressed. The worst part was, the hotel employee that the man was talking to did not ask him to be more discrete about his language.", "user": "A TripAdvisor user", "date": "May 12, 2012", "id": 129832715}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "Our room was not ready upon arrival so we checked our bags and ventured off to check the MIL in. An hour later, I got a call that the room was ready and we could pick our bags up... no bag delivery to the room??? Again, that is how a luxury hotel handles a room not being ready, not pick them up at the front desk. We came back to the hotel and picked up our bags and went upstairs to the room. The room was very nice and well laid out. There was no mini bar or refrigerator in the room at all. The bathroom was VERY SMALL and only had a shower. The body sprays in the shower were a nice touch. You could not open the door to the shower and the bathroom door at the same time. I am pretty sure the bathrooms at both Springhill Suites and Courtyards are a standard size that is larger than this. Again, a luxury hotel with a room with only a shower. Disappointed. Upon use of the shower later we learned that the body sprays overwhelm the drain and we had to keep turning them off or the water would have overflowed on the floor. Very poor design.", "title": "Very comfortable, good room service", "user": "ButchEkstrom", "date": "May 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 129767608}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Hotel was is in the center of all good restaurants, attractions and convention center (do not have to leave hotel to get there is weather is inclement)).", "title": "A winner hotel in Indianapolis", "user": "Singingsal17", "date": "May 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129765112}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Had a great Sports bar, High Velocity and service was excellent. Cannot go wrong at this Marriott.", "title": "Great hotel in a nice city!", "user": "Barbie726", "date": "May 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129652657}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We stayed at the JW Marriott for a convention and were impressed by the hotel and the meeting rooms. We had a beautiful room on the 29th floor facing the river and park. If you want a quiet room, request the river side of the hotel. The bathroom had a wonderful stall shower and everything was clean and comfortable. I had dinner and breakfast at the Italian restaurant in the hotel and the food was great. It was great having the convention right in the hotel so you could access all of the meeting rooms from the hotel elevators and didn't have to go outside. It was cold while we were there but it was still a comfortable walk to any of the downtown restaurants. The service was very good in the hotel and if you are attending a football game, the stadium is only minutes away. I would highly recommend the hotel to anyone traveling to Indianapolis which I have to say is a very nice clean city.", "title": "World-Class in Indianapolis", "user": "BDjango", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129574770}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Downtown Indianapolis is architecturally elegant and JW Marriott is the keystone.", "title": "Great Place !!!", "user": "Chicago-60653", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129484519}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "When we entered the lobby last Friday afternoon, waitstaff were offering on their trays, pasta in tiny glasses. Unusual offering, I thought. The mini-marathon was the next morning, so of course!", "title": "Luxurious treat while attending a convention", "user": "IndianaOnTheGo", "date": "May 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 129336737}], "location": {"country": "United States", "city": "Indianapolis"}, "stars": 4, "variance": {"poor": 10, "average": 51, "very good": 164, "terrible": 8, "excellent": 632}, "aka": "Jw Marriott Indianapolis Hotel", "slim_ranking": 0.010989010989, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Sophisticated design meets classic hospitality at the largest JW Marriott in the world—JW Indy. Boasting 1,005 contemporary guest rooms and 100,000 square feet of sprawling event space, JW Marriott Indianapolis is the crown jewel of the new Marriott Place Indianapolis hotel complex, a distinct destination for business and leisure travelers in the downtown area. Not only offering the largest ballroom in the Midwest, this Downtown Indianapolis hotel also provides creative event planning services for meetings, weddings and social events of various sizes. There is also direct access via skybridge to the Indiana Convention Center for event larger events and conventions. In addition to incredible meeting space and spacious guest rooms, JW Marriott Indianapolis provides exquisite dining options onsite at High Velocity, Osteria Pronto and Tavern on the Plaza. Nearby, over 200 shopping, dining and entertainment options beckon, including White River State Park, Lucas Oil Stadium and Conseco Fieldhouse."}