{"user_rating": 4.5, "review_count": 1419, "name": "JW Marriott Orlando Grande Lakes", "reviews": [{"rating": 5.0, "title": "Very nice hotel", "text": "We loved this hotel--great pool, great service! We stayed here for a wedding and really enjoyed it!! This is a nice hotel to stay at with young kids!", "user": "familytraveler013", "date": "August 9, 2007", "id": 8379181}, {"rating": 4.0, "title": "7th stay at the JW", "text": "This was my 7th stay at this property and although there are many problems, the pool has us coming back over and over again. Yes, it's far from everything except Sea World, but you know that before you book so it can't be complained about. Yes, it's a little bit expensive, but it is a gorgeous resort and well worth the money you spend on the nightly rate. Pool bar service was good and the bartenders were wonderful. Food was also good. I found the employees to be very courteous and helpful. Overall, this is one of my favorite resorts in Orlando, but on this trip several things bothered me. To charge $12.00 per night for self parking is insane as you are already paying $200 plus per night for the room. We needed to use our laptop the first day we were there for about an hour for business purposes. We never used it again after that and yet we were charged 13.00 for each day we were there (6). We didn't even bother trying to work it out with the front desk because they stilled owed us $104.00 credit from the last time we were there. When we questioned them about that (and yes, we had our receipt from our last stay) they told us to call accounting. After explaining to them that we had been trying to reach accounting for many months, they gave us the credit. The resort itself is outstanding, but they do have some service issues that could be improved. Would I return? Definitely...love that pool!!!", "user": "lvgiants10", "date": "August 8, 2007", "id": 8371076}, {"rating": 5.0, "title": "3rd year in a fow - fantastic", "text": "We stayed at the JW Marriott for the 3rd year in a row for my son's birthday. I can't say enough great things about this hotel. The staff were the friendliest I've ever found in the nation - they made us feel like royalty! The room was wonderful - the pool out of this world. No issues whatsoever and we'll be back next year for sure! There were so many helpful employees - and genuinely so - I can't see how Marriott is making any money - we were amazed.", "user": "JeromeRocks", "date": "August 6, 2007", "id": 8363043}, {"rating": 3.0, "title": "Relaxing getaway at JW Marriott Orlando", "text": "Stayed for 4 nights for a couples-getaway trip in Aug 2007. JW Marriott Orlando is an upscale hotel on a large beautiful property. JW Marriott and Ritz are shared on same property; guests can use both facilities and charge to their room for purchases.", "user": "name_screen", "date": "August 5, 2007", "id": 8358070}, {"rating": 2.0, "title": "Second Time Not The Charm", "text": "Pros:", "user": "Trip H", "date": "July 29, 2007", "id": 8251355}, {"rating": 5.0, "title": "Wonderful . Best Hotel I Ever Stayed At !", "text": "I stayed at the JW Marriott for a week over the 4th of July Holiday !", "user": "dddd1224", "date": "July 15, 2007", "id": 8124296}, {"rating": 4.0, "title": "Stunner of a hotel!", "text": "The day we arrived, that evening, the hotel had excellent fireworks . We sat on our balcony and watched them. I had a great view of the pool and golf course. I recommend a balcony outback. I could see three sets of fireworks every night from SeaWorld and Epcot and some other park. The hotel was so clean. Down Comforters on both beds with the softess pillows. The room was immaculate. The room service was great. The housekeeping came 2x a day. Once in the morning to straighten up and once at night to pull your sheets down and give you chocalate on your pillows. My daughter thought that was great. The service was super. Everyone was so friendly. The pool was awesome and the food was great. The hotel is four years old. I would definitely stay there again. Not a compliant in the world. It was 5 mins . from Sea World , Discovery Cove and 10 Mins from Universal and about 20 mins from Epcot . Not a bad drive at all.", "user": "twinadomom", "date": "July 15, 2007", "id": 8121193}, {"rating": 5.0, "title": "Very Nice Hotel", "text": "We stayed at the Omni hotel which was nice but not anywhere near as enjoyable as JW Marriott. The only reason we booked the Marriott is because the Omni was sold out for the extra day we wanted to stay there. We were originally going to stay there but no rooms for the week available at JW. All I can say is WOW! What a beautiful resort! I didn't want to leave. I was so impressed with the friendly staff that was very willing to accomodate us in every way. They did forget to place a crib in our room for our twins BUT when my husband called for the crib they said they would send one right up but decided the sleeper sofa was fine and they brought up linens/blankets for the kids right away. The staff was walking about eager to please to guests and asked if we wanted our picture taken *as a family* which I thought was very nice. I felt very well taken care of there!as did my husband. The very well manicured grounds were impeccable. The room was beautiful. It was a deluxe garden view room with down feather bedding and duvets........beds were turned down in the evening (after a long day out at Disney)and had soft nature type music playing on the radio when we returned to our room. A nice touch was also mints left on the bed with the weather for tomorrow on a small card which was \"sweet'. Loved the place. I did rave about it to an Asian girl we encountered at checkout at the desk and told her it was so much better than the Omni.She really had no expression and seemed very hurried and not very customer service oriented. (Sat. morning around 11am.)A simple thank you would have sufficed but everything else was great~!! I am very fussy when it comes to hotels and this was perfect for our family.", "user": "Boucher187", "date": "June 28, 2007", "id": 8019362}, {"rating": 5.0, "title": "So Impressed!!!!", "text": "The lazy river pool was outstanding! We loved it! My twins had a ball in the river!The current could be a tad stronger but other than that it was serene! I didn't get the opportunity to try the Spa but will definitely next visit. We will definitely return come Dec.!We are even considering a time share through the property!We didn't get to eat at the restaurants but will next time.", "user": "dsb333", "date": "June 26, 2007", "id": 7998867}, {"rating": 5.0, "title": "LOVED it!", "text": "Stayed at this hotel last year for a work function. The staff was great. The hotel was very clean. The rooms were immaculate. Overall I would give it a 10/10.", "user": "traveltina", "date": "June 25, 2007", "id": 7989514}, {"rating": 5.0, "title": "One word: Perfect", "text": "I stayed at this magnificent hotel just before Christmas and all I can say is wow, what a resort. Everything was perfect. The hotel and rooms where immaculate, the lobby beautiful (better than the ritz if you ask me), the gardens enchanting and the pool area was the best hotel pool I'd ever been (lazy river was so cool, lol). The location was great, not being too far from all the attractions and theme parks, but detached enough to feel like you're in your own private resort away from Orlando. The grounds the whole resort is set in was beautiful and you could easily get lost and just simply be mesmerized by the gardens Spanish architecture and sheer beauty and grandeur of the hotel. There are times when you really feel like you are in a Spanish castle set in paradise ( I recommend on teh first day of your rip to just wander around and get lost in the resort to just explore whats what and where everything is). The spa is world class and has an excellent hi-tech gym. There were several restaurant we visited. We went to Quench which has superbly large portions of food (great caeser salad), Primo which has divine food in very classic surroundings, and Citron which has fabulous breakfast buffets and THE best lunch buffets in the world (didn't have time to go to the dinner) , with incredibly affordable prices (being a Londoner where everything cost at least triple, it was an excellent bonus). The rooms were tastefuly furnished which good entertainment systems. The beds were very comfortable and the turndown service was lovely. The best part of the room was the bathroom. Its very spacious with bath and separate shower and the soap they supply is best smelling soap ever! However, the best thing about the hotel was the amazing service they provided us. Service was very rapid in all circumstances. Every member of staff would greet us without fail which was very nice. There were a few people who really helped us out, and one lady was Sherry, she was very sweet. Also at the concierge there was a lady whos' name I have forgotten, but worked on the left most desk. Not only was she genuinely funny, but she also gave definitive, unparalled advice on what to do and where to go and answered all our questions as best as possible, so if you got any questions go to her! I really do struggle to pick a fault with the hotel, the only problem I encountered was that the beauty of the hotel and its abundance of attractions and facilities distracted me from actually visiting alot of Orlando's attractions lol. There is so much to do here that you could spend your whole vacation without leaving your resort and still having the vacation of a lifetime. All in all a truly fabulous hotel.", "helpfulness": 15, "user": "IranianInUK", "date": "January 3, 2005", "id": 2973167}, {"rating": 5.0, "title": "Fantastic", "text": "My husband and I stayed at Grande Lakes for 4 nights, just before christmas. It was our first stay in the hotel and, should we ever return to Florida, we would definitely stay there again. The check-in was effortless and our luggage was delivered to our room within minutes. Everything about the hotel was clean and well-maintained. All of the staff were friendly and very helpful, especially those in Citron brasserie. The food was reasonably priced and of a high standard, including room-service. Primo restaurant was superb. All in all, an excellent choice of hotel. Sadly, we didn't have time to enjoy all the facilities on offer.", "helpfulness": 7, "user": "zimbogirl", "date": "January 3, 2005", "id": 2972655}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We traveled with our 11 month old daughter and stayed in a regular room (the suites were sold out) and the hotel had a pack n play for our daughter. All the restaurants had high chairs so it was convenient. There are stores in the resort to pick up last minute things (incl diapers) you always find yourself in need of when traveling with a little one. The pools were excellent with a shallow wading pool for really young ones. There are playgrounds at both the JW Marriott and the Ritz Carlton. Also, the restaurants allowed our baby to eat for free which was helpful considering how little and picky kids can be. The rooms were very nice and resort was very attractive. I definitely recommend it.", "title": "Beautiful resort and very kid friendly", "user": "wlslb", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 165437377}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The hotel is beautiful and the staff is professional and welcoming. Absolutely no complaints about the property. BUT we were never advised that there would be a massive conference of teens for Christ. Our rates were never adjusted and we frantically searched for other hotels. Unfortunately for us all hotels were filled with conferences, so we had to stay.", "title": "5 star facility but when booking ask if the hotel would have a conference for 1000 teens", "user": "Newtown_PaShopper", "date": "June 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 165435090}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Our neighbors stopped making noise and the hallways cleared at about 12:00pm. We were out everyday and wondered how other guests could enjoy the lazy river and all the beautiful ammenities .", "title": "Excellent Property", "user": "Art S", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 165380183}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled solo", "text": "So the hotel is a 5* facility. but be aware and ask if a conference of a 1000 teens would be there at the same time.", "title": "Wonderful Hotel to Unwind", "user": "Helloziti", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165378031}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Great staff from the front desk to the bar. They have a lazy river pool that the kids just loved. I wish I could remember the name of the front desk agent she was excellent and made us feel welcome and right at home. We were driving from Maryland and did not look like the normal guest that would stay at the JW. You have to understand 15 hour straight road trip I don't think anybody would look fresh. But the hotel amenities revived us right away. The Bartenders nothing short of amazing while the rest of the family went to the pool I caught the game and had a fresh glass of beer and SUSHI! They have a sushi bar in the bar, they are also attached to the Ritz Carlton property but that is no surprise since they are the same company. What seems to amaze me they have these two heavy hitters right next to each other. They have an amazing golf course as well but I did not get a chance to play it. If you get the chance Go for it Marriott's high end brand is excellent.", "title": "Top notch Orlando Hotel", "user": "traveller9876123", "date": "June 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 165333114}, {"rating": 4.0, "title": "No real complaints, overall a nice hotel", "text": "Stayed at the JW for a conference. Overall, a pleasant experience. It's a modern hotel with nice amenities and good customer service.", "helpfulness": 5, "user": "Karch72", "date": "August 29, 2007", "id": 8538579}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "Pros: Free use of the exercise room; Starbucks on site; good food at Citron; nicely decorated rooms; huge pool; comfy beds", "title": "Great Stay at the JW", "helpfulness": 5, "user": "Need2fly", "date": "August 25, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8505448, "likes": {"liked": "— Lazy River Pool"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Cons: The air conditioning in the room was not good; humidity in the room was horrible (everything from my clothes to the linens seemed damp to the touch); somewhat expensive food prices; quite a distance from many of the attractions.", "title": "Pros and Cons of self-contained resort properties", "helpfulness": 12, "user": "dreampilot", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 8432324, "likes": {"liked": "— Front desk staff, pool, rooms", "disliked": "— Expensive internet, parking and lack of restaurant choice on site"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We stayed at the JW in June for an early summer vacation. The service was top notch and the staff went out of their way to make us feel welcome, including a welcome toy for our 2 year old. The lazy river pool is very relaxing and we had no trouble finding chairs each day.", "title": "My First Stay In Prison", "helpfulness": 10, "user": "Wobbie", "date": "August 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 3.0}, "id": 8424165}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "The resort is beautiful and is attached to the Ritz Carlton. It is not within walking distance of anything so if you intend to eat off property you will need a car.", "title": "My favorite hotel!", "helpfulness": 4, "user": "eireann12", "date": "August 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8394963, "likes": {"liked": "— Lazy river, grounds, breakfast buffet", "disliked": "— high parking fees"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This is the 10th summer we have stayed at The Marriott JW Grande Lakes in June. We booked our rooms in February 2012. We needed 2 rooms. We requested adjoining rooms OR rooms within 6 rooms of each other. We were disappointed when we arrived that our rooms though on the same floor were 25 rooms apart. Our room was a nice room at one end of the 12th floor with 2 beds and a balcony facing the pool/water. We requested the in room fridge which was delivered within 30 minutes of our arrival. The air conditioning was set on high on a setting of 60 but it really didn't keep our room cold...it was \"cool\" at best. We love this resort because of the fabulous lazy river and the outside pool bar, Quench (Poolside Bar & Grill). The kids are always happy with the food and I enjoy being able to stay in my poolside chair and still have food & beverage service. The only problem with Quench is if it rains they close early AND on regular nights they close around sunset (NOT at dark, but sunset). Quench does all you to open a bar/food tab poolside and they will keep it open all day for you & you have the same server. We loved Courtney and Austin! Fabulous servers! The pool is the main source of entertainment for our kids (12 & 15), but they also have a pool table set up, outdoor chess, volleyball, & a game room. On the weekend (weather permitting) they show movies on the big screen by the lazy river. Citron (another casual dining place) will fix you \"take out\" to enjoy poolside as well. We also enjoy having a Starbucks inside the hotel AND Cafe Bodega has amazing fresh, made to order breakfast sandwiches!", "title": "Summer Vacation!", "user": "Travel4Fun465", "date": "June 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165246749}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "Service at the hotel was very good in that people seemed always eager help be it at the front desk the pools or the restaurants. A+. The gym is shared with the Ritz Carlton that is on tihe same property and it is fantastic. The equipment was new, clean and they even have free weights with dumbells to 100lbs. The Lobby bar is quite nice with a good beer and drink selection and there is even decent food. If I had to offer some criticism, which I do, I would say that the menu could be expanded at the bar a little and the rooms, though nice, were a little tight with furnishings.", "title": "Would not be dissappointed to have to stay there again", "user": "Xenon007700", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 165110121}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "This hotel is the epitome of the term opulence. It is massive in size and quality. They have the best staff that I have ever experienced. Everything about this hotel was awesome. It is highly priced, but you get highly treated. It has an impressive pool with a nice lazy river (it could have a little stronger current). My only complaint is that the self-parking lot is literally a ½ mile walk to the hotel entrance. You must have a car if you plan on going to the parks or other attractions. Also, there aren’t too many dining options in the immediate area of this resort. Let’s face it; you don’t plan on eating at BK if you are staying here. There are numerous amounts of activities to choose from. This is not just a hotel, it is a destination!", "title": "Wow!!!", "user": "MardiGrasFun", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 165084859}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Wonderful resort with all the decadent extras you expect from a JW!!! Nothing better than after a hard day at the Parks to relax in that wonderful Lazy River. The staff is very engaged and extremely eager to be of assistance.", "title": "Lazy River Delight", "helpfulness": 1, "user": "Paul B", "date": "June 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164716794}, {"rating": 2.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "A friend and I traveled to this hotel (she had some business to briefly attend to in the area). The hotel is very nice in terms of the room and we received the appropriate upgrades per gold member status (internet fee waived, room upgrade, etc.). The pool was nice (although we heard there could be snake appearances, we never saw any thank goodness) and the lazy river was very nice ($7 for an adult tube). Restaurants were ok but a lot of items were pricey that did not need to be. We were disappointed to learn on our last day rather than on our first day that we could have paid $12 for a refillable mug for certain beverages at pool.", "title": "Hotel needs to improve and stand behind transportation services they offer", "helpfulness": 2, "user": "CJinCT316", "date": "June 20, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 164658030}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "I always have an amazing experience with the JW Marriott, so I was expecting a good time when I booked this hotel, but the Orlando JW Marriott blew me away. I was in town for LASIK eye surgery and needless to say I needed a very chill place o recover.", "title": "Stellar Property", "user": "worldWestVirginia", "date": "June 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 163993941}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The JW Marriott staff went so far out of their way to assist me. The rooms were able to pitch dark even in the bright of day. True to Orlando form, this hotel is awesum for kids with activities, pools and a lazy river. But its stellar for adults with a sprawling weight room which includes a Smith machine if you're serious about training, and on property Starbucks, Primo, a full service Italian restaurant for an excellent dining experience, large rooms and close proximity to the airport, downtown Orlando, Kissimmee, St Cloud and Universal City Walk. Its true that you can come to Orlando and have a terrific experience without ever stepping foot in the parks.", "title": "Everything is expensive - nothing extra for Platinum Elite members!!!", "helpfulness": 2, "user": "654PatPat", "date": "June 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 163910950}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "Every hotel experience depends on what you wanna get out of it. What I needed was a quiet, chill place to recover from a complicated surgery and for me the JW Marriott of Orlando was the perfect place. Its a sprawling, quiet, calming refuge with all the amenities you'd need in order to never have to leave the hotel property. Kudos to a very helpful staff.", "title": "Great Stay", "user": "lizameow", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163889566}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "- Arik Katzenberg", "title": "Beautiful hotel and Awesome pool", "helpfulness": 2, "user": "travln-beegees", "date": "June 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 163782186}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "This property is really nice, but very pricey. They use to give their Platinum Elite members vouchers for the continental breakfast but they WON\"T do this now and won't budge on their new policy. The breakfast bar with tax and tip is around $30.00 which is way over priced. There are not any great options for breakfast except Starbucks and a small cafe near the lobby area that is also way over priced - $13.00 for a breakfast sandwich. For the location, there are no quick food options except the JW Marriott and Ritz Carlton restaurants - so expect to spend time traveling off the property for meals or pay premiums at the hotel!", "title": "Grande Resort", "user": "Mike D", "date": "June 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163776889}, {"rating": 5.0, "title": "Great Anniversary Weekend", "text": "My husband and I spent our 28th wedding anniversary at the JW Marriott, and the hotel and the surrounding property is beautiful. Was most impressed by the employees. Everyone seemed eager to please and always spoke and smiled. They seem to really enjoy their jobs. Our rooms was beautiful with views of both the golf course and the lazy river area, along with a balcony. The weather cooperated somewhat and we were able to enjoy the lazy river. They seemed to have alot of activities for kids. I would definetly recommend for a special get away. We enjoyed a special anniversary dinner in Primo and was most impressed with the meal and the service. The location is not ideal if you are planning on enjoying the various theme parks. There are alot of hotels and resorts much closer. Sea World is the closest theme park. There was a big convention at the hotel, so the last night of our stay it was impossible to enjoy the lobby bar area. They big group had taken over!!! We will probably visit again in the summer time when you can really enjoy the pool area.", "helpfulness": 1, "user": "cmoye", "date": "February 15, 2005", "id": 3193403}, {"rating": 5.0, "stay_parameters": "Stayed February 2005", "text": "My wife and I spent the weekend at the JW Marriott for our 11th anniversary. The first remarkable thing that you notice about this resort is its sheer size in terms of property acreage...two hotels on the property (collectively referred to as Grande Lakes) including an 18 hole Greg Norman course. Upon arrival at valet parking in front of lobby we were immediately greeted and our bags were taken by a friendly and helpful bellhop \"Chris.\" The lobby is expansive, lots of marble, hard woods, fountains....specifically designed, it seems, to create an understated elegance and majesty. The property is relatively new, having been opened in 2003, and is immaculate. During check in we told the desk clerk that it was an anniversary weekend and she upgraded us to a 24th floor room, with balcony, in the center of the hotel overlooking the magnificent \"lazy river\" pool and manicured grounds, and the golf course. I can't imagine another hotel in Orlando that could have a better view. The room decor and size are excellent, but a bit less sophisticated than the Ritz-Carlton next door (which we stayed at last year for our tenth anniversary). We have three small children, whom we love of course, but really did not want to have alot of children running around on the property. While the resort bills itself as kid-friendly, it has nowhere near the child population density of the Disney and Universal resorts. If you want to eat breakfast on the property, definately pay an extra 20 per night to get breakfast for four at the Citron Cafe (two adults and two children under 12)...great deal, as the \"Le Grande\" buffet is 22 bucks a pop. Great resort for a romantic getaway...highly recommended.", "title": "Exquisite", "helpfulness": 6, "user": "Barry B", "date": "February 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3166362}, {"rating": 5.0, "title": "Loved JW Marriott!", "text": "Beautiful rooms and excellent service. The pool was wonderful and very warm. We had a family package and the kids had free game tokens, free ice cream, free pool toys and free drinks. We really enjoyed our stay and the hotel!", "helpfulness": 8, "user": "jinx075", "date": "January 30, 2005", "id": 3100465}, {"rating": 4.0, "stay_parameters": "Stayed January 2005", "text": "The JW Marriott is certainly a luxury resort-type hotel. It is beautiful, equipped with an open, elegant atmosphere. The marbled floors and pillars, the fountains, candles and bouquets of fresh flowers certainly make this hotel stand out from all the rest. Two factors which stand out most significantly for me are the lazy river pool area and the breakfast buffet at the Citron restaurant. The lazy river is a spectacular change from the routine hotel pool. Not only is it fully heated, it is lavishly landscaped and truly beautiful. My only disappointments were that it was rather difficult as a parent to keep an eye on or follow your child through the maze of water and that only once was someone available to give me a towel from the \"hut\" located in the pool area. Every other time either no one was working or there were no towels available. As for the breakfast buffet...it is something to behold! Everything imaginable is available from fresh fruit to quiche to oatmeal and everything in between. There are also two chefs on staff who cook up made-to-order omelettes and Belgian waffles. Happily this buffet was included with my room since the bill for two adults and two children came to $99.00! As for the room, it was classically decorated. The beds were comfortable with down bedding and many down pillows, however, for the price, I expected the room to be larger. The marble floored bathroom included a glass shower with separate tub, but it was probably half the size of the entire room. We did request a refrigerator and a small dorm-size one was brought in but the only area it could be placed was at the end of one of the beds, which made it stick out quite a bit and very awkward to get around. As for the staff, I found them to be top-notch--friendly and hardworking. All in all, I'm glad we experienced the JW Marriott, but do not feel the $250/night + parking is worth a return visit.", "title": "Truly Beautiful!", "helpfulness": 12, "user": "GooChick", "date": "January 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "service": 5.0}, "id": 2990753}, {"rating": 5.0, "title": "The Best", "text": "Stayed five times in 2004 and twice in 2005 already!", "helpfulness": 10, "user": "Paul_Ream_T2", "date": "January 8, 2005", "id": 2990082}, {"rating": 3.0, "title": "Beautiful Hotel - Weak Service", "text": "Lovely landscaping, design and decoration.", "user": "frequentrvlr", "date": "July 23, 2007", "id": 8223834}, {"rating": 5.0, "title": "Absolutely fabulous!", "text": "The service I would rate a 2 out of 5. But that can be hit or miss at any place, especially Orlando. Would highly reccommend this place to anyone who would not like to stay on the beaten path and anyone who desires luxury.", "user": "lillycat62", "date": "July 22, 2007", "id": 8217934}, {"rating": 5.0, "title": "Better than the Ritz!!!!", "text": "Have stayed here twice now for an extended weekend after business in Orlando was completed. And both experiences were absolutely top notch. The JW Marriott Grand Lakes and Ritz Carlton Grand Lakes share the same fabulous property with an absolutely fabulous spa complex w/ adult pool between the two that both guests have access too (w/ spa appt booking).", "user": "mike1999", "date": "July 21, 2007", "id": 8212002}, {"rating": 5.0, "title": "New Favorite Place", "text": "The hotel itself is gorgeous, restaurants are fabulous...never had a bad meal. The \"lazy river\" heated pool outside the JW was wonderful. I was here with my boyfriend and we're both in our early 40's and even WE couldn't resist spending the entire day renting tubes and meandering around that pool. The pool area was so huge, it was easy to find a secluded area away from other guests if you chose. The King room we reserved was a corner room and it was gigantic, very comfortable bed. Bedding was gorgeous, room was gorgeous, flat screen tv's . The bathroom was also gigantic......wonderful bath products. The staff was very accommodating and very sweet....I asked our maid if she would mind leaving additional bath products since there were 2 of us sharing them, and every day I would find 4 shampoos, conditioners, lotions, soaps....4 of each thing left for us...along with extra big, fluffy towels. She was a sweetheart....", "user": "nixmum64", "date": "July 19, 2007", "id": 8193368}, {"rating": 5.0, "title": "Fantastic! We'll be back!", "text": "We scheduled massages at the Ritz Carlton spa and they were fabulous. It was wonderful to retreat to the adult pool at the spa after our massages, if you are looking to get away from the children/families at the Lazy River pool. And the spa itself was top notch, expensive, but top notch so be prepared. I had scheduled a nail appt in the salon for a pink/white fill while I was there....very expensive and not up to par with my usual manicurist, (my manicurist was of course appalled....\"they charged you how much?? For this??? lol!! ) loved the pedicure though. One thing I didn't care for was the big push after your massage to sell you the products that were used in your massage. Don't comment to your masseuse that you like anything....because you will find a bag full of everything you mentioned at the front desk ready to ring up with your massage (they certainly aren't giving it to you for free...) I thought it might be a fluke the first time, (maybe I DID tell her I was interested? Didn't recall saying anything) and sure enough...on the 2nd stay, same thing. another bag waiting for me at checkout...... Be sure and ASK how much that bag costs before you squeel with excitement and say \"Yes!\"......do your credit card a favor and politely refuse.", "user": "LHF", "date": "July 19, 2007", "id": 8192941}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Celebrated my mom's 65th birthday! The front desk clerk upgraded us to a room with a balcony facing the pool and golf course! The room was great! Modern furniture, spacious bathroom with a shower and a tub, and bath robes hanging in the closet. The pool was even better. Great and relaxing lazy river. Purchased some inner tubes (wished they were complimentary). Beautiful landscaping. I would highly recommend this hotel.", "title": "So Relaxing", "helpfulness": 1, "user": "IamVero", "date": "June 19, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164548328}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "We stayed 3 nights here... Its a huge hotel, lots to do. You could spend a whole day at the hotel without having leave the hotel! U definitely need a car though, this place is tucked away so far that you need a 5 minute drive to go up the driveWay entrance! Parking is 18$/day, which is a bit expensive and quite a long walk from the self parking to the entrance.", "title": "Resort style hotel, huge grounds, lots to do!", "user": "Katkoota1", "date": "June 19, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 164480411}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Cleaning was good, most staff are really nice too. Wish there was internet in the rooms free. The free internet in the lobby and pool isnt even a strong signal and gets super choppy.", "title": "Love this Resort", "helpfulness": 1, "user": "Michelle Anne", "date": "June 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164275244}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "The only thing that ruined my stay was the breakfast buffet. I called the front desk and asked what time breakast ended and i was told 11:30. We got to the breakfast the next morning at 10:40 am and the man at the entrance said it was too late and try stop accepting people at 10:45 because they start removing the food to prep for lunch. So we were turned down and ended up leaving the hotel to go eat at a restaurant . The next day we showed up at 10:00 am and talked to the woman at the door because she said there was going to be a wait before we got seated.... We asked her if we'd make it in before 10:45 when they stop accepting people.... She was really confused... She said they never stop accepting people until 11:30 am which is when breakfast ends..... Soo basicalyy the guy from", "title": "Best lazy river in town, gorgeous lobby & grounds, exceptional employees", "helpfulness": 3, "user": "GoThere88", "date": "June 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 164109697}, {"rating": 2.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The previous morning just brushed us off.... I was really ticked off to find out that he brushed us off the day before because we were inconvenienced to leave the hotel to go eat elsewhere.", "title": "Stolen from Room", "helpfulness": 3, "user": "MTB2222", "date": "June 15, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 1.0, "service": 2.0}, "id": 164098924}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 47, "average": 104, "very good": 372, "terrible": 33, "excellent": 863}, "aka": "Jw Marriott Orlando Grande Lakes Hotel Orlando", "slim_ranking": 0.09726443769, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}}