{"user_rating": 4.5, "review_count": 1166, "name": "JW Marriott Desert Ridge Resort & Spa Phoenix", "reviews": [{"rating": 5.0, "title": "Loved every minute", "text": "Just returned from 4 nights & wished that I would have scheduled my entire 10 day vacation here.", "helpfulness": 3, "user": "amz", "date": "April 10, 2005", "id": 3348116}, {"rating": 5.0, "title": "Beautiful and Relaxing", "text": "In general the staff went above & beyond to provide excellent service. The only exception was the staff at the concierage desk. They seemed too busy taking phone calls to deal with those of us who were standing in line,in person. This same problem occurred consistently each time I tried to use their services.", "user": "A TripAdvisor user", "date": "April 9, 2005", "id": 3345697}, {"rating": 3.0, "title": "Okay hotel for a meeting", "text": "Rooms were exceptionally clean; turn down service always provided.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 26, 2005", "id": 3303111}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Food was great with very fast delivery to the pool areas. Food prices were typical of resorts. The fire pits were great for early morning coffee & late night drinks.", "title": "Stunning hotel, great service.", "helpfulness": 1, "user": "Jannel43", "date": "March 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "service": 5.0}, "id": 3300727}, {"rating": 4.0, "stay_parameters": "Stayed March 2005", "text": "Poolside - One nice touch was the availabliltiy of better quality towels than generally found poolside. Another was the free rafts to use in the pools.", "title": "Quite a place but off the beaten track", "helpfulness": 6, "user": "wirepaladin08", "date": "March 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3273391}, {"rating": 4.0, "title": "5 star... I don't think so.", "text": "If your a true user of 5 star Luxury Resorts such as Four Seasons and Ritz Carltons, then you'll be disappointed in this one.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 22, 2004", "id": 2840856}, {"rating": 5.0, "title": "Fabulously Relaxing Retreat.", "text": "Just got back from this resort (Nov. 2004) and booked it because of the reviews on line, but very disappointed all around.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "November 18, 2004", "id": 2833590}, {"rating": 5.0, "title": "A great resort", "text": "Rooms are average and the bathroom after reading the reviews was very disappointing. Only one sink and not very large at that. Eventhough there is a sperate shower stall, it was so on top of the toilet that when you opened the shower door you just miss the toilet by about 2 inches.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 12, 2004", "id": 2699125}, {"rating": 4.0, "title": "Great two day stay", "text": "One day I had the call front desk to get my room cleaned. This was after 2:00 pm the day after I checked in. I was told they were busy because a lot of guest checked out and new ones were arriving and they needed to turn over the rooms. So I quess that means I was put on the back burner since I was already checked in. Staff were ok, but not 5 star helpful or even 5 star friendly.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "October 11, 2004", "id": 2695859}, {"rating": 5.0, "title": "Never leave the hotel!", "text": "Beware major conventioneers at this hotel. In fact the week I was there the hotel was 95% booked and probably 80% of quest were there on conventions. They litterly take over the hotel. One night the only lobby lounge in the hotel was taken over by these conventioneers and there was no place to sit and have a quite drink. Also a hugh TV screen was brought in so all the \"men\" could watch Monday night football, for which they proceeded to behave as typical male's would during a football game. I think you know what I mean. Another evening most of the pool area and hot tub section was closed off for a private convention dinner party.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "October 10, 2004", "id": 2694132}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "We have just returned from a weekend at the Desert Ridge. The hotel is magnificent and the service matched it. Although we do not play golf, we found plenty to do on the vast property. Although it is extremely large, it was not hard to find a peaceful spot.", "title": "Lovely Property with Great Service", "helpfulness": 3, "user": "thedcdiva", "date": "March 13, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 7154527, "likes": {"liked": "— Even the standard room felt luxurious", "disliked": "— Resort is enourmous, so you need to be prepared for a lot of walking."}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "We stayed in a standard room overlooking the main pool and patio. There was constant activity on the patio, but it was never noisy or bothersome. The rooms were spacious, well appointed and just plain pretty. All have a balcony, and a bath with a seperate tub and shower.", "title": "Very nice resort - great golf course", "helpfulness": 4, "user": "md814", "date": "March 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6906495, "likes": {"liked": "— Golf, spa, great pool!!!! Beautiful architecture outside in pool area and lounge chairs by bar.", "disliked": "— Long walk to our room from lobby area."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "The pool is really a pool complex, with several different pools and hot tub. Although the hotel was fully booked, the pool never really seemed crowded.", "title": "Great hotel and great service", "helpfulness": 4, "user": "SFO2004", "date": "February 1, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6726265, "likes": {"liked": "— Nice rooms and great service", "disliked": "— Very large hotel that caters to conferences"}}, {"rating": 5.0, "title": "Marriott Desert Ridge/Phoenix trip", "text": "The Spa is enourmous and seemed extremely busy, but that did not take away from the experience in any way. The treatments, were expensive but wonderfully relaxing.", "helpfulness": 7, "user": "PennStater84", "date": "January 30, 2007", "id": 6717681}, {"rating": 5.0, "title": "Great Resort", "text": "The restaurants we tried were quite good. We ate most often at Blue Sage, which had a great breakfast menu including a impressive looking buffet that we did not get around to trying. We also tried the Meritage Steak house which offered wonderful food and ambiance, but at a steep price. But for dinner, we usually ventured out to nearby Scottsdale.", "helpfulness": 1, "user": "JALDenver", "date": "January 24, 2007", "id": 6654779}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "If, like me, one of your hobbies is luxury hotels, you might like to see this one. The grounds and the public areas are georgeous. So many palm trees! We were there during the great weather in March, and the huge hotel lobby was open to the outside pool area, making it feel very spacious and inviting. You can sit around fire pits, near the pool, in the lobby, or back by the golf course. A great hotel for hanging out, and at these high spring prices, you want to and get your money's worth. The \"lazy river\" is perfect for kids. The spa is beautiful, and you can spend hours there just relaxing. Just across a street is an upscale shopping center with many restaurants and a grocery store, so it is great for families. The only thing I would not rave about are the rooms - the bathrooms are wonderful, but the rooms themselves are slightly above standard Marriott. But most have incredible views! I have stayed at many nice hotels and this is one of the most pleasant for just spending time.", "title": "hang out in this beautiful hotel", "helpfulness": 7, "user": "longtimeresident", "date": "March 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4738914}, {"rating": 4.0, "stay_parameters": "Stayed March 2006, traveled on business", "text": "My husband & I spent 3 nights at his hotel for a business conference he was attending. The hotel is huge and very beautiful! The staff was very attentive although on the second day we did tell the front desk that our coffee maker wasn't working and also that we would like non-down pillows. Neither problem was ever taken care of to our satisfaction. Our room was clean and spacious - the bathroom was enormous! Had lunch one day at the poolside restaurant. Good casual food, reasonably priced. The spa was overpriced for what you got. We each booked massages. My husband was satisfied with his but I don't think I got the quality of massage that I've experienced elsewhere. There's a shuttle bus to take you to the resort condos or across the road to a nice shopping mall. Also a shuttle to take you to the airport. (Not one that you can take from the airport to the hotel, though.) Otherwise you need a car to get anywhere. Taxis turned out to be very expensive. Did not get to try out the lazy river or any of the pools since Phoenix was having unusually cold weather at the time. Overall we would definitely stay there again!", "title": "Beautiful Resort Hotel", "helpfulness": 6, "user": "HockeyMomNJ", "date": "March 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4734398}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "My husband & I went to the resort for a 4 day long weekend getaway. We took our 3.5 year old son with us and had a great time. The hotel lobby was beautiful and our room was nice, a little small but not a big deal for us because we were hardly in it. The beds were super comfortable! The hotel grounds & landscaping were beautiful and the pools were nice and heated. The location of the hotel was great. Directly across the street there were plenty of restaurants and shopping. Also, a movie theater. The restaurants at the hotel seemed high in price, again not a big deal to us because we dined at the local restaurants across the street. The hotel offers a child day camp (kokopelli) for ages 4 to 12. We were planning to let our son go for a half day but when we arrived, only 2 older kids were there and we found out that all the kids hang out together in one area. They dont have age specific activities. This may not be a big deal to some families, but my husband and I felt uncomfortable since there were no kids his age and we didnt let him stay. For the most part the staff were friendly, although we did find some of the staff to be rude & we did have one negative encounter with a valet attendant. Overall our stay was very nice and we would come back again.", "title": "Very Nice Hotel", "helpfulness": 8, "user": "luvs2travel69", "date": "March 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4627913}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "I don't know when I've ever been this impressed with a hotel/resort. I now have a new gold standard for service. I can't say enough about the pristine facility, the attentive and knowledgeable staff or the quality of offerings. This is a beautiful resort - huge and well-kept with gorgeous grounds, several swimming pool areas and (according to my husband) two top-drawer golf courses. Our room was lovely although nothing outside a standard Marriott or Renaissance room, but the bathroom was stellar - big and well-appointed. Our room was in a back wing, facing the spa building and was extremely quiet and peaceful with the added bonus of great sunset views! Every staff member we came in contact with was very courteous and every one of our questions was answered without hesitation. I've never been treated so well.", "title": "Wow!!", "helpfulness": 8, "user": "Cynergy", "date": "March 15, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4623653}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "And I must say a word about the on-site restaurants, at least the three I experienced. Breakfast at Blue Sage was surprisingly good (go for a Mexican breakfast entree - delicious!), lunch at Meritage Steakhouse (on the patio) was delightful and dinner at Roy's was exceptional. This Roy's far surpassed the one on Maui, expecially the ambiance and service, which was enthusiastic and detailed. And I love having Starbucks at my disposal - in the morning and in the evening. And we were surprised at the reasonable dining prices, especially after just being in Las Vegas (where prices are outlandish).", "title": "Great Service!", "helpfulness": 12, "user": "amlamay", "date": "February 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 5.0}, "id": 4468286}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "Took advertised package for jazz concert for $269 for one night. Ended up costing way more. The room with \"resort fees\"; \"parking fees\"; taxes was $335.69. However, supposedly in the package was a Sunday brunch. Well, besides the $335.69, I received a charge for $51.55 for tip and taxes added to my $335.69 room charge. Amazingly, the brunch was VERY disappointing, and the service terrible. No way, would I pay that kind of money for that kind of service and food--especially when it was supposedly \"included\" in the package. Sent email to the manager, and got \"template\" response of how competitive they are. I will never return to this location--way too busy (waited in lines for everything), and terribly expensive. I feel swindled by all the hidden charges.", "title": "Overinflated surprise charges", "helpfulness": 3, "user": "ashtonnewmexico", "date": "May 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 30259092}, {"rating": 3.0, "stay_parameters": "Stayed May 2009", "text": "Went to JW from May 7-12 with a mother daughter trip, the lazy river is the best thing about this hotel. The hallways to the rooms and I think the rooms are dated. There were peanut shells in the hallway that were never vacuumed up and sat there for days. The fitness area that is free is ok, machines are dated. I sid check out the spa fitness and that is very nice. Something that the hotel forgets to tell you is that you can use the spa fitness center which has state of the art equipmen for free but never told me that until I had a question about the internet two days later. I will probably not be staying there again, the rooms need revamped, it is a big hotel. The service was good at the pool and at the outside bar.", "title": "BEST THING IS THE LAZY RIVER", "user": "rockstar321", "date": "May 18, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 30257238}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "What can I say about this decadent, four star, oasis in the desert? Worth every cent. It almost seems like a small city unto itself - various shops, restaurants and loads to look at right on the first floor. Service was outstanding. View from the room was wonderful. Only complaint - for such a costly hotel, they DEFINITELY need to invest on high quality sofa beds - even a roll-away would have been better than the rack that was provided.", "title": "Excellent!", "user": "Samson1Nj", "date": "May 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29827308}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "After I booked my trip, I emailed that hotel to confirm my reservation. I received a response email from the resort manager, Bradley Colton, who wrote that my reservation was confirmed and that he would be sure to notify the front desk that they should hold my room (I was arriving at night). After a long flight from NY and a half hour ride from the airport, they had no room for me, which was upsetting. After the desk clerks were working on the computer trying to find a room for me they put me on the ground floor in a room for a disabled person. I was not pleased with the room, especially considering the high price I was paying. I asked to be moved, which they did at no delay, to a room on the fourth floor with a lousy view.", "title": "Surprised that they had no record of my reservation", "user": "susmug", "date": "May 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 29725801}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "The rest of the trip was quite nice as it is a beautiful and peacful resort. It is necessary to have a car if you want to explore the city, although there is a bus line that stops in front of the resort. The buses there are pretty good, if you are not in a rush to get anywhere. But they stop running at about 9:30 at night. RENT THE CAR AT THE AIRPORT. The Hertz rental car place at the resort STINKS- long wait of 2 days for a car.", "title": "LOvely Hotel...Simply lovely", "user": "aniruddhmehta", "date": "May 10, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 29702177, "likes": {"liked": "— Huge and comfortable beds", "disliked": "— Very little luggage area"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Stayed for almost a week in April. If you have small kids-DO NOT STAY", "title": "The Godd, The Bad & The Ugly", "helpfulness": 10, "user": "stad", "date": "April 11, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 7332416, "likes": {"liked": "— Scenery, Easter Egg Hunt Activities, Non-denomination Easter Mass", "disliked": "— Poor trained staff who don't know common sense from the hole in their backside."}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "AT THIS PROPERTY! Page down to the Bad & Ugly for more details.", "title": "Can't Handle the Crowds", "helpfulness": 6, "user": "Rouget", "date": "April 8, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 7293297, "likes": {"liked": "— Nice botanical garden, decent spa, good tennis", "disliked": "— Terrible food service"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The Good: beautiful landcape scenery, outdoor speakers w/ soothing music playing everywhere, tranquil water features, attractively designed rooms/suites, complimentary laundry facility. Tuscany Restaurant and great live music( 2 guys in their 40's)Complimentary mountain bikes. Allison at Tennis Center is a gem! Fitzroy, and red hair German waitress at Blue Sage are super nice as well. Lots of pools.", "title": "Marvelous Marriot", "helpfulness": 3, "user": "cinder1997", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7286502, "likes": {"liked": "— The pool area.", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The Bad: Black mold & mildew in every corner and grout line of the adjoining room's shower. Filthy bathroom floor covered in hairs upon checkin. Housekeeping overall was lax for such a $$$resort.", "title": "Terrific resort", "helpfulness": 5, "user": "cgbroderick", "date": "April 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 7280766, "likes": {"liked": "— The resort amenities, especially the pool complex", "disliked": "— cost"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Stopped into the \"Revive Spa\" the 1st day to make an appt. for a $125.00 skin scrub for next morning. Made the mistake of taking one of my kids w/ me to make the appt. All of a sudden a man was standing", "title": "Top Shelf", "helpfulness": 5, "user": "mevangelista", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 7277662, "likes": {"liked": "— Service", "disliked": "— Location"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "My wife and I just spent two nights here for a short getaway to warm weather. My wife works for Marriott, and I stay in hotels over 150 nights a year, so we both have a good basis for comparing hotels to each other. First of all, the resort is beautiful. The gardens are immaculate and go beyond just being pretty. There is just something about a stylish building (that's only 6 stories tall) surrounded by ponds, fountains, pools, lawns, flowers, golf courses, and LOTS of palm trees. You could easily mistake this for a Hawaiian island setting.", "title": "Beautiful, but pricey", "helpfulness": 14, "user": "pmschneidau", "date": "February 14, 2006", "detail_rating": {"value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4459622}, {"rating": 1.0, "title": "Horrible!!", "text": "Our room was above average, overall. It was pretty big, with a large bathroom and bright walls, it was very clean, and there is a hint of some kind of flower perfume that is pleasant when you walk in. I was surprised that for $500 a night, though, that guests still have to pay $10 daily if they want internet access. You can stay at Courtyard by Marriott for under $100 w/ free internet.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "February 11, 2006", "id": 4453628}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The pools were very warm at 86 degrees, and the Lazy River was nice and relaxing. There seems to be lots and lots of space for guests at the pools - hundreds of lounge chairs.", "title": "Best Hotel in Scottsdale", "helpfulness": 13, "user": "stonemanmb", "date": "February 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4408048}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "The fitness center is great - all new equipment, including cardio w/ individual televisions, free weights, and machines.", "title": "Loved this hotel!", "helpfulness": 6, "user": "flygirla", "date": "January 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4372058}, {"rating": 5.0, "title": "Loved It", "text": "All of the hotel staff was very professional and pleasant.", "helpfulness": 9, "user": "hazlejo", "date": "January 23, 2006", "id": 4370771}, {"rating": 5.0, "stay_parameters": "Stayed March 2005", "text": "My husband and I stayed here in early March for a long weekend and thoroughly enjoyed every part of the hotel. We stayed in the Club Cloud which is definitely worth the money! Free breakfast (and we're not talking muffins and bagels,) free wine and cheese and dessert every evening. Also, open bar from 4-10pm. Very nice and relaxing. The staff was great and had wonderful recommendations for what to do, where to go, and where to eat. Elizabeth was very helpful and always made a point of remembering our name and asking us about our day even though she was busy helping other people. Everything was great.", "title": "Great!", "helpfulness": 1, "user": "travelerof3", "date": "March 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3271361}, {"rating": 4.0, "title": "Paradise", "text": "The only complaint I had was the bed. It was hard as a rock. I woke up with a back ache every morning. If they could have put the Westin Heavenly Bed in here, it would have been perfect. Everything else about the room was great. The bathroom was huge and the ammenities were good.", "helpfulness": 3, "user": "montebello", "date": "February 22, 2005", "id": 3216628}, {"rating": 3.0, "title": "Nice hotel for business travel", "text": "The spa was very relaxing. They treated you like a queen or king. We made our reservation a week before going since we had read on here that some people had a hard time getting a reservation at the last minute. The spa bistro had great food and everything was very relaxing.", "helpfulness": 1, "user": "debbie35", "date": "December 27, 2004", "id": 2945696}, {"rating": 5.0, "title": "Fabulous experience", "text": "This place is definitely worth the money. We can't wait to go back!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "December 1, 2004", "id": 2858076}, {"rating": 5.0, "title": "Beautiful large hotel", "text": "Spent 3 nights in early Feb 2005 and thoroughly enjoyed this property. We had a suite with a murphy bed and it was great . staff did all they could to please and food was also good. Played both golf courses with much enjoyment. Definitely will return again in April with our 10 year old daughter who will enjoy the fabulous pools.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "November 30, 2004", "id": 2856677}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "First of all valet park if you dont want to walk a mile(or it seemed like it) from your self parking lot..Hotel is HUGE, be prepared to walk alot in general. Staff not overly helpful. Lazy River closed at 7pm and didnt open until 11 am, so we really didnt get much use of it with the 4 oclock check in and noon check out..plan to spend at least two days if you want to enjoy the pools! Room was nice, I had asked to be upgraded to a suite, thinking we would have a bedroom, with living room area..what we got was one very large room, with two balconies, although it was very nice with nice views, we would of preferred the bedroom/living room set up better. Plus the sofa was not a sleeper, so the kids had to camp out on the floor(we didnt realize that it wasnt a sofa sleeper, until we had already settled in, and didnt feel like moving). The best thing about the hotel was its beautiful grounds.Overall, I would probably not stay here at this property again.", "title": "Not overly impressed", "helpfulness": 1, "user": "butterflyy2000", "date": "June 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 31340958}, {"rating": 2.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "It is a beautiful property- no arguments there. When we checked in the host told us in order for a king size bed we would have \"no scenic view\".. It was 11pm and we were tired- so we agreed. That was our mistake! The room was very nice but when we opened the window- it was literally a brick wall. I could not believe we were paying $275 a night and not an ounce of sunshine in the room.We were there for a conference that started early the next morning so we went to bed and thought we would deal with it the next day. When we did they said they could move us the next day. By then we were settled and did not want to re-pack and move rooms. We had a tight schedule and we were exhausted from having a house fire the week before our meeting. When we checked out we requested a review and some consideration on our room charge. We felt like we were getting a lesser value than all other rooms in the hotel. They refused to discount us- quite frankly we would have been happy with any compensation but for the fact that we were already on a \"group rate\" they would not even consider. I called the hotel months later just to let them know how I felt as a customer and I could not get an answer or a call back from the manager. There are so many fabulous places to stay in Phoenix and we go to Phoenix at least once a year sometimes twice. I will never stay at this place again and I am bitter about the treatment. I will stay elsewhere and drive over for the conference.", "title": "Will never stay at this property again", "helpfulness": 3, "user": "SpaGirlDallas", "date": "May 28, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 31023480}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed at the Desert Ridge resort for two days at the end of our vacation. It is a beautiful large resort with all the amenities. We were given a very quiet room, although it overlooked an acre of roof. The room, bath, cleanliness was all very good. We spent one afternoon at the outdoor pool area. It was what we expected - lots of noise and young families. I had one little boy cannonball me while his mother watched and said nothing. They had the entire pool but chose to douse the few adults talking. The resort planned this area well because all the water falls really drown out a lot of the worst noise. That evening we dined at Ristorante Tuscany and it was by far the finest meal of the week including our excellent service. It was a very expensive dinner but I would highly recommend this restaurant.", "title": "If you like Disneyland come to this spa!", "helpfulness": 2, "user": "TheBusIsLeaving", "date": "May 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 2.0, "service": 3.0, "rooms": 3.0}, "id": 30966869}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "The next day we planned to spend the entire day at the spa pool and then have a massage in the afternoon. This is a beautiful spa and we were very impressed when we first arrived. That soon changed. In spite of many signs placed in the spa and outside at the pool stating no cell phone use, no smoking, etc. people were just coming to the spa to make their cell phone calls at the outdoor tables. Women were chatting on their cell phones in the locker room, and people were loudly conducting business all around the pool. One young women was on her phone the entire afternoon. The spa is also nonsmoking yet one young man found a lounge chair outside the locker room and smoked away. You could smell it in the pool area. The final straw was a young mother and grandmother rolling in her baby with stroller, etc. to camp out at one end of the pool. The spa states that it is for adults and children over 16. Another young mother not using the spa brought her 6 year old son to the outdoor spa cafe so she could talk on her cell and let him run around. Why have rules if they mean nothing? This is not an adult spa and it was not relaxing. The waiters will not say anything for fear of losing tips. We changed our plans for massages knowing that tranquility is not a priority here.", "title": "A step into tropical paradise!!!!!", "user": "hazother1", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30597174}, {"rating": 2.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "The next morning were were charged an extra resort fee for each day even though we were on a package and did not use the internet or parking. They said they had taken it off only to find they had not when we returned home. Nothing earth shattering, but nevertheless an annoyance that takes time to correct.", "title": "The third time is NOT a charm!", "helpfulness": 2, "user": "birthdaygirl925", "date": "May 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 30497360}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Stayed for 5 days while attending a conference. It is a beautiful resort with great dining. Our room was huge and beautifully decorated. They staff was very accommodating. Marriott consistently delivers.", "title": "Beautiful resort", "helpfulness": 1, "user": "cjjjbugs", "date": "January 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6649720, "likes": {"liked": "— Beautiful layout and decor", "disliked": "— would be nice to have free high speed internet in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "This Resort was as close to perfect as you will find. From the sweeping palm tree lined entrance to the beautiful golf courses. The rooms were large, clean and quiet with excellent views. The pool areas are beautiful with large hot tubs and plenty of space to enjoy your privacy, the water was warm and clean. My husband golfed the Faldo course and had a great experience. We didn't have the opportunity to eat at the Resort, but did take advantage of the nearby restaurants. There is also great shooping nearby. We loved this resort and can't wait to return.", "title": "A Great Escape", "helpfulness": 3, "user": "flyover11", "date": "January 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6534438, "likes": {"liked": "— Location, location, location", "disliked": "— it was all perfect"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled on business", "text": "This resort is amazing. It is huge, new, clean and pretty lavish. Every person on staff was very friendly and helpful. My room was kept clean for me not only every morning but also for turn down service. I had a room overlooking the front of the hotel - very nice view of the palm trees out front and the mountains in the distance. The sunsets were beautiful from the balcony. The pool area is immense! Something for everyone from a lazy river to small pools to large pool to a 15 person hot tub. Everywhere was running, bubbling, gurgling water. Very beautiful and relaxing. I fell asleep in my lounge chair after an hour of swimming! I had the pleasure of eating at both Roy's and Blue Sage restaurants on the property. Definitely not cheap but very delicious. We also ate at Splash, a little cafe style place right in the middle of the pools offering just burgers, sandwiches, etc. I paid about $11 for an Angus burger and fries but it beat leaving the pools in the middle of the day. I never did find two other restaurants... this place is huge! You can also take a free shuttle to the nearby strip malls (very nice) to do some shopping and eating. I hated to leave and hope I can make it back again as I never made it to the mountains, which I really wanted to do. But it was just so hard to leave the pools!", "title": "Amazing resort and staff!", "helpfulness": 6, "user": "visitingrob", "date": "November 23, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6169062, "likes": {"liked": "— Terrific pool area and restaurants.", "disliked": "— Little night life, for the nights you want it."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My husband and I stayed at this resort for 3 nights, Oct 8-10. The staff at this place were really great. Very kind and attentive and willing to do whatever it took to make our stay enjoyable. There was a woman who was checking in when we were checking in and it turned out she was at the wrong JW in Phoenix, so the front desk attendant arranged to have one of the resort's town cars take her to the correct hotel so she didn't have to pay for yet another taxi. That's what I call great service!", "title": "Great Service, Okay Resort", "helpfulness": 7, "user": "kls_katidid", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 6032694, "likes": {"liked": "— Staff/service; location (very safe)", "disliked": "— Bugs in pool, massage at spa"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We picked this hotel for three reasons: 1 - lazy river/pool complex; 2 - spa (for me); 3 - golf (for hubby). If we were attending a conference, I might have given this resort a higher rating, but as a leisure hotel, it is only okay (especially given the high price).", "title": "Love the JW Marriott", "helpfulness": 4, "user": "ladybug5", "date": "October 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 6023175, "likes": {"liked": "— the room, service and lazy river", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I booked two nights at the JW Marriott Desert Ridge as a little getaway for my wife and I. They had some really good summer specials for us locals (we live only five miles away, if that), so I decided to take advantage of a couple and see what this resort was like. We had never stayed there before.", "title": "Outstanding Hotel ... Fabulous Amenities ... Great Service", "helpfulness": 1, "user": "ccollman", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37434949}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "The first night, we got a local rate of $111 for the night. The arrival, valet and check-in process was smooth and everyone greeted us and made us feel welcomed. The room was spacious with a king bed, big couch, desk, flat-screen TV, balcony and a huge bathroom with separate soaking tub and shower. The bed was very comfortable and the linens were top of the line. We spent most of the day relaxing in the room or walking around the resort holding hands. It was great!", "title": "Beautiful resort - top notch except for restaurant/bar service", "helpfulness": 1, "user": "misha62", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 37263205}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "For dinner, we ate at Roy's, one of the restaurants at the hotel. It serves Roy Yamaguchi's renowned Hawaiian Fusion Cuisine in a festive, island-style atmosphere. The food was great and the service even better.", "title": "Beautiful hotel..should have better restaurant service..", "helpfulness": 1, "user": "coastal4", "date": "August 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 5.0}, "id": 36614800}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The second night, we did the \"Buy two massages and get your hotel night free\" deal ... the two massages were only $175 total and they were great! The Revive Spa truly lives up to the hype and advertising ... it is luxurious, well-appointed, soothing, clean and the service is outstanding. My wife and I got a couple of great massages and spent most of the day at the spa, swimming in the pool, eating at the spa cafe and taking advantage of the amenities.", "title": "Exceeded Expectations", "helpfulness": 3, "user": "suzyav8trix", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35983335}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "For dinner, we just decided to sit outside at the Vista Lounge, had a couple of drinks and ordered some sushi rolls. They were really good!", "title": "Finest Resort!", "helpfulness": 1, "user": "Toyia", "date": "July 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35612985}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "My husband and I visited this hotel in early April for a weekend getaway for some sunshine. Our main purpose was to relax, and this hotel was perfect for that. We spent two days lounging by the pools, enjoying the lazy river (fun even for adults!) and the excellent pool-side drink and lunch service.", "title": "Impressed with the Desert Ridge", "helpfulness": 5, "user": "AllieBrookie", "date": "April 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4983451}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We ate dinner at the resort two nights -- one night at Roy's and one night at the Meritage Steakhouse. Roy's was excellent and we'd highly recommend it, but we do not recommend the steakhouse. Service there was terrible and the steaks weren't that great either -- especially for the high prices. We loved the Starbucks that was on-site. It was so wonderful to have a leisurely morning, sipping our Starbucks on the store's patio and enjoying the beautiful desert botanical gardens.", "title": "Overpriced small rooms but beautiful hotel resort.", "helpfulness": 18, "user": "pwrshift", "date": "April 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 4971719}, {"rating": 5.0, "title": "Fabulous place for family trip on Spring break", "text": "We found the hotel rooms to be of decent size. The bedding was wonderful and bathrooms were nice. Everything felt very new and was very clean.", "helpfulness": 13, "user": "schnoodlelover", "date": "April 3, 2006", "id": 4832094}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We wouldn't hesitate to return to this hotel again!", "title": "The nicest Starbucks we've ever visited", "helpfulness": 13, "user": "NoRoadWarrior", "date": "April 1, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4826733}, {"rating": 5.0, "title": "DO YOURSELF A FAVOR", "text": "Stayed for two nights April 7&8, 2006. The room was about the same size (12’w x 16’) as a Holiday Inn but the rate was $450 a night. Nicely furnished with the Revive bedding but 3 uncomfortably narrow chairs. There was no place to put anything in the double room and we were tripping over each other. Even the coffee maker was hidden away in the closet. The desk had an experimental computer on it you could use for $10 a day, so that took up even more room. Even the tub was tiny, but the separate shower was OK.", "helpfulness": 6, "user": "mikedoylestown", "date": "March 30, 2006", "id": 4823236}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "We just returned from 6 days at theJW Marriott Desert Ridge. What a great experience from beginning to end. I had used this site to conclude that this hotel must be pretty special, but must admit to being even more impressed on every level. It was not only one of the most beautiful hotels we have encountered, but also one of the most \"user friendly\". Huge public spaces to enjoy on every part of the outdoor and indoor areas. Groups are welcome to use grassy areas for play or simply sitting. There are also a wealth of chairs, chaises and tables in and just outside of every lobby. Family groups as well as conference groups congragated with ease.", "title": "What a Great Hotel!!", "helpfulness": 6, "user": "lswg", "date": "April 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3428233}, {"rating": 5.0, "title": "Absolutely Fabulous Resort", "text": "The staff was delightfully friendly and helpful. The pools beautiful!", "helpfulness": 4, "user": "marciakf1", "date": "April 26, 2005", "id": 3415704}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "In response to some of the earlier posts, we found the area in which the hotel is situated to be most convenient. The Desert Ridge Market Place, right across the street is beautiful and its not a bad thing to have 15 extra restaurants so close by. We also found the Northern location to be a big help to cutting down on traffic when taking day trips to Sedona and the Grand Canyon.", "title": "Outstanding Resort", "helpfulness": 5, "user": "thsloppy", "date": "April 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3394038}, {"rating": 5.0, "title": "Great resort", "text": "Am writing this review on last night of a seven night stay at this resort. Rooms are wonderful, housekeeping services wonderful, restaurants ( dined at all four) excellent especially Roy's. All employees were especiallygratious. Golf courses were great. Only other resort I have stayed at in past five years better than this was Four Seasons Punta Mita Mexico. Excellent shopping within 10 minutes. Can't say enough good about Desert Ridge!!!", "helpfulness": 1, "user": "BESnow", "date": "April 18, 2005", "id": 3374539}, {"rating": 5.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "I've been very underwhelmed by other Marriott Resorts I've stayed in over the last few years ... but not here!!!. This is a fabulous resort in every manner. I'll break it down:", "title": "Excellent Resort", "helpfulness": 7, "user": "MisstheDogs", "date": "April 13, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3356518}, {"rating": 4.0, "stay_parameters": "Stayed December 2005", "text": "We just stayed at the Desert Ridge from 12/27 to 1/01.", "title": "Mixed feelings", "helpfulness": 12, "user": "bdouty", "date": "January 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 4321620}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We had picked it over the Biltmore based on reviews here. It met but did not exceed our expectations. Big hotel, nice facilities but starting to show wear after only three years. Pretty crowded and noisy (Fiesta Bowl attendees) - good for families but not for couples who want a romantic getaway. Rooms nice but nothing special - beds could be improved. Service above average overall, especially in Cloud Club (but you're paying extra so it should be better). My husband is a serious golfer and gives good marks to both courses. But as a first time visitor to Phoenix, I must say I don't know what the attraction is other than the weather. Wasn't overly impressed by anything I saw there. Took a day trip to Sedona - that was impressive, especially views at Enchantment resort(and that gets spotty reviews). Tuscany restaurant meal very enjoyable, but at the Meritage steakhouse they were just about throwing the food at us. And I just wish people would learn to dress in something other than jeans in nicer resort restaurants. Nice break from Minneapolis weather, but I don't know if I'd return. My husband will, but year-round golf is the attraction for him.", "title": "wonderful stay JW Desert Ridge", "helpfulness": 15, "user": "cheesecake92", "date": "December 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4219827}, {"rating": 4.0, "stay_parameters": "Stayed November 2005", "text": "We recently stayed with our family for Thanksgiving weekend at the JW Desert Ridge. We had a total of 3 rooms and chose to stay at the Cloud Club level, Executive Suite rooms. Glad we made that choice - the rooms were very comfortable, large & roomy, beautiful view of the mountains beyond, well maintained and housekeeping did a very good job.", "title": "Had Great Experience Very Happy", "helpfulness": 18, "user": "WillieC", "date": "November 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 4136246}, {"rating": 2.0, "title": "Terrible service for wheel charis, really desapointed", "text": "The Cloud Club level was excellent. They could not do enough for us and the Cloud Club level facility was the best! Breakfast was great - they offered something for everyone and if we did not see what we wanted - all we had to do was to ask and they accomodated us. Light tastings and drinks were available later in the day and coffee & dessert in the evenings. It worked out just perfectly for our family. The staff at the Cloud Club level was outstanding - Ken, Sharon, Laura -& everyone else were unbelievably friendly.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "November 21, 2005", "id": 4131493}, {"rating": 5.0, "title": "Loved it!", "text": "The hotel has amazing pools and the grounds are beautiful and very well kept. The lazy river pool is great fun as is the water slide.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "November 15, 2005", "id": 4119309}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "First off let me say that July in Phoenix is very hot. It was 115 degrees during our visit. When we arrived with our rental car we parked under the entry canopy. The valet insisted on taking our keys while we went inside to check in. Check in was very slow since there were only three associates behind the counter. When it was our turn about 15 minutes later we were taken care of promptly. The associate did not mention the resort fees (they cover high speed internet, fitness facilty etc) of $25 per day. When I checked my account on the hotel channel I saw the fee and asked that it be removed. When I checked out I realized they only took the fee off for my first day. The mistake was corrected.", "title": "Exceeded My Expectations", "helpfulness": 5, "user": "TNgal", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 35513331}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We went back out to retrieve our keys and inquire about parking. We expected that we would have to pay $10 per day but we were not charged. Self parking was quite a distance away but as we were unloading the car a golf cart pulled up and whisked us up to the hotel ballroom so we could check in for our conference. He literally pulled us right up to the door.", "title": "Great Customer Service!", "user": "SoBeGirlNewJersey", "date": "July 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34386426}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "I did not book our rooms under our event's group rate. I was able to find a cheaper rate through AAA. Their rate also guaranteed us a view of the pool. We received an email from the hotel concierge asking for any other special requests...and all of them were met. Great view, high floor, extra pillows etc.", "title": "Fantastic Resort - You Won't Be Disappointed", "helpfulness": 1, "user": "lululouise", "date": "July 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33909281}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled with friends", "text": "The room was very large with a huge balcony overlooking the pool area. The bathroom was also very large with a tub and a seperate shower. The entire bathroom was travertine and granite. Perfectly clean and well appointed with a blow dryer, toiletries etc.", "title": "one word excellent", "helpfulness": 1, "user": "mskeena", "date": "June 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32755998}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "The fabrics in the room were a bit dated but the bed was all white high quality linens. The matttress was extra cushy. My king room had a small sofa that also pulled out into a bed.", "title": "Wow... What a great place!", "helpfulness": 1, "user": "AZFoodCritic", "date": "June 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 32651930}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled on business", "text": "Beautiful resort. Snotty, rude staff.", "title": "Overrated", "helpfulness": 2, "user": "albison23", "date": "May 12, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 7592412, "likes": {"liked": "— beautiful grounds", "disliked": "— staff"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Check in: Rude staff. Requested king bed twice. Did not receive. Husband put my name on the reservation to arrive on my own, was not on reservation, had to wait for him to arrive over an hour later. Guest parking FAR away, valet = $20 a day.", "title": "I was one of the conventioners the other guy disliked", "helpfulness": 4, "user": "rbuffing", "date": "May 9, 2007", "detail_rating": {"business": 3.0, "service": 4.0, "cleanliness": 1.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7569627, "likes": {"liked": "— Desert scenery/views", "disliked": "— Dirty shower"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Room: Nice room, it seemed as if someone was ALWAYS vacuuming outside our door! Comfy beds, upgraded linens, NICE bathroom amenities. Room service available 24 hrs a day (I believe)", "title": "Loved the JW Marriott", "helpfulness": 3, "user": "want2getaway", "date": "May 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 7539336, "likes": {"liked": "— The property, the bedding", "disliked": "— large property"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Grounds: much of the pool was closed, but what was open was heated (we were there in the winter, so that was a nice option)", "title": "Desert Ridge- Convention Hell", "helpfulness": 6, "user": "traveler3311", "date": "April 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7404885, "likes": {"liked": "— Landscape", "disliked": "— convention crowd"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Decorated tastefully for Christmas.", "title": "Awesome Experience", "helpfulness": 3, "user": "tiger12896", "date": "April 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7380769}], "location": {"country": "United States"}, "stars": 4.5, "variance": {"poor": 30, "average": 105, "very good": 317, "terrible": 24, "excellent": 690}, "aka": "Jw Marriott Desert Ridge Resort & Spa Phoenix Hotel", "slim_ranking": 0.0564971751412, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The JW Marriott Desert Ridge Resort & Spa provides luxury, unparalleled service, endless recreation and exquisite dining. This desert mountain luxury hotel near Phoenix has Arizona's largest ballroom, a pampering spa, outstanding restaurants and championship golf. Upon arrival, you're greeted with an expansive grand lobby, splashing fountains, stunning floor-to-ceiling windows, sparkling waterways and majestic palm-lined pathways."}