{"user_rating": 4.5, "review_count": 1651, "name": "JW Marriott Cancun Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I have the read the negative reviews and then wondered if these people stayed at the same Marriott that I did. My husband and I thought our stay was just wonderful. We loved the adult pool at the JW and picked the same spot everyday to relax with a beautiful view of the ocean and it was nice and quiet. We loved how it was connected to the Casa Magna which gave us an excellent choice of restaurants. The food was just wonderful at all the restaurants that we ate at. Our favorite was the Thai and we loved the steak house. The staff was very friendly and courteous all of the time. The hotel was in a great location and was far enough away from the busy part of Cancun but close enough to walk to other restaurants. All in all, we had a great experience at the JW Marriott and would highy recommend it.", "title": "Great time!", "helpfulness": 1, "user": "Moishad", "date": "December 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 22672554, "likes": {"liked": "— adult only pool", "disliked": "— the convention that was also there"}}, {"rating": 5.0, "title": "Superb", "text": "We are 3 sisters from 3 different Northeastern states who get together for special birthdays. (we leave our husbands behind) Of all our adventures, the JW Marriott in Cancun proved to be our favorite. We stayed on the Club91 floor and the extra expense was well worth it. The comfort, ambience, service and gourmet food offerings were superior. Rosaria and her staff served our every need with earnest care and always a smile.The Club setting fostered congeniality among the guests but was large enough to provide a private corner if needed. The employees throughout the hotel were welcoming and responsive. Convenient location but you never need to leave the property.", "user": "KarenReber", "date": "December 9, 2008", "id": 22592703}, {"rating": 5.0, "title": "Our New Favorite", "text": "My Husband and I had been to Cancun several times before Hurricane Wilma hit but had not been back since then. We fell in love with Cancun all over again. We had not stayed at the JW Marriott before, we were pleasantly surprised. Here are some of the highlights of our stay.", "helpfulness": 2, "user": "Onyxsoleil", "date": "December 5, 2008", "id": 22478578}, {"rating": 4.0, "title": "The Marriott Was Excellent", "text": "*Beach- it was one of the best beaches considering it is now smaller after the hurricane, it was one of the least rocky beaches compared to some of the other hotels. We walked a couple miles down the beach one morning and agreed we had one of the best at the JW Marriott. We had so much fun playing in the waves, it was hours of fun each day. The water was crystal clear, hardly any seaweed, no rocks, great sand", "helpfulness": 2, "user": "danoamano", "date": "December 3, 2008", "id": 22425022}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "*Staff/Service-everyone made us feel welcome and if you had the same staff member more than once, they knew your name. We did not have one person working at the JW Marriott who was not friendly or welcoming. Poolside service was good, very quick service.", "title": "JW Marriott - 11/28 - 12/2/08", "helpfulness": 3, "user": "shamrock0421", "date": "December 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 22419477, "likes": {"liked": "— Our suite was fantastic.", "disliked": "— Lounge area in the evening...could use a bit more 'fun'."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Me and my girlfriend stayed at the JW from dec 1 to dec 7. I really do not understand how people can complain about this hotel. I read many reviews before going and when I arrived I kept them in mind to look for things that were relevant in their arguments. People say it has a rocky beach, but when you walk down the strip of beach in the hotel zone the JW's is the cleanest with absolutely zero rocks. People said the lawn chairs were old, but they had very comfortable cushions on them and were cleaned daily. I actually had no idea lawn chairs could be so comfortable. A recent review even said that he did not have room to swim if he wanted to do a 100 meter lap. The pool is well over 100 meters long, and they have a indoor work out pool in the spa. If you read reviews with negative remarks trust me people are just being picky. The only negative review that I found stood out was the price of drinks and food. If you go to Cancun do not exchange American money for pesos. American money has much more wait, the exchange rate is not worth it. Their trick is that they give you change in pesos, so bring a wide variety of U.S bills and try to pay with exact change. It can literally save you hundreds.", "title": "Rivals the Ritz", "helpfulness": 2, "user": "jp2800", "date": "December 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23019401, "likes": {"liked": "— Quality of hotel and pool.", "disliked": "— Expensive spa and drinks"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "Ive stayed at many high quality hotels including every Marriott in Hawaii and Orlando including the Ritz Carlton in Cancun for 10 days. This hotel is definitely a must go. Lobby is similar to the Ritz Carlton and rooms are better with more comfortable beds. If you do decide to go bring a little bit more money then you planned because their will be things to do, but unfortuanly they are over priced.", "title": "Fine Resort", "user": "dadsasdasd", "date": "December 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 22865081, "likes": {"liked": "— Overall functionality", "disliked": "— Did not have real issues to complain about"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Stayed there for five nights in December’08.", "title": "Wonderful Family-Friendly Hotel in Cancun", "helpfulness": 2, "user": "Girlstar128", "date": "December 18, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 2.0, "location": 4.0}, "id": 22842233, "likes": {"liked": "— Kid-friendly", "disliked": "— Front office staff who give people the less desirable rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "Had a basic room on 5th floor. Room was a quiet one, though do not know if that was due to lack of other customers (hotel was fairly empty). It was a quite large room with a big bathroom with separate sections for shower, bath and toilet seat. There’s WLAN service provided by the hotel but at least in my room it was extremely unstable.", "title": "JW Marriot, Exactly what I was looking for", "helpfulness": 2, "user": "rosieb10", "date": "December 15, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 22734364, "likes": {"liked": "— Nice big room with flat screen tv and a beautiful bathroom", "disliked": "— Price of food and drinks"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled solo", "text": "If you are interested in sunbathing at the balcony of your room, check that the room is located in a correct part of the hotel. My room (facing towards Cancun Palace hotel) had sunshine only until 9am, while rooms in the other side (facing CasaMagna) had sun probably for the whole day. At least all the rooms have an ocean view (as far as I could understand the layout), since IMHO there’s really no point in coming to seaside resort and not being able to actually enjoy the see from your own balcony.", "title": "JW Marriott Cancun OK, nothing special", "user": "Global_vagrant", "date": "December 14, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 22723132, "likes": {"liked": "— Room standard", "disliked": "— Check-in poor"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We enjoyed our stay at the JW Marriot Cancun. The property is clean and well maintained. The pool area is stunning. I would have loved to spend some time in there – unfortunately Cancun experienced some uncharacteristically cold weather for the time we were there so our only options were the indoor heated pool and Jacuzzi which were also nice but a bit of a shame to be stuck indoors. The property fronts onto a stretch of beach which is a nice outlook. Beautiful white sand and clear water but the beach itself is very narrow these days and I can see it being ridiculously crowded during peak times.", "title": "Enjoiyable stay at JW Marriott Cancun", "helpfulness": 3, "user": "NTLibran", "date": "January 1, 2009", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 23166241, "likes": {"liked": "— High quality property with great views and facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Overall the staff are pleasant but I wouldn’t say they go out of their way to make your stay an overly memorable one. I can’t fault the rooms, and the housekeeping staff are considerate, hard working and a pleasure to have a chat too. Housekeeping, together with the ‘porters’ that meet you at the front of the property are the pick of the staff in my book. There are numerous dining options within the hotel and the sister property next door. We had meals at Champions and the seafood and Thai restaurants which were all good quality and surprisingly not overly pricey. It is a short walk to the main road where you can catch the local buses to the markets, shopping centres etc, this is an easy and cheap way to have a look around Cancun and an opportunity to eat somewhere other than the hotel.", "title": "Fantastic!!!", "helpfulness": 3, "user": "AprilFool27", "date": "January 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23159404, "likes": {"liked": "— service", "disliked": "— dinner at Gustino's-service superb, food so so"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "As the hotel promotes itself as a spa I was keen to soak up the experience, however as enticing as their treatment list was the prices were ridiculous in comparison to other spas throughout Mexico, U.S.A and in my experience the rest of the world, so I decided to give it a miss.", "title": "JW Cancun ripped me off!", "helpfulness": 5, "user": "MR45783", "date": "January 1, 2009", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 4.0, "location": 4.0}, "id": 23153088}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "As much as I liked this property I felt you could be in a high-rise resort anywhere in the world and not notice the difference, I felt like I didn’t really experience the ‘real’ Cancun. Having said that, I am not sure Cancun is really my kind of place, but if you are looking for easily accessible resort and spa style accommodation close to the beach to relax and chill out (and you can do so with crowds of people) this may be the place for you. If you prefer a slower, quieter and more relaxed atmosphere pace I would suggest researching options in Playa del Carmen - little bungalows with direct beach access are more my style.", "title": "Great experience at the JW", "helpfulness": 4, "user": "DAISY00700", "date": "December 30, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23120997, "likes": {"liked": "— The gorgeous pool area", "disliked": "— Somewhat outdated"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "Firstly, the service at this hotel was impeccable. I have stayed at numerous JW Marriott's and this one had the best service (tough challenge as they all have been good). The room was spacious and seated on the balcony chairs you could see the ocean. The grounds and pools were beautiful. The beach area for all the hotels in the hotel zone is narrow because of erosion and I understand from the locals that Cancun is seriously considering bring in sand. We did not rent a car as it is easy to book day tours from Cancun. An advantage of a tour bus/van as opposed to a rental car is that you are not stopped by the police. Check points are common to stop drug trafficking. We took 2 tours on Cancun Line (Cancun.com). I strongly recommend them - the tour guides were excellent, they were on time, buses and drivers were good. We paid $10 extra for the best bus with a host and were very pleased. We went to Chichen Itza and Tulum (neither to be missed). We also strongy recommend the Selvatica Adventure -zipline, bicycle, cenote - it was a blast and the staff were superb. Xel Ha is also well worth a trip. We especially liked 2 restaurants - La Distilleria across from the Kukulcan Shopping Center - excellent margaritas and food for the price. We also really like the La Capilla Argentine Steakhouse at the Casa Magna Marriott next door. The Champions Sport BAr at the Casa Magna had the worst service known to mankind. We went there twice - skip it. Of course, the spa was excellent and I tried two treatments. The Mayan body scrup combined with massage was well worth it. Not as happy with the pumpkin facial. Fitness equipment solid. December weather was nice - a little overcast - but that was great for us because it was not has hot as it could be. Also, ride the bus - it is an adventure and very cheap and easy to use.", "title": "Wonderful Stay!", "helpfulness": 6, "user": "FlipflopsWV", "date": "December 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 23030602}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We had friends two doors down in the Grand Malia. It was half the price and twice as nice. I am the highest level Marriott member so I know their properties well. This is one to not write home about. The infinity pool is a farce as they have it turned off. If you stay on the third floor a blue light shines in your room all night. The air conditioner did not turn off or down and it was freezing. The food was horrible and expensive. The beach is gone and when you enter it they blow a whistle at you to get out. They charge you for everything, even for the use of the safe in your room. STAY AWAY", "title": "Stay down the road", "user": "lambpisa", "date": "December 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 22379437}, {"rating": 3.0, "stay_parameters": "Stayed November 2008", "text": "We went to Cancun for Thanksgiving for 5 nights arriving on Sunday the 23rd.", "title": "JW Marriott is just \"OK\"", "helpfulness": 4, "user": "starfish7", "date": "December 1, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "business": 4.0, "cleanliness": 3.0, "rooms": 3.0, "location": 4.0}, "id": 22347804, "likes": {"liked": "— Large Balcony, Adult Pool, location, comfy bed and Great Margs!", "disliked": "— Old lounge chairs at pool, no fans in fitness center, chair hogs at pool."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "One thing I will say is on our last trip to Cancun (May '08) we stayed at the Ritz so its very difficult to rate any other hotel.", "title": "New favorite in Cancun", "helpfulness": 1, "user": "bgou", "date": "December 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22346558, "likes": {"liked": "— Comfort and service", "disliked": "— Small beach"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We arranged for a private ride and the car that picked us up was a tiny car that had a gross smell in it. We were offered no water or beverage on the ride to the hotel. On the return it was the same. When we booked a private ride with with the Ritz we had a van for arrival and a large car for the return. Both times we were offered water.", "title": "Great, affordable time", "helpfulness": 1, "user": "KrishGR", "date": "November 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22268127, "likes": {"liked": "— Service, amenities, maintenance of property, views", "disliked": "— Business Center, prices in on-site restaurants and stores"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "Anyway ... the hotel lobby, etc. is nice. We had a premium ocean room that had a very large, mostly shaded balcony which we loved!! The room was the same as any other premium/junior suite room (kind of like the FAGCB),", "title": "Not kid friendly - terrible service", "user": "root070", "date": "November 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 22228913, "likes": {"liked": "— beach", "disliked": "— service"}}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 55, "average": 118, "very good": 367, "terrible": 31, "excellent": 1080}, "aka": "Jw Marriott Cancun Hotel Cancun", "slim_ranking": 0.127167630058, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Welcome to the JW Marriott Cancun Resort & Spa, an oceanfront haven of unparalleled sophistication, impeccable service and warm Mexican hospitality designed for today’s most discerning travelers. Sumptuous comfort, chic residential styling and glorious waterfront views distinguish every room. Abundant taste marks every dining experience, from casual to elegant, and indulgent charm distinguishes each and every day. Relax on a spectacular beach kissed by the sun and caressed by the sparkling waters of the Caribbean. Stroll through traditional markets ablaze with color or listen to the lullaby of the ocean surf from your private balcony overlooking the sea. With its powdery sand beaches and ancient Mayan mysteries, Cancun will dazzle your senses"}