{"user_rating": 4.5, "review_count": 726, "name": "JW Marriott Hotel Lima", "reviews": [{"rating": 5.0, "title": "This is what you expect!", "text": "There is a lot to be said about a western hotel chain. Consistent, clean and the amount of luxury you expect. Wish all Peru hotels were like this!", "user": "Steve D", "date": "April 14, 2012", "id": 127896267}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Perfectly located across from Larcomar in Miraflores, Lima, the JW Marriott is a proud landmark that boasts both luxury, comfort, and great service.", "title": "First Class Hotel!!!", "user": "Travel_4953", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127882689}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The rooms are spacious, with large 42inch TV's. Almost all have a great view out over Larcomar, and the pacific ocean, where you can watch the gliders soar past daily. The views are incredible as the sun goes down.", "title": "Very Nice", "user": "suru", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127879460}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "There is a pool, while small, it is nice when the sun is out. It does fall behind a shadow of the huge Claro tower beside, but it's a nice space.", "title": "Lunch Buffet is the tops", "user": "itsmisc", "date": "April 12, 2012", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0}, "id": 127746748}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Would recommend this hotel!", "title": "The best hotel in Lima", "user": "indrajray", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127640644}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We spent two nights at the JW Marriott after vising Cusco and before heading back to the US. It was a perfect end to our vacation - a luxurious, relaxing hotel. It is in a great location on the coast in Miraflores. It has nice views of the coast and is within walking distance of many restaurants.", "title": "Beautiful hotel and views", "helpfulness": 1, "user": "JuliaATL", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127483305}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We stayed at the hotel using Marriott Rewards points, and due to my Platinum status, we were upgraded to the top floor. They also gave us access to the executive lounge, which is probably the nicest lounge I've ever been to. They serve a large breakfast, light lunch in the early afternoon, wine and cheese in the late afternoon, and a light dinner/desserts in the evening. Plus they always had a refrigerator full of sodas and water. This was a great perk. We enjoyed the wine hour every night.", "title": "Top Notch", "helpfulness": 1, "user": "Rover1313", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127182836}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The rooms were excellent with comfy beds and a large bathroom with a separate tub and shower.", "title": "great place, but need to know some details", "helpfulness": 2, "user": "weinweber", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127151149}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We ate in the sushi lounge the first night, and both the sushi and ceviche were excellent.", "title": "Excellent location", "user": "dehetoxic", "date": "April 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127087739}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "We had a midnight flight back to the US on our last day, and they let us have a late check out at 10pm, which I just couldn't believe. It was so nice to be able to have to access to our room all day and shower before the overnight flight.", "title": "Great hotel for business", "helpfulness": 1, "user": "Lwood_23", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126931040}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We stayed here for one night before returning home after having visited the Sacred Valley, Machu Picchu, and Cuzco. The location was perfect and we were upgraded to a beautiful, spacious room with a view of the water. The executive lounge was one of the best we have encountered anywhere. They served the equivalent of three meals a day, along with plentiful snacks between meals. We were a bit disappointed that the outdoor swimming pool was already closed for the winter, as the weather was simply beautiful (sunny, low 70's). The hotel graciously afforded us a late checkout at 9 PM, which allowed us to retain our room for the entire next day without additional charge before we had to leave for our 11:45 PM flight home. We highly recommend this hotel.", "title": "Miraflores Magnifico", "user": "DCRE", "date": "May 17, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130106221}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The rooms and friendly staff at this hotel are great, especially if you've been doing a lot of traveling and are looking to finally relax for a day. The location across from LarcoMar Mall is very convenient and there are other good restaurants in walking distance if you don't want the chain restaurants at the mall. We walked about six blocks south to an Italian restaurant named Danica that was recommended the concierge. It was great. Perfect atmosphere for a good meal and bottle of wine. It takes about 40 minutes to get to this hotel from the airport and the driving in Lima is crazy. Be prepared for a interesting ride through town.", "title": "Very Nice Hotel", "helpfulness": 2, "user": "LA_FadeAway", "date": "May 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129730884}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My only complaint about this hotel is that they apparently make up their own exchange rate. We were quoted a certain price plus 10% tax in USD. When they converted it to soles they used a rate of 2.85 soles to the dollar even though the official rate at the time was 2.57. When the charge came through on our card it was $14 higher than what we were quoted and we made sure to use a card that does not charge any foreign transaction fees. When I asked the front desk during checkout, the man told me that every hotel and restaurant in Peru has \"it's own rate\". They seem to be making quite a commission on their rate. I didn't run into that problem anywhere else during our short time in Peru.", "title": "Best hotel in Lima", "user": "travelj60", "date": "May 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129715001}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Stayed 2 nights during our 18-day Peru trip. AWESOME hotel with every convenience. Superb beds. Good food. Kind people who went out of their way to work with our tight schedule. One of the best hotels in all of Peru. Thank you so much for the many kindnesses.", "title": "Excelent hotel in Miraflores", "user": "LYHD", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129468391}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "Superb location in Miraflores, very close to the Larcomar Shopping, overlooking the ocean and accessible by coastal path. JW Sushi Lounge is great! Try the cebiches and lomo saltado, also the best pisco I've had in Lima. Taste the chic morada and traditional pisco sour. The staff is very polite and friendly. Very close to the best restaurants of Lima, like Central and Astrid & Gaston. The room was nice and clean, with an awesome ocean view! I do recommend this hotel.", "title": "Almost Perfect", "user": "Gicko", "date": "May 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129373303}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We loved the location of this hotel, the staff, the rooms and everything about the hotel was spot on!", "title": "Superb Location and a very comfortable hotel", "user": "2bstressfree", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129307654}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "No need to tell you that the view from just about every room is spectacular! We had two rooms, one overlooking Larcomar and the bluffs, the other one in the corner facing the city on side and the sea on the other. Great beds, comfy sheets, large clean bathrooms. The staff was generally friendly although the service was a bit slow. Early check in and late check out were not a problem which is a huge plus! Like with any business hotel, they charge for in-room wi-fi but there is free wi-fi in the lobby so we didn't mind at all. The 6th floor pool deck facing larcomar is a great little secret, although I think its used so infrequently that drink and towel service took about 20 minutes. No matter, we loved having the sundeck to ourselves to enjoy the sunset and the hand-gliders flying over head. The hotel is close to many restaurants and an easy walk to all major Miraflores sites and shops. A great place to stay.", "title": "Great location, great hotel", "user": "EMG311", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129196556}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "This wasn't the best JW Marriott that I've stayed in but it certainly did not disappoint. Try the restaurant on the check-in level, the lunch buffet was delicious and the civiche was as good as any outside the hotel. The hotel room was adequate and comfortable, the staff were friendly and mostly helpful. I absolutely loved the gym which was huge, empty and filled with all the weights and machines that you can reasonable desire.", "title": "Loved the food & gym", "user": "Caribnow", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 128235833}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Loved it. Well worth what you'll pay. Beautiful location. Stunning sunsets and ocean views. We paid extra for the Executive Suites and that too is worth it with the complimentary food and wines served in the lounge from breakfast through dinner time and beyond.Luxurious rooms and the Larcomar shopping and park area right across the street make this a destination not just a hotel. Service was excellent too.", "title": "Every visitor to Lima should enjoy one night here", "user": "Murkate", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127980427}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "I spent friday night on my way to Cusco. I irraved to front the desk , everything was ready, my room was the one I requested, I had breakfast at the 24th floor , the girls welcome me as usual, by my name, they asked me about members of my family and happy to see me again, what else I can ask....I felt at home !!! this is the reason I m always choose JW in Lima.", "title": "JW Lima, Always the best", "user": "Alex d", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127950876}], "location": {"country": "Peru", "region": "Lima Region", "continent": "South America", "city": "Lima"}, "stars": 4.5, "variance": {"poor": 10, "average": 34, "very good": 186, "terrible": 5, "excellent": 491}, "aka": "Jw Marriott Lima", "slim_ranking": 0.015306122449}