{"user_rating": 5.0, "review_count": 241, "name": "Ka'awa Loa Plantation", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Hope we get the chance to be repeat guests like many of the great folks we met in Michael's wonderful kitchen. The breakfast layout and fantastic coffee slightly surpassed the beautiful grounds. Then there is the hospitality offered by Greg and Michael; we felt welcome after the first 5 minutes in the door.", "title": "Hope to become repeat guests", "helpfulness": 1, "user": "PPTA", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111680473}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We stayed in the cottage and enjoyed this little home away from home on our first trip to Hawaii while having free range of the great rooms and the lanai of the main house.", "title": "What a wonderful place !", "user": "roudoudou", "date": "May 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109331746}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Would recommend to all!", "title": "Not to be missed!", "user": "2pawsup", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104430967}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "We stayed two nights (only!) with Greg and Michael and enjoyed every minute of it. The place looked great on the website but once there it was even better than we'd expected, feeling at home, at peace. The wonderful bay with colourful fish is very near, as is Magic Sands beach. As a bonus, there are the best-ever cookies by Kaija in the nearby shopping centre. Greg and Michael are gracious hosts, friendly, unpretentious and go out of their way to be helpful (we were the only ones interested in trying the Hawaiian steam bath and they made sure we could try it in the short time we stayed). If we make it back to Hawaii, we will book one week there....", "title": "Exceeded our expectations!", "user": "sammy01cat", "date": "March 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101771430}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "These gentlemen know how to make you feel welcome and at home. From the personalized tour of the plantation, to breakfasts worth rolling out of bed for, and relaxing in the hot tub after a long day of snorkeling with the dolphins & turtles! The property is gorgeous and the home grown, organic coffee is perfection - what more could you ask for?", "title": "Beautiful place with great views and greats hosts!", "user": "Milibas", "date": "March 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100086992}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "This B&B is gorgeous! The house is big, beautiful and super comfortable. The rooms are nicely decorated, some with amazing views of the Bay. The Continental Breakfast its a real one, Michael cooks a different one every morning. They serve fresh fruit grown in the gardens, as well as the Kona coffee, delicious. I recommend having breakfast out in the lanai with the amazing views! Also they have a hot tub to enjoy the amazing sunset! Another nice thing to enjoy is the outdoor shower, when do you get to see the stars while bathing?", "title": "Best place on the Big Island!!!!", "user": "rubyykiara", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96878804}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Greg and Michael are the nicest hosts I've ever met, they know everything about the island and they can recommend a lot of activities to do!", "title": "WOW--Paradise", "user": "goonielovers", "date": "February 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96389198}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Thanks so much for making our stay so relaxing and pleasant! We will definitely come back!", "title": "one year later ... still fabulous!", "user": "Bluebell01", "date": "February 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96095598}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I loved staying at Kaawa Loa Plantation!!!!! It was far enough from city distractions that we were actually able to enjoy the sunsets and the forest without worrying about what site or adventure we were missing. The house is unbelievable, the grounds are gorgeous, and we overate every morning!!! I have already given their card to my coworkers!!!! Absolutely beautiful, it was Paradise!", "title": "Makes you want to stay forever", "helpfulness": 1, "user": "SeattleMeadowlark", "date": "February 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95778940}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We had the pleasure of staying at Ka'awa Loa last year. I've been dreaming about returning ever since we drove down the driveway to leave.", "title": "Is there a sixth star?", "user": "JSwa", "date": "February 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95339273}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We stayed in the cottage for 3 nights and really enjoyed it. The grounds are beautiful, the hosts, Michael and Greg are very friendly and knowledgeable about the island, and the breakfasts are delicious! The cottage is separate from the main building, giving you a bit more privacy, but you have access to everything in the main building. The outdoor lava showers are a treat not to be missed! The cottage has mosquito mesh to keep out the insects, but one side does not have glass in the windows in order to keep it cool at night (which works, but means it is a bit loud if it rains heavily all night). We loved sitting on the lanai in the evening watching the sun go down with a glass of wine.", "title": "Lovely!", "user": "SweetsFrankfurt", "date": "November 19, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 87580369}, {"rating": 5.0, "title": "The Best of B&Bs, and the Best of Hawai'i", "text": "I'd give the Ka'awa Loa Plantation 10 stars if I could, we stayed for a week and it was perfect in every aspect. Where do I start:", "helpfulness": 1, "user": "A_Traveler_from_Ca", "date": "November 2, 2010", "id": 85750865}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The location: It's away from touristy Ali'i drive, and far away from the mega resorts in the north. It's overlooking the Kealakekua Bay, and the coast to the south. It's at about 1500 feet, and is less hot than most other places you stay at at the Big Island or in Hawai'i.", "title": "This beautifully renovated and well-appointed old plantation home is both luxurious and homey at the same time.", "user": "Lutea", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84856592}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The premises: It's an old grand house, and Greg and Michael redid it beautifully. The grounds are somewhere between manicured and being a working plantation, where they grow coffee as well as a number of fruit, which we enjoyed for breakfast. The lanai is wonderful, aside from the breakfast we also had all dinners here, just putting some fish on the BBQ, or eating Poke or sashimi picked up at one of the local stores. Add a bottle of wine, and it makes for the best evening at least we could imagine.", "title": "Great B&B", "helpfulness": 1, "user": "BlueToBlue", "date": "October 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83415855}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The hosts: We can only speak about Greg, Michael was on vacation. Greg is the perfect gracious host, very helpful but not intrusive, has tips for everybody, and he just put us at ease, just like staying with an old friend. We had the added benefit of his mom, Kathy, visiting - she is awesome, the friendliest lady that always had something nice to say at the beginning of the day. And the breakfasts - beautiful. Smoothies, warm dishes, jam made from local fruit.", "title": "DO NOT book here - Terrible Owners - Cancelled our reservation 10 days prior to Wedding", "helpfulness": 15, "user": "aczarnow10", "date": "October 13, 2010", "detail_rating": {"service": 1.0}, "id": 83347652}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "We stayed for two nights in November and had a fantastic time (the place is GORGEOUS, the hosts were wonderful, and the rooms were spotless)!", "title": "Fantastic!!", "user": "Cesca", "date": "January 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94427372}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "I would highly recommend this B&B- it's top notch!! Breakfast was amazing!", "title": "Can't wait to go back!", "user": "TerriB047", "date": "January 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92903459}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Greg and Michael are perfect hosts: charming, gracious, attentive, and sincerely committed to making our stay a great one. They are marvelous cooks: Michael puts out a breakfast spread to die for and Greg's Christmas dinner is a work of art. Beautifully appointed rooms. Lovely grounds with a variety of sitting areas offer a wonderful combination of openness and privacy. The outdoor shower is a revelation!", "title": "Awesome place", "user": "Sasvanher", "date": "January 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 91389905}, {"rating": 5.0, "stay_parameters": "Stayed November 2010", "text": "Thank you, guys, for a wonderful stay! You exemplify the word \"hospitality.\" I hope we can make this an annual visit!", "title": "So good it hurts to remember!", "user": "Kingston_dan", "date": "December 23, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 90563259}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Just a short review to share our experience. We stayed in the cottage in July 2010 and were stunned with the friendliness of Michael and Gregg, the nice views from the hill and the perfect location on the west side of the island. We loved the breakfast in the mainhouse each morning and talking to the other guests and sharing experiences with Michael and Gregg. The hot tub in the garden is great!", "title": "Luxury on the Veranda", "user": "Cathy P", "date": "December 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 89074458}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 0, "average": 1, "very good": 10, "terrible": 2, "excellent": 228}, "aka": "Ka`Awa Loa Plantation Hotel", "slim_ranking": 0.0666666666667, "description": "A sophisticated, plantation-style B&B ideally located directly above Kealakekua Bay. Offers luxury amenities such as an outdoor hot tub, a traditional Hawaiian cedar steam, outdoor lava rock showers, a wrap-around lanai with a Hawaiian daybed, a fireplace, and an unobstructed view of the South Kona coastline! The perfect place to base your Big Island adventures!"}