{"user_rating": 4.0, "review_count": 2165, "name": "Ka'anapali Beach Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "KBH is a fun hotel. Staff is VERY friendly but don't be fooled its an old establishment. So if you're looking for luxury you won't find it here...", "title": "Loved this hotel actually...", "helpfulness": 14, "user": "caramela", "date": "September 24, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5833306, "likes": {"liked": "— The Staff, the location, the hawaiiness...", "disliked": "— The rooms (but I didn't really care after all)"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "However, I had a wonderful time at this hotel and I would go back because despite the fact that its old, you feel so comfortable here that your room doesn't matter.", "title": "One of my favorite hotel experiences", "helpfulness": 12, "user": "zoraM", "date": "September 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5824130, "likes": {"liked": "— Location + friendly spirit", "disliked": "— No business center"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Believe me, we then went on to stay in Oahu at the HHV (very VERY upper class hotel) and we wished we'd never left KBH!", "title": "Best attributes are Value and Location", "helpfulness": 18, "user": "twislander", "date": "September 16, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5805884, "likes": {"liked": "— Location", "disliked": "— Lack of gym facilities / hot tub"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "KBH made me feel welcome from the very first day and the staff are wonderful. They made our honeymoon memorable. When we left Maui we were really sad... oh and the beach here is amazing. We went to Big Beach and it didn't even compare to KBH's beach... plus there is black rock right there for snorkeling.", "title": "Wonderful, relaxing hotel", "helpfulness": 10, "user": "KrazyZippy", "date": "September 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5800677, "likes": {"liked": "— Staff", "disliked": "— nothing, very pleased with everything"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "Room is very clean... pillows are not so great and bed kind of uncomfortable BUT its hard to complain when you're having such a great time otherwise.", "title": "Great Hawaiian Hotel", "helpfulness": 6, "user": "littlekimmer", "date": "September 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5798053, "likes": {"liked": "— Low Key, great value", "disliked": "— Only one pool"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2006, traveled with friends", "text": "Rooms looked like a Ramada....cheezy furniture and horrible musty smell. Tiny bathrooms and no bathtubs! We were in Hawaii for a week so we had several VERY heavy bags so being placed on the 2nd floor was not \"fun\" because they had no elevators. Pool was just \"so-so\". The Front Desk staff was very nice, however. Concierge was helpful once we flashed some cash - she was actually surprised that we were going to tip her! Probably indicative of the type of clientele they get there! Location was pretty good - convenient to shops and golf.", "title": "Musty, ugly rooms.", "helpfulness": 10, "user": "carlareno", "date": "September 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 5884016, "likes": {"liked": "— Location.", "disliked": "— Musty rooms."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "We just go back from our marriage/honeymoon in Hawaii and I miss it already! The hotel was wonderful. Don't stay here if you're looking for a really fancy hotel. This hotel is old, but really has a \"Hawaiian\" feel to it. The hotel doesn't have that commercial look or feel to it the other hotels around it have. There is beautiful landscaping and gardens on the property.", "title": "Great Place to Stay", "helpfulness": 4, "user": "AlohaGirl06", "date": "September 27, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 3.0, "cleanliness": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5883881, "likes": {"liked": "— Friendly Staff", "disliked": "— Rooms need upgrading"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This is an older hotel and needs some updating, but who goes to Hawaii and stays in their room? It was just perfect for us.", "title": "A True Hawaiian Experience!", "helpfulness": 8, "user": "Tropical-Explorer", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5881168, "likes": {"liked": "— The staff.", "disliked": "— Basic Room."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled with family", "text": "Tiki Bar and Grill is great and so convenient. The mixed plate breakfast isn't that great, but the Tiki Terrace restaurant is excellent! The nightly entertainment was great, the store on the property was so convenient. They also have a little shop in the hotel with some cute things in there. After a long day of sight seeing and sun bathing it was nice to come back to the quiet, peaceful KBH and have a drink from the Tiki Bar and dinner at the Tiki Terrace.", "title": "most amazing trip-", "helpfulness": 5, "user": "missyourkiss26", "date": "September 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5880490, "likes": {"liked": "— = ] everything!", "disliked": "— nothing."}}, {"rating": 5.0, "title": "Home away from Home!", "text": "The location is great. You can walk to many restaurants and do all the shopping you could imagine, without even moving the car from the garage. We had a blast!", "helpfulness": 3, "user": "IslandGirl26", "date": "September 24, 2006", "id": 5833381}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "This hotel truly is \"the most hawaiian hotel\". The people are wonderful and friendly. There is an orientation breakfast the first day that is fun and informative and has a wonderful breakfast besides! They are super helpful in booking day trips and outings and by day 2, you feel like you just got home when you arrive after a day of \"doing hawaii\".", "title": "Everything a hotel in maui should be", "helpfulness": 12, "user": "mamadwarf", "date": "August 31, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5731516, "likes": {"liked": "— It wasnt too big. Very friendly people. Very affordable.", "disliked": "— no internet in rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I read that the pool was small and I suppose it is compared to the monstrosities of other hotels but we loved it. The food is great, the grounds are immaculate, the rooms were cleaned well. We stayed in the molokai tower for 6 days then we were supposed to go home but just couldnt bring ourselves to leave so we booked 2 more days! Then we were in the newer section and it was a bit nicer but still the same great service and care.", "title": "KBH Rules!", "helpfulness": 13, "user": "Maui-sunset", "date": "August 30, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5729122, "likes": {"liked": "— Staff commitment to heritage and local culture", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "They have a going away ceremony that is very touching and you really feel like you are leaving friends behind. We will stay at this hotel any time we go back to Maui. We loved the people and the place so much. The valet guys are wonderful too! We even brought them pizza one night! They know all the best places for everything and really made our trip a blast!", "title": "It Was A Tropical Paradise!!", "helpfulness": 10, "user": "melster6", "date": "August 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5717999, "likes": {"liked": "— Turn down service and cookies at night", "disliked": "— N/A"}}, {"rating": 5.0, "title": "Ka'anapali Beach Hotel reflects true meaning of Aloha and Ohana", "text": "If you want a nice, friendly hotel that is clean, with great food and sincere, hard working people, this is place for you! If you want to be lost in the crowds and the shine of a glossy hotel, go somewhere else. Here, it is family. There, you are just another face.", "helpfulness": 10, "user": "LibraLin", "date": "August 28, 2006", "id": 5716309}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "Aloha everyone! We just wanted to say that we've traveled around the world and no where else have we felt so welcomed by such a capable staff. This hotel definitely accomplishes their goal of weaving Hawaiian heritage and local lifestyles. Making lei's, learning hula, and lau painting are experiences we wouldn't have found elsewhere. Paddling an outrigger canoe and snorkeling right off the beach was just incredible. These folks are the best! Oh by the way, Alan Caban has to be the best concierge we've ever met. He was always willing to go beyond the call of duty and extend efforts to accommodate our every need. Call him if you need anything. Mahalo and we will definitely be back to visit again and we'll bring our lei's with us for a new nut.", "title": "Maui Waui!", "helpfulness": 7, "user": "jamesbearfan", "date": "August 25, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5709373, "likes": {"liked": "— The hotel's service staff.", "disliked": "— The noise near room 131."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "I was a little leary of staying here after I read the reviews of the hotel on-line. I think you either love this hotel or you don't. We stayed in the Molokai wing (for non-smokers) which is a pretty old wing. Our room was fine, pretty clean overall. But because the hotel is old the bed is super firm and very uncomfortable. I did ask about softer beds and they promptly gave us an egg crate to put on it. We also found it very noisy. The nightly show could be heard easily from the inside of our room, normally I wouldn't mind but we brought our 2-year-old so we had to go to bed on her schedule. We could also hear the neighbors coming and goings, conversations, and their TV. The food at the buffet is okay for breakfast. I would use the voucher (if you have them) at the Tiki Terrace instead. The best part was the pool for our toddler. She loved swimming in the shallow end which is all the whale's tail. I was expecting the staff to be more friendly than they were, based on the website and other peoples reviews. I found them to be friendly with eachother rather than the hotel guests. This didn't really bother me but it was interesting to note. Many of the other guests we spoke with liked the hotel and come back year after year. I heard they upgrade your room but if you want non-smoking the rooms are all the same except for the views. I would rather stay at a place which is more comfortable than my own home. I really looked forward to my own bed and clean shower when I came home. Next time we will stay a different hotel/resort.", "title": "Not my favorite", "helpfulness": 10, "user": "aelyn", "date": "September 12, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 5795119, "likes": {"liked": "— The pool", "disliked": "— The bed"}}, {"rating": 5.0, "title": "Magic Act was great!", "text": "We thought the hotel was very much in our style. It was very nice with well-manicured grounds, right on the beach. The staff was very friendly and the entire atmosphere made us feel wanted.", "helpfulness": 5, "user": "ksalmon", "date": "September 12, 2006", "id": 5793755}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "It was not a super-plush, super perfect, super expensive place like many of the hotels in that area. It was a bit older, not quite as modern and one could see areas of design that would probably be redone today if they could.", "title": "Location! Location!", "helpfulness": 8, "user": "vic&russ", "date": "September 11, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 5791133, "likes": {"liked": "— The hospitality", "disliked": "— The rooms could be a bit updated"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We had a corner room overlooking the ocean. We thought it was quite fine and were very happy with it. The deal we had with breakfast included at the mix plate, or substantial discounts at the Tiki Terrace, were well-suited to our family with two young girls who liked picking from the buffet for their breakfasts", "title": "KBH made our first Maui trip unforgettable.", "helpfulness": 13, "user": "NancyfromGoldrush", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5775256, "likes": {"liked": "— location, our view, and the great people who get to work there!", "disliked": "— didn't get to use all the componants of our package"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006", "text": "On to the magic show...", "title": "Awesome Hawaiwn Family Hotel!", "helpfulness": 13, "user": "sparkleworks", "date": "September 3, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5763953}, {"rating": 5.0, "title": "Wonderful Honeymoon!!", "text": "My husband and I stayed at the KBH for a week August 13th-19th. We stayed in the Kaua'i wing and were very pleased with our room. They had actually upgraded us to a partial ocean view. The balcony views were beautiful. Moutains on the one side and ocean on the other. The room was very clean and the cleaning staff did a wonderful job each day of our stay. No complaints. The beachfront seemed to be the best out of the whole beach. Very spacious. Never felt crowded. I would definitely recommend the welcome breakfast. We won a free ticket to the magic show there. It was fantastic! Great food, drinks, entertainment. It was worth seeing for sure! We had the daily breakfast with our room. I would recommend the Mixed Plate there if you're happy with fruit for breakfast. For the rest of the stay we used the vouchers at the Tiki Terrace restaurant breakfast...excellent food and staff! Out of all the restaurants we visited, the Tiki Terrace was the best. We ate dinner there twice. They actually had the most reasonable prices as well. We felt really welcomed there and we would love to get back one day.", "user": "GoLions12", "date": "August 25, 2006", "id": 5709113}, {"rating": 5.0, "title": "Wonderful Experience", "text": "Stayed here after our initial stay in Oahu on our honeymoon. Our only disappointment was in our room. Although it was in the older section, that still didn't bother us. We were next to the elevator shaft which was quite noisy, and the air conditioner wasn't the best, but everything else at the KBH was absolutely amazing. You can't ask for a better staff. We both cried at the going away ceremony they have the morning you leave. We were touched by the sincerety of the staff, and how quickly they make you feel a part of the KBH family. The grounds were amazing, the entertainment was very well done and all the little extras (turn down service with cookies at night, poi making demonstration, hula show, lei making, etc.) are not offered by any other hotel on any of the islands. If we're lucky enough to make it back to Maui, there will be absolutely no question where we'll stay.", "user": "BRF", "date": "August 22, 2006", "id": 5692232}, {"rating": 5.0, "title": "Awesome Family Hotel", "text": "The Ka'anapali Beach Hotel is a great family destination. Located on the pristine Ka'anapali beach on Maui's west shore, the KBH offers a great deal for families. Our daughters, ages 8 & 11 loved learning to make flower leis, bamboo bookmarks, and to do the hula. The discovered everything about the hotel by getting stamps in their KBH 'passport' - very fun for them. The entertainment at night is quaint and full of the Hawaiian culture we were all looking for (and sadly, was missing from other hotels on other islands we visited). The staff is very genuine and very helpful - they all care very much about making guests feel at home and also about the aura of Hawaiian culture. The grounds are extremely well kept. We saw hibiscus flowers everywhere and we even saw a banana tree on the property! The kids loved swimming in the whale-shaped pool, but the beach was really, really nice and calm, too. Nearby (5 min. walk) there is an attractive shopping destination called Whaler's Village, where we could get a sit down meal overlooking the ocean or a quick (and so convenient) bite at the food court. There are also stores to browse and buy nice souvenirs. The rooms are clean and modest. This place is not fancy - but met our needs very, very well. Our package was a good value and included breakfast which was very helpful when traveling with children. We will definitely visit Ka'anapali Beach Hotel again.", "user": "AHP", "date": "August 18, 2006", "id": 5624860}, {"rating": 5.0, "title": "Would love to stay there again!!!", "text": "We were totally impressed with the staff and accomadations at the Kaanapali Beach Hotel. They go the extra mile to may your stay comfortable and try to make you feel like family by the end of your stay. Our room was spacious and the grounds were great. Upon our arrival, our room was not ready on time, so they put us in an even better room and gave us free drink and dessert coupons for the hotel restaurant. This was our first trip to Maui and an anniversary trip as well. They are so nice! From nightly turn down service, to complimentary bottle of champange, the Kaanapali was a treat!!! We hated to leave!!!", "user": "kinca06", "date": "August 16, 2006", "id": 5618189}, {"rating": 5.0, "title": "Loved the Kaanapali Beach Hotel", "text": "The staff at the Kaanapali Beach Hotel made our trip to Maui July 18-27, 2006 a truely wonderful experience. We have stayed at the Westin and the Sheraton in the past and your hospitality and Hawaiian charm far surpassed anywhere we have ever stayed. This was my seven year old daughter's first trip to Maui. Your children's passport program and free classes were the highlight of her trip. She tells everyone about the nice \"hula lady\" at the front desk that taught her sand art and hula dancing. The free breakfast and presentation on things to do while in Maui our first morning was very helpful in planning our week. We loved the Kapanaha Magic Dinner Show and the Tiki Restaurant was our favorite of all the restaurants we tried on the island. Also, the free nightly hula show was wonderful. We will definitely recommend this hotel to our friends and we will be back again.", "user": "Hawaii_Lovers", "date": "August 15, 2006", "id": 5614343}], "location": {"country": "United States"}, "stars": 3, "variance": {"poor": 112, "average": 220, "very good": 673, "terrible": 73, "excellent": 1087}, "aka": "Ka Anapali Beach Hotel", "slim_ranking": 0.714285714286, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "Surround yourself with aloha on one of Maui's most beautiful beaches...at Maui's most Hawaiian hotel! Located on golden sand next to the clear blue waters of Kaanapali, all rooms have balconies overlooking lush tropical gardens, inviting you to relax to the sound of gentle surf and cool tradewinds. Award winning dining, shopping and recreation are on hand or close by. Here you’ll discover the best in Hawaiian culture and family-style hospitality – truly aloha at its best!"}