{"user_rating": 4.0, "review_count": 280, "name": "Kahler Inn and Suites", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "My husband and I just returned from a 4 night stay at this hotel for our first visit to Mayo clinic. The convenience of this hotel was wonderful. We stayed in a small suite that had a mini kitchen, pull out couch/seating area in addition to two queen beds. The hotel room was very standard but definitely served our needs. It was comfortable and clean and I felt well worth 109$ per night. But note, it is nothing fancy - from what I understand, nothing is in this area. Ours was on the second floor which is the same floor as the complimentary breakfast, workout area, and pool. Our room, number 241, and the others on that hallway, all had large ( maybe 12 X12?) balconies which would have been wonderful to use had the weather been warmer. In addition, staying on the second floor enabled us to avoid the slow elevators.", "title": "Worked wonderfully for our needs", "user": "gee_ess61", "date": "November 8, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 48787893}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "It appears that the hotel is working to improve some of the issues mentioned by previous reviewers over the past few years. Our comforter was definitely new and the bed did have several pillows. There is now an additional blanket and pillow (presumably for the pullout) stored on a closet shelf. Interestingly, we noticed the room next door to us was under some sort of contruction as there was a construction/supply cart parked outside the room literally all day. When I peeked in, the room was completely torn apart! I asked the person working in the room what was being done - upgrade? new fixtures? what? I was told that this was something that was done routinely. The room was taken out of rotation for 24 hours and all maintenance was performed like regrouting, tightening fixtures, etc. I was impressed.", "title": "Convenient to Mayo Clinic", "helpfulness": 1, "user": "MomofFiveBuffaloNY", "date": "October 15, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 3.0}, "id": 46898198}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Overall, I thought the size of the room was a real plus. Both of us were going through medical tests at Mayo and having the kitchen and seating area allowed us to spread out and not feel cramped in a small hotel room with the usual limited floor space.", "title": "Great For Mayo Availability", "user": "Jimm8117", "date": "October 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 46804002}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "The parking lot of the Inn is small and low ceilinged! We drive a Toyota Sequoiya and it did not fit - a near tragedy since we did pull in! We ended up parking at the nearby Graham Parking Deck and had our ticket validated at the hotel. We still paid the $12 per day at our hotel but it was charged to our account so we did not have to hassle to pay the parking attendant at the parking deck.", "title": "Convenient and Comfortable", "user": "DMVDDS", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 46303598}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The restaurant is adequate. The wait staff was very friendly and the food was decent. We only ate there once though. The Jimmie Johns sandwich shop is also attached to the hotel and we bought sandwiches, then heated them up in our microwave for a warm meal in front of the tv.", "title": "Decent choice for clinic stay", "user": "gene", "date": "October 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46036094}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "I have stayed at the Kahler Inn many times over the years when visiting the Mayo Clinic. The location, available by underground tunnel to the Mayo Clinic is the most convenient, moderately priced hotel. The parking is difficult under the hotel but when full, space is available at a ramp across the street. And yes, you can get reimbursed but it is a nuisance.", "title": "Location, Location, Location!", "helpfulness": 1, "user": "Penstemon52", "date": "May 20, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 16239798, "likes": {"liked": "— Convenience, location", "disliked": "— Parking"}}, {"rating": 4.0, "title": "No problems with this hotel", "text": "Shuttle service is offered but the Mayo shuttles stop across the street, offering more options for getting to St. Mary's. The breakfast is OK but for most staying there and going to the clinic, you normally have to fast anyway...", "user": "contentCokatoMN", "date": "February 9, 2008", "id": 13413627}, {"rating": 4.0, "title": "Help when needed!", "text": "Most rooms are decent. They serve the needs of those visiting the Clinic. Excercise machines are available and an in-house restaurant serves decent food. A sub sandwich shop and a coffee shop are also on-site.", "user": "Lark1959", "date": "January 21, 2008", "id": 12856609}, {"rating": 2.0, "title": "Getting real Bad", "text": "Because of the tunnel system, it's possible to walk for several blocks without seeing the light of day. There are many shops and stores in the downtown area.", "helpfulness": 2, "user": "tron0111", "date": "October 19, 2007", "id": 10148928}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "I have tried a few other downtown hotels but always come back.", "title": "My stay at Kahler Inn & Suites better than reviews suggest", "helpfulness": 1, "user": "TLH_Mermaid", "date": "July 16, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 3.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 8128847}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "Comments:", "title": "FEH!", "helpfulness": 3, "user": "Merlin1954", "date": "July 29, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 36126516}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "Room---Coffee and ice bucket trays were dirty. Coffee maker was stained, and the coffee tasted awful. Coffee carafe was like a dribble glass to pour. Hair dryer was loose on the wall and tilted. The TV channel changer button stuck each time I pressed it. The desk chair was dirty and dusty. The chair next to the bed was broken and useless. The door did not close on its own, I had to give it a hard push every time I went in or out.", "title": "never an elevator when you need one", "user": "5isenoughMinnesota", "date": "June 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 33177355}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "9th Floor---It felt like I was staying in an attic. NO ice machine, and the 8th floor ice machine was broken. Carpets stained. Ceiling-high towel carts all over the hall. Every other floor had 3 elevators, 9th only has one.", "title": "Close to Mayo Ckinic by subway", "user": "Go_USC", "date": "March 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 26218382}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Front Desk---There was often no answer on the phone. I also observed front desk personnel talking to others and letting the phone ring off the hook. When I checked out, the clerk did my paperwork and then just moved on to another guest without a word to me. When she saw I was still standing there, she dismissed me by telling me I wasn’t getting any paperwork. Then she turned away again.", "title": "Convienient to Mayo, but???", "user": "willtjbeach", "date": "September 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 4.0, "location": 5.0, "rooms": 2.0}, "id": 20061414}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Café---It smelled bad in the café. The seats and tables were dirty with crumbs. The waitress had a blaring voice that could break glass. There seemed to be no air conditioning. Staff communicated with each other often by yelling between the kitchen and dining room. The café was only open certain days and times.", "title": "Good except for sheets", "user": "whyn0t", "date": "June 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 16809218, "likes": {"liked": "— good location to Mayo, downtown", "disliked": "— sheets"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007", "text": "This is at best a 3 star hotel. Rooms are really old and tired looking. There were rooms on our floor that were in complete shambles. Bed was real hard and uncomfortable. If you are staying for a few days, its better to stay at Kahler Grand. Rates are a bit more but rooms are substantially better. I will not stay here again.", "title": "Stay at a better hotel", "helpfulness": 2, "user": "VCG", "date": "June 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 7852206}, {"rating": 2.0, "title": "Go somewhere else", "text": "Needs some serious updates. Plumbing is very old, water goes hot to cold. Housekeeping not very thorough. Had trouble with one staff member concerning bill. He was very sassy. Only perk is that it has underground walkway to Mayo.", "helpfulness": 2, "user": "Leanne40", "date": "November 10, 2006", "id": 6101036}, {"rating": 2.0, "stay_parameters": "Stayed July 2006", "text": "After seeing reports posted to this site about problems with the hotel not honoring requests for non-smoking rooms, the person in our group who made the reservations called a couple of times to check up on things and confirm non-smoking status. We had absolutely no trouble with that aspect when we checked in late Wednesday afternoon. The room smelled good, there were plenty of towels, sheets and pillows were clean, hotel staff were courteous, and the complimentary breakfast was adequate for our needs. Some members of our group complained of hallway noise but we had the air conditioner cranked up and heard nothing, not even the thunderstorm outside.", "title": "Double check your reservation, bring slippers and park across the street!", "helpfulness": 3, "user": "Kristine W", "date": "July 15, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5469417}, {"rating": 2.0, "title": "beware of your reservations--hotel won't honor them", "text": "On the minus side, the carpet and blankets in our room were grungy and overdue for replacement (forgot to pack slippers - yuck!) and there was mildew on the wall over the tub, though the bathroom floor and fixtures were otherwise OK.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 28, 2006", "id": 5397157}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "Parking is a problem. There are two entrances to the small amount of on site parking. Be advised that the two \"height measuring\" bars hanging from the garage celing at the top of the ramp leading to the lowest level of parking under the hotel are there for a very good reason, despite poor signage. Do not, repeat, DO NOT take your SUV down the ramp because there are pipes down there lower than the bars and you will have to back up the steep grade (which is supposed to be two way traffic -- yikes!). If you hear the bars hit the roof of your vehicle, don't go down there! We ended up in the ramp across the street (for which the hotel will reimburse expenses) but nobody was taking tickets on Saturday when we left and we parked free anyway.", "title": "Check out other options first", "helpfulness": 2, "user": "seoultous", "date": "June 27, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5394704}], "location": {"country": "United States", "city": "Rochester"}, "stars": 2.5, "variance": {"poor": 16, "average": 34, "very good": 80, "terrible": 15, "excellent": 135}, "aka": "Kahler Hotel", "slim_ranking": 0.254901960784, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "The Kahler Inn and Suites Has a New Look and Feel! From the moment you walk through our doors, you will notice a difference with warm color tones and a completely new lobby. We invite you to relax in comfort in one of our renovated guest rooms featuring luxurious bedding and LCD televisions. Free Continental Breakfast. Mornings can be busy and parking can be a hassle -- but not at the Kahler Inn and Suites. Enjoy a fantastic free continental breakfast every morning along with free covered parking. If you need to go anywhere we are connected by underground pedestrian walkways to Mayo Clinic as well as downtown Rochester. We also offer a free shuttle service to to many destinations throughout Rochester as well."}