{"user_rating": 4.0, "review_count": 988, "name": "Kempinski Hotel Ishtar Dead Sea", "reviews": [{"rating": 4.0, "title": "Introducing you to five stars elegance", "text": "Perhaps one of the best indoor and outdoor designs there is. Magnificent pool, great dining, superb in room service.", "user": "DoctorTTravel", "date": "October 7, 2013", "id": 180013177}, {"rating": 1.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Absolutely great rooms, very comfortable beds excellent showers.", "title": "BAD BAD BAD service.", "user": "Kelly F", "date": "October 6, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179876271}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Staff were welcoming, breakfast was to die for.", "title": "Amazing place in the Dead Sea", "user": "jfc21", "date": "October 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179854249}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Value for money can be worked in as this place is quiet expensive.", "title": "Best Hotel in Jordan", "user": "lynda516", "date": "October 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179546842}, {"rating": 5.0, "title": "Wow.... Just wow", "text": "My wife and I cut the visit short august 2013 because of the lack of service. The Pros: Nice building structures, pools were nice, breakfast was good, room cleanliness. CONS::: Lack of service around the pools, lack or service in the restaurants. Lack or help anywhere and not enough staff. Dinner at the buffet was horribly dry and for a five star hotel more is expected at $55 after tax$service per person. Furniture is wore out in the bedrooms, in the lounge and in the lobby. Pool tiles were missing and no services at the pool. Also if you stopped to have someone get you something they will make you feel like they are doing you a favor., SAVE your money and go to the Marriott next door or the Crown Plaza. Cheers.", "helpfulness": 1, "user": "Skid450", "date": "October 2, 2013", "id": 179421731}, {"rating": 2.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The problem with this hotel resort is the noise. Loud piped music relayed across the extensive site (it can even be heard from the Dead Sea) gives it the ambience of a low-grade holiday camp rather than luxury hotel. It is worst wherever there is a pool with a restaurant. We found the quietest, most relaxing place outside to be the Sunken Pool, where there is no food outlet to attract the flies either. But piped noise also infects the large Obelisk restaurant, which is a bit like feeding time at the zoo. Breakfast on the Codes restaurant terrace was civilised (but closed on Sundays). We didn't find a restaurant entirely to our liking for dinner but we enjoyed a light meal on the balcony of the Summerian bar. Our room (with balcony and sea view) was spacious but very grey: it looked like a very large prison cell. And some things just didn't work; for example, the minibar was never cold, despite an engineer's visit & water in the shower drained the wrong way. It was as if designers and architects had conspired against practicality and common sense. On a positive note, the staff were delightful: friendly and unfailingly helpful; the pool boys keep everyone supplied with complimentary water. But this Russian monument to excess (some \"interesting\" clientele) is supposedly modelled on the hanging gardens of Babylon; we hope ancient Babylon was more peaceful. Perhaps we should have tried the Mövenpick.", "title": "Bedlam on Sea", "helpfulness": 1, "user": "David W", "date": "September 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 178698667}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled solo", "text": "One of my favorite hotels. The Kempinski hotels are always awesome. I arrived late due to a late flight. i had to be able to say I had been in the Dead Sea so I jumped in around 11pm... pitch black outside and not a soul was around. Crazy fun experience. After that I went back to my room and crashed on the ALWAYS amazingly comfortable Kempinski bed. Rolled out the next morning at 0400 to head to Petra. Wanted to be there for the sunrise!", "title": "Amazing", "user": "Whiteea333", "date": "September 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178511342}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "We booked a standard room for 3 nights .", "title": "Luxurious Vacation", "user": "Osama A", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178359238}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "Upon arrival we were given a refreshing small wet towel , check-in was easy , and we were upgraded to a junior suite # 3220 which was great for us.", "title": "Should be 5", "helpfulness": 1, "user": "umbash", "date": "September 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178251429}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Rooms: very good , very spacious ,nice furniture ; great balcony with sea view .", "title": "Excellent place to spend a couple of days at the Dead Sea", "user": "LKhamis", "date": "September 23, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 178231826}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We spent four nights by the Dead Sea and chose the Kempinski based on a word of mouth review. Although the location was great and the hotel looks lovely, we feel that it was more of a 4 star than a 5.", "title": "Great location", "user": "Rachel_Whales", "date": "October 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 180317242}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "In comparison to some other hotels we stayed at during this trip, it was the little details that let this hotel down. The lock on our sliding door was broken, which meant that if we opened it we had to try for 10 mins to try and lock it again. The cleaner took two towels but only left us one. Items ordered from the menu were frequently not as described (missing items or meals completely different depending on the day) or not available. Bathtub plug was broken, as was another dial on the bath.", "title": "Always the best", "helpfulness": 1, "user": "Warka", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180305730}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "After taking a dip in the Dead Sea I asked a staff member (who was working at the towel area right near the sea) for a towel only to be told that the towels had finished. This left me dripping wet walking through the hotel.", "title": "Excellent", "helpfulness": 1, "user": "Georges M", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180083562}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Breakfast was good quality with a wide variety. We dined at the Italian restaurant and this was 50/50. My husband's meal was good but he was brought a room temperature beer, my drink was lovely but lasagne very dry.", "title": "Exceptional service", "helpfulness": 1, "user": "dureid", "date": "October 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180064531}, {"rating": 5.0, "stay_parameters": "Stayed October 2013", "text": "We did enjoy our stay here but think they need to either work on these small issues or drop the rates.", "title": "Fantastic hotel, wouldn't hesitate to return", "user": "Debskidd", "date": "October 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 180042975}, {"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I've given this hotel 3 chances, I will be recounting our 3rd bad experience here. From the second we arrived till when we left my wife and my experience at this property was a complete and utter disaster. To start off, when we arrived it took them well over an hour to get us checked in, then we got to our room which had a broken and empty 'complimentary' mini fridge. The sliding glass door to our ground floor suite had a broken lock so anyone could come in and steal all our stuff if they so wished (to which the hotel told us to lock up everything in the safe lol). We went to the pool (which was the only nice thing at this joke of a hotel) and decided to have lunch at their poolside restaurant, the food was also terrible, first they brought us burnt hamburgers with barely palatable french fries, the meal came with a \"Salad\" which was a coffee cup filled with lettuce and absolutely nothing else. The dinner was equally disgraceful. The next day, we were so unhappy we decided to leave early, but not before I complained to the hotel's manager. After hearing the horror story of our stay, he simply looked at me and said, \"if you don't like our hotel, next time, don't stay here.\" Very unsatisfied by his response, I went home and send two emails. The first to the General Manager of the hotel, and the second to Kempinski International HQ. To the first email, I received a quaint email from the gentleman in which he asked me to let him know when I would be coming back to his hotel so he could make sure they gave us good service (I'm never going back there obviously) and as for the second email, I never got any response from them (great job quality control). Two things are certain, regarding the Kempinski Hotel Ishtar Dead Sea, I will never go back there, and regarding Kempinski in general, I will probably never go to any of their hotels worldwide. Stay at this hotel at your own risk!", "title": "Worst Hotel Ever!", "helpfulness": 1, "user": "LoveGreatHotels421", "date": "October 1, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 5.0}, "id": 179312326}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with family", "text": "My Family (3 & 1yr old) stayed at this upmarket resort for 5 nights. We had a middle of the night check in which led to a mix up on the rate, but we were upgraded to an Ishtar Terrace Suite the next day, but we did have to move rooms.", "title": "Best Resort in the area... if you can live with the flaws", "user": "patelv01", "date": "October 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 179292911}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "The room (1602) was spacious and the terrace was great. However there is no lift access to the pool area or main building from this level so it meant taking the buggy down a flight of steps or calling a club car to whisk you away.", "title": "Amazing", "helpfulness": 2, "user": "Hala8387", "date": "September 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 179009246}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "The complimentary mini-bar was replenished daily and they were more than happy to give you more than the nominal 2 cans of beer (Bud/Amstel) No wine or spirits in the mini-bar :(", "title": "Romantic and idyllically peaceful - until they turn up the music.", "helpfulness": 1, "user": "John B", "date": "September 28, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178934450}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Breakfast had a good selection and drinking champagne took the edge of the flies buzzing around outside. The resort was relatively bug free with a solitary mossie in our bedroom which didn't bite!", "title": "Stunning and relaxing hotel", "user": "Ltraveler7", "date": "September 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178827048}], "location": {"country": "Jordan", "region": "Dead Sea Region", "continent": "Middle East", "city": "Sweimah"}, "stars": 5, "variance": {"poor": 53, "average": 121, "very good": 223, "terrible": 50, "excellent": 541}, "aka": "Kempinski Hotel Amman", "slim_ranking": 0.5, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Kempinski Hotel Ishtar gives you the opportunity to enjoy its riches where Queen of Sheba and Cleopatra once strived to unravel mystery. Situated gracefully on the shores of the largest spa in the world the Dead Sea, unique for its ozone-rich air, mineral sea water and ultra-violet filtered sunshine. Surely there is no region on earth where nature and history have more wonderfully conspired, where so exciting drama has obtained a so beautiful theatre."}