{"user_rating": 4.0, "review_count": 920, "name": "Kempinski Hotel Bristol", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I was extremely disappointed in a recent stay at the Bristol. The weather was hot and the hotel markets itself as being air conditioned but it is not. It has an air cooling system which is useless in hot weather. The room could have been cleaner and clearly needed updating. The location of the hotel is teriffic. Finally, I booked through Leading Hotels of the World for which I was to get certain amenities. Upon check-in I was coldlly informed that the Bristol was no longer a member of LHW and that I would receive nothing. It appears that the hotel is still a member of LHW so this is baffling.", "title": "Caution!", "user": "Polarine", "date": "September 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 41962226}, {"rating": 4.0, "stay_parameters": "Stayed December 2006", "text": "Stayed at the hotel for 3 nights so we could visit the German Christmas Markets", "title": "Nice Hotel very well situated", "user": "watty77", "date": "September 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 41104542}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Check in was effortless & the staff very welcoming.", "title": "Great hotel but rooms could be brought up to date", "helpfulness": 1, "user": "globaltruth", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 38805182}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Very well placed near all the shops & right on the KU Dam", "title": "Exelent stay", "helpfulness": 1, "user": "SilentDiver", "date": "August 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38430509}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Rooms were a little shaby & could have done with a lick of paint ~ very clean though.", "title": "Great hotel but slightly dated", "helpfulness": 1, "user": "smsUk", "date": "August 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 36807718}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I think this is a really lovely hotel, I found the style to be fairly oldfashioned, and the public areas as well as the room I stayed in were 1950s high style rather than 21st century minimalism. The service was good, and the hotel was a comfortable place to stay in the depths of a Berlin winter. The swimming pool and health club area were great and I found all the staff to be extremely helpful. On the downside, my room was small, but tolerably so, as I spent little time in it, the charges for internet connection were exhorbitant at 25 euro per day and although the breakfast buffet was spectacular, it was also spectacularly expensive. The hotel restaurants were also relatively expensive, but they were aslo extremely good, and certainly the cost was no higher than it would have been in London restaurants of similar quality. The Ku'damm also has many cafes and restaurants as alternatives for meals and there is a large suoermarket nearby to stock up on drinks and snacks as an alternative to the minibar. I really didnt like the fact that the hotel followed the German habit of using two single duvets on a doubl bed and the fact that the 'double bed was actually 2 singles pushed together - and not phusically joined so it could and did slide apart.", "title": "Lovely hotel in great location", "user": "seniledelinquent", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 58695096}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "Overall a comfortable hotel in a great location.", "title": "Old world elegence", "helpfulness": 1, "user": "amadeaus", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 56663041}, {"rating": 2.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Theis hotel is situated in what was the old centre of Berlin before the waoll came down, near the Zoo. It has an old world charm & elegance about it. The service is exellent. The dining room supurb as is their room service. I have syated there three times now with my partner, it's excellent for business, close to everything. If you want to impress your clients this is the place to do it. If you just want to experience Germany prior to WW2 then this is what it was like, I suppose. The rooms are elegent and quiet. All the business facilites you could want an excellent car hire service available.", "title": "worst 5 star hotel I have ever been at!", "user": "szaboline", "date": "February 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 56565670}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The service at the hotel is the only thing which is acceptable. I arrived first with a lot of lagguage, but the 3 bell boys didnt bother to help me with or didnt help to open the door!", "title": "OK, but could use a facelift; wonderful bar", "user": "VirtuallyAnywhere", "date": "February 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 56458690}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The reception lady was very nice and helpful but besides that nothing good happend any more. When you arrive at your story you get out of the elevator and find an old carpet, which is so worn off that you can see the ground! Then our room, we got an upgrade and an VIP treatment. But the hotel room was tiny, the bathroom wasnt clean, the bed had holes and was dirty, the furniture was worn down and not completly clean, the room didnt have air conditioning, you could open the window since that was too loud, and the room euqipement was lacking good quality sanitary products, tooth brushes, body lotion, sewing kit and a groom where missing! Further comments to the service; it took the bell boy 25 mins to bring our luggage, the concierge didnt have any specific recommendation for bars nor did he know the exact trains going to Alexanderplatz, the bell boys never felt an urge to open the entrance doors, they where rather standing around in the lobby doing nothing, The room cleaning was also lacking 5 star service, e.g. they didnt change the bed linings! After I called housekeeping, they told me they only change every 2nd day! Now we get to the service in the hotel lobby restuarant! I was sitting there for 40 mins trying to get a coffe, but noone felt an urge to serve me!", "title": "Lovely hotel in heart of city", "user": "WMcKEdinburgh", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 56025983}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "After arriving very late, due to flight delays, we were greeted by friendly staff. Although I ordered a \"standard\" room we were shocked by the poor quality of it. It was very small with dated, worn furniture. We phoned to reception to ask to change room who were helpful and came up to show us a number of other rooms, one of which would cost an extra 50 euros a night! We did settle for another room without paying the extra but I still am surprised that I was in a 3 star room, within apparently 5 star hotel.", "title": "Not a 5 star hotel", "helpfulness": 1, "user": "thebaths", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 34603297}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Pool was closed for maintenance. Would have liked to have known that in advance as was deciding factor in choosing this hotel. Could have used another hotel's pool 10 min walk away.", "title": "Great location but no air conditioning, prentitious maitre d in restaurant", "user": "JosephL", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 34179878}, {"rating": 5.0, "title": "A perfect choice", "text": "Breakfast was fantastic. A lovely room with friendly courteous staff. A great choice or fruit, cereals, seeds yoghurts as well as hot food. Boiled and scrambled eggs, \"roasted\" bacon, sausages, meatballs. There was also the continental options of cold meats, cheeses. A lovely choice was a champagne breakfast with smoked salmon and prawns!", "user": "AmbercatEngland", "date": "June 13, 2009", "id": 32222007}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled on business", "text": "As we had such a short visit we used the \"hop on/hop off\" tourist buses which were ideal and informative. All stop opposite the hotel.", "title": "Wonderful hotel in great city", "user": "Caerketton1", "date": "April 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 27361301}, {"rating": 2.0, "stay_parameters": "Stayed November 2008, traveled solo", "text": "Location of hotel was good. Perfect if it is shopping you want. Great transport links. We got the train from S/feld airport to Zoogarten at cost of 2.80 euros each. Ofcourse, as we are in Germany the trains were on time and clean! 10 min walk to hotel from station providing you have good directions and don't get lost in the rain at 2300 hrs!!", "title": "A bit disappointed", "helpfulness": 1, "user": "UsaBusinessTraveler", "date": "December 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 23003693, "likes": {"liked": "— Location", "disliked": "— Room size, smells in bathroom, inadequate athletic facility"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "I stayed here for a week with my father who I work with.", "title": "Great Hotel, Service & Location All Around", "user": "fxybrzln", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55589510}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Location: Right in the middle of Berlin and close to our office (actually walking distance)", "title": "Good location for affordable price", "user": "Philip P", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55535572}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Staff: WOW! They spoke many different languages, were courteous beyond belief and super seeded their duties. After leaving, we realized we had forgotten one of our passports and they shipped it to us in France.", "title": "Great Hotel but needs a bit of a jush!", "user": "norfolk23", "date": "October 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 46131442}, {"rating": 2.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Service: Just awesome! Great personal services all around.", "title": "living on past glories....", "user": "El-Cordobes", "date": "September 25, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 44406455}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "Accommodations: Plush bedding and pillows, older tv but perfect internet service throughout the entire hotel. Rooms only have heat since it is always chilly in Berlin. Very quiet if you're a light sleeper like me.", "title": "Buisiness an Leisure in Berlin , May 2007", "user": "furbysound", "date": "September 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 42937927}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 63, "average": 138, "very good": 319, "terrible": 25, "excellent": 375}, "aka": "Kempinski Hotel Berlin", "slim_ranking": 0.230884557721}