{"user_rating": 4.0, "review_count": 313, "name": "Kempinski Hotel Gravenbruch Frankfurt", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "I chose this hotel from the internet using the keyword \"boutique hotel frankfurt\" but it turned out to be a big disappointment. The hotel is a low rise and very big. I believe they just had a rennovation but I can see old things in the room like bathroom floor & wall tiles, furnitures. The shower faucet is terrible. Hot water comes and goes. I decided to check out and ask for a refund but they won't give any so finally they had to give me a new room.", "title": "Old, but not classical old", "helpfulness": 1, "user": "ryota", "date": "January 26, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6698913, "likes": {"liked": "— nothing", "disliked": "— too far from the city center and too old"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled on business", "text": "Anyway, It looks old but no senses of antique. They charged 131 for the first 2 nights and 255 euros for the third night (during the trade fair), and all without any breakfast. The hotel is far away from everything. Tourists like us can possibly go nowhere. Though they have shuttle van to the airport but not convenience at all. The GSA staffs are OK but the concierge guy has attitude. He tried to act like a butler but you can expect no help from him.", "title": "Super Hotel", "user": "Chris71151", "date": "January 20, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6627857, "likes": {"liked": "— Excellent service", "disliked": "— no in room tea and coffee making facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled on business", "text": "The wellness center is very old and the spa look dull. I think they need a major rennovation for the whole property.", "title": "A wonderful retreat from the city", "helpfulness": 3, "user": "JonStroud", "date": "October 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 5957635, "likes": {"liked": "— huge bed!!!", "disliked": "— paid for WiFi internet access"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "This is an excellent hotel, the staff are very helpful, the food excellent and the bedrooms and public areas are well appointed and clean. Some redecoration is taking place but every care is taken to ensure guests are not inconvenienced. The only two minor comments I would make are the lifts are very slow and there is no coffee/tea making facility in the rooms only a mini bar and complimentary bottle of water. Other than this I could find no fault.", "title": "Facelift / Renovation - They did it -", "user": "Mark B", "date": "October 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4040103}, {"rating": 4.0, "title": "Great qualities - needs facelift", "text": "It's lovely to visit a hotel where you feel like you are being given five star service from start to finish. Arriving at Frankfurt airport I rang the Kempinski to ask about their courtesy pick up service. \"No problem\", I was told in perfect English, \"our driver will be with you in 15 minutes\". And he was - despite the fact the I was standing in the wrong place. Not a problem for the Kempinski - a quick call on my mobile phone with instructions of where to go and there was the very smart people carrier with the blackened out windows.", "helpfulness": 3, "user": "ejcooper0", "date": "October 6, 2005", "id": 3997852}, {"rating": 4.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "Yes, the hotel needs some remodelling, it has the charme of older days. Some like that, I prefer more modern hotels. BUT, the good news is, it is impeccably clean and perfectly maintained. Also, the park-like surroundings are beautiful.", "title": "What a service!", "helpfulness": 5, "user": "Clod13", "date": "August 14, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3760660}, {"rating": 2.0, "stay_parameters": "Stayed October 2004, traveled on business", "text": "What impressed me most was the service. Each employee that you meet anywhere at anytime greets you friendly. They make you feel welcome there.", "title": "I checked out early!", "user": "goodnamesaretaken", "date": "April 18, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 3374756}, {"rating": 3.0, "title": "Ok for business", "text": "I filled a survey and a week later had a thank-you letter in my mail. Outstanding!", "helpfulness": 3, "user": "weaverville", "date": "February 24, 2005", "id": 3225807}, {"rating": 4.0, "title": "Great garden, great food, out in the country quiet area of Frankfurt.", "text": "I stayed here for a 2-day meeting and was very pleased.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 8, 2004", "id": 1713613}, {"rating": 5.0, "title": "Great Hotel, Prepare to Walk", "text": "Fo the price of a room here, I expected a lot. At checkin, I was pressured by the clerk to upgrade to a suite. She told me the regular rooms were very small and not inviting. I travel a lot and I have never heard a hotel say that about their rooms. The carpet in the public area was frayed and worn in places. The staff entered my room twice without knocking first. I could not pick up the wireless internet. The bed was comfortable and the room fine, but for the money they were charging, the Kempinski was way overrated. They also run a shuttle bus into Frankfurt which was good however, the times were few and far between.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 18, 2003", "id": 858318}], "location": {"country": "Germany", "continent": "Europe", "city": "Frankfurt"}, "stars": 5, "variance": {"poor": 25, "average": 40, "very good": 109, "terrible": 21, "excellent": 118}, "slim_ranking": 0.109433962264, "description": "In a unique setting in the heart of a stately park, near the city of Frankfurt yet a comfortable distance away, lies a tranquil refuge: the Kempinski Hotel Gravenbruch. Built more than 400 years ago as a manor house, centuries old tradition is here combined with modern hotel comfort forming the backdrop for an oasis of harmony and relaxed lifestyle."}