{"user_rating": 4.0, "review_count": 408, "name": "Kenilworth Resort & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Spent 7 days at the Kenilworth, overall it was a really relaxing week. But to begin with, we got a room of a lower category than booked, i.e. without balcony and moreover on the ground floor where everyone could look into the room, as the footpath to one of the main entries was just in front of the room. After complaining, we were offered a luxury tent or a room with balcony from the second day onwards. Although the tents look quite well equipped, we decided to take a balcony room on the second floor. The view was into the adjacent garden, quite nice, but there was noise from trucks mostly until 10 PM. The toilet flush didn't work, but it was fixed next day without the need to report. Also, two defunct light bulbs were replaced without us having to complain. We got accustomed to the room and soon felt at home, as the beds were very comfortable, there was a coffee maker with daily replenished selection of coffee and excellent tea. Mineral water was delivered daily. The housekeeping did a really good job and it was always a pleasure to enter the clean and tidied up room. There was no ironing board in the room, however the directory indicated one would be delivered on demand. Air-condition good. Laundry service very good, same day re-delivery without surcharge. The television was ok, at least CNN was available, but not BBC. The bathroom amenities were fine. No daily newspaper, but one neighbouring room always had a fresh newspaper, possibly a special arrangement? Note: In the coffee shop there is a selection of local newspapers.", "title": "Enjoyed a week of holidays", "helpfulness": 4, "user": "Frequentvoyager", "date": "January 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 13073223, "likes": {"liked": "— comfortable bed", "disliked": "— no BBC television"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with family", "text": "The Beach: The hotel is located at the beach, in a distance of about 300 meters mandatory in Goa. The beach is quite clean, only few stray dogs, and the usual peddlers asking five times the market price. Beach shacks are plenty offering good food. The \"little Moscow\" directly to the left when you exit the hotel is ok, the tenant very friendly and the tiger prawns good, but actually not cheap, 300 Rupees per prawn, and you can rest on the sun beds free of charge.", "title": "kenilworth is great....!!!!", "helpfulness": 2, "user": "dipmaz", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10035183, "likes": {"liked": "— The Pool and the Hospitality", "disliked": "— Dearth of Activities for children and prohibitively expensive internet"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "The Surroundings: There are some small shops just outside the hotel and also a dentist with very modern facilities. Taxis are outside the hotel and you can bargain. A round trip to Margao should not cost more then 250 rupees.", "title": "Fantastic hotel", "helpfulness": 4, "user": "Dipps7", "date": "September 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8723929, "likes": {"liked": "— Amazing hotel", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The Food: There is mostly a main buffet in the garden, but if you have booked half board as we had, you are only admitted to the “side” buffet at the coffee shop, unless you pay a surplus of about 550 Rupees. For breakfast you get eggs on demand, scrambled, sunny side up, omelette. that's fine, but the choice of real crusty bread and cheese is really disappointing. However in general, the Indian food is good or some even delicious, specially the vegetables, less the meat. At dinner there was live Indian classical music sometimes, but that was disturbed by incredible noisy techno sounds from the beach, due to a conference organized by the hotel.", "title": "Loved it! Amazing !", "helpfulness": 3, "user": "Natalim", "date": "July 25, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 8232141, "likes": {"liked": "— everything!!!", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "The Pool and the Spa: The pool said to be the largest in Goa, it is really very nice and clean, the setting beautiful, actually, it consists of two pools and one jacuzzi, all on different levels. The Spa is modern, relaxing and very clean, we had Ayurvedic massage that was good but rather expensive, high taxes are added on all rates of the Spa! The pool and spa attendance is excellent and the towel service perfect.", "title": "Top Marks for the Kenilworth by Dan and Anand", "helpfulness": 2, "user": "EastLondonDude", "date": "May 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7654647, "likes": {"liked": "— Everything", "disliked": "— We did not stay long enough"}}, {"rating": 5.0, "title": "Excellent!", "text": "LOVELY! We had a lovely, large room with a spacious balcony facing the pools, trees, paths, and sometimes within hearing (but not sight), the ocean. This hotel is so beautiful. The open air lobby is genteel, the winding paths from the hotel toward the ocean are lovely in themselves. Breakfast was very good, lots of variety. Options to eat in the air cojnditioning, inside but with fans, or outside in the sun or shade. There were vendors on the beach which were too persistent for me. A driver named Vincent Rodriguez took us to see an ancient labyrinth and other rock carvings some distance from the hotel, which were fascinating. Our room also faced the area where food was served outside each evening, but that noise was over by about 10:00. I always travel with earplugs, just in case, but did not feel the need to use them. We liked the shack on the beach to the right for dinners. Very tasty. The spa looked really nice, but the hotel needs additional people with additional skills to fulfill all the options they offer. I would suggest trying one service and proceeding from there, rather than booking several at first, as we did. The beach was gorgeous, worth the walk. One other detail -- our flight got us to Goa quite early in the day and we were not able to check in. We had booked a room, but they did try to get us into one of the beach shacks, perhaps because it was available earlier than a room. We said no to that, although they did have the benefit of being much closer to the ocean and always being able to hear the surf. When they came to get us to check into our room, we were very happy with our choice to stay in the hotel proper. We stayed for 6 days. I would go back and stay two weeks, and explore a bit more outside the hotel than we did. Other than the vendors and the spa difficulties at the time of our visit, we did not experience any of the difficulties mentioned in the other reviews. I would suggest to the hotel that they work out an earlier check in time when possible.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 20, 2006", "id": 5368849}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "My partner and I stayed in March this year. The hotel itself is lovely. It's not a 5 star as some sites suggest but it is very nice. The pool itself is fantastic. It can be a bit of a push to get a bed by the pool but in a way it did us a favour, we would just get a couple of beds in the large grounds and use the palm trees for shade. The staff were very helpful to us, the only problem was checking in. We arrived at around 6.30 am but couldn't check in to around 12.30pm. However, they did upgrade us to a luxury tent almost on the beach for the 2 week stay. If you get the chance then go for it, it made the holiday (I'm not the best camper but the tent was amazing, better than most rooms I've stayed in).", "title": "Great holiday, shame about the club and crew!", "helpfulness": 3, "user": "K1ckstone", "date": "June 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 5363713}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "We arrived in Goa on April 2nd having flown in from our base in Mumbai. Flights to Goa on Jet or Kingfisher are the best and if you book locally are much cheaper. I had been in touch with the hotel directly and as promised there was a representetive waiting to pick us up in a smart clean car. In our group we had 4 adults and 4 children. On arrival we were given a welcome drink and once the formalaties were taken care of we were escorted to our rooms. Our room was towards the front of the hotel above the car park (not an issue) and it was big & clean. The bed was huge and could sleep three easily, we also had an extra folding bed for our daughter still the room was not congested. Our room also had a large balcony with good cane furniture. The bathroom was a good size with the usual hotel extras including tooth brush, comb, shower gel,shampoo, moisturer and talc. These were replaced as and when. On the first night the flush faile to work and so i called down to the relevant department and within 20 minutes the in house engineer had replaced the flush and gone. The hotel has afew shops selling ornaments and various nick nacks but i am sure you could buy those at half the price in town. The breakfast in the morning is just great and we had a choice of fresh fruit, fruit juices, full English breakfast, eggs made to order, a choice of local dishes which i would recomend you try, fresh croissants & pastries. All this served with a smile always. The swimming pools are very clean and there is a kids pool with a water slide. Outside there is also a swim up bar and a covered outdoor jacuzzi. Past the swimming pool and a 3 minute walk and you arrive at the beach which is good & clean. At the beach there are afew shacks which we did not get to try unfortunately. There were a few hawkers from whom we bought good qualoity T shirts and some cheap jewellery for my daughters friends. Remember to bargain though. On one of the days we organised a banana boat ride and jet skis, this is through the hotel, the shack before you step on the beach to the right. The equipment is good,safe and value for money. In the evening dinner was buffet and serverd on the hotel lawns accompanied by live entertainment. The food is good and there is something for everyone.", "title": "Brilliant Hotel", "helpfulness": 4, "user": "Oxheyred", "date": "April 23, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7418597, "likes": {"liked": "— The room & Staff", "disliked": "— Clean and well equiped"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "One two of the days we took a trips to Panjim and to the Spice Farm. In Panjim our driver took us to Bombay Bazar where we shopped (fixed prices). I bought trousers that were altered and ready for collection within 30 minutes, we also bought ornaments here. We also visited the Xavier's Church. The Spice Farm was an intresting trip, very cheap with luch encluded fr only RS 300.00 per head.", "title": "Sun and Relaxation", "helpfulness": 3, "user": "Paul B", "date": "April 15, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 7363885, "likes": {"liked": "— The Pool", "disliked": "— Large Indian Familes making lots of noise"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Special thanks at the hotel to Farida who is on hand during meal times.", "title": "Loved the Kenilworth.", "helpfulness": 4, "user": "chunkygirl", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7245621, "likes": {"liked": "— Friendly staff", "disliked": "— Nothing"}}, {"rating": 4.0, "title": "\"Monarch Airlines\" people and Russians, but very nice", "text": "By the way check before you stay at the hotel as i was told by the Manager that building work is due to begin to create two new resturants by the reception area. I don't think it effect you as this is area is away from the resturant and the bar.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "March 13, 2007", "id": 7154275}, {"rating": 5.0, "title": "Excellent Hotel to stay in!", "text": "I spoke to the Manager of the hotel who is actually English and pointed out that whilst the hotel is excellent our stay was made beter by the smiling faces of her staff and the service they gave.", "helpfulness": 3, "user": "sunti72", "date": "March 3, 2007", "id": 6906110}, {"rating": 5.0, "title": "Just the right place to be in for a holiday!", "text": "Reached Goa on the 13th of January and was taken by surprise by the grandeur of the Hotel. It was amazing to find that this resort is so huge and virtually on the beach. Me and my girlfriend were planning to go to the carribean but this place was every bit what i could wish for..Received by a very warm and hospitable staff then guided to our spacious room(thank goodness the hotel rooms are carpetless) the rest of the holiday was spent between the huge swimming pool, gym(needed with food that one can eat in the hotel; )) and spa{ofcourse the casino is a nice place but we did not win much; )};great sea food and fantastic spa is what has been the highlight of our holiday, the entire team was always there to help us with our queries..very clean beach to walk bare feet and get a nice tan , must try the Martins corner while you are there, relatively expensive but any day better than those overrated beach side shacks, the hotel one is relatively better and worth one visit..i think we can swear by this holiday to make it the coming year as well...", "helpfulness": 2, "user": "T0urguide", "date": "January 26, 2007", "id": 6698418}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "must recommend you to fix up an appointment in the spa on first day itself otherwise becomes difficult to get one..worth every penny spent over there..must visit old goa and have a look of the church...avoid taking the hotels car..more than exorbitant rates..safer to take the taxi's parked outside...but my friends I must reccomend this goa and resort for a fantastic stay..", "title": "Fantastic Spa Holiday..", "helpfulness": 1, "user": "EssexTravellerEssex", "date": "January 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6630820, "likes": {"liked": "— There were many, the Spa and the Poolside", "disliked": "— The shops, the lobby, hopefully they are renovating this off-season as being maintained by the Hotel staff"}}, {"rating": 1.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Me and my wife checked in to this quaint hotel on christmas day. Most of the day was spent recovering from our Jet lag but fantastic Christmas Dinner.", "title": "Bed bugs ", "helpfulness": 1, "user": "TrueTrip", "date": "January 2, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 6540002, "likes": {"liked": "— pool", "disliked": "— Bed bugs"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The holiday was fantastic, what a man and woman would require on a holiday is available..Fantastic spa, sea food, great beach and a huge pool surrounded by palm tress..me and my wife's entire holiday was spent indulging in these only...very warm and friendly staff..", "title": "Quite nice , not 5 star", "helpfulness": 3, "user": "harpy&james", "date": "October 19, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 5971896, "likes": {"liked": "— The Pool and beach", "disliked": "— Hidden taxes"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "well fellow travellers avoid asking for sea facing rooms as there are none..except a few which are also partially sea view as the staff kept quoting..must try zee bop shack..avoid others except the one that is available within the hotel.", "title": "Staff need hospitality and management training -- big time!!", "helpfulness": 3, "user": "Mystic_hermit", "date": "September 13, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 5798538, "likes": {"liked": "— pool", "disliked": "— Very noisy and loud"}}], "location": {"country": "India", "region": "Goa", "continent": "Asia", "city": "Utorda"}, "stars": 4.5, "variance": {"poor": 22, "average": 44, "very good": 148, "terrible": 31, "excellent": 163}, "aka": "Kenilworth Resort & Spa, Goa Hotel", "slim_ranking": 0.5, "description": "The Kenilworth Beach Resort & Spa is the perfect place for a tranquil retreat surrounded by the pristine beaches and exotic tropical beauty that Goa - the land of sun, sea and sand - is known for. The rooms of this 5-star property are beautifully designed to reflect the by-gone Portuguese era. Tradition seamlessly blends in with all the comforts of modern day luxury to make for a highly relaxing and comfortable stay. Step out on to a private balcony over-looking the Arabian Sea and the beautifully landscaped swimming pool. With impeccable service standards, water sport activities and luxurious spa treatments, The Kenilworth Beach Resort & Spa is a delight for business and leisure travelers alike."}