{"user_rating": 3.5, "review_count": 58, "name": "Khaosan Tokyo Original", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "Lovely hostel. I normally stay in hotels, but wanted to cut the cost in Tokyo so I had more spending money. So glad I chose Khaosan Tokyo. Staff are great and speak excellent English. There is information everywhere on how to get to places and local attractions and trips you can take, but the staff will also help you out. You also get to meet lots of friendly travellers from all over the world in the lounge area (huge tv and DVD facility provided) and on the roof garden. Free internet access (3 computers) also provided. Adaptors, phone cards and towels all sold at reception. Location is fantastic, 5 mins from Asakusa Metro station which links easily to all places. Rooms are small, but what would you expect in somewhere as built up as Tokyo?! Didn't matter at all. Wouldn't hesitate to reccommend to anyone.", "title": "Great location - excellent staff", "helpfulness": 3, "user": "FayeW", "date": "May 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 30082328}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We got the private room that you get to by going through a 4 bed dorm. That was kind of weird, but the room was really nice. There was a bunk bed, a tiny sofa, and a balcony overlooking the river. The other people we travelled with got a private room that was really just a closet with a bunk bed in it.", "title": "Tiny, but great location and super friendly!!", "user": "gnargnasher", "date": "March 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 25784918}, {"rating": 3.0, "stay_parameters": "Stayed August 2008", "text": "Never had to wait for a shower or toilet. The living room/kitchen area was pretty cramped, and always full. There are three computers, and I only got the chance to use them twice in 4 days. I would probably stay here again, if my first choice, The Ryokan Toukaisou, was full.", "title": "Great for backpacker's, not for couples", "user": "CsCJanni", "date": "February 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 24936202}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The staff was very helpful, and spoke English. The location is perfect, just a block away from the Ginza line subway.", "title": "Location + Price = This is it", "user": "jenmito", "date": "February 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13693787, "likes": {"liked": "— Location", "disliked": "— Size of the room"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled with friends", "text": "I recommend it if your not too worried about being in a cramped space.", "title": "Good for youth", "user": "Joker_2007", "date": "January 25, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 12972768, "likes": {"liked": "— reception", "disliked": "— bedrooms"}}, {"rating": 4.0, "title": "great place!!", "text": "this place is really nice and cheap.", "user": "jukoWaterloo", "date": "March 11, 2007", "id": 7012431}, {"rating": 1.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We had a room for twoo and it wasn't so small . The metro is close and with the asakusa line or ginza you can go everywhere .", "title": "DONT BOTHER", "user": "juliephelps", "date": "January 15, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 6597055, "likes": {"liked": "— Leaving it", "disliked": "— Paying for it"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2005, traveled as a couple", "text": "The center of asakusa it's really nice ! with the temple and the shops and you have great restaurants .", "title": "Cheap and Cheerful", "helpfulness": 5, "user": "fashion_hayley", "date": "August 27, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5712582, "likes": {"liked": "— The location, it is central to everything you need in Tokyo.", "disliked": "— The shower's enviromentaly friendly timer got annoying but If your helping the enviroment it cant be too bad!"}}, {"rating": 4.0, "title": "Cheap Place to Stay", "text": "Khaosan Tokyo Smile was a rip off. We gave 24hrs notice to cancel the 2nd night of our stay and the manager forced us to pay a 50% deposit on that 2nd night. My booking receipt from hostelworld.com stated 24hr canncellation and we did just that. The manager of the hostel then pointed to a hand-written sign that asked for 48hrs canx. How can a traveller read a hand-written sign before they arrive? The manager had already kept our passports and we had no choice but pay the 50%. DO NOT stay at Khaosan Tokyo Smile.", "helpfulness": 4, "user": "nyc123zoe55", "date": "August 9, 2006", "id": 5592188}, {"rating": 1.0, "stay_parameters": "Stayed September 2005", "text": "My boyfriend and I stayed here last year and loved it. The place is run by a lovely couple who are very helpful. It is located close to Asakusa station and the beautiful Senso-ji. We had a beautiful view of the Sumida river and the Asahi building from our private room. The private room had a bunk bed and it was more like a walk in closet than what we are used to in Australia, but thats Tokyo for you. We kept our suitcases on the top bunk and slept together on the bottom bunk so we had more room which suited us fine. The place is very clean and has western style toilets. The shower has an annoying water saving nozzle that stopped the water every 15 seconds but it just meant you were being enviromentaly friendly so I was happy with that. The common room was the highlight as we had alot of fun eating hot pot with other travellers, using the free internet and it had a notice board with usefull info. The place had a community vibe and we met alot of interesting people. I highly recommend this place to someone looking for a good cheap youth hostel that lets you experience all that Tokyo has to offer.", "title": "If sleeping rough is the only other option ...", "helpfulness": 9, "user": "MadVinyl", "date": "October 2, 2005", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 2.0}, "id": 3984556}], "location": {"country": "Japan", "region": "Kanto", "continent": "Asia"}, "stars": 2, "variance": {"poor": 6, "average": 9, "very good": 26, "terrible": 7, "excellent": 10}, "aka": "Khaosan Tokyo Original Japan", "slim_ranking": 0.490196078431}