{"user_rating": 4.0, "review_count": 104, "name": "Kihei Surfside", "reviews": [{"rating": 4.0, "title": "Good value; however, there are cautions", "text": "This is my third end-of-year holiday stay at the Surfside. Generally, this place is good value. But be aware of the realities of value-priced South Kihei lodging. Positives: 1) the view is breathtaking; 2) the complex grounds are superb; 3) the beach and nearby snorkling are great; 4) it's convenient. Consider these issues: 1) each unit is privately owned and in various states of repair due to typical 340+ days rented each year; 2) the atmosphere is family oriented and generally noisy; 3) the units do not have washers/dryers - expect to share the coin operated laundry; 4) the small pool is noisy with screaming kids in the mid AM and before dinner; 5) the elevators are noisy re units adjacent - bells for stops at each floor with metalic squeaks and beeps; 6) at least 25% of nights, your cohort residents will return to their units between 12A and 2A, intoxicated and standing in common areas involved in cell phone conversations with far-away girlfriends and/or business partners. The on-site manager is hands-off and refuses to deal with these early morning antics. Summary: it feels like a value-priced ski resort complex.", "user": "traveler4240", "date": "December 29, 2006", "id": 6511130}, {"rating": 5.0, "title": "Best Value for $$ - Great Condo style hotel", "text": "Stayed at the Surfside during 5 days over Memorial Day weekend. After reading the reviews here on trip advisor decided to \"take the plunge\" and was richly rewarded. I picked the Surfside with an expedia package and got it as a package with flight and car. Great great deal for maybe $100 a night or even less.", "user": "smenchio", "date": "November 16, 2006", "id": 6136521}, {"rating": 3.0, "title": "Beautiful grounds, condo needs update", "text": "When we arrived it was after the office was closed, but we picked up our key from a drop box at the hotel and found our room. Basically this was a one bedroom condo with a full kitchen, big bright windows over looking the ocean and a nice patio. Within 1 hour we were sipping champange on the patio!! An amazing beach is across the parking lot with very good snorkling.", "user": "PamTrav", "date": "July 23, 2006", "id": 5498367}, {"rating": 5.0, "title": "BEST VACATION YET", "text": "If you want a great location in Kihei (it's almost in Wailea), want privacy and a quiet time, this is the place. Surfside was built in the 70's or 80's and has been well maintained - however this is not fancy resort living or super high class. It isn't a 300 room resort in Wailea, but it is a great condo for a great price in a great place.", "user": "A TripAdvisor user", "date": "June 5, 2006", "id": 5314309}, {"rating": 4.0, "title": "Had a Great Time!", "text": "Enjoy!", "user": "DrummerBoy_523", "date": "May 2, 2006", "id": 5027822}, {"rating": 4.0, "title": "very relaxing", "text": "we had a family reunion. it was very relaxing and very beautiful. the palm trees looked like it was from a picture from our condo. the room was nice and the locaton was excellent. we all had a great time and will go back again.", "user": "prmailSanMateo", "date": "May 1, 2006", "id": 5025526}, {"rating": 4.0, "title": "Location Location Location", "text": "This place is all about location: a short walk to Keawakapu Beach and right on a great snorkeling point. This place could be about views, too, if you have a unit below the -08s or so. I stayed in a -12 unit and it was fine but I'd have liked a better view for what I paid. The kitchen was very clean and stocked, which is better than other condos I've stayed in. The people are very friendly and down-to-earth. There were small problems with my unit -- coffee maker made lukewarm coffee, leaky showerhead, curtains that didn't open/close easily, broken screen door, not enough blankets -- but these were small things. There's no A/C but the fans and breezes kept us quite cool. The unit included some beach chairs to use, which was REALLY handy. Also parking was close by and easy. I'll probably stay there again, or at the place next door, if I stay in South Kihei again.", "user": "KarenKate7", "date": "February 20, 2006", "id": 4471955}, {"rating": 5.0, "title": "WOW, love this place!", "text": "I just love this place!! Hawaii can be a bit busy with tourists etc. but the Kihei Surfide relaxes you after a busy day of sightseeing. The large lawn area has the softest grass I've ever walked on and provides you with enough room to find a little corner of paradise all to yourself. The view and sunsets are unbeatable from your own lawnchair. I'd recommend grilling at the large double gas grills provided. It is a great way to mingle and meet people from all over the world. Keep in mind this is a condo and not a hotel so you can use all of the facilities at the property. We rented #107 from a friend in Wisconsin and it was recently remodelled. Being on the first floor is convenient to run in and out for drinks, swimming, grilling, etc. The beach in Wailea is right next door and is great for taking long walks. I'll definitely be back ASAP.", "user": "wbrudys", "date": "January 14, 2006", "id": 4352701}, {"rating": 4.0, "title": "Great value!", "text": "You can't beat the location. It's right next to a really nice beach, has great snorkelling right outside the door (with a few resident sea turtles), and a beautiful lawn. All rooms have a great view from the lanai. There's a couple of 4-star restaurants within walking distance. You're just a short drive from shops and restaurants in Kihei and more nice beaches in Wailea.", "user": "Kagbeni", "date": "September 20, 2005", "id": 3924299}, {"rating": 5.0, "title": "Loved This Place", "text": "The room we stayed in was completely adequate - not quite spotless, but very clean. It's possible to sleep four people in a one bedroom unit, but it would be cramped. Although the kitchen didn't have a dishwasher, it had everything else you might want or need (some rooms do have a DW). We had no problem with keeping the room cool despite no AC, as it catches the sea breeze in the afternoon.", "user": "bosco", "date": "May 18, 2005", "id": 3484060}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My husband and I celebrated our 5th year anniversary in Maui July18-24, We stayed in room 210 and we had no complaints! Our condo was beautiful, clean well stocked with everything we needed. I truly recommend to anyone who doesn't mind not having AC and will be spending most of the time outdoors. GREAT VIEW!", "title": "We loved it!", "helpfulness": 3, "user": "castro10", "date": "September 25, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 10003060, "likes": {"liked": "— The beautiful view"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "Stayed in #612, Sep5-11, 2007", "title": "Simple, clean, elegant condo with stunning view from lanai", "helpfulness": 8, "user": "Nineveh", "date": "September 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8722047, "likes": {"liked": "— Clean, functional, great view", "disliked": "— nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "1. Condo was very clean. Lots of towels, blankets, utensils (even a rice cooker!) , cutlery, beach towel, beach umbrella, personal rain umbrella. Basic spices.", "title": "OK Stay", "helpfulness": 10, "user": "jp1051", "date": "August 9, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 1.0, "value": 5.0, "rooms": 2.0, "location": 5.0}, "id": 8380774, "likes": {"liked": "— Location/Grounds", "disliked": "— Noise and dirty rooms"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "2. Fridge, microwave, and especially dishwasher seemed brand new.", "title": "stay away from unless you know the unit", "helpfulness": 3, "user": "sidewards", "date": "July 30, 2007", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 8256079, "likes": {"liked": "— Getting out of the room and onto the grounds for the view", "disliked": "— Needs renovation, soundproofing or A/C and a few thorough cleanings!"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "3. Very nice kitchen. Granite top, island-style.", "title": "Great Location", "user": "ontheroadagain65", "date": "July 27, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 8241518, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Just got back from a week and a half at the Kihei Surfside. We stayed in room 610 (top floor) a 1 bedroom /1.5 bath. What a perfect location! Great view of the ocean, Kihei, West Maui, and Moloka'i and you are right next door to Keawakapu Beach (check out the Mana Kai webcam for partial view of the beach). If you are closer to the ocean, you may also have a view of Lana'i and Molokini. This is a condo location and is by nature like an apartment building. The \"noises\" on the 6th floor were negligible. There are other people staying there and one must expect to hear \"noise\". I recommend not getting a room near the pool or near the elevator (rooms that end in 7 or 8 I think). The units are individually owned and the quality does vary (please include room # in review). Ours was clean and comfortable but not luxurious. We had no complaints. It had all the comforts of home that we needed and more. The office staff is friendly and helpful. The grounds are immaculate and well maintained. We thought that we got a great deal at $165/night compared to what you pay at other places that don't even have the same great location. It is not directly on a sandy beach but on a rocky reef. This makes for excellent snorkeling with a large variety of fish. We saw more fish there than on our dive. We would definately stay at the Surfside again if we returned to Maui. It was perfect for us.", "title": "Great Spot", "helpfulness": 1, "user": "dc714", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8219383, "likes": {"liked": "— the location", "disliked": "— the hard bed"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled on business", "text": "After reading the mixed reviews on TA, I was worried about staying at the Surfside. As it turned out, there was a huge problem with noise, and there were some other problems with our unit.", "title": "Noisy and Run-down", "helpfulness": 1, "user": "HuntingtnBeachGidget", "date": "June 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 7899331, "likes": {"liked": "— Location near Keawakapu Beach", "disliked": "— Noise"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "Although we knew, thanks to TA, to request a unit away from the elevator, we still heard people talking, yelling, and running around loudly all night long in the corridors. The parking lot noises - car alarms, horns honking, and motorcycles racing around - were amplified by the way the building curves around the parking lot, making a natural amphitheater for the noise. There is no air conditioning, and we never need it as long as we can keep windows open. The problem here is that, with windows open, you will hear all of the noise and be awakened by it all night long.", "title": "Good location but many negatives", "helpfulness": 3, "user": "odd3", "date": "March 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 6917629, "likes": {"liked": "— Location", "disliked": "— No air conditioning; noisy; dirty"}}, {"rating": 4.0, "title": "Quiet, friendly, relaxing", "text": "Our unit, on the 3rd floor near the ocean side, had carpet that looked like it had been replaced very recently, yet it had numerous large stains. The garbage disposal and, more importantly, the deadbolt did not work.", "helpfulness": 5, "user": "SueBen", "date": "January 18, 2007", "id": 6613490}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We aren't people who expect luxury (at a cut-rate price), but the Surfside offers too little to be worth their prices.", "title": "Loved it, loved it, loved it", "helpfulness": 1, "user": "Paradise360", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6598324, "likes": {"liked": "— Location"}}], "location": {}, "stars": 2.5, "variance": {"poor": 4, "average": 9, "very good": 33, "terrible": 4, "excellent": 54}, "aka": "Kihei Surfside Hotel Kihei", "slim_ranking": 0.145161290323, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}}