{"user_rating": 4.5, "review_count": 111, "name": "Kikoti Tented Camp", "reviews": [{"rating": 5.0, "title": "Luxurious wilderness \"camping\" at Kikoti", "text": "After a long drive from Arusha on very rutted roads & seeing our first elephants up close, we arrived at Kikoti with a warm welcome, refreshing wet face cloth, & yummy juice. Danny gave us a thorough overview of the camp as well as safety tips. The very friendly & smiling Maasai brought our luggage up into our lodge - roughing it? I don't think so. An \"Out of Africa\" feel with satin throw pillows, warm colors, great linens, draped mosquito netting set up at night, 2 sinks, shower \"stall\", & separate toilet. Night sounds were enchanting. Meals were freshly prepared with quality ingredients & breakfast was complete with an omelette station! So picturesque with covered open air lounge/bar area. Being close to Tarangire was wonderful & we saw many elephants - these magnificent animals must be protected from the ivory poachers. As our t-shirt says, \"ivory only belongs on elephants.\" It's a wonderful park & having water year round assures good populations of animals. We also saw many zebras, impalas, giraffes, leopard with 2 cubs, buffalo, & many birds. Danny, the new manager, has many exciting plans & is passionate about protecting the elephants' habitat & future. This became our favorite lodge during our 11 day Roy Safari trip! Please consider donating to the non-profit African Wildlife Trust.", "user": "A TripAdvisor user", "date": "August 30, 2013", "id": 174904271}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Great way to experience a tented camp with the luxury of you bathroom! The camp is located 20 munutes drive from a side gate of Tarangire National Park. It has a great wilderness feeling. Rooms are bungalow on stilts each with itd own terrace with great sunset view. Though rooms are quite big, they can only fit 3 beds each, so children will have to share a bed. As a matter of fact the bugalow are quite distant one from the other and in the dark (after 7pm) it is not safe to walk unaccompanied. You need to signal with the light for one of the Masai gaurd to escort you (he usually has a shotgun). Animals roam around at night, so it is not for the children to be left alone. Service is great, food amazing, both at breakfast and at dinner. There is a fire in the common area for a \"bushman TV\" experience. No plugs in the room (though there is electricity thanks to a generator) and no internet except in the office area (it did not work when we were there).", "title": "Real Africa expeience", "user": "Simona H", "date": "August 29, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 174596684}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Kikoti is a truly beautiful camp - if you look on a map you might feel worried that it's technically outside of the park but as there are no fences this really doesn't matter! The views are amazing and you really feel like you're in the heart of the bush. We absolutely loved the food and all the staff were incredibly friendly. We had incredible ele viewings and I'd say Kikoti is the perfect base to explore Tarangire from.", "title": "Fabulous camp", "user": "JHP1980", "date": "August 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173697269}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Hearing the magic noise of Africa in your chalet luxury \"tent\" has been a fantastic experience! The managers and the staff were the friendliest in the very friendly Tanzania. The chalet tent was very clean and fine, the food was the best in the whole trip. The Massai even did a fire lighting ceremony for us. What I would not expect, even the Internet connection was quite good. We saw hundreds of elephants in Tarangire. Of all lodges and hotels, we liked Kikoti the best.", "title": "Most interesting camp!", "user": "VilagVandor1", "date": "August 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170785653}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We got a warm welcome upon arrival, after a day-long drive. It was by far the friendliest place I've stayed in, while in Tanzania. The \"tents\" are houses on stilts and are very clean and comfortable, even though I'm not the camping type. The setting is in the wild without a fenced in boundary around the camp but you get to experience it without having to rough it.", "title": "Best service in Tanzania", "user": "Sylvia L", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169517736}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Drove most of the day from Arusha to get to Kikoti but once out into the bush, we saw lots, and I do mean lots, of animals on our way into Tarangire National Park and our first night on safari at Kikoti. We were so excited to see our first zebras - two of them standing off in the distance - and our cameras clicked away. A half mile down the road we ran into the whole herd and then we saw elephants, then gazelles, then more zebras, then more elephants, then giraffes. This was our first day and already our breath was being taken away. Early in the evening after many a mile on very dusty and very rutty dirt roads, we arrived at Kikoti Tent Camp. The young couple who run the camp personally met us and saw to our immediate comfort with glasses of fresh fruit juice. Upon checking in we were led to our private \"tent\" which is really a rustic cabin on stilts and it had all the comforts of home. A nice porch with lounge chairs to enjoy the scenery, a comfortable king size bed with lots of covers, plenty of storage space, two sinks with running water, a shower, and toilet. It could not have been nicer. All the food is buffet style but it is cooked fresh and is delicious. Before dinner, an inviting bar area has comfortable couches to lounge on and enjoy a cocktail or Kilimanjaro beer. Dinner is served outside under the stars while a roaring fire blazes in the fire pit. After you tell the staff what time you want to rise so they can build your fire for hot water, a member of the staff guides you back to your tent with a flashlight and is on the lookout for any wild animals. It is so dark that you will see more stars than you have ever seen in your lifetime. Since it is quite cool, even cold during July, a nice surprise when you go to bed is the hot water bottle that has been placed between your sheets. If you want to experience Africa like you have probably dreamed it would be then Kikoti Tented Camp is a terrific place to start.", "title": "Amazing oasis in the middle of the Tanzanian wild.", "helpfulness": 1, "user": "Hokie69", "date": "July 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169380828}, {"rating": 5.0, "title": "A great introduction to Safari lodges", "text": "Having flown overnight from London, we spent most of our first day in Africa driving to Kikoti with our Guide. We really didn't know what to expect. We were warmly greeted by the staff and immediately shown to our tent on stilts which was simply furnished. The camp has wonderful views and is located just a km outside the national park. The young couple who manage the camp were friendly and very helpful. The evening meal was good and the staff very attentive. The sound of the bush was extraordinary. Our Safari the next day was incredible. We spent an hour surrounded by a herd of up to 100 elephants who decided to entertain us with bathing, mock fighting and playing in the water. On returning to the camp we decided to take a short foot safari with the camp personel, which was educational and exciting.", "user": "Marshcroft", "date": "July 10, 2013", "id": 167012835}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "This camp is a great place to stay and we would thoroughly recommend it, especially as a first place to stay on Safari. The service is good and location amazing. We have been told that the camp has been recently reburbished and that all profits go towards conservation.", "title": "A lovely camp in a magical setting", "helpfulness": 1, "user": "Rerooney", "date": "June 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 164892525}, {"rating": 5.0, "title": "An Enchanting Setting", "text": "Very few drawbacks here. The tents are comfortable and the setting is superb. Good friendly service. I hope they can eventually supply 24/7 hot water, and better coffee with genuine milk, but as I indicated these are modest cavils. I would gladly return.", "user": "Al6244", "date": "June 17, 2013", "id": 164304660}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Kikoti may well have been our favorite place to stay in Tanzania. It offers a way of experiencing the wilds of Tangire in a setting respectful of the natural setting but without roughing it too much. The staff is exceptionally welcoming and includes Masai men and women eager to share their culture. The tents are actually cabins on stilts with comfortable beds, running water and electricity.", "title": "Incredible ... unbelievable", "user": "LivingNature", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163865893}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Four of recently stayed here. First, I have to say that the food here is great. Even though it's generally served buffet style it is just excellent. Some friends of ours stayed here last year and weren't impressed with the food so maybe there's been a change of chefs since then.", "title": "Feels Like A Real Safari", "user": "travelman1370", "date": "September 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 178071295}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "This camp is different from many camps in that the camp is not fenced in, meaning that the animals can wander through the grounds if they decide to do so. While you're free to walk the paths during the day, at night a Masai has to accompany you to your cabin. The cabins are located on stilts and generally seem to have a very nice view. The cabins have a thatched roof but the interior is canvas. There are no electrical outlets in the cabins but there is a \"charging station\" up by reception where you're free to leave things charging. Electric lights are available in the cabins at night starting around dark; supposedly the power goes off sometimes during the night but we never had a problem with this, probably because we were fast asleep.", "title": "Beautiful lodge, friendly staff and great food", "user": "Fatima W", "date": "September 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177492082}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff seemed interested in their work and their guests. Dinners are served in the dining area which is open air but has a thatched roof. Sometimes the tables are moved out onto the patio/fire pit area for meals, which is really very nice.", "title": "A real find", "user": "LadyGAxbridge", "date": "September 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 177237561}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We generally really enjoyed our time here. While here we really felt that we were \"on safari\". However, there are some things you need to know about the camp:", "title": "My favorite stay in Tanzania!", "user": "Rachel W", "date": "September 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 176178666}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "One thing is that the hot water is supplied to the cabins by someone going to the back of each cabin twice a day and building a small fire in the contraption they have. It heats the water up and it seems to stay hot all day. We never ran out of hot water (there were two of us in the cabin). However, sometimes when the wind was right, some of the smoke from the fire would blow into the cabin for periods of time. It certainly wasn't strong but if smoke bothers you then you need to be aware of it.", "title": "A very unique stay with outstanding facilities and staff", "user": "Katy R", "date": "September 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 175692614}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "I think this tented camp was my favorite lodging place in Tanzania. It is operated by a darling young couple who are intent on making your stay perfect. The \"tents\" are actually cabins on stilts, with a large covered front porch, beautiful furniture in the main room and luxurious bath fixtures. Hot water and electricity make this seem far from anything that could be called a tent.", "title": "This is a tent???", "user": "Ljenks99", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157803581}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "The mornings began with a staff person calling into me that my coffee was ready. A wooden tray with a coffee pot, cup and creamer would then be placed on the table on my front porch.", "title": "Amazing time at Kikoti Camp....in the land of the Baobabs!", "user": "katherineg485", "date": "April 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156877658}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The camp treated us to a cocktail party in the bush one evening, where we watched a spectacular sunset over the Tarangire National Park. One afternoon, we were led by a Masaii on a walking safari from the camp. It was very fun and extremely educational as the Masaii found numerous animal's footprints, signs of blood and a hyena's cave with fresh bones. On our last morning, we were driven to an overlook where we watched the sun rise as we were served made-to-order omelettes, fresh fruit, pastries, coffee and juice.", "title": "LOVED, not liked our time at Kikoti!", "user": "1sayoung22", "date": "April 5, 2013", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 156671582}, {"rating": 5.0, "title": "Fantastic luxury in a remote location", "text": "In the camp, the food was delicious and plentiful.", "user": "malstonbury", "date": "March 11, 2013", "id": 154289176}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "My only complaint is that they did not accept credit cards, whereas all the other lodges do. In addition, I was overcharged for my drinks and was in such a rush I didn't realize this until after I had left. That's my fault, though. At all the lodges, since they don't have computers to keep track of the charges, it is important to double-check what you are being asked to pay for.", "title": "Fantastic lodge in great park", "user": "Bl19uk", "date": "March 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 154006174}], "location": {"country": "Tanzania", "region": "Arusha Region", "continent": "Africa"}, "variance": {"poor": 1, "average": 8, "very good": 24, "terrible": 0, "excellent": 78}, "aka": "Kikoti Tented Camp Hotel Tarangire National Park", "slim_ranking": 0.315789473684}