{"user_rating": 3.5, "review_count": 745, "name": "Kingfisher Bay Resort Fraser Island", "reviews": [{"rating": 4.0, "title": "kingfisher bay well worth it", "text": "we stayed at the kingfisher bay resort for two nights and my wife and i thought it was excellent, the only thing that let us down was the fact that we could,nt go swimming in the sea(box jellyfish) but that was,nt the resorts fault, but the pools and a trip to fraser island make up for that", "helpfulness": 1, "user": "ozzysid", "date": "January 19, 2007", "id": 6621925}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled with family", "text": "My husband and I and our 2 Children stayed in a 2 b'room villa. NO AIR-CON, but had everything you need.Deffinately take food, lots of it bcos it will cost you as a family about $150plus per day and that's ordering the cheapest. Nothing to do for kids except for swim bcos everything else costs alot of $$$$. Food in restaurants was very ordinary. Rooms are not serviced and we paid $360 per night!!!!You have to pay to hire snorkels, canoes, fishing rods(which are poor quality and in our circumstance-BROKEN)Most of the previous people who stayed in our villa had commented badly also. We hired a 4 wheel drive so we could actually do something and it cost $260 plus $40 insurance plus $35 permit plus $25 feul only to visit 3 lakes(which were beautiful) but it takes you forever to get to them, very rough drive and wake up next day all sore!We stayed 5nights and wish we stayed home and saved $2500+. Don't go to the coffee shop there, we waited 45mins for 3 toasted sandwiches!!!!!!!!!and no one else was in the shop. DISAPPOINTED also bcos never even saw a dingo.The travel centre said it was a good place to go???", "title": "way too expensive", "helpfulness": 4, "user": "ozzibundygirl", "date": "January 13, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 6588183, "likes": {"liked": "— comfortable beds", "disliked": "— NO air conditioner"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "My husband and I took our two boys, ages 17 and 10 to the Kingfisher Bay for a three day excursion on our way up the Queensland Coast. We did not regret staying here. The ferry over from Hervey Bay was about 45 minutes. The first thing we noticed upon our arrival was the sounds of all the birds and wildlife. Amazing! The resort is very large. There are two really nice restaurants. Make sure you book your meals when you arrive. Because, the complex is so large our villa was quite a walk down to the main building, so if you are elderly or have small children, make sure you request a room close to the main building. We loved the walk. A little creepy at night with all the night sounds of the wildlife. The villa was really nice and had a well equipped, good sized kitchen. We rented a 4x4 for the second day and took a trip to Mackenzie Lake and drove on the beach. This is a must to do! My husband really enjoyed this part of our stay. Three days is not enough. I would recommend atleast five days and book a two day 4x4. They have three pools and they are all beautiful! I would go again!", "title": "A great Experience!", "helpfulness": 1, "user": "cher1969", "date": "January 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6562382, "likes": {"liked": "— The pools!", "disliked": "— Nothing!"}}, {"rating": 2.0, "title": "Mice and Lizards ...oh and sand flies!", "text": "Stayed here 2 nights as part of a tour. We stayed in the Eco Lodges where there are approx 6 quad share rooms with bunkbeds in. The 2 bathrooms for each sex which have 2 showers and a toilet.", "helpfulness": 1, "user": "Milky82", "date": "December 30, 2006", "id": 6520118}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The rooms were basic with bunkbeds and a wardrobe. The kitchen area is great to hang out in with basic facilities i,e, fridge to keep beer cold !!", "title": "Great location - food ordinary...", "helpfulness": 6, "user": "relaxed_traveller1", "date": "December 1, 2006", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6315323, "likes": {"liked": "— Location Location Location!", "disliked": "— Good accommodation, great location let down by food..."}}, {"rating": 2.0, "title": "kingfisher", "text": "Have had 10 trips to fraser have camped, stayed at kingfisher, private houses etc, in my view kingfisher is overrated way too expensive and on the wrong side of the island, for overseas visitors all the attractions on the island are a long way <can be full day trip to say champagne pools, waddy point, etc> note fuel is around $1.60 per litre in a 4wd you will use approx one litre per 5klms easy to spend $100 per day on fuel alone on day trips from kingfisher. Dont forget you may only average 10kilometer per hour on inland tracks from kingfisher so it is possible to spend say 7hrs driving in an 8hr day, It is much much better value to rent a huge modern 4 bedroom home from $700-$1100 per week fully equipped and better located, share this between 2 couples very cheap. Also other restaurants, bars, hotel, bands etc are on the other side of the island nowhere near kingfisher.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "April 29, 2006", "id": 5019037}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "In addition it used to be the case that if you rang kingfisher from fraser island <yes mobiles work at various points on the island> you got your accomodation at apporx half price certainly less than offered on this site.", "title": "Exceeded Expectations, Give it a Go!", "helpfulness": 14, "user": "LizCalifornia", "date": "April 3, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4895098}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "After reading the mixed reviews the day before we left (too late to change now!) we were ready for anything, but were pleasantly surprised. Check in at the harbor went smoothly, the ferry ride was fun, check in at the hotel was a breeze (along with refreshing drinks) and our room was spacious, clean and smelt fine. No bugs reported, the sliding doors worked great, and as we sat outside overlooking a small pond, we enjoyed the entertainment from flocks of lorikeets, and numerous water birds. Perhaps because we were there mid-week, there were not many people, the pool was uncrowded, and Seabelle's food was reasonable, although the service was slow. Rangers and desk staff were extremely helpful -- we even went for our promised after dark wildlife hike in the pouring rain, with large umbrellas and an enthusiastic frog fan ranger.", "title": "amazing time", "helpfulness": 11, "user": "msalden", "date": "February 20, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4472459}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We have just come back from a 5 night stay at Kingfisher Bay for our honeymoon & it was just fantastic. We stayed in a self contained 2 level/2 bedroom Pandanus Villa with a spa bath on the deck. The villa was excellent, very clean & tidy & all the amenities you could need.", "title": "The best time", "helpfulness": 4, "user": "BB03", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6008286, "likes": {"liked": "— Setting of the villa & how well set up it was", "disliked": "— I like a few more luxury toiletries"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We had a couple of buffet breakfasts in the Maheno restaurants which were good, but I would go for the cheaper continental option if you are happy with lots of fresh fruits, cereals, pastries, muffins etc. We also had one buffet dinner (not a seafood night) in the Maheno, and while it was nice, if you aren't into the \"all you can eat\", it costs a bit more to have sensational food in the Seabelle a la carte restaurant. We ate there 2 nights & the service & food were great. Mains are around the $30 mark. You definitely need to book for dinners in both the restaurants - especially the Seabelle.", "title": "An amazing experience", "helpfulness": 6, "user": "Foodforfriends", "date": "September 4, 2006", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 5768126, "likes": {"liked": "— Scenery", "disliked": "— Basic facilities"}}, {"rating": 5.0, "title": "Wilderness Luxury", "text": "We also sampled lots of the cocktails - delicious!", "helpfulness": 7, "user": "AntBonBon", "date": "August 17, 2006", "id": 5620440}, {"rating": 2.0, "title": "Not Worth It", "text": "Cafe priced food was available from the Sandbar & we also ordered lunch from the pool bar which was delicious.", "helpfulness": 15, "user": "A TripAdvisor user", "date": "May 24, 2006", "id": 5205350}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4, "variance": {"poor": 105, "average": 141, "very good": 264, "terrible": 64, "excellent": 171}, "aka": "Mercure Kingfisher Bay Resort Fraser Island", "slim_ranking": 0.333333333333, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Nestled in the bush overlooking the calm waters of the Great Sandy Strait, this award-winning ecotourism resort on World Heritage-listed Fraser Island caters to every whim. It is the ultimate relaxing getaway providing an exciting wilderness adventure, a romantic paradise, a fun, family holiday or an island conference retreat. Kingfisher Bay Resort is the perfect base to explore Fraser Island, the world’s largest sand island - famous for its ancient rainforests, spectacular fresh-water lakes, remarkable wildlife and stunning Seventy Five-Mile Beach. After a day spent exploring the island guests are spoiled by the creature comforts. The resort incorporated the 152-room Mercure Kingfisher Bay Hotel, more than 100 self-contained two and three bedroom villas, and a 174-bed Wilderness Lodge for groups. Hotel Resort rooms have large private decks with bush or lake views and well-appointed bathrooms, some with spas. Bedding is queen plus a king single. Maximum of three adults or two adults and two children. Air-conditioning, Television, Hairdryer, Iron and ironing board, Fax/Modem Line, Tea and coffee making facilities. Self-contained two and three bedroom villas sleep from five to six people. All have private decks (some with spas), fully equipped kitchens, laundry, iron and ironing board, bath and shower, fans, TV, clock radio, fax/modem line and telephone. Microwave and dishwasher on request. Resort Rangers also guide a variety of four-wheel-drive coach tours or personalised tours of the island."}