{"user_rating": 4.5, "review_count": 678, "name": "Kingsmill Resort", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "I wanted to write to give couples traveling without children a heads up. This place seems more geared for families with children. My husband and I planned a getaway here without the kids and were diappointed to see children and double strollers everywhere, not to mention the fact that we had a family staying above our room, and had to be awakened to the opening and closing of sliding glass doors in late evening and early morning(6:00a.m). This defeated our purpose of getting away for some peace and quiet and being able to sleep in. I even told the guy, with whom I made reservations with weeks in advance, that we would be getting away from the kids. In my trip to the spa for a massage appointment, there were even children throughout the changing area/ showers/ steam rooms. I do not recommend this place if you want a quiet relaxing get away from children.", "title": "Not the place for a romantic getaway!", "helpfulness": 8, "user": "vbn8tive", "date": "April 27, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 5.0}, "id": 5013506}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "My wife and I spent the past weekend at Kingsmill. This was our first time to the resort. We booked the \"Links and Luxuary\" package. This allows each guest one night stay and either a spa treatment or a round of golf. Upon arrival we were upgraded by the very nice lady at the front desk. We had booked a golf course room and were upgraded to a river view room.", "title": "Loved Kingsmill", "helpfulness": 10, "user": "ewing384", "date": "March 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4722353}, {"rating": 2.0, "title": "Sorry Spa's booked ugh!", "text": "The room was very clean a very comfortable. It had a good view of the James river. The bedding was very soft and many pillows. Wireless internet access was also very useful. The bathroom was well stocked with all the essentials as well as other items not usually included in most hotel rooms. My wife and I were very happy with our room.", "helpfulness": 5, "user": "themizmom", "date": "March 20, 2006", "id": 4718520}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "I played golf at the River course and the Woods course. The final three holes on the River are awsome and very difficult. That made the round. The course was in pretty good shape for March. I was a little dissapointed with the River course overall. I thought the Woods course was better (no 80's looking condos lining the fairways). The Woods course had some really good holes (9 and 18) overall the course conditions were better than the River.", "title": "Birthday Memories", "helpfulness": 6, "user": "Newenglandhome", "date": "February 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4563511}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "I can't speak to how nice the spa was but the wife loved it. She had the Mother-to-be massage and a facial and she was very impressed. She spent almost the entire day at the spa on Sunday with these two treatments. Used the showers, the relaxation room, the pool and everyone was wonderful.", "title": "Sleep Haven", "helpfulness": 11, "user": "Mom45", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4318745}, {"rating": 5.0, "title": "Great Stay, nice surprise considering some of the other reviews", "text": "Just returned from a 9 day stay at Kingsmill on a Dream Vacation Package. My kids are 7 (girl) &14 (boy) years old. Very concerned about my stay pretrip due to TripAdvisor reviews, but I could not make other accomodations for the dates we were traveling. Arrived to find a property that is configured very similar to a time share. The suite was 1st rate in all ways except noise insulation. That is a problem, but never truly interfered with our stay. I found the people at the resort and the surrounding town to be typical for the area. They are not extra friendly like you might expect in the South, but they are not rude and are actually quite efficient in delivering service. Kingsmill is more of a country club community with upscale suites and not a \"true resort.\" Also the resort ammenities are scattered around the Kingsmill property and not within walking distance. The area is beautiful well laid out community with efficient transportation to the parks and very enjoyable. As for breakfast - there was always a wait, but they did take names and get people seated as soon as a table comes available with adequate seating for the party - regardless of paying by voucher or cash. Also the food at the resort including breakfast was excellent. The breakfast buffet included made to order omlets daily. The view from the dining areas to the James River and across the golf course are relaxing. All in all the trip was a bit costly - but we had an exceptional time both at the resort and in the Williamsburg area.", "helpfulness": 8, "user": "ob1moses", "date": "July 4, 2006", "id": 5425409}, {"rating": 1.0, "title": "Poor Customer Service, Paper Thin Walls", "text": "My husband and I and another couple stayed at the Kingsmill Resort & Spa over Memorial Day Weekend. We were in a two-bedroom king suite along the 9th hole of the River Course. Upon checking in, we overheard a couple checking out ahead of us at the front desk saying that this was the worst experience of their lives and that their room was dirty, missing toilet paper, and the coffee pot was broken. Luckily, when we got into our room it was clean and all items were in working order.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "May 31, 2006", "id": 5287580}, {"rating": 5.0, "title": "Greatest Weekend Ever", "text": "Everything was going fine for us up until the people upstairs arrived late Friday night.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 15, 2006", "id": 5077527}, {"rating": 2.0, "stay_parameters": "Stayed April 2006", "text": "They had two small children and were quite loud. We could hear every footstep and conversation until they finally went to bed at 1 a.m. When we complained to the front desk they acted like they’d never heard this complaint before and refused to move us. We were able to finally get $100 off our bill after a long argument.", "title": "Beware Of the Giant Bees!", "helpfulness": 14, "user": "affluent_traveler", "date": "May 5, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 5036313}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "Saturday night when we went to Moody’s Tavern (on the resort property), there were children running around the bar area. Having no kids and looking for a peaceful weekend, we were not too happy. We were under the impression that it is against state law to have minors in a bar – apparently not at Kingsmill.", "title": "Enjoyed the golf & the spa. Room walls a little thin.", "helpfulness": 3, "user": "Happy_TravelersNY", "date": "April 30, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5020646}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We stayed in a one bedroom suite. The suite consisted of a master bedroom, bathroom, utility room and a very generous open plan kitchen/dining room and lounge. The quality of finishes, furniture was very high and the kitchen was well equipped. We certainly didn’t notice the “paper thin walls” referred to by other reviewers and found the resort very quite. The sporting facilities were excellent as were the restaurants. We would certainly recommend eating in the Bray Bistro. We ordered room service on one night to make the use of our own dining room and found that to be excellent as well. The staff were professional and friendly and we would certainly recommend this hotel highly.", "title": "First Class", "helpfulness": 8, "user": "John H", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 5615294}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We stayed at Kingsmill for one night last week. I had requested an early check-in, and our room was ready for us at 10AM! It was so nice to be able to leave our things in the room while we went to Busch Gardens for the day. Upon returning to the resort that evening, we had a late dinner at Regatta's, which was pleasant.", "title": "Excellent as expected", "helpfulness": 4, "user": "novachick", "date": "August 8, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5577552, "likes": {"liked": "— The location", "disliked": "— Front desk staff could have been more friendly"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Very pretty property, and we loved the villa style of the rooms as well as the upgraded linens, coffee, and toiletries.", "title": "We Love this Place", "helpfulness": 10, "user": "elsbells63", "date": "August 7, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5576448, "likes": {"liked": "— Location and amenities", "disliked": "— Sofabed was not comfortable"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Unfortunately, because of our very short stay we didn't get to take advantage of the spa or other activities. I would love to stay there again for a longer period of time to experience it all.", "title": "Return visit was better than the first!", "helpfulness": 7, "user": "slc64", "date": "August 4, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5558810, "likes": {"liked": "— convenience", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "Kingsmill is fabulous. We've been to Williamsburg with our family many times and each time try a new hotel...2 years ago we drove in by mistake and tried a restaurant and were very impressed so the next year we decided to check out lodging packages and were pleased to see good value for the $$. Everything about this place is great...the room with the featherbed, the sumptuous buffet breakfast (included), the amenities are endless and the shuttle and VIP passes to the parks, great restaurants...need I go on? The only thing I haven't tried is the spa which I will try next time I go. It's great for families and couples alike.", "title": "Wonderful location, Great Staff, Very Relaxing!", "helpfulness": 10, "user": "lovelytan", "date": "July 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5477017}, {"rating": 4.0, "stay_parameters": "Stayed December 2005, traveled on business", "text": "I have stayed in many upscale hotels and found this on par with the rest. I found the room to be clean with good daily service. All of the staff was helpful and courteous. Only ate at regattas and found the food to be fine. Dijon mustard salmon was great! Was too cold to play golf but sure would have liked to. The area was very pretty. Our room had a king bed, desk, nightstands, and chair. Bath was nice and all was in good shape. The walls are thin as noted on this site. Generally quiet but could hear a cell phone conversation without problem. So watch out you two. You know who I'm talking about.", "title": "A nice place", "helpfulness": 8, "user": "local_yokal69", "date": "December 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4164346}, {"rating": 5.0, "title": "First Class!", "text": "Our family (2 adults, 2 teens)stayed here Oct. 21-23. We wanted to catch 1 of the last weekends at Busch Gardens and knew right away we wanted to stay at Kingsmill. Two years ago we stayed at a chain hotel that was a filthy dump. This time we weren't going to take a chance. We booked a 1 bedroom villa. As soon as we arrived, we knew we made the right choice. The lobby was gorgeous and the clerks and concierge we very courteous and efficient. It was lunch time so we decided to eat in Eagles. It was delicious. Then it was on to our room, where we were delighted to find Kingsmill's deluxe amenities, luxurious robes, coffee in the kitchen, 2 TV's and other details too numerous to mention. Our only complaint (albeit minor), was that my husband and kids were turned away from the DRIVING RANGE for not having proper golf attire (they were wearing jeans). We certainly do understand and abide by course dress codes, but I thought that was a little extreme. It was JUST the driving range for heaven's sake.", "helpfulness": 4, "user": "jjsmom6867", "date": "November 8, 2005", "id": 4094358}, {"rating": 5.0, "title": "Wonderful Wedding Night", "text": "We spent our wedding night at Kingsmill. We had originally booked a river view room and they upgraded us to a suite. It was huge and really nice. The bedroom was large, and the bed was one of the most comfortable I have slept in at a hotel. The suite had a nice bathroom with great bath products. There was a full living room and kitchen. We didn't get there until about midnight, but my husband checked us in that afternoon, so all of our stuff was there. When we got there champagne and chocolate covered strawberries were waiting for us. What a nice touch! We had to leave pretty early in the morning, but the view to the river was gorgeous. I just wish we could have stayed there a little longer to enjoy the room and view!", "helpfulness": 2, "user": "laurenj31", "date": "November 5, 2005", "id": 4088778}], "location": {"country": "United States", "city": "Williamsburg"}, "stars": 3.5, "variance": {"poor": 32, "average": 58, "very good": 196, "terrible": 25, "excellent": 367}, "aka": "Kingsmill Resort Williamsburg", "slim_ranking": 0.16049382716, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Kingsmill Resort is situated on 2,900 protected acres along the James River in historic Williamsburg, Virginia. At Kingsmill, we invite our guests to experience a relaxing retreat where casual elegance provides the perfect backdrop for a stress‐free getaway. Guest can relax in 425 exquisite villa‐style guest rooms and suites overlooking the sparkling James River. Situated adjacent to Busch Gardens, 5 minutes from Colonial Williamsburg."}