{"user_rating": 4.0, "review_count": 339, "name": "Kingfisher Oceanside Resort and Spa", "reviews": [{"rating": 4.0, "title": "Wonderful in every way!", "text": "Beautiful facility, beautiful location, excellent food, very friendly and helpful staff. The hydropath is delightfully relaxing, great massages. The service is not slow for a high quality resturant, and we were thrilled with the delicious food. Like most spas it is bit expensive, but the quality is high. I'm surprised by previous lower ratings because we were so satisfied with everything and plan to return for our anniversary.", "user": "A TripAdvisor user", "date": "March 12, 2006", "id": 4601981}, {"rating": 1.0, "title": "Terrible restaurant service", "text": "I treated my mum to a Christmas/holiday getaway for one night at the Spa. I have to say that the Spa itself was quite nice and relaxing, and the massage services wonderful. The food was 'ok', but not what I would consider exquisite fine dining quality. The service, however, was absolutely terrible. The server had what appeared to be very little training for the type of restaurant it purports to be. In particular, we felt as though we were being served at a diner, with little to no attention paid to our 'speed' of eating, and absolutely no information provided about the specials, types of wine, etc. I was thoroughly disappointed with the service and complained. I do hope these reviews are eye openers for the management team.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "January 6, 2006", "id": 4329261}, {"rating": 2.0, "title": "Terrible Food - Overrated", "text": "The Kingfisher suffers from overselling itself as a world class resort when it is not.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 5, 2005", "id": 3738776}, {"rating": 4.0, "title": "Spa was fantastic", "text": "The setting is beautiful. However, the rooms, even the updated ones, are getting a little tired looking.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "July 19, 2005", "id": 3682320}, {"rating": 5.0, "title": "Great value - everybody's happy there!", "text": "The food and service in the restaurant is abysmal. Tough dried out omelettes, clueless staff, mixed up servings. BC is kidding itself, if this is a first class tourist hotel. The staff need training in basic courtesy and English. It made me embarrassed for the BC tourism industry. Also, please get a better chef.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 21, 2005", "id": 3490421}, {"rating": 3.0, "title": "Did not feel heard or respected", "text": "The treatments were great, but when I was put in the relaxation area with my robe on, etc. Many staff were going up and down the stairs, apparently trying to attain their cheques. I think the relaxation area is ineffective if people who are not working at that time are meandering about. When I told the staff at the front about this, they seemed indifferent to my comment and I felt bad for saying anything when I left. I would think that these places would welcome feedback; however, I did not get that feeling. The actual treatments and the people who performed them were lovely. It's a beautiful resort and spa, but I think the spa needs more work on representing that beauty, as far as staff and front desk people being more aware and receptive.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "April 17, 2005", "id": 3369476}, {"rating": 2.0, "title": "Not good for romantic getaways, spa service terrible", "text": "We went to this \"spa resort\" in 2001 for our wedding anniversary and booked into their Romantic package. When we first arrived we were very happy with our room, it was a nice large room with a king sized bed and a hot tub bathtub right in the room, so you could look out at the ocean from the tub. Very nice.", "helpfulness": 24, "user": "A TripAdvisor user", "date": "April 6, 2005", "id": 3338387}, {"rating": 4.0, "title": "Heavenly Water Spa", "text": "The first night we had to contend with having a wedding party staying in the room next to us. They were up until about 2 or 3 am, at least 8 or 9 people on their balcony talking and drinking, which even if we closed our sliding glass door, we could hear perfectly well.", "helpfulness": 7, "user": "adele2653", "date": "November 20, 2004", "id": 2836339}, {"rating": 1.0, "stay_parameters": "Stayed July 2004", "text": "Then at 6:30 am, we were woken up by kids playing on the beach. I suppose on the first floor, beneath the \"romantic suites\" they had family suites or something because there were at least 10 kids running around screaming. Hardly romantic.", "title": "Disappointed, and overated", "helpfulness": 22, "user": "carmena16", "date": "July 26, 2004", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 2323244}, {"rating": 3.0, "title": "Over Rated Facility", "text": "Next, we had booked a couples massage for the next day. Which was to be a massage where the both of us were in the same room. We arrived and they wisked us off to two different rooms. When I told her it was a couples massage, she said she didn't have it booked that way, and offered no apology or even asked if we still wanted the massages. I had also specified that I wanted someone who could do \"deep tissue massage\". What I got was someone tickling my back for an hour, it was TERRIBLE.", "helpfulness": 25, "user": "janice4053", "date": "May 27, 2004", "id": 2121269}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "My husband and I are from Victoria and recently stayed for a 2 night getaway in an Orca Suite with the Hydropath package which also included a three course dinner for two, two breakfasts and 2 hydropath passes.", "title": "Proud This Resort Belongs to Vancouver Island!!!!", "helpfulness": 4, "user": "VictoriaResident", "date": "February 13, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6784469, "likes": {"liked": "— The View and Spa", "disliked": "— Evening Serving Staff (Restaurant)"}}, {"rating": 4.0, "title": "Enjoyed the Kingfisher", "text": "We loved every minute of our stay! The Front Desk staff upon check in was very friendly and efficient, the lobby is very cozy and inviting. The parking was great and close to our room which was nice. The rooms were very well equipped, clean and comfortable. My only comment about the rooms would be they need higher end bedding (duvets and nicer pillows and linens). The linens were very basic for a property like this. The heated floors in the bathroom was a nice touch and the decor is very West Coast. The kitchenette was very well equiped as well!", "helpfulness": 2, "user": "NorthbrookTraveler", "date": "August 31, 2006", "id": 5731464}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with friends", "text": "The livingroom furniture could use updating to a cozier couch however it was very nice, just needs a tad bit of updating.", "title": "had a great time BUT", "helpfulness": 4, "user": "happyfour", "date": "August 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 5726144}, {"rating": 5.0, "title": "Kingfisher is THE SPA to go to", "text": "The Spa, well, can I move in please?? I have been to many spas and this one more than takes the cake! The Hydropath is A MUST, if you miss this during your visit, you have missed out! For only $50 you get the most amazing hour of water therapy and relaxation. The spa is VERY VERY well organized and the staff make you feel so pampered and relaxed. Thank you, I needed it!!", "helpfulness": 5, "user": "QuinnsMommy", "date": "June 22, 2006", "id": 5375043}, {"rating": 4.0, "title": "Unbeleivable Value!!!!", "text": "The breakfast staff were wonderful, friendly but professional. The dinner staff need to take lessons from the breakfast staff. They had little personality and rushed our dinner way, too fast! The food was amazing, however the service was a bit disapointing. The menu has an amazing selection and on the package you can pick what ever you want, there are no restrictions at all. The deserts were FABulous!", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 5006952}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We spent two nights at the Kingfisher resort in one of their regular rooms on the ground floor; the cost was $170/night. The room wasn't what I was expecting from a \"resort\". The room was on the small side and was dreary; it very much resembled a basic motel room that someone had tried to \"fluff\". As with most hotels on Vancouver Island there is no air conditioning in the rooms; our room did have a small window by the main door (which opened onto the parking area) and a sliding door that opened onto the lawn area. While the sliding door did have a locking mechanism that would allow it to be locked partially open there was no screen; since we were on the ground floor I chose not to sleep with the door open. Thankfully there was a small fan that could be used to keep the room from being too stuffy. The bathroom was small and unremarkable. The view from our room was the lawn/garden area and the pool. When we first saw our room we tried to move to a suite but none were available.", "title": "Nothing Special", "user": "travelman1370", "date": "September 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 8619620, "likes": {"liked": "— The flower gardens.", "disliked": "— The dreary room."}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007", "text": "The restaurant was very pleasant and the food was well prepared. We were lucky enough to have a window seat at dinner which offered a good ocean view. The view would have been better had they not built part of the resort on the hillside below the restaurant so that when you're in the restaurant you're actually looking over the roof of the other building to see the ocean; still you do get a good ocean view.", "title": "Incredibly Peaceful Experience", "user": "BPJVancouver", "date": "August 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 8373860, "likes": {"liked": "— Spa/Location/Grounds/Restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The grounds of the resort were remarkable, lawns and flower gardens that were very impressive.", "title": "Ocean view rooms need to be updated but very enjoyable all the same!", "user": "madcritic", "date": "June 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 7967840, "likes": {"liked": "— The restaurant and the spa", "disliked": "— the outdated decor in the bedroom"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I did not make use of the pool or the spa.", "title": "Wood construction = Little sleep", "helpfulness": 1, "user": "IslandRandR", "date": "April 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 7293791, "likes": {"liked": "— The beach front location", "disliked": "— The noise"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "My mother and I stayed at the Kingfisher over a four day period in early June. It is true that the rooms could use a little updating, but overall, the experience was absolutely fantastic. If you are looking for a peaceful, relaxing get-away, at a reasonable price....this is the place for you. The spa services were outstanding - the hydropath is not to be missed. Make sure you actually speak with someone at the spa, if you have questions regarding the different treatments. When I originally booked over the phone, I was given some minor misinformation by the reservations agent with regards to the different types of massages.", "title": "Relaxing time for Software Engineers", "helpfulness": 4, "user": "01Julie", "date": "March 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6907008, "likes": {"liked": "— outdoor pool, hot tub, steam room and sauna", "disliked": "— the spaciousness"}}], "location": {"country": "Canada"}, "stars": 3, "variance": {"poor": 24, "average": 48, "very good": 112, "terrible": 18, "excellent": 137}, "aka": "Kingfisher Oceanside Hotel Courtenay", "slim_ranking": 0.5}