{"user_rating": 4.5, "review_count": 147, "name": "Kisiwa House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This property is tucked away just off the main tourist street of Stone Town (Kenyatta Rd) on a pedestrian-only street. It's near quite a few other similar properties - old mansions converted to hotels in the local style. This particular property is quiet, relaxing and well run with great attention paid to every detail of the hotels construction. Many little common areas are outfitted with gorgeous crafts, chairs, trunks, etc.", "title": "Beautiful hotel in the heart of Zanzibar", "user": "konkoski", "date": "September 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 118577941}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Our room was grandiose (room 9) with beautiful wooden furniture, an oversized king bed and spacious, modern bathroom. The room got lots of natural light with several shuttered windows (opened by cleaning staff during the day and closed during turndown service). A/C didn't make the room an ice box, but cool enough for a good night's sleep.", "title": "Great restored hotel, lovely rooms", "user": "jwatkins0", "date": "September 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 118441533}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The breakfast on the rooftop was hearty and tasty, and the views overlooked the sea. Pretty good coffee, too. They also serve lunch and dinner.", "title": "Great hotel in Stone Town", "user": "Huehuetenango", "date": "September 12, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118019275}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "You should be warned that the Mosque next door had a 20 - 30 second microphoned announcement that was broadcast at sunrise. It was short, but it's not something you can sleep through. We chalked it up to part of the Muslim culture of Zanzibar and welcomed it, but it's worth noting. Any hotel in the vicinity would be able to hear it clearly, as well as the crowing of the many neighborhood roosters.", "title": "\"Peaceful and great location\"", "user": "Cookie010", "date": "August 19, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116924394}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Good location in stone town, very well done restoration/ conversion. Big spacious rooms with good staff. Free wifi advertised but it did not work which was a pity.", "title": "Perfect in every way", "user": "sarkos17", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 116455343}, {"rating": 4.0, "stay_parameters": "Stayed February 2011", "text": "Stayed in rm two. It's noisy (ground floor on street) but not unbearable and after 10 at night everything calms down. The rm was immaculate and the air con a welcome relief. Breakfast was served on the roof terrace and was lovely. The staff were welcoming and the location ideal.", "title": "Lovely room, good value, great location", "user": "JillyLou123", "date": "April 10, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 103542446}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My only bug bear was there was no shower screen/curtain which meant the bathroom floor got v wet when washing!", "title": "HIghly Recomende for your stay in stone town!", "user": "dorda", "date": "April 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103365265}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Good value tho-wld recommend.", "title": "Amazing hotel", "user": "zulutrust", "date": "April 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102791156}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Elegant, Warm And Convenient,", "title": "Clean, new, great location, loved it!", "user": "WanderingCdns", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100792961}, {"rating": 4.0, "title": "Overall a comfortable hotel to stay in", "text": "very beautiful old colonial furniture.", "user": "zf_15", "date": "March 12, 2011", "id": 99865985}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "My daughter and I stayed here for two nights and found it excellent value. The rooms are extremely good (although there is no lift so beware if you have problems with a few stairs), providing all room amenities of a five-star - bathrobes and slippers included. It is well located, and we walked everywhere in Stonetown from the hotel. Management were very accommodating, and we could not find fault at all. Breakfast was plentiful. The hotel is very charming, being a converted typical Zanzibari house.", "title": "Excellent value", "user": "travellersalways", "date": "July 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 115967122}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "I stayed for three days- the place was pretty much as I expected from the photos and comments on this site-- but I paid 165 USD for a room solo in high season, and I find the service did not justify that price. On the good side: the whole place was spotlessly clean and brand new, the location very convenient and quiet, the rooms comfortable with good closet space, an armchair to read or watch TV, bed a bit too firm for me at first but I got used to it, the breakfast food was good with fruit, eggs, juice and toast, the staff friendly and serviceable, the reception staff was very responsive and competent, good free wi-fi, breakfast served on outdoor terrace. But for 165 USD for one person I expect flawless service and facilities, and that's not what it is. The most bothersome incident came during a power cut-- the back up generator sounded like a truck was in my bedroom (room number 4, probably close to it). By 11pm, I asked reception if they could stop the noise at some point--the temperature was very mild below 25 degrees celsius, and comfortable without AC. The night time reception manager refused to turn off the generator, because \"other customers need the electricity\"-- and he hoped the power would come back. Thankully, power did come back, sparing me a sleepless night. But at that price i expect clients sleep to be treated as a priority, at least between midnight and 6am-- even if it means using flashlights, waiting for various batteries to recharge etc. There were many other minor imperfections which to me are not a problem in themselves, my experience was still a very good one, but again I think not quite in line with the pricing. The bathroom is quite barebones, the bathtub plug was broken and i had to call the staff to empty dirty water, the only English language news on TV was Al Jazeera), the service at breakfast was understaffed one morning; breakfast got monotonous as the food was the same every day, contrary to every other hotel I stayed on the island (I would have liked to have a sausage /bacon option, yogurt and muesli option etc). In short, a nice stay, but i think there may be other places worth trying for better value. For instance the Seyyida hotel, where I once went for lunch, has a prime location right next to Sultan's palace, is brand new, and their rooms were 100USD for a single room/ 130 for a double. The only room they could show me as they were full was their \"family room\" -- very elegant and comfy. Also, the lunch food was excellent with a prime view from rooftop terrace.", "title": "Nice but overpriced", "helpfulness": 1, "user": "ploumParis", "date": "July 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 115443416}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We arrived in Stone Town and we were warmly greeted by the wonderful staff at Kisiwa House.", "title": "The best hotel in Stone Town", "user": "bezzzza", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114871782}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The hotel is just off the main road, next to the other big hotels in Stone Town. It is a 2 min walk to Africa House, 5 min walk to Serena Hotel.", "title": "Beatiful hotel with excellent service and food", "user": "CissiB", "date": "June 17, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113978649}, {"rating": 4.0, "title": "Beautiful small hotel in the heart of Stone Town", "text": "We stayed in Room 5 and when we walked in through the door we were blown away. The room was big and beautifully dressed. The bed was covered in flowers and cushions, there was fresh fruit in the room. The bathroom was wonderful, with a big freestanding bath in the middle of the room.", "user": "Keli_SA", "date": "June 14, 2011", "id": 113374992}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed here for one night in room 10.", "title": "Good location, clean and spacious", "user": "NikiVeniVidi", "date": "March 11, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 99800422}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "it was a spacious room, with big four poster bed with mosquito net. Very comfortable. There is a flat screen TV on wall, mini-bar fridge and safe in cupboard, shutters on windows rather that curtains which is in keeping with the area. There is a user controlled air conditioning unit and a separate fan over the bed.", "title": "Excellent quality /price ratio", "user": "potino", "date": "February 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97090105}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "There was free WIFI internet access in the room.", "title": "great hotel - even better service!", "user": "ghuzzi22", "date": "February 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96462660}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "It was clean and recently decorated.", "title": "Wonderful Oasis in Zanzibar", "user": "Rocky006", "date": "February 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96419501}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The bathroom is a large room with a modern free standing bath at one end, two basins, each with mirror and light above, a separate tiled enclosure shower. The bathroom fittings were modern. My only complaint is that whilst the fittings were all new and modern the water supply to the shower was feeble, a real pity after the investment in this bathroom.", "title": "lovely boutique hotel", "user": "quick_draw_mcgraw", "date": "February 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95745454}], "location": {"country": "Tanzania", "continent": "Africa"}, "stars": 5, "variance": {"poor": 1, "average": 11, "very good": 41, "terrible": 1, "excellent": 93}, "aka": "Kisiwa House Hotel Stone Town", "slim_ranking": 0.137931034483, "description": "A luxurious Boutique hotel in Stone Town, Kisiwa House is noted for its elegant blend of Zanzibar décor and gracious Swahili hospitality.Superbly located on a quiet street in the heart of Zanzibar historical centre within easy walking distance of famous landmarks, museums, antique shops and restaurants. Kisiwa House provides every modern convenience to the business or leisure traveller, promising an unforgettable experience of professional service, superb comfort and unmatched elegance.Get inspired, discover the new and unusual. Enjoy the charm of an old and typical Zanzibar town house."}