{"user_rating": 4.5, "review_count": 10, "name": "Kiwanis Oceanfront Camping", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We have stayed at this campground twice and have a week booked here this summer 2013. Each time it has been great the first time was over 20 years ago in a tent just my husband and I it was a great campground close to anything we wanted to see and the town was very nice. It reminds me of Niagara on the lake in Ontario. The next time we stayed there was about 7 years ago we had a tent trailer then and 3 tweens. They were 12,12 & 14 they enjoyed the same thing that brought us to the campground being right across from ocean. The changing in the tides and the close proximity to area attractions. When we go back in July it will be just me and my husband again and we will be in a travel trailer across from the ocean again.", "title": "Kiwanis Oceanfront Camping St. Andrews by the Sea, New Brunswick", "user": "cluffsb", "date": "April 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 156442561}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with friends", "text": "We have camped here 4 times this year and plan on making a couple more trips later on this year. The bathrooms are amazing!! Showers are great always lots of hot water even when there are lineups and lots of water pressure. I took off a star though because when we camped in a tent over Canada Day weekend there was red ants everywheres (back in the woods in the unserviced sites)!! We all got bit by them several times. Even if you are camping in a site along the waterfront there is the chance you could get bit as my husband did right under the eye one morning. Other then that I have no complaints about this campground. It's very well maintained, you can have a tent and camper all set up on the same lot and they don't mind. Great kitchen shelter, and my son loves the playground.", "title": "We LOVE this campground!!", "user": "Becky L", "date": "July 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 133927444}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Very nice campground, spaces are close and on gravel. Restrooms and laundry are extremely clean. We camped here for 2 nights in a motorhome, lots to do in St Andrews, a beautiful small town right on the bay. We got an oceanfront spot but the oceanview ones are just as good. The Kiwanis do a fine job of keeping up the campground. The weather was perfect, blue skies and a warm breeze.", "title": "True oceanfront camping", "user": "Rainin", "date": "June 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 131991507}], "location": {"country": "Canada", "city": "Saint Andrews"}, "variance": {"poor": 1, "average": 0, "very good": 3, "terrible": 0, "excellent": 6}, "aka": "Kiwanis Oceanfront Camping Saint Andrews, New Brunswick, Canada", "slim_ranking": 0.333333333333}