{"user_rating": 4.5, "review_count": 100, "name": "Koder House", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "I was stayed with my parents and sister at this great hotel in Cochin India.", "title": "Serena Spa is Best Day Spa situated in Best Boutique Hotel in the world", "helpfulness": 4, "user": "Kapesa L", "date": "April 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4941558}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We had reached the hotel early in the morning. They offered a complimentary Indian Head Massage to me and my sister. We just walked into Serena Spa which is situated in the first floor of Koder house Hotel.We were welcomed by the Spa Staff in a Traditional way.", "title": "Koder House where it meets Gods Own Country and Heritage", "helpfulness": 2, "user": "rafsha", "date": "March 9, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4595827}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Our experience made us amazing and it was realy a great experience which made us stay at Serena Spa and we booked for Aromatherapy Back massage and Soothing Hotstone Massage.", "title": "Great Boutique Hotel", "helpfulness": 4, "user": "siru", "date": "February 27, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4522646}, {"rating": 5.0, "title": "Beautiful heritage hotel, luxurious and comfortable", "text": "The Therapist are very Professional and Caring with Indian Smiling. Realy the smile of the therapist make us totally relax and rejuvenate. We found the indivitual care at Serena Spa in Koder House.", "helpfulness": 9, "user": "lup", "date": "February 7, 2006", "id": 4440762}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "I spent two nights in a suite at Koder House, and enjoyed the visit very much. The hotel is a former private home of one of Fort Cochin's leading Jewish Families (sadly now mostly gone), but at least their lovely home remains and is open for travellers. Our suite was huge, with a lovely four-poster bed, large dressing room and en suite bath with separate shower and jacuzzi bath. The restaurant was good, but the menu never changed, nor did there seem to be a special of the day (shame), so after two lunches and dinners, we pined for something different. There is a tiny pool just off the restaurant - seems to be a bit of a gimick to me, as we never saw anyone use it. I think the space would be far better having an outdoor area for dining! The tables/chairs in the dining room are huge...but tables are limited, so many walk-in guests cannot be accommodated. With so many new guest houses being opened in the area, Koder House will come under some pressure to add amenities. There is a small spa in the hotel, which offered good treatments at great prices. Staff and service were excellent. One major point - the hotel lacks a bar, and asking for pre-dinner drinks anywhere but in the restaurant proved to be a bit of an undertaking...and they are not licensed for spirits - just wine and beer. A nice touch was the delicious slice of chocolate & orange cake that was left by the bed nightly, with a sweet note wishing you a good night on your pillow. If I returned to Fort Cochin, I would not hesitate to stay at Koder House again.", "title": "Very enjoyable stay - great staff", "helpfulness": 1, "user": "A-and-SLondon", "date": "January 11, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6573994, "likes": {"liked": "— The history, and the size of the accommodation", "disliked": "— lack of bar facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We read all the raves about Koder House on Trip Advisor and so decided to come here for a treat after two weeks traveling around India with our adult kids and staying at cheaper hotels. We booked three rooms and stayed for four days. We came over New Years and so we paid top rates, something like a whopping $1000 a day for three rooms.", "title": "Warm, Comfortable and Expensive", "helpfulness": 1, "user": "newyorkanya", "date": "January 3, 2007", "detail_rating": {"business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 6545473, "likes": {"liked": "— the huge rooms and friendly owners", "disliked": "— the creak floors"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "Koder house is not a boutique hotel in the conventional sense. It is not a hip, minimalist, elegant hotel with attitude. It is an old, wooden house built by one of the leading Jewish families in Fort Cochin and purchased two years ago by Mrs and Mrs Vicky Raj who restored it and tried to keep it looking as it had in the 19th century. I personally found that very welcome. But if you want something more contemporary than the Malabar or the hotel next to Koder House (I think it is called Harbour View) would be better. The Raj's ordered wonderful high, wooden beds with really comfy mattresses and traditional looking light fixtures for the bedrooms. They also put in new bathrooms with jacuzzi and shower and a small outdoor pool where the garage had been. The effect is really a simple, old fashioned one. The rooms are huge and the suites have a vast dressing area. But please note that this is an old house so you hear will footsteps from the floor above. If you mind, then make sure you take a room on the top floor. It's a very personal, intimate hotel with attentive service. We enjoyed all kinds of nice touches: brownies and candy bars and mints on the bed each night, bed tea each morning, a good selection of local papers at reception, broad band internet on the top floor.", "title": "Fabulous experience", "helpfulness": 1, "user": "PenLondon", "date": "December 10, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6357562, "likes": {"liked": "— Fabulous rooms", "disliked": "— Very expensive and not a brilliant restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The location is fantastic and we were able to walk almost every where though we lazily took a car to Jewtown. The staff are polite and reticent but very able. They arranged priuvate boats for sunset cruises (750 rupees an hour for two hours) backwater cruises (750 per person for three hours) airport transfers and made restaurant reservations for us. Of all the places we ate, our favorite was the seafood restaurant (called Fort Cochin) at the Casino Hotel but it was a bit 20 minute drive to get there. (it has a great gift shop and Mrs Raj can tell you where the big branch of Fab India is)", "title": "Perfect!", "helpfulness": 2, "user": "KatieE", "date": "November 7, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6081278, "likes": {"liked": "— Its style", "disliked": "— Not a massive menu"}}, {"rating": 5.0, "title": "Romantic Koder House", "text": "We also liked eating at the open air fish places across the street and in the hotel--though the breakfasts were nothing special. Best of all are the Rajs. They are lovely people and very helpful and knowledgable. We really felt like we were staying with family and it was sad to say goodbye. They are planning to develop two more properties--one on a tea plantation and one at the beach so I know we will be back to see them.", "helpfulness": 4, "user": "Sunit", "date": "November 2, 2006", "id": 6044946}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Firstly let me suggest that you visit Kochi in September - not only is monsoon over and the weather lovely, the hotel prices are way way lower - we only paid 70 pounds for our room at Koder House.", "title": "Ridiculously large , lovely hotel", "user": "Riesling", "date": "January 10, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 12503561, "likes": {"liked": "— The lovely colonial architecture, and beers on the balcony", "disliked": "— It was low season and we were the only guests!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "I won't repeat the other reviews too much, it's a lovely colonial building and the rooms are massive - bigger than my flat in London. The beds were the most comfortable we had in India - with proper thick mattresses unlike the skinny mattresses we saw elsewhere.", "title": "It's nice to be pampered", "user": "Ernest H", "date": "January 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12473494, "likes": {"liked": "— The large spacious rooms and personal service.", "disliked": "— Stairs; there is no lift."}}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "The location is really convenient, walk everywhere.", "title": "Best place in town", "user": "SFreeth", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12315970, "likes": {"liked": "— Hotel decor & location", "disliked": "— Room bit too bare but lovely nevertheless"}}, {"rating": 2.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "The services was pleasant and efficient. We had massages which were nice, as the spa rooms were only a few steps away from our bedrooms.", "title": "Great location but overpriced for what it is", "helpfulness": 1, "user": "pedantique", "date": "November 10, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 10726943, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2007, traveled solo", "text": "One thing I really enjoyed was sitting on the balcony with a beer watching the families in the park across the road.", "title": "Historic, comfortable, outrageously large room", "helpfulness": 2, "user": "ExploreFirst", "date": "October 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10099246, "likes": {"liked": "— Great location, historical, unbelievably spacious, free internet"}}], "location": {"country": "India", "region": "Kerala", "continent": "Asia"}, "stars": 3.5, "variance": {"poor": 6, "average": 10, "very good": 27, "terrible": 2, "excellent": 55}, "aka": "Koder House Hotel Kochi (Cochin)", "slim_ranking": 0.29012345679, "description": "Welcome to Koder House. Koder House is a three-story heritage boutique hotel opposite the beach at Fort Kochi, Kerala, India. Until recently, it belonged to the most illustrious Cochin Jewish family, the Koders. This House had been a host to Presidents, Prime Ministers, Viceroys, Ambassadors, Nobel Laureates, Hollywood Directors and prominent dignitaries. This dwelling also finds a prominent place on Intach's list of heritage sites, and a visit to Fort Kochi is considered to be incomplete without a visit to this historic monument."}