{"user_rating": 3.5, "review_count": 20, "name": "Kolonna Hotel Cesis", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Kolonna is a very well-known brand in Latvia. They have the biggest chain of perfume shops, a leading real estate agency and they recently started building a chain of hotels.", "title": "Nice (But a little generic)", "helpfulness": 2, "user": "angli4anin", "date": "August 13, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8405770, "likes": {"liked": "— Location, cleanliness", "disliked": "— A bit predictable, lack of originality"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "I had read good things about the one in Riga and also the first review of their one in Cesis was also very positive. My research showed no other hotels in Cesis were of international quality, so there really was no question as to where we would stay.", "title": "Mountain Biking in Latvia", "helpfulness": 2, "user": "Russelluk", "date": "May 19, 2007", "detail_rating": {"business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7645295, "likes": {"liked": "— Quality accomodation at a reasonable price in an interesting area"}}], "location": {"country": "Latvia", "region": "Vidzeme Region", "continent": "Europe", "city": "Cesis"}, "variance": {"poor": 3, "average": 6, "very good": 8, "terrible": 0, "excellent": 3}, "slim_ranking": 0.5, "description": "Cesis is one of the most beautiful towns in Latvia with an ancient history and traditions. It has a unique combination of gardens and parks, historical buildings, narrow roadways, wooden houses and lovely squares. Kolonna Hotel Cesis is situated in the very centre of the town, near the city park. The historical scenery of the town is adorned by the Castle of the Livonian Order (1206), Cesis New Castle and St. John’s Church (1284). This hotel was built 1938 and its first name was Tervete. Later it was renamed Hotel Cesis. In December 2005, the hotel became a member of the Kolonna Hotels Group. Kolonna Hotels Cesis offers 40 rooms and can accommodate up to 77 guests. For the guests comfort, hotel offers cozy and comfortable sauna and solarium. The hotel accepts payment in Latvian lats, major local and international Credit Cards: Euro Card/ Master Card, American Express, Visa Card, Visa Electron."}