{"user_rating": 3.0, "review_count": 322, "name": "Krystal Ixtapa", "reviews": [{"rating": 4.0, "title": "Great Christmas Vacation", "text": "Just returned from a 6 day stay at the Krystal during Christmas week (12/21-12/26). I was slightly nervous after reading some of the bad reviews but upon our arrival I am glad to say that my reservations were unwarranted. The double room had a spectacular view with a balcony, as all their rooms do. I've stayed in other hotels around mexico and can say our room was clean, well appointed and in good condition. The location on the beach was great and the pool, which was recently remodeled, was awesome! The hotel was quiet and I saw no loud, drunk 'gringos' roaming the halls as is often the case in Ensenada and Cancun. In additon, most of the hotel patrons were families which was nice. Overall, the Krystall is a great hotel and didn't rate as excellent for very minor reasons (hard matresses) and a problem with an erroneous charge regarding the in-room bar (which was corrected without any problem). Why the Krystal recieved some bad reviews from some people I can't say. I think some people just complain no matter what. My family and I had a great stay, have fun!", "helpfulness": 12, "user": "CalTraveler45", "date": "December 27, 2004", "id": 2946930}, {"rating": 4.0, "title": "hope to go for the rest of my life!!!!", "text": "Staff was extremly freindly. We had such a great time in the pool. The activity directors we're awesome at getting everyone involved in all sorts of fun games and activities. Accomadating staff.", "helpfulness": 4, "user": "dbtrip", "date": "December 9, 2004", "id": 2873950}, {"rating": 1.0, "title": "Very Disapointed", "text": "Rooms had a to die for view, floors a bit hard on your feet but to be expected. We're going again to the Krysatl this January and can't hadly wait. Do go and enjoy yourself to the fullest!!!!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "November 15, 2004", "id": 2826553}, {"rating": 2.0, "stay_parameters": "Stayed November 2004", "text": "Anyone who has plans or reservations please call ahead and chek on the status of the pool. The pool is under constructions and has been since the middle of September. The completion date keeps getting pushed back. the last time I called they said it would be finished Dec 1st. (I don't believe it) They are sending you next door the the Dorado. Apple vacations is not telling anyone about this and is you didn't take insurance your out of luck. We have been going to the Krystal for several years at the same time and have meet alot of people. We keep in touch through out the year. We have all canceled. If I wanted to walk to the Dorado and swim I would have stayed at the Dorado.", "title": "Loud DISCO Land", "helpfulness": 1, "user": "big_eaterDenverCo", "date": "October 29, 2004", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 2.0}, "id": 2795239}], "location": {"country": "Mexico", "region": "Pacific Coast"}, "stars": 3, "variance": {"poor": 54, "average": 69, "very good": 101, "terrible": 47, "excellent": 51}, "aka": "Krystal Ixtapa Hotel", "slim_ranking": 0.607142857143, "description": "Krystal Ixtapa awaits you with 255 recently refurbished rooms & suites, all offering cozy contemporary style, and extraordinary ocean views from your private terrace. You can truly relax with your choice of one of the best beaches or the most spectacular swimming pool in Ixtapa, with its own waterfall & waterslide! Located very close to the golf course, marina, and shopping, you will be able to truly experience all that Ixtapa has to offer."}