{"user_rating": 4.0, "review_count": 424, "name": "Ku' Damm 101", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2006, traveled solo", "text": "The Ku'Damm 101 was a very cool, minimalist hotel in a quiet area, however the hotel itself was not quiet and the neighborhood was inconvenient to most of the sights I wanted to see. One problem that modern, no-carpet, spare hotels seem to have is the amount of noise that carries from room to room and in the halls. Tje first two of five nights I was there I could hear doors slamming all morning and night which irritated me.", "title": "Cool but Inconvenient", "helpfulness": 4, "user": "tvlbug", "date": "September 1, 2006", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 2.0}, "id": 5731880}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The breakfast spread was wonderful and the top floor, sunny location of the dining room was a joy to start the day in. Had the hotel been in a central location, I would still recommend it, but if you are planning to hit the sights and hang out more often in the Mitte section of town, stay somewhere more central. I spent a good 1/2 hour to 45 minutes every day one-way getting to where I wanted to go. I did a lot of schlepping and in the rain it wasn't too pleasant. Their really is not much at all of interest in the local area.", "title": "Perfect Hotel", "helpfulness": 5, "user": "xAbbyx", "date": "August 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5720517, "likes": {"liked": "— The decor, breakfast and location.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2004", "text": "We stayed at the Ku' Damm 101 for 3 nights this past long weekend and had a fantastic time. The location (one 30 minute train from the airport) is great, the rooms were very nice, the breakfast fantastic and filling, and the staff were very welcoming and nice. The Zoologischer Garten is the closest large u bahn and s bahn stop, and you could walk there easily in 30 minutes, or take a €5.00 taxi, or €2.10 bus from practically right outside the hotel. Our flight didn't leave until late the last day and they had a room to store our luggage, which I really appreciated. I would recommend this hotel to everyone. We would 100% stay there again!", "title": "Spartan chic and a good value", "helpfulness": 4, "user": "dtremit", "date": "June 28, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5396516}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Stayed at the Ku'damm 101 in December of 2004, and had a very nice stay. I had booked one of the larger rooms with queen size beds, on an upper floor. I was very impressed with the finish of the space -- it is very austere, but stylishly so, and the design touches (e.g., the stylish subway tile bathroom, light switches integrated into the bed, and cordless phone) were very much appreciated. Christmastime decor was lovely -- practically a forest of fragrant trees in the lobby (undecorated, befitting the sparse decor).", "title": "Great Hotel", "helpfulness": 2, "user": "sean1975uk", "date": "May 6, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5037928}, {"rating": 4.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "The location is not fantastic -- it is sort of at the wrong end of the Ku'damm, and not too close to a subway stop -- but not terrible; there is frequent bus service if you don't feel like taking a few blocks' hike. Breakfast was terrific, with good selections of cold cuts, yogurt, fruit, juices, and various teas, among others -- not sure what others are complaining about.", "title": "Great hotel, refreshingly different", "helpfulness": 4, "user": "impavidus", "date": "April 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 3.0}, "id": 5010026}, {"rating": 5.0, "title": "Ku'Damm 101 - Superb", "text": "Stayed for five nights at the Ku'Damm 101 at the end of March-06 / start of April-06.", "helpfulness": 6, "user": "retep68", "date": "April 11, 2006", "id": 4957607}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Lovely hotel. Excellent rooms, superb breakfast and a great bar.", "title": "Cool, chic hotel with great breakfast", "helpfulness": 2, "user": "unison22", "date": "March 26, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4734180}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Rooms - large, beautifully furnished (might be too modern and minimilistic for some tastes though). Excellent bathroom, very nicely furnished and a great large, walk-in shower (no bath, but not an issue for me).", "title": "Ku'damm Cool", "helpfulness": 3, "user": "BillBurroughs", "date": "March 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4691664}, {"rating": 3.0, "stay_parameters": "Stayed February 2006, traveled on business", "text": "Breakfast - brilliant. Great choice of fresh fruit, cereals, eggs, differnt types of salmon, meat, cheese, breads, juices, teas, coffee etc.... all very fresh and superbly presented.", "title": "Nice \"institutional\" hotel", "helpfulness": 5, "user": "LtColG", "date": "February 18, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 4468621}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "Bar - cool, nicely furnished and great cocktails. Nothing like as expensive as most hotel bars I've drunk in.", "title": "Wonderfull", "helpfulness": 8, "user": "Fuzzboy", "date": "November 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4121761}, {"rating": 5.0, "title": "Well worth a visit", "text": "Just got back from 5 nights in Berlin, we stayed at the K101 and enjoyed every minute of it. The hotel is ideally placed for a visit to Berlin, right on the main shopping strip with all the designer shops you could need. Restaurants are a plenty and you could not go hungry. The breakfast in the hotel is good and you can help yourself which sets you up for plenty of sight seeing. The S-Bahn is a 10 min walk away and bus stops are a few hundred feet away from the front door. The hotel is very clean and modern in its appearance,the staff are 1st class and very helpfull. Free internet in lobby, bar prices are not expensive. Rooms very clean and comfy beds. We will definately pay another visit.", "user": "Fishslice", "date": "November 16, 2005", "id": 4121443}, {"rating": 4.0, "title": "Kool Dam place!", "text": "This hotel is very well thought-out in terms of the service, rooms and amenities. The very stylish, minimalist decor appears to have fallen straight out of the pages of 'Wallpaper' magazine. My room (404) had a very high ceiling and was bathed in relaxing, monochromatic grey-blue colors. The only thing \"off\" was that the gimmicky T.V. that rolls back and forth had left marks on the walls (from a prior guest). Also, I never figured how to adjust the T.V.'s contrast. Bathroom was spare but attractive; the bath head was adjustable for either bath or shower use. The only disappointment in the room was the lack of floor rugs (except for one small one)which gave the floors a Northern European hospital feel. Service was reliable and always pleasant. I booked on ---- and was pleased that the breakfast (about 15 euros) was included in the room rate. A word about the breakfast: it is the best buffet I have seen in any hotel. There are separate stations for coldcuts, cereal, eggs and even vegetarian offerings. Superb quality and, especially, presentation. There is a terrific view of Berlin from this 7th floor restaurant (breakfast only). The lobby bar is lively with guests (mainly Euros) and neighborhood types. There are 2 free internet terminals in the lobby (although no printer!). The location is in a mixed but nice commercial residential neighborhood. I do not recommend this hotel for 1st time visitors since it is a hike to the Adenauer U Bahn station (which doesn't have any direct trains to the prime tourist areas). The S Bahn stop is closer but transfers (some tricky) are still necessary. As a hotel professional (Concierge) I recommend this hotel for repeat and frequest Berlin visitors.", "user": "Steedappeal", "date": "October 27, 2005", "id": 4065867}, {"rating": 5.0, "title": "Excellent choice, superior than 4 1/2", "text": "I was totally impressed by this hotel. We did not expect much but we were blown away when we arrived. The decor is modern and chic, the room was impecable, the location perfect. The beds are very comfortable, the breakfast was delicious. The breakfast coffee was the best I had in Germany (did struggle to like coffe here after spending 3 days in Vienna...). All staff was truly professional. I can only say GREAT things about this hotel. During our trip we stayed at 5 star hotels but this one beat them easily when you compare pricing. We paid $65 pounds per night including breakfast!!! (lastminutetravel). It is super well located. Buses and metro are nearby so do not get deterred when people say that is OUT of the way. It is not. I'll go there again when visiting Belin.", "user": "Veroga", "date": "September 20, 2005", "id": 3925096}, {"rating": 5.0, "title": "Fantastic, one of the best paces we've stayed", "text": "We had a great time at Ku'Damm 101! The room was great, modern and stylish but not austere. The staff were very friendly and helpful, particularly the bar staff. The bar is brilliant, again stylish but not stiff. The breakfast was great, really good range, all well displayed and served. I love it when a hotel has a good choice of breakfast beverages! And really good fruits! And a great choice of cooked eggs etc. And what a view!", "user": "Judith Whicker", "date": "August 24, 2005", "id": 3802847}, {"rating": 5.0, "title": "Great Place", "text": "The location may be a little out of the way for those who aren't able bodied, but if you can walk five/ten mins to the underground, then it's ideal. And the Ku'Damm is a great place for a stroll. Oh, the pleasure of clean, efficient public transport that takes you where you want to go... well, Berlin is a joy, and so is Ku'Damm 101. If you don't stay there, you're missing out. We will definitely stay there again.", "user": "A TripAdvisor user", "date": "August 9, 2005", "id": 3747894}, {"rating": 2.0, "title": "A little out of the way", "text": "First off this is a no frills hotel with no frills staff. It may well be a \"designer\" hotel but when I read \"designer\", I see \"minimalist\" which is what it is. The rooms are spartan and unexciting, and the breakfast is very much \"lite\".", "user": "A TripAdvisor user", "date": "June 8, 2005", "id": 3539340}, {"rating": 5.0, "title": "Very nice architecture", "text": "The other real problem with this hotel is that it is right at the wrong end of the Ku'Damm and not really close to anything, even a subway stop.", "user": "405AB2405", "date": "May 3, 2005", "id": 3434249}, {"rating": 4.0, "title": "Cool cool cool", "text": "This is the kind of hotel that may appeal to people in their teens or early twenties, being as it is an expensive youth hostel. I would not recommend it to anyone looking for a romantic getaway, sightseeing or other holiday. See what rate you can get, and then take something for the same price in Mitte.", "user": "minky35", "date": "April 12, 2005", "id": 3353772}, {"rating": 5.0, "title": "Cool and friendly", "text": "Nice architecture, wonderful breakfast, friendly staff...... very good price!", "user": "HenleyTraveller99", "date": "April 12, 2005", "id": 3352472}, {"rating": 5.0, "title": "very cool hotel", "text": "Simply a great hotel - slightly out of the way from the main area but public transport links are excellent or could probably walk to Zoo Station in 30 mins. Very cool minimalist uncarpeted rooms. Superb bathroom with walk in power shower and 'trough' style sink. Great wardrobe, stylish furniture and lighting. Although first impressions of the room were cold & unwelcoming this quickly changed to being probably the most amazing room we've stayed in. A really cool hotel bar was open til 2am each night - a good place to start or end the night. Very well dressed and friendly staff. Splendid stylish breakfast room on floor 7 with great views to the East of the city to match the fabulous breakfast. Would stay there again without hesitation. Would have been a 5 if pillows were bigger and there were coffee/tea facilities.", "user": "susan365", "date": "March 29, 2005", "id": 3309530}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 3.5, "variance": {"poor": 18, "average": 48, "very good": 177, "terrible": 2, "excellent": 179}, "aka": "Ku` Damm 101 Hotel", "slim_ranking": 0.170914542729, "description": "If you like a visit to Berlin to be urbane and relaxed, you will be in good hands at the Hotel Ku’ Damm 101. The superior hotel, located at Kurfürstendamm 101, opened in 2003 and has been making an impression ever since, with its incisive design concept and young team. Zurich-based creative agency Kessler+Kessler, who designed the interior together with international architects and designers, bought into functionalism and purism combined with mellow colours and creative detail. The guiding aesthetic principle from the lobby to the guestrooms was reduction: no frills, no superfluous decor just clean lines and warm light."}