{"user_rating": 4.5, "review_count": 142, "name": "Kungkungan Bay Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "KBR is one of the more expensive hotels of Lembeh straits. I can compare it to Kasawari only but based on what I heard from other people KBR is quite a good choice.", "title": "nice but there is a room for improvement", "helpfulness": 4, "user": "dancing_shiva", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 52687891}, {"rating": 4.0, "stay_parameters": "Stayed September 2009", "text": "Positive", "title": "Friendly Staff & Good Diving", "helpfulness": 3, "user": "bilberrytravels", "date": "January 5, 2010", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 52671326, "likes": {"liked": "— Easy access to diving, good food & friendly staff", "disliked": "— Dated furniture"}}, {"rating": 5.0, "title": "Heaven for divers", "text": "The resort is located on a nice quiet black send beach, there are no neigbouring villages which you will appreciate if you previously stayed in Kasawari and probably in some other resorts. There is a home reef which you can shore dive and which is closed for boats from other hotels. It has the best coral I've seen in the Lembeh straits, i.e. California Dreaming is no comparison to KBR house reef in terms of coral beauty. So make sure to dive it at leat once, you need no guide to do that, navigation is simple there.", "helpfulness": 1, "user": "KenB2", "date": "November 22, 2009", "id": 49806433}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Food is ok, people complaining on food quality probably don't realize that good food is not something you're going to find in the Lembeh hotels. Anyway food ismuch better than in more expensive Kasawari and I never was hungry. Also they have a bar with a reasonable choice of liquors.", "title": "Absolutely fantastic - can't wait to go back !", "helpfulness": 2, "user": "GillyCambridge_UK", "date": "October 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46996023}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Dive services are good. Tim, the dive manager is a patient and professional man. The guides are good....", "title": "Fantastic hotel & Diving", "helpfulness": 4, "user": "daisythecat", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46763043}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "The resort (KBR) is an hour and half away from Manado airport along small country village roads.", "title": "Perfect Diving Holiday", "helpfulness": 2, "user": "BabybooBrunei", "date": "October 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 46701870}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Friendly check-in. The assistant Manager Rusam gave us a very good orientation of the resort.", "title": "The best diving experience I have ever had!", "helpfulness": 1, "user": "PQ1", "date": "September 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39834594}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Went to our room - semi detached bungalow by the beach. Perfect. 2 huge queen beds in the bedroom. Lovely sitting room and verandah with a great view of the sea (about 20m from the sea).", "title": "Great Diving pity about the food.", "user": "swift-simba", "date": "September 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 39818192}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "For a all-inclusive dive resort, the food is very good. You order from a menu and its not buffet style. For a resort in the middle of nowhere in Sulawesi, their quasedillas were good! Great breakfasts to fill you up before you dive in the morning.", "title": "Superb resort, superb diving", "helpfulness": 2, "user": "DivingPhool", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30425577}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The diving is all about critters and muck. Great dive team and effortless diving. Literally show up and get on the boat. Every thing is packed and waiting on the boat for you. Dive sites are not far from the resort. Usually a 5 min boat ride away. There's a camera room for camera buffs.", "title": "Outstanding resort, staff and the diving - truly incredible!!", "helpfulness": 4, "user": "TheMasonsJersey", "date": "March 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26376843}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Spent five nights at KBR before sailing on a live-aboard the following week. Great accomodations. Stayed in a large deluxe room - very spacious. Comfortable king-size bed. Had local and international television in room. The main lodge is a great place for meals, the library, and socializing. It juts out over their private reef.", "title": "Great dive resort!", "helpfulness": 2, "user": "bearina", "date": "March 2, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 13991229, "likes": {"liked": "— Great diving location - right on Lembeh Strait", "disliked": "— Food was rather bland"}}, {"rating": 4.0, "title": "Well-managed Resort for Divers", "text": "Dive operator, Eco Divers, onsite. Wonderful team of dive masters. This resort is really made for divers. Always take care of the divers - lug all gear for you. All you have to do is get suited-up and walk out to the dive boats. Can't say enough about the diving. Lots of macro stuff. Even found the rare and shy mandarian fish on a dusk dive.", "helpfulness": 5, "user": "FreqFlyer23", "date": "July 5, 2007", "id": 8064282}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled with friends", "text": "All inclusive. Food was average - hoped for local Indonesian dishes - and very bland. Generous portions. Definitely would go back again!", "title": "Great Hotel, wierd creatures", "helpfulness": 9, "user": "RaboDeToro", "date": "January 31, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 6720315, "likes": {"liked": "— Clean and comfortable", "disliked": "— Some mosquitos"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "My husband and I spent 8 days at Kunkungan Bay Resort (KBR) after stays at two other diving-oriented resorts (Siladen Island & Gangga Island) in other parts of North Sulawesi. Our experience at KBR was very good, but the other two were a tier above (See other two resorts for reviews).", "title": "Top macro diving & a great little resort.", "helpfulness": 21, "user": "dazzking", "date": "July 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5429480}, {"rating": 5.0, "title": "Absolutely amazing", "text": "It was a long journey to KBR but singapore airlines were excellent. We were a group of 12, 10 divers 2 non divers. We arrived at Manado and were quickly gathered together and put on an air conditioned coach and transported to KBR we arrived at about 9pm, we were welcomed into the resort by Cary who was standing in for the usual managers Steve and Miranda, from start to finish she couldn't do enough for us, check in was painless and then we were given a menu to order our evening meal, after we had eaten we were shown to our rooms which were large and airy, two queen size beds complete with mozzie nets, the bedroom had an electric mozzie appliance and the lounge had the coils which we lit every evening, there was a fridge, tea and coffee facilites and two bottles of water provided every day, we arrived at the dive school at 7.30 next morning and had our briefing before setting off for our first dive, safety was always paramount and i was very impressed with all the dive guides, we were in a group of 4 and had two guides Robbie and Puri for our weeks diving and i cannot praise them highly enough, i had a wish list of all the things i wanted to see and they went out of their way to make sure it was granted, the diving was amazing, inbetween dives we had cookies or cakes freshly baked with tea, coffee or hot chocolate, For the whole holiday we were waited on hand and foot, nothing was too much trouble, the staff always had a smile for us and when we finally left they all came to say goodbye and were singing as we got into the coach, i can honestly say it is the first time i have ever had a tear in my eye as i left a resort. Would i go back to this resort - you bet i would.", "user": "Bernese", "date": "October 28, 2008", "id": 21348032}, {"rating": 5.0, "title": "Everything About KBR is Wonderful", "text": "Anyone who wants to go diving in the Lembeh Strait should stay at KBR. We stayed for 12 nights with 10 days of diving, and enjoyed every moment of our stay.", "user": "wlk902", "date": "August 28, 2008", "id": 19475441}, {"rating": 5.0, "title": "KBR is very very good", "text": "The traditional houses are nicely appointed and have great views from the front porch. A/C, mini bar, bathrobes, toiletries and satellite tv give you all the comforts of home.", "user": "74white", "date": "August 12, 2008", "id": 18884507}, {"rating": 5.0, "title": "Diving in Lembeh Strait", "text": "The dive operation is flawless with extremely knowledgeable divemasters who guide you through the sites. Dives are well timed throughout the day so you never feel rushed, or left waiting. Your gear and cameras are handled by the staff and the diving is extremely easy. There is plenty of room to hang wetsuits so you are never dragging them back to your room. The camera room has lots of counter space, and electricity to charge the batteries. Hot beverages, fresh baked goodies, fruit and clean towels are offered after dives to really spoil you.", "user": "2skidivers", "date": "July 31, 2008", "id": 18471951}, {"rating": 5.0, "title": "small and personal dive resort", "text": "Above water there is a great swimming pool to lounge in the sun and relax, and a well stocked bar for evenings with beautiful views of the Lembeh Strait. The food is always delicious and there is plenty to choose from so you don't feel limited in your selection.", "user": "AussieTravelholic", "date": "July 23, 2008", "id": 18165860}], "location": {"country": "Indonesia", "region": "Sulawesi", "continent": "Asia"}, "stars": 4, "variance": {"poor": 2, "average": 6, "very good": 25, "terrible": 1, "excellent": 108}, "aka": "Kungkungan Bay Hotel Bitung", "slim_ranking": 0.333333333333, "description": "Kungkungan Bay Resort (KBR to its friends and soon to be friends) is proud to be the resort that introduced Lembeh Strait to the world. Being the first resort in Lembeh means we got first choice on locations. Our resort is located in its own private bay which the resort is named after. KBR is the only Sea Level Luxury resort in Lembeh. KBR is a full service resort which includes The only 24hrs full menu service Restaurant in Lembeh, Capt. Billy's Bar serving American Bar Food and Great Drinks, our full service Tepi Laut Spa (Seaside Spa) does Massages, Beauty Treatments, Manicures and Pedicures, and of course our PADI Dive Center with Equipment and Camera Rentals and 32% NITROX. Come join us and we will put the Dream into you next Dive Vacation"}