{"user_rating": 4.0, "review_count": 243, "name": "Kviknes Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This is one of te most beautiful hotel I've ever been. Unfortunately my room was placed in a back side awful new building, although still the views were very nice. Be sure you get a room at the main front side building.", "title": "Gourgeous hotel, but be carefull which room you get", "user": "Jesusizdo", "date": "October 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 119044876}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Apart of this all the common areas of the hotel are really beutiful with amazing views to the fjord. The breakfast is fantastic, and enjoying it near the big windows in the morning is an experience. The treat is very professional although impersonal.", "title": "Unique hotel", "user": "Michael H", "date": "September 16, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 118203850}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This is an amazing hotel in a beautiful setting. I stayed in the newer part of the hotel which did lack some of the niceties of a modern chain hotel , but it was clean, comfortable and the view I had of the fjord was magnificent. The buffet food was a amazing, both in quantity and quality. Wide varieties of fish and meat dishes with all the trimmings. Trying to count the number of sweet variations I reached around 30! Shame that a small beer cost the UK equivilant of £9 and a Gin and tonic was £11 but that's Norway for you!", "title": "Amazing balcony views of the fjord", "user": "C1975", "date": "September 13, 2011", "detail_rating": {"value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 118076656}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "The staff were helpful and efficient. The historical side of the hotel was very interesting. The current owner of the hotel found time to give us a short history talk on the hotel's development. Travelling from Balestrand is easy by way of the regular ferry services that stop off a few metres from the hotel. The main complaint from our party was that the rooms lacked tea and coffee making facilities.", "title": "Very Special Memories", "user": "ace555", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118060245}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "If you're looking for a tranquil, beautiful getaway, consider Balestrand, Norway, located deep in the Songnefjord nestled in the mountains. This historic hotel has grand views of the fjords and surrounding mountains. For an isolated location, the rooms are clean and comfortable, but don't expect much. They are simple, with average decoration, and on the small side, but you won't be spending much time in the room with the surrounding beauty of the area.", "title": "Consider other options", "helpfulness": 1, "user": "John S", "date": "September 6, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 117770257}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "The best view in any hotel I have stayed in in Norway. Romantic, old wooden building and a great buffet breakfast.", "title": "Romantic", "user": "ynges", "date": "June 11, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 131727512}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We took the scenic train and ferry to get to Balestrand and all I can say is wow! The views from this hotel are superb and in every direction. Be sure to plan in advance on eating at the hotel for dinner buffet. Well worth the price and they have a decent wine selection, too. Easy walk from the ferry terminal. Be sure to check out the local artists in the small shopping area.", "title": "Magnificent views", "user": "luvs2travel1021", "date": "June 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131658753}, {"rating": 5.0, "title": "Charming hotel with attentive staff and great food", "text": "I attended a conference at this hotel, accompanied by my family, so the trip was a mix of business and pleasure. We were given rooms in the newer part of the hotel for our 3 day stay. The double room was spacious, with a view of the mountains and part of the fjord, while the twin room for the kids was a bit smaller - but big enough - with more of a fjord view. The free wi-fi worked well everywhere. Neither of the rooms was luxurious, and the decor was a little dated, but we were very happy with them.", "helpfulness": 1, "user": "climate_criminal", "date": "June 9, 2012", "id": 131587156}, {"rating": 4.0, "stay_parameters": "Stayed May 2012", "text": "The communal parts of the hotel were lovely. I am generally in favour of modern minimalism for both decor and furniture, while this place was rather old fashioned, but it suited the location well, and wow, what a location!", "title": "Amazing view!", "user": "Davepuddy", "date": "May 24, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 130509116}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "the views from the lounges and the dining room were just fabulous, right across the Sognefjord.", "title": "A Norwegian enchantment", "helpfulness": 4, "user": "Likes2travl", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125204681}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed at Kviknes in August of 2010 to celebrate my father's 70th birthday - we brought our 4 kids, so there were 3 generations and we ALL adored the hotel! My father has stayed there a number of times over the years, but my husband and I had only been there once before, 20 years ago, when we celebrated my father's 50th birthday. The hotel is just gorgeous - it is that old world charm that is just so rich and inviting! We loved sitting out on the porch in the evenings - the sun still out until 10 pm or so - sipping tea - just wonderful! Definitely pay the extra to stay in the old part of the hotel in the old rooms - so much charm!", "title": "Old World Charm at its best!", "helpfulness": 2, "user": "opinionatedtraveller", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123947247}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "This hotel is a few feet off the actual Fjord and offers a rich, historic experience while on your Fjord trip. We stayed here in July with a family of six.", "title": "A Fjord-able Experience", "helpfulness": 3, "user": "Highpoints", "date": "January 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122780139}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "This is a hotel that is used by all the Fjord tours so it can get busy, especially around mealtime.", "title": "Gorgeous View!", "helpfulness": 4, "user": "OverseasIowan", "date": "December 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 121860351}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The rooms were dated (but comfortable), the food was good (not great), and the hotel itself offers little in the way of amenities. So why did I rate this excellent? Check out the photos! This is one of the most idilic places you could be on a summer's day in Norway. Ballestrand is quaint village that is well worth a walk, and the Old English Stave church is just steps from the hotel's front door. To be sitting on the large front porch, or on the front lawn, or maybe in your room with a view, is to be at peace with the world! The evenings are especially beautiful. I think that the historic nature of the hotel just adds to the overall experience.", "title": "Was not wowed at all.", "helpfulness": 4, "user": "Beaverhousen", "date": "November 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 120246710}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "My husband and I visited here a couple of years ago. After the fact, I found out that my aunt visited here in 1978 and my grandfather visited the hotel in 1939. A family tradition! The views were gorgeous. We were in the modern wing, and the room was adequate. If you plan to enjoy just the room, it might be a disappointment. But, we spent the majority of the time sitting on the balcony enjoying the view. The breakfast was lovely and adequate. We truly enjoyed hiking every day and rowing out on the fjord. Walking to the St Olaf church was gorgeous. The hotel was expensive for US citizens (terrible exchange rate), but everything in Norway is expensive for Americans. So, we chose to go to the supermarket and buy snacks for dinner instead of the expensive dinner offered. I dream of visiting again. It was just gorgeous!", "title": "a surprise hidden away", "user": "HeidiAB", "date": "October 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119420058}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Beautiful hotel, somewhat spoiled visually by the giant concrete addendum built in the 1970's. Luckily I stayed in the old part. The room was fine and dandy but what blew me away was the huge balcony with a magnificent view of the Sognefjord.", "title": "Business meets tranquil pleasure", "user": "naitS", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117571397}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Business facilities were adequate. Service was for the most part impeccable. Almost all staff seem to be foreigners; felt a bit strange conversing in English being a Norwegian in Norway.", "title": "loved the hotel and balestrand", "user": "lambkin21", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117473836}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "If I were to write a novel and were rich, I'd book a room at this establishment.", "title": "Norwegian hospitality at it's best!", "helpfulness": 2, "user": "jean m", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117265545}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Balestrand is a gem, albeit a very quiet one.", "title": "This is not an average Hotel, it is a unique cultural Hotel you must visit.", "helpfulness": 1, "user": "jaxels", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117261518}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "balestrand is a beautiful tranquil place and this hotel is a lovely old building set in a beautiful surrounding.", "title": "The service was slow, and the waitress neglected to mention that the kitchens had close", "user": "CleoQuatre", "date": "August 24, 2011", "detail_rating": {"value": 2.0, "service": 1.0}, "id": 117180603}], "location": {"country": "Norway", "region": "Western Norway", "continent": "Europe"}, "stars": 4, "variance": {"poor": 18, "average": 27, "very good": 86, "terrible": 17, "excellent": 95}, "aka": "Kviknes Hotel Balestrand", "slim_ranking": 0.5}