{"user_rating": 5.0, "review_count": 106, "name": "Kwa-Mbili Game Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "Our group of four stayed at Kwa Mbili for three nights in August. We had a wonderful time. The staff was top notch and very friendly. Every meal we had was delicious. The safari tents were very comfortable and luxurious, but they still make you feel like you're quite close to nature. The best part about Kwa Mbili is the quality of personal service provided by owner/operator Neil and his very friendly staff.", "title": "Wonderful stay!", "user": "valphoosier", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20228390, "likes": {"liked": "— Service", "disliked": "— Waking up early"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Kwa Mbili far exceeded our expectations. It's a beautiful lodge - clean, comfortable, well appointed. They have a great wine list of South African wines and Neil will enthusiastically discuss them if you're interested. Melanie's food is out of this world. Justine and Freddy make you feel right at home. The thing that sets Kwa Mbili apart is the personal attention - they all genuinely want you to have the best possible time in the Kruger area. We had fantastic experiences with animals (including all of the big 5 for those of you who are looking for that specifically) and we even heard a lion roar right outside of our tent! My husband and I had an absolutely incredible time and we were really sad to leave.", "title": "Kwa Mbili is an INCREDIBLE value - fantastic lodge!", "user": "ksbseaport", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17252704, "likes": {"liked": "— personal attention and value", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My husband and I have just returned from two weeks in South Africa, and the highlight of our trip was our three nights at Kwa-Mbili.", "title": "A wonderful experience!", "user": "AJF1304", "date": "March 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 14322240}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We were lucky enough to have the lodge to ourselves for most of our stay, and throughout were treated to fantastic hospitality from all the staff (although don’t assume this means you can book at the last minute – they were fully booked for the weeks to follow). Neil, Melanie and Justine all went out of their way to ensure that we had everything we needed – the accommodation was clean and comfortable, and the food was fantastic. Several meals were taken with some of the staff, and it was a real pleasure to find out more about the bush and South Africa in general than we ever would have if we’d just kept ourselves to ourselves.", "title": "If you prefer B&B's more than Mega Hotels...", "user": "Nepal06", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7870466, "likes": {"liked": "— The owners", "disliked": "— the pool"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "As well as morning and evening game drives, Neil took us on an early morning bush walk, which gave as an interesting insight into the birds, plants and smaller animals. We saw most of the Big Five during our stay, although the best drive we went on was one where we hooked up with a vehicle from another lodge in a different part of the Thornybush Game Reserve. I’m not certain that the area that Kwa-Mbili is in is the best for seeing some of the Big Five, eg elephants, but never having been on safari before it’s hard to comment. By our last morning we still hadn’t seen a leopard and Simon and Freddy (the ranger and tracker) spent an extra hour or so driving us around trying to find the elusive leopards. We didn’t see one, but we did see two male lions, getting right up close to watch them having their breakfast, tucking into a waterbuck!", "title": "Loved Kwa-Mbili", "helpfulness": 1, "user": "svader", "date": "March 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6893936, "likes": {"liked": "— I have never stayed in a tent with a hot shower and thatch roof where you can look over the edge at the wild anaimals while taking a shower.", "disliked": "— Takes some getting used to! If the lions are close you can take a while to fall asleep."}}, {"rating": 5.0, "title": "Wonderful experience at Kwa mbili", "text": "My husband and I visited South Africa earlier this year. The highlight of our trip was our stay at Kwa 'mbili. It is a really special place run by people who clearly love Africa and its natural history. We were treated to respectful close-up game viewing of all the large game animals, but in addition, we were shown the small creatures of the bush country (that could have been easily overlooked) by highly knowledgeable and competent guides. Although there were chalets available, we wanted to experience Africa in a safari tent. Ours was beautifully furnished and exactly what we hoped for. The staff was outstanding and the owner and his wife were attentive to every need. He is an enthusiastic birder who was eager to share his knowledge; she arranged for, and accompanied us on interesting side-trips. Our menu included samples of typical 'bush' food that we did not get anywhere else. Although it was considerably less expensive than those advertizing as \"luxury game lodges\", I can't help but think that we had a far better experience than if we had paid three times as much money. I have only praise for Kwa'mbili.", "helpfulness": 4, "user": "sthree", "date": "July 21, 2006", "id": 5494197}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My partner and I stayed 4 nights at Kwa Mbili earlier this month. We had just come from an $800-per-night safari camp in Botswana and I have to say that Kwa Mbili compared very, very favorably to the much more expensive place. The staff, especially the relatively new Beth and Gavin, were friendly, hardworking,competent and anxious to make sure we had a good time. The accommodation, a large, well-appointed safari tent pitched under a thatched roof and an outdoor attached bathroom/toilet, was very comfortable. The game drives were fabulous. Gavin, the guide, was relentless in tracking down the animals. The food was both delicious (including lots of fresh fruit and fresh vegetables) and plentiful. Last but not least, the price was about 1/3 of what we paid in Botswana.", "title": "Only one criticism", "helpfulness": 2, "user": "jbullock47", "date": "April 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27689550}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The one criticism I have is that there is no smoking policy at Kwa Mbili other than you can't smoke in the tents. For a non-smoker, this is a problem. If you happen to be in camp with guests who smoke, you can spend a lot of time moving around from place to place avoiding the secondhand smoke. You can't complain to the owner, since he and one of the staff are also smoking. Other than this one criticism, however, Kwa Mbili is a great way to see South African game and a great value to boot.", "title": "Cozy and personal lodge - a gem for Safari travellers", "helpfulness": 2, "user": "stromstrom", "date": "February 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25242693}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "My gf and I stayed her for only 2 nights in February during a trip to SA - and when we look back at our trip to SA this stands out as the best experience. A small lodge that took the time to make all of the guests feel comfortable and relaxed. Very good food and great drives with good guides that really took you up close with the animals. We really enjoyed the peace and quiet between drives and the beer and small talk in the bar after the evening drive. That it's very affordable only make it better (can you give 6 stars...?)", "title": "Loved the lions!", "helpfulness": 1, "user": "Johnny95", "date": "December 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22523308, "likes": {"liked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We have just returned from a three night stay at Kwa Mbili. It is an excellent Lodge and we were very well looked after. The guides were brilliant - they had an incredible knowledge about the animals, plants etc. The staff are very friendly - Matthew and Justine did a great job hosting and Neil took us on a very enjoyable bush walk. The food was also excellent! I have no hestitations at all in recommending Kwa Mbili. You will not be disappointed.", "title": "Wonderful value, incredible experience, great staff", "helpfulness": 1, "user": "onceuponalauren", "date": "November 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 22326014, "likes": {"liked": "— Incredible experience, fun place to stay, great value and friendly staff!", "disliked": "— A little hard to find if you're driving there yourself"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I found Kwa-Mbili through my Fodor travel guide and I booked a stay after reading the reviews on Trip Advisor which all turned out to be totally true! Neil, Melanie, Justine and their crew make sure you get the greatest experience possible: we saw everything from rhino, elephant and giraffe herds, sleeping lions and grazing buffalos to hyenas finishing an elephant carcass and a cheetah playing with her cubs, we ate like kings, stayed comfortably in one of the tents where we could hear the lions moving about all night long and reallllyyyy relaxed during the day in the hideout with drinks and games. Kwa-Mbili is a fantastic value - the incredibly friendly staff is just a bonus! I highly recommend it to anyone!", "title": "Fantastic", "helpfulness": 3, "user": "dmwhit", "date": "October 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20708167}], "location": {"country": "South Africa", "continent": "Africa"}, "stars": 3, "variance": {"poor": 1, "average": 1, "very good": 11, "terrible": 0, "excellent": 93}, "aka": "Kwa Mbili Game Hotel", "slim_ranking": 0.666666666667, "description": "KwaMbili Game Lodge provides an authentic safari experience at an affordable price. KwaMbili is siutated in the Thornybush Game Reserve near Hoedspruit, within the Greater Kruger area. The reserve is home to the Big Five as well as an abundance of other game and bird species. This means good sightings, either while out on game drive or on foot during bush walks. KwaMbili means \"Place of Two\" in the local Shangaan language.Our knowledgeable rangers will introduce you to the tracks, movements, sights and sounds which give you a window into the secrets of the African bush. Back at the lodge, view wildlife from the safety and comfort of our well-positioned hide. If all this calls for time to just let the experience sink in ... take a dip in the swimming pool, just relax in an armchair or enjoy a cool drink at the bar."}