{"user_rating": 5.0, "review_count": 151, "name": "Kwalito Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I found this place online and it was perfect - beautiful rooms, friendly welcome, perfect location and the best breakfast I think I've ever had!! The rooms are charming, comfy and practical (ours had a little kitchenette as well as a huge ensuite bathroom) - the breakfast is delivered in a basket outside your room, flasks of hot drinks and literally a basket full of yummy breakfast foods - bread rolls, pastries, jams, cheeses, cold meats etc. The couple who own the place are brilliant - they obviously really care about their guests and running a fantastic business. Recommend highly to all my friends and family!", "title": "Gorgeous B&B with the best breakfast ever!", "user": "Biggsy76", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31011770}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "My partner and I spent 3 nights here in March 2008 and we couldn't have been more impressed. Kris & Els (the owners) were super-friendly and very helpful. The B&B is in a great spot so you are not too far from the middle of town and the rooms were very clean and well maintained.", "title": "Brilliant B&B - Friendly service and massive breakfast hamper!", "user": "Freo_Steve", "date": "May 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 31002993}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "One of the highlights for me had to be the breakfast hamper (which costs around €5 per night) which comes with tea, coffee, cereal, cold meats, bread rolls, chocolate bars, biscuits, fruit, spreads etc. I am not exaggerating at all - my partner and I were blown away by the amount of food and friendly service.", "title": "Excellent, Highly Recommended B&B in Bruges!", "user": "tworns", "date": "May 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30291851}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The only downside was that perhaps the bed could have been a bit more comfortable but even in chilly conditions I sleep quite well. I would (and have) recommend this place to friends and family without hesitation.", "title": "Highly recommended", "user": "Masoko-T", "date": "May 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 29300000}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We stayed here for three nights and wished we could have stayed a little longer. We were warmly welcomed by Kris and Els (the owners) upon arrival. Kris gave us a map of Bruges and highlighted the restaurants, attractions, etc. in Bruges. There was a fruit basket and complimentary orange juice and water in our room when we arrived also. The breakfast every morning came in a basket was generous and very delicious (bread, spreads, eggs, cold cuts, cheese and orange juice and coffee). The bed and breakfast is within walking distance from the city center, museums and other attractions and even to the train station (30 minutes walk) without your luggage. There is a laundry place just across the street. The area is quiet and safe and you have a different entrance from the store.", "title": "A little flat with breakfast in a basket :)", "user": "emu12", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 27807289}, {"rating": 5.0, "title": "Perfect for our family!", "text": "We arrived early afternoon on April 5. We had two rooms (the family suite will be ready this summer). We were greeted by Kris & Els who were nice as could be - showed us around, gave us a map of the city and some recommendations.", "user": "juxie", "date": "April 10, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 60880634}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The rooms were very comfy and inviting, a eating area outside, a kitchen area in the guest section for the guest to use.", "title": "Perfect place to stay in fairy tale Bruges", "user": "DeniseWiltshire", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50510644}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The breakfast in the morning included fresh pastries from the local bakery, eggs from their chickens, meats & cheeses, cereal and an assortment of drinks.", "title": "wonderful", "user": "mann41", "date": "October 19, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47218431}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Their new location is about a 30 minute walk to center city. We enjoyed the walk but you also have easy access to several buses and Kris & Els are happy to give you a ride if they are free.", "title": "Great B & B, Great Location", "helpfulness": 1, "user": "tomcockburn", "date": "October 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45996768}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "The B&B is extremely welcoming, and the owners make it that much better! Highly recommend staying here.", "title": "Wonderful stay in a magical city", "helpfulness": 1, "user": "InItinere", "date": "August 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38998442}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "What a fantastic B&B. Only a five minutes walk from the Market Square. Very secure and clean. It was more like a studio apartment than a B&B. We were on the 1st floor and had our own terrace and bathroom. Clean towels everyday. Comfy bed. Hearing the bells from the nearby was so nice.The owners Kris and Els were so warm and helpful. They recommended places to visit and restaurants also out of the tourist area which are cheaper. Breakfast was amazing! Delivered to your door in a huge basket - rolls, jams, spreads, cheeses, meats, eggs, cereal - enough to last all day!! Fantastic chocolate shop further up the road which was a lot cheaper than around the market and so much to choose from. I would totally recommend stay here!!!", "title": "Fantastic B&B", "user": "UkPepsimax", "date": "April 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27741330}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We loved B&B Kwalito! Kris and Els made us feel at home, and we got great advice for what to see and do -- a lot of what wasn't mentioned in our guidebook. The breakfast that was left at our door each morning was always fantastic. We were spoiled! The Kwalito grocery store next to the B&B is a great place to get misc. food and drink -- and we made sure to go home with some tasty Belgian brews. The room was cozy; we only wished the weather was better so we could enjoy the patio! I would definitely go back, and without a doubt I would recommend this B&B over a hotel in town.", "title": "A wonderful B&B experience", "user": "VancouverWannabe", "date": "April 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 27322512}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "... and a delicious breakfast! We went to Brugges for a weekend break and stayed at Kwalito for two nights. Location is very good given that you're in a less touristic area just 5 minutes walk to the market. The room is very spacious yet cozy and includes all kinds of facillities such as boiler, mini-bar, tv, etc. Breakfast is served in a very charming basket and includes different types of bread, spreads, cheeses, and cute \"dressed\" boiled eggs. You eat in the kitchen space of the room, taking your time still in your pj's! And what we would like to highlight is the kindness of the Kwalito owners who gave us attention and privacy in a perfect balance.", "title": "It's all kindness...", "user": "lucarotterdam", "date": "March 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 26624268}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Stayed at Kwalito for 2 nights and its AMAZING! Kris and Els were so welcomming and kind when we arrived. They really make their guests feel at home. We had a complimentary bottle of water, bottle of juice and fruit basket waiting for us in our room upon arrival. They gave us maps and told us where to eat and what to see and do. The room was incredible. Its really your own apartment complete with a small kitchen, tv, great sized bathroom, big comfy beds, a HUGE skylight bringing in lots of natural light and a terrace (altho it was too cold to use). The breakfast is really to be believed. It was delivered to our door in the morning and it included the most wonderful spread of breads, cheeses, meats, eggs, yogurts, spaculous, coffee and tea. The location is fantastic and about a 5 minute walk to the centre of the city. Bicycle rentals are across the street and a definte must when visiting Bruges.", "title": "Amazing Value and Location!", "user": "PrincessRainbow", "date": "March 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25969498}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "Best place you can get. It is 5 minutes (by feet) from the market place, and the room we got was amazing. Actually, it was more a flat than a room, with every possible confort. You definitely feel at home with free Internet access and total freedom and intimacy. And with such outstanding owners, you feel like you lived there the whole time. you simply can't meet sweetest people, trying to make everything possible to make your stand the best ever. and can i mention the huge breakfast that is delivered in front of your door in the morning (no pressure of getting ready to be on time for breakfast).", "title": "Amazing", "user": "redaddict", "date": "March 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25786928}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Kris and Els's genuine hospitality really made a difference to our stay in Bruge. Their quaint bed and breakfast is tucked out of sight from the bustling main square, but is only a 10-12 minute walk away. Filled with cozy furniture and and decor, the room was very comfortable. Kris and Els were more than willing to give us advice on where to go and what to see. The breakfast was lovely with all sorts of breads, cheeses, meats, cereals and spreads.", "title": "A charming place to stay while exploring Bruge", "helpfulness": 1, "user": "kramelau", "date": "August 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38716939}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "It was our first visit to Belgium and we are sure that we could not find any better location to stay than the Kwalito. The room was wonderful, the breakfast basket an every morning pleasure and Kris as our host was a very kind person.", "title": "We will come back!", "user": "Herr_Bohm", "date": "August 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36418021}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We were alowed to park our car next to the house we lived in and were able to do anything in Brugge by feet.", "title": "a perfect B & B", "user": "AtlantaPenny", "date": "July 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36154228}, {"rating": 4.0, "title": "Baby friendly home!", "text": "We can really say: Come to Brugge and select the Kwalito!", "user": "LiquidGirl", "date": "June 20, 2009", "id": 32727903}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at Kwalito B & B in July and would highly recommend it to all travelers. The location is perfect, only about a 5 minute walk to the town center and next to a beautiful old church. Our room was very clean and comfortable with every comfort needed---warm cozy bed (it was quite cool!), spotlessly clean bath, tiny, but perfect kitchen, a small patio. Best of all though are the owners who make sure that every detail is taken care of! When we arrived we were warmly greeted and given a large basket of fresh fruit. Each morning when we woke up, we opened our door to find a huge breakfast basket full of a hot pot of coffee, a hot pot of tea, eggs, pastries, yogurt, an assortment of meats, fresh breads---more than enough to provide lunch as well as breakfast! On our last day there, we informed the owners that we would be leaving at 6:00 AM the following morning and they called us a cab (which arrived exactly on time) and provided us with a wonderful breakfast that we could take on the train with us. Bruges is a beautiful city, and Kwalito B & B made our 3 days there absolutely perfect!", "title": "Highly recommended", "user": "tonyd45", "date": "June 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31640907}], "location": {"country": "Belgium", "region": "Flanders", "continent": "Europe"}, "variance": {"poor": 0, "average": 2, "very good": 9, "terrible": 0, "excellent": 140}, "aka": "Kwalito Hotel Bruges", "slim_ranking": 0.105527638191, "description": "Our house with 3 charming rooms is just out of the center of Bruges, close to the windmill area. Each room has its own bathroom with toilet, WiFi, television and box-spring beds. We offer our guests bicycles, free of use during their stay. In our big garden you can relax in our swimming pool, jacuzzi, sauna and a big terrace to try out a fresh local beer (supermarket only 200m away)."}