{"user_rating": 4.5, "review_count": 456, "name": "Kyoto Hotel Okura", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This hotel was a welcome change from the usual. The entry atrium is large and airy. The lobby has a pleasant ambiance and the cafe is a nice place to have tea. The check in process was fast and efficient, the concierge and guest relations staff were exceptionally helpful and friendly.", "title": "Relatively large rooms, very good location and excellent service", "helpfulness": 2, "user": "CorporateNomad", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 149631572}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "The hotel room is quite large for Japanese standards. There are multiple sockets that will accept foreign plugs. A nespresso machine is provided.", "title": "Smart hotel", "helpfulness": 1, "user": "Mark R", "date": "January 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149625001}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The hotel is located in a very good area, near tea shops, the Gion district, as well as being right on top of a metro station.", "title": "Wonderful hotel in central Kyoto", "helpfulness": 1, "user": "NA69Traveler", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147756934}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "On several occasions I walked from the hotel a few hundred meters to enjoy walking on the banks of Kamo river or along the little alleyways of the Shirakawa canal. There are always plenty of taxis in front of the hotel should you wish to go somewhere further removed.", "title": "Great short stay", "user": "Geoff777", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147572425}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "The Chippendale bar was very pleasant as well, with a very good selection of Japanese whiskys and single malts. Smoker friendly .", "title": "Convenient location", "user": "LWC0217", "date": "December 9, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 147054970}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This hotel is situated ideally in the heart of Kyoto, 10 minutes walk to the Gion district and 5 minutes walk to the shopping area were you find the Takashimaya shopping mall among a lot of interesting shops and extremely many restaurants. The lobby of the hotel is a bit dated, but the staff is very helpfull and willing to give the guest a very good feeling. We had our room on the 19th floor, everything was very clean and quiet. We had no breakfast reserved, because in the basement was the underground shopping mall with several little bakeries with excellent breakfast and coffee. Very convenient and easy to find is the underground mall and subway station. Lots of little restaurants in the neighbourhood. WIFI not in the room.", "title": "Pleasant stay", "user": "MardiOortwijn", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142943339}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "Be aware when you only want a drink in a restaurant without food, they charge you 1000 yen per person. Behind the hotel in a 15 minutes distance walk you find several museums.", "title": "Fantastic Stay", "user": "bob c", "date": "October 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142049199}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Magnificent hotelo in Kyoto. Service superb. Had a high floor with some good views. Loved the Irifune restaurant. Super good Japanese cuisine. Especiaslly their black tea.", "title": "Great Staff, Fair Management", "user": "Shin_A13", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 141394895}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Rooms conmfortable by Jaopanese standards. Toiletries not very choosy but adequate. Good location near Gion.Alsop able to freely get info fromk concvierghe and visit the sigtes including Kinkakuji,Ginkakuji, etc.", "title": "Old world charm", "user": "travelbugManila", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140125207}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Loved the malls and shoppings withing walking reach.Overall a great place to stay.", "title": "Good location, nice concierge", "helpfulness": 1, "user": "Tsurururu", "date": "September 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 139563990}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "Celebrating its 125th year, this is a historic hotel and the grandeur is apparent. Rooms are large, service is excellent and nothing is too much trouble for any of the staff. Location is one block from the river, and everything was gorgeous in cherry blossom season.", "title": "Grand property, fantastic service.", "user": "sankar", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 158091581}, {"rating": 5.0, "title": "Our Favorite Hotel in Japan", "text": "Breakfast spread was decent, and the restaurant has great views over the city and the mountains around.", "user": "ktc225", "date": "April 6, 2013", "id": 156822571}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Free wifi in the lobby. Rooms only have wired LAN, so carry a pocket wifi router if you want to use wifi on your iPad, phone, etc.", "title": "Good concierge", "user": "coucouhagihagi", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154911712}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "If you need to go to Kansai airport, they have a shuttle van from the hotel for 3500 yen. Ask the concierge to book it 24 hours in advance.", "title": "When compared to others!", "helpfulness": 1, "user": "littlechilds", "date": "March 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154696650}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This was our favorite of the three hotels we stayed in during our recent Japan trip. The lobby is old world grandeur and the rooms were American-style large and comfortable (we had booked Superior Twins) with superb bathrooms and lovely Eastern views. The location was terrific, with plenty of restaurants and nightlife within walking distance, and a subway stop (and sizeable underground shopping mall) right underneath the hotel. My only mild complaint is that there was a charge for in-room coffee. Kyoto is a wonderful place to visit and sightsee and this hotel actually added to the pleasure of our experience there.", "title": "An old fashioned hotel.", "helpfulness": 1, "user": "christopherong", "date": "January 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150267528}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This is a high-end hotel, but worth the money. Our room was large, as was our very modern bathroom. Service was excellent. Location is great -- above a subway station, and on a street with several useful bus lines. Restaurants are expensive and you can do better outside -- it's a five minute walk to the charming Pontocho district.", "title": "worth the money", "user": "gulliver1711", "date": "December 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 146667511}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "This is an older hotel but is well maintained and centrally located. As expected of a hotel of this caliber, the service is wonderful and attentive. The rooms are big by Japan standard but have no wifi.", "title": "Older but well maintained.", "user": "OrpheusTexas", "date": "December 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146659005}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I feel that the hotel corresponds to the general impression from the other reviews, i.e. older hotel but extremely well kept, helpful and kind staff, good location concerning access to public transport (acces to the metro on -2 floor of the hotel, and to bus lines, across the street to the places of interest), no wifi in the room but internet with cable (cable is provided in the room); wifi only in the lobby, and facing the main shopping streets (not very interesting for shopping, though). I justed wanted to add the following points: 1. The hotel has two staff members with an office on the right side of the reception who are very professional to giving directions and any other information one might need: they provided us with a personalzed service explaining how to go the places we wanted to visit, and gave us detailed maps and lists indicating the local buses and correspondence, if necessary. This worked out very well. They sell day tickets for the bus (500 yen per day, very good deal) and other tickets (combined day metro and bus ticket), etc.. So, do not waste your time going to the tourist office in Kyoto station when arriving as recommended in most guide books, because you obtain the same and even more personal service at the hotel. 2. We had a triple room without breakfast. I don't know how much I exactly paid for the hotel itself because I booked a three night trip through an agency, including the Shinkansen from Tokyo, but overall it was acceptable compared to the standard of the hotel. We did not have meals, breakfast or used the room service or had dinner in one of the many restaurants of the hotel, because it was just too expensive (2100 yen for breakfast). We had breakfast in a small tea room that belongs to the hotel on floor (-2) where one can have a reasonable breakfast (coffee, tea, cappucino, one orange juice, a soup, and two croissants or other roll) for 650 yen. There are many good and reasonably priced restaurants nearby, and not located in the Pontocho street tourist trap, such as \"le Bouchon\" a French restaurant, two blocks away, looking a bit dull inside but excellent, and \"Kushikura\", a traditional japanese restaurant specialized in brochettes. 3. We booked a non-smoking room and obviously this room had been used as a smoking room by previous guests. The room literally stank of cigarette smoke, including the curtains, which is unacceptable in a hotel of such standard. We could not open the windows which means that the smell remained throughout or stay. I decided not to make a fuss of this because we had only a few days in the city and did not spend much time in the room. 4. Do not take a taxi or the metro to go to the station because the hotel has a free shuttle bus. At the arrival behind the station, they even came with us to guide us to the Shinkansen. To conclude, overall a positive experience, however, disappointed with the unacceptable non-smoking room policy, which was in total contradiction with the level of the other services provided. provided.", "title": "Excellent hotel but beware if you are a non-smoker", "helpfulness": 1, "user": "mhphilemon", "date": "November 22, 2012", "detail_rating": {"value": 4.0, "sleep": 4.0, "rooms": 3.0, "service": 4.0}, "id": 145972928}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Right across the street from Kyoto City Hall, the Hotel Okura´s location is excellent, walking distance to dozens of restaurants and shops (good options all along Kawaramachi Dori and also by the river). The hotel is also a short walk from Kyoto Imperial Palace (with its large park) and the Nijo-Jo site (wonderful place to visit and learn about life in the times of the Shogun.)", "title": "Wonderful Service but a bit pricey", "helpfulness": 2, "user": "eli_puszkar", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 145029222}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The rooms are big and confortable (especially for Japan) and even though the décor is a bit dated, it is well kept and always in perfect shape.", "title": "Fantastic customer service", "helpfulness": 2, "user": "mgcg1981", "date": "October 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143131125}], "location": {"country": "Japan", "region": "Kinki", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 11, "average": 35, "very good": 160, "terrible": 4, "excellent": 246}, "aka": "Okura Hotel Kyoto", "slim_ranking": 0.1, "description": "Seventeen-story Hotel with impressive lobby of European architecture reminiscent of the 1920s."}