{"user_rating": 4.5, "review_count": 950, "name": "L'Auberge de Sedona", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My husband and I celebrated our 7 year wedding anniversary at L'Auberge de Sedona. From the moment I made reservations to the moment we checked out the experience was phenomenal.", "title": "Perfect Anniversary Retreat - Thank you L'Auberge", "helpfulness": 1, "user": "Cheri_Ja", "date": "August 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174744678}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I had some questions about the lodge rooms so I called to book our reservation. I discussed upgrading to a more expensive cottage with the booking agent at the time of my call and decided to stick with the lodge room. The lodge rooms looked beautiful online and sounded even better once discussing with the agent. She noted our wedding anniversary and noted a room with a view and balcony. To our surprise upon check-in we were upgraded to a Vista Cottage. The cottage was amazing! And the views were amazing! Not only were we surrounded by the beautiful red rocks of Sedona but we also had an wonderful view of twinkling stars at night. We actually fell asleep on our lounge chairs while watching the stars. The interior of the cottage was very clean and beautifully appointed. The outdoor shower was a real treat!", "title": "Great property!", "helpfulness": 1, "user": "m3sulliv", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 174565964}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Dinner at the restaurant was also out of this world! We both ordered the 3-course dinner. I started out with the tartar. The caramelized Brazilian nuts were such a wonderful touch in that dish. The setting is right along a flowing creek. We felt as if we had escaped into a beautiful retreat made just for us.", "title": "L'Auberge at Sedona disappointed...BIG TIME", "helpfulness": 5, "user": "JeffH655", "date": "August 28, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 5.0, "rooms": 2.0, "location": 3.0}, "id": 174555911}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "It was hands down the best way to celebrate our anniversary.", "title": "Great place-great service", "user": "TrippinAvatar", "date": "August 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174422482}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The location, while being centrally located, is still hidden away and feels private. They are nestled next to a beautiful creek and the grounds are well landscaped and manicured.", "title": "Wonderful escape from the Phoenix heat!", "user": "Brian P", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174250864}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My husband and I recently stayed at L'Auberge de Sedona and had a fantastic experience. We stayed in a vista cottage which had a large poach area that provided a beautiful view of the red rocks. Our cottage room was elegant, spacious and the bed was very comfortable. The bathroom area was very spacious and had a jacuzzi tube as well as an outdoor shower.", "title": "Serenity and Relaxation", "user": "FishyNyc", "date": "August 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174187423}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The resort offered many amenities such as a spa, pool, early morning yoga and specialty events such as star gazing at night and a photography session in the AM.", "title": "Delightful Experience!", "user": "David C", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 174034546}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "The staff was very accommodating professional and helpful in planning out our activities.", "title": "Secluded Paradise in Uptown Sedons", "user": "TRL54", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 174029082}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Overall L'Auberge offered an exceptional experience on many levels and we would definitely return if ever in Sedona again.", "title": "A few housekeeping issues", "helpfulness": 1, "user": "Tim C", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 173535183}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "Just celebrated our 37th wedding anniversary weekend at L'Auberge. Have heard about it for years, but this was our first stay. Won't be our last. Staff was friendly and professional, and very attentive. The food was creative & delicious. Mussels at the bar were outstanding, dinner by the creek memorable, and the Sunday brunch worth every penny. Appreciated the \"no tipping\" (with exception of restaurant and bar) policy. Cottage was beautiful, comfortable and quiet. Looking forward to another visit someday soon.", "title": "Heaven on earth", "user": "diann w", "date": "August 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173351689}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We thoroughly enjoyed our stay at L'Auberge de Sedona! The staff are courteous and friendly and make you feel welcome. The grounds are stunning and the pool is secluded and private. We also enjoyed drinks at the Veranda Bar and the bartender was attentive and friendly! We stayed in one of the spa cottages and it has modern decor with a king bed and a large bathroom that includes a jacuzzi tub, shower, double sinks and an outdoor shower. We sat on the deck and loved the view of the Sedona night sky! Highly recommend L'Auberge!!!", "title": "Attention to detail!", "helpfulness": 1, "user": "HurricaneCaroline", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 172305592}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "While we have been to beautiful Sedona with it's majestic Red Rocks before, this was our first stay at L'Auberge de Sedona. We contacted Debbie K, Sales and Catering Assistant, and she was very helpful in helping us plan our 5 night stay. Thanks Debbie. The cabin was great and the staff to a person was outstanding. Be sure to enjoy the exquisite cuisine creekside for breakfast and a romantic dinner. Enjoy a great massage in the beautiful spa. All this and pet friendly, we will return soon.", "title": "We've Found Our Favorite Getaway", "helpfulness": 1, "user": "zigzag1Phoenix", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172147936}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "In addition to the beautifully unique setting and location, L'Auberge understands the art of hospitality. The property is divine and the staff engages guests to purposely make it a memorable stay. I don't think i've ever remembered staffers names. Here are a few: Chad at valet upon arrival at night, in the rain, made me feel welcome and at home (first impression); Nicole at front desk; Graham, concierge; Kirsten, front desk; Natalia, front desk; Russell, bartender; Rose and Brianna, hostess; Michael and Julie, wait staff; Eric, Wade and Humberto(?) at valet; housekeeping was flawless -- I wasn't present when they came each day so I don't have names but they deserve a shout out; grounds keepers were always working and friendly; Ryan Pederson, front of house manager, has been there 6 years. You can tell.", "title": "Fabulous...and great for solo travelers", "helpfulness": 1, "user": "opiateoflife", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172080822}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "The food is excellent. Breakfast and lunch prices, for the food, I found to be a better value than uptown. Dinner is 3 courses and a bit pricey for my budget. Stairs beside the lodge lead up to a breezeway in another hotel that puts you right on Sedona uptown mainstreet. Midway up, there's a beautiful deck with chairs looking out on the awe-inspiring vista that I think not many people either know about or take the time to stop at. Nice place for a glass of wine and sunset..", "title": "Magic", "user": "chaillelesmarais", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171965337}, {"rating": 5.0, "title": "Your own piece of heaven", "text": "The only item for improvement I could think of was the need for more lounge chairs at the pool.", "helpfulness": 1, "user": "dlbradley1", "date": "August 10, 2013", "id": 171596233}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Enjoyed two lovely days in a two-bedroom cottage in the center of the property (by the koi carp pond) in August 2013. We arrived in Sedona after a long road-trip, and the lovely surrounding was very much appreciated by everybody - our four-year old was delighted with the creek, the ducks and the carps...and we all loved the swimming pool and the beautiful greenery. The rooms are well appointed, with nice toiletries and décor. The service was very pleasant, and the concierge helpful in recommending a lovely local spot for a picnic. We got a room deal which included dining credit, and they were very flexible in accommodating when/how we used it. Only comment is on the food offer at lunchtime by the river - we found it was somewhat limited, with a lack of healthy options (a lot of sandwiches and burgers but few salads, fresh fish etc...), and rather pricey. The service could also be improved - orders were often not correctly written down, with the result that we had to return a dish due to allergy. Other than this, a lovely stay and would definitely recommend for a relaxing break!", "title": "A relaxing stay in a beautiful location", "helpfulness": 1, "user": "F_Pinto_London", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 173144846}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This place is one of my all time favorites! The property is located right in the heart of Sedona, yet private on Oak Creek. The cabin's are perfect - very clean, comfortable, light, and airy and the entire property is well cared for. We only had lunch by the creek one day, as it's a little pricey for lunch, but it was very nice to sit by the creek and enjoy the day. Room service was excellent, and although the spa is very small, we liked our services. This is a great place to go for relaxation. It's so convenient to drive through the mountains, explore Sedona, and enjoy all the local places. At the end of the day, you will be looking forward to retreating to L'Auberge.", "title": "Beautiful and relaxing property in a great location", "user": "ArCandyGirl", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172897992}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "From start to finish auberge was awesome- stunning location on oak creek, beautiful cabins, lovely property, sweet sedona air, a few degrees cooler being down by the creek. But most significant was the service. We were a little disappointed with the lack of privacy at our garden cabin, and Ryan kindly moved us to a creek side cabin. Our porch overlooking the water was paradise surrounded by trees. My husband and I couldn't have had a more relaxing romantic holiday - thanks to the team for going above and beyond. The champagne was a generous touch. There is no nicer place to stay in Sedona.", "title": "Awesome experience", "helpfulness": 2, "user": "Lisa K", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172743008}, {"rating": 5.0, "title": "Absolute Perfection", "text": "From the moment I arrived with my puppy, I was certain we were in for a real treat. The staff accommodated every single need, round the clock. The outside shower is amazing. The concierge paid extraordinary attention to detail. Breakfast by the creek was both delicious and beautifully refreshing. The spa was heaven.", "helpfulness": 2, "user": "Lisa O", "date": "August 16, 2013", "id": 172452836}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Thank you for an unforgettable stay!", "title": "Do you want an experience or a hotel stay?", "helpfulness": 1, "user": "Kelly F", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 172390389}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We just returned from Sedona and our stay at L'Auberge, and I have to say once again I wish I had read the reviews first. What I reallly don't understand is how anyone can rate this five stars (Excellent) If were using this site, it's to get honest feedback on the good the bad and the ugly, and this place is all ugly. First, the rooms are old and tired, and the bed and pillows need to be changed. I opened the mini bar and it was empty. I thought it just had not been stocked by room service and called the front desk, and they told me it was there in case we wanted to go shopping and put things in it, uhhh I don't want to go shopping, I'm paying a lot of money to have things brought to me. We booked a creek side cottage and one previous review here indicated homes across the creek, and that is true. I was surprised to find the creek was only approx. 40' wide at the most, and right on the other side are private homes. During our stay from Thursday-Sunday there were large family groups with kids and dogs all having fun, which I'm not against, but I don't want to pay a bucket of money to share my space with the neighbors. All of the cottages look at each other in some way, so no matter what you book you will not have toatl privacy. Now the creek is not like right out the door, it's down a slope with steps that everyone can use, so to be honest I'm not sure I would even pay for the creek side cottage, it's misleading a bit.", "title": "Really Bad ", "helpfulness": 27, "user": "Hellooooooo", "date": "July 7, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 8073119, "likes": {"liked": "— Nothing", "disliked": "— Food, service"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2007", "text": "There is no pool. How can you have a hotel in AZ and have no pool????? they tell you to use the pool at a sister property next door. Okay let me give you the lay of the land. The hotel is at the bottom of a large ravine that you drive down to. The sister property is way at the top on the main road, to get there you either drive up or you can hike up a very long and steep path. The sister hotel is an old Best Western they changed the name on and the pool is so small that you may be able to get 20 people in there at best, bottom line is your not going bother. The spa was a joke, don't waste your money or time. The restaurant is in the middle of the property on the creek, with the creek side cottages on both sides going down the creek. The other side from where we were staying had the cottages further away from the creek and had a grass lawn in front of th creek side cottages. I'm telling you this because if you stay in these creek side cottages this is where they have all of the functions, weddings, meetings, events and so on, I don't think you want to pay a lot of money to have events taking place right out front of your room.", "title": "Wedding Gone Wrong", "helpfulness": 20, "user": "BrettE", "date": "June 28, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8022578, "likes": {"liked": "— Setting", "disliked": "— The fact that they just couldn't get it right"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The restaurant, was really bad. The first night we stayed here we went to the restaurant for dinner. The setting on the creek is very nice but that changes quick when your swatting flies away and being eaten alive by mosquitos. I remeber looking over at a woman at the table next to us and she had flies all over her back and in her hair, gross. We ordered a really nice bottle of wine right away, it never showed up, by the time our apetizers were done and had reminded the waiter twice about our wine, we just told him not to bother. The service and quality is very low.", "title": "Read this before booking L'Auberge", "helpfulness": 20, "user": "FlyingLRanch", "date": "May 31, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 2.0}, "id": 7724509, "likes": {"liked": "— not sure", "disliked": "— rude front desk women"}}, {"rating": 2.0, "title": "dissapointing service and food", "text": "If your thinking about room service here you may think twice, as the room service menu is one page and only offers a few choices and I really do mean like two or three items to eat and drinks.", "helpfulness": 11, "user": "laloNyc", "date": "May 22, 2007", "id": 7671821}], "location": {"country": "United States", "city": "Sedona"}, "stars": 4.5, "variance": {"poor": 30, "average": 60, "very good": 120, "terrible": 15, "excellent": 725}, "aka": "l`Auberge De Sedona Hotel Sedona", "slim_ranking": 0.0666666666667, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "L’Auberge de Sedona has the privilege of being one of the most beautiful hotels in the world. Surrounded by the towering red rocks of Sedona, we have an extraordinary and unique location on the banks of Oak Creek, where the air is cooler, the scenery even more beautiful and the atmosphere so tranquil and romantic that even the most seasoned traveler is awestruck. With staff who genuinely care – who greet you with warm, sincere smiles and go above and beyond to ensure you have a truly magical stay. We offer 87 meticulously appointed guest rooms and cottages spread across 11 acres of landscaped grounds. The cottages all have fireplaces and private decks; most have separate outdoor showers. Have a romantic dinner on our creekside patio, and you’ll see why L’Auberge Restaurant on Oak Creek was named \"One of the Top Ten Restaurants in the Southwest\" by Condé Nast Traveler. We’ve also received the Wine Spectator’s \"Award of Excellence\" 19 consecutive times. Our $25 million refurbishment includes a new indoor/outdoor wine bar and dining patio and an expanded spa for lounging after your day’s activities. And if you want more, there are lots of extras like yoga classes, daily duck feedings, evening stargazing sessions and pet-friendly rooms.But don’t take our word for it. Just read what our guests have to say."}