{"user_rating": 5.0, "review_count": 89, "name": "L'Auberge Saint-Pierre", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Have stayed here on many occasions with family and with students. Can't say enough about the warm hospitality shown by all the staff, especially owner Bernard Arrossamena and his parents. When I have stayed with groups of students or teachers in the past, food was always hot and delicious, and the staff have gone out of their way to honor special dietary requests. Rooms are always clean and tidy, and l'auberge is a quiet, comfortable place to stay. Would highly recommend to anyone visiting l'archipel!", "title": "Superb Hospitality! :)", "user": "terre-neuvienne", "date": "August 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 173952237}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Brigid and I were very impressed with the kindness and hospitality we received the moment we walked in the door for our 2 day stay in Saint-Pierre. A young man called Pierre was very welcoming and helpful, and arriving in the early evening he gave us instructions to find a good place to eat that night - we were not disappointed - the meal was delicious, and the price very reasonable. Same goes for the Auberge Saint-Pierre, with free intenet access, clean modern room with walk in shower and toilet, a welcome fan in the bedroom, and dream breakfasts all for just 99 Euros for 2 people for one night! This place has truly earned its 5 stars. Thank you Benedicte, Pierre, Patron and all at L'Auberge Saint-Pierre for a truly memorable stay. We can't wait to come back!", "title": "L'Auberge Saint-Pierre", "user": "David A", "date": "August 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173720387}, {"rating": 5.0, "title": "Wonderful weekend at Auberge St Pierre", "text": "We have just returned from a lovely weekend spent at L'Auberge Saint Pierre. The accomodations were clean and comfortable and the staff (Angie and Benedicte in particular) were exceptional! Restaurants and activities recommended by the staff were not disappointing and the wine basket and breakfasts included were a special treat. We cannot wait to return for a longer stay and will definitely make reservations with L' Auberge SP again.", "user": "Eastern-Cdn", "date": "August 18, 2013", "id": 172886867}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "L'Auberge Saint-Pierre is A GREAT choice for accommodation on the island. The rooms are exceptional. We stayed in the large suite and it was worth the extra cost. Nice basket or wine and treats when you arrive.The staff is very helpful with anything the client might need. The breakfast is plentiful, varied and very good. Loved it! We highly recommend this hotel.", "title": "WONDERFUL HOTEL", "user": "RICHARD C", "date": "August 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172826847}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The only issue we had was the day after we arrived it was a holiday on the island and everythign was closed. It would have been nice to have been told that by the staff as we had no idea when we asked them about the mueseuns,etc. Apparrently neither did they.", "title": "Pleasant memories", "user": "1930Carmel", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172408858}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Small, cozy, simple but great service ! Our expected arrival date the flight was cancelled and they allowed us to change our reservation free of charge and no hassle. When we arrived the next weekend we were created with friendly service the room was clean and modern, rather small but it was no big problem. We were late getting up one morning but they left the breakfast out for us. ( eating breakfast there is absolutely charming and very french ) . They also let us check out around supper time because the flight was late ! When we return to Saint pierre there's no where else I would stay !", "title": "Like a home away from home !", "user": "Dakotahn", "date": "April 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 157507337}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "After almost two weeks on a 90 ft converted fish boat in the North Atlantic , on our arrival at L'Auberge we found the hotel to to have Excellent customer service, friendly staff and very nice rooms.", "title": "Review of L'Auberge Saint-Pierre", "helpfulness": 1, "user": "CR107", "date": "December 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 147852192}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "When I booked the room a month before our arrival the booking was easy and on arrival the receptionist remembered making my reservation.", "title": "GREAT WEEKEND", "user": "Harry H", "date": "November 9, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 145008323}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My wife and I had a great weekend on Saint-Pierre and the L'Auberge Saint-Pierra only added to it. The room was modern, clean and had every one could wish for. Angie the receptionist/housekeeper and all round staff member was wonderful, she was friendly and helpful and nothing was too much of a problem. We would definatley recommend it. The hotel is a littel way from the main business area but only a short wake which is great before and after dinner and if you can't make that a taxi is only 4 euro.", "title": "Friendly and helpful", "helpfulness": 2, "user": "Declan D", "date": "October 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 144057309}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Wonderfully friendly and helpful hotel. We were badly let down by another hotel on the island that took a booking but never confirmed, when I contacted that hotel 3 days before our trip they told me \"Oh yeah we didnt get around to emailing you but we have no rooms available\". I thought we'd have to cancel the trip but L'Auberge had space and proved to be a great location. The staff spoke English well, the girl at the front desk was very helpful and pointed us towards some great restaurants and shops in town. Breakfast was nice and a good start to the day. It is a little \"outside\" the center of town but it's a very small town so just a 5-10 minute walk brings you into the center of everything.", "title": "Wonderful European style hotel", "helpfulness": 4, "user": "Steven C", "date": "October 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143062545}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "L'Auberge Saint-Pierre is the perfect choice for accommodation on the island. The rooms are exceptional. The staff is wonderful and very helpful with anything the client might need. The breakfast is plentiful, varied and very good. Loved it! We highly recommend this hotel.", "title": "Wonderful Stay", "user": "Sharon M", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171918230}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "Our friends in NIagara-on-the-Lake, recommended Auberge Saint Pierre to us. They had stayed there 2 years ago and found it charming. I was relieved to discover that the 10-minute walk uphill is very pleasant, even on a hot day! The room was small but immaculate with a very comfy bed, white crisp linens, plush white towels, desk and mounted Sony TV. The bathroom contained amenities imported from France - French toothbrush and toothpaste daintily boxed, and a razor and shaving creme, also boxed, as well as a sewing kit, shampoo and soap. The biggest surprise of our stay was the bountiful breakfast - Continental but including sliced ham, hard-boiled eggs, chese, fresh fruit basket, yogurt, applesauce, jams and butters from France, as well as fresh local croissants, pain au chocolat, and rasin buns, coffee, tea and several juices. The other surprise of the trip to the Auberge was the knd, personal service from Benedicite and Pierre. These two young people are wonderful resources on everything on the island and are eager to share it in either French or English. Even the owner, Bernard, was most gracious and grateful for my feedback. We can't wait to return!!! Merci infiniiment!!", "title": "Delightful stay at Auberge Saint Pierre! On espere de revenir!", "user": "Maria R", "date": "August 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171814193}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We celebrated our 25th anniversary here ! The staff were great....we were given flowers and chocolate which made it more special. The room was nice and very clean. We would recommend this place and would stay there again!", "title": "Excellent!", "user": "janicedalley99", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171655620}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We visited St. Pierre for three days in July 2013 and stayed at this hotel. It is a beautiful place to stay. We were given a very warm welcome and the staff were excellent. It also included a very nice breakfast with a variety of fruit, cereal, croissants, etc. We would like to thank Angie, Benedicte and Pierre for all their assistance. We would definitely recommend this hotel.", "title": "Great Place to Stay", "user": "barb_nf", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171605239}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Great spot; very clean and stylish; we would definitely stay there again! Plus, the staff were fantastically kind AND helpful!", "title": "Great spot; would stay again!", "user": "Christie H", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 171501843}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "The rooms were very comfortable and had all the amenities of a larger hotel. The breakfasts had a wide variety of delicious foods, and the staff were wonderful-very friendly and helpful. They made dinner reservations and called taxis for us and helped us in other ways.", "title": "I would definitely stay here again", "user": "Happy T", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170999589}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "set amongst a quiet residential street is this charming super clean hotel that boasts super cleanliness,friendly staff and a great breakfast", "title": "highly recommended", "helpfulness": 2, "user": "goldlo", "date": "July 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 168407519}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "note it is an easy walk to the centre part of the town where the cafes are", "title": "Quick Stay", "helpfulness": 1, "user": "Mark A", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 168041479}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "This was our first stay at the L'Auberge Saint-Pierre. Interior was very well maintained and newly renovated. Service was very friendly and helpful. We stayed in the Suite which was essentially a hotel room with a small side room great for drinking wine. A small welcome basket was in the room waiting for us and breakfast the next day was included and was a welcome treat. It's an easy 10 - 15 minute walk from the ferry which we did instead of the 5 minute taxi ride. Their recommendations of bakery and fine dinning was perfect. WIFI in the rooms and even has adapters for european style plugins. Service was available in english and they even put up with my less than satisfactory attempt at french. Would stay again.", "title": "Great room, clean, good breakfast, newly renovated", "helpfulness": 2, "user": "kingswood1", "date": "April 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159301823}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Outside is deceiving, inside is modern, renovated, clean and rooms are well appointed. Had a large room on the second floor with a king bed and a seating area. Flat screen tv, new bathroom, great breakfast ( included in price), lots of pastries, cakes, breads, homemade jams, strong coffee, yogurt, fruit, everything you need. Note: no cream for the coffee, they offer only milk. King bed is two twins fastened together so it was uncomfortable in the middle of the bed, but lots of room to move around so did not bother me. About a 10 minute walk to shops and restaurants, very quiet neighborhood. They also speak English here, in case you can not speak French. Will be back!", "title": "L'Auberge Saint-Pierre, C'est Bon!", "user": "Trevor B", "date": "April 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158195897}], "location": {}, "variance": {"poor": 1, "average": 2, "very good": 11, "terrible": 0, "excellent": 75}, "aka": "L'Auberge Saint-Pierre Saint-Pierre And Miquelon", "slim_ranking": 1.0, "description": "L'auberge Saint-Pierre, un hôtel à Saint-Pierre et Miquelon-Notre hébergement se classe dans le milieu de gamme supérieur\" ce qui signifie \"hébergement très confortable doté d'aménagements de qualité appréciables et offrant plusieurs services et équipements\".Située à quelques pas du centre ville, vous serez sûr d'être accueilli dans un cadre convivial conciliant l'authenticité de l'expérience de toute une vie et le service soigné d'une structure hôtelière moderne.Ses fondateurs, Bernard et Rita se feront une joie de vous accueillir."}