{"user_rating": 4.5, "review_count": 120, "name": "L'Habitation", "reviews": [{"rating": 5.0, "title": "All I Needed", "text": "I can't think of anthing else I could have needed. Clean, quiet, friendly and close to the heart of Duval St. Being single and a seasoned traveler this is the type of establishment I love to find.", "helpfulness": 2, "user": "CaboToro", "date": "February 9, 2012", "id": 124350374}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "L'habitation does have a nice location and the house itself is quaint and somewhat charming. But their breakfast was terrible! My husband and I have stayed at B and Bs all over Canada and the U.S. and have rarely been disappointed. But for $200.00 a night for a bed AND BREAKFAST, we expected more than sugery muffins and pastry. We have had better breakfasts at low priced chain hotels along I 75. We definitely do not recommend this establishment. There are plenty of choices out there. I wish we had done better research. I should have been suspicious when there was no description of their meal on the website. I did get suspicious when checking in when I spotted a \"breakfast\" a menu for a local restaurant. The owners should be ashamed.", "title": "Disappointed", "user": "sylvia k", "date": "January 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123778078}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Stayed here over MLK weekend. Had to call a couple of weeks early to add a person to our reservation. Wasn't a problem at all. Stayed in room 19 (upstairs, 2 twin beds plus a pull out twin). They have rearranged the furniture since the pictures on their web site. The new arrangement give more floorspace but watch your head!", "title": "Great value and location.", "helpfulness": 3, "user": "Jason J", "date": "January 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123625070}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We arrived a bit early, but check in was quick and easy. The location is fantastic. There are better locations on the island but you either pay a fortune, or have to sleep with one eye open. We were in town because a friend's band was playing Sloppy Joes, a couple of blocks away. We were out til 2 or 3 AM every night. We did make it to breakfast most days. Fresh croissants, muffins and fruit. There's coffee and tea most any time and a fridge of sodas on the honor system (leave a dollar in the basket). Don't underestimate the value of just sitting on the front porch and watching the world go by, or on the back porch shaded by lush trees.", "title": "overrated and shabby w/ a lousy breakfast", "user": "ned h", "date": "January 24, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 123565606}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "We have already started planning a return trip for longer than 3 nights, and will certainly be looking into l'Hab when we start booking things.", "title": "sweet", "helpfulness": 1, "user": "Brookline_Mike", "date": "January 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123080533}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Room 13 is on 1st floor and you can hear every footstep from above. The shower head was fixed and set for someone 6' and above. Can hear someone taking a shower or flushing toilet. I had to take a cold shower on my 2nd day, no hot water. On 2nd day I found a dead roach on the floor and it remained there until the day I departed (hint, the room is not cleaned). The bathroom window did not open and the bedroom window did open, but no insect screen.", "title": "Don't stay in room 13", "user": "92101travel", "date": "January 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 4.0}, "id": 122766270}, {"rating": 4.0, "stay_parameters": "Stayed January 2012", "text": "For the night, even though we had the front room, it was quiet, comfortable king bed, clean, very tastefully decorated and only 2 mins from Duval St!! You can crawl home! Highly recommended!! Breakfast included, but did not start until 9 am :( Coffee via Kuireg!!)", "title": "Old heritage house charm!!", "helpfulness": 1, "user": "scorprincess", "date": "January 5, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 122550605}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Had another great stay. I stayed here the end of July and already had a trip booked in February. I decided I needed another \"Keys Disease\" getaway before that, so I came down for a few days (December 16th - 19th). The owners were polite, courteous, and gracious. The room was clean as it was last time. The location can't be beat. In the heart of Key West a half block off duval. You won't find a better value at another B&B. Eight weeks until my next trip to Key West, and I will be staying here again. I've found my home away from home!", "title": "Absolutely Awesome Again...", "helpfulness": 2, "user": "Already G", "date": "December 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122034124}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "We had a great experiance. We had to push back our trip by a week because of an emergency and they were happy to help us. The room was even ready ahead of time(not that we expected it to be) and we were able to drop off our bags and find a parkig spot around the corner. I parked the car and didn't have to move it the whole trip! It is a great location off Eaton right next to Duval! We walked wherever we wanted to go. The staff was pleasant and smiling. This was my wife's fist trip to Key West and my first time spending the night on the island. We loved it! The room was quiet and we were comfortable. We stayed in one of the upstairs rooms and only ran into other guests at breakfast. It is awesome for couples. Definately recommending it to my friends and family and would enjoy staying again.", "title": "Couples retreat", "helpfulness": 2, "user": "Jared D", "date": "December 13, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121702743}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Will definitely be staying here again. Perfect location, friendly hosts. Very nice accommodations, we stayed in a room with two beds and a large bathroom - perfect for the three of us. It was on the back of the house, so it was nice and quiet. Great atmosphere with porches surrounding the house, great way to relax. Complimentary coffee and time of day, water and soda for sale at a reasonable price and on the honor system. Was great that we didn't need to hunt down bottled water on the way back to the room at night. Breakfast was a little sparse, but we seldom have a chance to partake anyway. Have been searching for just the right place in Key West - this one is nearly perfect and we will certainly be back!", "title": "Almost perfect", "helpfulness": 1, "user": "BRAT8", "date": "December 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 121597484}, {"rating": 4.0, "title": "Great location", "text": "Enjoyed our stay at l'habitation. Warm friendly staff. Airy cool and clean room. Excellent location just off Duval and close to The Little White House and Audubon House. A few minor improvements could make this outstanding: improve the breakfast pastries...too stodgy,cups/mugs rather than polystyrene and ditch the brown/coloured towels and sheets for white ones.", "helpfulness": 1, "user": "Carol K", "date": "May 6, 2012", "id": 129488780}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We travel to KW about 3 times a year but have never stayed here before. We wanted somewhere nearer the action of Duval without a 3 night minimum and this was it. I had read the reviews about breakfast and agree it is not a good offering of food. But we had come prepared with our own food as a result. All the owner would have to do is add a few boxes of cereal out there and some milk and it would help, as not everyone wants to start their day with donuts and muffins. I had a bit of the fruit they had and was glad I had been pre warned by the TA reviews to not expect more!", "title": "A good place to stay with both pros and cons", "helpfulness": 1, "user": "uktomiami", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 129243520}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "That is a con, but the bnb has plenty of pros too. The location is excellent. Right off Duval and halfway up on Eaton St, nothing is too far away to get to by foot. They have a charming porch out front and a nice water and drinks system that you donate money to an always stocked fridge if you need a cold bottle of water. The staff are friendly and helpful, and Maria who cleans the room is a sweet pleasant girl, happy to help with anything you ask her.", "title": "A good choice but with a few oddities", "helpfulness": 2, "user": "halifaxborn", "date": "April 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 127270165}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We will go back on our next trip.", "title": "Great Stay", "helpfulness": 1, "user": "parrotheads03", "date": "April 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127254255}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "The proprietor calls it \"a small hotel\", but L'Habitation is really more of a bed-and-breakfast. And the emphasis is not on the \"breakfast\" part, which consisted of a plate of croissants and a bowl of fruit. Fortunately there are a couple of coffee shops within a block.", "title": "Great location!", "helpfulness": 3, "user": "Slcalabrese", "date": "February 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 124832163}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled solo", "text": "I stayed here for two nights recently and had wonderful time. Stuart, as was all the staff, were wonderful and very helpful. The room was clean and very comfortable. The shower in my room was a little small, but fine. You can't beat the location either, just a couple of blocks from Duval street and the Green Parrot. If you are heading to Key West, def. check out this place.", "title": "Great place, with great location in Key West", "helpfulness": 1, "user": "brothbart", "date": "July 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 134922118}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed at L'Habitation in Key West - The owner (Stuart) was wonderful - extremely helpful as we had trailered our motorcycles down and it was almost impossible to find a place to park the trailer (I wouldn't recommend doing that- we wont!). Stuart was kind enough to allow us to park our bikes on property - We thank you again!! The rooms were very clean - the only drawback is that the shower was extremely smalland wish there was a pool - not enough room for a pool. The breakfast in the am was continental - but fresh and very good. The locatiion was awesome - walking distance to everything.. We will stay again next year - I defintely recommend this Bed n Breakfast!!!! Excellent!! Thank you- Joe and Lilly from Debary Fl", "title": "Stay in Key West", "helpfulness": 1, "user": "Harley R", "date": "June 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132188475}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We stayed at thsi lovely B & B March 20th and 21st on the advice of friends whom we planed to meetup with at this place. This B & B has great charm with a huge front porch and an upstairs porch that is secluded. This is a victorian style home that was converted to a B & B located close enough to everything. The people we met up with are a littel younger so it was hard keeping up with the nite life, Age is catching up haha. I would definately go again but maybe see the sun rise this time. We went for a sunset cruise on a sailboat that was awsome. The only drawback to this place is parking of the car but once thats out of the way life is good.", "title": "First Time in Key West", "helpfulness": 1, "user": "kevinjrochny", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131416304}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Good value & Great Place. Thanks Stuart", "title": "Great Location and Awesome Donuts", "helpfulness": 1, "user": "AP1108", "date": "May 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130161024}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My husband and I were very pleased with the room we stayed in at this B&B. We are not the type who spend a lot of time in our hotel or B&B, we like to get out and see the city so the light breakfast and no frills approach of this B&B was perfect for us. All we wanted was a clean place to sleep in a great location. This B&B is about a half block from Duval yet very quiet. We like to do a lot of exploring during the day and retire to bed typically by 11pm. I was afraid it might be loud outside considering we were on the first floor but was pleasantly surprised to have a very peaceful nights sleep.", "title": "Dissapointed", "user": "iowabeachcpl", "date": "May 7, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 129556381}], "location": {"country": "United States"}, "variance": {"poor": 6, "average": 12, "very good": 36, "terrible": 3, "excellent": 63}, "aka": "l`Habitation Hotel", "slim_ranking": 0.587628865979}