{"user_rating": 5.0, "review_count": 1725, "name": "L'Hermitage Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "We were very much wowed by the elegance of this hotel and the service was second to none. The staff was wonderful. The room was beautiful and the little shops around the building were so convenient. We would definitely recommend this hotel to any of our friends and it will be our choice when returning to Vancouver.", "title": "One of the most beautiful hotels I have stayed in with the most exceptional service!", "helpfulness": 1, "user": "KCBN2013", "date": "May 28, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 162165299}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Every hotel we stayed at during our road trip was compared back to L'Hermitage. The service here was impeccable. You couldn't walk in or out without a \"hello,\" \"good morning,\" \"good afternoon\" or \"good evening.\" Everyone we met with was very helpful and the concierge went out of his way to help provide tips, maps and some discounts to the aquarium - I mean, who knew there'd be a helpful map of Stanley Park? We weren't expecting that but it was a nice touch.", "title": "I understand why this hotel has top reviews", "helpfulness": 1, "user": "NYTravelingAddict", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162161603}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "We decided to hang out in the lounge when our room was still being made. They gave us complementary tea and coffee while we waited! That was an unexpected surprise.", "title": "Top marks to hotel", "user": "Mark C", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162083053}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The location was good - a bit far to walk from the hotel to Stanley Park if you also intend to walk around the whole park and some trails like we did, but close to other sites. There's also a Starbucks around the corner as well as a supermarket. There's tons of shopping the other way too. Oh, I've never seen this before but there's also a separate elevator bank for residents who happen to live in the same building.", "title": "Wonderful Birthday Weekend!", "user": "Grums", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162060221}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The room itself - huge. It had tons of space and I wasn't in an upgraded suite or anything. The bathroom was a really good size too with a separate glass shower and enough counter space. We never heard our neighbors or any outside noise and the place was spotless.", "title": "SERVICE!!!", "user": "bobca1947", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162056180}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We received a very warm welcome though arriving after midnight. Lovely big room with a patio and faux fireplace. Comfortable bed. Quiet stay. Room is showing a little wear but still lovely. Fabulous service at breakfast. Not a huge selection. At $20/head, I don't think I would have gotten the breakfast if it had not been included in our package rate. Wi-fi was really iffy our entire stay - disappointing. Very well-located. My only complaint is that this hotel also has residences, and we had a negative experience with some grumpy residents.", "title": "Fabulous in General", "helpfulness": 2, "user": "brngckn", "date": "June 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 162759717}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "This hotel is just the perfect hotel for a nice, very pleasant stay in Vancouver.", "title": "Perfect", "user": "Kerstin K", "date": "June 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162709570}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Room (suite) was excellent, fully equipped kitchen, including washing machine and dryer. Very comfortable bed. The staff is extraordinary, very very nice!", "title": "Great hotel but could only stay one night", "helpfulness": 1, "user": "mdcnyva", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162583599}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "We would always come back!", "title": "Excellent experience", "helpfulness": 1, "user": "Dave P", "date": "May 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162555207}, {"rating": 5.0, "title": "Outstanding Boutique Hotel", "text": "Used this wonderful boutique hotel for one night and awaited \"go\" message to go to a great resort further north. It is a hotel you can write a book describing the 1st class service, food...", "helpfulness": 1, "user": "Phillip P", "date": "May 30, 2013", "id": 162484192}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "I highly recommend this boutique hotel. Very nice room, great amenities and absolutely delightful service. I could not chosen a better hotel for my stay in Vancouver. Given some construction across the street and the concern about noise, the hotel offered me a complimentary upgrade and 20% discount for the hotel restaurant. I must say, the noise wasn't even a problem and the hotel's attentiveness and concern about my comfort was greatly appreciated.", "title": "Wonderful!", "user": "fortunecookies", "date": "October 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142829529}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We spent a 4-day weekend at L'hermitage (Didn't realize it was Canadian Thanksgiving weekend until we got there, but fortunately things don't close up in Canada like in the US for T'giving.) The staff was outstandingly helpful & friendly, especially the concierge. He gave us daily detailed & helpful information on transportation, restaurants, what to see, what was closed for the holiday, etc. The room was lovely & a pretty good value, considering how expensive everything else in Canada seems to be for Americans now. No complaints other than the loud construction across the street during the day, which the hotel warned us about & apologized for.", "title": "Great hotel in all respects", "user": "rubysdadatl", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142825208}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Fantastic hotel. The service is truly the best - every member of the staff was friendly and gracious, and the rooms are beautiful and thoughtfully decorated. Easily one of the best hotel experiences I've had, and I wouldn't hesitate to recommend it to anyone!", "title": "Simply the best", "user": "beenooch", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142777433}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "From the moment I arrived at this hotel - I was welcomed and treated as if I was a special guest returning for the 10th time. Its my first time here but certainly not my last. I've been called by name each time I see the porter who first helped me with my bags, the house maids put up with me working in the room even when they wanted to clean, the wireless internet worked better than many I have experienced, good coffee via nespresso in the room, the pool was virtually my own and warm warm warm, and the gym excellent with equipment that worked and was in good order. The hotel has a really nice space to sit and have tea/coffee or get a glass of wine in the evening and even the staff there seemed to get to know who I was and what I liked when. A great local foodstore, many restaurants within walking distance and probably one of the best massages of my life in the nearby Thai Smile Massage, I'd be hard pressed to think of a better place to stay. A bit of building going on across the road but - it didn't disturb me. And - you can open windows yay! A number of larger rooms also have balconys. I recommend L'Hermitage with absolutely no reservation - it deserves its place at the top of Vancouver Tripadvisor and every single member of the staff I have had dealings with have been superb. Thankyou to all of them and I hope the management (who clearly do a good job as the hotel functions so well) know how good a team they have. Do give into the temptation and eat at Hawksworth Restaurant just a few blocks walk... i did twice and both times were stunning. Thanks to L'Hermitage for being a great home for a week.", "title": "Really - could not have been any better", "helpfulness": 1, "user": "kmaway", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142754108}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed at L'Hermitage in a Boutique Room for 8 nights in total and found it of a very high standard in all ways. The staff were incredibly friendly and helpful, always acknowledging us when in the morning and when we came back into the hotel. The room was immaculately clean and spacious with everything we could have needed and the bed was very comfortable with beautiful linens. They also left us a card and box of chocolates to acknowledge our anniversary which was a nice touch. The hotel is in a great location to access the main city centre - everything is within walking distance. We would definitely stay again - hopefully the construction on the other side of the road will be finished by then. Q4 Al Centro which is directly next door is a fantastic restaurant with delicious food and due to the construction they generously gave us coupons with 20% off meals - a great bonus.", "title": "A Lovely Stay", "user": "WellingtonKiwibrit", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142752393}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We booked a room with special package (parking+breakfast). Reception was very helpful and friendly. Right after checking in, we forget something in our car and the valet staff went to our car and bring it to us. We appreciate a can-do attitude of the staff very much. We also received an upgrade to a suit on the 7th floor. The room is modern, very comfortable and functional. There are a bedroom, two bathrooms, office, full kitchen+Nespresso machine, living room with fireplace, a washing machine and a dryer. Sleeping quality, excellent.", "title": "Wonderful hotel", "user": "Kitty S", "date": "May 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161949034}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Breakfast is not huge but more than adequate and with good quality products. We enjoyed everything in this hotel. We will definitely stay here when we are in Vancouver next time.", "title": "Free Uprgrade", "helpfulness": 1, "user": "Carolyn111_12", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161696009}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "We had a two night stop over in Vancouver and chose L'Hermitage. Great choice. We were greeted by friendly staff at check in who kindly upgraded us to a Signature Suite ( having booked a Boutique Suite). The suite has all you could ask for. Bedroom, living room, full kitchen, study, bathroom and, tucked away in a closet - laundry machines. Heaven!", "title": "Great Stop Over!", "user": "bella10262", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 161644370}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We have stayed in worse hotels for a lot more money in the past and will definitely visit L'Hermitage again!", "title": "Wonderful Stay in Vancouver", "user": "IdaBaugh", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161638788}, {"rating": 5.0, "title": "By far the best hotel we've stayed in", "text": "We stayed at L'Hermitage for one night in May while business. On arrival without asking we were upgraded to a superior room. The staff were all excellent & couldn't do enough for you. We had breakfast in L'Orangerie & it was fantastic & value for money (we ate outside). Great service from start to finish & amenities through out the property are superb, the hot tub was fun & very welcome after 17 hours of flying! Free WiFi that works in all areas of hotel a bonus. L' Hermitage has a restaurant Q4 Al Centro which we ate in & were served by the lovely Caroline, who could not have been more helpful. We had the best grilled prawns ever. This hotel deserves all the great reviews. (There is building work going on across the road but it did not interfere with our stay).", "user": "cadaid", "date": "May 23, 2013", "id": 161608270}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "L'Hermitage is very central, close to shops and to the seafront. Our room was beautiful and very comfortable. Bathroom was excellent with separate shower. The staff were very helpful and friendly. Would highly recommend L'Hermitage.", "title": "Fabulous", "user": "Stefan K", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142362627}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel is in a great location, minutes away from the big shops, grocery stores, restaurants and bars and liquor stores. Everything about the hotel is 5 stars and the staff are accommodating, friendly and very welcoming. We had breakfast at the hotel the first morning but found it a little restrained - a complete opposite to the staff in the foyer/office. The next morning we found a lively local restaurant where we could watch the locals socialising and going to work and enjoyed that a lot better.", "title": "Refined", "user": "mayaPerth", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142358848}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "What a wonderful place. In addition to all the other nice things that others have said here, what stood out for me was the attention to detail, amazing focus on customer service from ALL staff, without exception; the quality of rooms, bed, fittings, food - and very good value for money. We'll be back and have already recommended it to friends. Oh, and the courtesy bikes just add that extra bit of accessibility in what is becoming a terrific city for two wheeled transport.", "title": "This was so nice, I almost don't want to tell anyone...", "user": "5Bilbies", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142354681}, {"rating": 5.0, "title": "Best hotel service", "text": "My wife, kids (10&7) spent three days in vancouver at the end of a months travel throughout canada and california. This hotel had the best service we experienced. The room and kitchen were great, the location perfect. The staff were very attentive and kind. The manager was especially helpful towards our kids. I hope his dog Hippo recovers from his operation!", "helpfulness": 2, "user": "Andrew J", "date": "October 8, 2012", "id": 142351056}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This one is recommended.", "title": "Superb!", "user": "TimVictoria", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142317405}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "This is simply the best hotel I stayed at.", "title": "Best hotel I've stayed at", "helpfulness": 1, "user": "Smokiedokie2", "date": "October 9, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142430980}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "great location, downtown, few blocks from train station. There is a London drug store close by. Staff was so nice and helpful. They spent a lot of time helping me find the places I wanted. The rooms were spacious. The bed was unbelievably comfortable. The service was just great. You park on street right outside the hotel, there is no other place to park. You have to go in to get someone to valet your car(which was easily done)", "title": "a great choice", "user": "KatieDuncs", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 142417293}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Great location, beautiful room and very clean. Huge bathroom, great bed. No problems from noisy guests (a big bugbear of mine), construction kicked off around 0730 hrs weekdays, but this is when I like to rise anyway, so wasn't a problem for me. Very nice complimentary toiletries in bathroom which were replenished every day (excellent).", "title": "Amazing Anniversary Getaway", "helpfulness": 2, "user": "jasmyne", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142411056}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "VERY friendly staff, they go out of their way to assist, and this is very, very impressive. They handled a small mistake very professionally and we left Canada very happy. No hesitation in recommending this hotel, it is top class. Get well soon, Mr Hippo.", "title": "Home Away from Home", "helpfulness": 1, "user": "msyolee", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142400523}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My husband and I love Vancouver, BC so of course it was a no brainer to spend our second year wedding anniversary here.", "title": "Great Hotel", "user": "riderite", "date": "October 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142398892}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Perhaps I expect too much when booked to stay at a 5 rated botique hotel. If we had not encountered a problem at the reception desk upon arrival I may have overlooked some of the normally just slightly annoying issues and given an excellent rating. However, upon arrival we were informed it is hotel policy to have a credit card for any additional charges (read that as damage although they at first said breakfast), to which my daughter explained she had left her card on the table at home but was willing to provide a cash deposit. I strongly believe that if I had not stepped in to ask to speak to someone other than the gentleman who intervened and was adamantly unwilling to be more helpful that irritated me. I persisted as the room had been pre-paid. The general manager was called and did allow for a modest cash deposit. On to the room.", "title": "Perfection marred", "helpfulness": 1, "user": "sigehaizi", "date": "May 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 161513884}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I was quite taken with the spaciousness, decor (except the massive television stand - it did not suit the suggestion of quiet, modern comfort). The shower and bath were separate - my preference and well stocked with towels and bathing products. I was pleased the clothes hangers could be removed for easy hanging up of clothing but very disappointed at the tattieness of the robes - certainly not worth the stated value of $75.00. We had a king size bed, not as soft as I would prefer but for which I was grateful as this was a much needed diversion after 1 1/2 months in Victoria of sleeping on a loveseat while helping to care for my ill mother. We were happy with the service to any possible needs we might require and the promptness of response to requests. The patio was well screened and would most likely have been a pleasant respite if not for the rain. I was quite impressed with the fireplace although we did not use it. It helped to make the room cozy.I did have a wonderful rest - did not hear any of the construction on the street the following morning.", "title": "Luxury hotel at affordable rates with great service", "user": "Vivianite", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161424920}, {"rating": 5.0, "title": "Top Spot", "text": "My only other issue was how difficult it was to find light switches for the lamps - when I did finally find one it was a step on style with the button placed in such an awkward space between a chair and the desk it took some contortionist movements to use. In addition, the desk lamp was unplugged - an inconvenience. (These are the points I may have otherwise overlooked as merely annoying if I was not disappointed with the initial service).", "user": "John G", "date": "May 21, 2013", "id": 161391718}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The concierge and front door service was much better when we asked for suggestions and directions for dinner and breakfast. L'Hermitage is within walking distance of wonderful restaurants, the Vancouver Art Gallery (one of our intended destinations), the library, CBC and other attractions. Visitors were welcomed with a quick call to the room and then ushered up rather than our having to go to the lobby.", "title": "Second visit... no regrets!", "user": "MandB56", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161337918}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "With the initial upset at the front desk I am happy to say we had a pleasant stay, however, if a credit card is necessary for future visits I will not choose to stay there again nor will I suggest it as a place to stay to others - with or without a card.", "title": "In a word , Perfection", "user": "Janet W", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161060385}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I have stayed in many hotels. This was by far the very best of them. Not because the facilities were so great which they were. But rather because of the attitude of the people running the place. Authentic and warm at every level. Great place", "title": "Great people make great hotels", "user": "terrylev", "date": "October 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 142663965}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "My fiancé and I stayed for three nights and were very impressed. The staff was extremely friendly and helpful. The rooms were a perfect size, clean and very comfortable. Location was walkable to restaurants, shop and waterfront. We would stay here again and recommend very highly!", "title": "Beautiful hotel", "user": "Drstephi", "date": "October 12, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142661324}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed at his hotel for one night. Very clean, great location. Customer service was absolutely outstanding. We reserved just a small room, but were upgraded to a 1-bedroom suite. Most comfortable bed, super clean linens, fancy appliances, espresso machine in the room! The hotel has a personal touch which is highly appreciated. We will be back!", "title": "Excellent hotel, outstanding service", "helpfulness": 1, "user": "Inna R", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142605638}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Just got back from a one night stay at this amazing hotel. We were going on a quick get away to the city and after reading the reviews on trip advisor decided to book at L'Hermitage. The customer service is top notch. Starting at the front desk and with every other employee in between. There is some construction going on accross the street so it can be a bit noisy in the morning if your not up early. Didn't bother us though. The room is beautiful we stayed in a suite and the breakfast in the morning was delicious too.Wonderful patio on the 5th floor where we had a glass of Its walking distance to all downtown attractions and the front desk recommended some great places as well. Lots of little touches make this a must stay in Vancouver.", "title": "perfect location, beautiful rooms.", "user": "tml0127", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142491382}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "My wife and I thoroughly appreciated the room design, excellent staff, and wonderful location. Wish we had more than a night's time to visit. We definitely recommend this hotel to anyone who appreciates a well designed and top notch establishment.", "title": "Superb Experience", "user": "Steve F", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142484428}], "location": {"country": "Canada", "city": "Vancouver"}, "stars": 4, "variance": {"poor": 7, "average": 24, "very good": 166, "terrible": 5, "excellent": 1523}, "aka": "l Hermitage Hotel", "slim_ranking": 0.0103092783505, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Located on the corner of Richards and Robson Street in the very heart of Vancouver's hottest shopping and entertainment district and only blocks from its' financial centre, L'Hermitage Hotel Vancouver is a 60-room, luxury, boutique property that graced the Vancouver hotel scene in June of 2008. Exclusively located on the 5th, 6th and 7th floors, L'Hermitage offers Studio-style rooms; One-bedroom Suites; Solarium-style rooms as well as One and Two-Bedroom 'homes' complete with a fully-equipped kitchen featuring Bosch and Sub-Zero appliances. Unique architecture within a West Coast setting, vogue interior design and thoughtful amenities makes L'Hermitage Hotel Vancouver the essence of the ultimate cosmopolitan getaway. When selecting your hotel for your next Vancouver business or leisure trip, please consider making your reservation with L'Hermitage Hotel Vancouver."}