{"user_rating": 4.0, "review_count": 400, "name": "L'hotel Causeway Bay Harbour View Hong Kong", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "My kids and I stayed at this hotel for 3 nights. The hotel itself is lovely. As I was travelling with my kids (ages 15, 11 & 7) on my own I wanted to have them in an interconnecting room or at least in a room on the same floor as they said they could'nt accommodate all of us in one room. We did book 2 months ahead but they still told us they would not guarantee either. On check in the hotel said that none were available and the best they could do was put us in a king suite which meant that my 2 girls and I shared the king size bed and my son slept on the sofa. This was annoying but at least they were with me. The suite was very spacious and did have lovely views. As the hotel is relatively new, it felt to me like the staff were learning on the job. It seemed that lots of small things added up and ended up being extremely annoying. One that springs to mind is that when I travel I don't like my room serviced, but even though I put the \"Do Not Disturb\" sign on my door, I would find my room cleaned and made up everyday, even after asking the staff not to! As stated in other reviews, english at reception is a problem, although they are nice but it was very difficult to get the information I wanted and in the end I gave up and worked it out myself. Another problem was that I had booked this hotel based on the lovely pool seen in the pics as its hot and I thought that it would give my kids something to do, after a day shopping, well the pool is there and looks very inviting but its padlocked as the council has yet to give it approval. The location is nice and not as busy at Kowloon, which is what I was looking for but I think next time, we'll stay around Admiralty as that is on the main line and doesnt require a change of trains, having said that it only takes a few minutes on the train anyway. In summing up, the hotel was very nice, but the service side of things really let it down.", "title": "NEW, MODERN AND NICE but dont bring your kids..", "helpfulness": 6, "user": "Pittwaterblue", "date": "September 12, 2006", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5794869, "likes": {"liked": "— The rooms were lovely", "disliked": "— Service"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We stayed two nights in this hotel in late July. The location was the best part - opposite the MTR so it was prefect for travelling around Hong Kong (its so easy to get around the city and areas like New Territories). The hotel is also nice and close to Victoria Park and all the shops at Causeway Bay.", "title": "Great location", "helpfulness": 4, "user": "Purle3121", "date": "August 26, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5710463, "likes": {"liked": "— Location", "disliked": "— Restaurant staff"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "The room was standard but nice - we had a good view of all the high rises. It was a good size. The heated bathroom floor was pretty nice!", "title": "Great location", "helpfulness": 4, "user": "Purle3121", "date": "August 14, 2006", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 5607894, "likes": {"liked": "— Location", "disliked": "— Restaurant staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006", "text": "The reception and concierge staff were lovely and very helpful but the staff in the restaurant were a bit funny (their job keeping the restaurant nice and organised seemed more important than making sure the guests had what they needed).", "title": "Highly Recommended", "helpfulness": 13, "user": "DontGo4_2ndBest", "date": "July 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5466678}], "location": {"country": "China", "continent": "Asia"}, "stars": 4, "variance": {"poor": 15, "average": 83, "very good": 208, "terrible": 11, "excellent": 83}, "aka": "l`Hotel Causeway Bay Harbour View Hong Kong Hotel Hong Kong", "slim_ranking": 0.233273056058, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}