{"user_rating": 4.0, "review_count": 81, "name": "La bastide d'Eygalieres", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We spent one night at La Bastide in a room on the first floor. It had been recently renovated and had a walk-in shower with a rain showerhead. Those who like soft mattresses will love the bed. The host was very helpful, dinner was very good and the breakfast croissants were delicious.", "title": "A very pleasant stay", "user": "Chandolin", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 167237058}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "We came to stay so as to attend a wedding. we could not have asked for more: Comfortable and straightforward rooms with a homely feel. beautiful grounds. helpful, patient and kind staff and wonderful food. Just perfect for an escape.", "title": "Thanks for a relaxed and friendly stay", "helpfulness": 1, "user": "natasha o", "date": "June 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 164945061}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We were here for the second time. Last year we had a room with a terrace on the ground near the swimmingpool. Now we slept on the first floor. The room with the terrace we liked most, unfortunaly he was not available. The food ws good.", "title": "This is a good hotel in beautiful village!", "user": "Anneke M", "date": "April 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 158973029}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed at La Bastide for about a week in early October. The room (#10 - a premium cost corner room, a little larger, beautiful views) was perfect, and the dinners we had at the hotel were exceptional. The pool was cold, so only brave souls partook of it, but we enjoyed many afternoons beside it. Our friends were next door in room #8, and they were just as pleased with their accommodations. Breakfasts were robust and good. The proximity to Eygalieres meant it was a nice walk to town or a very short drive. And what a great little village! And an easy drive to many places of interest in Provence.", "title": "Our First Stay Hopefully Won't Be Our Last!", "helpfulness": 1, "user": "DavidAtSwans", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143620074}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "If we had any complaint it was this: the very helpful owner was directionally challenged, meaning that his directions were quite inadequate, so if you seek directions to anything, ask him to give you a detailed map AND written directions. Saying, \"You can't miss it\" just didn't cut it for us, since we got lost both times we relied on his directions. We commented on this while there but maybe to no avail. At least ask. But by no means was this something that would keep us from coming back!! Just something of which you should be aware.", "title": "Third stay in 6 years", "user": "Hugh1942", "date": "September 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141504210}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "variance": {"poor": 2, "average": 10, "very good": 37, "terrible": 1, "excellent": 31}, "aka": "La Bastide d`Eygalieres Hotel", "slim_ranking": 0.333333333333, "description": "This charming small luxury hotel is ideally placed to discover this magnificent part of the south of France. Local attractions include Saint Rémy de Provence, Arles and its Roman amphitheatre, the Pont-du-Gard and the typically Provencal towns of Avignon and Aix-en-Provence.The cooking is fresh and leaves a large part for organic products.All of this will leave you with a memorable experienceof Provencal hospitality in a holiday establishmentbrimming with charm."}