{"user_rating": 5.0, "review_count": 97, "name": "La Casa de Mis Recuerdos B&B", "reviews": [{"rating": 4.0, "title": "Sweetest Mexican B&B", "text": "Colors, birds, warmth, great food. The sanctuary of this B&B is the best. Run by Nora and her family, the breakfast time is a great place to meet the family and other travelers and indulge in the local fruits and pastries as well as the home-cooked dish that changes every day. Nora also changes her tradtional outfit daily as well as the dining tablecloth. It is a feast for the eyes. Pino Suarez is on a rather busy street, but if you are in the back it is quiet and you are serenaded by the birds which over-ride all other sounds. The B&B is well located and Nora or William ( her husband) will find you drivers for outings or you can hire Nora for artisanal village or market tours or cooking classes. I can't recommend this Oaxaca experience enough!", "helpfulness": 1, "user": "textiletraveler", "date": "July 17, 2007", "id": 8134264}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "We just returned from our fourth trip to Oaxaca and this was the best ever. Oaxaca is slowly recovering from the political problems they experienced last year. The Centro Historico is better than ever with numerous newly painted buildings and you don´t have to wait for a table on the square. On Sunday we enjoyed sipping a cold drink while the state symphony performed in the square.", "title": "Great stay at the Casa de Mis Recuerdos", "helpfulness": 3, "user": "alf2000", "date": "May 30, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7720362}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled solo", "text": "The Bed and Breakfast itself is a charming example of typical Oaxacan decor. Everywhere you look colorful arts and crafts are displayed. The front garden is done in flagstone surrounded by lush, tropical plants with several private seating areas. We stayed in the Colibri room at the rear, smaller than the front rooms but quieter. The room was very clean and the bed comfortable with a tile patio just outside our door. We awoke every day to the chirping of the family´s several pet birds and enjoyed watching a baby bird, that had been rescued, learn to fly. The whole ambience is tranquil and relaxing.", "title": "such a beautiful place to stay!!!", "helpfulness": 2, "user": "karita_andrea", "date": "March 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7246397, "likes": {"liked": "— it is beautiful and comfortable", "disliked": "— did not have any dislikes"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Our highpoint was a walking (shopping tour) with Nora who seems to know the city like the back of her hand. We accomplished more in one day than we would have in three by ourselves. We are often leary of being \"guided\" while shopping, but we never felt pressure to buy or that the prices were inflated. In fact, sometimes Nora warned us that a price was way out of line. We also learned to differentiate the various levels of quality and workmanship.", "title": "Delightful Experience at Mis Recuerdos", "helpfulness": 2, "user": "MM&NR", "date": "March 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7201825, "likes": {"liked": "— Atomosphere", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Experience Oaxaca, Mexico at its best!", "text": "Will we be back? You bet!", "helpfulness": 4, "user": "texasbarbie", "date": "February 26, 2007", "id": 6841771}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "I just returned from a trip to Oaxaca, Mexico over the holidays. I was curious to see how this remarkable city was doing after the tough political times it had endured from May until the end of October. The city was very quiet when I first arrived, but by the time I left two weeks later, the streets were full of people as tourists began to return Tourism is the main industry for the state and for many people , they were without any income for almost seven months. Restaurants, hotels, B&B's, taxi drivers, artisans, all were hurt terribly. I stayed at Casa de mis Recuerdos, where I have stayed many times before. It is simply a wonderful place, beautiful, quiet with a great family running it - and the best breakfasts you could ever hope for. This is a family of fine cooks and each morning started with fresh fruit, sweet breads, and a Mexican main course, tamales with mole negro, or huevos rancheros, tacitos with chicken, everyday something different and delicious. Simply the best place to stay in Oaxaca, very conveniently located within walking distance of the zocalo and most important museums and restaurants. The family has been in the business for years and provide anything one needs, from laundry, drivers, tours, cooking classes and advice.", "title": "Oaxaca remains magical and needs our help", "helpfulness": 2, "user": "JoseSt.Thomas", "date": "January 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6612778, "likes": {"liked": "— Family and breakfast", "disliked": "— Liked it all"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005, traveled solo", "text": "I was there for La Noche del Rabanos (Night of the Radishes) and Noche Buena (Dec. 24). The former is a carving competition with radishes that approach 1 meter in length. There is also a dried flower competition and one using corn husks. This takes place on Dec 23 and the 24th is a beautiful evening filled with calendas (floats), bands, fireworks and candle-lit processions. Ot is a joyous time with no hint of commercialism.", "title": "A most spectacular courtyard", "helpfulness": 1, "user": "AnneinKensington", "date": "December 20, 2006", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6476725}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "It is time for folks to return to Oaxaca and support the economy of this magical place. It is one of the few places filled with indigenous cultures, each with a different cuisine, with a unique tradition, and often, a unique type of art.", "title": "Glad I took the chance", "helpfulness": 1, "user": "RichardinSF", "date": "July 24, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 5504283, "likes": {"liked": "— General ambiance", "disliked": "— Noise in front room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with friends", "text": "This is a lovely little B&B with the most gorgeous courtyard Ie ever seen -- full of bouganvillia and the sounds of (rather loud!) birds singing when they've brought out in the mornings. Staff are friendly and accommodating, and my room (ALondra) clean, nicely maintained, and with a balcony. Lorena and Nora preside (with some abuelitos at home and in the background -- also friendly and welcoming) and cook wonderful breakfasts. Yes, as mentioned below, the breads are typical white flour mexican sweet breads, churros, etc. -- if you want levain, stay home and forego Mexico altogether. But if you like living as close as we gringos unwilling to move south are going to get to being Mexican, stay at Recuerdos.", "title": "I couldn't have better memories of a place!", "helpfulness": 3, "user": "Interista", "date": "July 22, 2006", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 5496322}, {"rating": 3.0, "title": "In response to...", "text": "I just returned from 3 weeks in Oaxaca studying at a language school. Feeling too old for a home stay, I found a nearby B&B for myself. I was a little worried by the last couple of reviews on this site, but I took a chance and am glad I did. I stayed in 2 different rooms. The rooms in the front of the house on the street are a bit noisy if you need absolute quiet, but are very comfortable. The only single was small, but also very comfortable. Many of the guests seem to have been there before. The hospitality of this B&B and the city as a whole is remarkable. There was a huge teachers strike while I was there and the zocola was almost shut down for a time. Nora seemed to feel it was here duty to find something else for her guests to do when the dance events were cancelled. Her regular tours of artisan villages always had great reviews from the people who went on them. It is true, the towels are not changed every day, but the rooms are kept spotless, and I felt I could ask for anything if I needed it. I was there for three weeks and didn't hear a complaint the whole time. People seem to like it very much. It is a great place to stay if you are traveling alone, because you can meet people when everyone gathers for delicious Oaxcan style breakfasts or for the happy hour in the courtyard sitting area where you can have marguritas or cervezas.", "helpfulness": 10, "user": "cjlawson56", "date": "February 15, 2005", "id": 3194136}, {"rating": 4.0, "stay_parameters": "Stayed November 2007", "text": "We stayed at Las Casa de Mis Recuerdos in November 2007 for about 4 days. We stayed in one of their three homes, Encanto Jalatlaco in the Jalatlaco neighborhood of Oaxaca. It is a beautiful small house (only three rooms total) and perfect for folks who want to feel that they are outside of the primary tourist area but still be within walking distance of all the major sites. It is a bit of a long walk if you are coming in late at night, but still totally doable. The owners prepared a wonderful breakfast for us each morning, and Rosa, the caretaker was as sweet as could be. We really loved it. And, we happened upon the margaritas prepared in the lobby of the main hotel around 4 p.m. in the afternoon. Definitely, take advantage if you can! They were delicious!", "title": "Very nice stay", "helpfulness": 1, "user": "lbmore", "date": "January 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 12218660}, {"rating": 3.0, "stay_parameters": "Stayed December 2007", "text": "The only negative to the experience is that my friend and I both left a business suit jacket in the hotel closet. The owner, William promised that he'd send it on to us and never did. Otherwise, I would have given them al excellent rating. Still I would recommend this place to others.", "title": "great and not so great things...", "helpfulness": 4, "user": "fonk24", "date": "December 30, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 3.0}, "id": 12110203}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We had a nice stay at encanta jalatlaco (part of casa de mis recuerdos) but there are some drawbacks I wanted to mention. The house itself is lovely - just know that the downstairs room listed as a single is very very small. You definitely want the outside or upstairs room. The place is very expensive for Oaxaca, but if you have an open budget and want a private house for you and your friends it's nice. Also 3 of my 7 days I had cold showers so check the water before jumping in! The woman who takes care of the house every day and cooks breakfast is lovely and the food is excellent.", "title": "Very good small hotel in Jalatlaco", "helpfulness": 2, "user": "Danhedonia", "date": "December 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 11400063, "likes": {"liked": "— Peaceful, small, visually beautiful courtyard, great breakfast, terrific location", "disliked": "— Size of mattresses"}}, {"rating": 5.0, "title": "Best Kept Secret in Oaxaca", "text": "That said, I don't plan to stay there again . The owners were friendly to us, but I very much got the impression that they really take advantage of some of their guests. They claim the economy is still horrible in Oaxaca but if you ask around business owners who made it through the tough time are doing fine, and things are much better. Their claim that they're \"barely making it\" just can't really be true...I just think that maybe it's not quite as lucrative as before and that must be frustrating.", "helpfulness": 2, "user": "BarbaraAlexandriaVA", "date": "November 5, 2007", "id": 10626225}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Two of our friends traveling with us found them much more likable than we did though, and they were extremely helpful to them (to be fair!)", "title": "Loved it! Go and stay at Mis Recuerdos!", "helpfulness": 1, "user": "Sandra8", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8591810, "likes": {"liked": "— The personal touch and attention.", "disliked": "— The neon light bulbs in the otherwise beautiful room."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "This is the best bed and breakfast i have EVER been to. It is a work of art and simply stunning in presentation. From the artwork on the wall to the beautiful mexican breakfast, Nora and her sister and mother do an excellent job. They really are artists. We also had the opportunity to stay in their apartment for two weeks because my girlfriend and I attending a language school about a 10 minute walk away. The apartment was a great deal for us at only $300 per week. It was clean, GREAT BEDS AND PILLOWS, private and extremely quite. William is very helpful and is originally from New York.", "title": "Just Returned and Highly Recommend This B&B", "helpfulness": 1, "user": "JenMinnesota", "date": "August 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8499761, "likes": {"liked": "— I loved the artful. mexican decor", "disliked": "— i couldn't stay longer"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "If you are looking for an artistic, beautiful environment in the lovely, safe and extremely artistic town of Oaxaca then this is your place. Don't miss the opportunity!!!! It will make you happy the moment you walk into the place!!!", "title": "Safe and welcoming", "helpfulness": 1, "user": "Carmela77", "date": "August 6, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8362433, "likes": {"liked": "— Beautiful comfortable colorful courtyard and rooms, excellent breakfasts"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We had a very nice stay at the Casa de Mis Recuerdos - good location, welcoming hosts, comfortable bed, excellent breakfasts, birds singing and a lovely courtyard. We never felt unsafe in Oaxaca or environs and the Guelaguetza seemed to go off smoothly, so as far as we saw, travellers should not be concerned about the political situation. Oaxaca, the surrounding villages and Monte Alban were all well worth the trip. If you get tired of the bustling Zocalo in Oaxaca, there is a nice large and peaceful park only about a block from the Casa de Mis Recuerdos. Nora and William were very helpful and pleasant.", "title": "Lovely stay at Mis Recuerdos", "helpfulness": 2, "user": "Member24", "date": "July 29, 2007", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 8253333, "likes": {"liked": "— our hosts", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "My wife and I spent 5 days at Casa di Mis Recuerdos in July 2007. It’s an old home – operated by the Valencia family for 2 generations – with guest rooms arranged around a lovely courtyard. Our room was spacious; we had a private bath with shower; the bed was comfortable compared to the rock-hard beds in most Mexican hotels. Breakfasts were delicious – fresh and different every morning, prepared by Sra. Valencia and her daughter Nora, who also gives cooking classes and tours. Nora and her American-born husband William were always available to answer our questions and give us advice about things to see and do in Oaxaca and its neighboring towns and villages.", "title": "Loved Casa de Mis Recuerdos", "helpfulness": 1, "user": "abwworks", "date": "July 17, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 8139777}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "Political conflict between the state government and its opponents seems to have made people reluctant to visit Oaxaca, particularly in July for the Guelaguetza festival. These fears are probably overblown. We saw lots of political posturing – rallies in the Zocolo, articles in the newspapers, police checkpoints – but the two sides seem to have decided to live with one another for the foreseeable future, and the Guelaguetza came off without a hitch.", "title": "Home Was Never This Good", "helpfulness": 2, "user": "Gotogonow", "date": "July 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8138726, "likes": {"liked": "— The personal consideratin of needs and interest.", "disliked": "— Nothing"}}], "location": {"country": "Mexico", "region": "Southern Mexico"}, "variance": {"poor": 2, "average": 2, "very good": 9, "terrible": 1, "excellent": 83}, "aka": "La Casa De Mis Recuerdos Bed And Breakfast", "slim_ranking": 0.0722891566265}