{"user_rating": 4.5, "review_count": 112, "name": "La Canonica di Cortine", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We had a lovely stay at la canonica and Elisa did a great job during our stay and Lina's breakfast was just yummy. It is perfectly located and diligently looked after. I would return there anytime, but would beforehand call to ask if there are any groups of people staying in that time period. We were a bit unlucky when a whole group of danish people arrived and not only occupied the whole pool area and the rest of the areas. Not just we, but other guests as well, felt overwhelmed by this group dynamic. But besides this fact, I would recommend this place to my best friend.", "title": "Beautiful, just one thing", "helpfulness": 3, "user": "critcger", "date": "July 24, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 5503093}, {"rating": 5.0, "title": "Beautiful Tuscan Retreat", "text": "Our family has just returned from a beautiful week at La Canonica de Cortine and it is hard to describe how wonderful the trip was. Owners Lucia and Stephano have put their souls into restoring and running this villa estate set among the vineyards and olive groves of the Tuscan hill country. Near to Florence, Sienna, San Gimignano and other sites, it proved an ideal location for our day trips in the Chianti region.", "helpfulness": 5, "user": "bimmer5", "date": "May 31, 2006", "id": 5287340}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "The beauty of the setting is exceeded only by the gracious hospitality of the staff. Irene and Elisa bend over backwards to accommodate requests and do so with a smile. Stephano has a passion for the gardens and it shows! This is one of those rare instances where the actual property is better than the website.", "title": "Beautiful accomodations with excellent location", "helpfulness": 4, "user": "navsmom", "date": "October 9, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 4002486}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "We have just returned from a wonderful 2 week stay at La Canonica di Cortine,and cannot say enough about this wonderful place!The owners,Lucia and Stefano,along with Elisa and Irene in reception,helped to make our stay a truly memorable one.There is a 5 bedroom villa,a B&B,several apartments with one or 2 bedrooms..offering several types of accommodations.The entire staff was extremely helpful with all our needs and requests, and the location is not far from Florence and Siena, in the heart of Chianti.I would definitely recommend this property to anyone!", "title": "\"Wonderful anniversary\"", "helpfulness": 6, "user": "critcger", "date": "May 12, 2003", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 994149}, {"rating": 5.0, "title": "Fabulous Retreat", "text": "This was our second time enjoying this wonderful place tucked away in Chianti counry! The owners, Lucia & Stefano, made sure every aspect of our stay was perfect. We celebrated our 25th wedding anniversary there and had the service and party right at the villa. The property has a villa, B&B, and several other buildings that can accomodate any guests. Dinner can be served if one desires and I would strongly recommend having them cook for you after a day of sightseeing!.They can, also,arrange to have a private bus take your party on day trips. We spent a day in Rome and it was a great comfort having someone else do the driving!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "September 28, 2002", "id": 706247}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 3, "average": 4, "very good": 24, "terrible": 1, "excellent": 80}, "aka": "La Canonica Di Cortine Hotel", "slim_ranking": 0.555555555556}