{"user_rating": 5.0, "review_count": 332, "name": "La Casa del Garbo", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "We've stayed in other places in Florence in the past but have never stayed twice in one place until now. The location is the primary draw. I love opening the bedroom window every morning to a fantastic view of the Palazzo Vecchio. Second is the staff. They were terrific. Breakfast was simple but delicious. The first time you enter the room, you are greeted by a musty dated smell but it is easily remedied by simply opening the windows, letting the air in and taking in the lovely view outside. If I do get the chance to return to Florence again, I hope to return to Casa del Garbo.", "title": "Back again!", "user": "dissolvedgirl", "date": "December 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 187353998}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "It could not have been in a better location. Everything I wanted to see was within walking distance. Plus La Casa was near many restaurants so we had lots of choices. There were 2 of us and the twin room was more than adequate space-wise as it included a sofa, a sitting chair, a writing desk and a coffee table. The staff were friendly and helpful. Breakfast was okay....minimal. You have to pay your bill in CASH. They disclose that when you make your reservation. You use your credit card to hold the room but you can't use it to pay. I'd stay here again and have and will recommend it to others.", "title": "Location, location, location", "user": "Sue H", "date": "December 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 186987385}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "During a recent trip to Italy, our party of 8 stayed here 5 nights. If you are looking for a hotel perfectly located in Florence and providing a neat ambiance, this is a perfect hotel! Piazza della Signoria is in the heart of historic Florence, meaning you can easily walk to all the main destinations within the city. Nothing like like an early morning wake up and having Piazza della Signoria to yourself (see photo). In addition to being conveniently located within Florence, it is a short walk to the main train station (15 minutes). If you plan to take day trips to surrounding Tuscan cities or vineyards (as we did), then this makes it incredibly convenient. The hotel itself is very quaint and intimate. It provides everything you would require or desire from a hotel when traveling for pleasure in Europe at a very reasonable price considering the location. If you are looking for a luxurious and lavish room, then this is likely not your hotel though. I would certainly recommend them without question. It was the perfect hotel for our stay.", "title": "Best Location in Florence", "user": "RayJayD", "date": "December 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186863188}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We truly enjoyed the room, the staff, and the view overlooking the piazza. Location could not have been better for us. Convenient to museums, shops, and that all useful ATM machine down the block.", "title": "Four fine nights", "user": "shrink2747", "date": "November 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186024005}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Cold water pours from an outdoor nearby fountain to replenish travel bottles. Breakfast was modest and light. Shower was pretty tiny, but the heated towel rack was a nice touch.", "title": "MnMStanfield", "user": "MnMStanfield", "date": "October 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 182292310}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "variance": {"poor": 1, "average": 3, "very good": 59, "terrible": 1, "excellent": 268}, "aka": "La Casa Del Garbo Hotel Florence", "slim_ranking": 0.0914760914761, "description": "The Casa called del Garbo, with its tastefully furnished rooms, its windows opening out onto Piazza della Signoria is all one with the warmth of the family who are keeping it alive today: Simonetta and Giovanni Paoli, their children Giulia and Marcello and with them all the other valuable collaborators who are there to welcome on your arrival, accompany you to your rooms or offer you a simple meal that tastes of home."}