{"user_rating": 4.5, "review_count": 1067, "name": "La Cantera Hill Country Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We did a staycation and we stayed by the pool most of the day. Our server Cody was the most respectful and professional server we have ever had. He always checked in on us and was very friendly. Then we participated in a game \"battle of the sexes\", where the hostesses were amazing and very outgoing. We also encountered the activities manager by the name of Mercedes Sanchez and she was very helpful in giving us a tour and making sure our stay was enjoyable. We have never been treated with such kindness and professionalism as we were with the staff at the Westin. We had a blast and recommend this resort to everyone.", "title": "This place is relaxing, amazing and beautiful.", "user": "Pitchford81", "date": "August 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171523257}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We love going to Westin La Cantera for a family getaway. We always stay on the Club level. We are treated like family. One of the attendants, Mary B., goes out of her way to make our stay special. She remembers our names and always makes us feel important. It cost a little more to stay on that level, but with 2 children ages 5 & 6 years old, it is nice to crawl out of bed and go down the hall for breakfast. The is a happy hour at 5:00 pm with appitizers and low cost beer and wine. The pool has a water slide and a park of bounce houses to keep the children entertained all day. There is also a Kid's Club that will watch the kids if the parents want a quiet afternoon by the pool or a game of golf. Anytime we want to get away, we go to San Antonio's La Cantera.", "title": "Fun Family Getaway", "user": "Nancy T", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171238345}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had a great time at the Westin La Cantera. It was the relaxing weekend getaway we needed. The staff around the pool was exceptionally attentive. We were served by Cody, Austin, Andrew and Sarah. Each of these young people were well trained and friendly.", "title": "La Cantera so relaxing", "user": "TravellingAggie", "date": "August 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171184180}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I have wanted to visit this resort for over 5 years. We traveled by bus from Chicago and when we arrived here we were stunned at the unique beauty and natural landscaped design. The atmosphere was this comfortable and relaxed, a true Spanish setting with Texas hospitality, the most lovely decor.", "title": "Comfortable and Luxurious................The ultimate combination!", "user": "wendcla", "date": "August 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171098018}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "But the staff here is what is so impressive...Charlene, Nikki, Sarah, Andrea, and there were a few more that served us during our visit...so amazing. I felt like we were a guest at one of my friends homes. The staff spoke to you like they had always known you. A true guest experience! The rooms were huge and the club lounge was classy, very elegant but simple. The pools were perfect, with an all adult pool that was not packed. We were a short bus ride into downtown San Antonio and enjoyed all the lovely fun of the Riverwalk and the shops and sights and museums and then back to our comfortable, relaxed, resort, to swim and sit in the sun. This was the most wonderful resort experience so far!", "title": "Great place and location.", "user": "Mich H", "date": "August 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170915384}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "We stayed there for 3 nights for an end of summer trip with our 2 kids( 8 & 9). The staff was attentive and friendly. Service was quick. Pool was kept clean. Plenty of activities for the kids--with slide, pool volleyball, kids club, game room and discovery junction. Hotel was convenient to Fiesta Texas and Sea World.", "title": "Nice hotel, friendly staff", "user": "houston5", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 172053514}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The resort is getting old and is OK if you are golfing and need to be close by. My room was adequate but there are far better options in San Antonio if you do not need the gold amenity. Service is good and the views can be good depending on which part of the hotel you are staying. While the location is not bad, it is not quick and convenient either.", "title": "Rooms showing their age", "user": "JoeA1963", "date": "August 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 171873324}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Don't get me wrong--the hotel is beautiful. Take your family here for a stay, but do not have a wedding here unless you want to be under-impressed, unappreciated and underwhelmed. We were not given what we were promised. But what was worse--the hotel did NOTHING to try and improve matters. It was as if they thought our wedding was too small for them to be bothered with it. What was even more frustrating was that we trusted the Westin with our sacred day, only to be truly disappointed.", "title": "Wedding Disaster", "user": "Leigh L", "date": "August 11, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 171679289}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "On our honeymoon, we travelled to the 4 main islands in Hawaii, so we stayed at 4 separate hotels. All of the hotels that we stayed in for our honeymoon made us feel more appreciated and welcomed than the Westin did, which I find extremely ironic since we actually got married at the Westin.", "title": "Great family vacation", "user": "Sarah0072013", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171646530}, {"rating": 3.0, "stay_parameters": "Stayed August 2013", "text": "If you have kids, I think this is a great place to stay. They have an excellent Kids' Club. Also, the juxtaposition of the adult pool and the kids' pools is genius because if you don't have kids, you are truly separated from the kids' pools. Plus, the view is gorgeous.", "title": "Good but could be better", "helpfulness": 2, "user": "GeauxHouston", "date": "August 10, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 171613489}, {"rating": 3.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I'll start with the positives: The room I got at the Westin for our conference was one of the exercise rooms and it was truly amazing. The views were great, I enjoyed the exercise bike and other equipment, and the room was awesome. I had an 80 minute Swedish massage at the spa that was excellent. I get regular massages and Irish was phenomenal. The only downside is that they automatically add gratuity. While you can add more $, I find this practice insulting and will never include more money if the gratuity is automatically added. Too bad, because Irish would have received a 25% or so tip from me. Housekeeping was superb. They were the only great service at the hotel. I opted for the \"green\" stay and they were really sweet about letting me have some extra coffee when I needed it. My burger at the casual restaurant was excellent and the service there was pretty good also. Breakfasts and one of the lunches served at the conference were tasty and nicely served. One of the other highlights was the really nice shuttle driver, he was pleasant and I tipped accordingly.", "title": "Some highs, several lows", "helpfulness": 1, "user": "jodi_123", "date": "August 15, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172422997}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Now the downside: There are many employees of the hotel that are downright rude and one of the valet staff was even pretty nasty with me. I arrived very early and wanted my luggage taken to my friend's room. I had the room number and explained that I needed it shortly (there was no other hotel guests there, it was just after 8) as I had to work to do. Also I did not want my makeup and other items melting in the already hot sun. After about 30 minutes, I called and asked when it would be delivered. They lied and said it would be right up (which is what they originally told me). About 10 minutes later I went down and got my stuff, still sitting on the cart in the hot, hot sun. No-one stopped me so - heh thieves - great opportunity to rip off hotel guests. Then I asked to be called when my room was ready. Now they did give me a great room and they did let me check in early, but when I came by to check, they were like \"it's been ready\", well - where was the call? The front desk staff tended to act like a \"deer in the headlights\" whenever I asked a question, good thing I found maps and other information - they were pretty useless. Then when I went to get my car from valet parking, first they ignore me and take the claim check from the guy behind me in line (he was taller?!), I finally get the guy to take my claim check. I watch them and I'm finally next in line…. Then I overhear the valet tell one of the guys to get so and so's car and load in their luggage. Now I may have misheard him, but after the other guy got to cut in line in front of me, I spoke up - heh! I'm next. This is when he got really rude - I did not say that. We will get your car, just an ugly attitude, I'm pretty sure he would have slapped me if he could. I finally get my car and move it off to the boondocks. The other misses was the raw, gristly steak lunch one day at the conference - it was mooing on my plate and I had to go buy something to eat. And the pools were filthy. Not slimy, but full of bugs and garbage. Floating napkins (or toilet paper, but it was the adult pool so I'd like to think it was napkins), turn the freaking skimmers on!", "title": "Good anniversary stay", "user": "Debbie P", "date": "August 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 172414683}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "Honestly, if I went back to the area I'd try the Four Points down the road. At least I wouldn't have high expectations of good service.", "title": "Underwhelming", "helpfulness": 3, "user": "37Frequenttraveler", "date": "August 13, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 172106320}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "My husband and I recently stayed here for the first time for our anniversary for 3 nights. The hotel overall is beautiful. The service was excellent, especially at the pool. Drinks were a little pricy for what they were (not much alcohol in them) as was the food. Room service was very expensive and not worth it for breakfast.", "title": "Luxury hotel, with a price tag", "user": "Sanchezho", "date": "August 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172060911}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We loved the pool. Spent 10 hours there one day. Staff kept coming by skimming the water to get out leaves, etc. Smores was good in the late afternoon/early evenings. Definitely seemed like a lot to do for kids.", "title": "Excellent all the way around", "user": "backporch", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 172059188}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I loved almost everything about La Cantera. Room service food was consistently disappointing but the property, room, and service were superb. A great representation of the good life to be found in the Texas Hill Country. Neimans within a mile, as well as fine dining establishments. I will be back asap", "title": "Beautiful,secluded, but convenient", "user": "jewelryjunki", "date": "August 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170685571}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Stayed at the Westin La Cantera for our annual girls weekend for 3 nights. Wasn't sure what to expect as we originally booked our stay at another hotel closer to the Quarry Market area. Needless to say that did not work out, lucky for us there was availability at the Westin. The area was beautiful, the hotel is very well kept, and the staff are great. There are plenty of activities going on throughout the day, as well as the evening which makes this resort well worth the money. This is easily a 5 Star hotel/resort. I plan to visit again soon", "title": "Fabulous Girls Weekend", "user": "Benita S", "date": "August 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 170516853}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "My co-workers and I stayed at this lovely resort for three days and I must say it was just stunning. The rooms were beautiful and the service was top notch. I would like to mention that Tito and Ivan at the pool were very accomodating. They answered every request with a smile and treated us as if we were the only people at the hotel. Great staff !!!!!!", "title": "Excellent Service", "user": "Joan F", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170468676}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "Thank you for having such pleasant and friendly employees.", "title": "Fun for families", "user": "mejack", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 170302722}, {"rating": 4.0, "stay_parameters": "Stayed July 2013", "text": "Joan Fuller", "title": "Hotel service was great. The restraurant service terrible.", "user": "Vrswan", "date": "August 1, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 170300335}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 4, "variance": {"poor": 57, "average": 106, "very good": 233, "terrible": 39, "excellent": 632}, "aka": "Westin La Cantera Hotel San Antonio", "slim_ranking": 0.0662824207493, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "La Cantera Hill Country Resort is a distinctive retreat for business and leisure travelers alike atop one of the highest points in all of San Antonio. We're the ultimate blend of recreation and luxury."}