{"user_rating": 4.5, "review_count": 3205, "name": "La Concha Resort: A Renaissance Hotel", "reviews": [{"rating": 4.0, "title": "25th Anniversary ", "text": "They have friendly but very professional security crews and service crews. Since casino is located inside hotel, their security is excellent level. Do not hesitate to talk to them. Convenient location for drug store and neighborhood restaurant", "user": "Hiraku J", "date": "October 13, 2013", "id": 180865346}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My family recently stayed at this hotel prior to setting sail on a 7 day cruise. The rooms were very nice with awesome views - tower beachfront rooms. There are lots of outdoor / indoor lounge areas. The hotel is surrounded by restaurants and local bars in walking distance. I didn't get a chance to try out the onsite casino, but will when I return.", "title": "Beautiful Hotel on the Beach", "user": "Cabo07", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180790012}, {"rating": 2.0, "title": "One of the worst check-ins EVER", "text": "We arrived at 2pm and were told there would be a 45 min wait for check-in. Fine. When we did check-in, we immediately went to the elevators to go to the 8th floor, where our room would be. However, turns out that the family we were sharing the elevator with were also given keys to the exact same room! They got there first as we let them out the elevator first. Back to check-in, for a half hour wait while they deal with others who are checking in for the first time. Then they apologize and give us keys to a room on the 6th floor. We go to the room. Wouldn't you know it - there was someone else already in that room also! (And, btw, our keycards did in fact open these other peoples' rooms.) Back downstairs again, to complain, and told the manager is \"too busy\" to speak with us. Finally get a third room, where there's only two towels/robes etc., even though we are a party of three adults. We also needed linens for the second bed. Then there was the broken shower and non-working tv (both of which got fixed pretty quickly, to at least give credit where it's due). When the manager finally spoke with us, he apologized and said we could have a free breakfast the next day. Really? That makes it ALL better. Wow. Not a cheap hotel, but kinda feels like it. Avoid!!!!!! Go somewhere else if you can.", "helpfulness": 6, "user": "lornapie", "date": "October 12, 2013", "id": 180742405}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "My husband was here on business and I was able to tag along. We had a very long stay (3 months) and we were never disappointed. Starting off with Felix and Antonio at the front door with smiles and greetings - always. Knew our names and used them. Front desk was so friendly and also knew our names. We had a very clean suite on the 11th floor facing the lagoon and pool area. It was great to have a small kitchen area and separate bedroom. We were told they are changing out the mattresses and that is a good thing - ours was definitely old. Thoroughly enjoyed the terrace - lots to look at and could enjoy the sunsets. We live full time at a beach, so beach view was not important to us. Concierge area with Michael, Cristina, Alain, Estaban and lots others was relaxing and enjoyable. This area has inside and outside seating. Every time we went in we were greeted like friends. It would be nice to vary the breakfast offerings, but it was still very good. Evening meals were tasty. This area closes for Sat and Sun which means you cannot access the sitting areas - would be great if members could still access the sitting areas during the weekend. We ate several times at Voga always sitting at the bar. Once again, greeted by name. Food was excellent and Balushka(I apoligize if spelled incorrectly) was delightful. The hotel has 3 pool areas. We went to the adult only pool - infinity looking over the beach. Doesn't get much better than that. Nice fitness area with beach views. Laundry facilities on 4th floor. We like the location of hotel. It is close to very good, local restaurants and a park that has local events(music and food) on some weekends. The beach has plenty of chairs and umbrellas, but beware the surf is very rough and I would not recommend it for small children. There is a casino and covered parking. Lobby bar can be very festive and fun. Cost of drinks is very high. One martini - $17.50 and margaritas at the pool were $14.00 each....", "title": "They Do it Right", "helpfulness": 2, "user": "2TravlinFools", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 180579082}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We were sad to leave. Hopefully, we will be able to return and we will definitely choose La Concha. Thanks for our home away from home.", "title": "Wonderful anniversary getaway!", "helpfulness": 1, "user": "Alexis P", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 180573766}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "This Hotel is simply amazing - the Suites are modern and the service is phenomenal. There are several different pools to choose from - you can have your privacy in the pool on the Suite side, or enjoy the company of others at the main pools - also, the Beach was amazing!!! Ocean was soothing - What I liked best was that the pool, beach and gym are open 24 hours and the outdoor \"beds\" (which all hotels charge $500 + ) are free and available - no reservation required!!! The location is excellent since transportation is readily available either by taxi or bus - the bus right in front of the hotel takes you right into Old San Juan where you could pick up the trolley that takes you all around at no charge!", "title": "FUN IN THE SUN, SAN JUAN, PR", "helpfulness": 2, "user": "mg1esq", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181204566}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "My wife and I just came back from celebrating our 1 year anniversary there, and we had a fantastic time.", "title": "Fantastic Property, Staff, and Rooms", "user": "Pernell", "date": "October 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181137663}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Although, we had a room with a partial Ocean view, we enjoyed being on the 4th floor as we had an atrium on our floor. The atrium was filled with plants and comfortable chairs, so you can kind of lounge a bit. At night you can hear the frogs(singing cochi) outside your door. But, it's not overwhelming.", "title": "some things are great; others not", "helpfulness": 4, "user": "HoustonTexasLawyer", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180976514}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The property is really hip. In addition to a moderate sized main pool, they have about 3-4 other plunge pools around the property, where you can relax and also order drinks and food. On certain nights, they also had live music, which was also very cool.", "title": "Excellent and relaxing hotel - will stay again", "helpfulness": 1, "user": "crazymocha", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180974384}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "We found the staff to all be very helpful and friendly. From the gym staff(the gym is pretty nice w/ 3-4 treadmills, 2 ellipticals, and some nautilus equipment/free weights) to the security and the wait staff, everyone went out of our way to ensure that we had a great stay.", "title": "Great Vacation With a Group of 11", "helpfulness": 1, "user": "MonaB28", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 180960997}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "I had never been to Puerto Rico before. This would be my first time there. I was attending a friend's Wedding being held here at La Concha. Logically we made reservations to stay there as well. When we arrived we were greeted by a very friendly porter. I mean everyone who worked there made you feel at home. Very friendly staff. The location is perfect and the views are amazing. We had a beach view from our room. The sound of the ocean serenading you at night if you wanted. Or shut the doors and enjoy peace and quiet. The bartenders were awesome at Solera. No closing hours at the pool which was a first. I tell you. When I go back for vacation to San Juan, Puerto Rico. I will most definitely be staying at La Concha once again. Thank you to everyone there for making our stay great.", "title": "The best staff and very welcoming", "helpfulness": 1, "user": "Luis L", "date": "October 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180537598}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "My wife and I stayed at La Concha and it was a relaxing retreat right on the water and close to many attractions. Once you enter the hotel, you feel its modern vibe. The staff was friendly and accommodating. The bell boy gave us a lot of suggestions on where to eat and where to go, and they were all walking distance away. The outdoor areas were very relaxing with palm trees allowing you to feel like you're on vacation and was also steps away from the beach. There is a restaurant on site called the Perla and the views and feel were fantastic, especially during sunset. We stayed in the 1BR suite in the Suite Tower. The rooms were big, clean, and it's a nice place to treat yourself. Highly recommended.", "title": "Amazing hotel in prime location", "user": "Edwin Z", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180531851}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I had to come here and tell you guys about how GREAT this hotel is. It was a last minute change from the Marriott by the convention center where I usually stay when in PR to here and im soooo glad that I did. My flight didnt get me there until 1am and when the taxi pulled up ($20fromtheairport) the outside greeters made me feel so warm and happy to be there. Pedro a Bald friendly employee was the 1st peron my Fianc'e and I met that made us feel at home. If he wasnt giving you a high five or making a joke they all was rushing to grab your bags and physically help me out of the cab. The greatest thing about them was that they DIDNOT beg or ask for a tip. This made me scramble through my purse to make sure that I could give them as much money as I could find. They then sent me inside to check in with a young man name Miguel who we found to be so smiley and warm. After giving us a Cabana room by the pool he did not just give us the key, he came from around the counter to direct us in the direction of our room. This was something that I saw all of the check in people do. It made us feel like our stay there was personal and not just a dollar that they were getting. When we got to our room I was so excited and happy on how beautiful it was. From the comfy robe to the to die for soft bed, I was happy. I loved the fact that even at 4am in the morning while we laid on the beach or one of the 3pools that they have I constintly saw security walking back and forth securing the resort. This made me feel very safe. I was even comfortable enough to doze off by the hot tub. The location of the hotel is perfect. If you do not want to eat there they have a 24hr resturant across the street that makes the BEST Empanadas for $2.50 each and serves $1 Heineken Beers all night long. You can also get Subways and Wendys if you not down for local food. There is also a Gucci and LV store down the block from the hotel. I also took a bus from infront of the hotel for .75cents down to Old San Juan to sight see. I was so happy with my stay I had to let the Manager Miguel know how happy I was to be there and speaking with him I can see how humble he was and appreciative he was for my compliment I could tell why his staff was so great. I must say that the ONLY problem that I had was that the Rum and Coke and Sangria that my Fianc'e and I had served to us while laying on the beach was weak. We kinda needed it to have a lil more kick to it. lol lol.", "title": "My home away from home in PR", "user": "Senn M", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180507013}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Went to a good friend's destination wedding and spent 3 nights at this beautiful resort. Everything was excellent, and the staff was very friendly. Would highly recommend this hotel to anyone looking for an enjoyable stay at a beautiful resort!", "title": "Excellent wedding weekend", "user": "SShah983", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180367557}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My husband and I decided to try out PR for our annual October get away. We are so very glad we did and SO very glad we chose La Concha. From the moment we arrived everything was fantastic. The rooms are great, very clean and awesome showers. The beach was beautiful and the guys on the beach helping with chairs and umbrella's were very nice and helpful. Each day we had lunch by the pool our servers Hector Torres and Mr. Matos were fantastic. Great with recommendations of drinks and food. Hector even gave a top notch recommendation on a restaurant in Old San Juan. Overall the staff was very friendly and always willing to help. The casino has much to desire but it's there for fun! We are definitely going to be coming back!", "title": "Amazing Three Night Getaway", "user": "JLHunt1002", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 180326075}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Went here in October of 2013 for a long bachlorette weekend. From the first time you come in everything is sleek and clean and relaxing. Our flight arrived early in the morning so we thought we would have to wait for a room to be ready. Thankfully check-in was seamless and they not only had a room ready for us but they had options for us to choose from. We weren't sure what type of room would work for us since there were 4 of us so we were able to go up and take a look at the ready room. The room was clean and fantastic and everyone was courteous and nice the whole time we were there. The pool areas were great and the food and drinks (while pricey) were great. I would highly reccomend this hotel to anyone and will also consider it for myself the next time I am traveling to San Juan.", "title": "Great hotel with excellent service", "user": "talietash", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 181379835}, {"rating": 4.0, "stay_parameters": "Stayed October 2013", "text": "I stayed at La Concha based on the reviews u read and I have to say the the place lived up to everything I read. The hotel is beautiful and in a great location. The lobby bar is more like a night club in the evenings. There are great shops right around the corner. We had a great time at the beach and at the pools. Our server Hector was so very nice to us and so hospitable and made us feel so welcome! He shared so many wonderful stories !! So many others there were great as well. I only have the best things to say about this place!!! The only bad thing was an older concierge that didnt seem very enthusiastic.", "title": "Best place ever!", "user": "foodie1107", "date": "October 16, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 181320547}, {"rating": 5.0, "title": "Excellent hotel", "text": "We had a great time at this hotel. Another review complained about the \"motel style.\" Yes the rooms are accessed by an outside corridor but the reason is so they can maximize the space facing the ocean. Incredible views! Service is unbelievable. We tried most of the restaurants and all are delicious. We could not hear the disco from our room. We had a great time.", "user": "Margaret H", "date": "October 16, 2013", "id": 181315044}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Excellent hotel blending the original mid-Century Modern building with a newer all-suite tower. We stayed in one of the suites—very well appointed with a separate sitting area and small kitchen. While we had a city view room, be aware there is noise from Condado’s all night bars and clubs. The food at La Perla (the high end restaurant) and Solera (the outdoor poolside venue)was very good. Among the many amenities at the hotel, are three different pools including an all adult pool reserved for the tower rooms, a welcome break from the many families on site. The staff was exceptionally friendly beginning with the bellman and front desk. We found all the servers to be professional and friendly. There are a number of dining and shopping options within walking distance.", "title": "Beautiful, Well Maintained Hotel", "helpfulness": 1, "user": "TouringLawyer", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 181280040}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "This was my first time at La Concha...having a mother from Puerto Rico, I have often traveled here and stayed in different locations. From the easy breezy check in with the gorgeous hostess to the prompt and beyond courteous daily accommodations they provided, La Concha is on top of my list for PR travel. The food was superb and it was a great feeling to wake up and see smiling genuine faces every day waiting to take care of you. La Concha by far exceeded my expectations however I must take the time to call out a favored employee; Hector I. Torres. Hector went above and beyond to make sure my friends and I were comfortable, happy and had everything we needed. He catered to us in a way that did not go unnoticed nor forgotten. When we return to La Concha I can only hope he is still there flashing that amazing smile eagerly awaiting to make the most out of our stay. Thanks, Hector!!! :)", "title": "Every shade of perfect.", "helpfulness": 1, "user": "Sonia M", "date": "October 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181265525}], "location": {"country": "Caribbean", "city": "San Juan"}, "stars": 4, "variance": {"poor": 116, "average": 302, "very good": 962, "terrible": 88, "excellent": 1737}, "aka": "La Concha Hotel Renaissance", "slim_ranking": 0.106382978723, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "Welcome to the La Concha Resort experience, the stunning renovation of one of San Juan's most elegantly chic properties. On a sun-drenched corner of Caribbean beachfront in San Juan's most prestigious Condado district, La Concha is an icon of modernist architecture replete with spacious exhilarating decor and detail."}