{"user_rating": 4.0, "review_count": 130, "name": "La Closerie Honfleur", "reviews": [{"rating": 4.0, "title": "Mixed Mission", "text": "I'm not certain what this property wants to be. An apartment? Hotel? Spa? It is a lovely place: lots of curb appeal, parking, sparkling clean, beautiful grounds & pool. Yet, all rooms are set up as \"apartments\" with a closet filled with tiny sink, microwave & fridge and ALL of the other space in drawers devoted to kitchen equipment. Our first room had NO place to put any of our things. Our second room had a small closet with shelves. Also, the toilet was in a very odd spot in a room across from the front door with a tiny sink, a towel (no hook for it) and a peculiar fan (non-functioning) which worked with a string pull string. Downstairs was a spa with expensive spa services. Also, hotel furthest from town with no real walking trail to reach town. Staff was friendly and helpful.", "user": "beekay458", "date": "June 15, 2010", "id": 67623164}, {"rating": 1.0, "title": "Not a hotel.... its a residence hotel not explained in the website.....a total rip off...", "text": "Honfleur is a beautiful village.... charming... unfortunately our experience at La Closerie was not that great...we felt ripped off... we would like people to know that this is a residence hotel.... which we didn't understand and was not explained on the website.... I guess it is fine if you understand that you are expected to clean your own room, take out the garbage to bins at the side of the hotel, do the dishes, make your own beds take the towels down to reception when you want clean ones... and they even leave a vacuum cleaner.... but the room rate is more expensive than a normal 4 star hotel...right in town.. . we took a small suite... and it was really small, every room only has single beds pushed with single duvets...in every room.. I had to go to reception to ask for a double sheet and a blanket ( which was dirty and old) and make up the beds . Now I dont mind keeping house, but we were on holiday...and thought we were paying for a normal hotel with maid service...That was disappointing...... There is a 80 euro charge if you dont clean your apartment when leaving.....!!!!! Didn't see any of this on the website.... The sauna smelled so bad that you could not go in... and there was no instructions on how to start either the steam room or the sauna .... the only saving grace was the sweet receptionist with a lovely smile.... Disappointing..... and very expensive... try maison de lucie......", "user": "chezshasha", "date": "November 20, 2009", "id": 49620893}, {"rating": 5.0, "title": "bright new contemporary hotel with excellent pool, sauna and bedrooms", "text": "We have stayed in several of the Hotels and Bed and Breakfast establishments in Honfleur, all high ranking in Trip Advisor reviews, and sad to say we have been very disappointed. However, La Closerie is most definitely the best so far based on both the quality of the bedrooms, and leisure facilities, and the outstanding arrangements for breakfast. Which despite the low value of the pound against the euro, at ten euros per person,this was one hotel breakfast which proved to be exceptional value. How often can you say that in France?", "user": "cocoBramhall", "date": "November 10, 2009", "id": 48894603}, {"rating": 5.0, "title": "SUPERB QUALITY", "text": "Choose this hotel if you like new and fresh, spotlessly clean contemporary bedrooms which are both spacious and luxurious.", "user": "ChannelIslandsSue", "date": "October 18, 2009", "id": 47126414}, {"rating": 5.0, "title": "Fantastic Value, great hotel", "text": "Choose it if you like a swim, sauna or ham man after a day sightseeing, and we were lucky enough to in late October. Finally", "user": "Rhooseboy", "date": "October 6, 2009", "id": 45988620}], "location": {}, "variance": {"poor": 7, "average": 19, "very good": 70, "terrible": 5, "excellent": 29}, "slim_ranking": 0.53125, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}