{"user_rating": 4.5, "review_count": 39, "name": "La Posada Milagro", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This was out second stay at the guest house and it was superb. It’s rustic native landscaping and local design is impeccable. The room (the Chisos Suite) was perfect and the attention to detail and décor was spot on. This guesthouse has the correct amount of amenities for it price-point and the staff was ready to provide what we needed. The coffee left on our doorstep both mornings was some of the best I’ve had. The view from the patio is worth the entire trip—the entire ghost town, the Chisos Mountain and the National Park is spread out before you. Be sure to complete your evening with a fire in the fire pit and a canopy of stars like you have never seen before. For the Big Bend this IS your top choice. You are in the center of the Ghost town and a pleasant easy walk to the Starlight Theater restaurant and the Terlingua store. (Fantastic eating and trinket shopping.) Be sure to stop in at the Boathouse for an afternoon brew and some interesting conversation with the “locals”. If you have not yet made a decision—spend the money! Your second choice is not even in the class below. This is the only place we will stay when we return—and we will-to the Big Bend.", "title": "Best in the Big Bend", "helpfulness": 1, "user": "sanantoniopete", "date": "September 12, 2008", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 20015820}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Although the most expensive in Terlingua it is well worth the money. This was quite superb, we stayed in the Honeymoon suite and the views back across the \"town\" we spectacular.", "title": "superb", "user": "euanmur", "date": "June 10, 2008", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "business": 5.0, "rooms": 5.0}, "id": 16816869, "likes": {"liked": "— the view", "disliked": "— the temperature"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The room is very rustic and we really enjoyed watching the many birds playing on the porch. Would recommend this hotel to anyone. The toilet being separate to the bedroom is odd to start with but quite fun.", "title": "Awesome! Best in Big Bend...", "helpfulness": 2, "user": "kevinlbrown", "date": "April 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7365981, "likes": {"liked": "— The views and location!", "disliked": "— Nothin!"}}, {"rating": 5.0, "title": "Fabulous!", "text": "By far the best mix of comfort, convenience, and character for anyone visiting Big Bend. Charming rooms, very very clean, amazing views of the park, and good nearby food choices. Other than Lajitas, no lodging within 30 miles of Big Bend will be as nice. And Lajitas feels a bit commercial and resort-y... while Posada Milagro makes you feel like you're still a bit rustic. The Ghostown is a bit odd at first, but the people are completely welcoming and you will miss it when you leave. Highly recommended...", "helpfulness": 9, "user": "inangus", "date": "March 31, 2006", "id": 4823672}], "location": {"country": "United States", "city": "Terlingua"}, "variance": {"poor": 4, "average": 1, "very good": 6, "terrible": 1, "excellent": 27}, "aka": "La Posada Milagro Hotel", "slim_ranking": 0.571428571429, "description": "La Posada Milagro Guesthouse is located at the top of the Historical Terlingua Ghostown overlooking the Chisos Mountains in Big Bend National Park. We are a small private boutique hotel with rustic decor and all the modern amenities including Satellite Internet Connections."}