{"user_rating": 5.0, "review_count": 257, "name": "La Paloma Lodge", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We spent 5 nights at the lodge with our two boys (9 and 4) back in July 2005. They still talk about it!", "title": "Very surprisedVery satified", "helpfulness": 4, "user": "MarkS25", "date": "February 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4458540}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "We had a sunset rancho (#2). What a nice clean/simple and spacious room. The balcony and view was amazing.", "title": "Great time, terrible value!", "helpfulness": 14, "user": "RobinatorSmith", "date": "January 29, 2006", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 4394574}, {"rating": 5.0, "title": "Great Adventure", "text": "Althought the room was simply but tastefull furnished the real art and design was nature. Other reviewers speak about the monkeys, butterflies, birds etc. All true!", "helpfulness": 2, "user": "halt325", "date": "January 16, 2006", "id": 4357372}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "I could go on forever about how amazing La Paloma is. My husband and I found this to be the perfect oasis for the end of a long trip around Costa Rica - and I would return in a heartbeat. Everything about the operation is top notch - from the travel arrangements they make FOR you, to the amazing food (taking into serious consideration any food-related issues/allergies, etc), to the unbelievable staff - including Nicole (who greets you on the first day and is never far away) and Gustavo (an incredible guide who literally could write the book on Osa Peninsula wildlife), to just the complete and utter solitude and quiet you can experience, simply by sitting in your (beautiful) room... La Paloma has thought of literally everything to make what could be a challenging, backpacker-ish experience out in the wilds of Drake Bay into PURE luxury... As time went by, we city people literally began to live by the sun - it woke us at 5am and we were asleep by 8:30. Never in my life have I ever felt so quiet and at peace. I would recommend this place backwards and forwards to anyone looking to escape the world for a while - you can't beat monkeys on your balcony, a completely deserted beach and total quiet (aside from the birds and howler monkeys!), amazing guided tours of almost untouched natural wonders, all while feeling completely pampered.", "title": "Amazing, Amazing, Amazing", "user": "LJWNYC2008", "date": "December 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 51470227}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Pura Vida, literally translated means Pure Life but also means something approximate to Full of Life, Purified life, This is living! My husband and I had an amazing 4-night stay at La Paloma (March 2009). The weather was perfect, there was no rain, it was not too hot, and the ocean was unbelievably warm.", "title": "Pura Vida", "helpfulness": 2, "user": "Lionfish", "date": "November 7, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 48707335}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Drake Bay is surprisingly developed, to us anyway. There is the small village but also a multitude of resorts. Once we arrived at La Paloma itself though the resort felt absolutely secluded.", "title": "Exactly what i was looking for", "user": "scotty", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47843069}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The flight into Drake Bay is particularly scenic. We flew in a 4-seat propeller plane from Manuel Antonio. It was an exciting adventure by itself! The plane landed on a dirt runway with a small building alongside, but not much else.", "title": "Lovely jungle lodge", "helpfulness": 1, "user": "Camdenuser", "date": "August 31, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 39325753}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "We were picked up in a van and driven to the village where a small boat from La Paloma was waiting for us (we did have to wade in the water to get on the boat). The boat ride was very short, maybe 5-10 minutes. The boat takes you to La Paloma’s dock area. Steps lead up to the path/road to the resort. The climb from the dock to the resort is decidedly steep.", "title": "Awesome", "user": "mtmsc", "date": "August 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 37457823}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "La Paloma Lodge exceeded all expectations. In addition to truly wonderful food, a beautiful setting, and terrific rooms, the staff couldn't have been more helpful. My two young adult sons, my husband and I were in the middle of the jungle while our luggage - swim suits, hiking shoes, etc - were stranded in Dallas. Nicole of La Paloma gave me her hiking shoes, found bathing suits and was even able to locate size 12 shoes for my son. The guides are quite knowledgeable and clearly enjoy their work. I look forward to returning to this slice of heaven.", "title": "I've never been treated so well......", "helpfulness": 1, "user": "lcavise", "date": "August 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37142809}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My wife and I have both been to to Costa Rica a few times and Drake Bay / Corcavado National Reserve is by far the most beautiful place we have seen. You can take a boat in from Sierpe or drive from Rincon (the drive is not that serious and it is beautiful scenery along the way). We stumbled across La Paloma while hiking around and decided to splurge for a few nights (we had been staying in $40-50 a night cabinas). There are a few resorts / lodges in the immediate area including some great tent camping sites. After checking them out, La Paloma stood head and shoulders above the rest based on its location and quality. For a reasonable price that included 3 excellent meals a day we stayed in a 2 story, free standing, open air lodge with windows all around and a massive porch (with a hammock). From the porch we saw monkeys, sloths, toucans, and macaws. La Paloma served as a great starting point for day hikes in the jungle - some of the most amazing scenery we have seen (think Jurassic Park). The staff at La Paloma were very helpful and kind. If you are looking for the lap of luxury this may not be your cup of tea. If you want beauty, good food, comfortable amenities, and are interested in seeing the jungle by boat, kayak, and hiking, La Paloma is the spot.", "title": "Jungle Paradise", "helpfulness": 2, "user": "isaacmarcs", "date": "July 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35960120}, {"rating": 5.0, "stay_parameters": "Stayed July 2009", "text": "I have the good fortune of having been to La Paloma many times--with groups, with family and friends, and on my own. It is a very special place that always calls me to return. The staff is always incredibly warm and welcoming and will do whatever possible to be helpful...right down to drying one's shoes overnight by the generator (this is a real plus as nothing ever really dries on its own on the Osa!); morning wake up knocks, freshly brewed coffee, home baked bread and muffins; arranging for the guide and boat to depart for Corcovado an hour early because the guests want to see the sun rise and get a super early start in the park, etc. etc. La Paloma attracts interesting and engaging guests; it's great to compare notes about one's day or one's life with others before and during the delicious family style dinners. Sometimes these acquaintances are delightful friendships of the moment; however, on more than one occasion, these friendships have blossomed and continue long beyond the shared time at the Lodge.", "title": "A little slice of paradise and my #1 vacation spot in the world", "helpfulness": 4, "user": "adventuretraveler52", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35519195}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "All the rooms and ranchos at La Paloma are spacious and lovely. They are not lavish yet they are appropriately elegant and in harmony with the surrounding environment. Each has a porch and hammock with beautiful views of the ocean, trees, flowers, and plants, and the bird and animal viewing is spectacular. And, I never tire of sitting on the porch in front of the dining area to watch one of the beautiful sunsets; they are the best. Relaxing, and completely \"unplugging\" at La Paloma is easy and a true joy. Given the intense and ultra fast paced world in which we live and work these days, unwinding at La Paloma is the best.", "title": "What an amazing place!", "helpfulness": 2, "user": "CR_Reconteur", "date": "July 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35448430}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My absolute #1 favorite activity while at La Paloma is going to Corcovado National Park. I never tire of my time there and always see and learn new things from the great La Paloma guides. I also love the mangrove boat tours. The staff at La Paloma, particularly Nichole, the long-time manager, provides a wealth of information and creative ideas about what one can take advantage of while at the Lodge and also in other parts of Costa Rica. In fact, it was Nichole who introduced me to the indigenous community of Boruca where I took a whole group of people to see their village, learn about their customs and traditions, and see the Borucans carve and paint their extraordinary masks and weave their beautiful textiles. It was a highlight of the group's trip.", "title": "Paradise!", "helpfulness": 2, "user": "SimplyPutSarah", "date": "June 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32602079}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "We really enjoyed our time at La Paloma; it was the highlight of our trip to Costa Rica. We stayed in a “sunset rancho” (#3) which had two floors, each with a double bed, sitting area and a bathroom. The cabin overlooked the ocean and jungle and you could imagine that you were actually alone on the Osa, esp. on the porch which had an additional seating area and a hammock. The cabins are made of beautiful woods and are basically open to the outside (no screens or AC), the bathrooms are open on one side and overlook the ocean. There are mosquito nets to hang over the beds. My son used his, but ours was really too small for two people and we didn’t like the feel of it, so we didn’t use it. The whole time I don’t think we got any bites except a couple of ant bites. The rooms were made up twice a day; the hotel provided purified water in jugs in the rooms and soap (no shampoo).", "title": "Luxurious jungle/beach lodge", "helpfulness": 6, "user": "S_S", "date": "August 14, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5607740, "likes": {"liked": "— The exotic location, the views and service", "disliked": "— hikes up the hills"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "On arrival (a trip involving a small plane a cool bumpy jeep ride and a quick boat ride), we hiked up the hill to the hotel. There we were greeted at the lodge with fresh fruit, juice and cake while they explained the layout of the lodge and the tours included in our four-night package. After checking out our cabin, we went down to an empty beach (5 min hike down hill). The beach is a bit small, but fine for my 8 year old – the surf can be very rough so we made sure to stay close to shore. That afternoon after lunch we went kayaking up the bay/river from the lodge. Kayaks, snorkeling equipment and boogie boards are provided by the hotel as well as sarongs which substitute for beach towels (they’ll exchange these as needed). Each night, dinner was a group meal, they started serving appetizers around 6 each night (nice view of the sunset from the porch) and many people had wine or cocktails (not included in package price). At dinner we had a soup and salad as well as a choice of two entrees (fish or chicken/beef) and side dishes (rice and beans were also avail), followed by dessert. We thought the food was excellent and they were happy to offer an alternative to our son if he wanted one, although he was happy to eat the regular food the whole time. The service was excellent and organized throughout - everyone we encountered was more than pleased to accommodate our requests or questions. The next day we went on the Cano Island boat trip, starting out at 7:30, with a group of 9 guests, we traveled by boat for about 1 hour then anchored to snorkel. Most of us enjoyed the snorkeling although there was apparently not a lot of fish that day. We then traveled another 30 min to the island where we anchored and had 2-3 hours for beach time and lunch. In the guidebooks it states that there are pre-Columbian artifacts (spheres) on the island but these have been removed, so there was no reason to leave the beach. We then stopped for some more snorkeling on the way home. The next day we left at 6:30 for the Corcovado jungle tour. Our group was split in two so we only had 5 people and a guide on our hike which really allowed us to go at our own pace. Saw monkeys, birds and bugs, and hiked up to a waterfall. This trip was really fun! The final full day, I got a massage while my husband and son hiked a bit and hung out at the pool; then we visited the beach once more and finally did the “Bug Lady” night tour (not included in our package) which was great, but not for the squeamish.", "title": "Highlight of the Trip", "helpfulness": 6, "user": "chicago6", "date": "April 25, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5007813}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "Overall, I can really recommend the hotel for the location, service, tours and food. The one caution – this area is not for the “bug phobic” as there are plenty of lizards and bugs outside and occasionally in the rooms (we had to chase away some big grasshoppers and a huge moth). As far as child friendliness, there are not a lot of areas where your child can run “free”, as you are supposed to stay on the paths to avoid biting ants and snakes. There were no other small children the week we were there, so my son had to make do with grown up company and books/games, but the hotel staff was happy to answer his questions and the tour guides made a point of talking to him and helping him on the hikes and snorkeling. I think 8-year olds or older will enjoy the place, but I wouldn’t bring smaller kids, as the day trips might be too hard for them.", "title": "Easter at La Paloma", "helpfulness": 7, "user": "jodola", "date": "April 24, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5003312}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Just got back from three weeks in Costa Rica and La Paloma might have been the highlight of the trip. My girlfriend and I spent four nights at the Lodge and were blown away. I'd been to Drake Bay a few years earlier and stayed at a lower budget lodge. That area of the country made such a strong impression on me I knew I wanted to go back, though I also knew I wanted to stay at a more upscale lodge. I was a little worried that at such a high price I might be disappointed, but that wasn't the case at all.", "title": "A GREAT place to go", "helpfulness": 3, "user": "Beth_Joe_VA", "date": "April 16, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4978292}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "I think the key to La Paloma is the staff. They run the lodge like clockwork and were eager to satisfy any request we had: food, daytrips, room, medical (my girlfriend got stung by a jellyfish), etc. The Lodge itself is incredible. It has a beautiful pool that overlooks the Pacific, and is perfect for cooling off after a long day in the heat. The beach is a short hike down an easy path and is great for boogie boarding or just floating around. One of my favorite aspects of the lodge was that they do a family dining style. Every one eats together at huge tables. After being there several nights, we knew pretty much everyone at the lodge and it was a great opportunity to chat it up with people from around the world.", "title": "Great place, good for all family members", "helpfulness": 1, "user": "mining", "date": "April 4, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4895640}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My wife and I thoroughly enjoyed our stay at La Paloma. The staff were friendly and very helpful. Our guide (Randall) was outstanding!. We've spent time with naturalists/guides on other nature oriented trips but Randall was better than all the rest. The manager (Nicole) did a great job keeping track of the details of our itinerary which made it that much easier to relax and enjoy the surrounding. The location was beautiful and peaceful, except for some early morning wake up calls from a nearby howler monkey. I had been apprehensive about sleeping in such a warm, humid environment without the benefit of air conditioning, but with the fans in our room and the cooler evening temps, we slept great. Overall the food was very good though some dinner options were better than others. With no hot water, the showers were a little cooler than refreshing, but this was not enough to cool our very positive experience at La Paloma. We had no issues with bugs in our room but we were careful to minimize the use of lights at night which may have helped. They charged $8 per load of laundry which was greatly appreciated since we had to pack light for our flights on Nature Air and Sansa. (Many hotels will charge $4+ to wash one shirt.) Hiking with a guide is recommended because they will see and point out infinitely more wildlife then you will see on your own, and their knowledge of the local flora and fauna is incredible.", "title": "Great Place on the Osa Peninsula", "helpfulness": 2, "user": "Menschman_J", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 29246866}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The Osa Penninsula is a must go for nature lovers... but there are much better options for accomidation than La Paloma.", "title": "1/2 Star Service for a 5 Star Price", "helpfulness": 5, "user": "paintingpony", "date": "April 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 28625958}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The grounds and rooms of La Paloma were beautiful and well maintained. The rooms were also beautiful, but completely open. (I had a LARGE spider crawl next to my foot while going to the bathroom one morning.) There were monkeys and other wildlife on the property which allowed a unique experience and close-up viewing.", "title": "Great way to end a honeymoon week in Costa Rica!", "helpfulness": 2, "user": "Scott C", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26753419}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "Drake Bay was the last stop on a 10 day, 3 location trip. We had just come from Tabacon in Arenal which was an amazing hotel with all the amenities and unbelievably good service. La Paloma was the same price per night (app $400 per night), but staying at a cheap motel in the states would have had better service.", "title": "Heaven!!", "helpfulness": 2, "user": "vsm17", "date": "March 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26738692}, {"rating": 5.0, "title": "Paradise and more...a must visit!", "text": "Meals were served family style with two choices. The food was ok. On one of our outings, we discovered that the hotel had provided sandwiches and leftovers from lunch two days before. When I asked about the best way to put up the mesquito net in my room, I was told that it would be taken care of. 3 hours later I had to ask again. Whoever put up the net knocked some of my stuff off the bed and left it on the floor. A pitcher of filtered water was provided in the room because the tap water was not drinkable. We went through this pitcher rather quickly and had to ask serveral times to have it refilled.", "user": "RayMat", "date": "March 15, 2009", "id": 26193757}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "An absolutely lovely place. Beautiful accomodations and amenities, extremely friendly and helpful staff, great food, in a peaceful and beautiful setting. Lovely views of the Pacific. Suitable for all ages -- we were a group encompassing 3 generations, from ages 11 to 75, and we all loved it and agreed it was one of the nicest places we'd ever been. We had one of the Sunset Ranchos, which was private and quiet, had a great view, very comfortable, and was clean as a whistle. Nice pool and a nice swimming beach (my kids loved it). Lots of birds, wildlife and gorgeous plants and flowers. The activities offered by the lodge, such as hiking in nearby Corcovado National Park, and snorkeling.scuba at Cano Island, were also wonderful, with knowledgeable, friendly guides. Bottom line: a great place. I'd go back in a heartbeat.", "title": "Absolutely Wonderful!", "helpfulness": 1, "user": "Paul99501", "date": "February 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6781073, "likes": {"liked": "— Combination of natural setting with luxury and great service", "disliked": "— I have no complaints"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "In May 2006 we spend 2 wonderful weeks in Costa Rica. After San Jose and Tortuguero we stayed at La Paloma in Drake Bay.", "title": "Beautiful room, great trip to Corcovado", "helpfulness": 3, "user": "nlpri", "date": "January 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6719008, "likes": {"liked": "— Locaton"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Landing in Drake Bay and our drive passing a river with the Landrover were an adventure in itself.", "title": "Loved the bug tour with Tracy and John", "user": "volcanolover", "date": "December 27, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6504400, "likes": {"liked": "— charming and beautiful", "disliked": "— reserve early for the high season. Be sure and bring a flashlight."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "We were one of only 2 couples staying at La Paloma and were upgraded to one of the Ranchos. We didn't see the room we originally booked, but the Rancho was great! Especially the hammock on the deck. The feeling of sleeping in the middle of the jungle with only a musquito net over our bed was very exciting and a bit of a worry to us, but we slept like babies (bring a flashlight for midnight bathroom trips).", "title": "I love La Paloma!", "helpfulness": 5, "user": "Rosebuds8", "date": "October 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5933070, "likes": {"liked": "— Beautiful view and open windows", "disliked": "— Bring an extra flashlight"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The grounds around the lodge are very lush and beautiful and we saw monkeys and a sloth right outside our room. The pool wasn't as nice in my opinion. Fully shaded, limited view and many leaves floating around. Not bad, but not amazing.", "title": "Give it some good thought before you shell out.", "helpfulness": 21, "user": "LowerEastSide", "date": "August 24, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 2.0, "rooms": 2.0, "location": 5.0}, "id": 5707282, "likes": {"liked": "— The private beach and the tour of the rainforest.", "disliked": "— The throngs of loud children and the NEVERENDING BUGS."}}, {"rating": 5.0, "title": "La Paloma is awesome!", "text": "The rooms are beautiful, the staff is attentive and very helpful, the private beach is beautiful. The grounds are so beautiful and well kept. The food is 5 star quality. You are really treated like royalty. This is the most awesome place to stay in Costa Rica.", "helpfulness": 2, "user": "Peglites", "date": "June 16, 2009", "id": 32462308}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "My husband and I stayed at La Paloma for 5 nights in mid-April and loved it! The staff was great and attentive and we thought the food was terrific, especially the homemade loaves of bread every day at every meal AND at every picnic!! We loved and appreciated the beautiful yet rustic accommodations (NO/AC). The room had gorgeous wood on the floors and walls and our room had a large terrace with a hammock overlooking the rainforest trees out to the Pacific Ocean. (You can even have a masseuse come to your room (for a fee) and get your massage on the porch. (There's lots of privacy). The bathroom had very pretty tile and was open by the ceiling so you always had fresh air. We did not mind the several minute hikes to the beaches and the boat landings. It was all part of the experience and having a feeling of being off of the beaten path. Also, the guides for the nature hikes and trips were phenominal!! Nichole (manager) and her staff were very organized and paid attention to every detail of everyone's daily or overnight excursions and made sure we had what we needed! There was a fridge in the room and you are welcome to take food from the (famly style) restaurant and bring it back to your room. We were there in mid-April and it was very hot and humid but we survived the nights with the ceiling fan and the windows open. We would recommend La Paloma to our friends and family. If you're looking to get away from a brand name hotel with doormen, a/c, and room service, etc.. then this is a great get away. It's peaceful, quiet, and moves at a slow pace. You are in Central America, after all.", "title": "We loved staying at La Paloma and would go back.", "helpfulness": 3, "user": "doodlesChicago_Il", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30529953}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "To truly enjoy La Paloma, one must let go of all of the \"sense of entitlement extraneous must haves\" that many North Americans have while travelling.", "title": "This is heaven on earth.", "user": "cubmusch", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30528314}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "* FYI: our room and bathroom were cleaned every day and your water pitcher is filled with fresh drinking water daily, as well!)", "title": "my favorite place in costa rica", "user": "elchoArizona", "date": "May 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30526606}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "(P.S. We were also travelling with 12 other people and they all feell the same as we do about La Paloma)", "title": "Dont go in April (end of dry season)", "helpfulness": 3, "user": "Noble_Othello", "date": "May 5, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 29375326}], "location": {"country": "Costa Rica", "continent": "Central America"}, "variance": {"poor": 6, "average": 7, "very good": 24, "terrible": 1, "excellent": 219}, "aka": "La Paloma Hotel Drake Bay", "slim_ranking": 0.5, "description": "Outstanding views of Drake Bay and the Pacific Ocean from our Lodge. Our standard rooms are large and include a private bath and an ocean view balcony. Our ranchos are one and two-story private cabins that also offer balconies with stunning ocean views. They hold up to 6 people and are very spacious. Some are equipped with a bathroom on both the upper and lower level, and are suitable for families or two couples traveling together."}