{"user_rating": 4.5, "review_count": 94, "name": "La Paloma Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2006", "text": "We rented a 2 bed/2bath from a private party at La Paloma and it was a decent place to stay. Secure, nice views and we enjoyed our stay. I am glad we only stayed a few nights and so dont even think about staying for a whole week. In addtion, if you are thinking to go down on 4th of July - there is no peace and quiet to be had. Fireworks all going off at all hours day and nightt. Just a word of warning, I would check to see if you have air conditioning in your unit as ours did not have it. I was shocked! It was pretty hot there so we tried to keep the windows open. No choice if you dont have AC. Because of the noise, and no AC, I did not get much sleep. I just assumed that it would have air conditioning/heating - word of advice never assume. Overall the resort is nice but its not spectacular. You can walk to the Rosarito Beach hotel from La Paloma and then walk around town from there. At night, I would advise taking a cab and leaving your car in the safe and secure parking lot.", "title": "4th of July Weekend - KABOOM", "helpfulness": 12, "user": "ROSEOC", "date": "July 7, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 5434901}, {"rating": 1.0, "title": "Never again! Warning if you go as a Family!!", "text": "I had not been down to Rosarito in a number of years so I was impressed with the new Toll Road. It costs $2.30 cents - very cheap. I must say that things have improved over the years but it is still pretty dirty and rather unsafe driving. Rosarito is a very small place so I would recommend only staying 2 or 3 nights maximum, as you can see the whole town in 2 days. The first night we dined at El Nido restaurant in Rosarito, this is a must. The food and atmosphere were great. The second night we ventured to Puerto Nuevo for lobster, it is about a 15 minute drive south. I was not too impressed with the Lobster as it was not that cheap ($25 a plate) and it was not fresh from Mexico - they are frozen. The village of Puerto Nuevo is very small and it takes 1 hour to walk around and shop. Note the restaurants in Puerto Nuevo close early at 9pm and the car park closes at 10pm - you wont be partying there all night.", "helpfulness": 20, "user": "A TripAdvisor user", "date": "May 20, 2006", "id": 5183657}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "La Paloma is a good, safe place to stay in Rosarito.", "title": "An ideal place!!", "helpfulness": 18, "user": "Martin A", "date": "April 4, 2006", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4896215}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "Never again I myself have a large family 5 and had problems from the very beginning with this place is definitely not accommodating to your needs all. Small area to park and Security is so tight you are not allowed visitors from other hotels? I asked about this policy and do speak fluent Spanish and was giving no reason other than they are not guest here? After giving it half a day it just got worst. Left this hell hole went down the street and checked into Rosario Beach Hotel and proceeded to have an excellent week from their far better resort. Very disappointed in La Paloma Resort -- small rooms and pools are small more of a retirement location if your into that honestly and definitely not a Resort", "title": "We're going back again!", "helpfulness": 16, "user": "spotcat", "date": "March 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4823179}, {"rating": 3.0, "stay_parameters": "Stayed October 2005", "text": "I have stayed in the Rosarito area with my family and friends for atleast 30 years. Although this is a time-share owned by World Mark, I believe there are units that can be privately rented. We stayed in a 2 bedroom/2 bath unit with \"turn key\" amenities. Two T.V.'s with cable and a lovely balcony looking out onto the grounds. We were third floor. Although they advised we bring towels, which we did, they were not needed. Our unit was cleaned once a day, towels changed, and we even had our own washer and dryer and laundry detergent was provided!! A full size refrigerator with ice maker, dishwasher & all of the basic utensils for cooking were there. Alhthough our cooking was \"limited\" there is a convection oven if one chooses to cook (along with 4 burner stove top). There are tennis courts, pool, spa, exercise room on the grounds. The little \"Italian Restaurant\" on site is cute and of course, Mexican dishes are offered!! The staff was very pleasant at the Resort and the Restaurant. The only \"draw back\", if you can call this one, is you have to drive into down. La Paloma is located just south of Renee's (a local place for American's that now reside in Baja). Also, the road traffic is loud in the front bedroom, if you left the window opened. However, with the ocean breeze coming through that was not necessary! We are going to Puerta Vallarta in May, usig the same timeshare comapny. Hopefully, it will be as nice as this one!! There is another bar in town, beyond Rosarito Hotel, that is owned by two American's, who moved to Baja from RIVERSIDE, CA, it is called \"NO BAD DAYS BAR\". It's upstairs next to a bakery. The people are friendly and they can let you know all the good eating places in town. There's a restaurant, on a side road, noted for lobster, lamb and other wonderful dishes (near Wally's) this restaurant is owned by two cooks that used to work for El Nido's Steak and Seafood Restaurant -- but I can't remmeber the name of it -- but AT NO BAD DAYS BAR -- I'm certain they can tell you. Have a great time in Baja!! We always do!!", "title": "Beware of privately owned rentals", "helpfulness": 15, "user": "glrsandldy", "date": "January 30, 2006", "detail_rating": {"cleanliness": 2.0, "rooms": 2.0}, "id": 4398966}, {"rating": 4.0, "title": "Wonderful place", "text": "I stayed in the Worldmark timeshare area, unit 324 for a week at the end of October. What a wonderful place to stay.", "helpfulness": 23, "user": "A TripAdvisor user", "date": "November 3, 2005", "id": 4082295}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The unit was impeccably clean. It had 2 bedrooms, 2 bathrooms, kitchen, living room and deck. There was a peekaboo view of the ocean, but a great view of the pool. The furniture is glass/wrought iron and wicker and I didn't find it too comfortable, but it was ok. The unit is tile floor and tile countertops. The pillows are extremely flat -- like a hard 1\" thick.", "title": "What a Perfect Trip", "helpfulness": 24, "user": "MrsVerloop", "date": "October 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4006533}, {"rating": 5.0, "title": "La Paloma Beats the High Rises!", "text": "The complex is very secure with security personell walking around frequently. All the staff was very helpful and very easy going. My demands were never great, but they always assisted. All front desk staff spoke perfect English and were very smart and efficient.", "helpfulness": 18, "user": "A TripAdvisor user", "date": "October 6, 2005", "id": 3998818}, {"rating": 5.0, "title": "A relaxing getaway", "text": "Another timeshare company office has DSL internet access for $2 per hour. Sometimes you can half it (30 min.) for $1 -- depends on if the person is \"by the book Betty\" or not.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "October 3, 2005", "id": 3984925}, {"rating": 5.0, "title": "Impressive! Impeccable!", "text": "There is one tiny restaurant on site. Here's my opinion. The staff is nice, the cook I'm sure can easily cook \"real\" mexican food. But, they've tried to hard to make the food bland for \"---\" that visit. So, it was like chef boyardee from a can. So my recomendation is to not eat here. They do however have good quacamole, chips and salsa, beer, milkshakes (no liquor). And they have room service.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "September 11, 2005", "id": 3895451}, {"rating": 5.0, "title": "Relax in comfort ....", "text": "We stayed at La Paloma from 24th to 31st July, 2004 in a beautiful WIVC 2 bed, 2 bath condo which we booked over the internet on the recommendation of Trip Advisor! We had a very relaxing vacation. The resort was self contained with the beach, pools, sport activities and restaurant on site. Highly recommended if you want a very quiet stay. Staff were very friendly, if strict (don't leave your towel hanging over the balcony!), but the security is excellent.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 20, 2004", "id": 2479211}, {"rating": 5.0, "title": "back for more", "text": "We've stayed at La Paloma 4x in the past 3 yrs., taking friends and family each time. We've enjoyed our 2br/2ba condo (Worldmark) as well as an ocean view villa so much that we are considering buying a full ownership villa! We went 7/31 just for the day. Very relaxing. To the south of the resort is greatly improved paved road, wonderful things to see & do. Location allows us to park and walk to town or to the south. Fabulous view drive to Ensenada.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 3, 2004", "id": 2363472}, {"rating": 4.0, "title": "Que bueno, Rosarito!", "text": "I stayed with friends at La Paloma July 15-17, 2004. Just wonderful! The grounds are very well maintained, office staff was friendly and helpful.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "July 15, 2004", "id": 2301441}, {"rating": 5.0, "title": "Great family vacation spot", "text": "Highlights: wonderful beach/sand area...vendors are there every day shopping their wares from hairbraiding to temporary henna tattoos...had to say \"gracias, no\" muchas veces (many times). My friend had a timeshare via WorldMark, and the room was in great shape. Beatris in housekeeping was terrific. Security was true to their name: secure. They verified each person coming through the gates. I left my car parked there the whole time and nothing happened to it.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "April 26, 2004", "id": 1839549}, {"rating": 5.0, "title": "Loved it!!", "text": "Lowlights: my room faced the facilities area and every morning at 6:30a.m. the employees were talking at very high volume...walking right by my window on their way to the laundry facility, which happened to be at the end of our hallway--not good customer service.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 22, 2004", "id": 1831378}, {"rating": 4.0, "title": "had a great ime", "text": "We flew into San Diego from Sacramento, rented a car and drove to the La Paloma in Rosarita. The place was very nice. We felt very safe and everyone was very polite. Our Condo was clean and had a terrific ocean view. It’s a medium distance walk on the beach to downtown. That made it nice so you can get away from the loud noise the clubs made. But close enough to enjoy the night life if you wanted to. We will stay their next time we go.", "helpfulness": 14, "user": "A TripAdvisor user", "date": "August 18, 2005", "id": 3786612}, {"rating": 5.0, "title": "A Gem Right Outside Rosarito Beach!", "text": "I stayed at the privately owned Oceanfront (yup!) Villa #254 for a week and I was immediately taken with La Paloma! I'll come back to La Paloma whenever I can since I live in San Diego! It's just a quick drive down there.", "helpfulness": 46, "user": "A TripAdvisor user", "date": "June 9, 2005", "id": 3540933}, {"rating": 2.0, "title": "We rented 2 rooms way in advance.. so many things were broken in the showres, closets... ", "text": "From the time of my arrival to departure, it was a hassle-free experience. Yes, the other reviewers were right on when they said it's strict there but thats a good thing! It's safe! An island into itself yet a quick taxi trip for $2 (negotiate!) gets you to the heart of downtown Rosarito Beach. No big deal! My car is left alone the entire week I stayed there. I didnt have to use it at all and that's just surreal for me!", "helpfulness": 20, "user": "A TripAdvisor user", "date": "March 11, 2005", "id": 3266639}, {"rating": 5.0, "title": "Simply spectacular", "text": "Thank you both La Paloma and Rosarito Beach Vacations for introducing me to a great place to unplug myself! I'll be back soon now that I got a great deal on an one year auto insurance policy for the Baja! ;)", "helpfulness": 11, "user": "A TripAdvisor user", "date": "December 7, 2004", "id": 2867087}, {"rating": 2.0, "stay_parameters": "Stayed October 2004", "text": "we were not told to count all the white towels before we put them outside to be washed... they then billed us for 3 missing towels??? we would never take towels.. especially the shabby ones they provided... why should we be expected to count towels???? Don't they trust their own staff????? ..we had so may problems with this expensive \"resort.\" They charged us for missing towels.... we never knew we had to count them everyday.. guess their cleaning staff takes them home.. we had no use for the shabby white towels with holes... the bathrooms had missing towel racks, terrible beds, critters in the kitchen. We would NEVER stay there again.", "title": "Not what I thought it would be.", "helpfulness": 20, "user": "psmconnor", "date": "October 7, 2004", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 3.0}, "id": 2625676}], "location": {"country": "Mexico", "region": "Baja California"}, "variance": {"poor": 3, "average": 4, "very good": 29, "terrible": 4, "excellent": 54}, "aka": "La Paloma Hotel Rosarito", "slim_ranking": 0.0625}