{"user_rating": 5.0, "review_count": 113, "name": "La Perla Boutique Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "La Perla is located in the heart of Guadalajara, making it possible to walk to many restaurants and historic sites.", "title": "La Perla is a great, friendly place!", "user": "Chilton03", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23363631, "likes": {"liked": "— The very helpful hosts!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "This time I traveled with my \"twenty something\" grandson who was eager to check out the club/music scene.", "title": "Perfect place to stay in Guadalajara !", "user": "BGnDC", "date": "January 7, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23349676, "likes": {"liked": "— Location, Location, Location", "disliked": "— I liked everything about the accommodation - there isn't anything not to like. If I had to pick something, I'd say there is no pool or jacuzzi, but that isn't high on my list of things anyway."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "In Mexico this means being out and about from midnight to four or five am. Not my cup of tea!. Our very gracious hosts personally escorted Philip for the entire evening! More than great service!", "title": "I Love LaPerla!", "user": "Cyberpet7855", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21109826, "likes": {"liked": "— Clean, Beautiful, Relaxing", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "La Perla is a beautifully restored 19th century Mexican colonial bed and breakfast in the heart of historic Guadalajara. It is a small bed and breakfast, with three rooms - just perfect as you will quickly become friends with the other guests. Chris, Lars and the whole staff are very friendly and eager to make your stay a memory not to be forgotten. We have been 4 times and each visit has been better than the one before. It is within easy walking distance to the historic district and much of the night life that this very safe city has to offer. If you are looking for a convenient, quiet place to stay in an urban setting, La Perla is for you! I highly recommend it - you won't be disappointed.", "title": "Great place, great Guys! Beautiful Hospitality!!!", "user": "tonyb33400", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20313378, "likes": {"liked": "— the quality of the staff and attention to my every need.", "disliked": "— The breakfast"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I Originally visited LaPerla, Guadalajara, MX October 2006, during their Grand Opening. It was such a wonderful experience I returned again in 2007 with extended family.", "title": "Love La Perla", "user": "hndsmredps", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20294698, "likes": {"liked": "— Everything", "disliked": "— Everything was so good, that I cannot answer this question."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "La Perla is so special and unique. I have traveled all over the world, and stayed in quite a few B&Bs, but there is no place like La Perla. I can hardly describe how much I enjoyed my stay there.", "title": "Unforgettable", "user": "humble_drinker", "date": "April 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28016978}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "La Perla has everything that a traveler can ask for. Both leisure and business travelers alike will find the house perfectly comfortable and convenient.", "title": "Living your dreams", "user": "villegaa", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26828651}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "House: beautifully restored and tastefully decorated. The house offers all the modern conveniences you need without losing its classic and local charms. I just fell in love with the house in the moment I entered in. The high-ceilinged rooms are spacious and each room has its own style and character. The gorgeous roof-top terrace is perfect to relax enjoying a gorgeous view of Templo Expiatorio.", "title": "Excellent hospitality", "user": "AlbertaTom", "date": "March 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26169837}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Location: close to the historic center of GDL, but conveniently located on a quiet residential street near by Guadalajara University. It takes only 5 minutes on foot to the historic center. Good places to eat and drink are all found in walking distances.", "title": "What a special place to stay!", "user": "Indytraveler59", "date": "February 1, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 24078812, "likes": {"liked": "— the friendliness of the owners and the location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009", "text": "Breakfast: simple but very good. They offer freshly brewed coffee, orange juice, toasts and sweet breads, fruits, yogurts and cereals. Sometimes they serve omelet, too. I was really happy with their breakfast.", "title": "Amazing Experience at La Perla", "user": "YVRTravellerBC", "date": "January 16, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23619283, "likes": {"liked": "— Location, Hospitality, quality", "disliked": "— leaving"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled solo", "text": "LaPerla is a special house, with high ceilings and large windows, a grand staircase, and a lovely roof top terrace. The location- colonia Americana- is a 5-10 min walk from downtown and provides a bit more serenity than most downtown inns and hotels that I have stayed at, especially in major cities. Laperla and her owners came recommended to me from a friend and I have returned 3 or 4 times.", "title": "And the five star award goes to.....LaPerla", "user": "rsmrob100", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20230379, "likes": {"liked": "— The quality and size of room/private terrace.", "disliked": "— Not pet friendly."}}, {"rating": 5.0, "title": "What a Great Place", "text": "One very important note is that GDL is obviously a huge city and may be initimidating for some, especially if you do not speak Spanish, but no worries- Lars and Chris will give you as much assistance as you require, including bringing you to clubs for drinks, or going out to eat with you and other guests in some of the excellent restaurants that the city has to offer.", "user": "MiguelitoLosAngeles", "date": "September 20, 2008", "id": 20222533}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "What a great B & B. The owners Lars and Chris were so welcoming and accommodating with their time and energy. I would never look for a diffierent place to stay in Guadalajara as long as there is a room available at La Perla.", "title": "The Best Vacation in Years!!!!!", "user": "MexVisitor", "date": "October 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10111728, "likes": {"liked": "— Greaqt Mansion and perfect Hosts", "disliked": "— Length of stay"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This was not a planned vacation, but from the time I arrived at La Perla I was made like a VIP and it did not stop.", "title": "Like Visiting Old Friends Who Live in a Cool Place", "helpfulness": 1, "user": "RJA48", "date": "September 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 8717033, "likes": {"liked": "— The Mansion is absoluely beautiful as are the room plus the owners make you feel like family", "disliked": "— Nothing comes to mind"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I have stayed in many beautiful and elegant places over the years, but this was truly special a magical place.", "title": "Can it get any better than this???", "helpfulness": 2, "user": "ricvamundo", "date": "May 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7540704}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My husband and I stayed at La Perla for two nights in late March (2007). We traveled from Puerto Vallarta to do some shopping and to attend a concert of the Jalisco Philharmonic at Teatro Degollado in the Historic Centre. We found La Perla through Trip Advisor. We could not have made a better choice.", "title": "Great location, accommodations and very helpful hosts", "helpfulness": 1, "user": "careyeroslib", "date": "April 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7479386, "likes": {"liked": "— Accommodations, location, nice neighbourhood, friendly hosts", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "We were looking for reasonably priced, but nice, accommodation in the main University of Guadalajara area, somewhere between Calz. Federalismo and Minerva, i.e., a place within walking distance of Teatro Degollado and downtown, but in a quiet residential neighbourhood away from downtown. We also wanted to be able to walk to some of our favourite restaurants, like Sacromonte, as well as to explore some of the shops that sell Espresso Machines. Our goals were all met--exceeded-- at La Perla.", "title": "Best B&B!!!!", "user": "SuziSpotlight", "date": "April 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7476678}, {"rating": 5.0, "title": "wonderful time at LaPerla", "text": "The accommodations are beautiful (see our pictures) and very comfortable. We stayed in La Cine, the smallest of the existing rooms, but it felt very large and spacious because of the high ceilings and the little library right outside the door of our room, making La Cine seem as if it is a suite. The private balcony was lovely to sit out on enjoying a drink. If one wants more space, you simply go up a flight of stairs to their magnificent rooftop patio (more on that below), where they have loungers and an Honor Bar (beer and wine). Our bed, a Queen, and pillows were very comfortable. Since the plumbing and wiring are completely new, there was great water pressure and lots of hot water too. Umbrellas and an electric blanket in the armoire as well as a clock radio with CD player give one the feeling of being very welcome. There is also complimentary HiSpeed Internet Access in each room, as well as Wireless throughout the house. Guests are also welcome to use the house computer in the bar area (complimentary of course).", "helpfulness": 1, "user": "donnegan", "date": "March 5, 2007", "id": 6916295}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "As other reviewers have pointed out, staying at La Perla is like staying with friends. Unlimited bottled water is complimentary and readily available at any time. Guests are shown the cupboard where supplies (bottled water, towels, soap and shampoo, Kleenex, etc.) are kept and welcomed to help themselves as needed. One of the owners, Lars, always makes a fresh pot of coffee by app. 7:00 am and guests are often offered nightcaps and before dinner wine all served in beautiful crystal glassware. The continental breakfast is also tasty, made with fresh ingredients, all served elegantly—yet informally--in the dining room. If your schedule permits, the hosts eat breakfast with you, providing an opportunity to answer questions, or just chat. One of the owners, Cris, has family in Guadalajara, is totally fluent in Spanish, and has an intimate knowledge of Mexican life. Both hosts are a mine of valuable information.", "title": "Truly Boutique Bed and Breakfast", "helpfulness": 2, "user": "Philip_Madrid", "date": "March 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6915445, "likes": {"liked": "— Very friendly atmosphere"}}, {"rating": 5.0, "title": "Fabulous time at La Perla", "text": "One of my favourite parts of La Perla was the beautiful rooftop deck. Always evolving, it already has a full-size washer and dryer (front loading Maytag Neptune series) which guests are welcome to use. There is also a full kitchen which guests can use (when not in use for events) especially for refrigerating leftovers, and also an Honor Bar (beer is 10 pesos and wine is 100 pesos). Planned for the future are a hot tub and a dipping pool.", "helpfulness": 2, "user": "pddqa", "date": "December 8, 2006", "id": 6349377}], "location": {"country": "Mexico"}, "variance": {"poor": 0, "average": 0, "very good": 1, "terrible": 0, "excellent": 112}, "slim_ranking": 0.0212765957447, "description": "As our guest, you will feel like one of the Mexican movie stars connected to LA PERLA’s past: Gloria Marin, Jorge Negrete, Maria Felix… The Moorish mansion embodies the glamour of the famous old casas of Guadalajara, Jalisco.With a perfect location in the historical center, LA PERLA continues to be the place to meet interesting people and to discover what this exciting city offers. Whether visiting our city for business, vacation or study abroad, you can count on LA PERLA Boutique Bed and Breakfast to make your visit more exciting than any other hotel, inn, B&B, or guesthouse. From the time we pick you up at the International Airport, the time we spend with you will make your experience discovering Guadalajara better than just memorable. We will help you plan your free time which can include:Travel to nearby towns including Tequila, Ajijic and Lake Chapala, Colima and Puerto Vallarta as well as longer trips such as to Mexico City, the Yucatan, Oaxaca and San Miguel de Allende in the State of Guanajuato.Visits to the restaurants or night clubs for Latin music and dancing. We are also happy to help you obtain tickets to Mexican soccer league games (called futbol here); concert, symphony and dance performances; bull fights (called corrida de toros), Guadalajara’s mariachi and foreign film festivals as well as other cultural events."}