{"user_rating": 4.5, "review_count": 611, "name": "La Posada Private Jungle Bungalows", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My husband and I stayed at La Posada for 3 nights; from the second we arrived there we were greeted with smiles and hellos. Michael walked us to our room and was very informative of all the amenities they offer and what we could do on our stay at Manuel Antonio.", "title": "The Best Place I Stayed at in Costa Rica.", "helpfulness": 1, "user": "Vanessa A", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129932360}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The other guests there were very nice as well, it was like a small community and during breakfast since the seating area was not so big, people socialized and got to know each other.", "title": "Amongst friends!", "helpfulness": 1, "user": "advised_traveler", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 129170531}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "If you want attentiveness this place has it, I was attacked by mosquitoes, the bites were pretty bad, Esteban without asking brought out the first aid kit and provided me with allergy ointment, boy was I relieved, the itch went away and I was okay for the rest of the trip until I left.", "title": "Awesome hotel and staff!", "helpfulness": 2, "user": "boomta2", "date": "April 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128661464}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "The dinner that is provided on Tuesday, Thursday, Sunday is also very yummy, I was honestly over the rice and beans and to have steak, potatoes and salad was awesome, Jonathan did a good job cooking. Not to mention breakfast in the morning is also yummy all the fruits and breads are great, I really loved the banana bread.", "title": "Home away from home!", "helpfulness": 1, "user": "bazrj", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 127673234}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "On our last night we were on our way to El Avion for dinner and Jonathan recommended we go to Agua Azul, he had stated that they were both really good, however, the food was a little better at Agua Azul, we decided to go to Agua Azul and he picked up the phone and made reservations for us, again without even asking. We got there and our table was ready, not only was it ready it was PACKED, even the bar was full.", "title": "Relaxing", "user": "MKH50", "date": "April 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 127647414}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed here for 3 nights over July 4th. At first, we questioned our choice as it's not very nice from the outside. We arrived at 1:30 and our room was not ready yet. They let us drop our bags off and we came back. They were quick to give us a very clean room.", "title": "Great value, excellent location", "helpfulness": 1, "user": "kinoxl", "date": "July 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134265544}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "La Posada is a boutique type hotel with only a few rooms and a handful of bungalows and houses is worth the price. It's literally 200' from MA Park. We opted not to do a tour and it seemed like a good idea. We walked at our own pace and stuck near tour groups when we wanted info. The beaches inside the park are much nicer than outside, but all of the beaches were nice. We saw plenty of white faced monkeys in the park and of course, they stole peoples food.", "title": "Amazing!", "helpfulness": 2, "user": "Miyaj131", "date": "July 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133539580}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The walk from hotel to downtown area is about 10 minutes. DT is actually very small, maybe 500m from end to end. We ate at the el Sol, the Marlin, and El Avion; el Sol and Marlin have 2 for 1 Happy Hour drink specials, ocean front views and decent food; El Avion was cool b/c the restaurant is built on a cliff w/ an airplane in the middle; We also ate sushi at a small place across from La Posada, which was outstanding; we did not eat dinner at La Posada, but the complimentary breakfast was ok. (The only negative was that the \"kitchen\" is also the check in area and you have to wonder about cleanliness.) One day, they were making pancakes 3 at a time while there was 20 people waiting. It wasn't a big deal at all though.", "title": "Love Love LOVE this place!!! (sorry kinda late review)", "helpfulness": 2, "user": "MinnesotaMO", "date": "June 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132919652}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "They do book excursions for you and save you $. We went on the Dolphin tours snorkeling adventure, snorkeling wasn’t very good as visibility is fairly poor, however, we saw several dolphins that gave us a show.", "title": "Your Home Away from Home by the Rain Forest and the Beach", "helpfulness": 3, "user": "cdlune", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132557307}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "For the $, this place is great. It's close to the park, close to the beach and the staff is helpful. We met the owner MIke the last 2 days and he was very nice and also helpful. The pool is small, but who cares.", "title": "Nothing fancy, just a very cool place in a great location", "helpfulness": 3, "user": "Direwolf600", "date": "June 13, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 131886764}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed here in early August. I don't think I can say anything else that others haven't shared, so I'll repeat some of the highlights.", "title": "AWESOME Experience", "helpfulness": 1, "user": "Muriel12", "date": "September 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 177802484}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "The reservation process was easy. Jonathan answered my e-mails quickly, reserved my preferred room (the Parrot), and facilitated payment through a secured PayPal account. Our room was ready at 1:00 p.m. on the day of our arrival. The room was spacious, fitted with a brand new AC unit, great bathroom with consistently reliable hot water, a lovely private patio, and was SPOTLESS.", "title": "Great place right outside Manuel Antonio N.P.", "user": "Neotrips", "date": "August 30, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 174888018}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Daily breakfast was more than we needed. There was a rotation of fruits, bread for toast, peanut butter, eggs made to order, coffee, juice and breakfast meats and pancakes were sometimes served. Breakfast was served a little bit late for us. Cold items start appearing around 7:30 with the full hot breakfast usually ready by 8:00. Since the park opened earlier than that, we often felt rushed to eat to start our day in the park.", "title": "The Best of Costa Rica", "user": "TroATX", "date": "August 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 174316894}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled solo", "text": "The location can't be beat. You literally walk out of the hotel's entrance, turn left, and enter the gates of the park. We couldn't help but smile at our great fortune as we watched other tourists being bused in from their hotels every day to visit the park.", "title": "Loved, loved, loved this place!", "user": "rkalai", "date": "August 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173819485}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The pool is a lovely thing to enjoy every day after trekking around the park. We watched bands of squirrel and capuchin monkeys cavort around the pool and saw some amazing lizards. Each evening a deer comes on site. Jonathan loving refers to her as \"their gardener.\"", "title": "Had a fantastic time here!", "user": "Christine R", "date": "August 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 173523419}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We stayed in a bungalow and it was what we expected. The whole lay out makes you feel like you are in the rainforrest.", "title": "Really good for the price and location", "helpfulness": 4, "user": "knine183", "date": "June 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 131582628}, {"rating": 5.0, "title": "Great stay!", "text": "Pros- right next Manuel Antonio.", "helpfulness": 1, "user": "Gary G", "date": "June 6, 2012", "id": 131382873}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Cool little path to the beach.", "title": "Clean, Convenient, Friendly", "helpfulness": 2, "user": "Debbiewanders", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 131341880}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "They let you borrow boards to take to the beach.", "title": "The BEST place to stay in MA!!!", "helpfulness": 6, "user": "CloudyDae", "date": "June 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131128916}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Great delicious breakfast.", "title": "Awesome location, amazing amenities", "helpfulness": 1, "user": "Bert1826", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131027847}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We spent 4 nights at La Posada in July! We had such an amazing stay. We were a group of 6 and we stayed in La Casa (2 bedrooms). The accomodations were awesome and very clean. The staff and owner are amazing, they are so helpful! The location can't be beat, you are right next to the National Park. It is a short 3 minute walk to the beach and the hotel has boogie boards that you can borrow. My kids loved seeing monkeys at the pool and they fell in love with the resident dog Blanquita. We'll definitly be back to visit La Posada!", "title": "Amazing! We'll be back", "user": "24travelmom", "date": "August 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171674661}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "I stayed here for four nights on a girl's trip to Costa Rica. It was a wonderful stay. The owner is on site a lot and very helpful with advice and suggestions. The staff is very friendly and will help with making reservations for activites and getting guides for tours of the park. Free breakfast is very good! I like that they cook eggs for you, the hot protein really fills you up before heading out on your adventures. They have soft drinks and beer for sale and you can charge it to your room. Of course we had monkeys visit the pool and common areas while we were there, as it is the closest hotel to the park. The room was a very reasonable rate, I'm sure you need to book in advance to stay here. It was fully booked the whole time we were there. The room had modern air conditioner, a safe, modern shower with hot water, cable, coffee maker, microwave, everything you need. I would advise you have earplugs if you are a light sleeper, there was street noise that was a little annoying, and lots of loud animal sounds from the park, which is what you want to hear in Costa Rica. This was the only real issue I had so I highly recommend this hotel.", "title": "Great Location, Great Staff, comfortable room.", "helpfulness": 1, "user": "KeepingRoadsWarm", "date": "August 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171341124}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "For visitors heading to Parque Nacional Manuel Antonio, I highly recommend La Posada Jungle Bungalows. There are many hotels to choose from in the area, especially if you are considering everything from Quepos all the way to the park, but for value and location, La Posada can't be beat. It's much less expensive than many other properties in the area and yet it is literally at the entrance to the national park. It's also just a short walk down a path to the very nice Playa Espadilla.", "title": "Jungle Bungalow at doorstep of National Park", "helpfulness": 1, "user": "Tucs0nhiker", "date": "August 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170483835}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "This is a small property consisting of only 5 bungalows, a lobby with a patio dining area (where an excellent complimentary breakfast is served), a small but lovely pool area, and a balcony area good for staring into the jungle as you listen to the cacophony of frogs.", "title": "Amazing!!", "helpfulness": 1, "user": "travelwithautism", "date": "August 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170367611}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "The owner, an American, is very friendly and organizes all kinds of activities including bonfires on the beach, movie night, and trips to local restaurants.", "title": "Great for Backpackers!", "user": "karawest", "date": "July 24, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 168886036}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I thought that this hotel was wonderful. It had a great complimentary breakfast, wonderful potatoes, and extremely cheap dinners and movie night. I stayed in the monkey room and the villa (sort of like a house) and they were both great, however the former was slightly small. Also, every afternoon a deer came by that would eat out of your hand. It was a three minute walk to the local beach, located right at the entrance of the national park, and also right next to the jungle, where I saw a couple of birds from the public hammock, and also an agouti-- which is a sort of mix between a pig and a rat but they're really cute. The only catch was that two days a howler monkey hooted at the top of its lungs in the morning but you can't really control that so it was fine. Also had great bilingual reception who set up a tour for me in the national park. They have an adorable hotel dog named Blankita (little white one).", "title": "Awesome hotel and very private", "user": "Kelly C", "date": "August 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 173520050}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Almost four years has passed since my last visit to La Posada and I was a little nervous that I'd somehow find things off or changed. But nope! Absolutely not. Still as excellent as ever. This time I had the opportunity to introduce my family to this wonderful place and its wonderful staff. Breakfast was lovely as I remembered. The staff was equally lovely as I remembered - Mike, Jonathan, Esteban, the girls on the maintenance staff. Even our favorite afternoon visitor, the deer, was as I remembered. I'm impressed that they've maintained the level of consistency and service throughout the years. They went to Quepos to buy bus tickets for us for the airport and they were extremely helpful in arranging all the tours. And, although this seems like a small or odd thing to mention, I think the maintenance staff here has magic powers. I have never stayed in a cleaner hotel room in all of my travels. The hotel grounds and the rooms were immaculate.", "title": "Still great!", "user": "joopy86", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173024760}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I stayed in a bungalow last time with my boyfriend. This time, since I was traveling with my family, we stayed in the Villa. The villa has a kitchenette which is conducive to those who like to make simple meals on trips. One thing about the Villa that travelers should be aware of is that it has sleeping arrangements that are probably best for families or relatives or really good friends that don't mind being in each other's space. The top floor has 2 bigger beds in the same room, and the first floor has 2 futons also in the same room by the door. Basically, be prepared for little privacy. Two couples looking for a little love and traveling together would probably want to get their own bungalows or stay on their own floors. Again, I was with my family so I didn't mind the lack of privacy, but I probably would not recommend the Villa to couples looking for privacy.", "title": "Best location, Value and Great Service", "user": "EJoe", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 172599785}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "My only disappointment us that I wish that Mike, the owner, was around for more of my trip. My parents were curious to learn more about how he managed to set up up such a great life here; they now won't stop asking me about how to retire there. Unfortunately I don't really have Mike's secrets! Thanks for another great trip La Posada.", "title": "Best value in Manuel Antonio", "user": "NancyMtl", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172263009}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "This hotel is right outside the park entrance - spectacular park and beach. You literally wake up, buy tickets and walk into the park to check out wildlife and go swimming. The owner and staff are very helpful. They arrange guides and tours at discounts and share the discount with you. The property is nice with cute pool and rooms and monkeys come from the park onto the property. The breakfast is good and hosts are very gracious (Mike, Jonathan, and staff) and they do occassional dinners (good value).", "title": "My Favorite Hotel in Costa Rica Trip", "user": "Elisabeth D", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172065228}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We loved everything about this place! It was nice, very clean, pristine pool, quaint, very friendly and helpful staff, right by the park, 300 meters to the beach. They had a pack-n-play for my little one! They had a dvd player in the room (we watched a movie with our kids one night). There are boogie boards and towels to use when you go to the beach. Great breakfast in the morning. We'd read on TA so many good things, that we wanted to go there ourselves. They were booked the nights we were originally going to be in Manuel Antonio, so we just called them and said, \"What nights do you have open and we will be there.\" Best decision. I am in love with Manuel Antonio, but La Posada might be the reason why . . .", "title": "Loved, loved, loved!", "user": "Ticla74", "date": "July 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168802046}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The spacious clean bungalows are situated tight next to the entrance of Manuel Antonio national park, which has beautiful beaches and a great rainforest, and it is close as well to the local free beach. There is parking lot and its easy to reach, the staff is very friendly and helpful and they lend you bogie boards for free, movies, and give you tips on traveling through other places in Costa Rica. Also inside the hotel you can get a glimpse of wildlife, like monkeys and deers that are around.", "title": "next to the park and very comfortable", "helpfulness": 1, "user": "RifkaRM", "date": "July 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 168780464}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We found this hotel on TA. It was the best hotel we stayed at in Costa Rica. It is situated right next to Manuel Antonia National Park. When we first arrived, our 3 kids jumped in the outdoor hammocks and were immediately spotting wildlife in the park next door. In fact, a deer walked up within minutes and my daughter ended up feeding it leaves and petting it! I didn't even know there were deer in rain forests! The owner Mike is a hoot and is always looking to involve hotel guests in outside activities in the area. He is a great spirit and really enjoys hospitality. The hotel was booked on the last night of our visit to CR, but his staff helped us find a local hotel to stay out (way beyond the call of duty). Their breakfast is great and they have a nice pool and very accommodating. They provided us some towels for the beach and even a couple Boogie boards. Really enjoyed our stay here!", "title": "Great Hotel and Excellent Location!", "helpfulness": 1, "user": "Bauerhaus", "date": "July 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168078231}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We stayed two nights at La Posada. The hotel is literally right at the entrance to the park. With limited parking everywhere in the area, the ability to park at the hotel and walk right into the park is alone almost worth the price.", "title": "You almost can't do better for Manuel Antonio", "user": "KyleForbes", "date": "July 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167869058}, {"rating": 4.0, "stay_parameters": "Stayed June 2013", "text": "The staff of the hotel was fantastic. They answered every question we had and gave us tons of great advice.", "title": "Lovely service and couldn't be closer to the national park!", "user": "MaaikePC", "date": "July 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 167532382}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I was encouraged by the owner, Mike, via our email exchange to pay my final four days in CASH when I arrived as it would 'save me PayPal interest'- luckily and with good sense I paid with PayPal. When I returned from my trip, Mike emailed me to let me know that my final four days still weren't paid, to send him the details of payment, which I did at least EIGHT TIMES. I finally contacted PayPal, they contacted Mike with 'paid in full information' and Mike 'found' my payment. Until I had to deal with this weirdness, I was thinking of returning with my family, as well as writing a glowing review (and a travel review elsewhere)- I found his staff to be welcoming, loved the home made pizzas, the morning omelette, and I stayed in a 'solo room' with internet which worked well. Nothing 'fancy' but I enjoyed my stay, my walk to the beach, found a great restaurant on the beach- but after this email exchange with Mike, he was rude and insistent that I 'had not paid my bill and was being dishonest,' again very weird. I travel a lot and have not ever encountered this kind of 'ending to my journey'- in person, Mike was very nice, helpful, even sweet. I won't return and I can't write a 'glowing review'- PAY ONLY WITH CREDIT CARD, PAYPAL.", "title": "Pay only with credit card/PayPal-", "helpfulness": 4, "user": "Almaluz8", "date": "May 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 131020195}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I heard so many things about Manuel Antonio that i decided i had to go check it out. I looked for a hotel at a very low price, and La posada had one of the best prices. La posada is so close to the beach (less than 5 minute walk), and i have to say i never expected to get so much for the amount i paid. $60 per night, great breakfast included, and a great service from the staff.", "title": "Amazing Experience", "helpfulness": 3, "user": "Erick R", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130780398}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Provided beach towels, free internet, free international calls, surf boards and helped us book amazing tours, splitting their commisions in half to help us get a lower price. Overall a great trip.", "title": "Best hotel experience ever.", "helpfulness": 3, "user": "rodendo1", "date": "May 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130522297}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "About the room: Kitchenette, with coffee, snacks and a safety deposite box. again...for $60! do i need to say more? I would def go back.", "title": "Great place to stay", "helpfulness": 1, "user": "bcbeachheads", "date": "May 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130438514}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Erick", "title": "Very friendly staff", "helpfulness": 1, "user": "cristina1180", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130041748}], "location": {"country": "Costa Rica", "continent": "Central America"}, "variance": {"poor": 11, "average": 18, "very good": 89, "terrible": 5, "excellent": 488}, "aka": "La Posada Private Jungle Bungalows Hotel", "slim_ranking": 0.0816326530612, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}