{"user_rating": 4.0, "review_count": 169, "name": "La Quinta Inn San Antonio Market Square", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "My wife and I stayed here for a few days and we were very pleased. The location was great; we walked to the Riverwalk, Alamo, and several other attractions from here. The room was comfortable and mostly quiet. The breakfast was excellent, although the table space is limited if you don't get there early. The staff was friendly and helpful. We also loved being across the street from Market Square and Mi Tierra, where we ate three times.", "title": "Met our needs perfectly", "helpfulness": 3, "user": "williesdad", "date": "April 3, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7277530, "likes": {"liked": "— Location, comfortable room, good value.", "disliked": "— Millions of birds in trees in parking lot make a mess of our car."}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The only complaint was that there were a zillion grackles in the trees, and they made a mess of our rental car -- DO NOT park under the trees if you're there in November. But we'd recommend this place highly, and we hope to stay there again.", "title": "Tipical La Quinta", "helpfulness": 1, "user": "georgepaulus", "date": "April 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 2.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 7267629, "likes": {"liked": "— Internet Access Very Fast", "disliked": "— Distance from the parkway"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled solo", "text": "It's 20 minutes walking from the parkway. If you want to save money it's ok but if you have I higher bugdet I would say stay closer to the turistic center. In this you can do a lot without a car.", "title": "Super Hotel/Highly Recommended", "helpfulness": 6, "user": "JenPerna", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6541429, "likes": {"liked": "— Location across from Market Square!!!", "disliked": "— No Internet station to check email."}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Just stayed 3 nights at the La Quinta San Antonio Market Square. I cannot stress how much I loved this hotel and loved San Antonio. This hotel is very easy to find from the freeway. The lobby was large and very inviting. My rate was very low because I booked early. Check-in was very easy and all staff during my stay were more than friendly, helpful, and accommodating. My room was large and clean, smelled fresh, and felt new. The windows opened to let in lots of light and fresh air. I had a great view of Market Square. The location can't be beat--you're steps away from Market Square, a top tourist destination. I walked across the street and shopped in all the fabulous little shops, and had a fabulous dinner at the famed Mi Tierra Restaurant. The pool area was large and very clean if you wanted to spend time at the pool. Breakfast had tons of choices and lots of places to sit and enjoy your food. I walked several times down to the Alamo, Tower of the Americas, Riverwalk, and all the tourist fun (about 20 minute walk at a brisk pace). The Riverwalk is one of the coolest things I've ever seen!!!!! Or, if you don't want to walk there's tons of easy public transportation including the buses and streetcars that run every 5-10 minutes and will take you everywhere. The purple line goes right by the hotel and the red line runs behind Market Square. I didn't have to touch my car in 4 days which is ideal for me--I walked or took the public transportation everywhere. The only downsides I saw were no public business center/Internet station which I enjoy because I don't bring a laptop. Also, the hotel was a bit noisy at times because of the kids, the trains, the birds flying around, and the commotion over at Market Square. But if noise is an issue for you, just ask for a room facing the back and close your windows. None of this bothered me in the least and I will definitely return to this La Quinta when I go back to San Antonio!! Please email me if you have any questions!!!", "title": "Overall A Good Stay", "helpfulness": 3, "user": "PartimeTravel", "date": "October 15, 2006", "detail_rating": {"cleanliness": 2.0, "front_desk": 5.0, "location": 5.0, "value": 3.0, "rooms": 3.0}, "id": 5957470, "likes": {"liked": "— Location", "disliked": "— Dirty Floor"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "I just returned from a stay at the La Quinta Market Square. I traveled to San Antonio for a one night stay with my husband and our two daughters, ages 3 & 10. The hotel is very easy to find and right off I-35.", "title": "Good position but could be cleaner", "helpfulness": 2, "user": "limlib", "date": "May 22, 2006", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 5190923}, {"rating": 2.0, "stay_parameters": "Stayed September 2008", "text": "I booked this site in the Market Square area of San Antonio over the La Quinta web site. It was $ 80 for the weekdays but goes up to $ 120 on the weekends. On the positive site, La Quinta has done a nice job painting the outside of an older La Quinta hotel in the Market Square area of San Antonio. The motel is only a few minutes walk from the Riverwalk and Alamo. The front office staff were pleasant during check in. The inside of the room had been rennovated as well but was clean but on the tiny side. The front desk was also very kind to let us check in at noon. The negatives however outway the positives. First, be advised that this hotel has outside corridors. At night folks gather outside of the room in the parking lot to talk. Despite calls to the front desk this occurred to the early hours of the morning. Perhaps the arrival of Hurricane Ike was creating too many problems for the front office. Several vendors from the local area continually drop things through the doorways at nite which is kind of irritating because you cant tell what someone is doing outside of your room. The breakfast area is very small and was overcrowded in the morning. The breakfast was slightly below average.", "title": "Noisy Rennovated Hotel in Market Square", "user": "DCSacramento", "date": "September 27, 2008", "detail_rating": {"front_desk": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 20423416, "likes": {"liked": "— Good Location", "disliked": "— Very Noisy"}}, {"rating": 5.0, "title": "Enjoyed our stay very much", "text": "We went to San Antonio for our anniversary. We were looking for something affordable but clean with free parking and complimentary breakfast. This was a good selection, the staff was very helpful. Diego offered excellent customer service and this was a great location with a wonderful mexican restaurant across the street and the walk to the riverwalk was great exercise for us.", "user": "honeymooners3375", "date": "July 24, 2008", "id": 18209066}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I would stay here again!!!", "title": "great locations!", "user": "angele", "date": "June 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16869836, "likes": {"liked": "— great location. dogs stay free no problems!", "disliked": "— no heated pool"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Houston, Texas", "title": "Great service", "user": "namma", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15175570, "likes": {"liked": "— Staff", "disliked": "— no internet access"}}, {"rating": 5.0, "title": "Great place", "text": "great location. very clean. free parking. literally across the street from the mercado. and a 15 minute walk to the riverwalk. we walked it at night with sm children. felt safe. lots of people out with families. but i am paranoid and wouldn't reccomend walking around downtown SA anywhere at night. pool not heated so didn;t go for a swim. stay here. you won;t regret it!", "helpfulness": 1, "user": "SFlo", "date": "October 21, 2007", "id": 10208540}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "I'd rate the LaQuinta Market Square above average in the budget hotel category. We stayed three nights and didn't have any complaints. The hotel accommodation is typical of what you find in 2 - 2.5 star hotels. Two double beds, desk with two chairs, TV dresser, closet, bathroom. Room and furnishings were clean and tidy. Amenities included free high-speed internet, coffee maker, free parking, hairdryer and a very good breakfast. The breakfast bar included the standard toast, cereal, juice, coffee/tea, fresh fruit, yogurt and also included hard boiled eggs and make your own waffles that were quite tasty.", "title": "We'd stay there again", "helpfulness": 5, "user": "kayb95", "date": "February 14, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4460082}, {"rating": 4.0, "title": "Nice room for the money!", "text": "There is a nice outdoor pool area - but we did not use it (too cold.) The hotel is located directly across the street from Market Square and Mi Tierra restaurant. The purple line Streetcar stops just down the street and the purple, yellow and red lines also stop on the next street over (Commerce Street) for an easy return from the Riverwalk area. The immediate area around the LaQuinta isn't the greatest, but it is a very easy streetcar ride to all the action of the Riverwalk. I would definitely stay there again. We were very happy with our stay.", "helpfulness": 4, "user": "jane713", "date": "January 23, 2006", "id": 4372773}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "One word of caution: In the evenings, every bird in the greater San Antonio area gathers in the trees around the LaQuinta (see photos) and if you park your car under a tree, it will look like ours in the morning. When we dropped the rental car off, another guy returning his car asked if we had stayed at the LaQuinta. Amazed, we said yes and he explained that one of his business associates also stayed there and they were razing him about his bird-poop car. Consider yourself warned. :o)", "title": "Like the breakfast but get used to the trains", "helpfulness": 4, "user": "SeattleRedBear", "date": "January 22, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4370228}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "The room was a nice size, clean and with a reasonable quality bed spread. The sheets had a nice feel to them and were clean. It was quiet all evening and we never heard any noise except when the city animal control was trying to get rid of the birds roosting in the trees across the street. Seems the city sets off fireworks.....we at first thought it was a drive-by shooting. Needless to say, we were relieved to find out that the loud booms were only fireworks. The bathroom was larger than we expected. The tub, toilet and sink were in good shape and working condition. We had plenty of towels. A plus for the room (that was unexpected) was the lighted vanity area outside of the bathroom that allowed one to take care of hair and makeup while someone else was in the bathroom. Adequate desk area too. Cable TV was good and a lovely addition to the room was a recliner.....wonderful to be able to put your feet up and relax. The La Quinta Market Square location is directly across the street from Mi Tierra restaurant which is open 24/7 and convenient for a late night snack. My only complaint is that when we checked in at 6:30 p.m. we requested and paid for a roll away bed to be delivered to the room. We left to visit with family and upon arrival back at the La Quinta at 11:00 p.m. we noticed that there was NO roll away bed. We called the front desk where we were informed that the desk clerk was the only one on duty and could not deliver the roll away to the room. We were in town for a funeral and therefore wanted a good place to stay for a reasonable price. We were overall rather happy with our stay. We have stayed at the Adam's Mark, now the Crowne Plaza, and it was VERY nice......of course it came with a hefty price. If you need a place to spend the night and aren't looking for luxury, this is the place to stay.", "title": "Where its at", "helpfulness": 8, "user": "jgroshek", "date": "August 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3770007}, {"rating": 4.0, "title": "Had a great trip!", "text": "For $45/night through priceline, this place is a great bargain.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 6, 2005", "id": 3534166}, {"rating": 3.0, "title": "Dirty Floor", "text": "The staff was helpful and friendly. The free breakfast was great, love the waffle maker, but come early it gets pretty crowded and the breakfast area is small. Great location, right across the market square and a two miuntes ride to the RiverWalk.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "May 20, 2006", "id": 5183669}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "Now, here the down side. Located in what seem like the shady side of downtown San Antonio. See alot of homeless people walking around. Serval asked me for money so they can get a ride home. (Like I never heard that one before). Well, the wrost thing about the hotel is the DIRTY FLOOR and I mean dirty. My daugther spilled some milk on the carpet and I used a towel to clean it up and towel turn BLACK andn I notice my feet was also very dirty black from walking on the floor. GROSS. Its need a new carpet and some good cleaning.", "title": "Don't park under the trees", "helpfulness": 4, "user": "pbrwolf", "date": "April 10, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 2.0, "service": 3.0}, "id": 4956395}, {"rating": 4.0, "title": "Breakfast a PLUS", "text": "The $89.00 I paid per night was a little over price. It should be around $59.00 a night max.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "April 4, 2006", "id": 4933381}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "We stayed here on March 28th & 29th after reading the reviews on TripAdvisor. I agree with most of the comments and don't have much to add but some pictures. The hotel is older and worn, but everything seemed to be clean and working. The location was convenient, being right across the street from the Mexican Village and a block away from the Trolley Shuttle ($0.75/ea). The Riverwalk and Alamo are a short Trolley ride away or a $5 cab ride. There are birds everywhere, 75% of the hotel parking spaces are fine, just avoid the trees. The Mexican restaurant across the street (Mi Tierra) was excellent. IMHO, The Riverwalk was great, with an overproponderance of restaurants (how many times can you eat in one night?) and not enough casual drinking spots. Durty Nelly's soon became our favorite place. Drinks, bar food, peanuts on the floor and a great piano player cracking everyone up.", "title": "OK for the price....", "helpfulness": 2, "user": "mamiya22", "date": "March 19, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 4694414}, {"rating": 4.0, "stay_parameters": "Stayed January 2006", "text": "La Quinta is a good value. We paid $80 per night. Hotels on the riverwalk were getting $200 and up. If you stay down there, then you have to take the Trolley Shuttle anyways if you go to the Mexican Village (Across the street from La Quinta)", "title": "We will return next time!!!", "helpfulness": 3, "user": "duckfish5", "date": "February 17, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 3.0}, "id": 4467914}], "location": {"country": "United States", "city": "San Antonio"}, "stars": 2.5, "variance": {"poor": 14, "average": 23, "very good": 54, "terrible": 13, "excellent": 65}, "aka": "La Quinta Inn Market Square Hotel San Antonio", "slim_ranking": 0.296829971182}