{"user_rating": 4.0, "review_count": 224, "name": "La Quinta Inn Monterey", "reviews": [{"rating": 4.0, "title": "High on our list to return", "text": "We travel to Monterey and Carmel often to visit family, and stay in hotels. Very minor issues with the room, and overall our stay at La Quinta rates highly on the return list.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "June 6, 2013", "id": 163185038}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The only thing I'd really change is I'd love to be able to bring my dog with us.", "title": "Quiet and Comfy", "helpfulness": 1, "user": "KBaldemi", "date": "June 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 162917402}, {"rating": 5.0, "title": "Very nice stay", "text": "The location is good and convenient, the price is good, the breakfast is quite doable and easy.", "user": "A TripAdvisor user", "date": "May 26, 2013", "id": 161932078}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The staff is wonderful!! We tried two previous times this year to make the trip, making a reservation and needed to cancel each time due to illness. The staff was very helpful and understanding. Third time was a charm!", "title": "Surprisingly Quiet", "user": "William T", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 161312317}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Room was larger than we expected and very nice, our only issue was you cannot pull the heavy shades to make the room darker if you want to sleep in a little, all you have are the sheers. But the easy 10 minute walk to the beach more than makes up for it and you don't have to fight for a parking spot to get there. Friendly staff, microwave and fridge in room with freezer compartment, nice breakfast in the AM.", "title": "Easy 10-min walk to beach", "user": "3wilddogs", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 161216983}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "I had just gotten back to my room after a very miserable experience whale watching. I was not feeling well at all and needed to use the bathroom (which happened to have a broken lock). Next thing I know, I look up and there is a woman standing there looking at me while I am doing my business. The bathroom was obviously occupied with the lights on and fan running but the maid didn't think to knock. Absolutely inexcusable. I will not be back to another La Quinta again.", "title": "I will never visit another La Quinta again.", "user": "Jake S", "date": "May 19, 2013", "detail_rating": {"sleep": 2.0, "service": 1.0}, "id": 161203105}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Upon arrival, check in was not met with an enthusiastic welcome. The first thought I had of our room (220), \"Glad I only paid $109.00\", second \"No down comforter! :( \" and third \" Why is there rusty, red water coming out of the shower faucet?\". After a night out on the town, I was happy to have a nice bed to fall into....I woke up around 3am to an odd smell, like mold or old carpet. The morning light brought to my attention the bathroom, it was in some disarray and could use DIY channel expertise to fix some of the water damage to the shower and surrounding walls. The final eye catching feature was the tile floor, in need of some special cleaning.... I would stay again, since it was only 1 mile from the beach!!! All in all, If I had to compare it to another like hotel, it would be similar to a Motel 6 with 3 Stars.", "title": "Spacious enough for a livingroom area!!! Nice.", "user": "Robynn R", "date": "May 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 160018041}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "Sure, my friends all paid $240+ per night for their hotel room facing the beach, but I paid only $109 per night and am just as happy. The La Quinta Inn, Monterey, Ca is clean and fairly modern, with a very nice and friendly staff. My room hotel-wise was at the end of the hall on the third floor, and I never heard a neighboring room. However, my room DID face the street and there was a decent amount of traffic noise during the day, but at night it was very quiet. I didn't try the free breakfast, but considering so many hotels no longer offer such an amenity, it is nice La Quinta still does. My room was spotless and smelled very clean and fresh upon my arrival. Parking is free, which is not the case in all other area hotels. The grounds are not large, and there is no pool, gym or other amenities, but the property is well-maintained amd well-lit at night. And, also, there was FREE wi-fi (again, for what most hotels charge for). Thehotel is right next to a small park and walking/running trail, and 2 minutes from the beach. Another perk is that the staff I enountered during my stay lives in the area and gave me some great recommendations for day trips and dining options. I would absolutely stay here again.", "title": "A great deal - especially for a 'tourist destination'", "helpfulness": 2, "user": "CAChickadee1", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 159757961}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Very clean and comfortable room. Nice size room and comfortable bed. Not the highest price place to stay in Monterey, but every bit as nice as those charging more. Not in the \"heart\" of Monterey, but VERY close to get to. Would definitely stay here again.", "title": "Very Nice For The Price!", "user": "Kenneth N", "date": "May 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 159653433}, {"rating": 3.0, "title": "Nice budget option in Monterey", "text": "Stayed here one night while visiting the Monterey Bay aquarium and cannery row. This place is not in the immediated area of cannery row, but just a short drive. Hotel is small, and just the basics - room and breakfast. Room was clean, spacious and comfortable, and it looks like they have renovated the furnishings a bit. Breakfast was adequate, with a few hot items, good waffles. My only complaint would be traffic noise. We were on the second floor near the highway (room 202) and could hear lots of traffic noise. I would stay here again on a higher floor, facing the lake.", "helpfulness": 1, "user": "Tessa C", "date": "June 16, 2013", "id": 164164556}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The Girl at the desk was exceptionally nice and extremely helpful, I assume that the staff account for many of the good ratings. The first noticeable thing was the room did have an unpleasant odour but luckily the windows actually opened and we were able to get a nice breeze. Housekeeping wasn't thorough and there was debris beside the bed. I wouldn't of stayed a second night.", "title": "Just Okay", "user": "Storm9695", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 164132035}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "If you are planning on a Monterey vacation, you don't need to sacrifice quality for the price. Try la Quinta. It is located a few miles from downtown Monterey and just across the street from Seaside. La Quinta also gives you free breakfast, which is extremely convenient when you are on a business trip", "title": "Good location, clean rooms, great deal.", "helpfulness": 3, "user": "Jimmy85365", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 163912051}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "We found the location very convenient. It's a couple miles from the center of Monterey, but it only takes a few minutes to drive there and we never had an issue with parking. They have a good breakfast - a few hot items in addition to the usual continental stuff. It's also quiet and close to major roads if you use Monterey as a jumping-off point to see the rest of the region, as we did.", "title": "great location and staff", "user": "local_galBoston", "date": "June 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 163340425}, {"rating": 4.0, "title": "Great staff", "text": "The staff here is fabulous!!!! Very friendly and helpful. I wish they had name tags so I could mention the people we dealt with. Great dinner recommendations!! Would stay again if in the Monterey area.", "user": "A TripAdvisor user", "date": "April 21, 2013", "id": 158364495}, {"rating": 5.0, "title": "A very nice stay", "text": "Our family was in Monterey for a weekend of Whale watching and exploring the Fisherman's Wharf and Cannery Row.", "user": "Perry L", "date": "March 21, 2013", "id": 155284674}, {"rating": 5.0, "title": "Monterey Get-away", "text": "I have stayed at La Quinta Inn's on business trips before so I was hoping this one would meet my expectations and it did and then some.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 19, 2013", "id": 155075278}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "Our double queen room was very large and spacious and very clean. The onsite covered parking was great on the misty mornings and the complimentary breakfast was very enjoyable. We will be back on our next stay.", "title": "Big room,clean and good location", "helpfulness": 1, "user": "Dwfamily3", "date": "February 24, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 152962515}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 4, "average": 39, "very good": 87, "terrible": 10, "excellent": 84}, "aka": "La Quinta Inn Monterey Hotel", "slim_ranking": 0.245283018868, "description": "The La Quinta Inn Monterey is a moderately priced hotel conveniently located off Highway 1 in Monterey, California just 2 blocks from Del Monte Beach. Offering a wide range of features and amenities for government and leisure travelers, the La Quinta Inn is situated just steps from the beautiful Monterey Bay and just 3 miles from the Monterey Peninsula Airport. The La Quinta Inn offers 48 newly renovated deluxe guest rooms, all with comfortable beds, deluxe bedding and more."}