{"user_rating": 4.0, "review_count": 357, "name": "La Quinta Inn & Suites Orlando Airport North", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This was one of six hotels I stayed in on a trip to Orlando. The La Quinta Inn and Suites is located in an area of numerous hotels north of the airport. The hotel looks good from the outside. In checking in the mid day front desk clerk continued to talk on the phone to booking customers and a personal call while I waited to check in. The interior of the hotel shows signs of wear. The rear door was broken and swinging in the wind. The room itself, was in need of a little care but was comfortable with plenty of space available for storage of suitcases and one plus was that their were numerous free plugs for electronic advices. There was some considerable noise during the night from folks running up and down the hotel floor. The breakfast in the morning was below average with fresh cereal, some fruit, the waffle machine etc. The Country Inn next door has a far nicer breakfast.", "title": "Disappointing La Quinta", "helpfulness": 1, "user": "DCSacramento", "date": "March 28, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 59697443}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "For the second year running we've stayed at this hotel after long airline trips from the UK. The shuttle from Orlando Airport was prompt, the staff friendly and the room excellent. If there is better value out there I would be surprised.", "title": "Unbeatable Value", "user": "Chorizogolf", "date": "March 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58639242}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Wow!!! Got a room for $55, wasn't expecting much but it turned out to be a bargain!!! Very clean room indeed, the beds were very comfy. Furniture looked new too. It's right near the airport but you don't really hear the planes. I would recommend this to EVERYBODY!!!", "title": "Great Room For A Great Price!", "user": "Ittybritkitty", "date": "March 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57546930}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "It's pretty much standard La Quinta; comfortable, clean rooms, attractive building, spaceous lobby. What made this stay was the staff. They were polite, and really went out of their way to be helpful. The facility could use some touch up here and there, but nothing major. despite a review to the contrary, they do have high-speed (wired) Internet n the rooms, and wireless is available in the lobby area. The only disappointment, again minor, was that the breakfase was very minimal. U-serve waffles, banannas, cereal, toast, bagels, coffee and juice. Some yogurt would be a nice addition. Bacon and eggs, even better, but there doesn't seem to be enough of a kitchen to support those. That's it. There are some restaurants close by, though, that do have a real breakfast if that's your thing.", "title": "All the surprises were good", "user": "Global-track", "date": "February 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 57260533}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Checked reviews of others first. Do pay attention to them! I chose to stay here because of the positives regarding cleanliness, attitude of staff and breakfast included. My friend and I were more than satisfied. The room was larger than expected. The only comments we have other than what others said is that weekend and weekday breakfast times are different.. We missed the breakfast bar on Monday because we did not know. We spoke with a gentleman at the desk who asked us what we needed for breakfast and immediately got us what we wanted. He was not only very accommodating but extremely nice throughout.. Despite costing a bit more than some other La Quinta Inns in Orlando, I believe this place is well worth the difference.", "title": "Much better than expected.", "user": "jeansgreeneyes", "date": "February 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 57222982}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We stayed there the night prior to our flight back home. It was close to our car return and the airport. The price was fair, the front desk personal was nice and the rooms were large and clean. I will be staying there again on my next visit to Florida.", "title": "Very Nice", "user": "Riles2009", "date": "November 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49039502}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Friendly staff. Free WiFi. Standard continental breakfast. Shuttle runs to the airport at the top of every hour but the friendly staff gave us a ride at half past the hour to make our flight. Many chain restaurants within walking distance. There is a small park with a walking trail just to the west. Airport Lakes park. Good for jogging or walking, not much else. This hotel was clean, fresh and a very good value.", "title": "Great value!", "user": "hwkrdrvr", "date": "October 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 47923175}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Best airport hotel near Orlando airport we have stayed in - not too big, attractive with lots of character - clean - sauna and swimming pool - highly recommended, will definitely use again", "title": "Cosy airport hotel", "user": "BarbequeWelshlady", "date": "September 26, 2009", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "value": 4.0, "rooms": 4.0}, "id": 44732729}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled solo", "text": "I stayed just one night at this LQ to avoid a drive to the airport in the morning after a week long stay on the coast. I called enroute and was able to book a king suite for $85.", "title": "Convenient to Orlando Airport", "user": "TXGirl2001", "date": "July 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 35560669}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Check in was quick and easy. Parking isn't so great. I had to park on the opposite end of the building from my room, so needed to walk the entire length of the hallway from the back to the front to get to my room. One of the two elevators was out of service, the other was in the need of a good cleaning.", "title": "Great location - Great Deal - Small Room", "user": "jmb84", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 34089516}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed at this hotel due to an early flight out of MCO. The hotel had a shuttle that departed every 30 minutes, although we parked our own car. Breakfast was provided as well, although we left the hotel before it was set up yet. Staff was nice, wake up call was on time, and the location was very easy to the airport. Not sure what else you can ask for with this type of stay...", "title": "Perfect place to stay for an early flight.", "user": "deej696", "date": "June 28, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 33403311}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "We stayed here overnight before heading out to our Disney cruise and it was very pleasant. For only $70, the clean room was well-equipped with a fridge, microwave, and coffee maker. They gave us a room in the back of the hotel which was good since it was far from the elevator thus quiet. Their bfast was really good. It was not just your ordinary continental breakfast with cereal & coffee. They had muffins, bagels w/ cream cheese, some fruits, ready to make waffles, hard-boiled egg, and lots more. The only con was the clerk behind the desk was not that friendly....we checked in around 11 pm so she probably had the night grumpies. All in all, great hotel and would definitely come back", "title": "Great hotel for a great price", "user": "MiaMcCloud", "date": "May 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 30405297}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This hotel has the best deal I've ever seen, and I travel quite a bit. $65 for that level of service and standard of hotel is incredible. Be very careful you know which La Quinta you are booking into as not all are created equal. Both the La Quinta West and North offer free shuttle service from and to the airport. Be sure you choose the North on Frontage street or you may be dissapointed. We stayed overnight due to a lay over but wished we could have stayed longer.", "title": "WOW- What a deal! You won't get more for your money.", "user": "cantstptravln", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28710720}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "I stayed at La Quinta for one night after a cruise. The service was excellent. Front desk staff were very helpful and friendly. Unfortunately it was pretty windy so we could not use the pool or jacuzzi but both looked very nice. The room was well maintained. Breakfast in the morning included cereal, waffle maker, toast,bagels, yogurt, fresh fruit, sweet breads,muffins coffee, orange and apple juice.", "title": "Great Service", "user": "Disney21", "date": "March 3, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 25508473}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "10 minutes from the airport and transfers are free.", "title": "Great hotel, Nice staff", "user": "puddlejumpers", "date": "February 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 25119289}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Snow was about to hammer down on the South. With a four day weekend at hand, my wife and I decided to head for warmer weather in Orlando.", "title": "First One Good, the Second One Great", "user": "Lifetraveler1", "date": "February 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 55997011}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "We'd made no reservations ahead of time, but called a La Quinta on Intl Blvd. They only had space for one night. So the next night we found a spot at the La Quinta Inn Orlando Airport North. Wow, what a difference. First of all, this is obviously a newer property and looked like it had just been built.", "title": "Truly a Great Nights sleep!", "user": "DiscountCoffee", "date": "February 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55730208}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Comments-", "title": "Great for the Price", "user": "chicagotoots", "date": "February 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55408253}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Location- This property is literally about three blocks north of Orlando International Airport, just off of the main road, Semoran Blvd (I think). It is NOT close to the Disney and Universal Studios attractions, but you can still get to those attractions in about 10 to 15 minutes. The exterior and the grounds look very new and are very well kept up. It also provides a shuttle from the hotel to the airport for your convenience and that was a nice touch.", "title": "Nice hotel, convenient to airport", "helpfulness": 1, "user": "MardiGras7", "date": "January 23, 2010", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 54185409}, {"rating": 3.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "Surprisingly enough though the hotel is in the flight path, we did not hear any aircraft once we got inside.", "title": "Well kept - but no wi fi ..", "user": "MarieMalmo", "date": "December 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 52173309}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 21, "average": 49, "very good": 145, "terrible": 12, "excellent": 130}, "aka": "La Quinta Inn And Suites Orlando Airport North Hotel Orlando", "slim_ranking": 0.44376899696}