{"user_rating": 2.5, "review_count": 114, "name": "La Quinta Inn Deerfield Beach I-95 at Hillsboro E", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2004, traveled on business", "text": "Put in a smoking room when I requested non-smoking. They were not able to change the room.", "title": "Filthy", "helpfulness": 3, "user": "Yakimo", "date": "February 20, 2004", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 1662277}, {"rating": 4.0, "title": "Great value - Don't hesitate to stay here!", "text": "We just finished an 8-night stay at the La Quinta, Deerfield Beach. I must admit that some of the reviews made me cautious, but the rate was so good and breakfast was included and we figured we'd hardly ever be in the room anyway, but we were very pleasantly surprised to spend our Christmas at the LaQuinta! Here's why...", "helpfulness": 4, "user": "Marti", "date": "December 30, 2004", "id": 2966036}, {"rating": 4.0, "title": "Pleasently surprised", "text": "Pros: Price (booked online at, net, about $40/nt since we had a $100 off coupon through online travel site and price was great anyway); location (easy on and off to I-95); VERY quiet; never had a concern in the world about safety, cars, etc.; pretty property - surrounded by old oaks and lovely trees and plantings kept this motel quiet and private; good breakfast selections - loved the hard-boiled eggs for low-carbers and the bagels, cereal, pastries and fruit for others; coffee was plentiful and good; juices a little watery but good; staff friendly and accommodating; the Christmas tree was one that any family would be proud to have in their front window; the breakfast area was neat, clean, and had lots of seating. The room we had (2 double beds) was especially spacious for the price and I loved the reclining chair and extra big rectangular table. The pool seemed nice but we were in town to visit a sick relative so we didn't have time to \"have fun\".", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 22, 2004", "id": 2481621}, {"rating": 1.0, "title": "What a horrible filthy smelly moldy motel", "text": "Cons: If you ate breakfast late, seating could be tough to find; the breakfast room, though beautiful, can be loud if people have a louder conversation than you're ready for at 7 am; one time (out of 8 nights) the creamers were put out frozen; the room smelled a tiny bit musty at first but we travel with a travel candle and it didn't take much to make the room feel cozy. There is no fitness center - but we figure that's what the beach is for - and there is no business center but you can use the internet in your room from a data port. We decided to get a temporary library card from the Deerfield Beach Public Library (beautiful, new) on the same street as LaQuinta about a mile away. (The library has 14 internet-connected computers and is open til 9 2 nights a week, so who needs to bother with lugging around a laptop?)", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 24, 2004", "id": 2318720}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "Overall: You could pay a lot more to stay in the Boca area, but why give up such a great rate?", "title": "What a great place! What a great location!", "helpfulness": 2, "user": "CaliShel", "date": "June 8, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2172919}, {"rating": 1.0, "title": "Got robbed in the parking lot", "text": "Having read other reviews about this hotel, I was tempted to cancel my booking (31st July), but decided to go ahead and see for my self. Our room was spacious, clean and well presented. The staff were friendly and helpful. The complimentary breakfast was sufficient (I guess) if you like boiled eggs, but there was enough to go around. Wendy's is walking distance away if you prefer . They are situated just 5 minutes away from the beach. I would visit this hotel again.", "user": "A TripAdvisor user", "date": "May 31, 2004", "id": 2132569}], "location": {"country": "United States", "city": "Deerfield Beach"}, "stars": 2, "variance": {"poor": 21, "average": 24, "very good": 24, "terrible": 31, "excellent": 14}, "aka": "La Quinta Inn - Deerfield Beach Hotel", "slim_ranking": 0.904761904762}