{"user_rating": 4.0, "review_count": 292, "name": "La Quinta Inn & Suites Vancouver", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "This is a second time we stayed at this hotel. Due to its location right off the highway, it's very convenient to stop in for the night during our road trip. There are some restaurants, a Walgreen and the usual fast food places nearby. The breakfast could be better but since it's free-can't complain. The room is very clean, bed is very comfortable, bathroom is small but very clean. I would recommend this hotel if you get a good price for it.", "title": "Great hotel for the price", "helpfulness": 1, "user": "travjud", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 129376684}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "this was a nice room, clean, good service, easy parking, and very good price. we used the workout equipment which was nice. the only thing i didnt like was that the breakfast was so carb heavy, but it seems the same at most places.", "title": "we were pleased. better than portland.", "user": "Gabrandall", "date": "May 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129200972}, {"rating": 5.0, "title": "very nice stay!", "text": "we were driving through and had planned to stop in portland, but this was a nice location right off I-5 and ended up being much cheaper, even though you have the sales tax in washington. also we felt it was a nice, safe location which isnt always the feeling at a lot of portland hotels... so that made it a great value.", "user": "A TripAdvisor user", "date": "April 16, 2012", "id": 128018506}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "this was our first stay at the vancouver la quinta inn, and we were quite pleasantly surprised at how nice everything was. the front desk staff was extremely responsive and friendly, our king room was large and clean (with a window that opened!), and the price was certainly right. breakfast was about average for this type of place, but it was adequate and the staff kept everything well stocked. we would definitely stay here again!", "title": "Good value just north of Portland", "user": "SeattleTrvlr", "date": "April 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127997211}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I stay here frequently enroute to Bend, Oregon (my idea of heaven). The motel is convenient at the junction of I-5 and I-205. There are numerous fast food restaurants nearby and a few others, like Applebees and Billygans (so-so). The rooms are clean and the beds comfortable. Shampoo is provided but ladies bring your own conditioner. The bathroom is small (the door swing barely misses the toilet) but the counter space is ample. I have not had any problem with excessive highway noise even on the side facing I-5. Sound insulation seems to be fairly good. Pets are allowed. Staff is always helpful and friendly. Breakfast buffet is fairly typical - nothing to get excited about.", "title": "A Good Hotel", "user": "rorygirl4528", "date": "April 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127497804}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Good friendly and efficient place for business or vacation stop. Fireplace in lobby. Free cookies and papers at reception. Clean nicely furnished rooms. Only complaint is there was some noise from the pool.", "title": "Comfortable hotel, pleasant staff", "user": "callandanswer", "date": "May 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 130206385}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Convenient to Salmon Creek Legacy Hospital and Salmon Creek Plastic Surgery. One block to the freeway with easy access to Vancouver and Portland...but no noise from freeway that I noticed. Huge Fred Meyer Superstore immediately behind hotel is a major plus for family travel. Several franchise and independent restaurants within minutes, Parking lot is a little tight and gets puddles!", "title": "Really Nice Stay.", "user": "TacianaBrazil", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129962802}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "I have been on this hotel for 3 nights. I was on vacation and we intended to visit both Portland and Mount Saint Helens. This location was great. Really easy to access the highway to Portland and get there in about 15 minutes. And just 1 hour from Mount Saint Helens. The staff was really friendly the whole time. The room was huge, the TV was new, the beds are very comfortable. Breakfast is the standard La Quinta with some additional hot items and fruits. I really enjoyed my stay there. And the price was great for a hotel like that.", "title": "To much noise.... Party place....", "helpfulness": 2, "user": "J M", "date": "May 10, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 129703199}, {"rating": 5.0, "title": "Visit Back Home", "text": "During our recent visit to Vancouver we wanted a peaceful stay, so after looking online we decided to try LaQuinta because of the \"great beds & staff\" well sad to say the only part of that was true. The beds were great but the noise level from the pool room at quiet hours was extreme. When the staff finally moved the youth from the pool it was to the open dining room and lobby. Does the staff not know that sound travels even better in open spaces? When I went to go talk to the staff about the noise no one was at the front desk and I waited for 10 minutes, talk about poor staff, not to mention how unsafe I felt knowing staff was nowhere to be found. It states family friendly when it should state wild party friendly.", "user": "A TripAdvisor user", "date": "May 8, 2012", "id": 129614534}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "We stay at several La Quinta properties throughout the year each year. The Vancouver property presents as a high class hotel. The staff is friendly and acommodating. The rooms are clean and up to date. The location is close to the freeway and to local shopping centers as well as the Portland, Oregon locations that we drove to each day. We recommend this location to business and liesure travelers.", "title": "Vancouver La Quinta", "user": "jdstauffer", "date": "March 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126945675}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Room rate was very reasonable, and there was no pet charge. Doggy biscuits and poop bags were available at the front desk. Our room was spacious with a king size bed and full size couch. The couch was worn but comfortable. The towels were paper thin, and the toiletries average. The tub was slippery even with a rubber mat. The continental breakfast was average. Restaurants, grocery stores were within walking distance.", "title": "Good Hotel For Pet Owners!", "helpfulness": 1, "user": "Saltspringer340", "date": "March 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 126106124}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Room was clean and well prepared. Housekeeping was very helpful and courteous. The Assistant Manager Dana and Front Desk folks Kaylene and Phala were exemplary. These ladies went well beyond normal expectations in customer service. My business requires some highly technical equipment for which I needed special arrangements made in order to continue work. They went out of their way to accommodate my requests that subsequently made the work project a success.", "title": "Great motel, Outstanding staff", "user": "B F", "date": "March 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125965444}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "\"Awesome\" doesn't begin to describe my experience with the staff for these highly affordable accommodations. My stay at the La Quinta Inn was four nights and I will certainly stay again on the next business trip!", "title": "Nice Clean Hotel ... Pets May Make Noise", "helpfulness": 1, "user": "Moonrover2004", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 125683389}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "This hotel welcomes you with a cozy lobby. The staff was friendly when checking in. The room was clean and up to date. My only issue with this hotel is that the place seemed to be overrun by dogs and often times when getting in the elevator there was a foul odor. Along with that the dog next door was running back and forth and it's movements were quite audible.", "title": "Good Stopover Spot", "user": "SereneMarine", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 125477629}, {"rating": 5.0, "stay_parameters": "Stayed June 2012", "text": "Our stay here could not have been better. The price was beyond believable and the service and accommodations were easily four star! Clean, new, stylish, extremely comfortable. Great location for day trip to Mt. St. Helens, Columbia River Gorge area at Crown Point, etc. Lots of restaurants nearby. We tried Billygans Roadhouse which was a winner.", "title": "Absolutely perfect!", "user": "bessiedear", "date": "June 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 132003539}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "When in the area again, we will definitely return!", "title": "Nice room but over scented", "helpfulness": 1, "user": "Wannabediving", "date": "May 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 130377656}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We found the lobby very nice and clean. The elevator is somewhat hidden and slow so be patient. Overall the room was clean but we had a hard time getting used to the scent in the room not sure what they use to clean it with but it was overpowering. We thought it would help to put the air conditioner on, anything to help disperse the perfume. Other than that, the bed was comfortable, shower was on the weak side but a clean room and friendly service. A continental breakfast is served and is pretty good.", "title": "Beautiful", "user": "jsanchez8386", "date": "May 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130348308}], "location": {"country": "United States", "city": "Vancouver"}, "stars": 2.5, "variance": {"poor": 10, "average": 30, "very good": 83, "terrible": 15, "excellent": 154}, "aka": "La Quinta Inn And Suites Vancouver", "slim_ranking": 0.230769230769}