{"user_rating": 3.5, "review_count": 125, "name": "La Quinta Inn Austin South / IH35", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed there for 8 nights during SXSW 2012, and it was ok. A few days with unstable wifi, but that got fixed. Big, semi-old room, but always clean and with a new TV. The breakfast was not for me; muffins, marmelade, bagels, coffee and juice - too much sugar for a norwegian, but they had some fruit though. IHOP right across the street, so you could get breakfast there. The pool was pretty nasty, on the other hand, it was the beginning of March and not too hot weather, so I don't blame them for that. Really friendly and helpful staff. I stayed there because it was the closest downtown I could get during SXSW. I just slept there as the days and evenings were very busy!", "title": "Pretty decent", "user": "TarjeiH", "date": "March 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 126761419}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "On the plus side, the staff was friendly and helpful, and it was relatively quiet for our stay. Also- being a dog owner, it was nice to have plenty of grass around.", "title": "OK but nothing fabulous", "user": "Karmajones", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 126646897}, {"rating": 2.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "On the minus side- this was the worst LaQuinta breakfast ever. Cold cereal, frozen waffles, a little anemic fruit and weak coffee. Also- it is in a very busy industrial part of town, so it is not very peaceful. In addition, the bathroom was really tiny and cramped.", "title": "Older Motel", "helpfulness": 1, "user": "skgcdl", "date": "March 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 126626893}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We were supposed to stay for 3 nights, but only stayed for one.", "title": "Met our needs", "helpfulness": 1, "user": "makinmajik", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 125194297}, {"rating": 1.0, "stay_parameters": "Stayed June 2011", "text": "We were there for 15 nights. It was a disaster. Dirty carpets, didn't change the sheets when we asked. Was guaranteed a room with a fridge didn't get one until 4 days into the stay even though we paid extra for it. Not enough towels, pool was dirty. Desk employees seemed to not care about any problems.", "title": "Don't stay at this la q", "user": "txros57", "date": "May 12, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 129827484}, {"rating": 4.0, "title": "Great place to stay", "text": "Great stay at a clean and reasonable priced motel. The hotel was located on a very busy intersection of two major highways with a lot of traffice thenoise was not a problem. I had a problem with my TV and the staff was very prompt in handling my problem. I would gladly put this on my list of places to stay while traveling.", "user": "A TripAdvisor user", "date": "May 10, 2012", "id": 129703050}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "I was a little taken aback by this La Quinta. It is an older property, tucked beside an IHop. The first room we were sent to had cigarette butts all over the outside area. I went back and they moved us to a different room before we even opened the door to that room. Our room was spotless and I mean spotless. Updated decor, huge TV, separate dressing and tub area. But this is an older property with no amenties. It is hard to get to from both IH35 and 290. You must know exits, because they have put in a huge overpass and distances to exits are decieving. I would stay again if it was just a one night stay but if more I would want a little more. A clean hotel for the money and a very nice staff.", "title": "Nice, but.....", "user": "howdy12345", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129474940}, {"rating": 5.0, "title": "Consistently Great!", "text": "I've seen negative reviews of this hotel & for the life of me cannot figure out where people are coming from with such comments...my 25 yr old daughter and I stay here on a fairly regular basis...they've never messed up our reservation, even though we've booked our room months in advance! staff and customer service bend over backwards to accommodate our stay, it's always clean, comfortable and quiet (in spite of being right off the interstate) and we always feel safe coming and going at all hours...its convenient location makes it a snap to get to South Congress Ave or a quick hop onto 1-35", "user": "A TripAdvisor user", "date": "May 5, 2012", "id": 129430621}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The biggest initial problem is getting there.", "title": "Difficult to get to", "user": "Californiaview", "date": "April 28, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 2.0}, "id": 128977242}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Sitting at an intersection of major freeways this should be easy, however the address is deceptive. My recommendation use a GPS - however you must input the address as 'Interstate 35 S or South' not I-35 and even so be prepared for some confusing choices.", "title": "value for money", "helpfulness": 2, "user": "fishychic", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 127806091}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We liked this hotel, at first. Its in a good location right by the highway. We only stayed one night, as we were passing through. Slept well. Very quiet room. Bed was comfy. We didnt use any of the hotel amenities, it was simply a place to sleep. I woke up with a headache and I think it was from the smell of smoke. Maybe our room use to be a smoking room or something. I did mention it to the guy at the desk when we left. He said he would look into it, but I dont know if he did. He almost seemed to want to get rid of us so no one else would hear us complain. I wouldn't count this place out.", "title": "Nice place, but smells like smoke", "user": "Tuckers", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 132997376}, {"rating": 5.0, "title": "Great place! Great location!", "text": "This a very good location, right off interstate 35 and a only few minutes drive south of downtown Austin and all its attractions once you get onto Congress and head north towards the capital. For the price we paid, we were accomodated to a very clean room, bathroom, and very comfortable bed. The only thing I'd take away from this location is I've attended other La Quinta locations that always served a hot, not a prepackaged breakfast. I understand that perhaps this is because during the week it might just serve primarily businesspeople, but at least provide the hot breakfast buffet (fresh batter and waffles) on weekends. Other than that, for the mid-price of $75/night, I would come back to this location whenever I'm in Austin.", "user": "A TripAdvisor user", "date": "June 28, 2012", "id": 132948375}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Good value, great value, clean, basic, good employees, right off highway but still extremely quiet. By bed time lot full of cars but all visitors quiet and polite or else their insulation is the best you will ever experience. Cable tv has all \"the\" channels from locals to the hgtv to cnn to espns to hbo. They lost the waffle maker for heatable waffles, but all else was there for choose from. Simple, polite, CLEAN. Slept great.", "title": "Austin for Concert", "user": "SandBx", "date": "June 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 131378830}, {"rating": 2.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We had to check into La Quinta as a last resort when our other hotel had bed bugs (eww!!). Specifically requested a non-smoking room, we have kids. The room REEKED of smoke. We were exhausted so we stayed but got the heck outta there in the morning. Room 267, it's being sold as a non-smoking but don't book it unless you're a smoker!", "title": "Sold a smoking room as a non-smoking room. Not cool", "helpfulness": 1, "user": "Senoritamua", "date": "June 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 131096638}], "location": {"country": "United States", "city": "Austin"}, "stars": 2, "variance": {"poor": 12, "average": 30, "very good": 42, "terrible": 12, "excellent": 29}, "aka": "La Quinta Inn Austin i-35 s. Ben White Hotel", "slim_ranking": 0.524861878453}