{"user_rating": 4.5, "review_count": 69, "name": "La Quinta Inn & Suites Houston Energy Corridor", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed here for 4 nights in October 2012 while we visited friends in the area. The hotel was friendly, the room spacious, clean and comfortable and the location well placed on Westheimer to base ourselves, with plenty of parking. The breakfast is included and was good quality - it even had that rare hotel commodity of freshly made scrambled egg that was not overcooked. Overall, a job well done.", "title": "Good base to visit friends", "user": "wine_searcher", "date": "November 20, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 145793522}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "This is a fairly new hotel, in the western suburbs of Houston. I was there on family business. The check in was effortless (booked online) and the staff helpful, as they were all the week I was there.. The room was big (two queen-sized beds), clean, immaculate, with an excellent bathroom, which was also spotless, with a useful coffee filter machine (and coffee). The air con is a tricky affair. It was late October but still beautifully warm outside, but the aircon cooled the room almost too well. I left it off most of the time. Plenty of drawer and cupboard space, an iron and ironing board, and a TV with over 40 channels, table lamps and an armchair. Also excellent desk chair. My only real grouse was to do with the breakfast room. Service there was fine, and the food, though limited, was generally adequete and plentiful. Starbucks coffee from a huge machine. But the cutlery was cheap plastic and the plates and cups were paper or polystyrene. Too much like a picnis for such a good hotel. There is also a fairly small pool, but it was late in the season, and I didn't use it. I'd go again, to be near my family, who live nearby, and i wouldn'y hesitate to go to another La Quinta. (But the plasic and polystyrene breakfast things might tip the balance if there were a choice of hotels..", "title": "Pleasant stay at La Quinta, Houston", "user": "davidgsuk", "date": "November 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144781526}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We were in Houston for a wedding and stayed at the La Quinta Inn and Suites for one night. The hotel is new and very nice. The check in was no problem, the room was clean, did have a little problem with controling the A/C, it worked well maybe to well. The breakfast was a much more than I expected and I was pleased with it. Scrambled eggs, sausage, biscuits with all the other things that you see on a breakfast bar. Over all I was well pleased.", "title": "One Night Stay", "user": "JAB56", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144699674}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "I was in Houston at another hotel which was so bad I needed to find another hotel quickly. I searched online and found rooms in this hotel. Although it was a little bit cheaper than my first hotel, I have to say: This hotel is really great. From the service, to the rooms, to the pool (very clean and nice), the wifi (works flawlessly), etc. My room has a fridge and a microwave oven. Really, I'm happy to be here. Also, the neighborhood seems very nice.", "title": "Feels really good to stay here!", "helpfulness": 2, "user": "IvanKoenig", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 141930334}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "Room was a little smaller than some La Quinta's but it was enough for the stay. Bed was very comfortable, and room was spotless. Even though close to the Tollway and Beltway, room was very quiet with my window facing the roads. Breakfast was good and plenty of it. I would definitely stay here again.", "title": "Great Night Stay", "user": "TexTraveler778", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132260224}, {"rating": 5.0, "title": "Quiet and Clean", "text": "This La Quinta is a good value and we were impressed with the cleanliness and quietness of the room. It is far enough off a busy street to get a good night's sleep yet close enough to restaurants, the Galleria, etc. to be practical. The only negative I have is that the room is a little small, and the bathroom had no exhaust fan to eliminate shower steam. The breakfast area was done well. There was a very good selection of breakfast items and Starbucks coffee. Work out area was small but adequate. Same for pool and hot tub.", "user": "A TripAdvisor user", "date": "June 13, 2012", "id": 131894606}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel is in a nice neighbourhood with decent eateries nearby, friendly staff, good breakfast, very clean with nice pool.", "title": "Great value", "helpfulness": 1, "user": "Malcolm S", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130732083}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "This LaQuinta is very nice. The decor is very modern, the ceilings are very tall, the room was spotless, beds comfortable, check in a breeze. Set back a bit off of Westheimer so not so easy to find but this also provides for a more quiet setting. This is by far the nicest La Quinta I have ever stayed in. Way to go.", "title": "Wow....very upscale!", "helpfulness": 1, "user": "suzybro", "date": "September 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141031473}, {"rating": 4.0, "title": "Clean and good staff", "text": "Located in a good area with lots of restaurants around and offices on te energy close=by. The hotel is a very good place to stay. The staff is helpful and courteous. The breakfast served is very good.", "user": "A TripAdvisor user", "date": "August 14, 2012", "id": 137165457}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I checked in here on the 24th of July. It is clean and modern but like all newer La Qunita's it suffers from limited parking on a smaller lot. Nice lobby and staff is friendly enough. About 8 miles to downtown off of Westheimer on Shadow View. A car is necessary. Close to Target, HEB, Wal-Mart. Lots of restaurants on Westheimer naturally. Room is not spacious but comfortable. Updated furniture. Beds have 3 pillows each, queen size. Flat screen TV 40 inch. Direct TV with 60 channels. Small closet space. Stand is pretty standard in bathroom with marble top on vanity. Marble in shower and full sized tub. No mat so it is a little slippery in there but a hand rail is there. Double toiletry rolls. 1.6 gallon toilet. Shampoo. Soap. Hand Lotion. Hair dryer. Plush towels. Large mirror. Lighting is a little weak in the room but 2 lamps and ceiling lights. Dresser is adequate and desk with ergonomic chair and free WiFi. Wall air conditioner. Chair in room is mostly useless for use, it is not a Lazy Boy. Two phones. It takes the water time to get to you as hot water when the place has a lot of people in it, especially around 5-6 AM. Carpet is a little dirty. Fridge and microwave in dresser area. Elevator to upper floors. This is not the best part of town so keep the car doors locked and keep valuables in the room. It is a good business location. About 2 miles to Loop 8 and Hwy. 6 about 3 miles the other way, and that becomes 1960 going north and you cross I-10 that goes to San Antonio. I have not seen the pool. Exercise room with treadmills. Business center with two CPUs and screens is adequate. Disabled parking. Hot breakfast with rolls, muffins, pasteries, eggs, sausage, bisquets, waffles, fruit, orange and apple juices, oatmeal, cereal, hot teas (lots of choices here) and a Starbuck's coffee brewer, a first for a La Quinta. They even sell some snacks and some toiletries in the lobby area. Ice and soda machines. Manager reception in afternoons.", "title": "I like this place...centrally located....", "helpfulness": 1, "user": "jthutmd", "date": "July 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 135322053}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "A 4 star place. I would give it a 4.5 except for the neighborhood. Not a run down area but suspect. Westheimer is a busy road especially at 5 PM as downtown Houston uses it for an exit to go home. This La Quinta can be hard to see it is off the main road about 1/2 block. Their rooms are more expensive than others as they are near the Energy Corridor area and downtown.", "title": "Excellent hotel - relatively new, good location and friendly staff", "user": "bluemetal2", "date": "July 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135200881}, {"rating": 1.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "I stayed here for 7 nights in July with my wife and kids. Very good experience overall. Its just off Westheimer so most places in Houston are accessible. Its on the newer side so everything looks good, feels good. Staff is quite friendly. The only minor thing is that on 2-3 occasions the wi-fi connection would drop off briefly and come back on.", "title": "Cockroaches!", "user": "BonyMcMuffin", "date": "July 11, 2012", "detail_rating": {"cleanliness": 1.0, "location": 1.0, "service": 3.0}, "id": 134131363}, {"rating": 4.0, "title": "Great Stay, Definitely WIll Stay Here Again", "text": "Due to my late arrival and the offshore conference I was sent here as the only available hotel room in Houston due to over booking.", "user": "A TripAdvisor user", "date": "July 10, 2012", "id": 134065310}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I arrived after more than a 24 hour journey being extremely tired and without my glasses on I was satisfied with a large suite. However, upon a second glance I noticed the large number of dead small cocktoaches by the entrance door. I was at first happy to find them dead until I realised that something obviously must have killed them... Finding a live one in the bathroom was almost a relief. At this point I was extremely tired and knowing there were no other rooms available, I made sure to leave all my belongings on top of furniture before going to sleep.", "title": "Quiet & Clean. Excellent Stay!", "user": "Lauren M", "date": "June 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132384773}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 0, "average": 4, "very good": 22, "terrible": 1, "excellent": 42}, "slim_ranking": 0.0541760722348}