{"user_rating": 3.0, "review_count": 119, "name": "La Quinta Inn North Myrtle Beach", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2007", "text": "Stayed at this property from Feb 3-7 and took advantage of the terrific prices offered this time of year. The hotel owners were helpful especially with tee-times. The continental beakfast included bagels, cereal, dated fruit, coffee and waffles (which were good). This hotel is in a good location for golfers. The room was large,clean, comfortable and included a fridge and microwave. This trip was just my son and I so the room suited our needs. If travelling to Myrtle Beach this time of year (before Feb 15th), one can find terrific deals on hotel and golf however you may find the temperature cooler (8-13 degrees C). We played at some top-notch courses for $39 including cart. Tip: Buy the local newspaper and check the sports section for some pretty good golf deals and if you can, book thru your hotel, they get better rates. The average price for golf at some decent courses was $35 with cart and tax.", "title": "Affordable with good service", "helpfulness": 2, "user": "HoleinOneBarrie", "date": "February 19, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6814484, "likes": {"liked": "— Location", "disliked": "— Poor section for continental breakfast"}}, {"rating": 4.0, "title": "Great Location and Property", "text": "I would return.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "February 15, 2006", "id": 4462236}, {"rating": 2.0, "stay_parameters": "Stayed January 2006", "text": "Barrie, ON", "title": "not impressed", "helpfulness": 3, "user": "John B", "date": "February 4, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 4413673}, {"rating": 1.0, "title": "will not return", "text": "stayed at the property 5 days for business......hotel in the process of renovations........hallways look great with new carpeting and speaking with the owner and general manager, expected new furniture coming soon.......recommend to stay at this property and will be back in the spring!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 4, 2005", "id": 4160576}, {"rating": 1.0, "title": "Stay Away!", "text": "The room was clean But old looking. Said we would have sofa, We had two rooms none in either. one had no ref. said coffee pot in room (none). One room had a bad color on tv. Did get extra towels when asked for it. People very friendly. No longer Red Roof, Wating for a new name. so they are fixing it up. painting etc. So it might get better.We stayed here for three days and had two rooms. John", "helpfulness": 4, "user": "A TripAdvisor user", "date": "September 30, 2005", "id": 3980278}, {"rating": 1.0, "stay_parameters": "Stayed March 2008", "text": "I did not expect much from a La Quinta, but this hotel was part of a golf package that included the room and golf course reservations. From the time we arrived, I saw trouble coming. The front desk was empty at 3:00 on a Sunday afternoon, and it took about 10 minutes for another employee to chase down the desk clerk. Check in proceeded smoothly after that.", "title": "Never Again", "user": "joeb1249", "date": "April 2, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 3.0}, "id": 14752070, "likes": {"liked": "— The location was convenient to golf courses", "disliked": "— The rooms were in bad shape and never seemed clean."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The room had the old-fashioned window heater / air conditioner combination that was predictably noisy. Worse, when the fan was on, the condensation pooled on the carpet below. Whenever the TV was turned on, the volume automatically came on with full volume, and it could only be turned down to a modest roar.", "title": "Need a place at 3am - La Quinta to the rescue!", "user": "GiOhio", "date": "March 31, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 14689773, "likes": {"liked": "— The price and availability at last minute.", "disliked": "— Our view (of the roof) and the wet bathroom"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "The continental breakfast was quite limited and unappealing, and the dining area lacked plastic knives for two days. We were reduced to buttering toast with plastic spoons.", "title": "I wouldn't recommend this hotel if you like hotels like Holiday Inn or Marriott", "user": "traveler2007Tn", "date": "November 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 1.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 10576437}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "The bathroom was dingy and never seemed clean. In six days, we were left without a bath mat twice, and had no wash cloths on two other occasions. It seemed that towels were in short supply and the laundry was always behind.", "title": "If you are planning to stay at this hotel, please read this...", "helpfulness": 4, "user": "aweemonkish", "date": "July 18, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 8140973, "likes": {"liked": "— Friendly Staff (Other than the GM)", "disliked": "— The incompetence of the General Manager Sanjay"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "There several other chain hotels in the area that would have been just as convenient to the many golf courses. If I return to Myrtle Beach, I'll find another place to stay.", "title": "Nice Price, Nice Rooms, but.....", "helpfulness": 2, "user": "Saratoga7", "date": "April 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 7270974, "likes": {"liked": "— Room was clean, roomy, had coffee maker and micro-fridge.", "disliked": "— Mess concerning us NOT being in our room."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2005", "text": "We booked this room for a spur of the moment, overnight trip to Myrtle Beach. We found a rate of $71.99 on the Red Roof Inn website. We didn't expect much for this rate, but the basics could have been better. The property sits close to two other hotels properties on the Northern, less crowded end of Myrtle Beach. There really isn't a lobby, but a small check-in area upon entering the motel. We had previously requested a crib for our four month old. Upon arrival, we were told that the property owned one crib and it was broken. We then rearranged our bedding requests and asked for a roll - away bed, instead. The hotel did not have this type of bedding either, because of a family reunion. Our room was on the bottom floor. It was a non-smoking room, but the hallway outside our room smelled strongly of smoke. The room cleanliness was mediocre. The bathroom was very dirty with hairs in the tub, mold on the showerhead and mold at the bottom of the shower curtain. There was dirty grout between the bathroom floor tiles. They were no amenities such as shampoo or conditioner, etc. I believe there was one small bar of soap. There were not enough towels and washcloths. One of the towels we did have, was covered with stains. We called to request more towels and were told that we could go to the front desk and pick them up ourselves. The sheets were very thin and the blankets were extremely stiff and scratchy. The pillows had a foul odor to them. The phone made some sort of annoying tick - tock sound when were trying to go to sleep, so we just unplugged it. The \"free” breakfast in the morning (which we arrived to by 8am) was white bread for toasting, Raisin Bran and a package of generic cookies sitting on the counter. The toasters were so filthy and old; I would not have eaten anything toasted in them! The pool was VERY small. The one positive thing was that the room did have two queen size beds and a sofa that pulled out to a twin bed. We also had a fridge and a small, compact microwave. The room was certainly worn around the edges, but it was a good size. I guess the lesson to be learned is that if you want a nice motel/hotel experience, you just have to pay more. It felt nice to come back home to a clean environment. Believe me, I am NOT a neat freak, but I felt kind of \"dirty\" the whole time I was there.", "title": "Not very impressed...", "helpfulness": 4, "user": "CrissyAnn", "date": "July 20, 2005", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3684613}], "location": {"country": "United States"}, "stars": 2, "variance": {"poor": 17, "average": 17, "very good": 26, "terrible": 34, "excellent": 25}, "aka": "La Quinta Inn North Myrtle Beach Hotel North Myrtle Beach", "slim_ranking": 0.396226415094}