{"user_rating": 4.0, "review_count": 525, "name": "La Quinta Inn & Suites New Orleans French Quarter", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "just got back from new orleans. the la quinta was perfect. all the people were so friendly and helpful-especially the valets! the pool was small and cold but hey we werent in it long-way too busy! love the nice clean hotel. perfect location. great people. and best they love our dogs!!!!!!!!!!!!!!!!!!!", "title": "loved it!", "user": "jodiwsh", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40123863}, {"rating": 5.0, "stay_parameters": "Stayed August 2009", "text": "We arrived early for our check in and most of our rooms weren't raedy. The incredibly friendly staff - desk person and valets - Gave us a multitude of options of where to spend our time. Everyone was exhasted and needed a drink so they sent us down the block to a cozy laid back bar.", "title": "Perfect stay in New Orleans", "helpfulness": 1, "user": "lovemyth", "date": "September 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39529175}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "When i got back and got into my room , I noted it was quite roomy. An entrance area with closet and cabinets with mini fridge and microwave. Bathroom clean and roomy. Comfy clean bed, comfortable desk area, large Tv, lots of dresser space. All very nicely decorated, the rooms looked exactly as the company advertised.", "title": "This hotel is great for the price due to decor, location, etc...", "helpfulness": 1, "user": "SweetSam84", "date": "August 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 36805037}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "A short walk away from the quarter, and casinos.", "title": "Very nice and reasonable stay downtown New Orleans.", "user": "MelliD", "date": "July 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 35303825}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "bad things. ran out of towels and for the whole trip we were short on towels. the front desk tended to be short staffed with the wait being quite long, quite often.", "title": "Great Stay", "user": "TexasStar11", "date": "June 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32458179}, {"rating": 1.0, "stay_parameters": "Stayed December 2009", "text": "The receptionist gave us bad information about the time to take the breakfast so we lost it ,the first day, bad information about cost of the room and the bill. When i had my credit card statement, they charged more money, the person in charge is very rude and unpolite and the manager never fixed my problem after to complein many times. I had bad time, and I have to pay a lot money for their mistakes.The rooms very dirty and they did not clean the room in the time we expend there, you can find dog excrement everywhere.", "title": "It is terrible. Bad service.", "user": "unhappytraveler71", "date": "January 5, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 52673182}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Stayed here 12/28 & 12/29. Decided to stay here after looking at positive reviews. It's clean, in a good location, and the front desk was always friendly and helpful. My only negative was the breakfast. Hard boiled eggs were brown when peeled. Vinegar maybe? But weren't too appealing. There were enough other choices to avoid the eggs, but probably would have found somewhere else for breakfast if we had stayed longer. I felt that despite the breakfast, this hotel was an excellent choice for our first trip to NO.", "title": "Good Choice", "user": "escapemi", "date": "January 3, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 52505956}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "I enjoyed my stay, ive stayed at other hotels in new orleans,so far i enjoyed this one the most.Location was great,breakfast etc. the only problem was there was too many dogs.Other than that it was great! yes i would syay again.", "title": "great trip", "user": "sugarcoated", "date": "December 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52115592}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "My wife and I along with our dog stayed at this property from Thursday, 12/24/2009 (Christmas eve) until the following Sunday. We were unsure of if we had made a good choice since we'd been told \"stay off that side of Canal Street.\" We spent a lot of time in the Quarter but a lot of time in nearby very nice restaurants (MiLa for example) which were very close. This hotel is about a 3-5 walk to Bourbon street and I felt safe all the time - this is ranging from 9:00 AM until 02:00 AM. There is a minimart about 1 block away and also CVS and Walgreens - so if you need to run out and grab something you can do it on foot - easy.", "title": "Great Location, Great Rooms, Very Nice, Updated Interior", "user": "TF9623", "date": "December 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 52054534}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "As for the hotel - perfect - we recently stayed in another La Quinta in Dallas which had been updated and it appears those hotel has been updated too - same sheets, beds, pillows, etc, we saw in Dallas and very nice for a mid-range to budget hotel. Yes you pay 25.93 (or something - includes tax) for parking but you will pay that anywhere in NO unless self park and it seems the going rate for self-park is at least 15. If you driven to Manhattan and had to park your car for a weekend knowing you would never use it you would pay at least 50.00 so even though it isn't cheap it isn't unreasonable to pay to park in a congested city.", "title": "Brilliant value", "user": "Szn", "date": "November 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 50016607}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "One of the best deal on these parts of the world – I am not exaggerating. The room was perfectly designed, very pragmatic: not opulent but not cheap looking either. It had hardwood floors in the hallway and bathroom area and the rest was carpet. The beds were comfortable. The closet was small but adequate. There was no mini refrigerator. The entire room gave a feeling of something newly built in a contemporary style. The A/C unit was quiet and true to the set temperature. The breakfast is included. The front desk personnel were friendly and helpful.", "title": "The greatest value around", "helpfulness": 1, "user": "Algesoft", "date": "November 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 49612463}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "When you book on line, you are always weary - dont be about this HOTEL - it has all the amenities of the top hotels and reasonable prices. The valet is $26 a day but that comes wtih as many in & outs as you want and you can call ahead and they will have your car at the front door when you come down. Even my other traveler was thrilled. We first had a handicap room which was great and a couple days later came back again and got a regular room and it was great as well with pleanty of access.", "title": "So much more than any LaQuinta I have seen-right up there will the best", "helpfulness": 2, "user": "CharlaF", "date": "November 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48842065}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "All the staff were very friendly, helpful and accomodating to all request including reservations at exclusive restaurants at the last minute.", "title": "This is the place to stay!", "helpfulness": 2, "user": "martinjld", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45845986}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I highly recommend this hotel, very close to street cars, gambling, football arena and the french quarter!!!", "title": "Will definitely stay at this LaQuinta again.", "user": "QueenBee01", "date": "September 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 44271659}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "We originally booked our 4 night stay in New Orleans at the International Hotel, right across the street from the La Quinta. The rooms at the IH were soo bad that we ended up leaving and getting a room at the La Quinta (the rates at LQ were much less than at the IH or at most hotels in the area as well). This place is great! Spacious, modern, clean room, with fridge, microwave, nice flat screen TV (with lots of channels), good air conditioner, comfy king bed, free breakfast, and spacious bathroom with great shower. The free high speed wireless internet was great as well. Very short walk to Bourbon Street or any where else in the French Quarter.", "title": "Wow - so much better than expected", "helpfulness": 1, "user": "kerri_lousie", "date": "September 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 40213892}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We just returned from a stay at this hotel. The hotel was clean and comfortable, great beds, and the room was huge. It was a few blocks from Canal Street, Bourbon Street, Harrah's and River Walk. Best of all it was a great value. The people at the front desk were great, especially Summer. Lots of great restaurants are nearby. The parking was $25 per night but not as expensive as some of the other hotels. (If New Orleans would like to get visitors back, perhaps they should create reasonable parking.)", "title": "Great Qualty of This Hotel Made My Trip Extraordinary", "user": "Sp0rty", "date": "March 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59467086}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Very clean and great location. We got a room on the 10th floor for 99 dollars. So close to everything that we wanted to see downtown. We also had to reservations just found the place as we came into town.", "title": "Not just a good value but what you would expect at a higher priced hotel", "user": "simpleandfree", "date": "March 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59405999}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Great value and within walking distance to Bourbon Street, The Louisiana Superdome, ect. Everything we wanted to see, we could without driving. Only downside was that we had to wait quite awhile (30-40 minutes) for our car. It was parked by the hotel valet and because of contract changes, the lot isn't as close to the hotel as it used to be (or so we were told.) Even so, we would stay there again. Great service, friendly staff, great price for the part of town it's in.", "title": "Great Value", "user": "thehuddys", "date": "March 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59163503}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I stayed 6 night at the hotel. The room are beautiful, very comfortable, big size, clean and well equipped. The hotel has another interesting facilities included in the room prize such as WI FI Internet, self service laundry, gym, business center and a basic breakfast. However, most of the staff was unfriendly, The service needs improvement, one day the room was not clean at 16:30, other day there were no more spoons at breakfast, the treadmill was broken most of the days. In summary, a very good quality hotel that needs improvement in the service and staff attitude to the guests.", "title": "good value hotel", "helpfulness": 1, "user": "edtani", "date": "March 4, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 57743385}, {"rating": 5.0, "stay_parameters": "Stayed February 2010", "text": "Staff was very helpful, room was very clean and beautiful! Walked into the French Quarters to a wonderful seafood resturant - in all our group of 10 had a great time in New Orleans thanks to the staff of this hotel. We plan to stay here every time we visit on our way to Baldwin to work at the UMCOR depot. Would recommend it for every group!", "title": "Wonderful Stay", "helpfulness": 1, "user": "gailcook", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 56231837}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 3, "variance": {"poor": 18, "average": 60, "very good": 181, "terrible": 22, "excellent": 244}, "aka": "La Quinta Inn And Suites New Orleans French Quarter Hotel", "slim_ranking": 0.28, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}