{"user_rating": 3.5, "review_count": 333, "name": "La Quinta Inn & Suites Las Vegas Airport N Conv.", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We stayed here at the beginning and end of a tour of the canyons with family. It is a good stay for the price. The interior is nice, bathrooms are somewhat older (towels are quite old), but the nice free breakfast makes up for it. Breakfast included waffles, sausages, hard boiled eggs, banana and apple, yogurt, cereals and oatmeal, juices, and bagels, bread and danishes. Bagels and danishes were individually wrapped so we were able to grab breakfast to go when we headed for the airport. The property had ample parking and was a very easy drive to the airport and the Strip. It is across the street from Terrible's Casino's Bougainvillea Cafe where we ate dinner a couple of times. To tour the Strip, we drove about 3 blocks to Bill's Gambling Hall and Saloon and parked there for free so everything was quite convenient. We never leave valuables in hotel rooms so theft was not a problem. This property should appeal to the budget-conscious traveler. We would stay here again.", "title": "Good stay at La Quinta Las Vegas Airport", "user": "sarah4nil", "date": "May 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16157068, "likes": {"liked": "— Price, convenience, breakfast", "disliked": "— None"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "We used our La Quinta points to stay 1 night at this hotel. We were pleasantly surprised. Based on the pictures on La Quinta's web site, other reviews, and it being near the airport, we were afraid that it was going to be a dump. It wasn't. It isn't the nicest La Quinta we've stayed at but it sure wasn't the worst. Certainly acceptable. They had a nice variety at breakfast. It's not walking distance to the strip but they have a shuttle bus that will take you over there.", "title": "Surprised - It was OK.", "helpfulness": 2, "user": "50StateTravelers", "date": "December 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "location": 3.0}, "id": 11994273, "likes": {"liked": "— Price", "disliked": "— Distance from the strip"}}, {"rating": 3.0, "title": "la okaya!", "text": "Stayed at the la quinta for 1night previous to canyon tour and two nights after trip in sept '06.", "helpfulness": 3, "user": "only1spurs", "date": "February 21, 2007", "id": 6822947}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled on business", "text": "Staff were pleasant enough but the odd smile would help.", "title": "Okay, if you appeciate your belongings being STOLEN!!!", "helpfulness": 4, "user": "JFH07", "date": "February 9, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 6766974, "likes": {"liked": "— pool, gym and spa.", "disliked": "— Items being stolen"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "The rooms were basic but clean if not a bit hard to find.(they give you a map at reception when you check in!)", "title": "My stay January 2007", "helpfulness": 1, "user": "MarioTheGreat", "date": "January 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 6550085, "likes": {"liked": "— No frills", "disliked": "— Intermittent Wireless connection"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2005", "text": "My husband and I met two friends here for the New Year's Holiday. We had planned this trip together for several months, to include booking this hotel well in advance. A few days prior to our reservation, I called the front desk to seeif it would be possible to arrange that our friends be able to check in on their arrival from their flight from D.C. (we were driving from California and wouldn't be able to arrive until much later). When I called, I was told this would not be possible as they would need to verify credit card info and id, even if the room was paid for in full prior to our arrival, and to be sincere, the courtesy on the other end of the line was very minimal; I felt as though I had interrupted them and did them a diservice simply by asking. I was not surprised that this could not be arranged, but I was completely surprised that when we finally did arrive and I did check in at the front desk, I was not asked for a single form of identification, no credit card, nothing. I was simply given a room key and thanked for our choosing to stay with them.", "title": "Disappointed, to say the least", "helpfulness": 10, "user": "Smudge6", "date": "January 4, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 2.0}, "id": 4324444}, {"rating": 4.0, "stay_parameters": "Stayed October 2005", "text": "Therefore, my friends absolutely could have checked into the room instead of waiting in the lobby for our arrival via car and through the unforseen new year's traffic.", "title": "served purpose", "helpfulness": 13, "user": "daqattaq", "date": "October 31, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 4.0}, "id": 4076205}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "The hotel was very clean and in nice condition, and if you are up for it, not a bad walk to the strip, which is what we had to do in order to get to the strip on New Years because they close it down to traffic early in the evening. That in itself was no big deal, however, the shuttle was very advertised as 24 hours, convenient, etc., but this couldn't be further from the truth. In order to use the shuttle, which ran on no organized, consistent schedule, you had to notify the front desk who then contacted the shuttle driver via nextel walkie cell phones, and then you waited 10-15 minutes at the hotel to get on the shuttle. In addition to this, our friends called the hotel to inquire about an airport shuttle at which time they were told there was no airport shuttle, when indeed there actually are two shuttles, and one specifically for the airport!", "title": "Great place to start...", "helpfulness": 14, "user": "GPH050", "date": "October 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 4040282}, {"rating": 5.0, "title": "Wonderful, Make a point to stay here", "text": "On New Year's Eve day, my girlfriend and I were shopping on the strip and carefully planned to return via the shuttle in time to get ready for the evening and be sure to return before the shuttle ended for the evening in preperation for the festivities. The driver and hotel well advertised the fact that the shuttle would stop running at 5pm that evening. What they DID NOT include was that at 2pm-something, a shift change would occur. We called the hotel from the strip at 2:28pm to request the shuttle and were told in the same less-than-courteous manner that we should call back AFTER 3pm to re-request a shuttle because they were in the middle of a shift change. No apology was given; and the fact that we would have to recall the hotel and then again wait for the shuttle, it would have definitely been an hour before we would be back at the hotel, a mere 5 minute drive. We instead had to take a taxi. No big deal. We were happy to be in good company. However, the next day, New Year's Day, we spent the day on the strip and requested a shuttle at approximately 4:40pm and were quoted a half hour wait. We had a dinner reservation we were planning around, so when 45 mins passed, we called again, at which time we were told that the shuttle had been waiting at the airport. There were supposed to be 2 shuttle running, but they were only using one. When the driver did arrive, he offered no apology and commenced driving in such an erratic manner that those of us in the van were actually bracing on turns and accelerations - and I promise this is not an exaggeration.", "helpfulness": 17, "user": "rattmoney", "date": "October 16, 2005", "id": 4027249}, {"rating": 4.0, "title": "Clean and Good Service!", "text": "The next day, our key stopped working, which we didn't find out until our walk to the breakfast room, and we couldn't open the door to the main part of the hotel. I walked to the front desk, again greeted in a less than friendly manner, at which time I was challeneged for an ID, which was locked in my room...we finally got the key reset, but when we returned from breakfast it didn't work again. I returned to the desk a second time to settle it.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3931727}, {"rating": 5.0, "title": "Very nice.", "text": "Very nice non-gaming hotel off the strip. Beautiful pool courtyard. Excellent continental breakfast. Would definitely stay there again.", "helpfulness": 19, "user": "A TripAdvisor user", "date": "September 18, 2005", "id": 3912820}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Everything was superior - location (off the strip, but still close), rooms (large, clean and comfortable, jacuzzi tubs, high speed internet), property (great pool, gardens, parking), breakfast (available until 10, good variety, well stocked), staff (friendly, helpful) and all at a great price.", "title": "Just super", "helpfulness": 10, "user": "cosalamx", "date": "September 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3906430}, {"rating": 5.0, "stay_parameters": "Stayed January 2005, traveled on business", "text": "The hotel was excellent, the staff friendly and accomodating. In fact, the shuttle bus driver was so wonderful I married him a week later! As far as I'm concerned, it's the best hotel in Vegas! :)", "title": "Found true love on the shuttle bus!", "helpfulness": 2, "user": "onlinegal", "date": "December 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0}, "id": 6490202, "likes": {"liked": "— Tip the shuttle driver;)"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "Spent two nights here at the start and end of a trip around the canyons. Rooms were of a reasonable stand and the free shuttle to the airport and strip was useful. Breakfast was dull - everything was wrapped in plastic, it didn't seem very healthy and there was a lot of waste. If you just book a room then there's a Starbucks over the road. It was nice to have a pool and there were a few local shops. If you can afford to stay on the strip then do it.", "title": "Okay if you're passing through", "helpfulness": 4, "user": "blackeberg", "date": "October 8, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5926730, "likes": {"liked": "— Pool", "disliked": "— Breakfast"}}, {"rating": 1.0, "title": "Who’s that sleeping in our bed? And what’s that smell?", "text": "Let's see, where to begin with the problems?", "helpfulness": 13, "user": "A TripAdvisor user", "date": "April 19, 2006", "id": 4987928}, {"rating": 3.0, "stay_parameters": "Stayed January 2006", "text": "First, the hotel lost our reservation and we had to wait over an hour for a room to become available. The people behind the desk were courteous, but not very helpful.", "title": "okay but won't stay again", "helpfulness": 8, "user": "deb_ocon", "date": "February 1, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 2.0}, "id": 4407790}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Next, the entire hallway going towards our room smelled very, very strongly of marijuana. I expected the DEA to bust in at any moment and raid the place. I also prayed the smell wouldn't stick to my suit.", "title": "quiet and peaceful and convenient!", "helpfulness": 4, "user": "BritInCA", "date": "January 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4335127}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 2.5, "variance": {"poor": 40, "average": 68, "very good": 109, "terrible": 35, "excellent": 81}, "aka": "La Quinta Inn And Suites Las Vegas Airport North Convention Ctr", "slim_ranking": 0.481481481481, "description": "Mission-style non-gaming Hotel in classic, 3-story Southwestern-style building with central courtyard; offers airport shuttle."}