{"user_rating": 4.0, "review_count": 254, "name": "La Quinta Inn Vancouver Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "As part of a weekend trip to the Lower Mainland we group booked rooms at La Quinta. The person I was sharing a room with had arrived the night before and was settled in so when I checked in I simply told them the name of my room-mate. I was given a key and told my room number - no request for ID to confirm who I was. Cost of the room - $75/night for 2 people.", "title": "Great Value Despite the Fawlty Towers Check-in", "helpfulness": 1, "user": "tripjimbc", "date": "March 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 155568178}, {"rating": 4.0, "title": "Limited airport shuttle", "text": "I didn't think things were quite right when I got into the room. It sort of looked occupied as one of the beds was messed up, but there was no luggage or any other sign of an occupant. I decided to settle in, grabbed the remote and watched a bit of TV. I figured that perhaps my room-mate was out getting something to eat. When my cell rang I missed the call but checked the message - it was the person I was sharing the room letting me know the room number ... which was different from the one I was in. That's when I noticed the Chinese newspaper on the table and, feeling a bit like Goldilocks, realized that I was in the wrong room. Others in our group had similar experiences when checking-in. Two were booked into a room that was in the process of being painted. They were quickly upgraded.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 23, 2013", "id": 155466496}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Aside from those quirks, the hotel is excellent value. The rooms are comfortable, beds great and the pillows not too over-stuffed. Everything was clean and relatively new. WiFi was a bit hit and miss, but workable. Breakfast on both mornings was very good. Nice variety of waffles, hashbrowns, standard microwaved (?) eggs (\"scrambled\" but perfectly round), coffee, fruit, etc. Service began early. Pool is fairly small, you're not going to be doing laps.", "title": "Great quality for the price", "helpfulness": 1, "user": "Bruno G", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 154889919}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Location is excellent. You're walking distance to Landsdowne Mall and there are some good restaurants nearby. We had an evening meal at Shanghai Wonderful which was .... wonderful. Good access to all major routes and relatively close to the airport.", "title": "Great for those who are traveling to the airport", "user": "Flora F", "date": "March 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154478392}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "I've had to overnight in Vancouver in order to catch an early flight in the past - I think that I'll be using La Quinta Inn the next time I need to do that.", "title": "Good price value", "user": "rueckenbach", "date": "March 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 153955722}, {"rating": 5.0, "title": "Above and beyond what I expected again", "text": "Not the first time I stayed here and I also recommended to friends in the past who were very pleased. I.ually stay here when I have to take an early flight or need a park and fly but am considering to stay when I the wife and I need a break as location is great to get into Vancouver and dining etc. Definately worth the money", "user": "A TripAdvisor user", "date": "February 20, 2013", "id": 152648811}, {"rating": 5.0, "title": "The best value and quality in Richmond", "text": "I travel to Vancouver on monthly basis, and I have pretty much tried almost every other hotel at this price range. La Quinta is by far the best at this price range. Good room size, quiet, clean, free parking, free wi-fi, very nice hearty breakfast, the convenience of location, free airport shuttle if one needs one. For the price of $64 for two adults, the deal is unbeatable.", "user": "A TripAdvisor user", "date": "February 7, 2013", "id": 151623432}, {"rating": 2.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "The hotel and rooms are fine for an overnight stay. We arrived at 10:00 p.m. and no shuttle had to pay $20.00 for a cab ride to the hotel. When we arrived we asked the girl on duty if it would be possible if we could get dropped off in the morning at the Bridgeport bus station. It is literally 2 minutes away from where you turn to the airport. She felt it was no problem but when we asked in the morning the answer was no way and the girls on duty said the night girl was crazy. Not a nice way to talk about your staff. We booked through Expedia.ca and in reviewing the details about the hotel it talks about an airport and area shuttle. Well I call 2 minutes out of your way an area shuttle. Disappointed by this and just felt it would be nice once in while if someone did something nice for someone else.", "title": "Ok but disappointing", "helpfulness": 1, "user": "Hollies507", "date": "February 2, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 151262956}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "This was a good hotel and perfect for an overnight layover, but nothing fancy. The room was clean and the bed was somewhat comfortable, but the staff is less than enjoyable. The breakfast is just so so but they pool and hot tub are a nice touch. The Shuttle stops running at like 9 pm which is complete BS so dont count on them for a ride if you have a late flight.", "title": "No complaints but not 5 star", "user": "John D", "date": "January 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 150990682}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "What I loved the most about this hotel was the pillows - lots of them and so plushy. Great bed for sleeping. Nice amenities, but I prefer glass mugs and drinking glasses to plastic. I arrived with friend late and left right after breakfast, so I cannot vouch for shuttle (beware it may not be 24/7 in case you have an early flight) or long term parking but would consider both assets. Customer service agents could use more training. Didn't check out location but saw lots of eateries nearby and close to public transit - all pluses. Breakfast was adequate for this level hotel, if you aren't catching an early flight. Heard others complaining about loud music and thin walls. Overall we found it quite satisfactory for the price - except for sound of planes flying overhead at night. I've stayed at comparable hotels in the area that weren't in the flight path of the airplanes.", "title": "Adequate for overnight airport travelers", "user": "nishamah", "date": "January 29, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 150957265}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Our family stayed here for 2 nights. Upon arrival at VYR, we went to the information desk and they called La Quinta for us to request for the airport shuttle. Within 10-15 minutes, our free shuttle arrived. The hotel is close to the airport, close to Landsdown Mall, Asian Restaurants (try Pho 99 - across the La Quinta entrance - reasonably priced and food was really good). It is also a 15-20 minute walk to the Richmond Centre (a more moden mall).", "title": "Clean, comfortable bed, great service", "helpfulness": 1, "user": "Angel014", "date": "January 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 150430168}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "My family traveled to Canada for the first time and I found the La Quinta Inn Vancouver through TripAdvisor. I was very pleased with this hotel. The rooms were cozy (we had two double beds). There were two holes in the sheets on both beds though. The bathroom was nice and clean.", "title": "Nice hotel, friendly staff, nice location", "user": "Sarah F", "date": "March 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153829130}, {"rating": 4.0, "stay_parameters": "Stayed February 2013", "text": "The staff was friendly as well. We ended up staying an extra night and the staff was friendly taking care of our transaction.", "title": "Clean and comfortable", "user": "BBB00", "date": "February 25, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 153075612}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Each morning my daughter and I had breakfast. They had waffles, cereal, oatmeal, toast, eggs, sausage or hash browns, milk, and juice. Nice but the typical continental breakfast.", "title": "average, no frills", "user": "jbmx", "date": "February 23, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "location": 3.0, "service": 4.0}, "id": 152854955}], "location": {"country": "Canada", "city": "Richmond"}, "stars": 2.5, "variance": {"poor": 13, "average": 40, "very good": 113, "terrible": 6, "excellent": 82}, "aka": "La Quinta Inn Vancouver Airport Hotel", "slim_ranking": 0.625}