{"user_rating": 3.5, "review_count": 207, "name": "La Quinta Inn & Suites Nashville Airport", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Great location near airport, but also had the usual airport noise, also walls are a little thin. If you are a light sleeper I would stay a little farther away. But the breakfast was great, room was great, several restaurants across street. Got a great rate, 59$, Govt rate.", "title": "great deal, a little noisy, but still great", "user": "Herk_Driver", "date": "April 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15293456, "likes": {"liked": "— location", "disliked": "— airport noise"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We stayed at this hotel for one night for a short trip to Nashville. The hotel is in need of updates. The bed was not comfortable and had outdated and uncomfortable coverings. I would probably not stay here again.", "title": "Dissapointed", "user": "lbagci", "date": "December 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 3.0, "location": 4.0, "rooms": 2.0}, "id": 11887423}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I booked 4 rooms at the LaQuinta Airport (on Donelson Pike) for group travel 9/22/2007. EVERY room was fine - the only issue we had was a very noisy bathroom fan and a toilet that didn't like to flush. I've been to Nashville NUMEROUS times - and we have stayed at the Lowes, Hilton, Wyndham Union Station and Sheraton Music City - all great hotels if you want to spend the $$. The LaQuinta was an EXCELLENT value for the $$ (AAA rates) the rooms were clean, beds were comfy, and the area is SAFE!! Plenty of places to eat nearby, Waffle House across the street, KMart across the street, 2 mins to airport, and easy on/off to xway to get to Downtown / Vanderbuilt area - just a 10 min car ride away. I didn't get a chance to use the outdoor pool, but it looked fine and would have swam if time allowed. Safety is an issue when booking Nashville hotels if you're not familiar with the area - this is a SAFE area and would be comfortable with my GRANDMOTHER booking her own room there :) Will DEFINITELY recommend to others I know who don't want to spend the $$ to stay downtown!!", "title": "GREAT HOTEL FOR THE $$$$$$", "user": "chgojovigurl", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 10006773, "likes": {"liked": "— Great Value for the $$, COMFY beds! Easy expressway access", "disliked": "— noisy bathroom fan, toilet didn't like to flush"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "this La Quinta is a decent one, quiet and family and pet friendly, near the Nashville airport. It's actually a La Quinta Inn & Suites, which means it's a little bit nicer than the plain old La Quinta Inn--fluffier towels, pillow-top mattresses, massagin shower heads, and the staff a little bit more professional. It also means it costs $89/night for a room with two double beds intead of $79, but it's TOTALLY worth it. I unfortunately didn't find a hotel guide in my room, and they didn't have an extra one for me, so that was disappointing. I also found the wireless network to be painfully slow. And I really wanted to work out, but I couldn't get into the fitness center. I asked the front desk if it was closed for the night, and she said yes, it closed at 10pm. I must have looked really disappointed, because when I got back to my room, my husband said she called and said she'd let me in anyway. That was awesome! This is not the first time a La Quinta employee has gone out of their way to help me, so this just reinforced my commitment to staying at a La Quinta whenever possible. Like most La Quintas, this one has waffles in the morning, but I noticed this one and the one from Texarkana, TX don't have butter, just this foul-tasting margarine. That's too bad, b/c the waffles with butter are my favorite...", "title": "Great Staff!", "user": "lazy_engineer", "date": "July 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8042597, "likes": {"liked": "— great staff, newish hotel", "disliked": "— slow internet, margarine instead of butter w/ waffles!"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "This is an old Baymont hotel that has had the signs convert over to LaQuinta. this hotel does a disservice to the Laquinta name. the overall appearance of the inside of the hotel looks worn, needs to be updates. The rooms are not suites, but are of good size. I like staying at LaQuinta hotels mainly because of their awesome breakfast, but at this hotel, it was not very good.. It was 7:30am, and they were out of bagels, out of Waffle mix, only had white bread, and some ceral left. When I inquired about more breakfast condiments, I was told that is all there is until tomorrow.", "title": "Not up to LaQuinta Standards", "user": "ottopart", "date": "April 3, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 7276597}, {"rating": 4.0, "title": "Great Time", "text": "Just returned from a weekend stay at the Baymont Inn at the airport. Hotel was very clean and rooms were spacious. Breakfast was sufficient each morning. Would stay there again!", "user": "RAAREE", "date": "January 17, 2006", "id": 4358641}, {"rating": 5.0, "title": "Great place", "text": "My wife and I stayed at the Baymont Airport Hotel in Nashville for 2 nights. January 02-04, 2006. We found this Hotel to be excellent value for money. Clean rooms, courteous service and an excellent location. The Hotel had self service laundry facilities. Wash and Dry costs $3. The Hotel staff called us to make sure that the room was ok, which was a nice touch. The free Breakfast is pretty good. We recommend this place 100%.", "user": "cheezypoof", "date": "January 4, 2006", "id": 4324542}, {"rating": 1.0, "title": "Baymont not worth any amount of money", "text": "This was the worst hotel we have ever stayed in. The housekeeping staff", "user": "A TripAdvisor user", "date": "July 10, 2005", "id": 3655019}, {"rating": 3.0, "title": "Accommodating Staff", "text": "was absolutely the epitomy of laziness. There were no wash cloths in either of the two rooms occupied by our group and we were told to go to the front desk with any complaints. There are no plastic liners in the waste baskets so the housekeeping staff won't empty them unless they are more than 1/2 filled. Toilets were constantly plugged. Our rooms were not on the list to clean on one of the four days we had booked. Think twice about the money you are saving by staying at this hotel. We certainly learned our lesson.", "user": "Giggy", "date": "January 16, 2004", "id": 1554094}, {"rating": 2.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "First there are TWO La Quinta's that identify themselves as the \"LaQuinta Airport\" hotel. Even the staff refers to each of them as the \"La Quinta Airport\". I booked my stay according to the information I was given by my business associates. However, because of this bizarre situation I ended up at a different hotel than my associates. The confusion occurs often according to the employees on site at BOTH hotels. The one I ended up at on I think it was Donlee (??) Pike, is as close to a Dump as one can get . it is primarily frequented by Truck drivers from CSX. As a business woman constantly being surrounded by these Hulking, Loud, overtired drivers isn't my cup of tea. The hotel itself is OLD. and in need of some repair. The toilet didn't flush (reported but not repaired before departure) and beds need replacing. I went down for the \"complimentary breakfast\" at 7:30 a.m. There were no Muffins, no Bagles, and only Cherrios left (as far as cereal goes) so if you wanted anything but plain white toast and coffee, you'd better be up and downstairs by 6 a.m. And again, in the company of a room full of truck drivers. The other \"La Quinta Airport\" hotel, however, had a full available menu at that hour, the rooms were prettier, the building much much newer, and NOT on the main drag, so therefore a more pleasant area.", "title": "Is everyone confused or is it just me?", "user": "Terrytech", "date": "March 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7239874, "likes": {"liked": "— The staff tried to be helpful.", "disliked": "— The fact that this hotel primarily accomidates truck drivers for one specific company, and you wouldn't know it until after you'd booked it."}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006", "text": "I do have to say that regardless of which La Quinta I wandered into, (because of the mix up, I was at the other numerous times) the staff at both were courteous and tried to be helpful.", "title": "A Little Shabby", "user": "Anon727", "date": "November 18, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 6149317}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Mostly La Quinta needs to decide WHICH ONE is the AIRPORT hotel, and give the other a separate identity.", "title": "Excellent Service!", "user": "Wiscbabe", "date": "November 1, 2006", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 6042671, "likes": {"liked": "— The comfortable beds.", "disliked": "— Not enough cups provided in guest rooms."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "This hotel apparently was a recent conversion from a Baymont Inn. The property is somewhat shabby and in need of a makeover. The room was dark and dreary. Desk personnel didn't present a very professional image, either. On the plus side, the continental breakfast was pretty good.", "title": "So good, we booked another night!", "user": "Kristyn417", "date": "August 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5602751, "likes": {"liked": "— The price", "disliked": "— limited parking"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "We stayed at the La Quinta airport from Oct. 26 through the 29, 2006. The service was wonderful. The front desk staff was most helpful, and the beds very comfortable.", "title": "They should have informed us they had changed from Baymont", "user": "bowhunterups", "date": "June 22, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 5373279}], "location": {"country": "United States", "city": "Nashville"}, "stars": 2.5, "variance": {"poor": 29, "average": 41, "very good": 71, "terrible": 10, "excellent": 56}, "aka": "La Quinta Inn Nashville Airport Hotel Nashville", "slim_ranking": 0.358108108108}