{"user_rating": 3.5, "review_count": 185, "name": "La Quinta Inn & Suites Downtown Conference Center", "reviews": [{"rating": 4.0, "title": "Previous Reviews Misleading", "text": "I am not sure what hotel the two previous travelers stayed at, but their notes and ratings were inconsistent with what I found. I just returned (9 October) from a conference which they hosted and was very pleased with my experience. Don't expect a luxury hotel, but I found it to be a very satisfactory standard hotel. The parking garage was immediately behind the hotel and you only had to cross an alley (limited access alley) between the parking garage and the hotel - about 10 yards at most. There were absolutely no panhandlers nor did I see where ones would have located themselves between the garage and the hotel. I found no problems with the temperature of the water and the room was kept as clean as a normal hotel. I used the wireless high speed internet connection without a problem and they offer hardwire high speed access if you do not have a wireless card. The only adverse comments I had were that one lamp did not have a bulb in it and a collegue of mine had a dirty glass in his bathroom. Neither of these would I consider totally unexpected at what I would describe as standard accomodations. Although I normally stay at another hotel chain when I travel, I would have no problem staying here again if the situation presented itself.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "October 9, 2005", "id": 4003442}, {"rating": 1.0, "title": "How dirty can it be?", "text": "Date of visit: 9 August 2004 on a 100 degree day.", "helpfulness": 3, "user": "PlayfulPlatypus", "date": "August 13, 2005", "id": 3759930}, {"rating": 2.0, "title": "Not for females traveling alone", "text": "This Clarion Hotel on Broadway in downtown Little Rock might as well have been a flop house for drug dealers and homeless people. The air conditioning in the hallways and lobby was not working adequately. There were fans on each floor to circulate the air. If you want breakfast, there is a McDonalds with lots of bustling activity next door. Supposedly there is a bar and restaurant at the hotel, nobody occupied the seats in that area but then again, the air conditioning was not adequate. On three different occasions, walking between the garage and the hotel, different people asked us for money. The carpets in the lobby and elevators have dark stains on them. The TV reception is almost like they have no cable and are using an antenna. The reception that you are allowed is edited by SkyAngel. There was no hot water--lukewarm was all there was. When we asked the front desk where the workout room was, we were told it was next door and that they only had one key and a person was using it. We finally found the workout room on the second floor. All of the plug in lights were unplugged. When we got to our rooms, which had been reserved in advance, the air conditioning was not on--sauna rooms is what we found. Luckily, after 2 hours, the air cooled enough to be bearable.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 11, 2005", "id": 3755767}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "My company booked me and several co-workers in this hotel because it was within walking distance of the place we would be working. When I was checking in I asked for a mini fridge since we would be there an extended period of time. I was told that they did not have them for the regular rooms, only suites and there were none available. However, a co-worker, whose reservation was made at the same time as mine, was given one without a problem.", "title": "Pleasantly Surprised", "helpfulness": 4, "user": "deb1175", "date": "July 25, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3699379}, {"rating": 3.0, "stay_parameters": "Stayed May 2005, traveled on business", "text": "Parking is behind the hotel and across the alley. I was panhandled three times in less then 24 hours. It is a long way from the parking lot to the hotel so if you decided to stay here, unload from the front doors! Although we were only working 3 blocks away, I was not about to carry my coach briefcase.", "title": "A Place to Hang Your Hat Downtown . . .", "helpfulness": 8, "user": "m2violin", "date": "June 2, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 5.0}, "id": 3521953}, {"rating": 3.0, "stay_parameters": "Stayed June 2007", "text": "A lot nicer than any other LaQuinta I have stayed at. The property was undergoing renovation at the time, and will probably be pretty nice when completed. The room was very clean and the staff was extremely friendly. The major downside was the location--it's pretty far from the attractions in downtown Little Rock, but not that far of a walk. You could probably do better, probably do worse.", "title": "One of the better La Quinta properties", "helpfulness": 2, "user": "Corpuscle", "date": "August 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 8449507, "likes": {"liked": "— Friendly staff, updated interiors", "disliked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "For a two day vacation to Little Rock, we stayed at this hotel. It's a pretty standard hotel, nothing seedy or dirty about it. It has a free parking garage, a crappy tv, and semi hard beds. The staff are friendly, the maid service thorough, and the bathroom is a decent size.", "title": "Adequate Hotel for Vacation or Business", "helpfulness": 1, "user": "mortal888", "date": "April 10, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 7328105, "likes": {"liked": "— Location, Price", "disliked": "— Location"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "The entertainment street (President Clinton) is about a quarter mile away, so within walking distance. However, I wouldn't recommend single women walking home late at night as there are a few unsafe blocks between the entertainment Ave and the hotel.", "title": "Adequate accommodations", "user": "mgcasvtiany", "date": "September 26, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 2.0, "rooms": 3.0}, "id": 5880999, "likes": {"liked": "— Cheap", "disliked": "— Very sterile atmosphere"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "Not bad for what we paid - $75 a night.", "title": "No Problems at all - Great Stay", "helpfulness": 4, "user": "SneakinDeacon", "date": "March 15, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 4626135}, {"rating": 3.0, "stay_parameters": "Stayed February 2006", "text": "The hotel is OK, clean and presentable to say the least. Shame there is nothing very close by and there didn't seem to be anyone staying there either.", "title": "It was just fine", "helpfulness": 2, "user": "Shaas", "date": "February 6, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 2.0, "service": 4.0}, "id": 4418316}], "location": {"country": "United States", "city": "Little Rock"}, "stars": 2.5, "variance": {"poor": 27, "average": 31, "very good": 54, "terrible": 19, "excellent": 54}, "aka": "La Quinta Inn & Suites Little Rock Downtown Hotel", "slim_ranking": 0.392857142857}