{"user_rating": 4.5, "review_count": 924, "name": "La Residence Hue Hotel & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We spent two weeks in Vietnam, but only 1 night here in Hue. This was a big mistake we could have easily spent 4 nights here in Hue, and especially because of the La Residence Hotel. As stated in many reviews it is a fantastic art deco hotel beautifully restored. We had a great room, over looking the river, with a huge balcony. The bathroom was good with a huge bath.", "title": "Our best night in Vietnam !", "helpfulness": 2, "user": "rojaan1", "date": "May 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 16531678, "likes": {"liked": "— The Restaurant", "disliked": "— NOTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We had a drink in the bar after a long day sightseeing, and the best dinner of our whole trip in the restaurant. Breakfast the next morning was very good with a great range of cereal, fruit, hot and cold main course, pastries and juice. The spa looked very good and the prices looked reasonable. If only we had enough time to take advantage of it. I would definitely recommend this hotel and give it *****", "title": "wonderful art deco hotel.", "helpfulness": 2, "user": "drron", "date": "May 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 16031737, "likes": {"liked": "— Friendly staff", "disliked": "— No major complaints"}}, {"rating": 4.0, "title": "Stylish hotel", "text": "I am another amazed at the adverse reviews here.This was a wonderful hotel experience.Great atmosphere,friendly and efficient staff and a wonderful restaurant.", "helpfulness": 1, "user": "Traveller, Bristol", "date": "May 3, 2008", "id": 15603670}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We were told waiting to be checked in that the welcome drink was made from Pandanus leaves and a sign on the glass tells you this saying it is a local herbal drink.", "title": "Loved it!", "helpfulness": 1, "user": "Coopers4", "date": "May 2, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 15559327, "likes": {"liked": "— Amazing pool"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "I checked all the airconditioning panels in public areas and the air con was on but set at 24C-by the way what a public awareness campaign over the Aussie summer suggested was the appropriate setting so as to not add more to climate change-no wonder the hotel got an award in 2007 for environmental awareness.", "title": "Wonderful art deco hotel", "helpfulness": 1, "user": "Sayer", "date": "April 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15277286, "likes": {"liked": "— The art deco style", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The only thing that marred our stay here was the weather,unfortunately much colder and wetter than it should have been for mid to late Feb, so we couldn't take advantage of lovely gardens and pool. Room perhaps a little small, and were unable to get river view room, but food very good. Staff so pleasant and friendly. Hotel well managed by very pleasant German lady. Would disagree with reviews saying that hotel too far from town centre. We found it a pleasant walk to the Citadel etc. along a well laid out riverside walk. Had a coffee in the Morin and much preferred ambience and location of La Residence.", "title": "Great place", "user": "TAMember1234", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14014344, "likes": {"liked": "— location, staff, food", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Would definitely stay here again.", "title": "Our 3rd visit to Le Residence", "user": "Parsis1", "date": "March 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14003084, "likes": {"liked": "— The size of the room and the reasonable price for such a room. The balcony offered a wonderful view.", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This is our 4th trip to Vietnam and our 3rd to Hue. Our first visit here to Le Residence it had only been open for 2 months. Now 2 and a half years later it has it \"all together.\"", "title": "La Residence etait tres agreable.", "user": "73Duck", "date": "February 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13652358, "likes": {"liked": "— River view.", "disliked": "— Noise from other guests in the hallway."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "On our first visit the spa was not yet open. Last year it was open but we did not visit it as we had much else to do. This year we opted for some relaxation time and it was a most enjoyable experience. For 2 hours of treatments for 2 people it was less than $100. The hotel continues to please us and the staff stays constant from visit to visit so we have some familiar faces greeting us and serving us. They are most pleasant and really try to please. The food in the restaurant is excellent. Rooms are spacious and bathrooms are very light and pleasing. Balconies abound and all in all it is a great place to relax.", "title": "Relaxed", "user": "JAEMH", "date": "February 17, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 13617008, "likes": {"liked": "— The breakfast", "disliked": "— Lack of internet connection"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We picked this hotel over the Saigon Morin to find a quieter venue and we believe it was a wise choice; although the weather was terrible in early February, there was a nice view across the Perfume River to the Citadelle (be sure to request a river view room). The rooms themselves are fairly decent and most we saw had a large patio/terrace. The rooms do need some refurbishing of the wooden floors which are getting pretty scuffed up. The exterior needs some serious cleaning to get rid of the moss, mold, fungus from the damp weather; this problem seemed very prevalent throughout Hue, however. The only other complaint is the noise from the hallways; there is no carpet to mitigate the sound and the halls actually echo. They have five computers for complimentary guest use, and the connection speed was very good.", "title": "Enjoyable, 4-star experience", "helpfulness": 3, "user": "aknannie", "date": "February 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 13302646, "likes": {"liked": "— Cleanliness, location, dining", "disliked": "— bar services"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "This was meant to be the highlight of our Vietnam trip, instead it was the biggest disappointment. We found one helpful staff member during our three day stay. The others, particularly the European staff were extremely arrogant. The prices of the services were more than I would pay in my own city, which is one of the most expensive in the world. The food was average, and it wasn't within working distance of the main centre, this meant dealing with the very persistent cyclo drivers outside the door.", "title": "Over priced and poor service", "helpfulness": 3, "user": "viewfromsydney", "date": "February 1, 2010", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 4.0}, "id": 54885571}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "This is an extraordinarily beautiful hotel. If you have any interest in architecture or interior design, you will love staying here. The service is friendly, and our room has glorious views of the Perfume River.", "title": "Extraordinarily beautiful hotel", "helpfulness": 1, "user": "worldtravels2010", "date": "January 30, 2010", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54725408}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Situated on the iver, across the citadel, this hotel was a great place to stay. The rooms are spacious, very clean and modern. The grounds are beautiful. Our room overlooked the grounds and the river. The breakfast buffet was elaborate and served on the terrace which overlooked the river. Dinner buffet offered a lot of different dishes. The town offers amazing sights into old Vietnam.", "title": "Fabulous Hotel with Vietnam long history, great location", "helpfulness": 1, "user": "RuthyNewJersey", "date": "January 28, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 54633071}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "This hotel is definately one of the best hotels in Hue, situated three minutes from teh train station was a pleasant surprise for us as we had decided to take the train to Da Nang (ask for the left side of the train if you do this)", "title": "EXCELLENT ALL ROUND", "helpfulness": 1, "user": "PRogersDublin", "date": "January 20, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53935673}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "from the hotel you can see the citadel on the otherside of the perfume river, if returning i would definatley pay a little more to get a river view as the room that we had overlooked some adjoining houses.", "title": "A Class of its Own", "helpfulness": 1, "user": "aromas", "date": "January 12, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 53253701}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We made the mistake taking an upgrade offered from the standard room for an end room at $10 per night without seeing what was being offered. It really was not worth it.", "title": "Good but don't buy the up grade", "user": "seebeforeigo", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 60162631}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The rooms are on the smaller side but the hotel itself offers excellent facilities. The restaurant is good both for breakfast and dinner and lunch at the \"coffee shop\" was also excellent. Service was friendly and very good and free fast internet access a bonus. The location is also good for the city and the river. In all quite a comfortable hotel to tour from.", "title": "First class hotel in the middle of chaos", "user": "GoneTrippn", "date": "April 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 1.0}, "id": 60111423}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This is a far better hotel than the prices they charge. The decor is pitch perfect and the staff wonderful. Hang out in the swishy lobby and feel richer than the outstanding cocktails ( which incidentally were only $5. Have four, I did.)", "title": "An Art Deco confection straight from an episode of Poirot", "helpfulness": 2, "user": "lynamc", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59307014}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Having said that, Hue is a mess. The honking right outside the gates is unbearable. All the time. The drivers honk, the mopeds honk, your taxi will drive with the horn \"on\". It's complete madness. Am I snob? not really. Would I recommend this hotel? absolutely. Would I return to Hue? probably not.", "title": "On the Perfume River Art Deco Governors Residence great service", "helpfulness": 2, "user": "KAISASOSI", "date": "March 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58823695}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We only stayed here for one night so I can’t really give an in depth review. We liked this hotel a lot. The Art Deco makes you feel like you’ve stepped into a particularly stylish episode of Poirot. Our room was a confection of striking black and yellow with the lovely lines you’d expect of the style. Sadly, our room was at the back of the hotel overlooking the bins, but we were only staying one night so who cares.", "title": "Lovely Hotel", "helpfulness": 2, "user": "lilacrose", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58723116}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This hotel is well situated with magnificient grounds and a large and inviting pool. The rooms are stylish and the art deco features at the hotel are wonderful. The staff is friendly and helpful. Our only gripe is the overrated dining room. The breakfasts are unimaginative and below average compared with other hotel experiences we are having in Vietnam: many items are lacking on a daily basis (e.g., no mango or assortment of fruits on certain mornings), much of the food is in steam trays and is over steamed and dry (can you believe they serve warmed over chicken al la king?) and pancakes and waffles are pre-made, and while you can have eggs prepared to order, this is a very below par dining experience in our opinion. Our dinner at the hotel restaurant was equally disappointing. The vegetables were not crisp and our food was just average. The kitchen was unwilling to meet our requests that deviated at all from the menu. A lunch we ordered at the pool took forever to arrive (the kitchen is very slow in turing out food during the afternoon) and our sandwiches had undercooked and uncrisp bacon in them. It seemed to us as if this hotel's kitchen just slides by with a minimum effort and average food because they can get away with that due to the numeber of bus tours that pass through this hotel. We thought that the French cared about food. This hotel's dining room needs to try harder or guests like us will choose another hotel.", "title": "The Dining Room is the weak link at this hotel", "user": "Coolcoops", "date": "April 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61628937}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We stayed at La Residence for two days in a river view Colonial Suite. The suite had a huge open air wraparound balcony but the only drawback was that we didn't get to use it as it rained the whole time we were there. It was such a pity as it would have been heavenly to sit out on it and watch the river but it wasn't to be. Something to bear in mind when booking as Hue has high rainfall and I expect the balcony gets little use for much of the year. The suite was of a very high standard and the Art Deco style of the hotel was spot on.", "title": "Beuatiful hotel. Well located.", "user": "Jojicat", "date": "April 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61126465}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Service was generally good but was quite impersonal on occasion. Some staff members stood out though and we were so impressed by one who was extremely helpful that we sought out a manager to compliment him. The main issue was lack of staff in the bar to serve the customers effectively and we heard a few complaints about time waiting for service. Often there was only one person struggling to keep up particularly around lunch time.", "title": "Wow!", "helpfulness": 1, "user": "Venezuela11", "date": "April 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60824953}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "We didn't use any of the spa/leisure facilities so cannot comment on them.", "title": "Hotel is nice but eat elsewhere", "helpfulness": 2, "user": "Jlive00000", "date": "April 7, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 60646530}, {"rating": 5.0, "stay_parameters": "Stayed March 2010", "text": "Overall a beautiful hotel with a few staffing level issues to be addressed. However this may have been a blip and I would stay again if I returned to Hue.", "title": "Great art deco hotel", "helpfulness": 2, "user": "FrenchFred", "date": "April 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 60334167}, {"rating": 1.0, "stay_parameters": "Stayed April 2008", "text": "A previous reviewer mentioned the \"greedy management\". Maybe he or she is right, as that would explain why my stay here has been so unpleasant. The problem is that the air conditioning in all the public rooms, including the lobby, the restaurant, the 'library\" (where you go to use the public computers), the bar and all the corridors has been turned off the whole time I have been here. In the restaurant, even the ceiling fans are off. As is to be expected at the time of year, there is a blazing sun and it is very hot and extremely humid in Hue. But it is just unbelievably more hot and humid inside La Residence. And this is not for any excusable reason. Every room and every corridor has a residential-type thermostat. Where possible without being noticed, for example in the \"library\", i can push the button, see the little red light come on, and immediately feel the a/c starting up -- though it would take a long time to bring the temperature and humidity down from the extreme levels that are prevalent indoors.", "title": "Greedy Management", "helpfulness": 3, "user": "Westonian", "date": "April 23, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 15250272}, {"rating": 2.0, "stay_parameters": "Stayed March 2008", "text": "Now here's the kicker. The one place in this hotel where it is tolerably cool is in my room, where I can control the a/c via the exact same type of thermostat as in the public rooms. But there is no internet service in the rooms, not even wireless (in 2008!). For this, you have to take your laptop to the bar, where it is far too hot and humid to think, let alone work, or you can use a public computer in the \"library\". But trust me, because I tried it, if you turn on the a/c in the library ten minutes before you plan to go and work there, it will have been turned off again by the time you're ready. They must have someone who polices all the thermostats.", "title": "Worst hotel experience in Vietnam !!", "helpfulness": 3, "user": "astro50", "date": "April 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 1.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 14958885, "likes": {"liked": "— Design", "disliked": "— everything else"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Second kicker, unless you enjoy dining while bathed in sweat, you're going to be eating from the very limited room service menu three times a day. Even at 7 a.m. the dining room was like an oven.", "title": "Disappointing hotel", "helpfulness": 3, "user": "Leighites", "date": "April 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 14848221, "likes": {"liked": "— the grounds", "disliked": "— poor service and distance from attractions and eateries"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "I am typing this review while seated at the bar. In the time it has taken me to do it, my clean shirt has acquired a large blotch of sweat, and the keyboard is getting clammy.", "title": "Excellent choice in Hue", "user": "CPH360", "date": "April 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14770673, "likes": {"liked": "— Colonial touch", "disliked": "— Couldn't stay longer"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "Shame on the hotel managament that defines hospitality in this penny-pinching way.", "title": "Dissapointing for a La Residence Hotel", "helpfulness": 2, "user": "carol59692001", "date": "March 16, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "business": 4.0, "cleanliness": 3.0, "rooms": 3.0, "location": 3.0}, "id": 14315373}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "this is one of the most beautiful luxury hotels i have ever stayed in.", "title": "A destination in itself", "helpfulness": 1, "user": "kikaan", "date": "March 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58443348}, {"rating": 5.0, "title": "Second return visit, still as excellent as first time", "text": "It is a spectacular testimony to art deco design.", "helpfulness": 1, "user": "lobster1972", "date": "March 13, 2010", "id": 58422997}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "All is luxurious, top quality.", "title": "Rich in History and Beauty", "helpfulness": 1, "user": "RobynPringTravel", "date": "March 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58410410}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Near to railstation, walking distance to city center and palaces.", "title": "Elegant hotel with beautiful pool", "helpfulness": 1, "user": "MrsJH", "date": "February 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 56221083}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Fantastic restaurant", "title": "Good position", "helpfulness": 1, "user": "The-Typical-Tourist", "date": "February 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 56111702}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "This place is such an oasis of style and service. A place fitted out almost entirely to suit its art deco heritage could so easily have fallen into the tacky theme hotel hell but this has been done with loving care and attention to detail. It really did feel like stepping into a Hercule Poirot novel in a good way.", "title": "Simply divine decadence", "user": "HotelCleve", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 20667929, "likes": {"liked": "— Wonderful quality of fittings and accomodation. Real feeling of luxury.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "The rooms and suites are beautifully fitted out. Our Colonial River View Suite was stunning with a massive roof terrace with views over the Perfume River to the Citadel.", "title": "Ooh La La Lurve La Residence", "user": "Melsk1", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 20111478}, {"rating": 5.0, "title": "An unforgettable experience", "text": "The staff were all friendy, attentive and spoke good English, which was not the case in other locations in Vietnam.", "user": "0-smartypants-0", "date": "September 10, 2008", "id": 19946967}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I heartily agree with those who have said this is one of the best places to stay in Vietnam and would go so far as to say it was probably the best hotel I have ever stayed in. To stay in this hotel again would make any trip to South East Asia worthwhile.", "title": "A Historic and Luxurious Gem", "user": "Alison52", "date": "August 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18678430, "likes": {"liked": "— Luxurious yet characterful rooms", "disliked": "— Crowded pool area in afternoons"}}, {"rating": 5.0, "title": "Best hotel i've ever stayed in!", "text": "Absolutely loved my 2 night stay here. It is such a grand art deco colonial building & is a holiday within a holiday. It is quite a large complex so it was easy to relax with friends peacefully. I enjoyed swimming in the pool, having a drink in the bar, playing pool at the pool table. The breakfast buffet was very good. The service was excellent. They had taxis on standby & an ATM machine is next door. The post office is just down the road. You will need to catch a taxi to the town centre but I didn't care as I was completely smitten with this place. The only criticism I have is that the Tour Desk Operator was a little 'brusque' & upset me however the lovely staff did their best to appease me. The laundry is done with much TLC. I had a fantastic time here & hope to return one day. Highly recommended & worth the extra $!", "helpfulness": 1, "user": "dancingpiglit", "date": "June 19, 2008", "id": 17047693}], "location": {"country": "Vietnam", "continent": "Asia", "city": "Hue"}, "stars": 5, "variance": {"poor": 14, "average": 32, "very good": 181, "terrible": 3, "excellent": 694}, "aka": "La Residence Hue Hotel Hue", "slim_ranking": 0.0377358490566, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}