{"user_rating": 4.5, "review_count": 165, "name": "La Reserve Geneve Hotel & Spa", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "This hotel is ideally situated very close to Geneva airport and yet you are not disturbed by the noise and you are on the shore of Lake Geneva. Sadly the design of the hotel means that only a minority of rooms have a lake view. The rest seem to face each other which is disappointing for such a top notch hotel. The decor is highly unusual and I think you will either love it or hate it. More importantly service is impeccable, food is excellent and the rooms are of a very high standard.", "title": "Strange layout but excellent service", "user": "sjwoolnough", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117485426}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "Luxurious and well appointed hotel just outside city centre. Very nice rooms if a little small. The safari decor is not really my taste as well.", "title": "Ultra luxe", "user": "SJX", "date": "July 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "service": 5.0}, "id": 115940885}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I was here for just one night on a business trip with a colleague. Other more central hotels were full so we were given the Reserve slightly out of town.", "title": "lovely - but a waste for a business traveller", "user": "OverworkedUnderpaid", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 114858306}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Reception and indeed the hotel as a whole has some kind of game reserve theme going on (name gives it away I guess!). The overall impression is rather dark as they have used dark woods everywhere. Not unpleasant though.", "title": "The Perfect Hotel for a Special Occasion", "user": "Mikey-G1", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113393312}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We arrived early evening and departed early the next morning, so not really enough time to enjoy the facilities which looked wonderful. The pool area was large and looked very inviting (though backed onto a main road, so probably not the most tranquil of spots). The spa also looked great, but no chance of any treats for us! I did use the gym very early the following morning. It was all good and very well equipped, though a little hot as it is in the humid indoor pool area.", "title": "Beautiful view and original trip to reach them by boat", "user": "LuneLune", "date": "April 24, 2011", "detail_rating": {"location": 4.0, "service": 4.0}, "id": 105229290}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Spa is very good,clean and relaxing. It's really overpriced but for special occasion is ok.", "title": "best location,great view but overprice", "user": "BasakEGeneva", "date": "May 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 63956881}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "And i had the best hamburger in geneva in this hotel.", "title": "Can't fault it", "helpfulness": 1, "user": "Nigel26", "date": "February 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56592033}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The reviews on here fail to capture the 5* excellence of this hotel. The spa is possibly the best in the world and the rest of the hotel is cool and faultless. How can a bar out of the centre of the city have such a vibe and provide food which surpasses that of Le Richemont? Forget the modernist architecture and enjoy.", "title": "Best airport hotel on the planet", "user": "Japan_Gaijin", "date": "January 29, 2010", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 54646125}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "La Reserve isn't intended to be an airport hotel but it is very close to Geneva airport making it a great place to stay before / after a flight. This was my second time at this property and it continues to impress.", "title": "Fantastic concierge and boatdrivers", "user": "globetrotter212", "date": "January 27, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54469577}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "Best things about the property:", "title": "Best and only in Geneva with cigar lounge (still)", "user": "TrophyCollector", "date": "January 4, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 52556668}, {"rating": 2.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "I was told by an associate that during my next visit to Geneve, to stay at La Reserve. Respecting his very high praise with regard to this establishment, I therefore did so. Still a dear friend, I shall NEVER listen to him again! Unless you like driving endlessly to get to your hotel, being met with the sight of \"flaming torches\" upon arrival, and a lobby adorned with parrot lamps, busy walls and carpeting, and a giant faux elephant... I did not know a that the Swiss would allow such a place that takes it's decor ideas from somewhere between a cross between Las Vegas mixed with an African safari! Very strange! The palate of multiple colors used in my room were so loud, that even the deaf could have trouble falling asleep! However, I must say... the spa was impressive. Perhaps I am being a bit tough on this hotel. I am sure that it is a better place to stay during a warmer climate. The grounds look green and lovely on the internet... At least their chosen interior designer cannot tamper with nature's innate splendor. However, next time... I will stick the Le Richemond, Merci beaucoup!", "title": "Flaming Torches? Plastic Elephant in Lobby? This is Elegance? Really, Silly Me!", "helpfulness": 1, "user": "MonarchosSeven", "date": "March 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 101785775}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "truly nice place for a relaxing week end, excellent spa, nice lounge and resto - advised for couples", "title": "excellent relaxing week end", "user": "silkroad91", "date": "January 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 91848765}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "We came to Geneva for business just for 2 nights. Since it was a business trip we were looking for nice accommodation, but not too expensive. Friends recommend us La reserve.", "title": "Nice hotel to see ones.", "helpfulness": 2, "user": "alicewaltinska", "date": "November 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 85685905}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The price was still too high, but we decide to check it out. The first thing we did not like was the location....it is nice to be near airport, but there is nothing else to do...you have to go with the taxi everywhere....and sometimes it takes too long for taxi to come.", "title": "Very good hotel; not an obvious fit for families with kids but it works", "user": "ivanciment", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 78543376}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The hotel interior is not particularly my taste , but interesting, different and nice ambiance . Rooms were very comfortable. I would suggest them to re look at their shampoo, lotion etc products. The packaging looks very nice, but impossible to open, you almost need to have a knife (naturally i dont have it with me when I am in the shower :-)).", "title": "SUITE LA RESERVE, BEST HOTEL EXPERIENCE IN GENEVA !!!", "helpfulness": 1, "user": "otterboris", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67167067}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Enfin, a smoke free lounge bar. We have always loved the atmosphere here, but not the smoke, La Reserve is now smoke free, but every bit as trendy, cool and atmospheric as before. The best bar in Geneva, especially late in the evening.", "title": "At last, no smoke... et toujours magnifique", "user": "Jetdeau", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48341002}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "A very special place. Tranquil, set in large grounds with views of the lake, but a good vibe in the bar and brasserie. Elegant, restful, 5 minutes from the airport. Try the burgers!", "title": "Very special", "helpfulness": 1, "user": "madridtomilan", "date": "March 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26084012}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "A stay of contrasts! On company expenses; I would have been disappointed if I'd paid for it, though. Loved the spa, fabulous massages & pool for early morning swims. But I hated the planes flying overhead - reminded of me of when I used to live in Chiswick - which disturbed the peace regularly and made resting on the balcony, well, not restful. Bizarre architecture and interior design - or maybe I'm just an old fogey. Looked like a brick motel from the outside, and the inside had a jungle theme... Fascinating bar for people watching in the evening, and the restaurants serve great if totally overpriced food. Lovely bathroom, big, clean, and extra fluffy towels. Would happily go back again, as long as someone else is paying for it...", "title": "Just like living near Heathrow", "helpfulness": 2, "user": "DH76", "date": "February 2, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 2.0, "rooms": 5.0}, "id": 24098620, "likes": {"liked": "— spa", "disliked": "— planes flying overhead"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I just stayed at the hotel and I must say I was quite impressed with this property, both on the product and the service standpoints. The hotel has all the facilities and amenities you would expect in a 5 star hotel less the uptight aspect of it. The lobby features a wooden floor with a fire place... Wow! What a change has opposed to the classic marbled hotel lobby! I stayed in a Lake suite which boasts prime views of the Geneva Lake. Also, the SPA is a class in itself with lavish surroundings. May I recommend the Relaxing massage which is amazing. The Chinese restaurant was really great. Tip: book ahead as the place is quite popular. Philippe, the Front Office Manager, was able to secure a spot for me and my girlfriend. I WILL DEFINITELY RETURN !", "title": "My trip to Geneva", "helpfulness": 1, "user": "EnriqueFlores", "date": "March 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14679906, "likes": {"liked": "— The view; the decor"}}, {"rating": 1.0, "title": "Awful Awful Awful!", "text": "We stayed in this hotel for a quick weekend break and as members of the LHW (usually the LHW hotels are of an excellent standard) - we thought the service and style of the hotel were awful. Appearance was more like a premier lodge and its right next to the airport - so there is no feeling of 'rural retreat' and there is an ugly motorway between the hotel and the lake. Location is very good for business travellers but def not for holiday-makers. The service was appalling - my husband had broken his leg a few weeks before and they didn't even help us out the canb or show us to our room - I had to carry the bags up 4 flights of stairs! The onyl good thing was the spa which was fully booked for 4 days!!! Don't go anywhere near this place opt for Park Evian instead.", "helpfulness": 1, "user": "Jillhelen", "date": "January 27, 2008", "id": 13046218}], "location": {"country": "Switzerland", "continent": "Europe", "city": "Bellevue"}, "stars": 5, "variance": {"poor": 5, "average": 14, "very good": 41, "terrible": 8, "excellent": 97}, "aka": "La Reserve Geneve Hotel Bellevue", "slim_ranking": 1.0, "description": "In a residential area of Geneva, surrounded by a beautiful park on the banks of Leman Lake, La Réserve Genève - Hotel and Spa is a luxury hotel where everyone enjoys the privilege to feel at home. The hotel is located Chemin des Romelles on the road to Lausanne, 5 minutes from Geneva Cointrin International Airport, a few minutes from international organizations, and 10 minutes from Geneva City center. The private boat, La Reserve Motoscafo, takes you to the city center and brings you back to the hotel. Decorated by Jacques Garcia in a colonial and casual chic spirit"}