{"user_rating": 4.0, "review_count": 82, "name": "La Sapinette Hotel Dalat", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is a new, modern hotel, and the room we were given was exactly as shown in the picture. Dalat, it was explained, is very busy during Tet and the hot summer months, when people come from HCHC to the mountains. The hotel was very quiet when we stayed, and that was just fine, as the beds were very comfortable, and we had great sleeps both nights. The young staff were very pleasant and helpful. It is about 3 km. to the downtown, but taxis are cheap, and Dalat is also a great place for people who like to walk (the circular route around the lake is lovely). Breakfast needs a lighter hand (less oil in the pans and skip the ground meat in the omelette). Family restaurant across the street made us a nice pre-flight dinner at 4:00pm. The old train station is about 1 km. away, so you can walk through a typical neighbourhood to get there. Dalat is very friendly!", "title": "Good Value", "helpfulness": 1, "user": "BarbaraElizabeth", "date": "May 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 129363092}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "hotel was empty...Great rooms, better than some 5 stars in HCM. Good value for money, but we found it a bit weird to be in these nice room in such a poor location. Surroundings are not very pretty.", "title": "nice hotel, poor location, poor breakfast", "helpfulness": 2, "user": "stan r", "date": "April 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 128264035}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Staff speak good English + very welcoming and helpful.", "title": "Beautiful hotel very comfortable room", "helpfulness": 2, "user": "VegasBoundVegabond", "date": "April 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127400003}, {"rating": 4.0, "stay_parameters": "Stayed April 2012", "text": "Taxi is cheap and fast to go to city - 2-3usd, so better put more to be well located.", "title": "Beautiful hotel for any kind of stay", "helpfulness": 1, "user": "MrDago", "date": "April 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 127105722}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "No swimming pool. Breakfast was not very good. no good restaurants options around and non in the hotel.", "title": "Beautiful Hotel, Excellent Breakfast, Let Down By One", "helpfulness": 1, "user": "LesbeAsian", "date": "March 13, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 4.0, "value": 5.0}, "id": 126057384}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We stayed two nights in this hotel and we were really happy with the standard and service. Only problem was the location a bit far from city centre but since taxis come cheap it was ok. Breakfast was included and fine without being overwhelming.", "title": "Nice rooms, bad location", "user": "Calle B", "date": "February 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 124800768}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is a review of two different trips to La Sapinette. My wife and kids and sister in law came during the June/July time frame of 2011 and stayed for four days on our last visit to VN. They had a wonderful time and the staff recognized them and were treated very very well. I had to stay back in the States to work so when I came to Asia this time for business in HK, my wife wanted to go to DaLat for some R&R. We flew in and went straight to La Sappinette again.", "title": "Wonderful stay again for Valentine week 2012", "helpfulness": 2, "user": "Powaycouple", "date": "February 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124373235}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "On this trip, (Feb 8-15 2012 and I'm still here), the worldwide economic downturn and the after-Tet season has the hotel sparsely reserved. We stay in the executive suite again this time. Since there were not enough guests, the breakfast buffet wasn't offered but you can have your own cook-to-order-as-much-as-you-want-to-eat breakfast. This is fine with us and actually seems more relaxing.", "title": "Very Nice", "user": "tan2802", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124320075}, {"rating": 3.0, "title": "Good hotel but too expensive and doesn't really cater to \"western\" tastes", "text": "Facility is again top notch for this four-star hotel. The executive suite has 1.5 bathrooms, which means that there is a half bath in one room and a full bath in the other. The bathrooms are fabulous and spotlessly clean. The staff is extremely attentive, and I would say that it has been an improvement since we first came here. Obviously they listened and made improvement.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 29, 2012", "id": 123776448}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Still not perfect but you are not paying Four Seasons rate (there is no Four Seasons in VN and even the Four Seasons slip up now and then). On past trips, when we checked in, staff offered drinks. They didn't this time and we waited a bit but a gentle question by myself brought an \"oh\" and two juice drinks were produced in short order, which helps ease the check-in process. May be drinks are no longer offered during check-in and they were just being polite in offering drinks to our party this time but at any rate, it shows that staff is accommodating and willing to please. I would say there is no attitude..simply \"please give us a second and we'll be right back with the drinks.\" Your experience may differ but we were pleased.", "title": "Wonderful helpful staff, fantastic value!", "user": "FabbyMonster", "date": "January 28, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123722561}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "This hotel was lovely and I would highly recommend it. The rooms were clean and large, the staff extremely helpful and courteous. Even though it is a bit out of the centre it is only a $3 taxi ride or you can use the hotels shuttle bus. The breakfast was also excellent and I would definitely stay here again", "title": "Fantastic hotel", "user": "Natalie S", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 123471065}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "this hotel was really nice, clean, the rooms are very spacious. the gym downstairs was a huge welcome. the hotel is out of the way, but they have shuttle services twice a day to take you into town,", "title": "more pro than con", "user": "Marcello S", "date": "January 1, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 122382865}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "we did run into some difficulties with the staff, we planned on eating in there restaurant one evening, when we got there it was closed and they said it was because of a wedding. then the receptionist said we could order room service, but this then also became a no, as there was no room service available because of the wedding. they told us that we must call a taxi to take us into town to eat, this bugged us as this hotel is a 4star, we have never heard of this before.", "title": "Excellent Hotel", "user": "Samurskty", "date": "December 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121828013}, {"rating": 5.0, "stay_parameters": "Stayed December 2011", "text": "I and my friend have stayed here 3 nights. It is wonderful time. Good weather, Hotel very nice: Clean and comfortable bed.", "title": "Spoil your sels", "user": "perle9", "date": "December 1, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 121303622}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Extremely clean and chic hotel if you are looking for a comfortable and relaxing stay. Excellent service and very professional staff.", "title": "Super Hotel", "helpfulness": 1, "user": "Glenn C", "date": "November 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 120927229}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The hotel was clean and quite luxurous. For the price this is a very good and nice hotel (a bit out of the centre - which was no problem for us). If you are looking for a cosy and charming place, however, you should look elswhere. I would sure recommend this hotel.", "title": "Good hotel", "helpfulness": 1, "user": "SaartjeUtrecht", "date": "March 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 125891657}, {"rating": 5.0, "title": "Excellent value and wonderful service.", "text": "We stayed 13 night on Jan- 2012. We had wonderful time. The Hotel was extremely clean and spacios, the staff were vey friendly, polite, and helpful. I would strongly recommend this hotel. We'll come back and stay at La Sapniette again.", "helpfulness": 1, "user": "Vanl8", "date": "February 29, 2012", "id": 125410517}, {"rating": 4.0, "title": "Fantastic room and value", "text": "Of two months travelling around the world, this was one of the best rooms we had for the money we paid. We were upgraded to a junior suite that was large, clean, well decorated and had a lovely view. The hotel was too far to walk into town and this is the only reason they don't get an excellent rating. Dalat was cool, quiet and relaxing.", "user": "Thabo_Globetrotter", "date": "February 27, 2012", "id": 125274298}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We found this hotel excellent for rooms, room service, laundry, cleanliness, comfort and general care by the charming staff. The location is out of the centre but taxis are always available and cheap. If I had to make any criticism it would be the breakfast but that's probably from a European stand point. We would definitely return to La Sapinette on our return to Dalat.", "title": "Great Value and Exceptional Service", "user": "Epicure55", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 125020478}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We were comfortable and happy in this modern, clean and spacious hotel. The reason I say Dalat is a difficult hotel town is because I think it is a less Westernized city than Saigon, Hanoi, Hue, etc - which of course makes it more interesting, and it also caters to many vacationing Vietnamese who have different expectations as to bathroom fixtures, whether there's toilet paper, food, etc. (By the way, if you're female and not yet in Vietnam, it will be helpful to do some research on Vietnamese toilet procedures, and do not leave your hotel without some toilet paper in your purse.) It appeared to me that there were just a few hotels set up for each Americans and Western Europeans, and I think there were other hotels many catering to Russians and Chinese, When I was trying to pick a hotel, it sounded like the Sofitel had seen better days, and the other leading contender had lots of steep stairs and other issues, plus they were a lot more expensive. I tried for weeks to get a room confirmed at the Dreams Hotel but although I got one email back, I never could get a confirmation. So, the specifics about this hotel. First, you don't need to use a booking website, just go on the La Sapinette website, get their email address, and write to them - it will be cheaper, more flexible and you'll get want you want. I had booked 2 nights thru Agoda, and then had to email the hotel anyway, and then I booked an additional two nights directly and it was cheaper. In our email correspondence I learned that I could only get a shower ( as opposed to just a bathtub) if I took a junior suite - which I did - at $80 a night it was not a problem. There is a hot water issue in this hotel! In our first room on the 6th floor, the hot water ran out after 5 minutes. We switched to the 3d floor after testing revealed that it had hot water for 8 minutes. After that we were careful to conserve the hot water during the shower and could comfortably extend it to 15 minutes without running out. Otherwise the room and bathroom were great. The breakfast was included and was fine. When the hotel was more full there was more selection. I think that the hotel is occasionally empty as it was our first night - we arrived late and frankly I was concerned about where I had landed us, as the street seemed dark and industrial. I was wrong. By morning, it was bright and lively, with a large store attached to the hotel, and the next day the hotel filled up, with both independent travelers and a German tour group. Mostly I want to say that the staff is extremely nice and eager to please. If you have trouble getting something from restaurant or housekeeping, just ask the front desk staff. I don't agree with comments about the location as Dalat is a large city and it's attractions are spread out, so I don't see why it would be particularly helpful to stay near the central market. Taxis are plentiful and cheap.", "title": "Recommended - probably the best bet in a difficult city for hotels", "helpfulness": 1, "user": "Bbi", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125015537}], "location": {"country": "Vietnam", "continent": "Asia", "city": "Dalat"}, "stars": 4, "variance": {"poor": 2, "average": 14, "very good": 37, "terrible": 0, "excellent": 29}, "slim_ranking": 0.177777777778, "description": "La Sapinette Hotel Dalat is a 4 star hotel just build in Dec 2009, 91 well appointed with French Art Nouveau design included 32\" LCD TV, Safe box and bath tub in all rooms, three-minute car ride from the central market.Guests can enjoy the cozy and tranquil atmosphere with 02 restaurant for Vietnamese and European cuisine, Gym, Spa and night chit chat at the Bar On the Rock."}