{"review_count": 86, "slim_ranking": 2539.0, "name": "La Veranda Dell'Hotel Columbus", "reviews": [{"rating": 5.0, "stay_parameters": "Visited September 2012", "text": "As much as we loved the mom and pop traditional restaurants and the bustling street cafe scene in the city, you do get slightly tired of the same food day in and day out. You will notice that most of the restaurants will basically have the same menu. La Veranda was a whole another notch above your typical restaurants with more sophisticated menu and ambiance.", "title": "Exquisite oasis", "user": "catseattle1", "date": "September 4, 2012", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 139425697}, {"rating": 4.0, "title": "Nice ambience on patio, good food but expensive", "text": "It almost feels like you're actually eating in one of the chapels you had just visited in Vatican city with all the art works and the fresco.", "user": "prevfromPurley", "date": "July 9, 2012", "id": 133913348}, {"rating": 4.0, "title": "A Lovely oasis in a busy district", "text": "We had the waiter recommend a wine for us. He chose a red wine from Piedmonte region for E28 and was excellent. Yes, you can get a huge carafe of house wine for E8 from most of the restaurants, but I have not run into any spectacular house wines. Also, it's a common practice to recycle wines here I was told. In fact, I had witnessed at one of the cafes that we were eating at, the waiter took a half bottle of left over wine from a table and poured it right into a anther bottle to make a full carafe, in clear view of customers...", "user": "MrSteffs", "date": "May 19, 2012", "id": 130213566}, {"rating": 3.0, "title": "Expensive for the food quality.", "text": "My favorite dish was an appetizer; 3 zucchini flowers each filled with different toppings battered and lightly fried. Each bite was explosion of different flavors and texture.", "user": "Rosecj", "date": "April 30, 2012", "id": 129114816}, {"rating": 4.0, "stay_parameters": "Visited March 2012", "text": "Our dinner came out to E140 and my husband and I each had 2 course, shared dessert, and a bottle of amazing wine. I think that's a very fair price even in American standard.", "title": "Romantic and peaceful island of calm next to the Vatican", "user": "ClairettedeLondres", "date": "April 10, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 127577748}, {"rating": 1.0, "title": "Overpriced, Surly, Inattentive Service, Mediocre Food in a Gorgeous Setting", "text": "What a horrible dining experience! After reading good reviews, we chose this restaurant to splurge our last night in Rome. What a mistake. Prices were ridiculous for bland unimaginative food and service was downright hostile. What a shame, because the setting itself is exquisite. Inside the old building, 20-foot+ arched plaster ceilings and walls are covered with beautiful old frescoes. Outside the patio is cloistered in a quiet courtyard and covered by trees. Just steps from St. Peter's Square, this could be a lovely respite from the crowds there.", "helpfulness": 2, "user": "KellyMcB", "date": "June 21, 2010", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 68141515}, {"rating": 5.0, "title": "An Island of Calm in Vatican City", "text": "Alas, the ruder than rude staff and the mediocre food, combined with sky-high prices made for an altogether unpleasant experience.", "user": "BuffCrone", "date": "April 27, 2010", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 62607486}, {"rating": 5.0, "title": "Worth a Journey Across Town!", "text": "We arrived at our appointed reservation time and were told our table was not ready, but we could sit \"upstairs\" (an empty hall above the lovely area where all the other diners enjoyed their meals, with tables either unset or set for breakfast -- also on the path to the WC) or we could wait on the (empty) patio and enjoy an apertif while awaiting our table. We cheerfully opted for the latter. We were waived in the direction of a patio table, but no opportunity for ordering apertifs arrived.", "helpfulness": 1, "user": "FoodWallah", "date": "May 26, 2009", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 30770538}, {"rating": 5.0, "title": "Beautiful restaurant", "text": "After 10 or so minutes, we were escorted to our table -- UPSTAIRS.", "helpfulness": 2, "user": "bjorgk", "date": "October 2, 2008", "id": 20565956}, {"rating": 5.0, "title": "charmirg for a romantic...", "text": "Still cheerfully making the best of things, we settled in to our view over the other diners. It was more than ten minutes before we could even get a bottle of water, and the server (the hostess) made it abundantly clear to us how unhappy she was about having to climb the stairs to serve us. WE SHOULD HAVE WALKED OUT THEN.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 16, 2008", "id": 19463872}, {"rating": 5.0, "title": "very romantic, beautiful...", "text": "very romantic, beautiful and great food.", "user": "A TripAdvisor user", "date": "January 22, 2008", "id": 15433311}, {"rating": 5.0, "stay_parameters": "Visited October 2011", "text": "We had a wonderful lunch in the oasis of calm and civility that is La Veranda. The staff was attentive and polite, and sat us at a beautiful table in the courtyard where we could enjoy the perfect October day over a leisurely and delicious lunch. We enjoyed everything, but the desserts turned out to be the hit of the meal (and we are sporadic at best in ordering dessert in the first place). As a side note, the trip to the washroom was another highlight - beautiful old building, and an interesting walk. Only complaint is that this place is apparently very high on the pigeons' list, too - they were a little too friendly for our taste and required constant shoo'ing.", "title": "Wonderful lunch by any measure, but a miracle of calm in the Vatican", "user": "vancouver-paradise", "date": "October 15, 2011", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 119333241}, {"rating": 4.0, "stay_parameters": "Visited September 2011", "text": "We had a very nice, romantic and different lunch in this restaurant. The place is worn the visit, staff was very kind and the food was good! Appetisers were REALLY good however the entries disappointed us a little. Good choice in the Vatican if you want to get away of the crowds and relax.", "title": "Excellent location and good food", "helpfulness": 1, "user": "MaiteQatar", "date": "September 18, 2011", "detail_rating": {"service": 4.0}, "id": 118282154}, {"rating": 5.0, "stay_parameters": "Visited August 2011", "text": "La Veranda at the Hotel Columbus is Rome is a bit tricky to find, but is well worth the effort! It is actually very close to the Vatican, but within a hotel. After a day of huge crowds, it provided a lovely escape to a quiet walled garden complete with fountain . The large trees and tables with white umbrellas welcomed us to the solitude. Because we were early, we had to have permission from the chef to dine. He said, \"No pasta, only salads!\", but that was fine with us. The food was delicious, the presentation was excellent, and the service personable. The basket full of assorted breads was a picture itself. We thoroughly enjoyed our dinner at La Veranda!", "title": "Lovely Escape", "user": "Sherre C", "date": "August 15, 2011", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 116774354}, {"rating": 5.0, "stay_parameters": "Visited August 2011", "text": "Just got back from Rome today and ate at La Veranda for our last dinner last evening. What a wonderful experience. Ate outdoors in the courtyard. Very private and intimate setting away from the hustle and noise. The dining experience, food, ambience-everything-was amazing. Very attentive staff, very polite! The choices are delicious-all local food. I had the lamb and my husband had the beef. Local cheeses and breads and antipasta for the appetizer. The dessert was wonderful-baked apple with ricotta cheese. Overall, a wonderful, very special experience that we will not forget. Appetizer, entree, dessert and a glasses of red wine each was 145 euros. The tip must be paid in cash!", "title": "Absolutely fabulous!", "user": "octopal", "date": "August 3, 2011", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 116235486}, {"rating": 5.0, "title": "Magic night for my Mother's birthday dinner...", "text": "We came all the way from Toronto to celebrate my Mother's birthday in Rome, and chose this restaurant. We are still talking about how great it was. The food was wonderful, the service was attentive but also invisible, and the patio area was perfect for our large (20) group which included children. And the location was perfect: next door to the Vatican and St. Peter's Square, but very cool, quiet and private.", "user": "myounder", "date": "September 21, 2010", "detail_rating": {"value": 2.0, "service": 4.0}, "id": 80498167}], "location": {"country": "Italy", "region": "Lazio", "continent": "Europe", "city": "Rome"}, "variance": {"poor": 8, "average": 14, "very good": 29, "terrible": 6, "excellent": 29}}