{"user_rating": 4.5, "review_count": 158, "name": "LaGare Hotel Venezia - Mgallery Collection", "reviews": [{"rating": 5.0, "title": "great hotel", "text": "great hotel to stay,booked room 204 which was five star.staff helpfull", "helpfulness": 1, "user": "ian_clayden", "date": "October 11, 2013", "id": 180559458}, {"rating": 4.0, "title": "Fantastic for Venice and the islands", "text": "breakfast had good choice.murano great location .easy to get to venice.", "user": "DaveMather49", "date": "October 11, 2013", "id": 180550666}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "travel tip book free city walk very informative(see trip advisor attractions)", "title": "Quiet, a 15 minute boat ride away from St. Mark's square", "helpfulness": 1, "user": "Vacationadventurer", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 180527677}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "best deal book with hotel direct/ use ryanair to treviso airport", "title": "Beautiful hotel with excellent service", "helpfulness": 1, "user": "misseskesen", "date": "October 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 180477538}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Sat at the airport reflecting on a wonderful few days staying at this friendly and modern hotel .", "title": "Beautiful Hotel", "helpfulness": 2, "user": "Carina_Fernandes", "date": "October 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 180354025}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This hotel was superb... The accomodation( a duplex room) was first class, room service sampled and it was very good standard. Definitely recommend this hotel to all. Although it is in murano and about half an hour from St Marks it is worth the boat ride.", "title": "Excellent", "helpfulness": 1, "user": "DouganNewcastle", "date": "October 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181021173}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stayed two Nights. Very Clean, Modern, well appointed and well thought out room. Free Wi-Fi works in your room here with personal device! Across from water taxi stop to Venice itself. Murano is very nice but it shuts down at 6pm as it is more of a working community that tourist area which is both good and bad depending on what you want. If you want night life or shopping, you will need to use the water taxi. There are several pizza restaurants that are open in the evening but can easily become overwhelmed if many people show up from the Hotel. Strolling around the quiet streets and waterways is very tranquil and pleasant. Only issue is that they ran out of coffee cups and silverware partway through breakfast and the staff was quite surely when we attempted to gather some. Breads, cheese & coffee were good.", "title": "Very nice Hotel..Quiet at night in area", "user": "Jake_MA_11", "date": "October 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 181017900}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "We stayed for 4 nights in a deluxe room and agree with the other posts, to summarise a great choice of hotel that you would probably pay 3 x the rate if it were in st marks square but a few niggles need sorting and I would rate as a 4 not 5 star hotel until they are addressed.", "title": "Not quite 5 star but a great choice hotel if visiting venice", "user": "atennant", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 180837952}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Our list of pros and cons as follows -", "title": "Perfect!", "helpfulness": 1, "user": "millymilner", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180802883}, {"rating": 5.0, "title": "Peace, Tranquility and Style", "text": "Pros -", "user": "mal_bath", "date": "October 12, 2013", "id": 180682944}, {"rating": 3.0, "title": "Potential to be excellent", "text": "This hotel could be perfect with a more attention to detail. Our room was unbearably hot and the staff did not seem able to rectify this. I wouldn't have thought overheating would be a problem at the end of October. We tried sleeping with the window open but got bitten by mosquitos. The only time we ate in the restaurant was a disaster - 90 minutes before we got our starter. I really didn't feel like eating by the time it arrived, having initially been given the wrong order. The whole experience was so bad that they did not charge us for the meal. Perhaps it was due to the fact that it was a particularly rainy Sunday evening but there were only 12 other people in the restaurant! We also had a transfer 3.5 hours before our flight as the hotel said the next one would have been too tight for our flight. The only alternative was to take a vaporetto at our own expense. On the plus side, the public areas are lovely. All of the front of house staff (bar, restaurant and reception) are excellent.", "user": "Sharon1506", "date": "October 23, 2013", "id": 182091755}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This is a good choice in Venice. After a day walking on the main island the peace and quite of Murano is exactly what you are looking for. The boat trip morning and evening doesnt really matter if you are using the vaporetto anyway. You can take a vaporetto directly to the site of the Biennale by the way.", "title": "A peaceful retreat from crowded of Venice", "user": "CDY1", "date": "October 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 181846341}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "The actual building and interiors of the hotel are very lovely. However the hotel needs a good manager to sort out the staff. We had dinner in the hotel - there is only one other restaurant open in the evening anywhere close to the hotel. We went in when it opened at 7:30, by 9:30 we had eaten our main course, ordered dessert and coffee which had not appeared. We cancelled the desserts and coffee and were told that to pay we had to go into the bar! The breakfast in the morning was ok. It was in the restaurant. The hot food was on a table with the cabling to the plug point looking very worrying from a health and safety point of view as it was hanging down. Also the cover for the cable caused a problem - I saw one person trip over it. All in all it needs work to be a good hotel.", "title": "Needs some work", "user": "Louise H", "date": "October 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 181840681}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "We stayed at the Lagare for 3 nights before and 2 after a Greek cruise. It is a beautiful boutique hotel, with impeccable service. The breakfast buffet is extensive and served in a beautiful open air pavilion, providing a wonderful start to every day. We also enjoyed the local flavor by spending days in Venice and evenings in Murano. Most of the crowds leave in the late afternoon and it is delightful strolling the walkways as families come out for the evening. Many of the restaurants are family operated and you may be served by several generations of one family.Delightful.", "title": "Wonderful Experience", "user": "justhavinfun1111", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181840434}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled solo", "text": "The hotel also provides a complimentary shuttle to & from the airport, cruise ship terminal and St Marks Square. The was an invaluable service and saved us a great deal of money.", "title": "Few problems but thoroughly recommend", "user": "aoz48x", "date": "October 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 181826132}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "This is a very nice new hotel. The staff are very pleasant and the breakfasts excellent. However, the hotel is currently surrounded by a construction site and work starts at 7.30 and finishes at 5pm. This will not last forever and probably accounts for the very good deal we had there.", "title": "Visit spoilt by ludicrous issue of airport transfer.", "user": "vagabondneurosis", "date": "October 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 181798923}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "The biggest annoyance was the intransigence of the reception staff over the issue of the free transfer to the airport when they insisted we had to go to the airport 3 1/2 hours before our flight which we refused to do. Another couple was similarly affected and the matter went on for 2 days with our being promised by a manager that the problem would be resolved but it was not. There was a perfectly acceptable transfer at a later time which would still have got us to the airport in plenty of time but the hotel said the transfer company insisted we take the 7.10 am water taxi for our 11 am flight. In the end we went at our own cost on the Alilaguna public transport at a time of our choosing. All aggravating and unnecessary.", "title": "Beautiful Hotel in Murano", "helpfulness": 1, "user": "kitty1413", "date": "October 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181606454}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "My husband and I stayed at this hotel for 3 nights and had a wonderful time from start to finish.", "title": "Hotel LaGare Murano Island Italy", "user": "dpessex", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181346864}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Prior to arriving I emailed the hotel just to clarify how to get the free shuttle from the airport. They were very helpful and this process was very easy. I would totally recommend contacting them in advance to arrange this. We travelled by boat with a few other guests to the lovely island of Murano. The boat stops just outside the hotel and is literally a few steps from the entrance. Booking in was very easy and we were lucky enough to get an upgrade. The room was gorgeous and included an upstairs bedroom with a balcony. The view wasn't great but to be honest we didn't stay inside very much. We had a mini bar but no tea or coffee facilities, which we knew before hand so wasn't a big deal for us but might have been for other guests. The staff were very good and cleaned and tidied every day. We had a cake left for us and some sweets each day together with a weather forecast for the next day which was a nice touch. The hotel lobby and bar area was fantastic as you would expect from a new hotel. The sound proofing works as this was the quietest hotel we have stayed in.", "title": "Just Loved It!", "user": "brambleyone", "date": "October 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 181345467}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "The free speedboat ride to Venice is great but make sure you book early the day before otherwise you might not get an early time. Also the latest time to come back to Murano is 6.45pm. If you want to stay later its very easy to catch the vaporetta ( 4.2) and only costs 7 euros.", "title": "Great Hotel on Murano", "user": "Soph72", "date": "October 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 181116663}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 2, "average": 9, "very good": 40, "terrible": 0, "excellent": 107}, "aka": "LaGare Hotel Venezia - Mgallery Collection Murano, Italy - Province Of Venice", "slim_ranking": 1.0}