{"user_rating": 5.0, "review_count": 47, "name": "Lagoon Villa Apartments", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We stayed in the Octopus Apartment over the New Year and found the apartment to be more than we hoped for. The apartment is spacious, spotlessly clean, modern and well equipped. The garden and outdoor areas likewise. Tha local shop is only a minute's walk out of the back gate and the taxi rank for a lift into town just 2 minute's walk. Fi and Toby, the owners, are so friendly, helpful and welcoming-also Fi's parents who were helping out whilst we were there. All emails prior to our visit were replied to very promptly and booking very easy and straight forward. Transport for our transfers to and from Sharm airport to Dahab was arranged by Fi and could not be faulted and a reasonable price too. Fi and Toby are very knowledgable about the area and more than willing to give advice and help with arrangments for any excursions.", "title": "Fantastic Apartment!", "helpfulness": 1, "user": "HolidayHunter64", "date": "January 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94217685}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "This is our 5th visit to Dahab this year and we love the place. It is so peaceful and laid back if a nice quiet holiday is what you are seeking, but there is also all the watersports on hand, if you wish, which Fi and Toby can help you with. There is nothing more relaxing than sitting in one of the restaurants along the sea front. \"Shams\" is our favourite restaurant where we have spent many an hour or 3 at a time just having a quiet drink then maybe a meal. The lads who work there are so friendly and never hassle you to hurry up and leave, even after 4 hours of being there just chatting with friends.The Egyptian people we have met are so friendly, pleasant and polite. Yes, they will ask you to come and have a look around their shop because that is their living, but a polite refusal, if you do not wish to browse, is all that is needed, to which is normally replied \"OK. Have a good evening.\"", "title": "best apartment we have ever stayed in", "helpfulness": 1, "user": "alithom65", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93425686}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "This was the first time we have stayed in an apartment in Dahab rather than one of the major hotels, but we have found a little bit of paradise in the Lagoon Villa Apartments and shall certainly be staying there again, hopefully very soon.", "title": "Perfect house / appartments near the Lagoon in Dahab", "user": "pulmareis", "date": "December 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89766211}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Thank you, Fi and Toby, for providing us with wonderful accommodation and for making us feel so welcome.", "title": "A perfect place to stay in Dahab", "user": "andyo_tadvisor", "date": "July 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69525513}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We spent a week in the Octopus Apartment in October 2010 and couldn't have wished for a better place to stay. The apartment was modern, fresh, comfortable and a short walk from the beach and supermarket. The gardenwas beautiful and the plunge pool was there if needed. The owners Fiona and Toby were there if we needed them too and gave us lots of advice on trips. Masbat was a 5 minute taxi ride so we went most evenings for dinner which was so cheap - there is n need to go all inclusive to Dahab!!! Will definately go again and have recommended it to all our friends.", "title": "Perfect spot for independent travellers", "user": "rbarbs", "date": "June 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 67657218}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We spent two weeks in the larger of the two appartments (seahorse) in April with two children and a baby. Toby and Fi were amazing, really friendly and especially helpful and supportive when we were stuck there a few extra days due to Volcano ash problems. I would recommend it for family with kids without hesitation. The garden is really safe for them to run around , the so called Jacuzzi is big enough to be used as a pool by them. The shop is only 100 meters away and has everything you might need (even nappies, wipes, baby milk and food). We used the beach at Panda Hotel every day. They charge 25LE per adult (nothing for kids) and the food in the cafe is great so we had lunch there everyday. The beach attendant was really friendly and played with our kids most of the time. We also let them use the playground at the next door Ibeya hotel where they made friends with other kids. Fi and Toby's recommendations for restaurants were all really good. All in all, we thought that Bedouins and Egyptians there were really chilled, loved kids and were very welcoming. Even shop keepers were friendly and not trying too hard to get us to their shop. Taxi drivers really friendly as well. I can't fault anything and am going back next year.", "title": "amazing holiday in Dahab", "user": "mandagout1", "date": "May 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65003540}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We had a wonderful time at the Lagoon Villa Apartments over March.", "title": "Perfect place to stay with friends or familiy", "user": "mariomilhazes", "date": "March 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60002536}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We went 3 friends for 7 days, just for windsurfing and stayed at the Octopus apartment, which was very comfortable, clean, modern, and very well decorated and there’s a large patio area so you can eat outside your breakfast watching the wind. In the kitchen we had all the stuff to cook and take breakfast.", "title": "A peaceful oasis a short stroll from the beach", "user": "DevonBuster", "date": "February 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57018435}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "On the day we arrived we had a starter kit (bread, milk, eggs, water, coffee, jam, butter, etc) so that we could eat something on the arrival, fantastic surprise!!!", "title": "Absolutely wonderful apartments", "user": "PJA_10", "date": "February 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55695579}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with friends", "text": "We picked this apartment through googling the internet we found the site www.dahabholidays.com and sent a e-mail that was quickly replied by Fiona.", "title": "An amazing Oasis in windy Dahab", "user": "windsmurfer", "date": "January 17, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53693700}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "After a day busting big moves on the water there really was no better place to go back to than the Lagoon Villa Apartments. My girlfriend Andi and I found this gem of a place on the internet and it more than lived up to expectations. We had previously travelled together to Dahab and stayed in a number of the generic, German fiddly clad large hotel complexes, which whilst they do what they say on the can, offer little more than a convenient location and extremely overpriced water and beer. We stayed in the smaller of the two apartments (Seahorses I think) and this was exceptional. We had a double bed, and a back up single as a spare. This was not your typical backpacker Egyptian accommodation, more a western oasis situated just three or four minutes walk from the beech front. Walking in from the dusty street into the private enclosure you are greeted by green grass (imported from Cairo!), flora, fauna and an extremely friendly little kitten (unoriginaly named \"Puss\") and a sun heated jacuzzi/plunge pool which is fantastic for cooling yourself down in after a few minutes lying in the sun. All of this and a western style bathroom (we had two showers and a bath!) , a kitchen which was small but perfectly formed and functional and free wireless internet! If you want to save yourself money, there is a supermarket within 1 minutes walk of the apartments so you can cook, and also an off license (yes, in Egypt!) The beers and the water being a fraction of the price charged by the behemoth hotels on the front.", "title": "A remarkable oasis of beauty", "user": "windyadam", "date": "December 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 50646099}], "location": {"country": "Egypt", "region": "Red Sea and Sinai", "continent": "Africa"}, "variance": {"poor": 0, "average": 0, "very good": 0, "terrible": 0, "excellent": 47}, "slim_ranking": 0.1, "description": "The Luxury Lagoon Villa Apartments offer brand new, modern, and unique self-catering accommodation minutes walk away from the main hotel area in the Lagoon.Relax in the secluded grassy gardens with outdoor Jacuzzi or on your private terrace. Listen to the birds and the wind in the tree's on your wooden sun bed with comfy cushions in this tranquil retreat. Right by the main windsurfing and Kitesurfing Lagoon."}