{"user_rating": 4.5, "review_count": 437, "name": "Lainston House Hotel", "reviews": [{"rating": 5.0, "title": "Wonderful Hotel and great staff", "text": "My husband and I have just returned from a two night stay at this beautiful hotel. It's in a wonderful setting on top of a hill with amazing views. Sophie, on reception, booked us in and she was most helpful and charming - a great asset to the hotel. The young man who took us to our room was also very friendly and helpful. We started our stay in a junior suite called Walnut but unfortunately when I drew the bath water there was a problem. After phoning reception the manager arrived and because of the inconvenience we were moved to Hornbeam. This is a beautiful room on the ground floor. There was a most comfortable four-poster bed and plenty of space. The bathroom was amazing - larger than our lounge at home. There was a jacuzzi bath and separate rain shower. I have attached some photos. The amenities were excellent too. Everything was very clean and well maintained. We ate in The Avenue restaurant both nights. The food was very good but we found the menu very limited. If we had stayed another night I think we would have been struggling to find something we liked. Breakfast was served here too. There was a good selection of cereals and fruit. We had cooked both mornings. I was disappointed with my mushroom omelette the first morning. It was very flat, dry and leathery! The bacon and eggs the second morning were wonderful. Overall this is an excellent place to stay and we hope to return again. Thank you.", "user": "Speges", "date": "April 29, 2013", "id": 159150206}, {"rating": 3.0, "title": "Glad we stayed, but SERVICE not High Priority", "text": "This is a very nice place as we stayed on way to take a cruise from Southhampton to USA. While I wish we had another day we did not. The accommodations are very nice and the reception great. That said the service in restaurants was lacking courtesy and friendliness in general. Way too formal of service for my taste. Service was incomplete at dinner. No mention of coffee, after dinner drink. Never saw server after dessert was delivered.", "helpfulness": 1, "user": "Richard N", "date": "April 26, 2013", "id": 158842555}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Same with the high tea. The product was very good, but service lacking.", "title": "A beautiful hotel in glorious grounds", "user": "realesclarmonde", "date": "April 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158770424}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "In my opinion the service needed to be much better but the product was great.", "title": "A lovely afternoon tea", "user": "BunnyPalmer", "date": "April 20, 2013", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 158309487}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Positives: the kitchen garden and the grounds staff was amazing. We got a tour to visit the owl...very cool. Provlems were mostly food service not hotel or grounds or reception.", "title": "Stunning in every way!!", "helpfulness": 1, "user": "Biztwig", "date": "April 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 158260833}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Lovely picturesque venue and setting for a wedding but don't be fooled as we were! We were assigned a lovely wedding coordinator whom we met on several occasions, and who was prompt in replying to correspondence. We felt we could trust Lainston to deliver the details on the day as they had reassured us. Perhaps the first warning should have been when we were told the wedding coordinator - the only person we have been in touch with from the hotel - would not actually be present on the day of the wedding.", "title": "Don't get married here - they promise the earth & then don't deliver", "helpfulness": 5, "user": "renford", "date": "March 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 2.0}, "id": 156175032}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Come the day - a very different story transpired. No one had a clue about very much at all. From chair covers to flower arrangements, gift tables to receiving lines, decorations to drinks selections, we had to send members of our family to trouble shoot and supervise everything, meaning they could not enjoy themselves. They even had the audacity to print out some bits of paper to 'prove' to us that we had not ordered such & such, a complete waste of everyone's time and for which they apologised afterwards for getting it all wrong, but too little too late. The worst part was that outside the temperature was subzero, which was unusual for a March wedding, so when we came inside to try to take a few indoor shots, we were made to feel we were completely in the way & were asked to move along. We missed the photo opportunities with a lot of friends & family who had travelled a long long way abroad to be with us on our special day.", "title": "Fabulous hotel", "helpfulness": 1, "user": "happyholidaymaker100", "date": "March 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155527758}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "We had been warned by other couples & read other reviews that were lukewarm about weddings at Lainston, but were so taken with the venue that we thought we would take a chance. We still had a lovely day seeing our family & friends but could definitely have done without the extra stress created by lack of care and interest displayed by some of the staff involved with our wedding.", "title": "Magical wedding venue especially in era of climate change!", "user": "gypsyjumble", "date": "March 18, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154977248}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "We stayed at the Lainston House for a nice weekend break and, from the moment we walked through the door, we had a wonderful time. Welcomed before we had checked in, a beautiful, quiet and luxurious room with a fantastic bathroom, we enjoyed a delicious meal, a good night's sleep and a lovely breakfast. I can't recommend it highly enough.", "title": "Comfortable relaxing retreat less than 2 hours from London", "user": "Anthony E", "date": "March 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 154626002}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "From start to finish my daughters wedding was perfectly arranged starting the eve before to deck out the barn for the ceremony until an indoor hawk display on the day after . The weather was atrocious and it was wonderful to have log fires and sumptuous surroundings for such a lifetime event. The staff were so helpful and professional yet made you feel like you were part of a family .", "title": "Fabulous mini break", "user": "MissJudith", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154478056}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Lainston House is an amazing venue for a wedding - a lovely country house set in beautiful grounds a few miles outside Winchester. We were very taken by the place and the attentive service from the wedding coordinator during the run up to the day. However, there are a number of points that would lead me not to recommend the venue for a wedding:", "title": "It's just another wedding to them - terribly disappointing", "helpfulness": 1, "user": "NMay1234", "date": "April 9, 2013", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 2.0}, "id": 157185853}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "1. On the day the Hotel had organised the catering manager to coordinate the day who didn't really seem to know our plans and didn't seem to be around to help when questions arose.", "title": "Fabulous wedding!!", "user": "helen_j_8", "date": "April 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157099932}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "2. As part of our wedding package from the Hotel, all the chairs in the ceremony were meant to be covered in beautiful sashes with pink bows. The Hotel had not organised this and it was not discovered until the morning of the ceremony which led to an unnecessary and stressful panic a couple of hours before the guests were due to arrive! They initially tried to suggest that it was our fault even though we had discussed it with our wedding coordinator at the previous meeting 2 months earlier and had been charged for it! They then tried to provide covers at the last minute which clearly did not happen and delayed the start of the service whilst our guests were hoarded elsewhere and were not able to enjoy the music from the harpist we had playing in the Dawley Barn. Meanwhile the registrars were stressed as they had to be elsewhere for another wedding after ours, no one was happy.", "title": "Wonderful!", "user": "JPRKent", "date": "April 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156687034}, {"rating": 5.0, "title": "Splendid weekend break", "text": "In the end the ceremony went ahead without the chair covers which was not the image we were after, and in our view looked quite ugly as the chairs were tattered, felt covered function room / office suite chairs. Subsequently, all of the ceremony photos were taken with these horrible chairs in view.", "helpfulness": 1, "user": "allydiver", "date": "April 1, 2013", "id": 156225872}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "They did get chair covers fitted in time for the afternoon tea ' ceremony. It was obvious that the covers were done in haste, as they were mostly wonky and the bows were untidy and messy. They offered a partial refund, which in their view more than adequately compensated us for the disappointment and stress caused.", "title": "Wonderful memories, elegant venue for a wedding", "helpfulness": 1, "user": "Elizabeth C", "date": "March 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 156179236}, {"rating": 3.0, "stay_parameters": "Stayed April 2013", "text": "Rooms are not generous for the price. Our view was just over roof tops, not good as it is set in 65 acres. The taster menu was a little bit hit and miss. Generous quantities of drinkable wine. The beef brisket dish was good. The star was the article combination. Certainly enough food to fill even the hearty up, but the combinations were mostly well presented, but bland.", "title": "Nice setting, great service but the food let it down", "helpfulness": 1, "user": "Exploratorydiner", "date": "April 18, 2013", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 158081597}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "We have just returned from a really special night away at Lainston House and I felt compelled to write this review given our experience at this luxury hotel seems to improve each time we stay.", "title": "Lainston House - A real treat!", "user": "TristanMS", "date": "April 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157573096}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "It is a perfect escape for the family and my wife and our two children 7 and 5 years were made to feel very special from the wonderful welcome (full valet service meant we were sat down for lunch 2 minutes after we had pulled up outside the front door!) to the friendly chats in the kitchen garden with the resident Falconer, Billy!", "title": "Beautiful country hotel", "user": "mh2111", "date": "April 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 157315129}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Detail such as the great assortment of wellies and bikes for you to use and really great facilities in the room (with really superb room service to boot) means you will want for very little during your time at the hotel...", "title": "Superb hotel. Great service.Brilliant room....", "helpfulness": 1, "user": "Martin W", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157230948}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "The restaurant is absolutely brilliant with the quality of the produce and presentation unrivalled! The chef even adapted dishes on the already really comprehensive and top end children's menu to suit taste and our two young boys were made to feel very important in the grown up restaurant!", "title": "A truly special hotel", "user": "tracyandgus", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157230765}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 19, "average": 39, "very good": 65, "terrible": 3, "excellent": 311}, "aka": "Lainston Hotel Winchester", "slim_ranking": 0.2, "description": "Drive through the gates of Lainston House Hotel, up the winding drive, you will enter a world where historic charm and contemporary elegance blend seamlessly. This charming 17th Century country house is a luxurious hotel, encapsulated in 63 acres of Hampshire parkland. A peaceful drawing room, sumptuous individually designed bedrooms and food created with passion. Minutes away from the historic city of Winchester and only a short drive from Salisbury, Stonehenge and the New Forest."}