{"user_rating": 4.0, "review_count": 336, "name": "Lake Naivasha Sopa Resort", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We stayed at this Lodge as a part of our trip around Kenya. Just to start with, this was the poorest accomodation with the careless service in all the trip. As per the room itself and the service, I wouldn't rate them more than those of a 3 star/budget hotel. We tried \"Ashnil\" in Samburu and Mara, \"Flamingo Hill\" in Nakuru and \"Kijani House\" in Lamu, and the Sopa was, by far, the worst of them. It is not in the same range, although the prices are as high as in the previously-mentioned accomodations. The main purpose of this trip was to \"mystery shop\" around Kenya, in order to know the country deeper, as we run a travel business. This one we immediately marked as not to recomend to honeymooners (as there is not a value for money), and use only in the case there is no room elsewhere. In any case, it was was ok as far as we didn't have any problem: things were smooth, and the hippos around were charming in some way.", "title": "I RUN A TRAVEL BUSINESS, AND WOULD NEVER SEND ANY CLIENT TO AN ACCOMODATION RUN BY SOPA LODGES", "helpfulness": 4, "user": "Romy_Fog", "date": "January 18, 2011", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 93523574}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "However, everything twisted when we DID have a problem. From my experience, this is when we you really can test whether a hotel is good or not, and this one failed. What happened is that we were stolen some money from my hand bag by the staff of the hotel. This can happen anywhere, indeed, but what makes the difference is how the management reacts after such a circumstance. In this case, they didn't respond. They didn't want to call the police, they treated us as if it was us the criminals (even registrating all our luggage!), and they refused to provide us with any compensation (despite they recognized their responsibility in the police statement). It took us 8 long hours to fight all the impediments they put in our way, in order to prevent us form getting a signed police statement. Only after our Embassy was involved they allowed us to go further, but then the manager simply vanished inside her office, without taking any care of the issue. Not even asked for excuses, or offered some water... Desperating. When we finally completed the police statement and left the hotel after loosing the whole day, there was no one from The Managemnet there... but the members of the staff that we identified as suspicious were working business as usual, having the chance to backslide with other customers. Unbelivebale. Our travel partner in Kenya, as well as the Staff from the Embassy, contacted the General Manager of Sopa Lodges for Kenya and Tanzania, who refused to assume any liability, and refused even to apologize, either by speaking to us, or by compensating us somehow. They really had no immediate interest, as far as the accomodation was pre-paid... Therefore, this is not a problem of their Naivasha Lodge only: it is a general problem of the whole Sopa Lodges chain. After this I would never sent a client there (even if there's no room elsewhere in Naivasha, I would add an extra night in any other place), and so I would recomend all my colleagues", "title": "Renovation + new chef needed, but Hippo & Co compensate", "user": "TDBBerlin", "date": "January 15, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 92993817}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The lodge is located at the Lake Naivasha (Rift Valley, 85 km outside of Nairobi, to either Nakuru or Masai Mara). We stayed there for one night on our way back to Nairobi. There are several resort/lodges around Lake Naivasha, this one is run by an Indian. The style is sort of old english /out of Africa with dark furniture and a huge bar / restaurant area. Open fireplaces are there, which is nice to sit there before/after dinner. It is less than 10 years old, but unfortunately needs urgently two things: 1. a big portion of maintenance / renovation (poolside, towels, plates, bathrooms etc.) and 2. a new chef. You only get full board in this lodge and wish you could go eat somewhere else. It was the worst food we had in two weeks time in Kenya. Its buffet form and nothing meets international standard. However the staff is very nice and trying its best to please you. When you want to leave your room at night you have to call security. The reason: 1 or more Hippos might just pass your hotel room. At night the hippos come out of the lake looking for grass to eat. To be honest, its very lovely to see a hippo walk by on his way for food. This is the good news about the hotel and the location. The security is extremely friendly and trying their best to show you the animals and explain their habits. During daytime you might wanna go with security down by the water and see many more hippos, waterbucks, dig digs, monkeys giraffes, birds etc. It is not a zoo, its nature, wild and the animals are just walking through the backyard of the hotel.", "title": "Great Location, Great Staff - Hippos on your back door - what more could you want!", "user": "Giovanna R", "date": "January 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92557787}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This was our first safari and this place exceeded all expectations. Beautiful, peaceful lodge. Animals everywhere - we went on a walk and were amazed at every step.", "title": "Fantastic Lodge and amazing accommodation", "user": "loubylouportishead", "date": "January 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 91505362}, {"rating": 3.0, "title": "Adequate but not great", "text": "The only thing I can say on a negative note is that I would of liked the restaurant to be a la carte as opposed to a buffet. But honestly, go here - enjoy the scenery, the lovely people. Great Vacation.", "user": "fenmen", "date": "December 14, 2010", "id": 89830210}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed one night and wish it had been longer. The grounds are incredible. Our beautiful room on the second level had a private balcony overlooking meadow. Giraffes, zebras and hippos on the grounds. Tons of monkeys. Gabrielle, a security guy, took us on a nature walk that was amazing. We got within five feet of giraffes. Took a boat ride on the river and got chased by hippos. Food was pretty good. Stayed in #46. You need to call for an escort walking after dark b/c of hippos – they’re everywhere. On way back to our room after dinner, security guy took us to look at hippos, and we saw a mom/dad/baby hippo. This lodge should put a webcam on its site – there’s always something to see. No bugs while we were there. Loved it.", "title": "Gorgeous locations and rooms, wonderful staff", "helpfulness": 1, "user": "MaineIzzy", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 102676696}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Stayed for 1 night at the Sopa as part of my safari. The lodge felt huge and having come from the Asnil Camp in Samburu felt a little impersonal.", "title": "Massive rooms bit slow at the bar!", "user": "doestravel", "date": "March 30, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 102134098}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "The rooms are massive and very comfie beds with everything you need, though felt a little faded. The food however was fantastic, though it was only a buffett, it was hot and the selection was great.", "title": "sitting outside our room watching giraffes in the grounds, wonderful!", "helpfulness": 1, "user": "lynn47england", "date": "March 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98860055}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The lodge has a very grand and spacious feel and whilst at the bar I looked out to see a baby hippo walking around the massive grounds.", "title": "A very nice hotel", "user": "JumpinJackFlash60", "date": "February 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 98125521}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "The lodge I think was full when I was there and it was a little hard work getting served at the bar.", "title": "Fantastic. Readily recommended.", "helpfulness": 1, "user": "HappyTraveller234", "date": "January 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94888561}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "First hotel on are Travelsphere safari and Mombasa stay .What a lovely surprise lovely room great grounds.Where told too ring for guard to go to dinner we found out why 7ft in front of us was a hippo grazing .good choice of food the tusker beer good.Lake naivasha", "title": "lovely hotel", "user": "plantpuss", "date": "December 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89064605}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "bout trip great don't forget to put sunscreen on its get very hot on water Enjoy.", "title": "Needed more days", "user": "DrandDr", "date": "December 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89050198}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Had a long flight from the UK, a long drive from Nairobi and we all just wanted to sleep. We were offered a trip on Lake Naivasha before we got to the lodge, 2500shillings pp approx £20pp. What a wake up!!!!. A 2 hour boat ride on a fibreglass canoe with an outboard motor. This is the place where \"Out of Africa\" was filmed and was it worth the money. We saw Hippos carrying babies on their backs, flocks of Pelicans and hundreds of other birds including Storks and Ibis. Shoreline animals included, Eland, Water Bucks and Giraffe. Our boatman went across water hyacinth to the shore and someone threw a bag to him. He went to the shoreline and was calling and whistling to nothing it seemed. He opened his bag and threw a fish into the water and a beautiful Fish Eagle swooped from the tree and scooped it up. We couldnt see it but he knew where they were. The trip was fantastic and got everyone buzzing again.", "title": "Stunning rooms and grounds", "user": "yanhLondon_England", "date": "November 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 87459596}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "On to the lodge then for lunch. The lodges/cottages back onto the Naivasha park. A lovely pool and gardens with Colobus monkeys playing in the trees. We had a rest then dinner watching the sunset. They light fire pits in the communal areas as the nights can be a bit cold. The dinners are buffet style with a wide choice and bbq selection.", "title": "Another wonderful Kenyan experience!", "user": "Tom_Goshawk", "date": "November 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 86766928}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The lodges are large with 2 double beds, a balcony or downstairs floor to ceiling viewing area with a curved settee to watch the wildlife. The bath/basin/toilet water will come out anything from lager colour to gravy colour. Dont worry, it is safe and hot just a bit unpleasant looking and will clear after a bit.", "title": "Amazing place to stay among wildlife", "user": "EssJayWhy", "date": "October 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83581299}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "I stayed there overnight on Saturday 18th September 2010. Within my group we had two upstairs rooms (with double bed). The rooms as you have probably seen are housed within circular structures each containing 4 rooms, two up stairs and two on the ground floor. After having a boat ride on Lake Naivasha before arriving and seeing the Hippos etc the hotel was a fifteen minute drive away.", "title": "Great Over Night Stop in Naivasha", "helpfulness": 1, "user": "gb73_travel", "date": "September 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 80953525}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "A friendly welcome, then escorted to our rooms, we had a few hours to relax before dinner was served (at 7.30). The room was pretty big with the upstairs units having a balcony looking out onto the lovely grounds where we later saw waterbuck march in their droves to chomp away at the grass.", "title": "Absolute beautiful", "user": "Mufiin", "date": "September 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 80822066}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The room had a large bathroom. Also a safety deposit box where you can set your own code to secure any valuables was available housed in the wardrobe. Also the room had a tv with cable channels by the looks of things as the day I was there (Saturday) you could watch three English Football matches live back o back if you so wanted.", "title": "unique stay!", "user": "mimi07Naples", "date": "September 19, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 2.0}, "id": 80144861}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "I spent a couple of hours in the lobby area using the wifi connection (via my phone). The password was passed onto me straightaway once I asked a staff member and connection was made. The distance back to the rooms appeared to be too great for the wifi to work there.", "title": "Good choice", "user": "kauris", "date": "September 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 79907432}, {"rating": 4.0, "title": "Good design, great services. :))", "text": "From the lobby area there is a bar at one end, with the restaurant at the opposite end. Dinner was enirely a buffet / help yourself affair which actually had really good food remembering that you are dining with 80 - 100 other people. The night I was there, the bbq was operating outside too. I thought that the choice was very extensive, actually the widest choice of food that I came across anywhere during my stay in Kenya.", "user": "NuhnP", "date": "September 16, 2010", "id": 79790834}], "location": {"country": "Kenya", "continent": "Africa", "city": "Naivasha"}, "stars": 3, "variance": {"poor": 12, "average": 40, "very good": 112, "terrible": 8, "excellent": 164}, "aka": "Lake Naivasha Sopa Hotel", "slim_ranking": 0.2}