{"review_count": 24, "slim_ranking": 19.0, "name": "Lake Hotel Deli", "reviews": [{"rating": 4.0, "stay_parameters": "Visited June 2013", "text": "Typical quick lunch- but it was super fast! Staff was kind, courteous, quick. Beautiful lake views- worth it.", "title": "Good lunch", "user": "sm1696", "date": "June 30, 2013", "detail_rating": {"value": 4.0, "service": 5.0}, "id": 165813840}, {"rating": 4.0, "title": "Understaffed but good", "text": "We ate several meals here and found the staff to be helpful and responsive - as well as overworked. it seems that a number of people were looking for an alternative to the overpriced dining room and this was the only alternative. The selection was reasonable and the service reat give the limited staff.", "user": "bucskin", "date": "May 30, 2013", "id": 162373201}, {"rating": 1.0, "title": "Not good", "text": "We went here during our stay. They were busy as heck, so our wait for our food was about 25 minutes. I don't think they had enough help. When I received my food, my order was wrong. Pretty disappointed so how expensive the menu was!", "user": "timmyt85", "date": "May 27, 2013", "id": 162052274}, {"rating": 4.0, "title": "Great chili", "text": "Thick, flavorful chili with a bit of kick. Delightful staff working the deli. It was served in paper cup so it was pretty casual but the portions was good for a midday snack.", "user": "concordia39", "date": "May 22, 2013", "id": 161462734}, {"rating": 3.0, "title": "Very Basic Snack", "text": "Just expect a basic sandwich ( kind of like a simple version of Subway). Handy for grabbing one to take out for your own picnic in the park, but no it won't impress you beyond the fact it is convenient.", "user": "CodiChina", "date": "April 16, 2013", "id": 157937584}, {"rating": 1.0, "title": "Soggy Sandwiches That Are A Day Old", "text": "The first place we ate when we got to Yellowstone was at the Lake Hotel Deli. I had looked at the menu ahead of time, and thought we would be ordering fresh sandwiches like at Panera or at least Subway. Nope, these sandwiches were pre-made and wrapped in plastic wrap. My husband asked the girl working there which she like best, and she told us she has never had one, and the sandwiches we were getting were from yesterday, and told us she was busy working on the next day's sandwiches. That is exactly what they tasted like. They were soggy and terrible, and about $9 each. This was a horrible waste of money, and we never ate at a deli in Yellowstone again. Go for the cafeterias for warm homestyle food, and the grills for burgers.", "helpfulness": 1, "user": "KerenElise", "date": "October 13, 2012", "id": 142740750}, {"rating": 2.0, "title": "bored", "text": "not much to say,not much there.looked in to see what they had and was disappointed.maybe if you are very hungry and to tired to try the cafeteria.", "user": "stevemexico", "date": "September 10, 2012", "id": 139905697}, {"rating": 5.0, "title": "Great Pick Me up", "text": "After our hike around the Canyon Rim where we were rained on, this little nook was a nice rest stop to get a coffee and some ice cream. Not crowded at all.", "user": "ppmomofive", "date": "August 10, 2012", "id": 136833121}, {"rating": 3.0, "title": "Good selection for a quick bite", "text": "Located just off the main lobby on the lakeside. They have a good selection for breakfast, lunch or a light dinner. They also have sandwiches and other items for take along if you want a picnic lunch. Prices were reasonable and service was good. They have a sandwich bar and will make them to order.", "helpfulness": 3, "user": "jcarmello", "date": "June 16, 2012", "id": 132093073}, {"rating": 4.0, "title": "Nice place for a quick lunch", "text": "We grabbed some sandwiches at the Lake Hotel Deli June 08 and were very pleased with the quality. The sandwiches were quite large and were very good. Price was reasonable. The deli doesn't have tons of selections but what it does have seems to be good choices.", "helpfulness": 4, "user": "Bucketfoot", "date": "June 11, 2008", "id": 16865453}, {"rating": 1.0, "title": "Grotty little works canteen facimile", "text": "We thought this might be useful for a quick bite. A brief glance at the crummy little uninviting eats area and the unappetising menu quickly made us change our minds.", "user": "nataliatiyad", "date": "August 5, 2013", "id": 170797017}, {"rating": 5.0, "title": "Great coffee, scones", "text": "Friendly staff, great coffee (free refills all day!) good scones. Pricey, but everything in Yellowstone is.", "user": "SuburbMom_2", "date": "August 1, 2013", "id": 170371484}, {"rating": 3.0, "title": "Good for a quick lunch or simple dinner", "text": "Located in the hotel, this was a good choice for a quick sandwich or bowl of chili. The food was fresh and tasty. We had sandwiches and chili a couple of times and liked the food. It was never busy when we were there so service was very good.", "user": "J_MORtravelor", "date": "July 24, 2013", "id": 168921283}, {"rating": 4.0, "title": "Great breakfast stop", "text": "A good place to stop for coffee and a snack; we could sit inside or outside on the patio and have a great view", "user": "DukeBlue80016", "date": "July 20, 2013", "id": 168257656}, {"rating": 3.0, "title": "OK for a quick lunch", "text": "This deli is OK for a quick lunch to take while traveling around the park. There are only few choices. They will make the sandwich to order if you request.", "user": "sjerzelady_50", "date": "July 16, 2013", "id": 167828794}], "location": {"country": "United States"}, "variance": {"poor": 2, "average": 7, "very good": 6, "terrible": 5, "excellent": 4}}