{"user_rating": 4.0, "review_count": 356, "name": "Lake Manyara Serena Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Just returned from a 5 nights safari in Serena Lodges in Tanzania, including one night in Lake Manyara. Serena hotels are the best places to stay when doing a safari (except for the ultra-exlusive tented lodges), however the prices they charge (around 650$/night in high season) isnt worth the money. The good things are the view from every corner of the hotel even from your terrace and the swimming pool that is looking directly into lake manyara! The food is buffet style and is good, the rooms are clean but very basic.", "title": "Best view, 4 star hotel at Palace Prices", "helpfulness": 11, "user": "Samuel-D", "date": "September 2, 2006", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 3.0}, "id": 5762697, "likes": {"liked": "— The view"}}, {"rating": 5.0, "title": "A beautiful place", "text": "An absolutely beautiful place! The pool was lovely with excellent views. Our room was very nice and we experienced excellent service as we did in all the serena lodges. However, for senery and the quality of the room this one was our favourite lodge. However, the park although beautiful was not our favourite game drive (VERY buisy!!!) A lovely place it was a shame that we were only there for one night.", "helpfulness": 10, "user": "mewk", "date": "August 16, 2006", "id": 5617211}, {"rating": 4.0, "title": "A lodge with a lovely pool", "text": "The Lake Manyara Serena Lodge was far better than expected & much better than it's namesake at the Ngorongoro crater. Meals at Serena Lodges appear to follow set patterns, but here the chefs & dinning room staff make dinner a more intimate/ pleasant experience.", "helpfulness": 18, "user": "kaw118", "date": "March 26, 2006", "id": 4735353}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "Rooms are in rondavels of four on two floors overlooking the rift valley towards the lake. The swimming pool is beautiful and spotless. Just outside the gate there are a number of \"shops\" - you can purchase all the carvings etc that you might want.", "title": "Wow! What a view!", "helpfulness": 19, "user": "fi_earthling", "date": "February 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 4459579}, {"rating": 4.0, "title": "Great lodge, friendly staff", "text": "Most people seem only to stay one night, which is a pity because the area and hotel has much to offer.", "helpfulness": 14, "user": "gabirds", "date": "August 1, 2004", "id": 2349718}], "location": {"country": "Tanzania", "region": "Arusha Region", "continent": "Africa"}, "stars": 3, "variance": {"poor": 9, "average": 50, "very good": 159, "terrible": 3, "excellent": 135}, "aka": "Lake Manyara Serena Hotel Lake Manyara National Park", "slim_ranking": 0.25, "description": "Taking as its muse the glorious bird life of the fabulously soda-encrusted and pink flamingo-fringed...Lake Manyara, the swooping curves of this elegantly evocative lodge defy description. As do the soaring views over the Great Rift Valley, the rose-gold sunsets over the Mto Wa Mbu escarpment and the utterly unique tree climbing Lake Manyara lions."}