{"user_rating": 4.0, "review_count": 166, "name": "Lake Matheson Motel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "This place is in sleepy Fox Glacier, the rooms were adequate, friendly staff, decent heating, corner spa in the bathroom and a king size bed. A quiet spot which offers a quiet comfortable resting place,", "title": "Clean quiet place", "helpfulness": 1, "user": "Harem32", "date": "October 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 142530134}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Our first stop on our driving holiday was at Fox Glacier, staying at Lake Matheson Motel. When we left after dark to get some dinner, the imposing sight of the snow capped mountains was awesome. In the morning we went to Lake Matheson at daybreak and immersed ourselves in the beautiful sights and sounds of the lake and its abundant birdlife. This equals anything in the world for pure peaceful enjoyment, so moving. Now back to the motel. Everything you could ask for, warm, comfortable, clean, nice bed, quiet, yes a great place to stay and we can certainly recommend it for your travels.", "title": "Great way to start our holiday", "helpfulness": 1, "user": "James B", "date": "October 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142451801}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Owner was so friendly and helpful - she is like your own personal guide book! She suggested a short walk at night into the forest to see glow worms which was just magical! Motel rooms are clean and modern. Owners are clearly passionate about what they do - keep up the good work!! 'The Last Kitchen' restaurant is delicious - would definately recommend a visit here too.", "title": "The best motel we've stayed in!", "helpfulness": 2, "user": "LCGAyrshire_Scotland", "date": "September 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141593932}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "Stayed for one night during 4 week holiday. Upon arrival we were greeted by a very courteous young English lady who was very helpful in answering all our questions and made polite conversation. Our unit was nicely furnished & well equipped with a spectacular view of the mountains from the doorway. Would definitely stay again.", "title": "Good location near to Lake Matheson", "user": "matthew_graham23", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140334430}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Had the pleasure to stay here for 2 nights during our trip in NZ. Host was definitely very helpful and check in was quick and efficient. We love the studio we had - spacious, roomy, clean and very functional. Keep up the good work!", "title": "Warm and friendly stay", "helpfulness": 3, "user": "wennyow", "date": "August 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 138833796}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The unit was clean with just a slight musty smell (which I have noticed in many motels and could be due to the heavy condensation during the winter months in NZ). The room was clean, warm, comfortable and quiet; the sheets were lovely and crisp which is always nice and always good to have a decent shower good. The kitchenette was nicely equipped but I found the cups a little stained. The rooms aren't the most sound proof but luckily our neighbours on either side were good and no great noise problems.", "title": "Nice quiet motel and close to the lake", "user": "GlobeTrotters4001", "date": "August 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 137683382}, {"rating": 5.0, "title": "Not a bad thing to say!", "text": "I cannot find a bad word to say! We stayed for two nights and the lady who greeted us was wonderful and showed me everything on the map including the convenience store, good places to eat and also the beach and lake if we wanted good photos.", "helpfulness": 2, "user": "sall13h", "date": "August 7, 2012", "id": 136441835}, {"rating": 2.0, "stay_parameters": "Stayed July 2012", "text": "The rooms are perfect with a great heater, comfortable bed and all sorts of amenities including a microwave and toaster, plunger coffee and hot chocolate. These were all added extras for a small motel in a country town as far as I am concerned. The best thing about this place was the modern bathroom with the best shower we had in the whole south island!", "title": "Dusty, smelly and cold rooms", "helpfulness": 1, "user": "neckiii", "date": "July 26, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 3.0, "rooms": 1.0}, "id": 135488478}, {"rating": 5.0, "stay_parameters": "Stayed July 2012", "text": "Look no further, this place is awesome in terms of location (two minutes walk to town) quietness, comfort, showers(!) and customer service above all else.", "title": "The place to stay in Fox Glacier", "helpfulness": 3, "user": "Ninjabrodie", "date": "July 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 134599731}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "On our arrival a friendly lady greeted us at reception and provided us with a map of the town and some milk.", "title": "Not at the Lake, but great!", "helpfulness": 1, "user": "Peronel_T", "date": "July 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 133742657}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Motel placed in an excellent location for the centre of Fox Glacier and the offices for all the helicopter trips. On our arrival the receptionist gave a first class customer service and suggested a trip to Lake Matheson in the evening to watch the sunset - what a fantastic sight and well worth the 5 minute drive and short walk. She arranged a discount for our helicopter trip the next day. The room was spacious with all the required facilities.", "title": "Excellent location", "user": "BurnleyKathryn", "date": "December 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147618422}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This was a very good motel. The bed was only okay, but the room was a nice size. And the location was perfect. Right near Lake Matheson and walking distance to the cute little town of Fox Glacier. They were also kind enough to offer us a flash light so we could go exploring at night.", "title": "Stay for the location and price", "user": "gerie74", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 145345470}, {"rating": 4.0, "title": "Good location and service!", "text": "Our group arrived a little late due to weather, and though there was a mix up in our booking, our host was able to upgrade us rooms. Very clean and comfortable accommodation. Well recommended for the service and price!", "user": "Jaime R", "date": "November 8, 2012", "id": 144906568}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "The Lake Matheson is walking distance to the centre of Fox Glacier town. The motel is clean and well presented. The rooms are well presented, if not the biggest, and the room rate was reasonable. I would stay there again.", "title": "Well located, friendly staff", "user": "Hansie13", "date": "October 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143493886}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We had 2 nights here; our room was comfy, warm, very clean, perhaps a little compact (studio room with our son on the sofabed), and suited our needs, as our stay there was all about waiting on a heli ride onto Fox Glacier&Lake Matheson& a hike or two, depending on weather.", "title": "Cosy Room with Glimpses of Mt Cook", "helpfulness": 2, "user": "D M", "date": "October 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 142951270}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "Stayed here for 1 night whilst visiting the glaciers. Fine motel a few minutes walk from Fox Glacier village. Rooms are clean and tidy and reasonable sized. As it is located outside the main centre, very quiet location for a good nights sleep.", "title": "Clean, tidy motel", "user": "Kevin B", "date": "March 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154116649}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Nice clean motel that served our overnight stay perfectly. Sadly we didnt get to see the spectacular views of Mt Cook but it is magical being surrounded with mountains. Although its not situated in the centre of Fox Glacier it is within walking distance. We were greeted by friendly staff and also the free internet was a bonus. All the facilities that you need for an overnight stay as we were just in one of a block of rooms but did not hear any of our neighbours.", "title": "Good value for money", "helpfulness": 1, "user": "Heather A", "date": "February 19, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 152563899}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We had a very spacious and clean room with full kitchen facilities. Our host was lovely and had a great knowledge of the area and all the activities. Location is perfect - just a short walk to the shops and glow-worms and a short drive to Lake Matheson, which is worth the walk all the way around, even if you don't have the right conditions to get the reflections. The motel has lovely views of the surrounding mountains and is nice and quiet. Definitely recommend it, especially if you want to get away from the backpacker scene.", "title": "Spacious comfortable room in a beautiful location", "user": "Monsta76", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148870962}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "There is absoluteluly nothing like staying in a place surrounded by mountains. Had amazing weather while we were there and woke up with stunning views of Mount Cook. The individual units are large and spaced out, so you definitely have your privacy.", "title": "Mountain Views", "user": "priscilt", "date": "January 4, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148832965}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Just a short 5 minute walk from the main city center and close to Lake Matheson. We also did the glacier hike and the fox glacier guides pickup is just up the road.", "title": "Good location", "user": "Nirav K", "date": "December 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148247352}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "variance": {"poor": 4, "average": 28, "very good": 79, "terrible": 0, "excellent": 55}, "aka": "Lake Matheson Hotel Fox Glacier", "slim_ranking": 0.3, "description": "Lake Matheson Motel is ideally located 400 metres from the town centre of Fox Glacier. While we have been proudly named after beautiful Lake Matheson for our 22 years in business, we are definitely a town based motel; and are not on the edge of the Lake which, like the Glacier, is a ten minute drive away. Our aim is to be 'simply nice'. This means we provide simple, clean and comfortable accommodation and focus on giving you good quality basics such as quality Sleepyhead beds, cotton linen, good showers, televisions (flat screens currently being installed in all units) and utensils. After extensive renovations over the past two years (we still have four units to complete this winter), we have gained a 4 star status with Qualmark, but have kept our prices at our original 3 Star Plus level. So come and enjoy our 21 studio and 2 bedroom units, with mountain views, in a peaceful location. We have a newly installed Zenbu wireless system, undercover parking for all units, some spa units, King or Queen bed units, continental breakfasts, a portable BBQ and a Guest Laundry for your convenience. We hope to welcome you to Fox Glacier soon. Myra, John and our son Jamie, Motel Managers."}