{"user_rating": 3.0, "review_count": 431, "name": "Lakeside Inn", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Another gathering of my high school girlfriends found us at this lovely inn. Although they are still renovating parts of the property, I don't believe our parlor room has been done. Even tho' the bathroom is dated, everything was very clean, comfortable beds and large closets. There are no coffee makers in the rooms but it is offered in the lobby if you want to wait while everyone else gets theirs. Coffee fixings in each building would have been nice. The only complaints: (1) the food in the dining room for breakfast was very good however the service both mornings we ate there was very unorganized. They sat us at a nice round table both mornings but the table had not been set with silver, glasses or coffee cups. We had to request water AND coffee then pull silverware from other tables because they didn't bring enough; (2) they offer a 3 hour happy hour but only one bartender to keep up with lounge and outside seating. The drinks were inconsistent and they ran out of tonic causing me to finally cancel my drink order after 30 minutes because they had yet to change the tank. The drink issue became our joke for the weekend - LOT (lack of tonic).", "title": "Nice weekend!", "user": "Cy B", "date": "February 20, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152634181}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "We would definitely return to the Inn because none of the above kept us from enjoying this lovely property. Adjusting our expectations when traveling in a group of six women is something we have learned to accept.", "title": "A great experience", "user": "Rita B", "date": "February 18, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 152459158}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We visited your Hotel Sunday, Feb. 17 th for Brunch driving from", "title": "Getting better all the time!", "helpfulness": 1, "user": "PatrickJunk", "date": "February 14, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 152142462}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Ruskin, Fla near Tampa. We brought along dear friends from Naples, Fla.", "title": "Great Old Florida Feel", "user": "panoramarick", "date": "February 11, 2013", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0}, "id": 151916624}, {"rating": 2.0, "stay_parameters": "Stayed February 2013", "text": "Our dining experience was exceptional right from the beginning, greeted by a", "title": "Could be great...", "user": "jeodie", "date": "February 10, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 151856588}, {"rating": 3.0, "title": "Old building in need of serious maintenance", "text": "Booked this beautiful setting because wanted something driving distance from Orlando but nowhere near the hustle and bustle of Orlando. The Lakeside certainly met that criteria, it also offered walking distance to the small pretty town of Mount Dora. Mount Dora has a selection of eateries and drinking establishments that will meet most people's needs. Mount Dora also has a selection of antique and curiosity shops, no immediate in town food stores though if you are self catering. The Lakeside Inn is spread over 3 buildings all appear to be in various states of needing maintenance and repair. From what we experienced when staying there it is evident that considerable care and effort is being put into the gardens and landscaping but we didn't witness any serious work being carried out on in the buildings.", "helpfulness": 1, "user": "889977", "date": "April 1, 2013", "id": 156305364}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We requested a lake view and whilst we were given one our room was a semi basement room, I.e. from ground level you went down steps to get into the room and the outside ground level was at window level which made the room feel cave like. Also we could not enjoy the lake view by leaving the blinds up as people were immediately outside the window. ( room 130). So my advice would be do not bother to ask for a lake view room. I would also ask if your room has been remodelled and ask for one that has.", "title": "Improvements needed", "helpfulness": 1, "user": "ChanceUpon", "date": "March 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 155904483}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Like a previous reviewer I was scalded whilst in the shower by water being run in the adjacent room (which in this instance was the swimming pool maintenance room). The swimming pool looked good, a very good size but it was un heated and as we experienced bad weather in March, a strong wind Nd temperatures that struggled to rise above 8 - 10 oC the pool was not usable. Neither was the seaplane that is moored at the Lakeside for aerial sightseeing as the extreme wind meant it was unable to take off.", "title": "A step back into time", "user": "Lynette A", "date": "March 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 155898299}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "There was only one other couple partaking of breakfast on the morning we ate breakfast at the Lakeside and also like a previous reviewer we had not been given the vouchers for breakfast discount. We did not eat dinner at the hotel. We did use the bar in the evening which was enjoyable and found the bar staff very friendly, also the live piano playing in the bar was very enjoyable. We found it strange that the bar was going to close at 9pm because they didn't have customers owing mostly to the bad weather we guessed. Would we return ? well yes we would the setting is beautiful but We would question more closely our allocated room.", "title": "Wonderful, but be aware...", "helpfulness": 2, "user": "Flipflopped", "date": "March 18, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 155018569}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We stayed here in March, 2013, for two nights, and this was our second time to visit the Lakeside Inn. I would love to give it a great rating because the setting is so beautiful, overlooking Lake Dora, and the ambiance is very peaceful. The close walking distance to downtown Mt. Dora can't be beat. The pool is nice and you can sit and watch the boats and sea planes from the lawn chairs.", "title": "Not as expected", "user": "Lakewood_Ca_Charkie", "date": "March 16, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 154718222}, {"rating": 4.0, "title": "Just Fine---No Problems At All", "text": "Stayed for one night in room 228 in the Gables Building. Lake front with a beautiful view. $155 including tax with AAA discount on a Saturday night and breakfast buffet was included. That also includes the $5.00 we paid for a mini fridge. We almost didn't stay here because of the negative reviews and I'm very glad we decided to give it a try. Nice. This is an old, historic hotel so naturally some of it looks old. Our room was large, very clean with a large bathroom. There is a restaurant with indoor and outdoor seating and a separate bar/lounge. Wifi and parking included. We would definitely stay here again. The tissues were sort of scratchy and it would be nice if they would upgrade the towels. Ice machine in this building wasn't working but only a short walk across the lawn to the next building. Those were the only negatives I could come up with. No real complaints.", "user": "Westshore", "date": "April 9, 2013", "id": 157241817}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I found this darling little place completely by accident and my new husband and I decided that we wanted to have our wedding there. Our wedding planner, Lisa Morgan, was absolutely amazing. She kept everything extremely organized and helped me in every step of my wedding journey. Our wedding was held this past Sunday, April 7, 2013, and everything was perfect and amazing. My husband and I cannot even put into words our sense of appreciation and gratitude we have for Lisa. She is truly an amazing woman! She made sure our day was absolutely amazing. Our wedding day definitely wouldn't have been the day it was without Lisa. From the ceremony site to the amazing reception room to the bridal suite was absolutely amazing. Thank you from the bottom of our hearts Lisa Morgan and the amazing staff at the Lakeside Inn!", "title": "Amazing Place", "user": "Jessica G", "date": "April 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157194703}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Situated right on the lake in gorgeous historic Mt. Dora, Florida, the Lakeside Inn is a picturesque beauty. I watched the sun set over the lake and was gently awakened by birds in the morning. Rooms are climate-controlled and spacious, decorated with impeccable taste, bathrooms graciously appointed with luxurious shampoos and lotions, and lots of new towels. Bed was comfortable, closet was ENORMOUS. The lobby downstairs is adorned with beautiful wood, again, tastefully decorated, for those who need to stay connected at all times, WiFi is free. The restaurant serves delicious dinner and the service was fantastic. There is an adorable gift shop at the gate house filled with an interesting selection of gifts, most looked to be handmade. There is a sparkling pool, a dock, there are paddle boats, sea plane rides, tours. If you would rather sit and relax there are porches wrapping the inn, just pick a view, there's a rocking chair waiting for you. Mt. Dora is a jewel of a town, easy to explore on foot, nature paths for a walk, or if you prefer, an eclectic mix of shops to peruse. If you are headed to Orlando, be sure to save at least a day for Mt. Dora, too. I, for one, would skip the lines and crowds and unwind at this beautiful sanctuary of a place! Definitely a destination spot. I look forward to returning to the Lakeside Inn!", "title": "Grace, beauty, charm, elegance, and comfort, impeccable service, and friendly people--where to begin?", "user": "Korine F", "date": "April 8, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 157022036}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "I recently completed my third stay at the historic Lakeside Inn in Mt. Dora, FL and already can't wait until my next visit. Each time I arrive my stress just slips away, the calm surroundings and the smiles of people on vacation in a special place. This old inn is a step back in time complete with the charm of yesteryear. The old style veranda has a rocking chair view that is all day pleasant and breathtaking at sunset. No car needed just walk into town, eat, shop or just enjoy the atmosphere of old city living. I love to stroll into the Gatehouse and find the perfect memory to take back home. Relaxing with a drink in Tremain's after dinner in the hotels Beauclaire Restaurant and show up in the lobby by 8:00 on a weekend night to join others in a unique walking tour of some of the ghostly rooms of the Inn and other locations close by in Mt. Dora are some of my favorite things to do. Defiantly recommended.", "title": "I keep going back", "user": "Barry M", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 156640183}, {"rating": 2.0, "title": "Needs help!", "text": "This place could be charming.....with a massive infusion of money. The many coats of paint and dated bathroom fixtures could be overlooked if everything worked. But, the faucet handle came off when my husband tried to take a shower and the water never got hot! Worn, dirty hall carpets, beds and pillows that were hard as rocks, didn't make the room very inviting. We were booked for two nights, left after one. Mt. Dora in general has seen better days. We were there for the Antique Boat and Car Show so it was bustling that weekend. But the craft show set up right outside the hotel looked more like a bad elementary school art fair. Too bad because it's a pretty spot...", "user": "julesBocaRaton_Fl", "date": "April 4, 2013", "id": 156605288}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "I have eaten on the porch of this beautiful historic landmark that overlooks the chain of lakes previously, but probably will not return again. The newly hired server was extremely slow and forgetfull. She was quick to find us a manager when we said that our French Onion Soup and Clam Chowder were inedible. The restaurant was not busy and it was late in the afternoon, so ordering a light lunch should have been an easy task, We found out that the management was new and had just started 2 weeks ago. They said they are aware of the problems and are trying to correct them. There still is no excuse for slower than molassess service. The lady's bathroom was out of tissue and garbage was overflowing. There was a table of 2 couples that said their food was awful and one of the women could not eat the chicken in her Cobb Salad. Our soups were taken off the bill after complaining. The bus boy brought a Coke when a Diet Coke was ordered and the Sprite was flat. I will not even mention the other things that were wrong as one of the new managers said the previous owner \"let the place go downhill\". This is certainly the only thing right about the whole experience.", "title": "Fabulous Setting but ---------", "user": "BuckeyeGirlUA", "date": "February 28, 2013", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 1.0}, "id": 153407525}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "A beautiful old hotel that has improved over the years. Wonderful location in downtown Mt. Dora, walking distance to shops and restaurants. Our room was clean and nice. We love the history. The best front porch with comfy Rocking Chairs. Great views. We stayed here in 1996 and again last week. New owners are busy with upkeep and you can tell. Everyone for the most part was nice. The first Front desk attendant we met at check in could have been friendlier. Breakfast was good once we got it. Wait staff very friendly and attentive, but it too a very long time for our meal to come.", "title": "History", "user": "2010psp", "date": "February 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 153396367}, {"rating": 3.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Spent 5 days at the Inn for a wedding in November. Beautiful location for the wedding, the reception and dinner were very nice. Not a good location for anyone who has difficulties walking. There are no elevators and as there are 3 separate buildings, I spent a lot of time walking up and down a gentle graded hill and climbing stairs. My room had a slightly musty smell, the door lock stuck several times and I had to get someone to let me into my room as the key didn't work. This is not the place for you if you're looking for all the modern conveniences, but if you enjoy landmarks and appreciate the historic value you'll really enjoy yourself. I highly recommend taking the Mt. Dora Canal boat trip!", "title": "Beautiful lake views", "user": "Janet B", "date": "February 27, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 153256661}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled solo", "text": "Renovations are showing evidence of love and devotion to an icon and proving to be a monumental amount of dedication to this historic landmark. You would have to see the beautiful hard wood floors and the long lean staircase; the timeline of photographs with time stamps that line the interior walls of the lobby. The majestic Beauclaire, where dignitaries, presidents and commoners have dined. Walk the grounds and breath in the landscape and the calmness of Lake Dora. Realizing that 130 years ago Mount Dora was just emerging, and you begin to understand how special Lakeside Inn really is.", "title": "Majestic!", "user": "Evette W", "date": "February 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152784990}, {"rating": 1.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "With the changes the Inn has undergone in the past few years, you would expect somethings to be dated; dated yes but not dirty.", "title": "Faded Glory", "helpfulness": 2, "user": "RandolphS53", "date": "February 21, 2013", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 152751139}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 60, "average": 52, "very good": 124, "terrible": 88, "excellent": 107}, "aka": "Lakeside Hotel", "slim_ranking": 0.6, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 4.5}}