{"user_rating": 4.0, "review_count": 129, "name": "Lakeshore Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Beautiful location right beside the lake. We had a studio facing the lake and the pool adjacent. It was gorgeous, and it felt so integrated into the natural environment, you could hear the birds sing in surround sound. Their amenities were top-notch. All rooms come with microwaves, fridges, coffee makers, toasters, plates and cooking utensils. Their staff were very friendly and willing to help. Even the construction guys went to pick up pastries when they ran out of breakfast food.", "title": "Breathtaking", "user": "hongen", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65773716}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The Inn was close to shops and restaurants within walking distance. There was a path next to the lake that was very lovely.", "title": "Our new default hotel in the Portland, OR area", "user": "Twotravelers1935", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58050795}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The only vice was that it was difficult to get to from freeways, but that was not their fault.", "title": "10 nights stay at the LakeShore Inn", "helpfulness": 1, "user": "Midwestcowboys", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 56686926}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "What a great place.This hotel has it all. Location, recent renovation, comfortable rooms, great staff--all at a reasonable rate. Short walk to all of the wonderful restaurants and shops in beautiful Lake Oswego. We will stay here again.", "title": "Beautiful Location-Walk to shops and around area", "user": "Terry S", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53227377}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "We stayed in Lake Oswego at the recommendation of a Portland native since we were expecting to stay upwards of two weeks in the area. We found the LakeShore Inn on this site and it looked right for us. We called and told the manager about our need to stay for an extended period and that a baby would be joining us at some point. The manager negotiated the rate with us and told us they could move us into a larger room when the baby arrived and as the room was available.", "title": "Charming,beautiful,comfy stay on lake", "user": "HawaiiRita", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37087808}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "Expected a beautiful veiw but got a mud hole. Lake is drained for repair. No mention of this by the Hotel. We got room #10, first floor and no blockage from the street noise. The room is right near the pool so the Balcony view is of a 6\" chainlink fence. Room #11 is similar. All other rooms would be better. These 2 rooms should be discounted for the above reasons.", "title": "Lake is drained and room #10 is the worst room at this Hotel.", "user": "xxxzzzyyy", "date": "September 22, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 80622621}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "Lakeshore Inn is the only hotel/inn on Lake Oswego. The people were friendly & helpful. We had what was called a studio room. It had 2 queen beds and small kitchenette. It had the greatest view of this private lake. The rooms were big with an outside sink because of the kitchenette. It had dishes, silverware, small refrigerator, microwave, and large TV. We could just sit on the balcony and stare at the lake and the pool below us. We went shopping around the corner at the new boutique style shopping center. We drove down the main road about 15 minutes and were at the Portland aerial tram. Took it to top for a great view of Portland. Two more minutes down the same road & we were on the Willamette River looking at all the bridges in Portland. There is a new section along the river with shops and restaurants where we ate lunch. Then back home to the Lakeshore Inn for recommendations for dinner. We ate at the only one right on the lake. Since it was a gorgeous day everyone was outside on the deck. Great food & service. The area around the lake is surrounded by expensive private homes with the exception of the Inn, restaurant, & a corner of the shopping center. Only drawback was the continental breakfast. Just delicious pastry & coffee. Most people use their kitchenettes.", "title": "What a view!!", "user": "Barbarosa", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 77842210}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We've stayed here 7 or 8 times over the years and enjoyed the hotel more for its location and proximity to our friends. They remodeled the hotel since our last visit and did a great job. We have three kids, so we typically need 2 connecting rooms or a large suite when we travel.", "title": "Remodeled Lakeshore Inn is great.", "user": "ScoutP", "date": "August 16, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75442607}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The Lakeshore has a 2 bedroom suite (Room 43) with kitchen and balcony. Perfect setup for us.", "title": "Love Lake Oswego and this hotel is in a prime location", "user": "KLMH51", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72594292}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "It is a little pricey at $250 per night (including taxes), however, well worth it.", "title": "Great Lake Oswego Location", "user": "craigdub", "date": "July 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 70032324}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "The Lkeshore Inn reminds you of one of those excellent little inns of Europe. It is clean, bright, and staffed by wonderful, friendly people. In a simple way it is luxurious. It is within walking distance of a variety of restaurants, movie theatres, shops and bars. It is perched on the shore of Lake Oswego and every room has a little deck with a lake view.", "title": "What a little jewel of a place!", "helpfulness": 1, "user": "CAMAlbuquerque", "date": "November 15, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 87202661}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The last time I stayed there, the lake had been drained but it didn't matter. This is a place where the scenery is an added attraction. The real value of the place is the staff and their lovely attitude and the care they extend to you. Jaded business travelers, stay here and escape the cookie cutter business hotels!", "title": "The best service you could get!", "user": "LAFUN", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 83232309}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We came for two nights and the service the hotel provided was spectular. They had cookies and hot cocoa in the lobby. The people in the lobby were more then willing to tell you where to eat and anything else you might want to know. It is located in a perfect place- many cute shops and good restraunts.", "title": "Was super disappointed that there was no lake! It had been drained", "user": "BirdsviewKrisV", "date": "October 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 82540674}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "We picked this hotel based soley on the fact that it was the ONLY hotel on the lake. When we arrived, we found it had been drained for at least a few weeks, and and all we had a view of was mud, with dead and dying fish, and it reeked like septic. It was disturbing to see the birds feasting on the poor fish who suddenly had no water to live in.", "title": "Nice location but lake drained", "user": "Travelgirl95648", "date": "October 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 81866094}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This hotel is nice, but I booked it based on the view. When I arrived, however, I found the lake to be drained for repairs, which I not informed of. Had I known this, I would not have booked this hotel. Apparently it was a discounted price, but in my opinion, it was not enough. I was also placed on the ground floor (room #11), and like the other review, had a view of a chain link fence around the pool. The remodeling in the rooms is nice, but the walls are thin, so you can hear other guests. The location, however, is nice in that it is close to shopping and great restaurants. I would return, but ONLY when the lake is full. It's my understanding that repairs will be going on for several months and once complete, they will be refilling the lake \"naturally,\" so it could take some time before it is full again.", "title": "Lake is still drained", "user": "y0ungatheart", "date": "September 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81132530}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "We selected the Lakeshore Inn because there did not seem to be other choices in Lake Oswego. With a Trip Advisor special we ended up with a very nice rate and overall were pleased with the hotel. While the hotel is older, recent upgrades offset its age. We stayed in a two-bedroom suite with a full kitchen and living area. The room was large, clean and the bathroom updated.", "title": "Solid choice in Lake Oswego", "helpfulness": 1, "user": "TexasEXtraveler", "date": "February 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 96509932}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "While the balcony overlooked the lake, the lake is drained and, at the moment, quiet unattractive. The hotel staff indicated refilling is scheduled to begin soon.", "title": "What a great place!!", "helpfulness": 1, "user": "Vsb7victoria", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91131264}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The most inconvenient aspect of the hotel, in my opinion, is access and parking. The parking lot is shared with an office building, which reduced the available parking spaces during work hours. Construction adjacent to the hotel makes entry tight between the office building and a temporary fence. It can be a little tricky pulling onto State Street during morning traffic, and quests seeking to head toward Portland must exit right and then turnaround as exit from the hotel is right turn only.", "title": "Our wedded bliss started here!", "helpfulness": 1, "user": "MrNurse78", "date": "December 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89392589}, {"rating": 5.0, "stay_parameters": "Stayed September 2010", "text": "Another thing to be mindful of is the trains. During our stay two trains per day passed the hotel and it literally sounded like they would come through the hotel – the tracks are that close. The train schedule did not help either, as the morning train passed though in the predawn hours.", "title": "Great stay before the Big Day!", "helpfulness": 1, "user": "coffman5", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88050166}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "A real plus was the quality of the dining and shopping within walking distance of the hotel. The hotel’s continental breakfast is limited, so we were thankful for nearby choices. Be sure to stop by the nearby French bakery for pastries. It became our favorite breakfast spot and preferable to the national chain coffee shop down the street from the hotel. A grocery store is within walking distance, so procuring essentials for a stay is easy, too.", "title": "Relaxing stay", "helpfulness": 1, "user": "RMCTualatin", "date": "November 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 88021360}], "location": {"country": "United States"}, "stars": 2.5, "variance": {"poor": 12, "average": 13, "very good": 39, "terrible": 7, "excellent": 58}, "aka": "Lakeshore Hotel", "slim_ranking": 0.571428571429, "description": "Relax in a wonderful lakefront room or suite in the heart of downtown Lake Oswego. Guests will enjoy complimentary pastries and gourment coffee, lakefront decks, Wi-Fi, flat screen HD TVs, DVD players, small kitchens and lakeside pool."}