{"user_rating": 3.0, "review_count": 50, "name": "Lake Bennett Wilderness Resort", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Lake Bennett Wilderness resort is located in a handy location if you're visiting Litchfield National Park then moving on to Kakadu - it saves a drive back into Darwin. However, it doesn't have much else going for it. We stayed in a motel room that was a fairly typical - a bit tired, but functional. We had a terrible experience in the restaurant. We were also warned that service was going to be quite slow, by slow, most people would expect to wait around an hour at most. We ended up waiting for 2 hours to receive our mains - a steak and a puff pastry chicken parcel. The steak was 'the most well done 'medium' steak he's ever had' and mine was actually still frozen in the middle! The waiter was deeply embarrassed and offered a complemetary dessert, but as it was almost 10pm by this point & I'd hardly eaten anything, I settled for a free starter. We assumed this was just a terrible one-off, but by the sound of it, the restaurant has some serious issues it needs to resolve.", "title": "Handy location, but little else to offer", "helpfulness": 1, "user": "katherinious", "date": "July 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8038703, "likes": {"liked": "— Location", "disliked": "— Restaurant"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "First impressions were good. A well laid out resort. However on going to reception...very disappointed. Initially our travelling companions were promised a free upgrade..great a spa room! Then the receptionist tried to charge $50. Upon questioning her as to why a free upgrade had suddenly become a $50 charge she then reduced it to $25...the apparent cost to change the bed, linen etc in the new room...weird!! The pool area was lovely but if you wanted to swim then something else would have to do because it was nothing more than a plunge pool. The spa on the balcony was unusable because the minute you ventured out there you were eaten alive by the mosquitos and sand flies! Had a meal in the restaurant one evening. We chose the steak which was to be cooked medium to rare. We were warned before we ordered by the waiter that it would take 40 minutes. It took 1 hour. Would hate to think how long we would wait to eat if we had asked it to be well done!!!", "title": "Reception!", "helpfulness": 1, "user": "kagriff4", "date": "June 25, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 7988481}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Lake Bennett"}, "stars": 3, "variance": {"poor": 9, "average": 14, "very good": 13, "terrible": 8, "excellent": 6}, "aka": "Lake Bennett Wilderness Resort Australia - Northern Territory", "slim_ranking": 1.0}