{"user_rating": 3.5, "review_count": 106, "name": "Lake Natoma Inn", "reviews": [{"rating": 2.0, "title": "Nice rooms, terrible customer service this time.", "text": "We have stayed in this hotel many times. My daughter even had her wedding and reception here. While the prices are pretty high, the rooms are very nice. When it came to checkout, we were double charged. We argued with the manager at the desk, who told my sister to shut up. The police were called in and we were threatened to sign the credit slip or we would be arrested (on charges of theft). This is not the kind of service we expected after all the times we've stayed. We will just have to go through the trouble of disputing the extra charges, but we will not be recommending this hotel anymore. We will stay at the Larkspur next time.", "helpfulness": 1, "user": "gbellfam", "date": "March 14, 2008", "id": 14273885}, {"rating": 2.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "This Hotel is so overpriced. My wife and I went for a quite weekend....bad idea. We were met by a very nice receptionist who gave us useful info. She told us that we were on the 4th floor and had a great view of the town..we did...and the car park and the one being built. We took the elevator and kicked empty cans of bud into the corner.. ominous we thought. The room was reasonable..not big not small clean and comfy. The bathroom was ok but clean too. We unpacked and went down to the bar....this resembled a small works canteen...and served as the restaurant too....we went out. We should have stayed out. At 9.30 the whole town seemed to erupt into a night club. We could not only see the clubs and bars but could hear them blasting. Even with the windows closed...Double panes would have been useful. This lasted till 2.00 heavy metal and blues...Then came the finale...the car park seems to be used by everyone visiting Folsom...swearing drunks are not funny. Fortunatly we could see our car. The two uniformed security guards didnt serve any purpose..they were stationed in the reception on Saturday night.", "title": "Very disappointing", "user": "travellingmanBayArea", "date": "February 25, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 2.0}, "id": 13841127, "likes": {"liked": "— room", "disliked": "— location"}}, {"rating": 5.0, "title": "Great Service and Beautiful Hotel", "text": "So what did I think...I have stayed in worse rooms...the hotel is overpriced even with the deal. You have a choice of free way noise on one side or club noise on the other. Restaurant and room service disgraceful... and overpriced too. So I wouldnt stay there again.", "user": "HappyTraveler2008", "date": "December 31, 2007", "id": 12165363}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I stay at this hotel on many occasions for both personal and business reasons. The front desk staff is top-notch and the staff in the hotel restaurant/grill is excellent. The rooms are spacious and well-kept. My husband and I love the suites with their comfy beds, jacuzzi tubs and wood burning fireplaces. We often bring our kids to this hotel because of its great location and the ability of the staff to cater to our every need. There is so much that is within walking distance of the hotel and we love the Folsom street fair during the summer. Booking on line is always a breeze and our requests are almost always met with no problems. I have stayed in other hotels in the area and have never been greeted like \"one of the family\" as I have been here. The other hotels may be newer, but they cannot rival the level of class and service as I have experienced at the Lake Natoma Inn.", "title": "Relaxed and Happy!!!!", "helpfulness": 1, "user": "Happygirl059", "date": "November 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 10699860, "likes": {"liked": "— Everything", "disliked": "— leaving"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2007", "text": "My husband and I had a very romantic stay at the Lake Natoma Inn! We loved the Premium Suite with the fireplace and jacuzzi tub! We ordered and enjoyed room service. We also fell back in Love again!", "title": "not the best at all!!!!!!!!!!!", "user": "870how", "date": "November 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 10498570, "likes": {"liked": "— leaving", "disliked": "— leaving"}}, {"rating": 2.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "This was rated a 3 star hotel by Priceline- JOKE! It was really not much better than Motel 6. If I had not received a HUGE discount from Priceline, I would have been very disappointed for what I got for the price. Even with the discount, it wasn't worth it. Glad we arrived late and stayed only one night.", "title": "Don't bother!", "user": "mellisnv", "date": "March 11, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 2.0, "service": 3.0, "rooms": 1.0}, "id": 26018196}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Positives: Comfortable Bed/ Quiet Location/ Nice Grounds/ Near restaurants and historic Folsom", "title": "Nothing special, bad TV", "user": "tampabobl", "date": "October 7, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 20705254, "likes": {"liked": "— Free wifi in room", "disliked": "— No Fox News on TV"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Negatives: Horrible showerhead, small rooms, few & fuzzy TV channels, pool & spa out of order, far from freeway.", "title": "Wonderful bed, walking distance to historic Folsom, CA", "user": "tripper45", "date": "August 29, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 19511431, "likes": {"liked": "— Being close to historic Folsom, CA.", "disliked": "— The smallness of the hotel room. The cafeteria for breakfast is small."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "Stayed here one night prior to flying out of Sacramento (try to find a closer hotel). Hotel is ok, room was small but clean, comfy bed. Front desk guy was efficient but certainly not friendly. My main complaint was the TV, just 24 channels and no Fox News. I need Fox News channel. Breakfast is not included and is expensive in their restaurant. Free wireless internet was a bonus.", "title": "Upscale Inn Near Old Town", "helpfulness": 1, "user": "SFtransplant", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16447775, "likes": {"liked": "— Location near bike trail and Old Town shopping area.", "disliked": "— Lousy Pillows."}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "For my birthday we booked a night at Lake Natoma Hotel. The room was quite narrow with a wonderful bed. It overlooked the parking lot. We were not in the room much, sightseeing in old town Sacramento and also in Folsom Heritage District (which is within walking distance two blocks). I would suggest the river side of the hotel.", "title": "Typical Motel", "helpfulness": 1, "user": "Aprill18", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 16211747, "likes": {"liked": "— Location to the Downtown", "disliked": "— Air Conditioning"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We stayed here and had no problems at all. Please keep in mind I'm not easy to please and I'm high maintenance FOR SURE. The things that are great about Lake Natoma Inn are (1) near the best bakery in the US , Karen's Bakery (2) right on Lake Natoma (not just kinda close) (3) Near the wonderful Sacramento bike trail and near a great bike shop where you can rent bikes (4) rooms are very nice at the right size and price, not noisy. (5) No problems with staff, which we put to the test as usual.", "title": "the right spot", "user": "leaning", "date": "June 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31300248}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "If you took the few negative reviews here seriously that would be sad. So what if the hotel doesn't give you a free continental breakfast muffin!", "title": "We just keep coming back...", "user": "Cutiekaddie80", "date": "May 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31098168}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "My husband and I have been coming to the \"Lake Natoma Inn\" every year for our anniversary. WE LOVE IT. The hotel is always very clean and quite. The beds are fabulous, I always sleep so good when we stay there. The hotel is in a very convenient location, so close to the Folsom old shopping district and bike/hiking trails. You can always drive 5-10mins down the road and the \"Folsom Outlets\" are there. While we were staying this past weekend (memorial weekend) there were five weddings on the grounds that we could watch from our hotel room, it was beautiful. The flowers and grounds were very nice.....We always ask for a room on lake side, you can't really see the lake but the view is still beautiful. The best place to eat is at the Hacienda Mexican or Pizzaria Classico in old Folsom, such great food. We only live 45mins away but it's worth it. If you are looking for a place for a quick getaway this is the place for you!!!!", "title": "Very Impressed", "helpfulness": 1, "user": "supertraveler33", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29252751}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "We loved this hotel, we asked for an upgrade and got one, Bed very comfy, the breakfast was WONDERFUL, Room service, great, Loved the grounds, it rained the whole weekend, so not to much outdoor activities, we Loved the Loose Change Band at the Powerhouse, Loved the Thai Restaurant upstairs, above the property, this is a non smoking hotel, but all the smokers (attending a wedding reception) were by the outdoor elevator, and the only thing I would change about this non smoking hotel is MOVE THE SMOKERS AWAY FROM THE FRONT ENTERANCE!!!", "title": "Pleasant surprise; we stayed longer than planned.", "user": "rktship", "date": "April 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 28987767}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "My husband and I were on a spur-of-the-moment long weekend trip and planned to go to Napa. We decided to stop in Folsom the first night to avoid Sacramento rush hour traffic, and stayed here. We were very pleasantly surprised. The location is perfect for visiting the historic district, which has some great restaurants. The room, though on the small side, was tastefully decorated, had a sofa, desk with a real office chair, and free hi-speed internet. Ours overlooked the patio, toward the river, and though there was some traffic noise with the window open, the patio's fountain offered the pleasant sound of water to offset it. The king bed was awesome, one of the most comfortable hotel beds we've ever slept in! The hotel offers room service for breakfast, which was an added convenience, and was a good value. The room also has a refrigerator and microwave, which was a plus. We found the shower to be just fine; there was no lack of water pressure. The hotel has a workout room, pool and sauna, which my husband enjoyed.", "title": "Very NICE!", "user": "Carolg903", "date": "March 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26499355}, {"rating": 3.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "Stayed at Lake Natoma Inn for a job project Feb 2010. When I arrived, they \"upgraded\" me to a suite, which was very nice. I enjoyed the location and room a lot. When it came time to rebook for my next project, I asked to be sent to this hotel. I also advised my staff to stay at the same place, due to the original room I had. Upon my second visit, I was given a standard room. While I have to real complaints, it was just not the same as the suite. No view, no fireplace, no free bottled water, etc.....", "title": "Excellent on first visit, not on second....", "helpfulness": 2, "user": "Lawin4cr", "date": "March 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 58580389}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "I only stayed at the hotel the second time and had my staff stay there due to the room I had seen originally. The hotel is fine, staff is okay, it is clean...like a said, no real complaints, but....I don't think I would have stayed a second time if I would have known the differences between the rooms.", "title": "Mom and Pop? Hotel trying to keep up", "helpfulness": 1, "user": "RossNorthCarolina", "date": "September 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 40655182}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Also, the \"gym\", don't waste your time...all the equiptment is very very old and I was only able to use it for 5 minutes...they should not say they have a gym, its just old equiptment from someones home.", "title": "Overpriced", "user": "Taylor10065", "date": "July 29, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 36183857}, {"rating": 1.0, "stay_parameters": "Stayed June 2009, traveled with friends", "text": "We had a choice of this hotel or a large chain hotel in a mall setting. Decided to go for scenery and a historic setting. Downtown historic Folsom is hanging on for dear life. The old west theme that runs for 3 blocks has an assortment of antique, art and restaurants, similar to many small towns trying to woo shoppers from the newer exurban areas of Folsom. There are 3 bar/restaurants that on Saturday night, were hopping.", "title": "Rude front desk!", "user": "lilolme00", "date": "June 25, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 33142289}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled solo", "text": "The Inn appears to have gone some renovations recently and perhaps does them as budget allows. The lobby looked redocorated and the hall carpet looked new. The bathrooms have granite countertops and there is a microwave and fridge that look fairly new. The bed was also very good . Breakfast buffet also better than anticipated.", "title": "OUTSTANDING stay", "user": "LarryD1234", "date": "June 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32771792}], "location": {"country": "United States", "city": "Folsom"}, "stars": 3, "variance": {"poor": 14, "average": 27, "very good": 32, "terrible": 5, "excellent": 28}, "aka": "Lake Natoma Hotel Folsom", "slim_ranking": 0.666666666667, "description": "Nestled along the American River between Historic Folsom and Lake Natoma's beautiful landscape, Lake Natoma Inn is quiet and intimate. Whether you're in town for business or pleasure, our casual and friendly atmosphere will make your stay one to remember.Consider the Lake Natoma Inn for your upcoming event---whether planning an intimate event for 20 or a lavish wedding for 250, our attentive staff will ensure your event is memorable. Lake Natoma Inn offers beautiful outdoor ceremony sites and elegant indoor reception venues."}