{"user_rating": 4.0, "review_count": 70, "name": "Lakeside Motel & Apartments", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Lovely motel on lake front in Te Anau. Our 2 bedroom unit was clean and tidy. Friendly hosts.", "title": "Good motel with great views", "user": "Kevin B", "date": "February 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97912916}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Can't ask for more when a lot of hotels and motels had no vacancy. Rented the apartment with three rooms facing the lake that can fit 6, full kitchen and a living room that can fit a snooker table between couches and TV. The only down side is toilet and shower rooms are separated too far off and there is only one toilet. The facilities are well maintained though a little old.", "title": "Well located, Spacious and Free Wifi", "user": "r0wee", "date": "February 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 97059830}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "Upon check in, the kid at the reception was really helpful assisting many of our requests, booked a restaurant for us that we enjoyed very much and showed us where to go and how to use some amenities.", "title": "Great view but ordinary rooms and poor service", "user": "vb2coolJaipur", "date": "January 15, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 93028550}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "Good comfortable rooms, value for money place. Service was ordinary - we had two young children and the lady who looked extremely busy (could not see any other staff around) sounded difficult when we asked for an hour's delay in checkout.. we ended up dumping everything in the car.", "title": "Beautiful Spot nice motel", "user": "Dream84", "date": "December 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 90596861}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "The shower didn't work very well either.", "title": "Great for a night in Te Anau", "user": "Pony1985", "date": "December 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 89378636}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "If you're looking for plush accommodation this ain't it. If you're looking for a place to crash, this motel will do. The rooms are pretty basic and a bit run-down, but there's really nothing to complain about. We also chose one of the rooms without a view as it's cheaper, but I imagine the rooms with the view have quite a nice view. It's about a 10-15 minute walk out from the main town.", "title": "Nothing extraordinary, just a regular stay", "user": "alku83", "date": "November 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 88400134}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "This review should be taken in context. We knew what we were getting: simple, no frills, base camp to make our trip up to Milford Sound. That is what we got. Pleasant greeting, clean room, and a place to park the car. We were able to walk to \"downtown\" with ease, about a 10 minute walk to the restaurants (see reviews for those!). The view is great. Beds, linens are clean and otherwise unremarkable. Basic 6 tv channels, although we were hardly in the room at all so that didn't matter to us.", "title": "Just enough for our needs...", "user": "jmichfev", "date": "November 9, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 86578261}, {"rating": 3.0, "title": "PLEASANT ENOUGH", "text": "A modest but pleasant enough motel. Well appointed and clean rooms. Be aware that although it is advertised as being on the lake, only about half the rooms actually face the lake. A bit further from town than we would have liked", "user": "gplk", "date": "August 1, 2010", "id": 73285517}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "Found this spot by accident, but was impressed.They claimed to be closest to the lake at TeAnau, and they were.", "title": "Gr8 spot", "user": "Geebee2114", "date": "June 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 68627714}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We had lovely rooms facing the lake, and had afternoon drinks on the lawn out the front of our rooms. Very pleasent.", "title": "Beautiful gardens & view of the lake! Didn't like the bathroom.", "helpfulness": 1, "user": "dankath", "date": "April 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 62124309}, {"rating": 3.0, "title": "Affordable and comfortable", "text": "We have stayed here twice now, first time in July 2005 then again in August 2006. It is situated right across from the Lake with mountain and Park views. Initially we chose it for its pricing, but found it to be not only very reasonably priced but very comfortable, clean and warm (needed in Queenstown in winter). It is a short 5 minute stroll into the town centre. The kitchen & bathroom are both clean, with the kitchen providing all items needed for a full working kitchen. We stayed both times on the top floor, so we had a rather nice view. The only small issue i would have it that the balcony is one long balcony, that all guests can walk the length of, instead of each room having its own privacy on the balcony. However as we only go in winter that is not an issue for us as it is way to cold to sit out on there for over 5 minutes. We are currently planning our next trip to Queenstown in Aug 2008, and will most definately be satying here again.", "helpfulness": 1, "user": "flute3073", "date": "April 21, 2008", "id": 15202295}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Picked motel by chance ( lots to choose from in Te Anau) - manager insisted on showing us the room - the last available.", "title": "Very happy with this", "user": "elestoban", "date": "April 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14938923, "likes": {"liked": "— the whole package", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "NZ $120", "title": "Terrific motel", "helpfulness": 2, "user": "ElizabethS", "date": "March 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7169911}, {"rating": 3.0, "title": "Nice", "text": "It was at the back - suitable for 3 & was very smart & spacious with large bathroom, with adequate kitchinette - i like motels / hotels that leave plenty of tea/coffee - usually dont need it but hate the way some places count out the tea bags !!", "helpfulness": 5, "user": "texas1", "date": "April 18, 2006", "id": 4986718}, {"rating": 4.0, "title": "Lakeside Motel", "text": "A lakeside view would have been nice but we spent most of our 15 days looking at, cruising on or driving by so probably wouldnt have paid extra for the view anyway. It was the corner room at the back & wireless internet connection was not good in that particular spot.", "helpfulness": 5, "user": "Gorgota", "date": "April 14, 2006", "id": 4973091}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "Late reviews. First off, this is a motel and we've never stayed in one before trip to NZ. The staff were great, the location even better, the unit (a one bed/living/bath) was roomy but could do with a refurb, one gripe was the additional single bed in our room (perhaps a triple room on another day) which took up space. Outside, the gardens were beautiful and was extremely clean. Location was fab, Te Anau just across the road the bustling town is a bit further up which has everything you need.", "title": "Great Location", "user": "Nush7", "date": "March 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 58531074}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We stayed at the Lakeside Motel on 29th and 30th Jan.", "title": "Top quality, you could live here.", "helpfulness": 2, "user": "peteandmarion", "date": "March 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57722760}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "No lake view apartments were available, but from other reviews I think maybe they are smaller. We had a lovely big 1 bedroom unit with a large lounge area which also had a big day bed for lounging on, as well as a sofa. There was a well equipped kitchen area and small dining table too, PLUS a big bathroom with spa bath. Everything was spotless. The lounge had a quiet patio area at the back. The grounds were also immaculately kept, wish my garden looked like this. Its an easy walk into town too.", "title": "Great view. Very nice gardens but average accommodation", "helpfulness": 1, "user": "WilliamPayer", "date": "January 26, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 2.0, "rooms": 3.0}, "id": 54395082}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "All this for $120NZ a night. Definitely one of our best stops.", "title": "perfect location", "user": "antrobus", "date": "January 5, 2010", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 52671176}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The Lakeside Lodge is slightly away from the main town centre but within walking distance. If you are going to one of the supermarkets you will probably need to take the car though. The view from our upstairs apartment was great, especially as the sun set. The Lodge has really nice front gardens with picnic tables and you can BBQ here if you wish. Unfortunately the welcome was of the key and cow variety with no effort even to tell me where the room was situated until I asked. The person on reception was walking backwards through a connecting door as I asked this and some other basic questions. The accommodation is clean, comfortable but lacks any extra. If you read other posts on places like Central Gold (Cromwell), Centre Point on Columbo (Christchurch), The Palazzo (Nelson) and Taylor's (Ashburton) you will see what I mean by extra. I wouldn't rule out staying here again as there is nothing basically wrong with the place, just a feeling that they see you as \"a temporary resident unit\", but I would have a look at other motels, maybe a little bit closer to the shopping area.", "title": "Very good value, ok place to stay", "user": "Birdwatcher33", "date": "December 31, 2009", "detail_rating": {"cleanliness": 4.0, "location": 3.0, "value": 5.0, "rooms": 3.0}, "id": 52249020}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "variance": {"poor": 1, "average": 15, "very good": 34, "terrible": 1, "excellent": 19}, "aka": "Lakeside Motel & Apartments Hotel", "slim_ranking": 0.583333333333}