{"user_rating": 4.5, "review_count": 454, "name": "Lamp Lighter Inn & Sunset House Suites", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The Lamp Lighter Inn is very charming. It has a beautiful garden/sitting area for guest to enjoy the outdoors. Our room, the Porpoise Room, was decorated with a nautical theme and was very nice. Definitely bigger than the other two hotels we have stayed at on the this trip. Actually bigger than most hotels ever. Our first hotel was at the far east of Carmel, but still in walking distance and need to be updated. It did not have the charm of the Lamp Lighter.", "title": "Lamp Lighter Inn is very charming!", "helpfulness": 1, "user": "tempest0109", "date": "April 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28007523}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "The Lamp Lighter room had a small couch and wood burning fireplace. And yes they provided the wood and fire starter. The location of the hotel is between the beach, west about 3 blocks, and shopping, east 2 blocks. This was a last minute choice to stay in Carmel and we got a very good deal. I would definitely stay again.", "title": "An Amazing Bed and Breakfast a stones throw from the beach!", "helpfulness": 1, "user": "greatgetaway4me", "date": "April 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27828253}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "I have to rave about the Lamp Lighter Inn in beautiful Carmel, California! We stayed for 2 incredible nights! I highly recommend it!", "title": "can't imagine staying anywhere else", "helpfulness": 1, "user": "wilsonrocky", "date": "April 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 27317892}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "What a gem!! My husband booked a family getaway that we will remember for years to come! We stayed in the \"Hansel and Gretel\" suite, which was absolutely charming!", "title": "Perfect Carmel Cottages!", "user": "wgsb", "date": "March 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27125110}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "The suite offered a private bedroom for my husband and I, and a full size pull out couch for our two boys. There was a large flat screen t.v. in the living area to which they hooked up their X-Box for evening entertainment, and a smaller one in the master bedroom. This suite was actually a cottage, complete with a fireplace, wetbar, microwave and small fridge.", "title": "Best Birthday get away ever!!!", "user": "lesley1933", "date": "March 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26582321}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Wow this place is a gem. We came across it as we left 17 mile drive to go back into Carmel and it's little fairy lights drew us in !! We had no reservation but they were able to accomodate us in the Dolphin room - highly recommended ! It was clean, friendly, quaint, peaceful and only 2 minutes walk into Carmel one way and 2 minutes walk to the amazing beach the other way.", "title": "Beautiful and Charming", "user": "jaseylulu", "date": "June 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31639167}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled with family", "text": "Lovely breakfast left outside for us in the morning - muffins, hard boiled eggs, juice etc and the owner was so kind, advising us what to do and where to go in and around Monterey/Big Sur etc. We ended up staying 2 nights!!", "title": "pretty chic place in a great location", "user": "michala", "date": "May 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 31125129}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "Would definitely recommend you to stay. Oh and make sure you go to Demetra Cafe for dinner !!", "title": "Charming - perfect in every way", "helpfulness": 1, "user": "Michelle N", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30566110}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "just left here today and agree with what all the reviewers have said before - good points include location, environment, friendly staff the best of all our california hotels, nice rooms, customer service is exceptional, go a drive to big sur its fantastic only 20 minutes away or so and take time to do a hike or trail. We did soberanas trail with 3 young kids and picnic'd by redwoods sitting on large boulders over a babbling brook - gorgeous", "title": "Great Place to Stay", "helpfulness": 1, "user": "rj_watters", "date": "May 14, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30008681}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "A few minor complaints - (a little petty really) we had a lovely breakfast basket delivered that included eggs, fresh muffins, orange juice and yoghurts very nice to most people maybe but to me i need toast/bagel or something to put my egg is this a strange american tradition i ponder. Final complaint shower temperature was unstable and varied to just right to hot but otherwise loved our stay here - carmel is gorgeous as is the lamplighter", "title": "Perfect in every way", "helpfulness": 1, "user": "odamone", "date": "May 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29553112}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "My husband and I enjoyed our 2 night stay here. The sea star room was spacious and had a new bathroom. The only problem we encountered was when people checked in the room over us the second night with 2 dogs who were very noisy at 5:30-6:30 a.m. When we told the manager he very kindly deducted $20 off our room rate for the disruption. It's an easy walk to shopping, restaurants and just down the hill to the beach.", "title": "Lovely Lamp Lighter Inn", "user": "pearleBoston", "date": "March 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26386377}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our friends told us about their wonderful stay at the Lamp Lighter Inn, so we decided to celebrate our anniversary there. We had such a great time and can't say enough about this lovely inn! We travel a lot and have stayed at many small hotels and B&Bs, and this is one of our all-time favorites. It is also dog-friendly, so that's a big plus.", "title": "Our favorite place in Carmel!", "user": "Bluegreen66", "date": "February 10, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24447566, "likes": {"liked": "— Great room, great location, great staff!", "disliked": "— No complaints, our entire experience was wonderful."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Our room was clean, spacious, and very comfortable. My husband requested the \"romance package,\" so they had flowers and a nice bottle of champagne chilled and waiting for us when we arrived. In the late afternoon, we sat outside in the little gazebo and sipped our champagne, watching the passers-by strolling down to catch the sunset over Carmel beach. So romantic! Several people stopped on the sidewalk, smiled at us, and commented on how charming the hotel is, with the bird houses and beautifully groomed gardens... we had to laugh because it felt almost like we were in a commercial!", "title": "Loved Hansel and Gretel", "user": "beachbunny195", "date": "February 4, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 24213879, "likes": {"liked": "— Location", "disliked": "— No hottub"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "The complimentary breakfast was a nice start to each day, quietly delivered to our doorstep in a cute little basket - delicious muffins, organic yogurt, juice, and hard boiled eggs - not your typical continental breakfast of tasteless pastries and bagels. The location is perfect, it's an easy walk to shops and restaurants and just a couple of blocks up from the beach. We didn't have to use our car once all weekend. And it's just far enough from the busier traffic section to be a little more peaceful than some other places we looked at.", "title": "charming,comfortable,relaxing", "helpfulness": 1, "user": "mimio8", "date": "February 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24153047}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Everyone was extremely friendly and accommodating, from the person who took our reservation, to the hotel manager who greeted us when we checked in, to the housekeepers. Others could certainly learn a lot about good customer service from the staff here! It is a little pricier than some, but anyone who has stayed in Carmel knows that the internet photos and building façades can be very misleading at many of the cheaper places. This one is worth every penny and we will definitely stay here again!", "title": "Enchanting", "user": "1CaliforniaGirl1", "date": "January 28, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23990532, "likes": {"liked": "— It was clean and comfortable.", "disliked": "— That we had to leave."}}, {"rating": 5.0, "title": "We loved the Lamp Lighter Inn!", "text": "My husband and I just returned from a romantic stay at the Lamp Lighter Inn. I can't say enough wonderful things about this lovely and beachy spot. Our room was so spacious and well appointed, with a huge comfy bed, soft linens and a wood burning fireplace. The extra touches like the luxurious bathrobes and sherry in our room made our stay so special. This inn is so close to the beach and although right on the famous \"Ocean Avenue\", it was so quiet and felt so private. We highly recommend the Lamp Lighter and can't wait to return!", "user": "JackieSanJose_CA", "date": "January 22, 2009", "id": 23794945}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "We spent a fabulous 3 nights at the lamplighter Inn with our two children and dog. It was just 3 blocks up from the beach so some of us could either spend time on the beach or walk up the street for coffee or a little shopping. The Bluebird cottage was perfect for us. The kids and dog were upstairs which allowed up a little privacy downstairs but at the same time all being together. My husband was particularly happy that he never had to move the car. House keeping was very patient with my late sleepers and did an excellent job keeping our room tidy. The management even emailed us regarding an item that was left behind and then mailed it back to us. I was very impressed with the staff and the comfortable room. Being able to spend the holiday with our dog was an extra bonus. We have already booked for next year.", "title": "loved the Lamplighter", "user": "1dog2kids", "date": "January 18, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23661660}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Wow... My wife and I loved the Lamp Lighter Inn. We had the pleasure of staying in the Treetop House... and the room is as advertised with a peek-a-boo look at the beach (see the pic)... and it was awesome... we spent more time in our room than expected as it just felt warm and inviting.", "title": "Outstanding", "user": "Blind_Dog_Audio", "date": "January 17, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23629660, "likes": {"liked": "— We really loved the room and the location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "We loved the way the windows wrapped around and you could open the shutters and still feel private... The fireplace kept the room warm all night and it was so quiet you could hear the waves from the near by beach crashing at night.", "title": "It was perfect!!!", "user": "TRAVELPR02008", "date": "January 13, 2009", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23538537, "likes": {"liked": "— The wonderful location and beatuful rooms", "disliked": "— Having to check out and go back to work."}}, {"rating": 5.0, "title": "Lamp Lighter Inn is a gem.", "text": "The breakfast basket was a tasty treat... just enough to get you going for a busy day for all the things that are so close by... 17 Mile Drive, the beach, shopping...", "helpfulness": 1, "user": "Carmeltourist", "date": "January 13, 2009", "id": 23535359}], "location": {"country": "United States"}, "variance": {"poor": 7, "average": 20, "very good": 62, "terrible": 3, "excellent": 362}, "aka": "Lamp Lighter Inn & Sunset House Hotel Carmel", "slim_ranking": 0.0322580645161, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "A small seaside Inn centrally located in downtown Carmel. We offer free parking, beach chairs and breakfast. On weekends we have wine and some other small dishes for our guests."}