{"user_rating": 4.5, "review_count": 823, "name": "Landmark Bangkok", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Landmark Hotel Bangkok", "title": "Lovely Landmark", "helpfulness": 12, "user": "Globetrottin_Grannie", "date": "December 19, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6471807, "likes": {"liked": "— Comfortable bed,lovely bathroom,location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with friends", "text": "Spent 2 nights here in October with my husband. It was recommended by our friend who lives nearby. We wanted to break the long journey back to Sydney from Europe, and visit him. So location was everything but the Landmark provided more.", "title": "Had a great stay.Wonderfully located and would recommend it to anyone", "helpfulness": 7, "user": "AndyB67", "date": "December 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6362581, "likes": {"liked": "— excellence of service and the executive lounge", "disliked": "— price of car service could have been better."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The hotel was just lovely, the foyer is gorgeous. There were various shops including a tailor, none of which we used. Our non smoking room was large, 2 queen beds (only used one but it was VERY comfortable and masses of space, luxurious and the bathroom terrific. Only hotel we stayed in on a 2 month trip that had a separate shower and bath. Fluffy bathrobes and a turn down service, fruit platter appeared twice-I’m afraid we didn’t eat any of it. We were on the run most of the time. We had breakfast included (AUD$160.00pn on [----]) and for some reason we were on the lower restaurant for that, got turned away from ground floor 1st day. Not that I had any complaints, the buffet was terrific- Western and Asian food, plus eggs cooked as you like made my husband particularly happy. We had dinner in the Pub one night and also buffet lunch in the upstairs restaurant the day we left because of time constraints for our mate. All were excellent. We didn’t have time for the pool or gym so cannot comment on those. From the smiling girl who opened the door to the helpful guys who loaded our bags in the cab when we left the staff could not have been better. Location is excellent, just 5 minutes to the Nana sky train station. I hadn’t been to Bangkok since ’99 and what a difference to the city the sky train makes!", "title": "Great Hotel", "helpfulness": 11, "user": "CbSurrey", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6090696, "likes": {"liked": "— Service, facilities, room, location", "disliked": "— Expensive drinks in bar"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We are planning to return to Bangkok some time next year and will definitely stay here again.", "title": "Highly recommended, great value hotel......!!", "helpfulness": 14, "user": "JG007", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6024353, "likes": {"liked": "— The food", "disliked": "— There is a small, but steep slope to climb to enter the hotel, might be difficult for older travellers or people with disabilities."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "We Booked through Dial-a-flight with a guy called Paddy. They were excellent by the way . We had 2 stints at the Landmark . 2 nights at the start of our holiday then 10 days in Koh Samui and then 1 night at the end of the holiday.By far the best way to do it. This was our first trip to Thailand and our welcome at the Landmark was lovely .As a previous advisor mentioned it is well worth upgrading for the money to a club room. It cost us an extra $50 a room and with that you get late check out , use of a 24 hour bar, 2 hours of free cocktails and snacks on the 27th floor and 3 free items of cleaning, as well as a few other things. The rooms are lovely and although someone said it was like Antartica I dont agree , the Air con was excellent .Its very humid heat out there and its easier putting a quilt over you than being in a hot stuffy room.Everything connected to the hotel is worth a try too. the Huntsman pub in the basement did nice food, was cool and for the lads showed the footy and the noodle bar next door to the hotel name a couple. Its well positioned for everything too. e.g. the street market opposite , its right next to the skytrain and around the corner from a very good tailors called Raja's fashions on Soi 4. Although the tailor Rajawongse 2 doors up is supposed to be good too. The only thing I would say about the hotel if there was something to be a little negative about it , (but as you see I still give the hotel an excellent rating) is the hotel limousine service. Which was really expensive compared to others, okay still cheap compared to UK prices. I suggest you try to get a driver that is reliable at the airport when you land .They normally stand around exit 3 or 4 on the second or third levelsand use them for your stay there , we had an executive minibus/van on our first visit and you should get these for 800-1200 baht depending on the size of your party I think(dont forget to haggle, they will quote you alot more expensive than that ). . But we were fortunate to get a really great driver at the airport and used him a few times over our second stint there, he had a seven seater Toyota.. To give you some idea he charged us 800 baht for the Hotel to Airport trip and we gave him 200 baht as a tip. Compared to 2500 baht for a limo from the hotel. Enjoy your stay!I may just put his info on a forum page as he desrves more business. He spoke fairly good English ,was always punctual and knowledgable and as I said reasonable too.", "title": "Fantastic hotel!", "helpfulness": 4, "user": "Greg C", "date": "October 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6013713, "likes": {"liked": "— quality", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Excellent hotel. Very good location near the nightlife and skytrain. Loads of restaurants and shops nearby.", "title": "Very nice.", "helpfulness": 2, "user": "Jeffery1", "date": "October 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6004487, "likes": {"liked": "— Nice rooms, location.", "disliked": "— Nothing."}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The hotel is lovely. The check in process is done in the lounge / bar area and is hassle free and completed over a complimentary drink. The rooms are spacious and tastefully decorated. The rates are fantastic value for money and cheaper than the JW Marriott just down the road.", "title": "Very nice hotel", "helpfulness": 9, "user": "pmng", "date": "September 30, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5893202, "likes": {"liked": "— the location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2005, traveled as a couple", "text": "If I had a choice I would stay in the JW simply because I prefer the layout of the hotel. The Landmark is a bit cheaper though, and it compares very well against it and is better in some respects.", "title": "perfect hotel", "helpfulness": 3, "user": "comp1", "date": "September 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5890261}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "If you have booked this hotel then you will be more than happy with your choice.", "title": "luxurious hotel", "helpfulness": 7, "user": "mel5", "date": "September 20, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5825007, "likes": {"liked": "— view from window was amazing", "disliked": "— drink prices in bar were expensive"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006", "text": "I really enjoyed staying in this hotel. It had a great location for the skyrail so you could easily get around Bangcock.", "title": "Great location but...", "helpfulness": 4, "user": "sue14", "date": "September 19, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 5815436, "likes": {"liked": "— Sukhumvit Road location", "disliked": "— Room noise and aircon problems that were never fixed"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2005, traveled as a couple", "text": "This was our first port of call on our honeymoon in Thailand. We upgraded on arrival to a junior suite without great extra expense. This was well worth it as we then had use of the exclusive club on the top floor which included breakfast, afternoon drinks and snacks and cocktails while looking out over the Bangkok skyline. The suite was immaculate and we had great fun playing with the control console which allowed you to play music while in the bath and set the exact temperature you required! The entrance lobby is stunning and the pool area offers interesting views over the city. The hotel is located on the Sukhumvit road which is a little bit away from the main attractions such as the temple of the Emerald Buddha, but the sheer luxuriousness and value for money of the hotel makes up for it. There were a number of good restuarants including a bakery overlooking the street which was handy for a quick lunch and there were good department stores close by for shopping.", "title": "Luxurious Landmark!", "helpfulness": 5, "user": "chrisandbex", "date": "September 17, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 5810090, "likes": {"liked": "— having a luxury suite", "disliked": "— location on Sukhumvit road"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Excellent hotel in good location close to to Nana Skytrain location Stayed 2 nights with two teenage children in Landmark club rooms at their special weekend rates, I couln't fault the hotel in anyway. The breakfast buffet must be one of the best I have ever seen. Every kind of breakfat was catered for. . Upgrading to the Landmarkclub rooms at a slightly higher cost is well worth it especially for the extra facilities you get ,in particular free happy hour drinks and buffett, With two children I found that they could eat as many snacks as they liked and for us parents it was nice to sit there and relax, drinking free drinks for 2 hours in the evening was a delight. The swimming pool was very good . Rooms were very spacious and clean This is an ideal place to stop and see the delights of Bangkok . Upgrading to better rooms also gave us the facility of a late checkout at 6pm which was ideal for our evening flight back to England", "title": "Great hotel", "helpfulness": 8, "user": "pjszms", "date": "August 15, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5611837, "likes": {"liked": "— Location and breakfast buffet", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Absolutely fantastic", "text": "This is a super hotel. The staff are delightful and incredibly helpful. We stayed on a $99 / night weekend break - I think in a lifestyle room - and had all the facilities of the 27th floor business lounge. This means free tea, coffee and soft drinks all day. (Quite a saving when travelling as a family) and a 5.30 - 7.30 pm hors d'ouevres selection which was great at filling the gap for my 16 year old son!", "helpfulness": 8, "user": "alirob123", "date": "August 7, 2006", "id": 5574303}, {"rating": 1.0, "stay_parameters": "Stayed November 2005, traveled with family", "text": "The hotel is located next to the Nana sky train station so all travel is incredibly easy. The river hotels are lovely when all is illuminated at night but the Landmark wins hands down on value! The breakfast was excellent and we also ate at the Japanese restaurant and the Thai restaurant in the Landmark - both again were fantastic value - exceedingly better value than the Peninsular where we had dinner one night and had to pay 360 baht for a large bottle of water!!!", "title": "did not care one bit", "helpfulness": 6, "user": "duffie37", "date": "August 3, 2006", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 5542869, "likes": {"liked": "— shopping area", "disliked": "— poor accommodation"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "Also the night market on the Sukhumvit road is an attraction for getting into the spirit of Bangkok!", "title": "Would Definitely Recommend the Landmark", "helpfulness": 4, "user": "pacifica_gal", "date": "July 29, 2006", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 5523923}, {"rating": 2.0, "title": "Gode value but not quiet!", "text": "I've stayed in the Landmark twice recently. Good things are that it is good value and the club lounge and business centre are, unusually, open 24/7. I stayed on a Lifestyle floor, which has contemporary rooms that look rather better than the regular rooms (although I've only seen the latter by peering in through doors as I've walked past). I had a free upgrade a corner suite this time, which was very nice indeed. I’ve had no problem getting a late checkout either.", "helpfulness": 7, "user": "A449", "date": "July 23, 2006", "id": 5498765}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Only downside is that I got woken up on both visits by the people next door. This hotel is in the heart of one of the nightlife areas and so people do come back late and merry, etc..", "title": "Very nice city hotel", "helpfulness": 5, "user": "greenvigo", "date": "July 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5439858}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "Public areas are good and I found the staff to be excellent and very eager to please. The hotel is right by the Skytrain, and plenty of street vendors, tailors, bars and massage parlours.", "title": "Simply outstanding!!!", "helpfulness": 9, "user": "Taniquan", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 5418809}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "I think it’s a great place for recreation – possibly less good for a business visit.", "title": "A Great Place to Stay", "helpfulness": 6, "user": "Bristles", "date": "July 3, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 5418575}, {"rating": 3.0, "title": "very over-rated", "text": "Recently returned from a trip to Bangkok & Koh Samui and spent 3 nights at the Landmark with my wife, daughter & son-in-law.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "June 15, 2006", "id": 5350349}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 4, "variance": {"poor": 30, "average": 82, "very good": 290, "terrible": 16, "excellent": 405}, "aka": "Landmark Bangkok Hotel", "slim_ranking": 0.155102040816, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "Multistory Downtown Hotel, modern guest amenities, rooftop restaurants, located near the Trade and Exhibition Center."}