{"user_rating": 4.0, "review_count": 111, "name": "Landgoed Duin & Kruidberg", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "My family and I use this hotel in the Netherlands as our base (we are British/Dutch but are living abroad), and each and every stay the staff will do their very best to make your stay as comfortable. Rooms are beautiful and ooze class/style.", "title": "There is no comparison", "user": "o_poelmann", "date": "February 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 97665023}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Food is great, although breakfast can be crowded in the weekend.", "title": "Best hotel in Benelux", "user": "ozinamsterdam", "date": "January 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94716782}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Restaurant 'Vrienden van Jakob' is fantastic!", "title": "Good but service needs some work, not in line with price", "helpfulness": 1, "user": "Katemate01", "date": "January 14, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 92842624}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I would recommend this hotel to families but certainly also business people as its location is near the cities Haarlem and Amsterdam.", "title": "Very nice", "user": "HeatherWilson", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76044349}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "We are looking forward to our next stay", "title": "Very Nice Hotel, we enjoyed evry minute", "helpfulness": 2, "user": "Ronald_jelle", "date": "July 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69334380}, {"rating": 3.0, "stay_parameters": "Stayed April 2012", "text": "The castle is very deceiving, some rooms are indeed in the castle or old house, but the rest, probably about 80% is constructed under ground level, the new wing cannot be seen from the grounds or the entrance because it is under the ground. Now this is something no one mentioned before, the rooms are facing each other there is absolutely no view unless you look to the sky and see the trees and bushes sprouting out of the \"ground\" or the top of your room. The hotel is very clean, the underground expansion of the Hotel, the new wing, the conference rooms and the brasserie mean that acces to the new wing rooms are somewhat maze or labyrinth like. I feel completely cheated having not chosen to pay more and \"upgrade\" To the castle rooms. Almost forgot room service is very limited no breakfast, if you do not make it by 9:30 to the restaurant where breakfast is served until 10:00 meaning they clear breakfast away by 10:00 then good luck finding your breakfast.", "title": "Staying in the trenches", "helpfulness": 1, "user": "noramq", "date": "April 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 127617679}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Impressive estate, clean rooms, good staff, delicious breakfast. The rooms in the old house definitely have much more charm than the ones in the new wing.", "title": "Awesome place", "user": "Diederik_G", "date": "February 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124311724}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We visited Duin- en Kruidberg for a second time this januari. At arrival the house is impressive, as is the hall and the staircase. We had requested a room in the old house ( there are also rooms in the modern annex constructed under the terrace) and were not dissapointed. We got a nicely decorated room under the roof. The bathroom was luxurious. It did not have a tub, but it dit have a very good shower, which suits us better. Though the walls of this old house are not very thick we nevertheless had a very quiet night sleep. It was not untill we had breakfast at sunday morning that we realised that the hotel was pretty busy. Despite the many people the staff managed breakfast very well though. No empty platters, and coffee and tea arrived quickly. We had dinner in the one star restaurant \"de vrienden van Jacob\" (actually the reason of our stay), which was great. And because we were very fortunate with the weather we spend two days walking in the beautifull dunes that surround the hotel and on the beach.", "title": "A very special stay", "helpfulness": 1, "user": "Carla S", "date": "January 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123445610}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Overall we had a great stay in this hotel. The only minus is perhaps the price, compaired to similar luxury hotels we find the rooms a little overpriced.", "title": "Oh my God!!!!", "helpfulness": 1, "user": "Anjuaradhya", "date": "December 15, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121755180}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "This was the last leg of our honeymoon! And what a way to end our honeymoon! We loved every minute of our stay at this place! Highly recommend that you rent a car before you go there so that you can enjoy the picturesque surroundings! And walk around the whole property...its beautifully kept and filled with modern art! We loved the feel of the old-world charm of the estate to the towel-peococks decorating our bed holding a small bottle of perfumed oil at their beak! Food at the michelin-star restaurant was definitely worth the wait of 2 days! The bathrooms could have been made a little bigger and better, perhaps with a bath to go with it! But nevertheless, highly recommend this place for couples just wanting to spend time with each other, with no other distractions!", "title": "A really interesting place but not a good base for Amsterdam", "user": "BeachSwaggie", "date": "November 4, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 120147104}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "One of the very best hotels for location, luxury, dining and service. I could easily go on about each of the main features, but there is plenty of information elsewhere, and I'm sure I'd run out of superlatives!", "title": "Superb - Highly recommended", "user": "mel_the_traveller", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132206023}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "To us, the hotel has got it 99.9% spot on. Other reviewers have mentioned TV quality being a bit poor, but it didn't bother us - did we really want to see Holland lose all three matches in the Euros 2102? I don't think they meant the quality of the football, but the picture quality!", "title": "Elegant stay close to many attractions", "helpfulness": 1, "user": "Tuchka", "date": "June 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131506413}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "Overall, we believe that what really makes the hotel extra special is the exceptional level of customer service from all the staff. Every staff member in reception, management, housekeeping and the brasserie gave exceptional service in a genuinely friendly manner.", "title": "Very luxureus", "helpfulness": 1, "user": "JohnG77", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130734922}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Our family of four stayed at this wonderful estate in May as part of a Keukenhof trip. The weather was horrible, but it was the only downside to our nice stay. The Keukenhof package, including breakfast/dinner/festival entrance, offered by the hotel is certainly well worth it. We were offered a very spacious room in the new wing that easily fit two adults and two kids. I have to note that the hotel charges 25euro per extra bed/cot which is quite expensive, especially given the fact that most hotels do not charge for cots at all. The room and the beds were very comfortable. Brasserie DenK is small and decor is rather simple, but the dinner (surprise menu) was delicious and the service was friendly. As it was very cold, I tried to use the hotel's sauna to relax after spending a day outside. Don't waste your time, the sauna is a ridiculously small infrared kind of portable structure, which takes forever to warm up. A hotel of this level should have more proper amenities. The highlight of our stay was definitely the breakfast! Do not miss it! Wonderful selection of freshly pressed juices (strawberry, black currants etc.), cheeses, breads and of course, the champagne (well, cava, but nevertheless). It made our day! The staff was very friendly and courteous, smooth check out. This is a wonderful stylish alternative to staying in busy city hotels, and it is only 15 min away from Amsterdam by car.", "title": "Terrible Admin", "helpfulness": 3, "user": "Si_Bailey", "date": "May 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 129582328}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Great hotel, very scenic location and both breakfast and dinner were excellent. We've spend a view days in this hotel for a meeting with clients. Both classic and modern conference rooms are available. Hotel room was very nice (2nd floor) and equipped even with a modern coffee machine. TV quality was a bit poor, but there was no time to use it anyhow.", "title": "Sisal carpets?", "helpfulness": 1, "user": "Irgendwo", "date": "April 14, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 127880758}, {"rating": 3.0, "stay_parameters": "Stayed October 2011", "text": "We planned a romantic getaway. So we chosed this hotel.", "title": "Too pricey for service received. Wouldn't recommend it.", "helpfulness": 1, "user": "Titamxnl", "date": "October 30, 2011", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 119887736}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Check in and arrival to room: When arriving check in took too long. Afterwards, the lady from reception explained us how to arrive but the explanation was as it follows: here go the rights then in the stairs to left then go down then to left then to right walk a bit to upstairs and she kept on going... OMG!", "title": "Fantastic experience, I would give 4,5 star", "user": "Dafne07", "date": "October 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119545825}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "There were no clear signs and we were obviously lost until one person of tr staff took us to the room and it was so complicated.", "title": "My best experience in a Hotel in the Netherlands so far", "user": "RJV11", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116595215}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Room: There room was ok. Downside it was separate beds. Too warn at night! Not to nice for a romantic get away. They had free coffee.", "title": "We loved it and we'll be back!", "user": "EvaDenHaag", "date": "August 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116272014}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Service at lounge bar and staff : Ronald was a nice waiter he really put an effort here. We wanted cocktails and there were no at the moment due to internal reasons but still he managed to create one for us. He is the only one smiling and taking care of you. The rest just didn't.", "title": "What a magical place", "user": "TheExpatresse", "date": "May 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 106454014}], "location": {"country": "The Netherlands", "continent": "Europe", "city": "Santpoort"}, "stars": 4, "variance": {"poor": 3, "average": 12, "very good": 44, "terrible": 3, "excellent": 49}, "aka": "Landgoed Duin & Kruidberg Hotel", "slim_ranking": 0.333333333333, "description": "Our hotel and conference retreat offers 75 luxury hotel rooms, the Michelin-starred restaurant De Vrienden van Jacob, a modern Brasserie & Loungebar DenK and a variety of classic style rooms. Our modern banquet rooms can be used for venues for meetings, conferences, dinners and receptions."}