{"user_rating": 3.5, "review_count": 269, "name": "Landguard Holiday Park - Park Resorts", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "We got a Sun holiday so weren't expecting much and this was our first caravan holiday, so maybe it's just not for us.", "title": "Awful!", "helpfulness": 4, "user": "clairey20", "date": "November 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 144727107}, {"rating": 3.0, "title": "Good job I paid in Tesco vouchers !", "text": "The site was probably 75% empty but we were given a caravan as far away from the carpark and amenities possible. We thought this was unnecessary especially as you had to walk through a mud bath to get to it (no path that far away). As a result, the caravan was covered in mud for the duration of our stay.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 5, 2012", "id": 144679448}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Our beds weren't made up when we arrived so we had to get linen from reception, although the staff member did offer to make the beds for us.", "title": "Small, family park", "helpfulness": 2, "user": "Lichfieldlady", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 144410193}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "The caravan was filthy. Sticky door handles, dirt on the bathroom floor, cobwebs everywhere, strange splatterings along the bottom of the walls, melted chocolates on the sofa area. Pretty disgusting really.", "title": "lovely sun holiday", "helpfulness": 2, "user": "sarahnjez", "date": "November 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144410118}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "It was freezing cold and one heater in the louge was not adequate. Understandably, this is not the fault of the park but the option of an upgrade for first timers would have been nice. Also, because it was so cold, there was constant condensation running off the windows which meant my 3 year olds duvet got completely soaked through one night, so we were not very pleased about that!", "title": "Good value for a Sun holiday", "helpfulness": 2, "user": "Steve C", "date": "November 3, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 144364503}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "No complaints with the staff or the cleanliness, park was only half full and we would have upgraded if the cost of upgrades wasn't so high, perhaps an out of season reduction would be a good idea. Caravan was liveable and as expected for bronze level. Not being able to bring car alongside caravan meant carrying bags from car park which isn't much fun in the rain across grass. The park is a fair distance from the beach and not very well signposted from the road", "title": "Friendly but....", "user": "Mtaf1979", "date": "October 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 143797671}, {"rating": 4.0, "stay_parameters": "Stayed September 2012", "text": "Landguard is a small, quiet holiday park which was no where near full when we stayed. We stayed in a 'gold plus' caravan which was spacious and well equipped. However, it was not particularly clean when we arrived which was odd as we arrived at 1pm for a 1.30pm check in and we were told to come back at the correct time because they hadn't finished cleaning it! The shop assistant was very friendly and helpful. The swimming pool was very quiet but it was low season. We had breakfast in the restaurant one morning which was ok but the chef was also waiting and operating the till and there didn't seem to be a lot of hand washing going on! We have a small baby and so we didn't experience the evening entertainment and therefore can't comment on it. One last complaint - the parking spaces are nowhere near big enough! Despite my complaints, NONE of these things ruined our holiday. We had a lovely time and would go back again.", "title": "Nice, quiet holiday", "user": "Manfa86", "date": "October 16, 2012", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 142975386}, {"rating": 3.0, "title": "was ok but the bar was closing at 10.15 not good also could do with more enterment for adults", "text": "would like it if ther was more life very dead in the evening and the bar was open longer, the lights down to the bars was not on till we told sekuarety. i very neary fell in the dark the two girls lucy and jane were exlent thay had to sing and look after the music corner", "user": "A TripAdvisor user", "date": "October 16, 2012", "id": 142964277}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This was the second time we have stayed at Landguard and I really enjoyed our stay in a platinum lodge. We were in No 21 and it is really nice. The only 2 criticisms were that there were no coat hangers in any of the wardrobres and our mattress was very lumpy. I know it wasnt just ours as 11 of us were staying in my party and some of the other said the same.", "title": "Lovely if you stay in a platinum lodge", "user": "Helen B", "date": "October 12, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 142629427}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Other than that the accommodation was great and in a good location.", "title": "Nice quiet park", "helpfulness": 2, "user": "Richieb123456", "date": "September 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141432157}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We got a cheap deal through a sun holidays and paid £38 for 5 days / 4 nights. When we arrived we were really early as we got the 10 AM ferry instead of 11 AM. When we got there they said the caravan was not ready but would call us when it was so we decided to have a walk along shanklin beach. After half an hour they called us so had clearly made an effort to get us fitted in. They then surprised us as they had upgraded us to silver although we were suppose to be in basic. It was very modern with fully fitted kitchen with all the mod cons. It was clean and had lots of space.", "title": "Good value for a sun holiday.", "helpfulness": 1, "user": "FieldClan", "date": "September 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 140862178}, {"rating": 2.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The facilities on the park needed updating as we picked this and I went there as a kid 15 years ago and it looked the same. The swimming pool is small and would be a nightmare in the summer. The bar is good but a bit expensive and not very busy but suspect people stayed in as on a cheap get away.", "title": "Not so good", "user": "Grahame C", "date": "September 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 140597702}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "For a sun holiday it was well worth it but would I pay £200 a week, probably not!!", "title": "A lovely place to stay", "user": "Lady_Ralph", "date": "September 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 140336370}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Car parking minimal and a long way from the caravan, caravan very old and tatty although clean, the whole place gave the impression of a prison camp, row upon row of caravans.", "title": "Ok, but could be so much better", "user": "Penguin66", "date": "September 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 140323745}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Arrived at 3.45 and told to go away until check in at 4 pm!!!", "title": "Not bad going!", "user": "Kari E", "date": "September 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 140142556}, {"rating": 4.0, "title": "Wonderful Break Away", "text": "After reading such awful reviews on this site we were very apprehensive about going on holiday, having booked with The Sun so unable to change it. The holiday was lovely the park was clean and all staff very friendly, although a small park and we did not access facilities it was quiet and peaceful in in lovely surroundings, very central location to all interesting attractions on Island. The caravan we stayed in 2 bedroom was clean well presented and well equipped. The one down side I would mention if the weather was wet it would have been very mucky under foot from caravan to car as there is little pathways.", "user": "A TripAdvisor user", "date": "September 11, 2012", "id": 139969424}, {"rating": 5.0, "title": "PLEASANTLY SURPRISED", "text": "Just returned from a four day holiday (booked with sun offer) a bronze caravan , so was not expecting much after reading other peoples reviews and was getting a bit worried. I had nothing to worry about our caravan was great, very clean and modern with every thing we needed, cooker, toaster, microwave, kettle etc, location was good for travelling around the island. cant comment on other facilities like the pool or bar as we went out every day. All in all in was a good holiday and would go back again.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 8, 2012", "id": 139716383}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "This is the second time that we have been to this park & we have also been to the Lower Hyde Park next door once before. We much prefer Landguard to Lower Hyde, as it is quieter & less busy - although you can use the facilties at both as they are remotely connected at the back of each park. Both times that we have been to Landguard, we have stayed in a log cabin.", "title": "A good base for exploring the Island", "user": "RMAR75", "date": "September 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 139523478}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "They are warm & cosy & well stocked with all the essentials that you need. The lounge & kitchen are open plan & spacious, but the twin bedrooms are cramped. The double bedroom is larger & you can fit in a travel cot. The beds are not particularly comfortable - on both occassions we have been able to feel the springs through them & on our last visit, my sons divan bed had a great big hole on the side of the base (hidden by the bed linen).", "title": "mucky", "user": "lewissuejosh", "date": "September 5, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "sleep": 2.0, "location": 4.0, "service": 2.0}, "id": 139460192}, {"rating": 2.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We booked a log cabin again as they are set in a lovely quiet wooded area, away from the main part of the park & the caravans, although it's only a couple of minutes walk to the main complex. Again we found it lovely & quiet (until the last evening when a particularly noisy family moved in to a lodge behind us & thought nothing of sitting outside on their veranda, shouting, drinking & smoking until 2.30am! But that's not Park Resorts fault). When we arrived there was no table or chairs on our veranda, I spoke to reception & within a couple of hours the furniture did then appear on the veranda (whilst we were out).", "title": "Dissapointed", "user": "miranda109", "date": "September 2, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 139193713}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 26, "average": 51, "very good": 100, "terrible": 29, "excellent": 63}, "aka": "Landguard Holiday Park - Park Hotel", "slim_ranking": 0.666666666667, "description": "Landguard Holiday Park has a lovely friendly atmosphere, set in sheltered woodland, just a short walk from the traditional seaside town of Shanklin."}