{"user_rating": 4.5, "review_count": 3413, "name": "Langham Place, Mongkok, Hong Kong", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Returned to stay at Langham Place again after one year. The service staff are efficient and polite. In terms of location, this hotel is really convenient. A mall with many good restaurants downstairs, linked to Mongkok MTR station, eateries around the streets. Lady's street, Flower Market, Nathan Road all within walking distance.", "title": "Second stay and will stay again!", "helpfulness": 1, "user": "shihlin", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188537186}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "I travel with a child who subsist on porridge/congee, and had no difficulty finding food for her in the 6 days we were in HK. A laundromat is just 100 m down the road if you go through laundry at lightning speed like us.", "title": "Becoming a regular choice", "user": "JLRompas", "date": "December 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188481729}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "For such a location and the convenience, the price tag was reasonable compared to many other hotels. I will definitely stay here again!", "title": "Superb Hotel", "user": "Hansard6", "date": "December 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188355287}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "Stayed here for the 2nd time, the service is still the best i would say. The gentleman at the reception saw me coming with my family, and immediately directed us to do quick check in at the 1865 corner as there was a queue at the regular check in desk ... now that is service :)", "title": "Good location", "user": "KnoxMelbourne", "date": "December 23, 2013", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0}, "id": 188353915}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled with friends", "text": "Chose a different room this time, i would say the room is big enough to accomodate family of 3 with baby and there is plenty of space to store bags etc. The wifi was not strong in that room, however the Nespresso machine made it good.", "title": "Home away from home", "user": "Viccy01", "date": "December 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188343738}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I love this place & this hotel. I always stay there when I am in Hong Kong.", "title": "One of the best hotel in the world !", "helpfulness": 1, "user": "Virg17", "date": "April 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127542322}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "The rooms are very good, the service is excellent.", "title": "lap of luxury", "helpfulness": 2, "user": "marli820", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127489667}, {"rating": 5.0, "title": "best location for a 1st time visit to HK", "text": "Hotel pefectly located with a shopping center directly accessible.", "helpfulness": 1, "user": "alexcochez", "date": "April 7, 2012", "id": 127426586}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "All the night markets easily accessible from the hotel.", "title": "This is a fun hotel to stay at...", "helpfulness": 1, "user": "RPWfour", "date": "April 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127367487}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Do not miss their spa !", "title": "Great Little Gem", "helpfulness": 2, "user": "DiandKevGoldCoast", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127276007}, {"rating": 5.0, "title": "Smiling", "text": "Excellent all round, club floor well worth the extra cost. HK is easy and cheap to get around so location not a massive factor.", "user": "DebJD", "date": "November 15, 2009", "id": 49288828}, {"rating": 5.0, "title": "Excellent value & wonderful service!", "text": "I just returned from 5 nights at the Langham Place and it certainly did not disappoint. When I booked on their website I arranged for a limousine transfer and that was a very civilized way to begin my stay, especially after 18 hours of travel time. (Money well spent!!) The check in was done in room and the \"Angel\" that handled all the paperwork for me was incredibly sweet & patient especially in dealing with my jetlagged brain.", "user": "LovnItSolo", "date": "November 13, 2009", "id": 49134872}, {"rating": 5.0, "title": "The Perfect Hotel - Great Food, Great Staff, Good Location ...", "text": "I stayed in a Prime Place room and it was quite lovely, very spacious, with more hi-tech gadgets then I have ever seen in one hotel room. (The IP telephone was very cool.) The location certainly didn't disappoint as the MTR station is just across the street & there were endless food outlets in the connected mall as well as a grocery store in the basement of the mall. (The hotel's restaurants were excellent as well.)", "user": "Clare33", "date": "November 12, 2009", "id": 49043831}, {"rating": 5.0, "title": "Great hotel. Suitable for all ages easy access to MTR and Ladies Market", "text": "The spa was beautifuf and the staff was incredible (Lillian gave me the best pedicure I have ever had!!!) and the view from the \"meditation corner\" was gorgeous. The artwork throughout the hotel is amazing and it truly is an art gallery masquerading as a hotel. (A very impressive collection of contemporary pieces.) Portal was also a very cool/efficient/relaxing way of handling life while on the road.", "user": "AussieRedwine", "date": "November 12, 2009", "id": 49021174}, {"rating": 5.0, "title": "Langham Place Hotel Mongkok - Modern, well located, clean sanctuary in Mongkok", "text": "If you want to be close to the waterfront then this isn't the place for you but if want a 5 star hotel at an incredibly affordable price then I can't sing the praises of this hotel enough. I will definitely stay here again.", "user": "SkybedStyle", "date": "November 11, 2009", "id": 49014668}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "When we were booking a trip to Hong Kong the travel agent had tried to book us into somehting closer to main area of Hong Kong. We had seen Langham Place in a brochure and after getting a quote the price was actually cheaper for more inclusions and a much better hotel. We stayed there for 7 nights and did not want to leave.", "title": "Loved this Hotel", "helpfulness": 8, "user": "Musrag", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15153335}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled solo", "text": "Before we travelled there we saw that the TV show The Amazing Race was giving a holiday package to the hotel to some winning contestants and that Qantas was now putting it's staff there so we knew (hoped) it was going to be good.", "title": "Superb Hotel", "helpfulness": 5, "user": "Traveller885", "date": "April 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 15153216, "likes": {"liked": "— attention to luxury details throughout", "disliked": "— smallish room sizes"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008", "text": "There is nothing bad we could say about the hotel. The staff were fantastic. I think we counted 10 staff one night just in the lower foyer. One of the girls in the pink outfits was there just to press the lift button for us. They were friendly and courteous.", "title": "What an amazing hotel!", "helpfulness": 3, "user": "OldStreet", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15141729}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The rooms were very modern with a great view. Great to see HUGE LCD Tvs in a country that makes them so cheap. Good for when you are shattered and just want to chill and see what has been happening in the world. It was fantastic to watch the storm and and lightening from the seat on the window sill. The roof top pool was a treat after a hard day of sightseeing with it's piped music or the nice hot spa. Having a lifeguard on the hotel roof was something you don't see everyday. And the best thing it was open all the time except if there was a storm. The change rooms were just as flash with all the extras and was great for when we checked out at 11am but weren't leaving to that night. We went out for the day and left our lugagge there then came back for a swim and then shower which was a greta end to the trip. The mens has another seperate Hot Spa and individual products if you have packed yours.", "title": "I stay here EVERYTIME I'm in HK.", "helpfulness": 2, "user": "DLPA", "date": "April 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 15138851, "likes": {"liked": "— Great rooftop pool!! Rooms, bed, service.", "disliked": "— Distance from HK island - very far."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "If there is one thing that you won't forget is the food. Not only was the breakfast great with service and slection the dessert bar with a Dark Chocolate Fondue in the morning and then they add a White Chocolate Fondue for dinner.", "title": "Langham Place – Many Great Amenities & Super Place – 4.5 Overall for a Us", "helpfulness": 7, "user": "jakester20", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15114039, "likes": {"liked": "— The hotel staff.", "disliked": "— The location."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The Langham Place Hotel is very conveniently located in Mongkok, just a handful of MTR stops away from Central station. First impressions are great, and the views from every floor are outstanding.", "title": "Would definitely visit again", "helpfulness": 3, "user": "Boomskilpaadjie", "date": "November 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 48420751}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The rooftop pool bar is an awesome place to relax after a day's sightseeing in and around the area. The location is ideal and access to local transport is great. The restaurants are fantastic (if a little pricy) and the staff friendly, articulate and helpful without being invasive. The business centre is well-equipped and easily accessible and the gym (on the 41st floor) has treadmills with a view of the whole city...utterly breathtaking.", "title": "My favorite hotel in the world", "helpfulness": 1, "user": "marglo1", "date": "November 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48376776}, {"rating": 4.0, "title": "Nice hotel, but #1 in Hong Kong? Let's not get carried away...", "text": "Lots of lovely little touches...including a pillow menu on your bed and massage tips taped to the bathroom window.", "user": "DanneskjoldRagnar", "date": "November 1, 2009", "id": 48287148}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "Most importantly, if you book early enough, the room rate isn't half bad either!", "title": "good energy here, staff are motivated", "helpfulness": 5, "user": "AthenaIsis", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 4.0}, "id": 48019171}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I adore Langham Place in Mong Kok. I always stay in a Residence Suite with a kitchen. The hotel is clean, the service and staff attentive and friendly. The club room on the 36th floor makes a wonderful breakfast and one can always visit the club for a free diet coke, beer or wine. The view is wonderful and the top floor Spas professional and relaxing. Sometimes the Internet is a tad weak, but despite this I love this hotel. Very easy access by taxi to Kowloon and Hong Kong.", "title": "Amazing - Worth every penny.", "helpfulness": 2, "user": "LPass16", "date": "October 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48017548}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "My husband and I stayed at the Langham Place in Mongkok 23 Sept for 4 nights. I was a bit hesitant at being in Mongkok but am now convinced it is the best place to stay. It is one small block down from Nathan Rd. The rooms are a touch small but that is usual for HK and was quite manageable. The staff were very friendly and helpful at all times. We were actually upgraded to a suite as our window started leaking water (leftover from the heavy typhoon). If you would prefer not to pay for a full breakfast, try the Delifrance literally next door to the hotel, through the overhead pass. The breakfasts are cheap and the baguettes always amazing. For those Aussies, don't forget to pack your vegemite!", "title": "Fantastic Hotel, great position", "helpfulness": 15, "user": "LucylovesMelbourne", "date": "October 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3998305}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "The hotel's internet facilities were brilliant. They have 8 computers, a mixture of mac and pc all high speed and free to use any time. The adjacent shopping centre (Langham) is fantastic. If you are looking for young, hip original designers go to the ozone and spiral levels, very inexpensive. Go and look at Muji there, is fantastic. The food court is also good at the bottom of Langham shopping centre, good sushi, etc.", "title": "simply superb hotel and location", "helpfulness": 18, "user": "franyg", "date": "July 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3645857}, {"rating": 5.0, "title": "A wonderful experience!", "text": "WE booked into langham place hotel for 8 days late june and what a hotel it is! We were upgraded to the langham Place Club Lounge which gives you breakfast, afternoon tea, and canapes and cocktails in the evening, Our room was on the 35th floor with great views over the harbour and markets, The hotel is situated in the heart of mongkok which is very busy and vibrant, lots and lots of shops, it is aslo conected directly to the MTR via the shopping mall. The restaurant - Portal - offers excellent value for money there is so much of a choice at the buffet or if you prefer you can have a la carte menu, the desert section is to die for, warm running white and milk chocolate!!!!!!!. We were certainly well looked after and the staff in the club lounge extremly helpful and pleasant at all times, you are able to borrow CD's and DVD's from there for your room. The room was spacious and the 42inch Plasma tv was wonderful, you are able to sit in the bath and watch tv, as ita all glass, there is a blind to pull down if required, absolutely fabulous. Were only 10 mins away from downtown kowloon by MTR, but were near all the famous markets eg flower, bird, ladies, temple st. We would have no hesitation to stay hear again and would highly recommend it to anyone. check out the pics.", "helpfulness": 13, "user": "gromek", "date": "June 28, 2005", "id": 3617572}, {"rating": 5.0, "title": "My #1 Hotel Stay ever", "text": "Absolutely fantastic, best hotel experience i have had.", "user": "AustRob", "date": "August 7, 2008", "id": 18727339}, {"rating": 5.0, "title": "What a \"Place\"", "text": "Me and my girlfriend decided to have a 2 day stop over in hong kong on our way back to Australia from the UK.", "user": "AustRob", "date": "August 7, 2008", "id": 18705712}, {"rating": 5.0, "title": "Great overall hotel.", "text": "The room could not be faulted whatsoever, the standard was fantastic and beautiful.", "user": "aprice88", "date": "August 7, 2008", "id": 18705645}, {"rating": 5.0, "title": "Great Stay", "text": "Views were phenomenal, with views of the light show at night and the hong kong cityscape.", "user": "Duncan0808", "date": "August 6, 2008", "id": 18671682}, {"rating": 5.0, "title": "Cannot fault this place", "text": "Service was fantastic, unfortunately my girlfriend had an accident were DARK PURPLE nail polish was spilt on the carpet, now at most other western hotels im sure we would of been looked down on us for the rest of the trip and ultimately charged for cleaning etc. Not here, they just sent up the correct people, cleaned it, the service standard did not change and we were not charged for the steam cleaning.", "user": "Blossom55", "date": "August 6, 2008", "id": 18664120}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "We arrived late at night and had to set up an event. The staff went out of their way to do this and nothing was too much truble. At the event, the service was great and food above the average. The location is superb - a stone's throw from Nathan Road and the TST station. Also great for the Star Ferry. This hotel is all class and I would recommend it to other business users. The event packages are good and they have a good range of room sizes.", "title": "Excellent out of hours help on setting up venue, and great service on the day", "helpfulness": 2, "user": "Strangyhk", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 48952753}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I stayed at the Langham place for a long weekend at the start of November, luckily with the travel industry friends discount. When checking in we upgraded to the next grade of room (can't remember the name) for only HKD$150 a night. The room was so lovely with amazing views of the harbour and fantastic little touches like a dvd player and ipod dock -oh and the shower was so powerful it was like a massage! The spa facilities are great, and the roof top pool/jacuzzi are great but my favourite was the oriental hot tub which was so relaxing. The Place buffet for breakfast is pricey but I would say definitely worth a visit once when you are there. I would totally recommend it everyone as it is great for couples, families - anyone. I can't fault the location - it is inside a great mall with fantastic shops and a big food court and a station at the bottom.", "title": "Wonderful hotel suitable for everyone", "helpfulness": 2, "user": "CityTravelFan", "date": "November 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48911637}, {"rating": 5.0, "title": "Great hotel", "text": "We had a wonderful time at the Langham Place hotel. We stayed at the club floor. Very nice rooms, superior service!", "user": "cstreit2000", "date": "November 10, 2009", "id": 48910095}, {"rating": 5.0, "title": "Best hotel ever stayed in! - Great Spa!!", "text": "Stopped in HK for a few days and found the Langham Place hotel. This is better then many other world class hotels that I have stayed in such as many Pan Pacific hotels. The spa is just sensational!", "user": "marshallies", "date": "November 9, 2009", "id": 48840257}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "My new husband and I stayed at Langham Place in Mong Kok on the first leg of our honeymoon. The hotel deserves its 5 stars, everything was perfect, I cannot think of anything to improve our stay there. The room and bathroom were well equiped, spacious and of very high quality . The service and staff were excellent, nothing was too much trouble. We upgraded to the Club L facilities and they were worth every penny. The rooftop pool was lush. I would highly recommend eating in the Ming Court restaurant as the food was absolutely delicious. If we were ever to go back to Hong Kong we would definitely stay at Langham Place, it was simply one of the best hotels we've stayed in.", "title": "Absolutely fabulous!!! Exceeded all expectations!", "helpfulness": 1, "user": "thecat777", "date": "November 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 48641424}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Great location if you have any business in area. We were working in office tower connected through mall so how can you go wrong? Mall offered shopping and food of any variety as well as a lower level grocery store where any food and beverage could be gotten.", "title": "Great hotel in great location", "user": "PPTA", "date": "January 1, 2014", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 189211204}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Rooms were nice size and nicely decorated. Staff was helpful and friendly.", "title": "Good Location, Excellent Service, Chaotic Breakfast", "user": "phoenixmemphis", "date": "January 1, 2014", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 189210577}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled on business", "text": "Fitness center was large and nicely equipped.", "title": "Excellent Service, They Couldn't Do Enough", "user": "JAFA79", "date": "January 1, 2014", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 189203876}, {"rating": 5.0, "title": "Excellent service", "text": "Easy access to metro to get around.", "user": "Jusan J", "date": "December 31, 2013", "id": 189107888}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "A very nice week long stay; would definitely recommend and stay here again.", "title": "Excellent location and services but for some small flaws", "user": "ahleongsan", "date": "December 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 2.0, "location": 5.0}, "id": 189087755}, {"rating": 5.0, "stay_parameters": "Stayed July 2007", "text": "A great hotel with fantastic service. While the rooms have been slightly small the level of service by hotel staff certainly made up for it. In-room access was provided complementary for club rooms which was a nice bonus.", "title": "Fantastic", "helpfulness": 3, "user": "sj0001", "date": "July 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 18060026}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "In an interesting area too, adjoining a mall with an MTR station for convenient access to the rest of HK.", "title": "Great Experience", "helpfulness": 3, "user": "JenVAyr", "date": "July 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 18044997, "likes": {"liked": "— Time Out Hong Kong", "disliked": "— tv in the lounge"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "After weeks of dealing directly with the hotel I ended up with a fabulous deal. Stayed in a spa room for one night as was booking a treatment anyhow and the price worked out the same. Started with a standard room but watched their site and eventually had a suite deal for £10 more per night than a standard room. Whole experience fabulous, from being collected at the airport with a member of staff waiting for us at the door. Spa room was small but fabulous, the whole experience made us forget about any jet lag. Access to the members lounge well worth it, had a few drinks there every night and some food after tours and shopping. Breakfast is better in the main area but much busier than the lounge. Loved the luxury but being left alone at the same time. Buy an Oyster card, well worth it. Not really worth getting the train up the Peak as you can't see anything. You can use your Oyster card on the star ferry and then get a bus to the Peak - better than making your way into town, walking and joining the long queue for this short journey. If you are vegetarian remember that most of the food contains oyster sauce ! for fast food, recommend curry in a hurry within the mall.", "title": "The best HK experience!", "helpfulness": 4, "user": "jillgerod", "date": "July 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 17998107}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I've been to HK many times but this trip by far was the best in terms of hotel experience. Langham Place is a great hotel with superb personal service and fantastic food. YOU MUST UPGRADE TO THE CLUB ROOMS! It's worth it and completely changes the experience. From check in to the personal room walk through, everything is 5 star personal service. And the 24 hour lounge, massage chairs, free-flowing drinks and snacks are perfect after a long day of shopping and walking around town.", "title": "Diamond in the Rough", "helpfulness": 7, "user": "KarlManila", "date": "July 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 17854326, "likes": {"liked": "— Full amenities", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "One drawback is the fact that it's located all the way in Mongkok. However, they compensate by having a pretty good mall beside it and the MTR station just a few steps away.", "title": "Great Location", "helpfulness": 2, "user": "Parto", "date": "July 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17775868, "likes": {"liked": "— Location and Internet", "disliked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I can say little more that perfection.", "title": "Fantastic", "helpfulness": 4, "user": "PMRMoto", "date": "July 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17639444, "likes": {"liked": "— Everything!!!", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "Room was dramatic, high quality and staff, food and everything else backed this up.", "title": "Great Location & Service - Small Room", "helpfulness": 6, "user": "London_Traveller45", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 17496723, "likes": {"liked": "— The location, Fitness Center, and great staff", "disliked": "— The small room"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "A memeral place to stay, staff advise on where to go and book for you if you want, I cannot recommend this hotel highly enough.", "title": "Fantastic facilities and service", "helpfulness": 5, "user": "travelkenUSA", "date": "July 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 17494127, "likes": {"liked": "— Facilities and comfortable beds", "disliked": "— Location is a little far from tourist attractions"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "We stayed at Langham Place for a two-night holiday in their standard double room. The hotel is very luxorious and right in the center of all of the markets, so very central location. Everyone at the hotel was very helpful and always courteous. The room was very small, but this seems to be standard for Hong Kong. We were travelling with our 4-month old baby and the staff was great about setting up a nice crib and even giving us a basket of baby necessities (baby soap, lotion, etc).", "title": "Looks can be deceiving", "helpfulness": 5, "user": "rossco747", "date": "July 1, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 17390527, "likes": {"liked": "— The location", "disliked": "— The noisy rooms and uncomfortable beds"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The workout room is amazing - one of the best we have used (and we've used a lot). Overall, a great hotel and a bit of luxury as long as you don't mind the small rooms.", "title": "Fantastic for families", "helpfulness": 5, "user": "Dunnman", "date": "June 30, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 17385188, "likes": {"liked": "— spa, pool and food", "disliked": "— size of room"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Following our visit in October 2005 for a stop over, we used the Langham Place as our base for an extended visit to Hong Kong. Just at the end of the Chinese New Year, the atmosphere was great. This time we stayed in a Club Room and use of the Club Lounge.", "title": "A Return Visit that did not disappoint", "helpfulness": 2, "user": "pencefn", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12204127, "likes": {"liked": "— The facilities of the rooms"}}, {"rating": 5.0, "title": "Great hotel, lived up to all the great reviews", "text": "A nice touch was the complimentary desert from the hotel management on the occaision of my wife's 40th birthday.", "helpfulness": 3, "user": "VeggiegirlMarlow", "date": "January 1, 2008", "id": 12201083}, {"rating": 4.0, "stay_parameters": "Stayed December 2007", "text": "The location was perfect for access to all parts of Hong Kong, Kowloon and the New Terrotries - through the MTR and a Hong Kong Octopus Card.", "title": "A smart, fabulous hotel", "helpfulness": 2, "user": "sojourneys", "date": "December 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12121670}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Loved the hotel and the location. Took our 2 teenage boys with us who also really enjoyed their stay. Great that the hotel was attached to the mall. Staff were friendly and helpful. Rooms small but comfortable. All the facilities were first rate. would definitely stay here again.", "title": "It’s the little touches that count (a detailed report)", "helpfulness": 34, "user": "reddiguy", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 11931678, "likes": {"liked": "— Great value, and superb staff who treat you like royalty!", "disliked": "— Nothing - we loved everthing about it!"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Hotels in Hong Kong are aplenty, from the typical backpackers inn to fabulous temples of luxury. The Langham Place Mongkok exists on the upper end of the spectrum, boasting some smart, well-appointed features without completely depleting one’s budget.", "title": "If you're going to HK stay here!", "helpfulness": 7, "user": "jimmac_7", "date": "December 24, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 11929343, "likes": {"liked": "— The style of the hotel", "disliked": "— The prices in the bar!"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We stayed here twice over Xmas on stopovers and deeply grateful for the understated luxury and overall calm of the place.", "title": "Excellent", "helpfulness": 3, "user": "Pelikan", "date": "January 11, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 12515279, "likes": {"liked": "— Calmness, views"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The other reviews say it all, though I would say the roof-top pool is the largest I've ever seen AND deep. The attitude and service of staff was faultless, perhaps a little too attentive in the Ming Court restaurant where the warm hand towel was replaced every time I touched it!. We used the (chargeable) limousine service (Mercedes S-Class) and would recomend it, especially if you have heavy luggage.", "title": "Xmas in Hong Kong", "helpfulness": 5, "user": "belfast-jj", "date": "January 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12443583, "likes": {"liked": "— Staff - location"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Recommendations: Tea Museum in Hong Kong Park (on the Island)", "title": "Luxury hotel at an affordable price", "helpfulness": 3, "user": "ylc25", "date": "January 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12424675, "likes": {"liked": "— clean bathroom", "disliked": "— Nothing"}}, {"rating": 5.0, "title": "Great Value!", "text": "1st class Hotel - Amazing staff.", "helpfulness": 3, "user": "marils_sf", "date": "January 7, 2008", "id": 12398956}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "We had booked the hotel in Feb 2007 - during the summer i noticed a brilliant rate for a suite, so i emailed the hotel and explained that we were staying till the 3rd of Jan and special rate was up on the 31st of Dec - No problem they extended the deal for us.", "title": "Great hotel", "helpfulness": 4, "user": "GaylePDublin", "date": "January 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12359808, "likes": {"liked": "— Location and spa", "disliked": "— Cost of internet in room"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Staff are attentive and very helpful. Not sure what not to like about this hotel. close to everything, great comfort, amazing helpful staff-nothing is too much bother, great equipment.....super, fantastic!", "title": "SUPPPPPERRRRRRR", "user": "Voyagermundo", "date": "April 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127275427}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed at this hotel for the first time for b-trip. It was one night stay but quite expensive. Was expecting a bit more spacious room with the price range and the location (it is in Mongkok although quite conveniently located - near MTR station). The check-in/out process was swift - expected from Hong Kong - always fast pace. Breakfast selection was OK as well. I would suggest lower your expectation for this hotel. With the relatively high price, neither breakfast nor internet was included. A side note: The phone in the room was a bit too complicated for normal user - took a while to figure out.", "title": "Good location, small room, OK value", "user": "carbonxiv", "date": "April 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127274302}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "It was a great start indeed. I would say Very very pleasant check-in experience for me and my bf who have been travelling for years to different hotels. When we arrived we noticed that there were at least 6 front desk staffs and they were being extraordinary efficient and helpful. Teaky (hope I spelled her name right) managed to not only check us in efficiently, she did a great upsale to us by providing a small but extremely thoughtful proposal - for only HKD 380, we will get a bigger room with separate bath, free iphone4 usage with 3G and local call & Nexpresso machine!!! She has also helped us with the booking of the 2 michelin star restaurant Ming Court in the hotel with no hassle.", "title": "Very efficient Check-In but not Check-out", "helpfulness": 1, "user": "Cheery66", "date": "April 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 127228897}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Our room is at high level with nice view, bed is very comfy, room is not big but reasonably fine . Location is fantastic.", "title": "Great hotel and service !", "user": "travelbird54", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 127193476}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Everything seems very very well until the check-out :( We have waited for more than 10 minutes for checkout and I walked to ask one of the staffs as I noticed there were 2 front desk staffs attending to one customer who is checking in. Why would there a need of 2 people attending to one customers while there were obviously other customers queuing up. She didn't attend to us but just informed us to wait. Then I heard some other customers were complaining in the Q with the same questions \"why issit taking so long??\"", "title": "Langham Place Mongkok", "helpfulness": 1, "user": "JayManila", "date": "April 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127179066}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "My boyfriend and I booked this holiday with Thomas Cook Signatures as a package deal, 3 nights in Hong Kong, 3 nights in Bangkok and 10 nights in Phuket, Thailand.", "title": "An honest review!", "helpfulness": 11, "user": "donna2810", "date": "April 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7407192, "likes": {"liked": "— Location and facilities", "disliked": "— nothing...everything was perfect!"}}, {"rating": 5.0, "title": "Location, location", "text": "If you would like any further info, or have any questions, please feel free to email me on dcartwright@protocol-skills.co.uk.", "helpfulness": 20, "user": "johncharles", "date": "April 18, 2007", "id": 7391259}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "This hotel is FANTASTIC!! My boyf and I have been to a fair few cities, and this hotel beats any hands down. It about an hours drive from the airport, or you can get the underground train direct from there to street next to hotel.", "title": "Don't stay here", "helpfulness": 13, "user": "luby", "date": "April 18, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 2.0, "value": 3.0, "location": 3.0, "business": 3.0}, "id": 7389976, "likes": {"liked": "— nothing", "disliked": "— comfort"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "When we arrived, we were greated immediately by friendly and helpful receptionists. We were given a warm towel to freshen up which was great after the 12 hr plane journey.", "title": "Fantastic Labgham Place", "helpfulness": 7, "user": "bluebrummy", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 7388967, "likes": {"liked": "— Facilities", "disliked": "— Room Size"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Our room was on Floor 15, and was a superior room. Perfect for us! The bed was very firm but VERY comfortable, with a flat screen TV and DVD player (not that we used it!).", "title": "Is O K", "helpfulness": 10, "user": "ac5354", "date": "April 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7350671, "likes": {"liked": "— The size of the room"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "I would have to agree with all the positive things that were said in the previous reviews. My favorite part was the incredible smell. Everytime you walk into the lobby, the aroma just surrounds you. So, we had to ask the hotel how they do it. It turns out that they actually bottle it up and sell it. It's called Ginger flower oil and I brought 5 bottles home. Now my own home also has the incredible smell and it reminds me of the wonderful time we had in Hong Kong everytime. And try to get a reservation at \"Aqua\" restaurant. Pricey, but the view is incredible.", "title": "Smells amazing", "helpfulness": 13, "user": "catseattle1", "date": "December 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4217049}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "I stayed at the Langham with a friend in November and it was a truly great experience. We had a twin executive room that had the most spectacular views. The rooms are well appointed and extremely comfortable. We received outstanding service during our 5 night stay, the staff at reception and particularly concierge provided excellent advice and were attentive and friendly. The hotel has the most amazing gym, pool and spa areas, I only wish we had more time to take advantage of these facilities. We did however manage to visit the lounge bar, one floor above reception, and enjoyed the happy hour 2 for 1 drinks and live music. The hotel is connected to a shopping complex and we found this convenient when we wanted a quick breakfast at Delifrance or Starbucks. Mongkok is an excellent location, it has the ladies market, great shopping, and good local restaurants. The MRT and KCR stations are a short walk from the hotel and the cheapest and easiest way to get around. I would recommend the Langham to anyone looking for value for money, location and service, it is a great hotel.", "title": "A Great Hotel- Can't wait to go back.", "helpfulness": 9, "user": "Kate D", "date": "December 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4162062}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "This hotel has it all: friendly service, stylish rooms, easy access to the rest of the city; lots of shopping; knowledgable concierge staff; chic bar with live entertainment. The place is easy. Very friendly with no hassles.", "title": "When can I return?", "helpfulness": 9, "user": "xhjsx", "date": "December 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4157573}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "The breakfast buffet is situated in an elegant, tiered room and offers a large variety of chinese, japanese and western foods. You can have dim sum, freshly prepared omelets, a variety of very fresh pastries and fruits, miso soup, smoked salmon. It goes on and on.", "title": "We loved it at Langham Place!!!", "helpfulness": 9, "user": "cinnabun1", "date": "November 26, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4144871}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "Step outside and you're in the middle of Chinese Hong Kong (Kowloon). Next door you can purchase Armani or Gucci and two blocks away you're in an open air clothing market. (Beautiful silk robes and jackets for about $25, jeweled clutches for $10. etc)", "title": "Joined the majority of the crowd here", "helpfulness": 7, "user": "restless_insfo", "date": "November 25, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4142534}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Stayed at the Langham Place (not to be confused with The Langham which is much grander) for 7 nights during a recent business trip. Have stayed in several of the Kowloon side hotels over the years and have to say this is one of the best.", "title": "Comfortable Hotel - maybe not Number One though . . .\"", "helpfulness": 1, "user": "poochy76", "date": "October 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 47971877}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "The hotel is quite a strange shape with the lobby being on the 1st floor and the entrance area is quite small and unimpressive apart from some rather ugly artwork,(they portray themselves as an arty hotel with many commissioned pieces through the hotel).", "title": "Totally professional", "helpfulness": 2, "user": "Otsi", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47850810}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "The lobby is again small by HK standards with limited seating. The buffet restaurant is also on this level. Above is a mezzanine floor containing the Portal Lounge/Bar which has it's own resident DJ and internet access. You can eat here too but the tables are either low level or high level with stools!!", "title": "This Hotel should be called Langham PALACE", "helpfulness": 3, "user": "373RESQ", "date": "October 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 47464469}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The menu throughout the hotel is a little limited but tasty - I would highly recommend the carbonara or The Burger!", "title": "Great Hotel with good facilities and excellent staff.", "helpfulness": 2, "user": "EJOWSussex", "date": "October 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 47437398}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "So the room - I had the basic room on the 19th floor. It was a nice touch having a separate desk area which screened the bed - making the room feel larger than it was - a bit smaller than other rooms I have stayed in. The main phone is quite high tech and a little confusing also!! They also provide you with an ipod/iphone dock which also charges - really handy for me as I use my iphone as my alarm clock also.", "title": "Great hotel in Kowloon", "helpfulness": 2, "user": "JetSetGirl", "date": "October 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 47348709}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Langham place is the best hotel I have stayed in. My husband and I spent three nights in this wonderful hotel after a long trip in China.", "title": "wonderful langham", "helpfulness": 2, "user": "chazbelgique", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13165909, "likes": {"liked": "— facilities, staff, location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "It’s modern, luxurious, and very comfortable .The staff is helpful and friendly.", "title": "wonderful hotel", "helpfulness": 2, "user": "jcb 1", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13164807, "likes": {"liked": "— its position", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The location is perfect, the hotel is attaches to the mall, only a few minutes walk to the Mongkok metro station, and surrounded by markets, shopping and restaurants.", "title": "Near Perfect - Service was the key", "helpfulness": 3, "user": "Thang2166", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13161957, "likes": {"liked": "— Unbelievable service", "disliked": "— Pool was renovated when we stayed"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "The buffet breakfast is also delicious with a great amount of choices.", "title": "Great hotel", "helpfulness": 2, "user": "fred_shen", "date": "January 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13157174, "likes": {"liked": "— quality", "disliked": "— in room internet charge"}}, {"rating": 5.0, "title": "\"Excellent, Brilliant, The Best. Awesome, Wicked\"", "text": "The best thing in Langham place is the swimming pool, spa and the gym in the 41 floor with a magnificence view.", "helpfulness": 5, "user": "AndyBrown", "date": "January 25, 2008", "id": 12986680}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The value for money is nearly as good as it gets for Hong-Kong -- a perfect score would be awarded if the hotel be located in Central. Excellent service, and they make an accentuated effort to remember their regular guests and preferences. Modern and clean spa and gym facilities. Buffet breakfast is outstanding. Worth upgrading to a premium that includes a bath overlooking the city view and unlimited internet -- they charge internet for each device otherwise. The rooms are perfectly designed to accomodate every traveler, and everything has been thought of.", "title": "Nearly Perfect Business Hotel", "helpfulness": 1, "user": "Patrick M", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127099821}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The hotel is located near if not adjacent to one of tourist/shopping area called Ladies Market. Yes, u right. The place is very suitable for ladies doing shopping with cheap and bargainable price. For business traveller, the hotel is also easily accessed to business district. You can take MTR from Mongkok station which is located below the hotel and head to wherever business district you want to.", "title": "Nice and convenient hotel", "helpfulness": 1, "user": "Bonaventura N", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127072849}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "After exhausted with your shopping or business, you can have a very relaxing moment on 41th floor. You can go to spa, albeit a bit expensice (approx HKD 1,000-1,500 for a 1.5 hour massage), or use the jacuzzi located next to the pool or inside the changing room. I bet your energy must be recovered afterwards.", "title": "Langham takes care of our situations in a grand manner.", "helpfulness": 1, "user": "waccavbirdie", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127055841}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "The breakfast is standard for 5 star hotel. If you want to try having breakfast dim sum, there is a good dimsum restaurant located next to HSBC Mongkok building. I don't recall the name but you can ask the detail to hotel concierge. They are willing to help you on this.", "title": "chinese restaurant", "helpfulness": 1, "user": "des2duck", "date": "March 31, 2012", "detail_rating": {"value": 4.0, "location": 4.0, "service": 5.0}, "id": 127010759}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "For airport transportation, you can take hotel shuttle or go by Airport Express Train from Kowloon. For the later, you must continue the journey by free hotel bus on Kowloon station.", "title": "Top of the line", "user": "IrishOaxaca", "date": "March 30, 2012", "detail_rating": {"service": 5.0}, "id": 126958684}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We had an amazing 3 night stay in this hotel, without doubt one of the best hotels we’ve ever had the pleasure of staying in. The first thing that struck us on arrival, aside from the extremely friendly and efficient staff, was the smell. We later learned that ginger is the Langham’s signature scent which permeates throughout the hotel, extremely subtle yet noticeable but just beautiful. We were offered an upgrade for HKD 500 per room per night, even if the rate is a little more expensive as we travelled off peak, I would recommend availing of it as it was money well spent. The upgrade gave us access to the club lounge, which had food and drink served all day and also included breakfast each morning, an exquisite buffet selection with some chefs on hand to rustle up an omelette of your choice! The rooms are extremely comfortable and modern, a reasonable size with some great views of the city. The hotel itself is located beside the metro station which makes it a good base for travelling around the city. When we booked our trip to Hong Kong I was disappointed that we weren’t staying at the renowned Mandarin Oriental, but once we entered the lobby of the Langham we felt it couldn’t be much better than this.", "title": "An Amazing Hotel", "helpfulness": 3, "user": "mgirishrover", "date": "May 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15523865}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "This was our first trip to Hong Kong and we selected the Langham Place Hotel purely on the reviews we had read on Trip Advisor. I have to say this hotel thoroughly deserved its No. 1 ranking and we would definitely return. I would also strongly urge everyone to upgrade to a Club room. The extra you pay per night is well worth the first class service you receive from the moment you arrive at the hotel, and the polite and attentive service you get in the Club Lounge throughout your stay. It really was a pleasure after a long flight to be met by our pre-booked people carrier, to be given soft drinks en route and then taken straight to the Club Lounge for the check-in. The Club rooms were excellent and I now understand why everyone raved about the beds and menu of scented pillows. We also loved the quirky glass walled bathroom which was kept spotlessly clean and filled with all the extras you would expect and more.", "title": "Upgrade to Club - you know your worth it!", "helpfulness": 9, "user": "JacquiSouthampton", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15443700, "likes": {"liked": "— The attentive staff, the cleanliness, the luxurious surrounding, the ambience, the food", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "If you stay in a Club room breakfast is included in the price and the choice is absolutely amazing. I defy anyone to complain about the service, choice or standard of food in this hotel. It's the little details that make all the difference - like the table mats at breakfast telling you the latest daily news around the world. The other icing on the cake was the Club Lounge - go there mid afternoon and enjoy tea/coffee, even champagne and fresh strawberries, scones and cream; go there early evening and enjoy champagne or wine and a savoury selection of satays, canapes, sushi; arrive there late evening and enjoy a coffee licquer and some nibbles. All this was free, but the ambience and the views were priceless.", "title": "I need to go back, FAST!", "helpfulness": 4, "user": "spur365", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15430058, "likes": {"liked": "— Chuan Spa", "disliked": "— Its too far from home"}}, {"rating": 5.0, "title": "My Favorite", "text": "During your stay in Hong Kong definitely use the Metro and purchase an Octopus card - it's so cheap and easy to use. We enjoyed the Harbour laser show; visit to the Peak; our walks around the Flower and Bird Market (people actually take their birds for a walk); but one not so well publicised was the escalator on Hong Kong Island that seemed to go up the hill for miles passed markets, restaurants, homes. Also take an empty suitcase - I'm a shopaholic and I've never seem so many excellent shopping malls in a relatively small area - they appear everywhere (above and underground).", "helpfulness": 2, "user": "menolikeit", "date": "April 24, 2008", "id": 15302026}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Firstly i have to say this is the best hotel i have stayed at in my 26 years yet. This was my first time to Hong Kong and i was worried about what to expect. But i certainly didnt need to worry.", "title": "Fantastic Hotel", "helpfulness": 2, "user": "ejcmhere", "date": "April 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15209136, "likes": {"liked": "— ambiance", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "One of my favourite hotels I have ever stayed in (if not the favourite!).", "title": "Loved it!", "helpfulness": 6, "user": "TravellerFromOz", "date": "May 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 7494465, "likes": {"liked": "— spa and pillow menu", "disliked": "— DVD player but they don't supply DVDs"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Service is fabulous.", "title": "My new favorite hotel in Hong Kong!!!", "helpfulness": 14, "user": "Dagindi", "date": "April 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7485566, "likes": {"liked": "— Everything!!!", "disliked": "— No complaints"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "We had an executive room which had an amazing view across Hong Kong. The (large) bed was covered in pillows and we had fun ordering extra lavender and rose pillows from the pillow menu. The bathroom is glass walled with a blind so you can see directly out to the views. The down side of this is having to put the blind down if you want a bit of privacy in the bathroom within the room.", "title": "Should have 6 stars", "helpfulness": 6, "user": "traveler46564", "date": "April 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7438463}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "TV was flat screen, came with DVD player that took multi region DVDs. The hotel is not longer suppling DVDs as it want you to watch pay for view movies so bring your own.", "title": "The service at the Langham Place Hotel lives up to all the reviews.", "helpfulness": 7, "user": "storeyanne", "date": "April 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7435161}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The lobby and bar is beautiful and one of the hotel restaurants serves an amazing buffet although I thought the restaurant a bit too large and open to the shopping mall to have much atmosphere.", "title": "Great Location", "helpfulness": 6, "user": "fijidrama", "date": "April 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7414338, "likes": {"liked": "— Location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Everything written about this hotel is true. Booking a club room is definitely worth the extra cost. Superb service. Great position for those that want to be in the midst of \"old\" Hong Kong, but stay in a state-of-the-art hotel. We walked everywhere. Nelson Street with its live fish market, fruits, vegetables and meat stalls is just as remembered 40 years ago, as is the whole area. The flower and bird markets are just around the corner. And we thought an easy and interesting walk to the Star Ferry and thus to Victoria.", "title": "Can't beat this hotel!", "helpfulness": 10, "user": "colkirk", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7565830, "likes": {"liked": "— Absolutely state-of-the art rooms and excellent service.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Great hotel.", "title": "Loved The Langham", "helpfulness": 4, "user": "lmidge39", "date": "May 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7564714, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007", "text": "Staff excellent can't do enough for you.", "title": "Perfect Location", "helpfulness": 14, "user": "LondonH", "date": "May 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7553961}, {"rating": 4.0, "title": "Great location in Mong Kok", "text": "Lovely room great view.", "helpfulness": 5, "user": "vinglo", "date": "May 3, 2007", "id": 7541625}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Try the Spa is really lush.", "title": "What An Experience", "helpfulness": 9, "user": "sbj", "date": "May 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7495295}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "This was our first trip to Hong Kong although we have travelled as a family through Asia alot.My family of 2Adults and Kids (15 and nearly 18) absolutely loved the Langham Place where we stayed for 11 nights", "title": "Great Hotel,Fantastic spot", "helpfulness": 8, "user": "WAussie1", "date": "July 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 18376620, "likes": {"liked": "— Convenience", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We were on the 27th Floor with a great view.We could see the harbour and the lights at night were great.", "title": "Fantastic hotel", "helpfulness": 2, "user": "84wessex", "date": "July 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18341407, "likes": {"liked": "— Quality of Rooms", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Breakfast was one of the best we had experienced.", "title": "Gd Location but...", "helpfulness": 4, "user": "luxie", "date": "July 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 18170339}, {"rating": 5.0, "stay_parameters": "Stayed November 2005", "text": "We have just spent 7 nights at this hotel. Rooms are not the biggest but apart from that the place is difficult to fault. We took two Executive rooms as we had our two kids with us. they loved the big Plasma screen and being able to watch it from the bath!", "title": "Excellent place to stay", "helpfulness": 8, "user": "ChrisSakhalin", "date": "November 21, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4129352}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "The breakfast is excellent. The chocolate fountain was a hit with the kids for sure. If you do not take breakfast then just walk accross the connection to the mall and pick up some treats there.", "title": "Chocoholics Delight", "helpfulness": 9, "user": "pencefn", "date": "November 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4107066}, {"rating": 5.0, "title": "Great stay", "text": "The hotel may not be in the center of the action but it is certainly in the center of Mong Kok which is great for wondering around in the evening.", "helpfulness": 7, "user": "MrArthur", "date": "November 9, 2005", "id": 4100830}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "The pool is great and has a wonderful view. The Jacuzzi is very hot and it a great place to relax.", "title": "Fantastic Hotel in 'Chinatown'", "helpfulness": 16, "user": "broccolibaby", "date": "October 22, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4043283}, {"rating": 5.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "An excellent hotel in which it is difficult to find fault. The catering, room service, the adjancent Langham Place shopping centre, proximity to Mong Kok MTR station, where to start.....", "title": "Affordable Five Star Hotel", "helpfulness": 11, "user": "Chuck, Santa Cruz", "date": "October 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4033547}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed at Langham Place for 3 nights from 18 May in the standard twin", "title": "A great hotel to return to", "helpfulness": 13, "user": "Incognitosu", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 7707867, "likes": {"liked": "— IP telephony", "disliked": "— Bathtub maintenance"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "room. Overall, had a great experience and would definitely recommend the hotel to friends and all.", "title": "Loved it!", "helpfulness": 5, "user": "Da_Squig", "date": "May 25, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7697910, "likes": {"liked": "— A fabulously modern hotel.", "disliked": "— Rooms if anything, on the small side."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "Read that many before me had already gushed at length about the hotel. Nevertheless, because we had visited Hong Kong on a particularly rainy season, we really came to appreciate all the little things that make up Langham Pl.", "title": "Nice Hotel", "helpfulness": 8, "user": "george01", "date": "May 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7639172, "likes": {"liked": "— The view", "disliked": "— nothing, it was perfect"}}, {"rating": 5.0, "title": "Experience to contrast", "text": "What makes Langham Pl. a great sanctuary to return to, especially after a rain-soaked day out:", "helpfulness": 12, "user": "weed39", "date": "May 16, 2007", "id": 7629567}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "- the ginger flower scented lobby is a welcomed salve from the assault of your olfactory senses by the damp rain and smells of street food (the notorious smelly tofu included).", "title": "Excellent !", "helpfulness": 21, "user": "chiongmaya", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7605238, "likes": {"disliked": "— none"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "I chose this hotel based on the reviews from the TripAdvisor.com website. I was not disappointed.", "title": "The Reviews Are true!!", "helpfulness": 6, "user": "ATLCTC", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12675508, "likes": {"liked": "— The excellent service", "disliked": "— The breakfast was great but expensive (typical for hotels)"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008", "text": "Just to be clear, this hotel is not located on Hong Kong Island (the postcard views of the big buildings). It is on the Kowloon side in a neighborhood called Mong Kok. The hotel could not be more convenient though. It is attached to a very modern mall (Langham Place Mall) and you can access the subway (MTR) from this Mall. The MTR will take you into Hong Kong Island (Admiralty stop or Central stop) for HK$ 10.50. The cost of transportation in Hong Kong is very reasonable (e.g. subways and taxis).", "title": "Near Perfection", "helpfulness": 7, "user": "ajhaeh", "date": "January 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12595355}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The hotel is very well appointed and the staff could not be nicer. I was there for 6 days and the level of service stayed very high the entire stay.", "title": "Simply The Best!", "helpfulness": 7, "user": "GingerMonaro", "date": "January 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 12561906, "likes": {"liked": "— Everything"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "great location right next to under ground so easy to travel to different parts of hong kong .staff very friendly.rooms very clean and smart.", "title": "fantastic", "helpfulness": 1, "user": "booLincoln", "date": "January 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12950229, "likes": {"liked": "— location", "disliked": "— na"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "My first ever visit to Hong Kong and I decided that I would be influenced by some of the reviews of my fellow contributors on Tripadvisor as well as being seduced by the idea of staying on mainland Hong Kong rather than the island. So we stayed for two nights at the Langham Place, Mongkok.", "title": "Beauty in the heart of Kowloon", "helpfulness": 11, "user": "noisui", "date": "January 23, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 12920306}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "I booked in advance direct with the hotel, which prooved easy, with prompt replies and a 10% advance booking discount. This was the end of a three and a half trip and we thought that we would make life easy for ourselves and so we also booked a limo transfer to and from the airport through the hotel.", "title": "Fabulous Langham Place", "helpfulness": 2, "user": "Spockie", "date": "January 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 12799851, "likes": {"liked": "— Deluxe accommodation for great price", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We got through formalities at the airport and then easily found the Langham desk, we were greeted extremly courteously, offered cold drinks and then quickly guided to a waiting limo for the 30 minute transfer to the hotel.", "title": "Fantastic will return again Highly recommend", "helpfulness": 2, "user": "theloanes", "date": "January 19, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 12782171, "likes": {"liked": "— the bed! also the staff", "disliked": "— cost of food"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "The hotel was stunning, with lots of art being displayed (including the red gaurds on the ground floor), which we passed as we went to the reception desk. We decided to pay for an upgrade and we stayed in an executive room on the 37th floor. This room had a wonderful view across the city to the working harbour and also gave us access to the Club L lounge.", "title": "Awesome!", "helpfulness": 4, "user": "Sugarcube1Germany", "date": "January 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 12682486}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "If you expect people in HK to speak English fluently, I think you would be disappointed that most people do not speak the language, or at least pretend that they do not know. If not for the hotel staff in providing me with the utmost detail of what I needed to know, I would have had difficulty navigating through the streets of HK. I was especially thankful of Stephen Poon, the assistant manager on duty the evening of my arrival. Without his willingness to help my wife and I, our honeymoon through HK would not have been as good. The staff at the Langham will take the extra effort to make your time worthwhile.", "title": "The people make the difference", "helpfulness": 4, "user": "TravelingJournal", "date": "June 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17238755, "likes": {"liked": "— the people who work here", "disliked": "— HK was a former british colony right?"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The facility itself is clean and neatly organized. The rooms might not be big, but they are made for the techie that I am. If you have not checked out the bathrooms, check out other people's photos. Yes they are transparent.", "title": "great hotel one of the best", "helpfulness": 4, "user": "grahamgeelong", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17171267, "likes": {"liked": "— service and rooms", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Better than any Ritz Carlton... Hands Down!!!!", "text": "The hotel sits in a pretty interesting area of the city. If you walk out to the Eastern exit, you will encounter the various shopping districts of Hong Kong from the ladies market to the electronics mecca of HK. To the Western side you can find the local street market where they sell anything from live chicken and seafood to the strangest looking so called food you can ever find anywhere.", "helpfulness": 4, "user": "gigibites", "date": "June 23, 2008", "id": 17168993}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "In all, a good place to stay. BTW, we ordered the pickup and dropoff service to the airport provided by the hotel (at a cost of course), and was happy with the service even if it was not cheap. It was convenient to have someone take you from door to door without much hassle.", "title": "Fantastic hotel", "helpfulness": 4, "user": "Jason_Cathy", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17033381, "likes": {"liked": "— Quality", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Just back from the langhamplace hotel what a great place to stay we thouroughly enjoyed every moment of our stay here, the staff here cant help you enough and go out of there way to make you feel comfortable and have an enjoyable holiday cant speak highly enough about them. The hotel itself is amazing artwork everywhere on all walls and in every room there is something for everyone to feast there eyes on. The rooms are not big at least ours wasnt we stayed in the lowest room category but what you dont get in size is more than made up for in comfort and conveniance with big plasma tvs,DVD player and a phone system that is like your own information library you can get everything from exchange rates to weather forecasts to airport timetables it is something else believe me. The bathroom is spacious and has a bath and shower with great water pressure very clean and all the usual complimentary items thrown in and more,the bed and pillows were very very comfortable a great nights sleep.We were so glad we stayed in Mongkok as it is a great area and only a short train ride to anywhere. The hotel is linked to a shopping mall that is massive itself and the surrounding area is packed with all sorts of shopping. Please try some egg tarts cooked fresh everymorning by the locals they are to die for. We highly highly recommend this hotel it is the best i have stayed in", "title": "Good Value for Money", "helpfulness": 5, "user": "Brian&Alan", "date": "June 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0}, "id": 16966252, "likes": {"liked": "— The Lounge facilities and its location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "We read many reviews, and tried to find a hotel in Hong Kong that offered luxury, but at a relatively affordable price. We wound up booking the Langham in Mong Kok. We booked a 2 room suite on the club floor through the hotel's web site (which I would highly recommend surfing, it's a little complex but the best deals for this hotel are there), at a little over $400 per night. While, as most people state, we found it a little out of the way, the hotel was wonderful. First, I would highly recommend the club floor rooms. the rooms are higher up, offering relief from the claustrophobia of Hong Kong. Second, the club lounge was excellent - and, like the rest of the hotel, it just grows and grows on you. It's open 24 hours, unheard of in this day and age, and offers breakfast, many courses of light appetizers, sweets at night, and drinks of all kinds, both soft and alcoholic, and champagne at certain hours. It also has 2 massage chairs, a business center with MAC's and PC's and printers, a DVD lending library, nice seating, and a nice staff, and expresso maker (which I loved, expresso every day, and excellent expresso at that).", "title": "Loved the Langham", "helpfulness": 2, "user": "VentureTraveler", "date": "June 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 16865843, "likes": {"liked": "— Suites, Club Floor Lounge", "disliked": "— Location a bit out of the way"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Next, the rooms. while they were a bit smallish for a suite, they had wonderful fit-and-finish, comfortable beds, 2 bathrooms and 2 flat panel TV's. Add a nice pillow menu (try it, they're not kidding, order your own pillow and it will be cheerfully delivered), internet phones with color displays, free internet access. All in, you're quite comfortable. Oh, I might add, and this was not clear at all (either from reading TripAdvisor or from the staff), if you're staying on the club floor, you can go down to the lobby restaurant for the sumptuous full breakfast (it's downright decadent), for FREE! It's probably the largest breakfast buffet I've ever seen (and I travel extensively). The only way we figured this out was to take a table and try it, as we got conflicting answers from the staff as to whether it was included in the club floor rate or not.", "title": "Perfect Place", "helpfulness": 3, "user": "Lovecraft", "date": "June 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16829331, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The hotel also has an excellent Gym, nice locker rooms, slippers, fluffy robes, turndown service, an assortment of magazines in your room when you get there, daily newspapers, and more. The spa area was particularly nice and you don't need to go to a spa treatment to use it. The rooftop pool was also great, and if you want to venture further in the hotel, there is a complete business center on the 5th or 6th floor with about a dozen computers. Use of the computers is free.", "title": "Great Hotel in Excellent Location", "helpfulness": 8, "user": "berniel7", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16759381, "likes": {"liked": "— Top quality hotel with friendly service.", "disliked": "— None."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "The one thing I would point out is that this hotel IS out of the way. On Sunday morning (no pedestrian traffic), it took us about 30 minutes at a steady, brisk walk to get to the Kowloon waterfront. I highly recommend taking cabs (and I usually walk everywhere), they are excellent, incredibly cheap, and very helpful. I think our average cab ride was about $4 anywhere in Kowloon.", "title": "Great hotel. Awesome location.", "helpfulness": 5, "user": "tmelon", "date": "May 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16478906, "likes": {"liked": "— Location", "disliked": "— Price"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I can't wait to go again.", "title": "One of Our Favorite Hotels in Asia", "helpfulness": 5, "user": "verymodest", "date": "May 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16408886, "likes": {"liked": "— Location", "disliked": "— No complaints to report"}}, {"rating": 5.0, "title": "Very good hotel", "text": "Stayed 5 nights in Langham place.. Very nice hotel, beautiful and and amazing night view from the rooms.. Bars and restaurants are also pretty good...esp the buffet lunch at the place. Conveniently located next to the train plus Starbucks is right there too :)", "helpfulness": 1, "user": "PetroGirl", "date": "December 28, 2013", "id": 188766749}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Our family stayed here for a week in December in a 1-bedroom suite with an additional connecting twin room. I must say that emailing the reservations person was so, so easy and pleasant. It's not easy getting comfortable family accommodations with additional space but they were clear and so responsive. The rooms were a little smaller than I expected for being out of the main part of town and could use a little refresh, but overall service was very good and it was nice that we could get to the MRT without getting wet when it was raining.", "title": "Incredibly pleasant to deal with", "user": "LMP_04", "date": "December 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 188680073}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled solo", "text": "We were also on a club level floor which we don't usually do but was so great to have. Since it was cold and rainy and we were a bit jet-lagged, we didn't always feel like leaving for dinner so it was nice to get a drink and some munchies at any time. The kids played a little x-box in the kids' room, too.", "title": "Langham Place, Mongkok, Hong Kong", "user": "Kenneth_HM", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188567787}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "We ended up spending a lot of time on Hong Kong island so I think next time we go, we'll want to stay there but if you want to be in Kowloon, this is a great place to be.", "title": "Impeccable service in a fantastic location", "user": "skew_lewe", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188562390}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "Back at Langham Place, Mongkok again. Spent 4 nights this time during my holiday in Hong Kong. Staff at Langham Place did not disappoint me. Reservation was hassle-free and all staff are polite, helpful and provide excellent service.", "title": "It deserves all the credit, with soft touches to the heart", "helpfulness": 2, "user": "vivi003", "date": "December 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 188547202}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "This hotel is cheaper than all the other 5* and high end 4* hotels in Hong Kong because it is situated in the less fashionable district of Mongkok. Don't let this put you off because Mongkok is a colourful, exotic, bustling shopping area. The hotel is right by the metro and it takes less than ten minutes to get to Central on Hong Kong Island. The upper floors of the hotel also have glorious views of the harbour.", "title": "Best Value 5 * Hotel in Hong Kong", "helpfulness": 3, "user": "Fifiann", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 15104155, "likes": {"liked": "— The bathrooms", "disliked": "— Poor design of bed frame - kept stubbing my toes and hitting my shins on it."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Despite being massive, this hotel has a boutique feel with quirky sculpture throughout. The pool, spa and fitness facilities are fantastic.", "title": "Langham Suite 3620.", "helpfulness": 6, "user": "JChua", "date": "April 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15023398, "likes": {"liked": "— Modern and functional rooms, at reasonable prices.", "disliked": "— Soft pillows and uncomfortable seaters in hall."}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "The rooms are average sized but the beautiful marble bathrooms are spacious with a window through to the bedroom so you can lie in the tub and watch TV on the flatscreen.", "title": "Not a five star hotel, more like four star/three star", "user": "Happy95", "date": "April 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 14960496, "likes": {"liked": "— Pool and fitness", "disliked": "— Front desk and the bathroom stains"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I was accompanying my husband who was attending a conference at the hotel. We were in an executive room on the 35th floor and had access to LClub. I highly recommend paying extra for the club facilities which are open 24 hours and provide you with a great breakfast, high tea, evening hors d'oeuvres and free flowing premium alcohol until 1am. There are also internet terminals and massage chairs.", "title": "loved this hotel!", "helpfulness": 4, "user": "jess6612", "date": "April 10, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 14932164, "likes": {"liked": "— atmosphere, service"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "My husband's company event organiser was so impressed with the business and leisure facilities at Langham Place that she subsequently negotiated a corporate rate for employees visiting Hong Kong. I will definitely be returning to this hotel :)", "title": "excellent hotel, but small rooms - even smaller bathrooms", "helpfulness": 4, "user": "JohnEO", "date": "April 9, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 1.0}, "id": 14923891, "likes": {"liked": "— Friendly staff, transit from airport and good restaurant", "disliked": "— Small rooms and bathroom"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "We chose the Langham Place because of the reviews on Tripadvisor and we were delighted with it. Our only negative comment would be the location - it is in a rundown area and the checkout questionnaire of the hotel actually asks guests whether they 'felt safe' walking out of the hotel. The answer is that we did not, especially as tourists are warned to be wary of pickpockets.In the event, we had no problems but the next time, I think we would try the sister hotel, the Langham, which is much nearer the ferry terminal and other attractions. Incidentally, we were surprised how little English some taxi drivers could understand. We only discovered on our second day that the hotel can provide a small booklet listing numerous likely destinations, including the hotel itself, in Chinese script. This was very helpful.", "title": "Great hotel - except for location", "helpfulness": 6, "user": "Scothol", "date": "February 6, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 13329034, "likes": {"liked": "— Excellent food", "disliked": "— location of hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "We stayed for 2 nights in Feb 08 on the way to NZ. We got a special deal on a suite after seeing the chance of this opportunity on a report from a Tripadvisor review. We paid HK$2250/night for a suite on the Club foor, booked on the hotel website. Absolutely great.", "title": "The best!", "user": "FrankandMabel", "date": "February 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 13283642, "likes": {"liked": "— Quality and location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Staff friendly, helpful without being overbearing. Did the free hotel night market tour - excellent tour guide. Recommend doing this on your first day - good intro to the Mong Kok area which has real atmosphere.", "title": "enjoyable experience", "helpfulness": 8, "user": "RICHARDLONDON41", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13178570, "likes": {"liked": "— Club facilities superb", "disliked": "— would have liked more security,no key cards needed to use the lift"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Food on Club floor was superb.", "title": "Lived up to being no. 1", "helpfulness": 5, "user": "Cathy S", "date": "February 1, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13172749, "likes": {"liked": "— Staff were so friendly and everything was so well organised."}}, {"rating": 5.0, "title": "As city hotels go........", "text": "Aleady booked our stay for the way back!", "helpfulness": 6, "user": "DeveA666", "date": "February 1, 2008", "id": 13171148}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I chose a Club level room and was upgraded to a suite. The facilities at this hotel are amazing. I organised a shuttle pick up from the airport which took a while but generally worked well. On arrival in the hotel foyer the noise level was deafening. There seemed to be a band playing in one of the bars and the receptionist suggested I check in on the Club floor which I was only too pleased to do. Club L is a 24 hour g=hospitality centre consisting of three main rooms each with a different focus - refuel, relax and relate. The breakfast is fantastic, all day snacks and drinks delicious. Afternoon tea is served from 3.00pm and it is great as well.", "title": "Luxurious Oasis in the Bustle of Mong Kok", "helpfulness": 1, "user": "MarkLaurence", "date": "April 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127159413}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The spa and pool are excellent if not a bit quiet - many guests seem to be business people who are not around the hotel during the day. All in all a great choice. I will be back and Langham Place will be my hotel of choice for subsequent visits to Hong KOng.", "title": "Near Cruise Terminal", "user": "Babs2010_10", "date": "April 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 127140214}, {"rating": 2.0, "stay_parameters": "Stayed April 2012", "text": "Lovely room, quality bath amenities beautifully packaged. Narrow tub and separate shower. Beautiful lobby with afternoon tea. Near Star Ferry, Hop-on Hop-off tour bus, shopping malls with designer kids stores- amazing selection there. Nice to arrive here after trans-Pacific flight. Helpful staff and concierge.", "title": "Bad service!", "user": "Kellykruse", "date": "April 2, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 1.0, "rooms": 3.0}, "id": 127118454}, {"rating": 5.0, "title": "excellent place to stay", "text": "Room service below standard for a hotel of this claimed caliber.", "user": "alwayswanttotravel", "date": "April 2, 2012", "id": 127114325}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "We booked a Prime Place Room for 8 days and were given the 16th floor. The rooms are very big especially considering most rooms in Hong Kong are on the smaller side. What made this one of the best hotels I have every stayed in was the attention to detail in the rooms with what was provided and the great sense of humour they have with certain things i.e. icecream in the freezer with a note saying \"now youve found me Im yours for free\" (this was in our friends room - a suite). The concierge team were fantastic and the whole of the ground floor reception staff were efficient and always happy and accommodating. The spa, pool and amenities were fantastic and the breakfasts were amazing. I love this hotel and would not hesitate to stay here again. The MTR is right next door and with several floors of shops and restaurants connected via a walkway everything was at our fingertips. I could not fault anything at all.", "title": "Plush!", "helpfulness": 1, "user": "Kei H", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127101582}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The Langham Place Hotel in Mongkok is a very stylish, very modern and very comfortable hotel. Its location is great; only a few minutes work to the Mongkok MTR station and only a quick 15min cab ride to central. The Langham Place is surrounded by great shops; it even has its own 13 story shopping mall across the street connected by a walkway.", "title": "Great rooms, great amenities and great location", "helpfulness": 2, "user": "LightEntertainment", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 12310505, "likes": {"liked": "— -", "disliked": "— .:. Nothing that I can think of .:."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We booked a Club Level room online, and when we arrived we were escorted to a private check-in. Believe me, the Club rooms are well worth the extra price because they come with a huge range on complimentary services: free wired/wireless internet, free use of the gym/swimming pool, access to a private lounge on Level 36 and free breakfast.", "title": "Langham Place is the Place to stay", "helpfulness": 4, "user": "sadies", "date": "January 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 12290967, "likes": {"liked": "— You never needed to lift a finger as everything was done for you", "disliked": "— Its right next to a 300 shop mall so does get the shoppers in the bar once in a while"}}, {"rating": 5.0, "title": "Superlative hotel with uniquely \"friendly\" female staff", "text": "The hotel as a whole is great, as mentioned before. The dining options available are top notch, with a range of Western and Cantonese food available; the rooms are great; the roof top swimming pool and gym is first class and what is more, the staff are extremely friendly and helpful.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "January 2, 2008", "id": 12252800}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I recommend this hotel to anyone not scared off by the high prices, mind you we did stay there over New Years, so I presume it would be a fair bit cheaper at less popular times. The Club rooms are well worth the extra price. And the stay was just great all round.", "title": "Good value for money for HK", "helpfulness": 6, "user": "FussyGlobeTrotter", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12222912, "likes": {"liked": "— Location", "disliked": "— Quality in bathroom finishes and furniture"}}, {"rating": 5.0, "title": "Langham Place Hotel", "text": "This was our final hotel and destination on our honeymoon and we were unsure of what to expect as it was booked as a gift by the brother in law... we needent have been worried, this place is wonderful and in a great location.", "helpfulness": 5, "user": "Crumble", "date": "January 1, 2008", "id": 12211829}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Having arrived on an early morning flight from Sydney, we were delighted to find our room available.", "title": "Loved Langham Place", "helpfulness": 4, "user": "Ali_S_247", "date": "April 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14915540, "likes": {"liked": "— Location, Cleanliness, Comfortable Bed", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "We had booked the hotel after reading the reviews on TripAdvisor, and were not disappointed. Whilst the hotel is out of the main area for tourist hotels, there is very much the feeling of being in the middle of real Hong Kong life. Street markets are just around the corner. Access to other areas by public transport is easy, as the MTR station is nearby. Taxi fare to the harbour area is little more than £2.", "title": "Loved it!", "helpfulness": 2, "user": "Filibuster", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14879913, "likes": {"liked": "— Service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "We booked a 'Club' room, which also gave access to the Club lounge for breakfast and snacks. We had meals at 'The Place' and 'Ming Court' restaurants, both of which were of a good standard.", "title": "Incredible attention to detail", "helpfulness": 5, "user": "TommyTV", "date": "April 8, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14878084, "likes": {"liked": "— Attention to detail", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The bedroom was a good size by Hong Kong standards. The room was clean, comfortable and well equipped. The bed was blissfully comfortable - I would love to have brought it home with me.", "title": "Just Great adain", "user": "stickyMelbourne", "date": "April 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14816567}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "I found all staff in the hotel courteous and helpful. Service was prompt and efficient, but not intrusive.", "title": "Wonderful hotel", "helpfulness": 3, "user": "LondonTiggy", "date": "April 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14795192, "likes": {"liked": "— New, modern and very comfortable.", "disliked": "— Nothing"}}, {"rating": 3.0, "title": "Just OKAY", "text": "Hotel in a good location. With everything within accessibility to the hotel.", "user": "igme416", "date": "December 30, 2013", "id": 189067459}, {"rating": 4.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "Wifi has very good connection and allows you to work smoothly.", "title": "Good 5 Star Experience", "helpfulness": 1, "user": "JLim83", "date": "December 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 189036913}, {"rating": 3.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Room was very ordinary and surprisingly small for the rate you have to pay. Was expecting better room space and amenities. Lobby was impressive but room was nothing to rave about as having stayed in better and bigger rooms at a cheaper rate.", "title": "Some good and bad", "user": "cothai", "date": "December 30, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 188977931}, {"rating": 5.0, "title": "Great hotel, great location", "text": "If you like a mixture of shopping avenues from night markets and street shopping to mall shopping, the this hotel has the best position for it.", "helpfulness": 1, "user": "fionahowell2", "date": "December 30, 2013", "id": 188970334}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "You can find ippudo ramen in langham if your fond of Japanese ramen.", "title": "Great Location", "helpfulness": 3, "user": "theonivaz", "date": "December 28, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 188842972}], "location": {"country": "China", "continent": "Asia"}, "stars": 5, "variance": {"poor": 40, "average": 123, "very good": 744, "terrible": 21, "excellent": 2485}, "aka": "Langham Place Hong Kong Hotel", "slim_ranking": 0.0144665461121, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Opened in 2004 and rising 42-storys from the epicenter of Mongkok, the Langham Place Hotel features spectacular views of the Kowloon peninsular and the breath-taking backdrop of Victoria Harbour. Rooms feature oversized baths, blissful beds and large plasma screen televisions. Alongside a lexicon of technological treats including state-of-the-art IP phones you can update with photos, flight details and more before you arrive, and there's a mobile version you can take anywhere in the hotel."}