{"user_rating": 4.5, "review_count": 184, "name": "Larkspur Landing Renton", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "You simply can't beat the value of this hotel gem. Check-in was a breeze, and my husband and I were given the option to upgrade our room for free. The hostess was friendly and pleasant. Our room was perfect -- a small, stocked kitchenette with a refrigerator, microwave, stove, and dishwasher. The bed was comfy, with down pillows and comforters. They even give you the option to pick your own pillow type: wedge, neck forms, body pillows... all were available at the front desk. The room also had a DVD player (you could pick a free movie from the front desk) and CD player. The bathroom was nothing special in and of itself, but the sample Bath & Body Works toiletries were wonderful. All these great things for around $100/night? What a dream. It was the perfect retreat for our short getaway.", "title": "Lovely time at Larkspur Landing", "helpfulness": 4, "user": "Diana G", "date": "June 13, 2005", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3549434}, {"rating": 1.0, "title": "Unclean", "text": "We stayed at the Larkspur Landing while visiting in the area to spend Easter with family. The bathroom was the worse with long black hairs on the floor. The other floors obviously had not been vacumed, and there were crumbs on the desk and chair. The next day I left a note asking that the floor be cleaned. We returned to find that nothing had been done. The desk and chair were still dirty and the coffee pot was still in the sink, along with the used coffee cups. However, the worse surprise was when I pulled back the sheet to get into bed and found long black hairs there, too. Turned my stomach.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 30, 2005", "id": 3314274}, {"rating": 4.0, "title": "Liked the Larkspur a lot!", "text": "My husband and I stayed here for a couple of days and would stay here again...quiet and well run hotel.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 14, 2004", "id": 2449338}, {"rating": 4.0, "title": "A GREAT PLACE", "text": "Went back to seattle for work and I stayed here. What a great place to stay. A++. Nice people, close to airport - shopping. In room internet, clean classy rooms. I would recoomend this for the business traveler - wish there were more hotels like this when i traveled", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 30, 2003", "id": 1532984}, {"rating": 4.0, "title": "A nice place and nice people", "text": "Two years ago I stayed together with my colleagues in the Larkspur Landing hotel in Renton from July to the end of September. I really enjoyed the accommodating service and the friendly atmosphere between us and the personnel. After three months living in this hotel I felt like at home and since today I feel a little homesickness to this place, to all the nice people and that beautiful area. I hope, I can visit this place again someday.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "July 31, 2003", "id": 1154920}, {"rating": 1.0, "title": "They Give Away Your Room!", "text": "I am a frequent traveler, single, and female. I made a reservation at the Larkspur for two reason: 1. The Hilton Garden Inn gave away my room during my previous stay, and 2. I'd stayed before and liked it. To my surprise, when I went to check in at 9PM, they told me they didn't have a room for me. I'd made my reservation two months prior. I was angry and tried not to take it out on the front desk clerks, but this was the second time in as many trips to Renton that this happened. Why do they do this? I will NEVER again stay at Larkspur or the Hilton Garden Inn in Renton. The last thing anyone wants to have to do after traveling all day, especially if you are not familiar with the city, is to have to get back in the car after dark to go look for a hotel room. It's a terrible way to do business.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "September 17, 2005", "id": 3911752}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "My husband and I have visited the Seattle area about 5 times in the last two years and each time we have stayed in different hotels. The Larkspur is by far the best and amazingly enough it is also the cheapest hotel that we have stayed at in this area. We booked the Larkspur online and I was a little concerned about not having seen the hotel in advance.", "title": "What a gem!", "helpfulness": 3, "user": "fallingup", "date": "August 29, 2005", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 4.0}, "id": 3814999}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "When we arrived we were pleasantly surprised at how nice the hotel looks from the outside. When we checked in they didn’t have the type of room that we had booked available so we were upgraded to an Executive King suite. The room was fabulous, very clean and well kept. It had all of the amenities plus some extras that we weren’t expecting (cordless phone, c.d player, 6 pillows on the bed, etc.)", "title": "An Amazing Place to Stay", "helpfulness": 3, "user": "Tracyfamilyvacation", "date": "August 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3781203}, {"rating": 5.0, "title": "I wished I could carry this hotel around with me", "text": "There is an exercise room and hot tub located in the Larkspur and the indoor swimming pool is located right next door at the Hilton. The pool was clean and easily accessible. We were there late at night so I am not sure how busy it gets during the peak hours.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "August 12, 2005", "id": 3758677}, {"rating": 5.0, "title": "My Favorite Place to Stay", "text": "The only complaint that my Husband had was that he was very unimpressed with the pizza that he ordered from room service, although I must add that I was more than happy with the meal that I ordered.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 12, 2005", "id": 3660993}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We stayed at Larkspur Landing in Renton for four nights and used it as a base for our apartment hunting in and around Seattle. We got the smallest room (studio), but it was very spatious for two of us. The room was clean, and the hotel staff was very friendly. Nice continental breakfast and evening receptions. It is not the cheapest hotel available in the area, but with free breakfast and kitchen in your room, you can save a lot of money on food by cooking. The hotel has a small fitness room, and clean laundry room. The hotel seems to be used by many of the airline staff. It's a good value hotel.", "title": "Nice choice not too far from Sea-Tac airport", "helpfulness": 1, "user": "Fortwood", "date": "January 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 12328778, "likes": {"liked": "— Room", "disliked": "— Small fitness room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Great location, spotless hotel and room, comfortable bed, helpful staff. Very nice to have a full size kitchen that is well stocked in your room. Large work desk that is awesome for the business traveler. Internet access easily obtained. Great size room and quiet! Continental breakfast has yogurt, fruit, cereals, oatmeal, string cheese, juices, coffee and thick slices of a variety of great breads to toast. Not a large eating area so I brought all to my room instead which is just fine since the kitchen has a toaster.", "title": "Awesome Hotel", "helpfulness": 2, "user": "Seaspray77", "date": "August 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8589561, "likes": {"liked": "— Room"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "I would definitely recommend this hotel - very nice.", "title": "Very Nice", "helpfulness": 3, "user": "Julesrulz", "date": "April 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7366970, "likes": {"liked": "— Great value, clean and tons of space", "disliked": "— Small eating area for continental breakfast by lobby"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2004, traveled as a couple", "text": "This was a great place to stay if you are going to be in the Seattle area.", "title": "Peaceful, Serene Experience", "helpfulness": 1, "user": "Jujubee_Judy", "date": "March 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7254800}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "LOCATION: Only few miles from I-5 and Southcenter Mall. Lots of restaurants and stores close by. Hotel was 1 mile off of Hwy. 167 - easy to find.", "title": "Loved it", "user": "VerySatisfied", "date": "March 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7199568, "likes": {"liked": "— Goose down comforters and the pillows"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The hotel was great, staff was great, everything was", "title": "great place to stay", "helpfulness": 1, "user": "lovingthecarribean", "date": "September 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 5798986, "likes": {"liked": "— washing machines , breakfast,", "disliked": "— was a bit noisy outside with the interstate, bedroom was warm"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "very nice. The only negative was the air conditioner,", "title": "Could be Improved", "helpfulness": 2, "user": "AshesToProveIt", "date": "August 6, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 2.0, "cleanliness": 2.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 5561397, "likes": {"liked": "— suites and reasonable prices", "disliked": "— problems with plumbing and lack of staff at night"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2004, traveled on business", "text": "it is in the sitting area and the bedroom did not cool", "title": "Nice except for management", "helpfulness": 2, "user": "ZekeRenton", "date": "July 5, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5429403}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "off. Otherwise it was a perfect stay and will stay", "title": "Wish I were a Larkspur!", "user": "pittypat", "date": "June 16, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 5354192}, {"rating": 5.0, "stay_parameters": "Stayed January 2006, traveled on business", "text": "again when we return to renton, washington.", "title": "Home Away from Home", "helpfulness": 2, "user": "pastmaps", "date": "March 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4598960}], "location": {"country": "United States", "city": "Renton"}, "stars": 3, "variance": {"poor": 8, "average": 12, "very good": 59, "terrible": 4, "excellent": 101}, "aka": "Larkspur Landing Renton/Seattle Hotel", "slim_ranking": 0.1, "description": "Our Larkspur Landing Renton Hotel is centrally located near four state highways and the Seattle-Tacoma International Airport. This Seattle extended-stay hotel is not far from the Seattle Center & Space Needle, Safeco Field, Pike Place Marketplace and Qwest Field. Boeing's corporate offices are also located just 5 minutes from this Renton lodging destination. At the Larkspur Landing hotel in Renton, WA, vacationers and business travelers alike will enjoy superior service and comfort."}