{"user_rating": 4.0, "review_count": 272, "name": "Las Rocas Resort & Dive Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "My husband and I were there for a few days for diving. The best diving ever and cheap. The continental breakfast was great every morning. we went to town everynight for dinner. I don't recommend walking on the beach all the way to town. We're in pretty good shape and like to walk, but this was too rough even for us. We rented a moped for $20 and rode it everywhere. Highly recommend the Zip line tour and pay the extra $5 to visit the birds and the monkeys. And there's nothing you can do with the sandflies. we tried everything but nothing worked. We still had scars after a whole month after the trip.", "title": "The Greatest!!!", "helpfulness": 9, "user": "catseattle1", "date": "December 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 4217045}, {"rating": 5.0, "title": "Las Rocas was perfect", "text": "Stayed at Las Rocas from 8/13/05-8/20/05 and absolutely loved it. The resort is situated perfectly on the end of west bay beach closest to west end village. The cabin we stayed in had an unbelievable view of the ocean. The food was delicious (of course fresh fish and very tasty pizza too) and the staff were very friendly. It is a small resort, so it has a family-type atmosphere, but it is not overbearing in any way. The cabin was simple and clean, with a nice firm king-size bed and a quiet a/c. The dive shop was also fantastic - great staff and no trouble with the equipment. We arrived with no prior diving experience and without making plans in advance, and we were able to do all the diving we wanted while getting certified.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "August 25, 2005", "id": 3807110}, {"rating": 4.0, "title": "Very pleasant and quaint hotel, great food!", "text": "Of course the best part is the island and the ocean - no matter where you stay the beauty will take your breath away.", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 22, 2005", "id": 3796774}, {"rating": 1.0, "stay_parameters": "Stayed December 2004", "text": "If you are planning a trip I would highly recommend Las Rocas.", "title": "Bad News", "helpfulness": 9, "user": "jlbnell", "date": "August 16, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 3778199}, {"rating": 5.0, "title": "High Recommendations", "text": "Contrary to the review recently posted on Las Rocas, my fiancee and I had an excellent time at the hotel. The food was great, the service was friendly, and the room was spacious and clean. The dive staff were fun and contributed to the unique experience we had. I recommend this hotel to anyone going to Las Rocas. You could spend more money and get a bigger beach, but you are not likely to have as good a time as at Las Rocas. PS - Never forget your insect repellant!", "helpfulness": 10, "user": "A TripAdvisor user", "date": "August 13, 2005", "id": 3759646}, {"rating": 5.0, "title": "Loved staying at Las Rocas", "text": "I returned from my first trip to Roatan last June. We stayed at Las Rocas, a small resort on the ocean at the West Bay end. We absolutely loved everyone at Las Rocas, including the staff at the restaurant. EVeryone is on first name basis and will do anything to make your stay wonderful. Being a small resort, you get to know all of the vacationers if you desire or you can keep it platonic too. We personally enjoyed getting to know everyone else. The staff at the dive shop was awesome---Jon, Arturo, and Willie. Our boat driver, Cassidy, was the best, proving his boating skills in the rough sea we had one day. The food was great, serving a huge breakfast and very reasonable. There are little vendor \"shops\" right down the beach, or you can walk into town in 30 min., which we chose to do daily for our exercise. All the restaurants we ate at were good. Upon arrival, the van didnt meet us and there was a slight issue with that, but it was all resolved and taken care of properly. Oh--and all that I feared on the bugs was nothing. If you apply Cactus Juice, the bugs arent bad at all. My friend didnt use it and got bites, but they didnt bother her--just showed up as red spots and went away. I didnt see as many \"fish\" as I wanted to, but the reefs were absolutely gorgeous--very much alive. I will definitely stay there again. Being from Austin allows us to get there in 2-3 hours!", "helpfulness": 9, "user": "aquaaddict", "date": "July 17, 2005", "id": 3673827}, {"rating": 5.0, "title": "Great Stay on the West Bay at Las Rocas Resort", "text": "My friend and I booked a stay at Las Rocas Resort for the last week in May 2005. Before arriving, we were apprehensive about our accommodations due to the exceptionally economical price we were to pay. After arriving however, our fears were allayed. It was a beautiful little resort situated between West End and West Bay with easy access to both. We were actually only a water taxi ride ($2 US) away from West End where all the action is, and a very short walk to West Bay, one of the best beaches on the island. The accommodations were both clean and comfortable. Our bungalow which had an ocean view, also had AC, a private hot shower, requisite hammock and a mini-bar as well. In addition the price also included a full breakfast every morning! Las Rocas had a restaurant/bar and dive shop conveniently located on premises. The staff was both extremely friendly and accommodating as well. From the time they pick you up at the airport until the time they drop you off for your return flight, they make you and all of their guests feel like family. My friend and I were so impressed and pleased with our stay, we plan to make it an annual trip. I read some of the negative comments on this site and it was definitely not the Las Rocas we experienced. When in Roatan, we wouldn’t consider staying anywhere other than Las Rocas Resort!", "helpfulness": 7, "user": "tonifuq", "date": "June 19, 2005", "id": 3575563}], "location": {"country": "Honduras", "continent": "Central America"}, "stars": 3, "variance": {"poor": 17, "average": 35, "very good": 90, "terrible": 9, "excellent": 121}, "aka": "Las Rocas Resort And Dive Center", "slim_ranking": 0.636363636364, "description": "Tucked away on Roatan's most beautifull beach, Las Rocas Resort & Dive Center offers the perfect setting for your intimate getaway vacation. Dive Roatan's marine park from the doorstep of your cabin."}