{"user_rating": 5.0, "review_count": 540, "name": "Las Posadas of Sedona", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The Posadas was an amazing experience with unbelievable rooms, great beds, private. Staff went out of its way to make us feel welcome. Will stay there again in a heartbeat.", "title": "Absolutely excellent service. Wonderful Rooms", "user": "E_DTucson_AZ", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 20224390, "likes": {"liked": "— Room and staff service", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We stayed at Las Posadas for our 20th wedding anniversary. It was wonderful. The people at the office were friendly and very helpful with information about tours and locations. Our room was great. We loved the fireplace and the shower. We looked forward to coming home at night to see what kind of cookies and appetizers were left for us. We meet some really nice people at breakfast. We all met at the same time every morning. The host who made and served breakfast was always friendly. We would definitely come back again. The views in Sedona are beautiful. It was one of our favorite vacations. Camille and John Reading Ma", "title": "Anniversary long weekend", "user": "darjen", "date": "September 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 20177791, "likes": {"liked": "— The rooms were huge and beautiful. They were updated and clean.", "disliked": "— We were on the second floor and we would have liked to have a balcony to sit out on in the morning when we had our coffee before breakfast to look out at the beutiful view."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "This was our first trip to Sedona, and Las Posadas solidified that it won't be our last! This is such a wonderful place to stay. Our room was large, clean, comfortable...pretty much everything you could ask for in a room. The firplace was a nice added touch, and the bathrooms are beautiful. The staff was overly accomodating and breakfast every morning was delicious. We did a lot of hiking on our trip, and Las Posadas was such a nice place to return to each evening to rest and relax. We almost hated to leave our room each morning explore the area because we liked our room so much!! I never write travel reviews on websites, but I enjoyed myself so much that I felt like I needed to this time. If you are travelling to this area, definitely check this place out!", "title": "The Only Place to Stay in Sedona", "helpfulness": 1, "user": "RaeRae79", "date": "September 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 2.0}, "id": 20146972, "likes": {"liked": "— Breakfast!", "disliked": "— Construction and travel time to get to the town of Sedona from there"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "Beautiful rooms, excellent service and delicious breakfasts. My family & I stayed at Las Posadas over the weekend for a wedding and it was an great expereince. The rooms are well lit and airy. the AC was wonderful. the bathrooms were large and luxurious. The bedroom and living room were very comfortable. The staff was extremley helpful and courteous. The breakfast were delicious 3 course meals. Every afternoon, there was a platter with snacks & cookies. The location was quit with minimal noise. Our wedding party occupied 4 different rooms and they all agreed on the quality of the rooms. We would all return again.", "title": "Excellent and Outstanding", "user": "bikemanwa", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19919486, "likes": {"liked": "— The quality of the rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "First of all Jeff the front desk concierge was knowledgable and informative of the hotel and even sent me an email offering to hook me up with a jeep tour ,helicopter ride, and grand canyon trip and where to contact these businesses for my first vacation to Sedona. We arrived late afternoon Sun Aug 31st after a grueling flight directions were right on the money...The room was amazing...we had a private Jacuzzi Suite, The room had a huge comfy bed with neutral colors...there was coffee and an afternoon snack of fresh fruit and fresh baked cookies waiting...there was also a whole list of magazines for us to check out local attractions. The next morning between 8 and 930am there was an amazxing breakfast prepared by Carlos whom I thought was the chef but later found he was the GM of this little slice of Arizona heaven...a spinach fritatta and fresh yogurt, granola, and fruit were the breakfast for that morning...After a long day of normal vacation stuff...we arrived back to the room once again...fresh towels, nice hot jacuzzi, and snacks awaited us, fresh muffins and fruit, followed by another amazing breakfast by Dianne...blueberry banana pancakes with fresh strawberries and bananas with once again yogurt and granola...I thought this place was Utopia...every single day there was a blessing...the view, the room, the jacuzzi,...I will definately go back...many times over...If you want a cozy location to vacation thats not so crazy like a hotel this B and B in Sedona is by far the best Ive been to nationally...and extra special thanks to the staff for being knowledgable and helpful...and Carlos and Diane amazing food...and the recipe for that fritatta.", "title": "Im Lovinin This Place", "user": "romansdiamond", "date": "September 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19847409, "likes": {"liked": "— The Friendly Staff and Beautiful Room", "disliked": "— There was nothing I didnt like"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Just returned from a one night stay at Las Posadas of Sedona and loved it. It is a lovely B&B Boutique Inn located just outside of the main town of Sedona towards the Village of Oak Creek. I actually think the scenery getting there is the best in the area and I felt it was nice to stay outside of the more touristy Sedona main street. There are still plenty of places to eat in the area and the surrounding vistas are superb. The office staff were very helpful with recommendations (and with mailing me something I left behind). Our super spacious room was on a lower level near the breakfast area so we did not have much of a view from the room, but we had planned to go elsewhere to see the sunset and sunrise so that did not matter too much to us. We did get an opportunity to use the fireplace in the room as the evening was quite chilly. It was great that the fireplace worked on a timer so we could just fall asleep without having to worry about turning it off. After getting up early to view the sunset we returned to have a delicious fully cooked breakfast! I only wish we could have stayed longer, but will definitely plan to return to Sedona and Las Posadas.", "title": "Beautiful Sedona Getaway", "user": "WHERESWAUGH", "date": "November 1, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183173091}, {"rating": 5.0, "title": "LAs Posadas", "text": "10 of us stayed at Las Posadas 10/23/13-10/27/13. We were there for a golf vacation from NY. Loved the hotel. for those expecting a Ritz, you will be disappointed. This is a boutique hotel, and it states that on a large sign on the front of the building. I stayed in a villa suite. It was HUGE and very comfortable. It consisted of a living room, dining room, den, large bedroom with comfortable bed, large bathroom with double sink, beautiful stone tile throughout. The whole villa was very clean. Nice size kitchen with all new appliances. I began planning this trip months ago with Dory. Working with her was wonderful. She went out of her way to do all she could for us. She even offered to open the kitchen early for us on the days we had to leave for golf prior to the kitchen's regular open time. Instead of putting the staff out of their way, we opted to have the kitchen staff deliver a cooked breakfast burrito, delicious fresh yogurt and great granola. The next day they delivered a great bacon,egg,cheese sandwich along with other stuff. My thanks for that! About a week before our trip, I put in a call to Dory to infirm all our special needs and requirements. Miguel answered the phone and told me Dory no longer works there. I was shocked to hear this and was very worried that all our planning we did with Dory would be lost. I was the one who did all the planning for the 10 of us so I had the responsibility of this entire trip. Miguel assured me all would be ok, and that Suzanna would be calling me.", "user": "Peter K", "date": "October 31, 2013", "id": 183049858}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "A few hours later , Suzanna did call me assuring me all would be ok. We went over all the notes and excursions we had planned. suzanna did have all the info. she was eager to call all the golf courses and confirm our tee times. She also suggested different restaurants and made reservations for us. She and Miguel were wonderful and the trip played out without a glitch in it. Had a great time. Even the guys staying in a non suite standard room commented how large the rooms were.", "title": "Beautiful and relaxing!", "user": "Mayra5683", "date": "October 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 182279042}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I will certainly go back with my wife next time.", "title": "Lovely B&B", "user": "Delaware83", "date": "October 22, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 182014628}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "I loved las Posadas, Sedona, the red rocks, and the spectacular golf courses.", "title": "Wedding Weekend", "user": "Debra P", "date": "October 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 180835586}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "''Las Posadas has beautiful suites, a great gourmet breakfast and is just far enough out of town for peace and quite. We highly recommend it.", "title": "Loved Las Posadas", "user": "Susan2749", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20377375, "likes": {"liked": "— The suites were beautiful", "disliked": "— No pool, but a spa on our patio"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "There is no better place to stay for the money than at Las Posadas. The rooms were tastefully decorated, the beds were awesome and the daily fresh cookies and appetizers delivered to the rooms were excellent. The best part might be the large, spectacular gourmet breakfast served every morning. The staff were all very nice and helpful.", "title": "Perfect place to stay in Sedona", "user": "shassy63", "date": "September 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 20339885, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Stayed 5 nights at Las Posadas last week and it was exceptional. Many reviewers stay in Sedona for just a night or two, but after 5 nights, I can say that our stay here was truely wonderful. Some think because it's located a few miles south of the center of town that that's a negative. We thought it was a positive. After being in and around the center of Sedona, every evening we said how glad we were staying where we were--away from the congestion and noise and to our peaceful, quiet facility.", "title": "Las Posadas gets a perfect 10!", "user": "StLcardfan", "date": "September 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20307378, "likes": {"liked": "— The suite-like accommodations, and the quiet location", "disliked": "— Ice machine needs to be accessable after 5 pm"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Sat on our patio each night and listened to the quiet (except when we were entertained by the howling coyotes!) This facility has wonderful accommodations. Instead of a room, you have a suite. A large bedroom with a very comfortable bed, a living room, a small kitchenette, and large beautiful bathroom. It gives you the ability to spread out rather than just being in a \"room\". Absolutely loved this aspect.", "title": "Great Value!", "user": "drsport", "date": "September 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20263085, "likes": {"liked": "— Size of the rooms, amenities and the great breakfast.", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "The staff was most accommodating and helpful, and the breakfasts were very good also. After 5 nights there could have been a chance to slip up, but everything was top notch. When (not if) we go back to Sedona, we've already ageeed that Las Posadas is where we will want to stay.", "title": "LOVED Las Pasados of Sedona!!!", "helpfulness": 1, "user": "jayder", "date": "September 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20231344, "likes": {"liked": "— The suite -- exceptionally comfortable and attractive", "disliked": "— No pool"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Our two families enjoyed seven heavenly days filled with beauty, comfort, charm and warm hospitality at Las Posadas. There's NO better way to start a day than by enjoying a luscious breakfast in their Great Room. The property and the exceptionally enthusiastic, kind and knowledgeable staff far exceeded our expectations, which were pretty high. Our suites were very clean, very roomy and beautiful. Nope, there is no pool, but there is reasonably priced access to one - literally across the street... NONE of us ever made use of it; we had plenty to keep us occupied, including visits to natural swimming areas (just ask staff for recommendations!) that put man-made pools to shame. Las Posadas is situated about ten minutes from downtown Sedona, and it was always a lovely, serene cruise to and from the touristy downtown scene. We always looked forward to returning \"home\" in the afternoons to find our special snacks! We can't wait to return.", "title": "las posadas is a \"10\"!", "helpfulness": 2, "user": "xntric", "date": "August 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19563222, "likes": {"liked": "— can't really choose just one thing!", "disliked": "— having to leave!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Las Posadas lived up in grand style to the web site. We have traveled a lot, gone on three cruises and have never been treated better. Food was divine and afternoon trays were wonderful.", "title": "Heaven on Earth", "helpfulness": 1, "user": "aculler", "date": "August 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19475914, "likes": {"liked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We will definitely stay with you whenever we are in Sedona, roughly twice a year. Looking forward to the next time.", "title": "Choice Spot", "helpfulness": 1, "user": "dumbdumbdumb", "date": "August 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19463188}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Ann Sahlstrom and Eddie Fortner, Yuma, Az.", "title": "Loved the Ambience!", "helpfulness": 1, "user": "MeliSulli", "date": "August 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19133946, "likes": {"liked": "— The breakfasts, the comfy beds and the staff", "disliked": "— I can't think of anything I disliked"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "A wonderful place to stay and relax. It was our 10th Anniversary, and Las Posadas was the special place! Great breakfasts, beautiful rooms with great amenities. Convenient to great food and shopping. Close to nice neighborhoods for evening walks. We will be back!", "title": "Luxurious, Breathtaking Panaramic views, Romantic, PERFECT all in all!!!", "helpfulness": 1, "user": "DaddyE", "date": "August 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18937696, "likes": {"liked": "— everything"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "My wife and I stayed at Las Posadas on our first trip to Sedona the last week of July. We spent a lot of time searching accomodations options on the internet and finally decided to stay here based upon the included breakfast and special room offer listed on their web site. Our initial concern was that it is actually located south of Sedona in the Village of Oak Creek.", "title": "Great Tip to Sedona based at Las Posadas", "helpfulness": 1, "user": "Quakerkids", "date": "August 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 18934781, "likes": {"liked": "— Quiet and clean", "disliked": "— No pool"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "What a great choice this was! Las Posadas is practically new. We got a king suite with an outdoor hot tub for relaxing after a day of exploring the Sedona attracions. Everthing in the room was new and in terrific shape. Our room included a small fridge, microwave, fireplace and two ouside seating areas. Parking at Las Posadas was convenient and we did not mind the short drive to Sedona. In fact some of the best red rock views were just outside our door. There are new sidewalks along the road for a relaxing walk in the morning.", "title": "nice anniversary stay", "user": "tate7475", "date": "August 7, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "business": 4.0, "cleanliness": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18717376}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The staff was very accomodating, providing extra towels when we asked and going out of their way to help us become familiar with the area. The breakfast in the morning had lots of choices and included a chef who cooked a daily breakfast entree. A special surprise was the snack plate we found upon returning to our room in the afternoon.", "title": "Las Posadas", "helpfulness": 1, "user": "aztravlgrl", "date": "August 2, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 18521945, "likes": {"liked": "— Quality of room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We have already suggested Las Posadas to friends and family. I am sure there are other nice places to stay in the area, but you can't go wrong with this place.", "title": "Wonderful Stay", "helpfulness": 1, "user": "ohioteacher", "date": "July 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18473517, "likes": {"liked": "— Beautifully appointed room", "disliked": "— No pool"}}, {"rating": 5.0, "title": "Las Posadas is GREAT", "text": "We had a great anniversary getaway in Sedona. the room was nice and large with fridge and micro. We thourougly enjoyed star gazing in the hot tub.Everyone was extremely accommodating. Great breakfast too!!", "user": "Florida60", "date": "July 27, 2008", "id": 18305239}], "location": {"country": "United States", "city": "Sedona"}, "stars": 3.5, "variance": {"poor": 9, "average": 14, "very good": 63, "terrible": 0, "excellent": 454}, "aka": "Las Posadas Of Sedona Hotel", "slim_ranking": 0.40625, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "Las Posadas of Sedona, a luxury Boutique Inn features spacious 2-room suites, full southwestern breakfast, pool and jacuzzi. Concierge services available and outstanding guest service."}