{"user_rating": 5.0, "review_count": 528, "name": "Las Ventanas al Paraiso, A Rosewood Resort", "reviews": [{"rating": 5.0, "title": "Morning coffee service at L.V.", "text": "I have just read all 52 reviews of Las Ventanas here! I love the resort and would return in a second, but some of these recent comments really worry me...like the dirty pools, the obscenely over-priced wines, the noisy kids & so on. Oh well...", "user": "JRWTucson", "date": "November 15, 2005", "id": 4112483}, {"rating": 2.0, "title": "Very Disappointed-Not worth the money", "text": "I had a sadly funny and truly exhausting experience several mornings at The Restaurant; I discovered that they use Carnation canned evaporated milk for the cream in your coffee. Real, fresh Mexican dairy cream is simply rich & wonderful with their coffee, but a tad bit yellowish in color. The Mexicans think that Gringos would think that their natural cream is rotten, so they use this canned crap. For $1000 a day, I want real U.S. 1/2 & 1/2 or preferably real MX cream. It was NOT gonna happen at L.V. no matter what I said or did or begged. My Spanish in this regard is excellent, but they simply do not want to hear you speak Spanish. They tune you out. It is unreal, as they want to speak English so badly that they will not listen to your Spanish.", "user": "2NYTraveler", "date": "November 8, 2005", "id": 4094569}, {"rating": 5.0, "title": "Words can not describe", "text": "So, I got whipped cream, yogurt, creme fraiche, skim milk, canned Carnation crap and God knows what else for my coffee, which always was cold by the time we got thru this ridiculous daily nitemare. I got so furious one morning, I just got up & moved over to the Sea Grill counter seating & started over. It was such an easy thing to resolve, but they were just clueless. Next time I visit, I am arriving with a cooler full of Horizon Organic Half & Half pints for the Chef, and my personal use! See ya'll down in Heaven soon! Yup, I am an \"A-lister\", & a big, big fan of L.V.", "user": "A TripAdvisor user", "date": "November 6, 2005", "id": 4088988}, {"rating": 5.0, "title": "Run, don't walk to Las Ventanas!!!!", "text": "My wife and I honeymooned at Las Ventanas the week of October 4th through October 12th. This was the second leg of our honeymoon as we stayed at the Four Seasons Punta Mita the week before.", "user": "A TripAdvisor user", "date": "October 17, 2005", "id": 4029277}, {"rating": 5.0, "title": "Fantastic Hotel--Can't wait to go again!", "text": "After spending 7 nights at the 4 Seasons(Punta Mita) we were extremely disappointed to say the least. We chose to stay at Las Ventanas during the second half of our trip because of all the great reviews from this site and articles read on the internet.", "user": "calitocabo", "date": "October 17, 2005", "id": 4028682}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We arrived at the airport, and were greeted outside by man with a sign \"Las Ventanas.\" We were driven to the resort in a Mercedes. Very professional. We were greeted by the staff at the entrance with a tropical juice. A tour of the resort followed, with an introduction to our personal butler.", "title": "Total Relaxation", "helpfulness": 1, "user": "ReadyToGoDoc", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97639257}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The room was lovely, with a telescope to watch the passing whales. The weather was 75 - just right for sunbathing. We put our toes in the ocean, but mainly stayed by the pool. The pool waiter was attentive, leaving two large fresh towels, and a bucket of chilled water. There was even a spray evian can for each guest to spray water on themselves. One of the employees came around to wash your sunglasses.", "title": "Simply Excellent!", "user": "ViLana18", "date": "February 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97210384}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "The next morning we visited the fitness center. It was well equipped, and staffed by an attendant with cold water and a towel. This was followed by a trip to the dry and wet sauna, a shower, and a dip in the jacuzzi. This was followed by a massage, manicure and pedicure. This was the best massage I have ever had. As far as the manicure and pedicure, it was great. It was also my first, as I am a guy. My wife thought it would be fun, and she was right.", "title": "As good as it gets (other than dinners)", "user": "DRMEngland", "date": "February 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96859206}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We ate at \"La Cava\" that night. A special dinner for two had been arranged in the wine cellar. It was 5 courses, each with their own wine. The presentation was beautiful, and the taste of the food and wine was excellent.", "title": "Unbelievable Again!!", "user": "mlgtexas", "date": "February 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 96254404}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Other meals were at the Restaurant and the Sea Grill. We enjoyed all our meals. We became adventurous and tried ceviche - this is fresh fish, in a lemon vinagrette sauce.", "title": "Doesn't get much better than this!", "user": "Joolsforester", "date": "February 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95953447}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We stayed at Las Ventanas last March after spending a few days in Las Vegas and deciding to head to some relaxing sun for the last 5 days of our vacation. We chose Las Ventanas mainly because it have villa style rooms so we could share a lounge, kitchen and balcony from out two bedroom apartment.", "title": "Absolute Heaven!", "user": "TorOnTour", "date": "January 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 94095368}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "On arrival we were taken to a room towards the back of the resort with no view ( we had only paid for garden, not ocean views anyway) and unfortunately a fair bit of noise from the motorway. It was also not as large as we had expected. So after discussion we went down to reception and asked if they had any other Two Bedroom apartments available. The manager was SO helpful, she took us to view all the empty rooms and let us choose. We ended up with a massive apartment that had incredible sea views from the large balcony.", "title": "Better than I expected!", "user": "DCA2113", "date": "January 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93229809}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Worth asking!! I don't think they meant to put us in an average room, but it was incomparable to the room we ended up choosing for the same price per night.", "title": "Best Resort in Cabo!", "helpfulness": 1, "user": "CJL1280", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92281195}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I won't go in to too much detail here, suffice it to say the the staff were the best of any hotel I have stayed in the world. Service was exemplary, nothing was too big a deal, there were swimming pools at every building, including the large, main pool in the centre of the resort (great for the morning then escape to your private pool later in the afternoon!). Food was delicious. I had my sunglasses cleaned every afternoon, umbrellas moved in to the perfect position without even asking, cool refreshments brought throughout the day...seriously amazing service and never a hand out expecting a tip.", "title": "Heaven on earth", "user": "igang", "date": "January 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 92037764}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I would LOVE to go here again. As it was we extended our stay by two extra nights, but next time I'd go for 2 weeks (if I'm so lucky as to get there again). Brilliant holiday.", "title": "Incredible Honeymoon at Ventanas", "helpfulness": 1, "user": "linders190", "date": "December 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 90609072}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Superb, breathtaking, outstanding, one of the very best hotels I have ever stayed in, up there with The Four Seasons Chiang Mai.", "title": "Yes its expensive, but the best always is.", "helpfulness": 6, "user": "Travelking997", "date": "September 6, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5773771, "likes": {"liked": "— everything, well appointed suites with great touches", "disliked": "— nothing !"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "I have stayed in some of the finest hotels throughout the world and Las Ventanas is right up there.", "title": "Great Anniversary Trip", "helpfulness": 45, "user": "drmeg", "date": "August 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5710351, "likes": {"liked": "— scenery and room", "disliked": "— price"}}, {"rating": 5.0, "title": "paradise with a serious pricetag", "text": "Yes it is expensive, but in my oppinion for its location, look and unbelievable service standards its worth every cent.", "helpfulness": 20, "user": "coed", "date": "July 20, 2006", "id": 5492191}, {"rating": 5.0, "title": "Can't wait to go back!", "text": "I would hate to visit this hotel on a tight budget, its one of those places where money (within reason ) should not be an object whilst staying there.", "helpfulness": 21, "user": "A TripAdvisor user", "date": "July 2, 2006", "id": 5418364}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "If you are going to be shocked in paying $22 plus 28% service and tax for a cheeseburger, then maybe Las Ventanas is not for you.", "title": "Exceptional and Expensive", "helpfulness": 26, "user": "rbwinston", "date": "June 17, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 5356008}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "I was able to escape the Hilton after the deplorable time I had there and managed to get into Las Ventanas the last minute. They put us in what was called a Garden suite but it should have been listed as a partial ocean view cause we could easily see the ocean from our room. Every aspect of this hotel was outstanding. From the geniune friendly unpretenous staff to the manager who came by at the end to make sure we had arrangements to the airport to the friendly staff in the restruants all of which served great food. This is probably one of the best hotels in the world. The room was as nice as the suite I had in the Four Seasons in Sayan and was large and beautifully appointed. I cannot recommend this hotel more. I had lunch at \"the one and only\" which to me seemed like the kind of place hopeful entertainment people go to be \"seen\" . Las Ventanas is more of the kind of place where you go where you do not want to be seen because you have already made it..", "title": "fantastic resort", "helpfulness": 9, "user": "scottsdaletraveler", "date": "December 25, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6495928, "likes": {"liked": "— the great service", "disliked": "— loved everything"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006", "text": "It is expensive but honestly, if you are looking for an elegant romantic place where you will have privacy, nonobtrusive service and just a great rest, this is the place.", "title": "Beautiful Hotel but definitely had problems w/ the service", "helpfulness": 27, "user": "Jemimagold", "date": "December 11, 2006", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 5.0}, "id": 6364304, "likes": {"liked": "— The Hotel was visually stunning.", "disliked": "— Terrible service"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "My sister and I stayed here for 3 nights from Dec. 7-10, as my gift to her to celebrate her 40th birthday on Dec. 8th. Given that our room was $800 a night, I expected flawless service. We definitely did not get it. To be as succinct as possible, here were the problems:", "title": "Resort is all about service", "helpfulness": 13, "user": "JeannieStu", "date": "November 13, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6121253, "likes": {"liked": "— The size of the room and ammenities"}}, {"rating": 3.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "1. Our Room Service breakfast order was incorrect 2 out of 3 days even though we ordered the same exact thing on the 2 days (plain unsweetened yogurt and wholemeal toast). Instead, we received sweetened vanilla yogurt and wholewheat toast (FYI- we had had the LVP Wholemeal Toast on the 1st day in the Restaurant - I think it is something of a LVP specialty and the staff definitely know what it is). We were extremely clear when we called Room Service as what we wanted and even told them on the 3rd day of the incorrect order on the 2nd day. And - taking into account with having to send back the incorrect food and get the correct food, getting our correct breakfast took approx. 50 -60 mins. each day. (the resort appeared to be half full) In any event, getting an order wrong 2 days in a row is unacceptable in my book.", "title": "Beautiful Resort - spotty service", "helpfulness": 17, "user": "himaintenanc", "date": "November 5, 2006", "detail_rating": {"front_desk": 1.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6061206, "likes": {"liked": "— bad front desk service/spotty service", "disliked": "— Take advantage of the beach dinner or roof deck dinner - very romantic"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "2. The Air Conditioning in the Fitness Center was 81 degrees F our first day there. When I asked the attendant if he could turn it down, he told me that he would have to \"ask management for permission\", and when he got permission, it was only turned down to 79! Thus, it was incredibly and stiflingly hot - I felt sick by the end of my workout. When I complained to the Concierge Desk that night about the lack of a cool Fitness Center, it turned out that the Center's air conditioner was broken and had to be fixed. Duh! However, what I still don't get is that none of the Fitness Center staff noticed a thing about the heat in there until I said something about it. The next day, however, it was fixed and down to 70 degrees. Whew.", "title": "Amazing Honeymoon", "helpfulness": 24, "user": "Newlywed-9-9-06", "date": "October 9, 2006", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5931713}, {"rating": 5.0, "title": "best hotel in cabo", "text": "las ventanas is THE BEST hotel in cabo and we've stayed at several others", "helpfulness": 1, "user": "marie6613", "date": "May 22, 2011", "id": 109386646}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "from the moment you are in the resort, every little detail is first class", "title": "Again ... simply the best!", "user": "gmebius", "date": "May 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108958746}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "check in is not your normal check in, just a little table, then you are brought to your suite", "title": "Nothing short of paradise", "helpfulness": 2, "user": "DAgostas209", "date": "May 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 108921048}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "an amazing one at that", "title": "Perfection", "helpfulness": 2, "user": "jh0123", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 108331869}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "personal tequila as you walk in, high ceilings, enormous bathroom, wonderful patio with a telescope", "title": "amazing service", "helpfulness": 1, "user": "rubyred135", "date": "April 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104151090}, {"rating": 5.0, "title": "Perfect Getaway!!", "text": "My husband and I just returned from a six night stay at Las Ventanas and it was a truly perfect experience. We travel extensively and are very particular about where we stay. Generally we stay in Four Seasons or Ritz Carlton. Las Ventanas put both of these to shame! The service is outstanding. The staff incredibly friendly; all of them. From housekeeping to the staff at the Restaurant. The rooms are beautiful and large with beautiful bathrooms. There is nothing to complain about at Las Ventanas and we plan to go back very soon.", "user": "srb", "date": "October 9, 2005", "id": 4002793}, {"rating": 5.0, "title": "Just do it!", "text": "After spending an incredible 12 days at LV on our honeymoon, I'm already thinking of when my husband and I can return to this unbelieveabe place. Yes LV is expensive - but two things made the cost worth it. The Grounds and the Staff! I can't begin to say enough kind things about the staff at Ventanas! From Housekeeping to the Pool Butlers, from the front desk to the waiters, hosts and the spa staff, every single employee was kind, extremely helpful (without being overbearing) and never once did they make my husband and I feel we had to tip them to ensure such gracious attention.", "user": "A TripAdvisor user", "date": "October 8, 2005", "id": 4002121}, {"rating": 4.0, "title": "Third Visit -- still a delight, but with one reservation", "text": "The grounds at LV are pristine, and unlike the last posting the water in the inifinity pools was clear and beautiful. We split our time between an OV room and OV junior suite with rooftop terrace. If you want to save yourself a few extra bucks forgo the rooftop terrace. Both rooms are identicle in every aspect execpt for having two lounge chairs on the roof for your use, and a rather small \"jacuzzi\" (if you can call it that) on your porch. Yes, late at night the rooftop terrace can get you closer to the stars - but outside of a sea and stars massage, we hardly took advantage of the roof because we were either out or spending time on the grounds around the resort which, at night, we often felt as if we had all to ourselves anyway. The only time things got busy was when Jennifer Aniston spent a few days at the resort on a photo shoot. Nights got busy as if everyone in Los Cabos came to LV to try and get close to her. We sat at the table next to her and her friends at dinner, and I can tell you she created quite a buzz. While LV had a lot going on with Ms. Aniston and her entourage (security was everywhere, though unobtrusive), the staff continued to help the rest of us non-celebrities feel pampered and important.", "user": "SevenContinents07", "date": "September 20, 2005", "id": 3927250}, {"rating": 5.0, "title": "Perfect Honeymoon", "text": "Now, the down-side. Yes, there is one thing that did not come off as fabulous as we hoped. While breakfast at LV is outstanding, and the Sea Grill's Fish Taco's, Black Bean Nachos and Ceviche simply addicting - our dinner at the famed \"The Restaurant\" didn't come close to meeting our expectations. Despite all the great reviews, both of us walked away feeling extremely dissapointed, this after spending $475, and without ordering dessert. Both our appetizers were rather bland thus deeming them mediocre. As for our entrees, while my filet of beef was cooked perfectly, it was nothing out of the ordinary. My husband's \"suckling pig\" was a flop, overpowered by carmalized onions, washed in a watery broth. Even our bottle of wine was rather lacking the pizzaz I'd expect from such an esteemed wine cellar which included some of the most starking mark-ups I have ever seen. We've been fortunate enough to have eaten at some of the highest rated places in New York and Philadelphia and have never paid that much money for dinner only to walk away feeling we'd just been had. Still, I consider this a minor kink (though a pricey one) in what was an amazing experience.", "user": "phoenix57", "date": "August 31, 2005", "id": 3834997}, {"rating": 5.0, "title": "Unbeleivable", "text": "Finally, no matter where you end up staying in Los Cabos, I urge you to RENT A CAR. We knew cab rides would be pricey - but what we didn't count on was finding so many great restaurant and shopping choices in San Jose Del Cabo and along the rest of the Corridor. Driving in Los Cabos from one end to the other was quite easy so if you're worried about getting around - don't be. Besides the real reason to rent a car - Todos Santos! What a great town! Definatley a great way to spend the day! It really gives you a taste of an authentic Mexican town, while offering up some of the best shopping and dining around. Give yourself an entire day - because the photo opportunities along the way, with the gorgeous desert mountains one one side - and some of the best beaches on the other - make getting to Todos Santos more than half the fun!", "user": "A TripAdvisor user", "date": "August 29, 2005", "id": 3813281}, {"rating": 5.0, "title": "Wonderful time!", "text": "We had the most wonderful vacation at Las Ventanas al Paraiso. The service was exceptional, including a sunglasses butler (cleaning your sunglasses while you swim in the pool!) and lemongrass popsicles delivered to your hammock of the beach...", "helpfulness": 12, "user": "Gourmetphd", "date": "January 26, 2006", "id": 4390119}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "There are absolutely no words, or pictures to sufficiently tell you how perfect Las Ventanas was. Any attempt for me to tell about it would have to begin with \"Once upon a time…\" and it WAS a once in a life-time experience, not only for my wife, as it was meant to be, but for our entire family.", "title": "Once upon a time....", "helpfulness": 65, "user": "Texman", "date": "January 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4368471}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "THE PEOPLE! The staff's response to most everything was \"It is my pleasure\". Everything did NOT go as I had planned: the staff kept finding ways to make things even MORE special and seemed to really get caught up in making this magical fairy tale experience all the more fantastic!", "title": "Set a New Standard of Excellence", "helpfulness": 28, "user": "travgal", "date": "January 2, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4317420}, {"rating": 5.0, "stay_parameters": "Stayed December 2005", "text": "The occasion was a surprise birthday gathering to celebrate my wife's 50th birthday. Secretly, I had arranged for our college-aged children, my wife's sisters, and her mother & best friend to seclude themselves next door at the Casa Del Mar. Obviously the emphasis was on \"surprise\"!", "title": "Best In The World", "helpfulness": 28, "user": "paddock_rat", "date": "December 31, 2005", "detail_rating": {"cleanliness": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4314098}, {"rating": 5.0, "title": "Closest to Heaven on Earth", "text": "Delivering breakfast to our room on her birthday morning was none other than our children, arranged by room service and the concierge once there was an understanding of my intentions to surprise! Then later that morning, while strolling along the beach, whom should we encounter but her strategically placed mother & best friend! My wife was blown away!", "helpfulness": 15, "user": "A TripAdvisor user", "date": "November 18, 2005", "id": 4126094}, {"rating": 5.0, "title": "This place was wonderful", "text": "I was thrilled to check in to Tripadvisor and see two reviews from people who stayed during the same time frame. I appreciate all the reviews I read about this property so I want to return the favor. Like most who stay at this property, I would say we are pretty well traveled and stay at first class properties. (hope that doesn't sound too hoity toity) I researched a lot of new places because this was the first time my husband and I were able to get away sans child. I am from Boston so the travel required more than I wished (ie, no direct flight) but it was so worth the longer travel commitment.", "helpfulness": 30, "user": "lcookster", "date": "June 16, 2006", "id": 5353993}, {"rating": 5.0, "title": "This Place is the Best. If You Can Swing the Cost, Book It", "text": "When I had originally booked with the resort, the category of room I wanted was not available. I booked something which would have required we switch rooms and then frequently checked back in to check on cancellations. I was able to book a roof top ocean view suite. I don't think there is a bad room on this property. I liked the ocean view because it seemed more private, yet still was really very close to the beach. The room was great (although if you have stayed at Cap Juluca their bathroom is bigger and better). High ceiling, ceiling fan and AC! Wow- did we need that given the mid-90 degree and above temps all week. One thing we have experienced in Mexico is that the typical hotel mattress is more firm than we prefer. I called housekeeping and requested a foam top. I did have to call back to remind them but it was on the bed before I went to sleep that night. Made a big difference. The outdoor living areas were really wonderful. We used the rooftop area several times but pref'd the somewhat shaded patio area. Housekeeping service was top notch, although one evening turn down service was skipped and one day the room wasn't cleaned until 3 pm. However, the room looked pristine and all of that was terrific. If you are going to obsess on any small, you will miss the much bigger picture.", "helpfulness": 18, "user": "PHL2", "date": "June 12, 2006", "id": 5336001}, {"rating": 5.0, "title": "more than expected", "text": "We stayed for 6 nights and were really in desperate need of R&R when we got there. As a result, we spent a lot of our time 'on property.' We did rent the mini-coop for one day. We drove up the Baja coast and went to Todos Santos. The town wasn't that great- very tourista- but the ride was beautiful. Really glad we did it. On the way back, we stopped for lunch at Esperanza. That was terrific. That evening we went for drinks at Palmilla. I had looked into all of the properties, frankly I am really glad we chose Las Ventanas. However, all 3 are stellar places. We did the $50 dollar tequila lesson, which was really fun. We almost blew it off, but it turns out to be the best value at the resort. ha! Small group of us, tasted 5 Tequilas (all of increasing age and value), got free ceviche and guac etc. We also got a diploma, which we all thought was a hoot and would look good framed in our home offices.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "May 2, 2006", "id": 5026554}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "We ate at the Sea Grill as well as the Restaurant. I loved the bartenders at the Sea Grill, in fact everyone there was wonderful. The restaurant is more formal and there was only one person there who gave me 'attitude'. Everyone else was wonderful. At night they had twin brothers playing flamenco guitar. Wonderful. The swim up bar was a hoot. Usually when we vacation we are not into 'socializing' but I have to say that a group of us congregated there every afternoon for happy hour. No one intruded on anyone's privacy but it was great fun. A group of us have agreed to return again same time, next year. Everyone who was staying there thought the place was incredible. Also, I don't like to get too dolled up on vacation. It may be different during 'high season' but a lot of folks were more casual than I had anticipated. I loved that. So it is a first class property but also felt very relaxed.", "title": "Unbelievable resort!", "helpfulness": 27, "user": "Vickie", "date": "April 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4967256}, {"rating": 5.0, "title": "Great Place", "text": "I had two spa treatments- both fabulous. One deep tissue massage which was somewhat painful but incredibly effective. I also had the two hour Thai yoga massage. The guy who did it REALLY knows what he is doing. I felt terrific afterward, although you really work hard during it. If you have not done this, make sure you understand what you are getting into and what the difference is in terms of technique etc. Everyone at the resort who had a spa treatment raved about it.", "helpfulness": 24, "user": "A TripAdvisor user", "date": "February 20, 2006", "id": 4474764}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I can not express how amazing this hotel really is. From the moment you step out of the car you are greeted by 2 people handing you a cold beverage. Anything you want want is yours and it's there pleasure. That is all we heard. \"It's my pleasure\" They call you by name and leave you be if you need alone time. They treated my 2 year old as if they were there own and they have babysitters on staff that are ready anytime of the day. We felt like a Queen and King of are own castle! It is an expensive place to stay but worth every penny. We have stayed all around the world and I have never had better service than the Las Ventanas!", "title": "It's my Pleasure", "user": "Morgan021", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100572204}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "This was my second time returning to this wonderful oasis of tranquility. Absolute privacy and yet plenty of staff available at a moment notice. The staff is friendly and cares to help. Many I remembered from my last visit 3 years ago and they remembered me as well. The food is excellent, incredibly fresh and we ate foods mostly from the sea. The portions are large and filling too. No need to eat outside Las Ventanas al Paraiso unless one desires an evening off the property. The ceviche and sushi bar vary daily and are fresh and delicious. Spa accommodations are sublime. We had one that includes body, mind and spirit and centers with a 3rd eye oil drip ! It was crazy in a great way. Also had mani-pedi and other spa services which were professional and topnotch. The Rooms on the water are Stunning, with beautiful patios. We spent our evenings watching the stars, The star-scapes are breath taking. And the BEST part of the trip bar none, was whale watching from the room, and beach every day. All day long there were baby and mother whales and pods swimming and frolicking close to shore line. I kid you not!", "title": "Sublime- The best doesn't get better than this\"", "user": "DrPThink", "date": "March 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100572072}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Stayed at the establishment for nephew's wedding and from the moment we drove up to the entry gate we could tell we were in for a very special weekend. Service began in the gorgeous open air lobby with incredible views and evryone addressing you by name.", "title": "Pampered Luxury", "user": "Bobbystix", "date": "March 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 99319812}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "The rooms were large and so inviting you almost didn't want/need to leave (fresh fruit basket, complimentary bottle of tequila, private patio with great views, telescope in every room to allow one to see the whales just off the beach in great detail).", "title": "My friends are sick of me raving about this place", "user": "johngeorgopoulos", "date": "March 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98497136}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I spent 6 nights at Las Ventanas with my girlfriend and despite having traveled extensively, I have never experienced anything like this. The genuine and heart felt desire to make your stay as perfect as it can be coupled with the unbelievable amenities and room (we had an Oceanview suite) make it the ultimate relaxation destination.", "title": "Amazing", "helpfulness": 1, "user": "Don C", "date": "February 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 97652132}], "location": {}, "stars": 5, "variance": {"poor": 9, "average": 12, "very good": 30, "terrible": 4, "excellent": 473}, "aka": "Las Ventanas Al Paraiso, a Rosewood Hotel", "slim_ranking": 0.027027027027, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}}