{"user_rating": 4.0, "review_count": 318, "name": "Lavender Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "I stayed at this hotel for 8 days, originally in a standard room and later in the only suite - which is magnificent with a large balcony that overlooks the market and the city. Some of the staff are extremely friendly and helpful, some of them are the opposite. All of them have a problem with English. I especially hated the list which listed everything in the room with the cost of replacing it. When I used a tacky wooden handled knife and the room staff didn't replace it, they tried to charge me for it. When the person in charge of replacing mini bar items didn't turn up they tried to charge me three days in a row for the same items. Finally they just charged my credit card after I left in spite of the fact that I had explained the problem, slowly and carefully, to several different people. And they haven't replied to my protesting email. The location is good but there are lots of hotels in this area. When they organised a tour for me and the tour people forget about me and left me sitting and, when reminded, turned up in a taxi to take me for half a tour, there was no follow up and no apology. The breakfast was fine and the top floor restaurant and bar was nice with helpful staff. This could be a really good hotel but, at the moment, just doesn't make it. I suspect the lack of a native English speaker anywhere in the picture is the reason. Would I recommend it? With reservations.", "title": "It's all true, good and bad.", "helpfulness": 2, "user": "PearlPureheart", "date": "September 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 78058431}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "Stayed total of 9 nights in the Lavender Hotel, Saigon between trips to Cambodia and Muine. Travelled with my two sons, 20 & 14 years old. The rooms were a little small but overall perfect for a good quiet nights sleep. Beds were very comfortable. Literally on the door step of Ben Than Markets and the night food markets. The staff were very helpful and friendly. Our room was very clean and serviced daily. (My 14 year old son reckons it was awesome). The bathroom was very clean with hot showers. For those who are travelling the region and want a good, clean and comfortable hotel, at a very reasonable price, I would certainly recommend this hotel. (Only down fall was there were only two small windows in the room - but we didn't spend much time in the room during the day). At US$100 per night with breakfast for 3 of us, you can't go wrong. Perfect for dad (or mum) travelling with their teenage or adult kids.", "title": "Lavender Hotel, Saigon", "user": "George1961", "date": "August 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 76586556}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Room was small, but very clean and modern, bathroom was small but had a great shower, overall a lovely well presented hotel.Great location just across the road was the Ben Thanh market and when that closed there were night markets in the street.The staff were great, and the breakfast had lots to chose from,really enjoyed our five days there.", "title": "Great location,friendly staff", "user": "boggywiz", "date": "August 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 75119335}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We prebooked the hotel on line. It was more expensive then we had been use to in Vietnam, but it was a three star hotel with a good location across from the market. My adult son and his Vietnamese girlfriend were traveling with us. We were told apoun check in that they do not allow Vietnamese woman to share room with foreigners. This was fine as were iin a country different than our own and we would adjust accordingly. However the receptionist did not know that my son's girlfriend could understand Vietnamese very well. While talking on the phone the receptionist referred to us as animals. Needless to say we cut our stay short and moved into another hotel. The service was good the rooms nice, but they had no outside windows. I would not go back.", "title": "On the surface the reception appeared pleasant.", "helpfulness": 1, "user": "Bc_Polly", "date": "July 25, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 72204008}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "I was staying there way back of Jan 2010 for 1 night stay for business purpose. It was a comfortable night for my stay in HCM. Due to the short stay, I would not able to comment on the location of this hotel, but knowing that it is just opposite a famous night market in HCM, for some light shopping and eateries.", "title": "Above average hotel for its value and class", "helpfulness": 1, "user": "Eve83", "date": "July 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 71613438}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "We booked the room with twin beds. It was pretty awful, no window, just something opening into a stair well. Passed quite a few rooms on our way to the elevator and doubles seem very nicely done. Place was clean, breakfast was nice... But our room, awful. Don't go for the twin bed option!", "title": "Good Breakfast", "helpfulness": 1, "user": "cherie_clark", "date": "March 2, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 98717380}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Right across the road from the brilliant markets. Just down the road from good reastaurants. A very good hotel.", "title": "Could have stayed longer", "user": "CharlieDylan", "date": "February 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 95438738}, {"rating": 4.0, "stay_parameters": "Stayed January 2011", "text": "Just across the street from Ben Thanh Market, this pretty hotel is a bargain. Very clean, except for stained carpets, its tiny rooms still contain amenities as a safe, good shower with lots of hot water, the best wifi connection we've had in the country thus far, coffee and tea, hairdryer, air-conditioning.", "title": "Great location and price", "user": "26lahu", "date": "January 14, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 92874717}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Staff very friendly and helpful, especially a pleasant doorman. Taxi company stations a facilitator right outside the hotel to flag down a driver for you and tell him where you're going. Yummy French patisserie, \"Une Journee a Paris,\" a couple doors away. Foot massage parlor in hotel. Good breakfast buffet.", "title": "Small but clean rooms, very good value", "user": "theapollo2010", "date": "January 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 92225238}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "Because of the way the hotel is positioned, there are no windows, so clever false windows have been created, however they obviously cannot replace real windows. One does feel a bit claustrophobic.", "title": "Lavender Gem in HCMC", "user": "Aussiguys", "date": "January 6, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 91924005}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We selected Lavender based on TA reviews and it was a really nice property. The breakfast was excellent, service staff great, tours organized were also excellent. Only issue for me was that I checked out 4 other properties within a block and they all had rates in the $40- $50 range for the exact same facilities I paid the posted rate of $75(without a window!!) A&EM hotel was better for alot less.....", "title": "Neighborhood has alot more for alot less!", "helpfulness": 1, "user": "dreemin2", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 100788350}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "The Lavender Hotel, near Ben Thanh market, is a terrific mid-priced choice. Rooms are not large and may not even have a window, but are very pleasant and clean. Staff is professional and the location is unbeatable.", "title": "Value, convenience, cleanliness", "user": "JaneInFLA", "date": "March 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 100706169}, {"rating": 4.0, "stay_parameters": "Stayed March 2011", "text": "On the whole, I found The Lavender Hotel a pleasant experience. My party of three (me, Mum and good friend) were pleasantly surprised at how clean the place was considering the local area. Being just opposite the Ben Thanh Market, lots of construction taking place, the streets and roads are constantly busy. That said, this is the Vietnamese (inner city)culture. The pavements are poor, crossing the road takes a lot of guts and eyes everywhere and what inner city market is not a haven for thieves. Keep your wits about you, don’t flash the cash, accept the hard push to purchase, thank them (\"gam on\") and walk away. All the wares and fairs are the same price, try a little haggling. Vietnamese dong was the best value but take US dollars for the bigger shops just up the road and with nice air con. The walk around the area as three women was not at all too bad, stick to the main roads as you would in any other town/city .", "title": "Not a bad place if accepting Vietnamese culture", "user": "ohappydays", "date": "March 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 100006684}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "As for the Hotel and staff.", "title": "Clean hotel, poor management", "user": "Toddintr", "date": "March 8, 2011", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 99393390}, {"rating": 4.0, "title": "The excellent staff made our stay a great pleasure", "text": "The staff were more than becoming to our aid when one of us was taken ill. Yes the language is a barrier. Polite Thank you (gam on), you’re welcome (cun gi chi) hello (chiao) and goodbye (tam beee), gave them and us a good laugh and smile, but I’m aware that I was the one in their country, not the other way around. They do have enough Basic English to enable you to enjoy your stay. The food in the restaurant was enjoyed by both my plain pallet and my accompanying comrades \"I’ll try anything\" tastes. We found this a good base for a couple of days stay in between our tours. They did look after the larger suitcases whilst we were away but this is kept in the foyer under the eye of the porter.", "user": "davidandco", "date": "March 2, 2011", "id": 98731589}, {"rating": 4.0, "stay_parameters": "Stayed December 2010", "text": "As we drove down the streets of Saigon, we were a little worried about what standard our hotel would be - and what a pleasant surprise it was. Our room (a double) was pretty basic but clean with a very small window. The staff were so helpful and I can highly recommend the foot spa (very cheap) but be warned - it is so relaxing you might fall asleep and miss it. The location of the hotel is minutes on foot to Ben Thanh Markets and great for other tourist attractions either by cyclo or taxi. In the restaurant on the top floor the views are spectacular. Breakfast offered a good selection. You really get value for money at the Lavender Hotel", "title": "A Little Gem", "user": "Pom50", "date": "December 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 90866948}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled solo", "text": "I loved the Lavender. I had a deluxe room and it was very large and light and inexpensive. The location was great between the market and a French patisserie!", "title": "PERFECT HOTEL PERFECT LOCATION!", "user": "teall", "date": "December 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89589484}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "I had a foot massage everyday and it was the best fot massage I had in Vietnam, Bangkok or Cambodia! Only problem was I always fell asleep!", "title": "GREAT LOCATION", "helpfulness": 1, "user": "ozietraveler", "date": "November 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 88378299}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "The breakfast was bountiful and delicious and the room service was very handy after a long day.", "title": "good location and comfy room", "user": "Hermanjad", "date": "October 9, 2010", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 82698976}, {"rating": 4.0, "title": "good", "text": "I would certainly stay there again.", "user": "keindus", "date": "September 14, 2010", "id": 79521359}], "location": {"country": "Vietnam", "continent": "Asia"}, "stars": 3, "variance": {"poor": 10, "average": 50, "very good": 190, "terrible": 2, "excellent": 66}, "aka": "Lavender Boutique Hotel", "slim_ranking": 0.234421364985, "description": "The hotel offers 66 rooms which have been designed not only to create the elegance of a specially customized architecture but also to establish an intimate space to make you feel quite at home."}