{"user_rating": 5.0, "review_count": 709, "name": "Layana Resort and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "Searching for a place to relax for a few days in S Thailand we discovered paradise in the form of the new Layana resort on Koh Lanta. This tranquil resort comprises a dozen of so 2 storey bungalows each with 4 suites grouped around a large central garden with one of the most beautiful beach front pools and restaurant/bar pavillions we have seen. Small enough for personal service but large enough to allow for privacy, the resort provides everything you could need for total relaxation.", "title": "Layana, a perfect getaway", "helpfulness": 13, "user": "Intrepidtoo", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 6184732, "likes": {"liked": "— The pool, the service, the lack of extra/hidden charges and the rooms", "disliked": "— The 2hr trip from the airport (it's better outside the rainy season when it can be done by launch)"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The suites are very well furnished with luxurious sunken bathrooms, day beds and large balconies. Free, wireless internet is available throughout (essential for todays bloggers) and rooms have DVD players with a complimentary library.", "title": "Incredible is an understatement", "helpfulness": 10, "user": "ObsessedTraveller", "date": "November 24, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6171292, "likes": {"liked": "— absolutely everything -- it would be impossible to single out one thing", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Aside from the pool and spa, a major attraction is the beachside restaurant where the staff serve the most beautiful meals from a very varied menu. It's the little extras that make all the difference here, the unadvertised sorbets or dips that appear between courses and are different every day, the flowers on the table or floating in bowls, the different origami patterns of the napkins or the complimentary glass of champagne with Sunday breakfast. The buffet breakfast (included in the room rate) is excellent and varies each day.", "title": "Absolutely Terrific time at Layana", "helpfulness": 11, "user": "gaijin-everywhere", "date": "November 14, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6132175, "likes": {"liked": "— location", "disliked": "— no traditional crafts shopping"}}, {"rating": 5.0, "title": "Service Has A Name...", "text": "Unlike many five star properties, the owners live on site and take delight in pleasing their guests in the most unobtrusive manner. It's this attention to detail that distinguishes Layana from similar properties in Thailand.", "helpfulness": 10, "user": "HoSi", "date": "November 12, 2006", "id": 6109897}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Wow. I had missed this hotel in my initial searches and only found it because of its high rankings on trip advisor. This hotel clearly deserves those high rankings. This is an absolutely fantatstic beach resort in every respect.", "title": "Lovely lovely Layana", "helpfulness": 10, "user": "PixieQueen", "date": "November 11, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6106750, "likes": {"liked": "— Hardworking, friendly staff. Well maintained facilities", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "My wife and I stayed at the Layana for a week at the beginning of October 2006 and had a wonderful time.", "title": "A wonderful experience", "helpfulness": 5, "user": "simontarry", "date": "October 29, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6024139, "likes": {"liked": "— Spacious, clean and very big comfortable beds!", "disliked": "— N/A"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "I would just like to comment on the previous review before posting my own thoughts: There were some valid points made, notably:", "title": "Not quite acheiving it yet", "helpfulness": 20, "user": "JakeJoseph", "date": "October 19, 2006", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 5970535, "likes": {"liked": "— Serving Staff", "disliked": "— inconsistencies"}}, {"rating": 5.0, "title": "Just the best!", "text": "I cannot add much more than the others said. We stayed on 3 top hotels in the Andaman sea area now in October (Layana, The Racha, Twinpalms) but this is definitely my favourite. Staff,manager and owners are very friendly (Thank you so much!) and give the hotel the personal touch that the others lack. Ko Lanta is a quiet island off season, but I would like to add here that the hotel offers you a variety of things to do at reasonable prices like the mountainbike tour (highly recommended) and the sunset cruise, kajaking, crab fishing etc. They also have a nice choice of DVDs in the library for the evenings, after the bar closes. You won t be bored. Restaurant is excellent, service the best ever, rooms very nice and clean, design great. Never liked a hotel better.", "user": "karinli", "date": "October 12, 2006", "id": 5944756}, {"rating": 5.0, "title": "Excellent Resort", "text": "I stayed at this resort early September. I really recommend it highly. I won’t repeat all the positive things that have been written by other reviewers but will just give some of my observations that may help you decide.", "user": "mgmfog", "date": "October 3, 2006", "id": 5904388}, {"rating": 5.0, "title": "We love this place", "text": "First, Koh Lanta. This is a small unspoilt (at the moment) island. Therefore there is very little to do, especially in low season when most things close down. So if you’re looking for somewhere lively this isn’t the place for you.", "user": "3T", "date": "August 18, 2006", "id": 5624419}, {"rating": 5.0, "title": "A lovers paradise", "text": "For real quality resorts there are only two choices, here and the Pimalai. So how to choose? The layana has a contemporary boutique design and is built on one level.", "user": "Top_Princess", "date": "July 31, 2006", "id": 5531112}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Layana resort is a hotel which is very romantic. We went there for our honeymoon from 15 - 23 december. The service in this hotel is outstanding. We were staying in beachsuite number 3, the best spot. Because.... just in front of the beach and next to the swimming pool. The suite was beautiful, big, with a great bathroom with sunken bathtub and a very nice outdoor shower. The staff is very friendly and although their english isn't outstanding they always try to have a short talk with the hotelguests. The menu in the restaurant is good as well for diner and lunch, the price quality of the food is good, the wine is more expensive but that's the case in most of the better hotels. And if you want to have a cheaper night you can walk along the beach and eat there with your feet in the sand. Koh Lanta is a very relaxed island, with not so many tourists. So if you like to relax we would surely recommend it.", "title": "Perfect service, very nice!!", "helpfulness": 10, "user": "LindaSchilder", "date": "January 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6533054, "likes": {"liked": "— our beachsuite and the great service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled with family", "text": "All the other reviews cover this excellent resort very well and accurately.", "title": "superb", "helpfulness": 6, "user": "nocky_reynolds", "date": "December 18, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6457966, "likes": {"liked": "— location and Thai people", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "We took a one year old baby here and stayed in the De-Luxe Beach Suites which have their own vistas above. Given the location of these, i.e. a little set back, I would probably opt for the slightly cheaper Beachfront bungalow which is closer to the beach and has a better view.", "title": "Layana is heaven on earth", "helpfulness": 10, "user": "quinnio", "date": "December 12, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6366234, "likes": {"liked": "— everything was great", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The staff could not do enough for us and the baby. Its true to say this is a quiet resort but I guess that’s exactly what the people there wanted, us too.", "title": "Linger Longer!!! ...by Ross & Lisa (UK)", "helpfulness": 6, "user": "ynt96", "date": "November 28, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6184867, "likes": {"liked": "— Clean", "disliked": "— None"}}], "location": {"country": "Thailand", "continent": "Asia"}, "stars": 5, "variance": {"poor": 3, "average": 19, "very good": 48, "terrible": 5, "excellent": 634}, "aka": "Layana Hotel", "slim_ranking": 0.0126582278481, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "The Layana Resort & Spa is nestled on Koh Lanta Yai Island in Mu Koh Lanta National Park. The park is a marine archipelago, home to verdant tropical rainforests and undersea kingdoms of colourful coral rich in natural marine diversity. The resort enjoys a spectacular beachfront location on a 3-kilometer long white sand beach, situated about 2 hours south of Krabi International Airport. Environmentally-conscious design throughout the property results in a simple and elegant Thai atmosphere; alfresco architecture combining with contemporary design to provide an open, cool and natural feel."}