{"user_rating": 4.5, "review_count": 2832, "name": "Le Blanc Spa Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We spent 5 nights at Le Blanc just after Christmas and over New Years and had a great time. I had read all the reviews so knew the place was gonna be good. I was kinda hesitant because I felt the per night price was high (over $800 a night for a Jr Suite), but I must admit, the place was a great value. Here are my highlights: The hotels beach front is beautiful. It is quiet and well maintained. The staff in all parts of the hotel are amazingly friendly and service focused. The butlers on every floor make taking care of any detail super easy. The food is good (not amazing, but it is good). The \"all inclusive\" really is..there aren't any gimmicks..you can upgrade things like better wines, but in general the room fee covers everything. We stayed during a very busy time and there were no hiccups...they handled max capacity just fine. The rooms are clean, modern and well maintained. We used the gym daily and found it to be well equipped and maintained. We also used the Spa and it was A+. We are a gay couple and were not sure how accepted that would be, but the hotel and staff were very welcoming and we met several other gay couples who also enjoyed the hotel. Final FYI - I was not sure how tipping worked in an all inclusive place and found that tipping staff is not required, BUT, you WILL want to tip because the service is honestly worth it (we tipped in US dollars) and the staff were very grateful.", "title": "Great Getaway Spot!", "helpfulness": 1, "user": "BrianSantaBarbara_CA", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148894235}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This was our fourth Christmas (and first new year) spent at this fantastic Hotel! There are so many superlatives that describe the wonderful experience we had this year, not least including the great weather and the escape from the winter gloom in the UK!", "title": "Best in Cancun!", "helpfulness": 3, "user": "Keith C", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148877230}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "As always the staff were incredible! Friendly, caring, extremely wecoming and always there to look after your every need! Deserving of special praise was our Concierge on arrival, Victoria, who did everything she could to settle us in initially and throughout our vacation. In addition, the PR Manager Leslie Palacious was so very helpful with everything we asked of her! They all worked so hard to ensure every guest had a great time and the New Years Eve dinner was a remarkable experience and all at no additional cost! Raul, the doorman was his usual charming and friendly self and rather than feeling you were staying at a Hotel you felt that you were part of a lovely house party!", "title": "Simply The Best..........", "user": "TThompson64", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148859547}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "The food in the restaurants has got consistently better every year we go, the spa is wonderful (my wife loves it), the beach location is fab, the swimming pools in beautiful settings and the all inclusive accommodations are beautiful.", "title": "Unforgettable. You must go. Crazy good!! I think Everyone smiles 24 hours a day!", "helpfulness": 8, "user": "bgrimm17", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148857539}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "This place is really like a home from home!", "title": "FANTASTIC", "helpfulness": 6, "user": "Sherry W", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148742750}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Dates: 17-24 December 2012", "title": "Top quality. Amazing cuisine. Top service. Comfortable.", "helpfulness": 4, "user": "pelun", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149050199}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Webb: leblancsparesort.com", "title": "Fantastic Trip to Cancun Because of Le Blanc", "helpfulness": 11, "user": "kjbuffy", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148944286}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Wifi: Free of charge but VERY VERY bad. Hotel working on improvement", "title": "Top resort", "helpfulness": 4, "user": "Helio D", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148930076}, {"rating": 3.0, "stay_parameters": "Stayed January 2013", "text": "Style: Luxury modern design adults only all-inclusive hotel", "title": "Dissappointing", "helpfulness": 11, "user": "Jerms_wife", "date": "January 5, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 148905223}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Situation: Cancun hotel area on the beach.", "title": "Pampering at it's finest", "helpfulness": 2, "user": "Leehoff", "date": "January 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148895092}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "i've been to cancun 38 times and leblanc is the best hotel in my opinion. all inclusive (which i'm not typically a fan of) and adult only the place had great food, great service, superb facilities and everything is close by.", "title": "just spent 6 days at leblanc", "helpfulness": 1, "user": "ron j", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148729638}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "it is my number one hotel stop in cancun going forward.", "title": "Le Blanc", "helpfulness": 10, "user": "228Anon", "date": "January 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 148691991}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "a great hotel.", "title": "Outstanding! I have high respect for all of the staff here.", "helpfulness": 3, "user": "Springlake425", "date": "January 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 148661687}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Generally a good experence because of the excellent service, but I suppose you should expect this for the price. Did anyone else get a nasty skin rash after staying at Le Blanc in December? I am guessing it was picked up in the sauna or steam room. .", "title": "Love it, Love it..........we could stay here forever!", "user": "Joseph S", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148461805}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "One of the absolute best trips ever. Service was A+ ! I have traveled to various continents over my decades. This place exceeded my expectations in qualities of service and food. Even the lifeguard really cares for visitors and their safety plus total enjoyment. I was at first cautious of Mexico; it has less than a stellar reputation along border with America. Cancun is fine. Police presence is evident, and both years of my visits here have been great. Le Blanc is simply well run and enjoyable. The butler staff; the spa staff; the nice female barber that I employed to fix my shaggy gray hair; the restaurant staffs.....even it's resort store was way above average. If you are a whiner, stay away! These people deserve better than a spoiled and discontent guest. If you are looking for a great trip and a high quality resort, choose Le Blanc.", "title": "Wow! Great Resort", "helpfulness": 12, "user": "Scott R", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148173316}, {"rating": 5.0, "stay_parameters": "Stayed October 2005", "text": "My new husband and I picked the LaBlanc to stay at despite the fact it was brand new and we really had not information on it.", "title": "Absolutely Paradise! Sad to leave!", "helpfulness": 11, "user": "LaurenEk77", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4477077}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "Let me tell you- it was stunning! The long white fabric hanging from the ceilings made us feel like we were straight out of a travel magazine. Then we saw the pool area and our jaws DROPPED! Absolutely breathtaking. The bars are stocked with top shelf liquors (my husband was ectatic they had Crown Royal) and the food was incredibely amazing. WE thought we were truly in heavan, UNTIL.......................", "title": "Unbelievable!!", "helpfulness": 14, "user": "Mike G", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4476180}, {"rating": 5.0, "title": "Book this hotel", "text": "Hurrican Wilma hit- to make a long story short, we made it to Cabo San Lucas to Dreams, and it did not even ALMOST compare to LaBlanc.", "helpfulness": 13, "user": "A TripAdvisor user", "date": "February 21, 2006", "id": 4475834}, {"rating": 5.0, "stay_parameters": "Stayed February 2006", "text": "We were spoiled too much at the LaBlanc. At our dinner (we were only there for one night) the cooks made us a flower out of stir sticks for a wedding gift and it was amazing. Our cabin steward was always on hand and they had liquor bottles IN YOUR ROOM with POUR SPOUTS!!!! I asked him to replace the grapefruit juice with pinapple and the soda with tonic and it was done before I could finish my sentence. The snacks in the room were a lifesaver for the hurricane too!", "title": "Simply fantastic", "helpfulness": 14, "user": "islandmama24", "date": "February 21, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4475599}, {"rating": 5.0, "title": "The most beautiful hotel and best service you can imagine", "text": "The room was so clean, we had a view of the beach, and of some body of water one the other side of the hotel which gave us a beautiful sunset that night. The bathroom had a jacuzzi with a tub with a window overlooking the water. There was an open shower with two shower heads. The shampoo/soap/etc. was very upscale (can't remember the name) and they gave you a whole bottle!", "helpfulness": 16, "user": "A TripAdvisor user", "date": "February 13, 2006", "id": 4458126}, {"rating": 5.0, "title": "We felt like royalty", "text": "I have never written a review here before but I felt I had to. It makes me laugh at some of the negative reviews that some people have put on here, the type of people that feel they may gain something from writting a negative review ( a free upgrade,a free return holiday maybe?). How can anybody complain about the pool temperature being a degree or two too cold on a 28 degree sunny day! or a slight crack in a china tea pot!!!!!! this place is truly amazing!! The food, the Butlers,the cleanliness, the spa, the pool, the drinks, the colour of the ocean , all simply amazing, but one special thing that I am sure you will not find else where in the world ,is the unbelievable service. The staff simply can not do enough for you, they attend to your every need and everything is done with a smile. The Le Blanc spa hotel puts all other hotels in the U.K ( and ive been to alot of 5 star hotels)to shame in terms of the quality of service. It must be in the blood of all Mexicans to be kind, polite, generous, sincere, friendly and happy. On behalf of myself and my girlfriend thank you so much for an amazing week", "helpfulness": 8, "user": "Harry E", "date": "December 27, 2012", "id": 148147482}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "My husband and I are currently at Le Blanc and have been here almost a week.  This is our third trip to le blanc but we have been to many adult/family all inclusive reorts in Cancun and keep coming back to LB! I didn't think anything could top lasts year trip where we renewed our vows but this trip surely comes close.  It has been as close to perfection as you can get.  We splurged and got the presidential suite...one of only four on the property and it is gorgeous!  There are two balconies...one off the master and one off the main living area....both with lounge chairs, tables towels, etc. The main balcony has a beautiful jacuzzi tub. How wonderful to take a jacuzzi overlooking the ocean!", "title": "Third times a charm!", "helpfulness": 2, "user": "VivaChile", "date": "December 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148143225}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I couldn't  agree more with the last few positive posts. The service has been outstanding...they never missed a beat.  The food has been good as well as the room service.  My husband loves the international restaurant for the enchiladas, bisque soup and both our favorites...the camarones al pastor.....the shrimp entree.  Last night my husband tried the filet with baked potato and he really liked it..especially with the pepper crust. One improvement we have noticed is the desserts.  They are 100% better than last year.", "title": "Best all-inclusive resort and service!", "helpfulness": 8, "user": "Teneil K", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148092499}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "There are rumors flying around that they will no longer be heating the pools....that's not true.  Although they were off the first two days we were here they are back on and I was told they have no intention of turning them off.  Yesterday an employee from public relations was asking a few guests around the activity pool some questions about how they can improve as a resort.  I didn't have any suggestions but he said others did and he would be bringing it up to management. I thought this was a nice gesture.", "title": "Just back: Iberoster Grand (6 nights), Excellence Playa Mujeres (7 nights), Le Blanc (9 nights)...", "helpfulness": 12, "user": "LiveToTravel1313", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148046124}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We will be back.......the level of service is second to none and the employees are dedicated to making your vacation memorable.", "title": "Beatiful resort, great staff the $1500.00 credit is not completely legitimate", "helpfulness": 4, "user": "dukeaged", "date": "December 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 148043470}, {"rating": 4.0, "stay_parameters": "Stayed February 2006", "text": "My wife and I just returned from spending six nights (2/4-2/10) at Le Blanc, an adults only, all inclusive resort in Cancun. Overall our stay was fabulous and we will definitely return.", "title": "Fabulous", "helpfulness": 22, "user": "amazin1986", "date": "February 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 4454893}, {"rating": 5.0, "title": "Service with Soul !", "text": "Some of the good: (1) the service is over-the-top -- the staff will go to great lengths to make sure your stay is memorable and will always do so with a smile; (2) the rooms are fabulous, particularly the hot tub and the ridiculously comfortable bed -- make sure you ask for a room with an ocean as opposed to lagoon view; (3) it is a true all inclusive, with all food and top-shelf alcohol being included, including the food and alcohol provided in your room on a daily basis; (4) the spa is wonderful, and guests are allowed to use the steam room/sauna free of charge; and (5) the hotel is within walking distance to Cancun nightlife.", "helpfulness": 25, "user": "A TripAdvisor user", "date": "January 23, 2006", "id": 4371925}, {"rating": 5.0, "stay_parameters": "Stayed January 2006", "text": "The bad: (1) the beach was completely wiped away by Hurricane Wilma -- Cancun is working to rebuild the beach but that is still far off; (2) the pools (there are three) were all freezing; (3) two requests made to the hospitality staff were not completed; and (4) the front desk was not very helpful in coordinating our transfer to the airport.", "title": "LeBlanc is truly paradise on earth....", "helpfulness": 30, "user": "ChrisTheGreek", "date": "January 22, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4370689}], "location": {"country": "Mexico", "region": "Yucatan Peninsula"}, "stars": 4.5, "variance": {"poor": 36, "average": 93, "very good": 304, "terrible": 36, "excellent": 2363}, "aka": "Le Blanc Hotel", "slim_ranking": 0.00578034682081, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "Introducing the luxurious adults only Le Blanc Spa Resort - the transformation of all-inclusive into all-incredible. Created for the discerning traveler by one of Mexico's most celebrated designers, Le Blanc Spa Resort elevates the vacation experience with an uncompromising determination to exceed your every expectation"}