{"user_rating": 4.0, "review_count": 486, "name": "Le Chat Noir Design Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "When we arrived the reception girl was most agologetic. There had been a booking mix-up and we they had no room available for the first night out of 5 nights booked for us and another couple. They provided an alternattive hotel of the same rating in the same neighbourhood, paid for the taxis there and back the following day and also provided a room upgrade (much bigger!) and a bottle of bubbles for each couple. Bargain! Located on the Boulevard de Clichy, a block or so down from the Moulin Rouge we were easily able to walk everywhere locally and catch the nearby Metro train. The room was nice, big, modern, clean and quite sound-proof from the bar downstairs. The reception staff all-hours were great! Safe and interesting neighbourhood, great location even for families. Breakfast was simple, self=service but more than adequate. Ejoyable stay, would do so again.", "title": "Stay here if you want to stay in the thick of it at Montmartre, great fun!", "helpfulness": 2, "user": "druzzie53", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 138849358}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We arrived in the early evening after a long day of train travel from the north of Italy. We had read the reviews, sometimes noisy, questionable location etc. Not at all. We were invited to celebrate our first night in Paris (for a very modest additional fee with an upgrade to a room with splendid views of a sparkling Paris and an illuminated Eiffell Tour. A spotless room, comfortable bed and the hum of Paris far below as we opened our windows and began our Paris experience. We left the following day to transfer to our River Cruise, the hotel was only too happy to look after a bag for us until we returned two weeks later. Before our departure a splendid light breakfast with real orange juice, a free computer within the dining room for our use, a wonderful young lady who assisted us to operate the coffee machine and friendly Au revoirs as we departed.", "title": "Beyond our expectation, thank you", "helpfulness": 1, "user": "Ray S", "date": "August 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138839901}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Back two weeks later and greeted as special friends and a reminder not to forget the bag they were looking after. Not the same room or view but spotlessly clean 208, closer to the road but good air conditioning if you wanted closed windows and quiet. There are no refrigerators in the", "title": "Good but on 4th Floor noise from other rooms", "helpfulness": 2, "user": "ptarmigan11", "date": "August 19, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 5.0, "service": 5.0}, "id": 137662195}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "room, an immediate offer was made to obtain ice for us when we enquired at the main desk. Katia and Charlotte searched the internet and arranged an excellent Paris by night excursion in a wonderful red Citroen, Joanna looked after us admirably each morning when we had our breakfast. Christine who we imagined was the manager, always had time for us to chat and ask directions and everyday enquired how the day had been. We thoroughly enjoyed this very homely establishment, it does have a lift that works, showers that are great, the decor which reflects the energy of the location was fresh and uplifting, the central location invaluable. Nearby side street cafe's were excellent and the short stroll up the hill to Montmartre, a magic area. Ray and Jen.", "title": "Nice", "user": "Liza K", "date": "August 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 137469893}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We spent a week at Le Chat Noir in June 2012 and were deightfully surprised by the high standard of accommodation. The room was clean and comfortable, bed was good and the breakfast was excellent. Staff were very helpful and we went to the restaurant several times and enjoyed the food. Location is great and close to rail station and there are supermarkets and ATMs all close. Great value for money!", "title": "Lovely little hotel in Montmartre", "helpfulness": 1, "user": "Bronson137", "date": "October 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 143650104}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Stayed at Le Chat Noir to belatedly celebrate our 1st wedding anniversary in 2010... I wanted it to be as perfect as possible & they didn't let us down! After a couple of emails in my very stilted French we managed to get a room with an Eiffel tower view.. yes from Montmartre! Room was great (clean, quiet & a bit boutique), as were the breakfasts, but obviously made even better by the little balcony & view over the Paris rooftops to the tower... The location on Blvd Clichy is great if you love Montmartre & its slightly risqué feel! You're right by a Metro station for easy travel around the city. But our favourite bits are mainly round Montmartre; Sacre Coeur, Les Deux Moulins, Place de Teatre & all the little winding back streets... Lovely place to stay!", "title": "Perfect 1st Anniversary stay..", "user": "izzymac", "date": "October 8, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142284464}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "this delightful little hotel isn't just a place to sleep while you take in the delights of Paris, it has a character that adds to the experience. it is so individual, a one off with everything you would expect from a modern hotel. it is spotlessly clean,comfortable, warm and cosy. being so small the staff have the time to look after you and answer any questions to help you enjoy both the hotel and Paris. we were a little worried about the location but the area turned out to be what the the guide books call full of character, very busy at night with lots of tourists and we felt quite safe walking around there, handy for all the shops and restaurants of montmartre and not too far from the centre of Paris we think this is a great little find.like most Paris hotels the rooms are not big but very well furnished with lots of electrical sockets and despite being on a busy road the room was very quiet . we found the breakfasts excellent - see if the hotel will do you a deal on the price if you stop for a few nights", "title": "what a lovely little hotel", "helpfulness": 4, "user": "peter j", "date": "September 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141435915}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "My wife and I stayed at Le Chat Noir Hotel for 10 days as part of our honeymoon in Paris.", "title": "An excellent stay in Montmartre", "helpfulness": 2, "user": "Kyle R", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 141236684}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Overall, we were quite happy with our stay and would gladly come back.", "title": "Unique experience", "helpfulness": 1, "user": "Anthia K", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 141198379}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "After honeymooning in Paris in 2010 and stumbling upon the deliciousness of the Chat Bistro, we made it our mission to come back and stay at this boutique hotel in Montmartre as we absolutely adored this arrondissement. Thanks to tripadvisor I knew to book room 704 (the room with the balcony and the view of the Eiffel Tower!) and for the price of 20E extra a night. That deal couldn't be beat.", "title": "Le Chat! My favorite!", "helpfulness": 2, "user": "citygirl716", "date": "November 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 145327467}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "We arrived at the hotel after a long flight from Boston and when we arrived at 8:00am they said the room wasn't ready. No worries, we got there early. We walked around Montmartre for hours and by the time 1:00pm rolled around we were absolutely exhausted. Though the front desk woman didn't wasn't overly thrilled to let us to our room, she did. We then took a power nap on one of the most comfortable beds I've ever slept on.", "title": "Cosy, clean and comforatable", "user": "andi4ka", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144631127}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "How did our seven days go? I'll break it down.", "title": "Just perfect!", "user": "Janagdl", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 144602271}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The good: Location, Beds, Decor, Room 704, Staff, and our beautiful balcony view", "title": "Comfortable hotel in Montmartre", "helpfulness": 1, "user": "RPM100", "date": "October 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144151001}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "The bad: Housecleaning service never refilled anything, the shower was a bit too weird, and the breakfast wasn't worth the price.", "title": "Perfect Parisian Stay!", "user": "inafixfox", "date": "October 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143680746}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Myself and a friend stayed at Le Chat Noir 10/09 for 3 nights.", "title": "Great hotel and brilliant location", "helpfulness": 1, "user": "Harriet B", "date": "September 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 141163945}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "The hotels rooms and reception were spotless and the decor is modern and sleek, rooms were a big enough size as we only slept there so didn't need any bigger! We were on the sixth floor and had no problem with noise.", "title": "Good hotel and location", "helpfulness": 1, "user": "Gill S", "date": "September 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 140874758}, {"rating": 3.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We did not eat breakfast in the hotel but did use the bar located outside the hotel which served delicious cocktails :)", "title": "Great hotel - as long as you don't wish to sleep.", "helpfulness": 2, "user": "jams50", "date": "September 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 3.0}, "id": 140695298}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The hotel is on the main \"sex shop/show street\" but as two mid twenty year old females we were not approached and any point and felt safe at all times.", "title": "Great Hotel for couples", "helpfulness": 1, "user": "Deecydon123", "date": "September 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 140594783}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "Place du Tetre is around a 10 minute walk up the hill and has many lovely restaurants out on the square. We loved the location for this, also so close to Moulin Rouge and Amerlies \"Cafe des deux moulins\".", "title": "Another enjoyable stay", "helpfulness": 1, "user": "gypsygallisa", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140430627}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 4, "variance": {"poor": 11, "average": 74, "very good": 233, "terrible": 16, "excellent": 152}, "aka": "Relais De Hotel Paris", "slim_ranking": 0.214166201896, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Set in Montmartre area, two steps away from the Place du Tertre, the Lepic Street and its renowned café des Deux Moulins in which « Amélie Poulain » was filmed, the hotel Le Chat Noir is a poem in itself. Typically Parisian and yet at the same time imaginative, original and modern.A designed and uncluttered décor, a contemporary and refined atmosphere can be found at the reception, in the breakfast room and on every floor…"}