{"user_rating": 5.0, "review_count": 226, "name": "Le Dortoir", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Probably in the world’s top 10 best B&B list. The fact that there is no lift adds to the charm and the uniqueness of le dortoir. This is what make vacation memorable. Don’t hesitate, change your mindset and put some spice in your life. We are a family of 4 and enjoyed two suites in june. The suites are modern and very clean. The breakfast are varied (cold) and served every morning at Le dortoir is situated in the right spot, walking distance from promenade des anglais and the old town.", "title": "World class", "user": "petercanada", "date": "July 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135239022}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We had three days here at the end of a 7 week holiday. It was a great choice. It is about a 20 minute easy walk from the railway station. And the day we left we took a taxi to the airport from the taxi stand a three minute walk from the apartment. Cost 30 euros.", "title": "Excellent value", "helpfulness": 2, "user": "Akurafarm", "date": "July 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134322749}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The location of the apartment is great and the code for access worked perfectly (it was great not having to worry about a key every time we went out, more places should work with this easy to use system). The apartment was very comfortable, quiet, great bathroom and a very comfortable bed. Also the nice touch of a Nespresso coffee machine in the room.", "title": "A Week To Remember", "helpfulness": 3, "user": "VanDwaas", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132657608}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We never saw the owner, but he responded very quickly to a couple of queries we had by email. The wifi in the room was excellent. The owners mother prepares breakfast every morning and is charming. I still find it hard to believe she has an adult son. Altogether a very enjoyable experience. Just one word of advise, it is popular and you need to book early.", "title": "Excellent location, trendy suite", "helpfulness": 2, "user": "NikhilSama", "date": "June 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131390784}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed in the Longani Suite for 7 nights last month and had a wonderful time. You could not ask for a better location in the centre of Nice with everything being practically on your doorstep. We were given an access code for the front door before our arrival in Nice which worked first time without any problems.", "title": "Exceeded our expectations in every way", "user": "ADayNotWasted", "date": "June 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131224729}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Le Dortoir - smart,clean,and quiet accomodation in a terrific location in central Nice - in an exclusive pedestrian only street. We stayed in the Kalia Suite - this is the smallest of the 3 suites at Le Dortoir but we found it more than adequate for our 4 night stay. Loved the bathroom and the luxurious bath complete with complimentary bubble bath.The breakfast pastries delivered fresh each morning were delicious.There was a Nepresso machine in our suite for those who enjoy coffee but we craved a hot cup of tea - an inclusion of an electric jug would be ideal! There are 96 steps to the Le Dortoir apartments and no lift - a good test to ones fitness!!", "title": "Location is hard to beat!", "user": "meadowsong", "date": "August 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "location": 5.0, "service": 5.0}, "id": 137135049}, {"rating": 5.0, "stay_parameters": "Stayed August 2012", "text": "Le Dortoir is an excellent place to stay in Nice. There are lots of great comments and I will not write something different yet still the place deserves all the great comments.", "title": "Excellent place to stay in Nice.", "helpfulness": 1, "user": "Gezelek", "date": "August 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 136813918}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We have booked this B&B very early to find a room in high season for 6 days. There are only 3 rooms and we stayed in the Kalia Suite. The room decorated beautifully. The pin for the doors worked without a problem and since you are not carrying a key it is very convenient. They do not offer any room service yet the room is cleaned and towels are changed every day.", "title": "Modern, comfortable and excellently located.", "helpfulness": 2, "user": "Pam70", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136016653}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "The location of the Le Dortoir is hard to", "title": "Clean and Modern", "helpfulness": 1, "user": "MarcA0214", "date": "July 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 135561912}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "beat. It is close to everywhere, and middle of everything.", "title": "Relaxing time on the French Riviera", "helpfulness": 1, "user": "cantwait4mynxttrip", "date": "July 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 135472039}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I stayed at Le Dortoir for three nights last November and definitely thought it had the \"Wow\" factor !! We were in the Kalia Suite for two nights and then were lucky enough to be upgraded to the Longani suite for the last night. All the suites are so luxurious and beautifully appointed, definitely worth the money !!! Jean was an absolute pleasure to deal with, nothing was ever a problem, and the breakfasts were yummy, totally adequate for when you are travelling.Le Dortoir is in such a fantastic location, so close to the shops, bars, restaurants etc and a short walk to the waterfront.", "title": "Fantastic !!!", "helpfulness": 3, "user": "Sally C", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129477106}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We thoroughly enjoyed our stay at Le Dortoir and would definitely stay there again, it was one of the highlights of our trip.", "title": "Best in Nice", "user": "sf88fs", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129244676}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Le Dortoir is more like a high-end boutique hotel without the hassles of checking in and out. You arrive with a code that opens all the doors. No one to greet you except the luxuriously appointed room that is spacious and highly functional. You will find an espresso machine with a supply of nespresso capsules for your enjoyment plus a mini-frig to stock with your own beverages and eats. The bathroom has his and her sinks, and a tub in addition to a shower. And ours was the smallest of the three rooms. In the morning, a lady gets the breakfast ready in the hallway. It is practically free room-service as you just open the door and bring what you need into your room. She helped check us out at the end of our two night stay and I suspect she doubles as a cleaning lady as well. All in all a wonderful experience in the best possible location in Nice. The only thing is that if you have a car like we did, you will need to find a place to park it. We parked it in the nearby Holiday Inn garage but it wasn't cheap.", "title": "Your own swanky Riviera apartment", "helpfulness": 5, "user": "ArtistJames", "date": "April 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127305789}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Want to pretend you own your own chic apartment in the heart of a beautiful French Riviera city? Want to pay a reasonable price? Don’t mind climbing a few stairs? Don’t need somebody on-site to hold your hand? Then Le Dortoir is for you.", "title": "Excellent location and beautiful room", "helpfulness": 1, "user": "stiffydagold", "date": "March 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 126275408}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "COMMUNICATION--Le Dortoir is unusual in that owner Jean isn’t on-site. He did stop by one morning, but we were on a day-trip to Monaco. Hence, we never laid eyes on the man. Did that matter? Nope, mostly because he’s so prompt about responding to inquiries and e-mails. You’ll discover his efficiency even in your initial communication with him; I found this reassuring.", "title": "No 1 for a reason!", "helpfulness": 4, "user": "Stanley111", "date": "March 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126142839}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Le Dortoir was an outstanding place to stay. We hadn't stayed on the Côte d'Azur before and this was an excellent introduction. The location is perfect for a tourist - access to all areas of Nice is very easy. It is a short walk into town and to the Promenade des Anglais. The excellent museums, including the Matisse and Chagall were also very easy to access. We stayed in the Suite Massai and it was very spacious and comfortable. It was tastefully decorated, very clean and provided all of the amenities you could reasonably expect. The bed was very comfortable and the free-standing bath was wonderful. Nathalie who was there to assist was very helpful, charming and engaging. In all respects, this was a lovely place to stay.", "title": "Ideal suite in Nice", "helpfulness": 2, "user": "shokmac", "date": "March 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125787658}, {"rating": 4.0, "title": "Very comfy", "text": "A very comfortable place - clean, quiet, centrally located, high standard.", "helpfulness": 2, "user": "vix2801", "date": "January 17, 2012", "id": 123224165}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Two negatives:", "title": "Fantastic suite very close to the sea", "helpfulness": 1, "user": "annainparis", "date": "January 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122766385}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "One, there were only sweet pastries for breakfast - no cheese, nor ham. Might be good to diversify.", "title": "It's number 1 for a reason!", "helpfulness": 3, "user": "czech99", "date": "January 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122694410}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Second, the wireless password was not mentioned anywhere and the owner was travelling so not reachable on the phone number provided. Not that the wireless was essential, it did make us think what would happen in case of an emergency.", "title": "Magnifique!", "helpfulness": 2, "user": "monix6", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122004759}], "location": {"country": "France", "region": "Provence", "continent": "Europe"}, "variance": {"poor": 0, "average": 2, "very good": 19, "terrible": 1, "excellent": 204}, "aka": "Le Dortoir Hotel Nice", "slim_ranking": 0.0434782608696, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Dominating the elegant Paradis Street, in the full center of a pedestrian town, in the famous \"Carre d'Or\", \"Le Dortoir\" is ideally located for your stay in Nice. The shops of luxury are at the foot of the building, the beaches and place Massena are within 100m, the Casino Ruhl, many restaurants, the museums, the famous \"Promenade des Anglais\" and many other activities are nearby. Designs, authentic, practical and discrete, the 3 suites that we propose to you will offer you a geographical location, a panorama and an exceptional comfort."}