{"user_rating": 4.5, "review_count": 338, "name": "Le Fleuray", "reviews": [{"rating": 4.0, "title": "as nice as expected", "text": "We enjoyed our stay in France and visiting the castles and vineyards , the weather was extremly cold and we tried to see too much of the country", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 12, 2005", "id": 3268232}, {"rating": 5.0, "title": "A memorable stop", "text": "We should have stayed longer in the Loire valley and Paris . We really enjoyed the Le Fleuray a tasteful small Hotel where they make you feel very much at home and good value for money , peaceful and great food . It's a little drive from some of the sights that we wanted to see but then again who wants to stay next to a busy road or in the center of town ! We will definately revisit ...", "user": "A TripAdvisor user", "date": "March 11, 2005", "id": 3266180}, {"rating": 5.0, "title": "A Perfect Stay, A Little Out of the Way", "text": "During our recent visit to France we used TripAdvisor to select our hotels, all were enjoyable. Special mention for Le Fleuray in the Loire Valley, from a very warm welcome, to clean and comfortable bedrooms, good food through to the peaceful surroundings and handy location for seeing the sites this was a memorable stop which we may never have found without TripAdvisor.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "March 5, 2005", "id": 3253754}, {"rating": 2.0, "title": "Not impressed.", "text": "My boyfriend and I travelled through Spain, France, and England during the summer of 2004. We found Le Fleuray on the internet and were so excited to find a place where English was spoken (we don't speak French). We stayed at Le Fleuray for two nights and it was truly a bright spot on our journey. The food and service were wonderful. The only downside to our stay was the distance from the hotel to the town of Amboise (a point not adequately described on the hotel web site). We had not rented a car, and our cab ride to the hotel, was about $50. So rent a car and have a wonderful stay at Le Fleuray!", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 1, 2005", "id": 3238742}, {"rating": 5.0, "title": "A lovely country place", "text": "I was surprised that this hotel did not nearly meet my expectations, considering the rave reviews it receives on this forum. Perhaps it receives such great reviews because the owner asks you to please post good reviews, as he asked us.", "user": "A TripAdvisor user", "date": "February 4, 2005", "id": 3161382}, {"rating": 5.0, "title": "A well run country surprise", "text": "Stayed at Le Fleuray for four nights during our tour of the Loire valley. A warm, inviting place in the country. The reviews are right on the money--this is a charming, very clean, well run hotel. The location is a bit tricky to find initially--but the instructions help. Try to arrive before dark the first night. Enjoyed our stay tremendously and will stay there again on our next trip. The breakfasts in the dining room are lovely--complete with coffee served in french presses. The whole family is very involved in the inn and have a lot of experience from other hotels. We especially enjoyed drinking wine in the evenings in the living room with Jordan. Good conversation, some local wine--a perfect way to end our days touring the valley. Highly recommend this lovely inn!", "helpfulness": 1, "user": "zoey1214", "date": "November 9, 2004", "id": 2813992}, {"rating": 5.0, "stay_parameters": "Stayed October 2004", "text": "My wife and I, along with another couple, stayed here in October, 2004. We were driving through the Loire Valley and stayed here one night and then spent one night at the Domaine de Hauts de Loire. We loved both places.", "title": "Picture Perfect", "user": "NewDadCT", "date": "October 19, 2004", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 2758915}, {"rating": 5.0, "title": "... a flower in the gardens of French Kings and Queens!", "text": "Le Fleuray was extraordinarily cozy and the Newingtons provide a warm atmosphere. Mr. Newington clearly enjoys travelling and gave us some friendly and welcomed advice. Young Jordan Newington provided the \"cute\" factor according to my wife and her close friend.", "user": "A TripAdvisor user", "date": "October 18, 2004", "id": 2754961}, {"rating": 5.0, "stay_parameters": "Stayed August 2004", "text": "What actually blew us away was the food. This was easily one of the best meals we had in France (Domaine de Hauts provided a better meal but at three times the cost!). My friend had a very tender chicken that melted in your mouth. I got the prawns with Indian spices and warm butter. It was one of the best seafood dishes I've ever had. Since we were with close friends, we had the added the benefit of sampling everyone's food. Excellent all the way around (except for my wife's lamb which was overdone). Desserts were also amazing.", "title": "A fantastic, relaxing place for our whole family!", "helpfulness": 1, "user": "oyyveyy", "date": "September 11, 2004", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 2523217}, {"rating": 5.0, "title": "Le Fleuray is Awesome!", "text": "Overall, I would highly recommend Le Fleuray and wish we had the chance to stay longer. It lives up to its reputation in terms of coziness and service but the unexpected meal is the show-stopper.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 6, 2004", "id": 2515912}, {"rating": 5.0, "title": "Warm, stunning and comfortable", "text": "We spent Christmas 2004 at le Fleuray Hotel with our daughter's in-laws on their recommendation as they had stayed there during the summer. So we motored up from Nice and they from Hamble, in England. It was the perfect place to spend Christmas and visit the Chateaux of the Loire Valley including a spot of wine tasting! Like a large private house, it was beautifully warm and cosy even though the weather was crisp as it should be at Christmas. The bedrooms were tastefully decorated with every comfort and convenience so we slept very well as one would expect in the middle of the country but within a few kilometers of the A.10 autoroute. However, the restaurant surpassed itself in its array of stunning menus and local wines - what more could you want at Christmas ? Other guests were passing through as the Newington family had not advertised that they were open specially for Christmas and each one said how much they envied our week's stay .....Perhaps then \"the icing on the cake\" or \"les cerises\" sur le gateau\" was the helpfulness and the warmth of the Newington family themselves - nothing was too much trouble - fantastic. We wish they would open a chain all over France!", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 14, 2005", "id": 3006859}, {"rating": 5.0, "title": "Ideal country hotel", "text": "We have now stayed twice at Le Fleuray Hotel near Amboise and the Loire, once in June and again recently over Christmas. It is a lovely small family hotel, the owners being incredibly supportive and friendly, English/ French going French/English. The food is superb and the prices very reasonable. There is a fine swimming pool for the summer. The hotel is set in its own grounds in a wonderful rural location. It would be impossible to find except that the owners have signs up on all the key roads to make sure you don't get lost.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "December 28, 2004", "id": 2954119}, {"rating": 5.0, "title": "Beautiful with warm hospitality", "text": "Nothing is too much trouble for the staff and if you are looking for a quiet hotel, near the world famous Chateaux and the spacious French countryside it is impossible to imagine anything better. We lost count of the number of local wine producers, and the wine tastings we had in the caves, and on our second visit we made sure there was plenty of room for all the wine we bought.", "helpfulness": 1, "user": "amyag", "date": "December 4, 2004", "id": 2863045}, {"rating": 5.0, "title": "Le Fleuray, a quaint respite in the countryside", "text": "My family had the pleasure to stay at La Fleuray Hotel in Amboise late October, 2004. The generous hospitality of this family run hotel is unmatched. They went out of their way to see that we were comfortable, well-fed, and content. My children enjoyed watching the near-by cows, and picking apples on the grounds. Nightime was so quiet, and the mattresses were so wonderful that I have since inquired what type they were so I can get some for my home. I look forward to traveling back to France and staying with them again.", "helpfulness": 2, "user": "samsen", "date": "December 2, 2004", "id": 2859556}, {"rating": 5.0, "title": "Le Fleuray -- A wonderful hotel and restaurant in the Loire Valley", "text": "We had the pleasure of staying at Le Fleuray over the Thanksgiving week. The location was just right to access all of the chateaux in the valley and the restaurant at the hotel was a 5 star style of cuisine unriveled by some of the finer hotels in Paris! Our only concern was the noise level at times in the evening. We could hear everything, including our neighbor in the next room snoring. We probably would have done better in a different room in the hotel but understand some of the offset rooms are reserved for larger parties with additional guests. This is not a problem for future stays as I understand that there will be some changes to allow for more rooms and making the hotel a bit larger. The service was gracious and made you feel like you were the most important guest.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "November 29, 2004", "id": 2852871}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "My husband and I stayed at Le Fleuray for four nights and both agreed that it is one of our all-time favorite spots. We have traveled to Europe often during the past 12 years, most often to Italy and France, and have never found the equal to Le Fleuray. The rooms, while not large, are charming, well-maintained and well-equipped. The hotel itself is handsome and spruce. The proprietors, the Newingtons, are unfailingly warm, friendly and extremely helpful. The cuisine is consistently top-notch, with ingredients of the highest quality--we chose the half board, so had ample opportunity to sample the fare. Fellow guests were pleasantly friendly (the hotel was full when we stayed). Excellent directional signs seem to be at all relevant intersections in the surrounding countryside, so it was easy to find after renting our car at the Tours train station, and the location was perfect for the chateaux and other sights that we had chosen to visit. I had felt after reading all the Trip Advisor comments that it was probably too good to be true, but it was not! This property offers the highest qualitly experience at an EXTREMELY reasonable price. I would also point out that we were not asked to write this review!", "title": "The Perfect Spot", "helpfulness": 3, "user": "Victorovna", "date": "May 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 3489152}, {"rating": 2.0, "stay_parameters": "Stayed March 2005", "text": "I booked this hotel given all the wonderful reviews I had seen posted here and unfortunately wasn't impressed. (Maybe they have so many good reviews because they repeatedly asked others as well as us to give them a good review?) It is a nice looking hotel from the outside, but is overpriced given its out of the way location and less-than-average restaurant. The decor inside is average at best (material hanging from curtain rods to make a 'canopy'?) and feels like they tried to cut corners especially considering the lumpy, sagging twin mattresses pushed together to make a double bed. Service leaves something to be desired as well. Every time we needed something we had to ring a bell and wait... and wait... and wait for someone to show up; even in the middle of the day. The food at the overpriced restaurant was even more disappointing as we felt we were being milked of every possible cent when they insisted we take half-board (breakfast and dinner). We asked for an a la carte menu for our two small children who couldn't possibly eat the entire 15.50 EUR children's menu. Not surprisingly, it was more expensive to get 2 items off the a la carte menu than the entire meal. Such a waste and limited options for children in the stuffy (hot), overly formal-feeling restaurant. The cold (though supposedly 'heated') pool was overrun with teenage friends of the owners' children throwing tennis balls at each other. This made it a little imposing for small kids to feel comfortable using it. Overall we would not stay here again but would choose something more central to the sights.", "title": "I expected to love it but.....", "helpfulness": 13, "user": "TravelingWithKids100", "date": "May 4, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 2.0}, "id": 3437343}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "Excellent for the price.", "title": "Ideal country hotel for families", "helpfulness": 3, "user": "Londontraveller15", "date": "May 1, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "service": 5.0}, "id": 3429822}, {"rating": 5.0, "stay_parameters": "Stayed April 2005", "text": "If you are travelling with children this is the ideal place to stay in the Loire valley. Book a room with a terrace in the converted barn then you will have your own outside space looking onto the pool (which is in enclosed) so small ones can roam and eat outside.", "title": "Outstanding", "user": "JBT", "date": "April 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3423407}, {"rating": 5.0, "title": "Perfect Hotel, perfect hosts", "text": "This comfortable small hotel is in a perfect setting surrounded by countryside and not too far from all the main attractions - although we did find ourselves travelling to the the otherside of Tours (awful road system) to see most things.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 13, 2005", "id": 3270514}], "location": {"country": "France", "region": "Centre", "continent": "Europe"}, "stars": 3, "variance": {"poor": 15, "average": 30, "very good": 90, "terrible": 1, "excellent": 202}, "aka": "Logis Le Fleuray Hotel Cangey", "slim_ranking": 1.0, "description": "Welcome to a lovingly restored country house hotel originally built in the 1800's, situated close to the river Loire, the finest castles, historic towns such as Amboise, Blois, Tours, famous vineyards, and a wealth of cultural, leisure and sporting attractions. Every charming bedroom is named after a flower, with views over large gardens and peaceful countryside. All have private bathrooms, queen size or twin beds, flat screen televisions, many have terraces. Large rooms and connecting suites are ideal for families."}