{"user_rating": 4.5, "review_count": 74, "name": "Le Lys d'Or Chambres d'hotes", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "My daughter and I stayed here for 1 week. The hostess was charming, genuinely interested in us and very helpful. she also allowed us to use the fridge in the breakfast room to store a few things. Great location; close to metro and easy to walk to Grand Place (20 minutes). Minor downsides for long stays are that one has to ask for new towels and sheets after several days and breakfast, while nutritous, is largely the same each day.", "title": "Great location, charming hostess, comfortable room", "helpfulness": 1, "user": "lebljc", "date": "June 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 131359459}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Staying at this B&B is close to having your own appartment in Brussels, only a stone throw away from the city center! We stayed in \"room 3\" and had a whole floor to ourselves (living room, bedroom, large bathroom, everything neat and clean). The bed was comfortable. Continental breakfast with everything you could ask for. On-street parking and parking lot in front of the B&B, metro station a short walk away. The city center is a 15 minute walk away. The owner was welcoming and helpful and always ready to give tips. We would definitely come back and recommand Le Lys d'Or.", "title": "A great place to stay", "helpfulness": 1, "user": "trettionio", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 130753056}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "This BnB was a great value for the price. We were two couples staying in the top floor which is an apartment style. Two floors, two large bedrooms with two full bathrooms, a kitchen and living area. Recently renovated as of three months, contemporary style decor. Very clean and spacious for an European apartment. Dounia, the owner, is very sweet, helpful, and responsible. The location is about 15-20 min walk to the Grande place. There is a metro right outside the building. We would definitely stay here again.", "title": "Wonderful value for the price!", "helpfulness": 1, "user": "Briannie1121", "date": "May 26, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 130615221}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Very nice b&b with very helpful hosts. We stayed in chamber 1 which was huge and clean. Nice bed and plenty of space in the room to keep your stuff. Bathroom was big and spotless as well.", "title": "Excellent choice", "helpfulness": 3, "user": "RINGA80", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128996089}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Dounia was very helpful while suggesting the places to eat or things to see or while calling taxi (the ENTIRE public transport was on strike!! so this helped a lot).", "title": "Nice place", "helpfulness": 2, "user": "KatieandDutzik", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128657622}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Absolutely lovely B&B, with incredibly spacious rooms and comfortable and clean interiors. It was very quiet - I think the windows block out most of the noise from the street. The B&B is located very close to the metro, although it wouldn't take long to walk into the centre of Brussels. The breakfast was more than sufficient - fresh bread, croissants and boiled eggs made to order. Overall, a delightful stay.", "title": "Fabulous room in a lovely B&B", "user": "j_a_hopewell12", "date": "September 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141238593}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with friends", "text": "The room we stayed in is on the top floor of the building. The interior was in a mint condition, very clean and nice. The place is really quiet. I even wonder if we didnt make too much noise ourselves. We had two beds and one sofa, which was over our expectations. Washing mashine and dishwasher was also awailable. Clean towels, cups, shower and TV also available, not to mention free Wi-Fi. The beds were in two seperate bedrooms. Each bedroom has a seperate bathroom. Hair dryer is available in the bathroom.", "title": "Strongly recommended", "helpfulness": 1, "user": "Mikalauskas", "date": "August 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 137237055}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The host was very helpful and kind. You can find the host at the hotel most of the time, which is very convenient. If the host is not there, you can call him/her by simply pressing a button on the first floor near a speaker on the wall. It connects directly to him/her cellphone and it is for free. Really nice and convenient. The host gave us few advices about places to visit at the evening and so, we used them and were satisfied. The breakfast was fine for the price. You get to eat sweet stuff, but you can also ask for an egg.", "title": "Perfect place to visit Brussels", "helpfulness": 1, "user": "PanettaFamily", "date": "August 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136368245}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "The one drawback to mention is the steep, narrow stair to the rooms. As we lived in the top floor, this was a inconvenient. However, the view of the room we got to see when we made it to the top was really nice, and the effort to climb the stairs paid off.", "title": "Loved this place!", "helpfulness": 1, "user": "TheOtherHunny", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 134670950}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "We stayed for 3 nights and it was a pity to leave. I am fully satisfied with the B&B and would recommend to anyone who plans to visit Brussels.", "title": "Beautiful Rooms", "helpfulness": 1, "user": "Kriffin", "date": "July 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 134351973}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "What a great time my husband and I had. It was so quick to get to from the train station via metro. The stop was 500 feet from the door. I was so surprised at how large our room was. The breakfast was great. Very filling. The neighborhood felt very safe. We will stay here again.", "title": "Perfect location", "user": "Swimmy128", "date": "March 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 154563151}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "I don't normally write reviews but Le Lys d'Or really impressed me. The room was huge with plenty of space to relax. It was just a 10-15 minute walk to get to the centre of Brussels. We had a heap of questions about what to do and where to go in Brussels and Dounia was extremely helpful. I would defiantly stay again. Book early as it does not have many rooms.", "title": "Just Perfect", "user": "ChrisElkins", "date": "March 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 153743332}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "We (family of four) spend one night at Le Lys dÓr in January. Everything was perfect. Easy to park the car (undercover car parking just 30 m away), subway is 50 m away.", "title": "Great Place", "user": "AUSBRA", "date": "March 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153567078}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "The room was impecable clean, and very spacious, in fact it was huge. The breakfast was delicious.", "title": "Wow!", "user": "javila942", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152983299}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The only problem was that we spent only one nigh as it was a stopover travelling from France to The Netherlands. Next time we will definitely stay longer at Le Lys dÓr.", "title": "Wonderful stay!!", "user": "Matteo N", "date": "February 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 151538786}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I was traveling alone so I wanted to stay at a place which was safe and within walking distance from main metro lines. Le Lys d'Or proved to be an excellent choice as it not only met but exceeded my expectations. The hotel is just 5 min from Munthof/Hotel des Monnaies metro station with easy access to the city centre.", "title": "Great location, great room, great customer service", "user": "AK1121", "date": "January 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 148958742}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "As for the accommodation - although I booked a double bed room, I was upgraded to a beautifully furnished two-story loft which can accommodate up to 6 people. Needless to say I did not complain! I particularly liked having a breakfast in a cosy room where guests are seated around a single big table. Breakfast was fine, particularly the warm croissants.", "title": "Wonderful stay at Le Lys d'Or", "user": "w f", "date": "November 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145716756}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "But most of all I liked the owner, Dounia, for her friendly and welcoming disposition and readiness to help with guidance and advice.", "title": "Excellent room and location", "user": "michbecky", "date": "November 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145022347}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Location is great, and our stay was really comfortable. My and my siter stayed at to top floor appartment which consists of two bedrooms, both en-suite, a living room and a fully equiped kitchen. The hostess -and hubby- are really nice and welcoming. It's just a few steps from the Munthof metro st.; a short walk away from the Justice Palace, the rest of the city centre, the Parliament, restaurants and in a very safe neighbourhood.", "title": "WONDERFUL STAY IN THE CENTRE OF BRUSSELS", "user": "SimoHPS", "date": "November 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144923875}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "I'd definitely recommend this Guesthouse to anyone who is planning to visit Brussels.", "title": "Great rooms in an excellent location.", "user": "JoGoldstein", "date": "October 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142448999}], "location": {"country": "Belgium", "continent": "Europe", "city": "Saint-Gilles"}, "variance": {"poor": 1, "average": 1, "very good": 17, "terrible": 0, "excellent": 55}, "aka": "Le Lys D'Or Chambres D'hotes Brussels, Belgium", "slim_ranking": 0.0909090909091, "description": "The Guest house “Le Lys d’Or” contains all the ingredients for a great stay at the center of Brussels, for both professional and touristic stay. Indeed, the three completely renovated new rooms which are available are characterized by their originality and comfort. Each room has its own decoration, and will immerse you in a unique and special atmosphere. We have three rooms, and each one has a private bathroom, TV and free internet connection."}