{"user_rating": 3.5, "review_count": 1248, "name": "Le Meridien Piccadilly", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "We recently spent 5 nights at the Meridien in Piccadilly and overall would say that our stay was enjoyable. We used Starwood points for a junior suite and paid extra for use of the club lounge. On the positive side, we found all the staff we dealt with were professional and helpful, the lounge staff were particularly a pleasure to deal with. The Club Lounge had an excellent array of beverages and food available throughout the day in additional to the Happy Hour in the evening. As the location is so central it was a perfect place for a quick pick-me-up in between shopping expeditions or sightseeing. The pool was large and deep enough to swim in as well as being mostly empty. I didn't use the exercise room but it also looked well-equipped and the staff in the pool/gym area again were also very nice to deal with. Our suite was equipped with tea and coffee making equipment which was most appreciated and, even better, had some shortbread snacks which were restocked daily. On the down-side the first impression of our room was of a very tired looking couch and chair which looked like they should have been replaced years ago. It's too bad because they gave the suite a very drab appearance and yet the bedroom was quite well-appointed and bed very comfortable. The bathroom was another negative. I'm guessing we were in an unrenovated room because the plumbing was definitely from another era. The shower was really touchy on temperature and went from scalding hot to very cold and unfortunately because it was situated in a very high tub not easy to escape from when the temperature went renegade. The toilet sometimes flushed and occasionally didn't which made life very exciting and the heated towel rack never did heat up despite the little tag that warned about its heat. I think I would still return to this hotel though, I would just make sure to request a renovated room. Just one more thing, I know this is a matter of taste, but I found the 24 hour soundscape in the elevator very annoying and discordant.", "title": "mostly positive", "user": "rdabca", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 109869046}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Location location location!... Situated at the centre of London, next to the Piccadilly station, the hotel has a very efficient staff. They try to make you feel at home and comfortable. We had a smooth check in and a warm welcome by European standards. The rooms are wonderful though they did not have any view. Recommended.", "title": "Very nice!", "user": "rahhul", "date": "May 25, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 109750530}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "As part of a weekend trip we stayed atthis hotel. An early check in was no problem, and we were profesional welcomed and checked in. We were told that we got an room upgrate which surprised us because we weren´t memebers of the loyalti programm.", "title": "Great bed, lousy room, over all good", "user": "ThomasEul", "date": "May 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 109611224}, {"rating": 2.0, "title": "Inferior spa for a 5* hotel", "text": "The room turned out to be on the second floor with a window to the Restaurant. It seemed that the window was not really surposed to be there, because i was behind a wall, anyhow the last 40 cm on the top where open so that a little bit day light had the chance to lighten up the otherwise dark room. I´ve never stayed in a room like that before, and surely not in this price range. Two steps up above room levl was the The Barthroom,which was quiet old but otherwise was everthing in place where it should be. I did not care much about a \"walk in wardrobe, but other surely do.", "helpfulness": 1, "user": "SMJLondon", "date": "May 16, 2011", "id": 108543585}, {"rating": 5.0, "title": "Perfection", "text": "With every step th ancient floorboards gave a noise, so that you couldn´t sneak to the barthroom, or the minibar.", "helpfulness": 1, "user": "MrsBofBournemouth", "date": "May 16, 2011", "id": 108475107}, {"rating": 5.0, "title": "Great stay", "text": "We booked our room through American Express and stayed 7th & 8th April After reading some recent reviews I felt very dubious about the hotel, but we were highly pleased. The check-in staff were delightful and we were allocated a lovely refurbished room on a high floor at the front of the hotel. No complaints whatsoever. All staff that we dealt with were charming and helpful, the bar on Friday night was quite buzzy and fun. We look forward to staying there again. And the the location is terrific.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "April 15, 2005", "id": 3365918}, {"rating": 4.0, "title": "Lovely location", "text": "We booked a room at the Meridien through Expedia, and got an extremely reasonable rate. When we arrived we were upgraded to a very large suite with two baths in the older part of the hotel (which I find personally more attractive because I like the old-fashioned British style). I think it helped that we spoke French, and the Bell was very nice also in helping us secure this wonderful room (he called the front desk after we found our first room to be very small). Even trying just a few words in French would be a plus when you arrive, I believe.", "helpfulness": 2, "user": "windinthewillows", "date": "April 8, 2005", "id": 3344150}, {"rating": 2.0, "stay_parameters": "Stayed October 2004", "text": "The location is perfect. We generally prefer smaller, intimate hotels, but everyone was extremely professional. The breakfast was nice, the bar a little depressing. Overall a very positive experience.", "title": "Think '3-star' and you'll be happy", "helpfulness": 4, "user": "uscgrad", "date": "March 13, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 1.0, "service": 2.0}, "id": 3270180}, {"rating": 4.0, "title": "Great Location", "text": "FOR A 5-STAR, this hotel just didn't cut it. We were here for 4 nights at a great priceline rate and were excited to get such a deal.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "March 8, 2005", "id": 3259746}, {"rating": 1.0, "title": "An embarassment to the Le Meridien group", "text": "When we got there, we were ecstatic about the location (really prime) but sad that we were not so fortunate in our actual hotel. Exterior under construction, check-in rude and lengthy, room smoky, tasteless decor, walls paper-thin so we could hear the noise from the street (very loud)!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 5, 2005", "id": 3252890}, {"rating": 3.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Its long renovation having been completed this year, the Meridien Piccadilly is a stylish hotel with an ideal location half a block from Piccadilly Circus. Nothing about it particularly stands out for extra praise, but the staff are friendly, the bedding unusually comfortable, the housekeeping generally very good, and (for what it's worth) the elevators prompt, which is a plus in a rather large property. There's also a large swimming pool and an unusually spacious, up-to-date, and well-equipped gym in the basement. It's only unfortunate that a tasteful and at times even arty redecorating job can't mask all the quirks of this Edwardian building. Our room was microscopic--so small that its awkwardly tiny work desk was dwarfed by its own chair. More awkward still was the smallish bathroom perched two steps above the rest of the bedroom--an obvious hazard if you happen to forget, in the middle of the night, that there's a set of stairs *inside* your dark, unfamiliar hotel room. Surely, this particular model of bedroom served as a butler's pantry when the hotel opened early in the 20th century, and it ought to be turned back into one. But those quibbles aside, it's impossible not to enjoy this excellent location, steps from the great shopping in Regent Street, a few blocks from the heart of the theatre district, and conveniently reached by tube from just about everywhere in London. We'd stay here again--but demand a grown-up sized room next time. A note for computer users: Ignore the pointlessly expensive Internet service and go to one of the many cafes in the neighborhood that offer free WiFi.", "title": "Excellent location; enjoy your room before you grow to adult size.", "helpfulness": 2, "user": "Lit-traveler", "date": "June 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 113766989}, {"rating": 2.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "There is two positive things about this hotel: its Location, and a nice pool", "title": "Not 5 star standard", "user": "Eatallover", "date": "June 15, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 113640505}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The hotel has no wow factor the porters were unfriendly and scruffy they prefer to talk among themselves than help me with the door and my luggage", "title": "Good hotel, more because of its location than anything else", "user": "LondonTelegramSam", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 113208592}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "Room was not ready when I arrived at 16.30 had to sit in the lobby for 45mins no refreshments offered", "title": "Lovely hotel in perfect location", "user": "rebeccafromoz", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113173316}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "No free wi fi", "title": "Excellent location for sightseeing and shopping", "user": "ksprott", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113135995}, {"rating": 3.0, "stay_parameters": "Stayed July 2005, traveled on business", "text": "This hotel depends on if you get an upgraded room. Mine was small with water stains on the ceiling. Interior room was quiet, but no view. The hotel staff was friendly and the location great, but I couldn't wait to move to a different hotel.", "title": "Tale of two cities", "helpfulness": 3, "user": "rcmjr", "date": "July 11, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 4.0}, "id": 3655728}, {"rating": 5.0, "title": "The Piccadilly is first class", "text": "The Piccadilly was first on my list for location, but after a great arrival and room it started to be an experiance.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "June 14, 2005", "id": 3554465}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "Great Staff", "title": "Great location/good hotel", "helpfulness": 6, "user": "mheywood", "date": "June 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3545260}, {"rating": 5.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "Great food", "title": "Great Staff, Great stay", "helpfulness": 7, "user": "calitravlr", "date": "June 12, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3544911}, {"rating": 1.0, "stay_parameters": "Stayed November 2004", "text": "Leisure Club was fantastic", "title": "Faulty Towers - Worst Hotel", "helpfulness": 13, "user": "Kellie18_10", "date": "May 12, 2005", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3461870}, {"rating": 4.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "We just returned from a 6 night stay at the Le Meridien Piccadilly and can say we were totally satisfied with the room and location. We booked the hotel for 200 USD on Priceline. When we arrived we were offered the same upgrade deal as mentioned in other reviews ...we turned it down, but said we were willing to wait for a non smoking, King. Within an hour they had a room for us. At the price we paid, it would be hard to do better! We had a King Size bed, marble bath, table and chairs, desk, fax machine, internet access and plenty of windows! Every night, they set out terrycloth robes, slippers and chocolate along with a printed weather forcast for the next day. In the morning, they left the daily newspaper and replenished our tray of Coffee, tea, hot chocolate and shortbread biscuits. My 2 complaints were ... #1.food prices at the hotel were beyond belief, don't eat there. We found a small deli-like place around the corner and a Pret a Manger down the street both had resonable priced meals #2. they don't have satellite TV, so you're stuck with 13 choices. Overall, I would put it on par with a higher end Radisson or Sheraton, but the location bumps up the star rating ... and in London, location is important! We were just off Piccadilly Circus, close enough to benefit from the many restaurants but far enough away not to be bothered by noise. The tube station is virtually yards away. (Be wary of hotels that say tube stops are a short walk away ... a short walk to Londoners could be a 1/2 mile or more. Now that might not seem far to some of you, but after a full day of walking the last thing you need is another 1/2 mile!) Where location really counts is after 12midnight when the tube closes. If you're staying further out from the center of things, you'll have to take cabs after 12 and that can get expensive. The Le Meridien Piccadilly is within EASY walking distance of the theater district & Covent Gardens (big restaurant & club area.) We never took a cab.", "title": "Location, location, location", "helpfulness": 7, "user": "Teacher323", "date": "March 3, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3242324}, {"rating": 4.0, "title": "Bad Start, Excellent Finish", "text": "I was hugely disappointed with the hotel at first. I was given a twin smoking room with the worst decor of any hotel room I had visited in recent memory. Not only that, the room was Noisy - neighbors, cleaning staff, water pipes, and traffic. Not pleasant. I complained to the curt woman who had checked me in at Reception. Her response was, \"You paid for a standard room. And that is what you are getting.\" After two sleepless nights, I pleaded with management to be moved. The manager was kind and understanding, and a True Credit to his hotel; he put my needs first! Too bad half my stay had already passed but at least something positive was done.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "March 2, 2005", "id": 3241069}, {"rating": 2.0, "title": "Good location, but only OK", "text": "Hotel is in a great location, but the hotel is only OK. Only had a twin room available but offered an upgrade for 55euros more. We declined as this would have put the final price at about 300 USD for the off season. This was a priceline stay so I wasn't expecting much.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3224143}, {"rating": 2.0, "title": "Sacrificing room quality for location", "text": "But the difference is staggering when we then moved to the Marriott Park Lane. Then you realise how poor the service/rooms are at the Meridien. If the Park Lane was a 5 star the Meridien is a 3.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "February 23, 2005", "id": 3223325}, {"rating": 4.0, "title": "Best of both worlds?", "text": "Feb 05 - stayed at the hotel on business for my husband and leisure for me. From porter/doorman to check-in everything went smoothly until we got to our room in the \"attic.\" Tiny and dated. We requested a move and took a slightly larger room with twin beds and a window with obstructed view (might as well have been no window). They said this was the only other room available, but the hotel did not appear that busy. The ash trays indicated it was a smoking room, but it did not smell like a smoking room and I am very keen to that. However, we found out it was in a smoking area, as smoke from other rooms seeped into our room in the morning. This second room was dated, but acceptable. Terribly hard to control the temperature in the room.", "helpfulness": 4, "user": "BacchusHK", "date": "February 11, 2005", "id": 3178946}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Just returned from a week long stay at the Le Meridien that I really enjoyed even though there are some things that need improvement. The good: FABULOUS location just half a block from the Piccadilly metro and within walking distance to almost everything, great beds, OUTSTANDING club lounge that served a huge breakfast till 10:30 which we used as our lunch, afternoon tea and appetizer type food that we used as our dinner for three of the nights which saved oodles on food budget, delightful checkin with Joannna and prompt and efficient housekeeping. Our room was wonderful, so it must be one of the refurbished ones. I used Starwood points for a suite upgrade and the two separate rooms were really needed as the rooms are small and the bathroom very tiny. We are platinum members with Starwood and I called ahead and spoke to Josepjhine who was lovely and assured me that I would have one of the newer rooms. The reason I cannot give this hotel Five stars is due to the issue that has been mentioned here earlier. The concierge is worthless, messed up dinner reservations, no help with your bags when you arrive, no help getting a cab, etc. We are pretty independent and we just started doing everything ourselves, so it didn't bother us too much. I would definitely return.", "title": "Good things about my stay", "helpfulness": 1, "user": "Joey965", "date": "June 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 112944030}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "I have stayed in far more superior hotels with only 4 stars.", "title": "Needs some love, attention, and English speaking staff (native)", "user": "Helenpatterson", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 111560897}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "Room wasn't ready until late, old fashioned furniture, titchy tiny bathroom, no iron/board in room, illogical desk and chair combination so chair wouldn't find tidily underneath the desk so acts as an obstacle on the way tot the bathroom. Bathroom light super bright without a dimmer or low light facility so if you are sharing a room and one of you needs the bathroom during the night, then you are both AWAKE!", "title": "This old gal needs a facelift", "user": "ChillyAlbertans", "date": "June 3, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 111364579}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled with friends", "text": "Plug didn't fit the bath whatsoever so bath out of use. Called hotel engineer who fashioned something together but it was not ideal.", "title": "VERY POOR", "user": "Howhardcanitbe1", "date": "May 30, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 110625748}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Ridiculous prices in the bar, and I mean ridiculous!", "title": "Perfect location, super correct service, unusually well equipped gym & pool", "user": "JORGEUruguay", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 110414471}, {"rating": 2.0, "stay_parameters": "Stayed February 2005, traveled on business", "text": "I stayed for business for a week and the Picadilly Le Meridian is conveniently located in Picadilly which is great for access to restaurants and the theatre. The rooms were a bit shabby and need renovation. The bathroom was ok, the best feature was the towel warmer. Definitely bring your own shampoo/conditioner - the ones that they provide are terrible. The service level is pretty bad at the front-desk. Be patient because you will be there a while. The concierge provided incorrect information to restaurants that were closed or pretty bad. There is no special club/business access and the internet stalls provided were always out order. If convenience is your most important feature then stay here it is close to the tube station and centrally located for restaurants, shopping, theatre and other points of interest.", "title": "Kinda shabby but conveniently located", "helpfulness": 9, "user": "bruisernaps", "date": "May 11, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 3460717}, {"rating": 3.0, "stay_parameters": "Stayed April 2005", "text": "We stayed at this hotel 4/18-4/24. The location is good. Starbucks next door, tube a few feet down the street. The room was clean but very small. The entire hotel needs to be refurbished. Not bad but not great.", "title": "good location, avg hotel", "helpfulness": 2, "user": "satherton1", "date": "May 8, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 3449421}, {"rating": 5.0, "title": "The Merridien DOES NOT disappoint. Great Hotel", "text": "First, we did not use Priceline to book this hotel and I've noticed that most complaints are from Priceline customers. We did, however, pay in advance through Travelocity to get a better rate and upon check in, we even got upgraded for free (which was a really nice suprise!).", "helpfulness": 6, "user": "A TripAdvisor user", "date": "May 3, 2005", "id": 3435554}, {"rating": 1.0, "title": "awful - bad room, aircon not working and very poor food", "text": "The room, located on the top floor, was great. It was much larger than I expected; very clean and very elegant. We couldn't be happier.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "May 2, 2005", "id": 3431775}, {"rating": 1.0, "stay_parameters": "Stayed April 2005", "text": "Here's a general pro/con list of our hotel stay:", "title": "All they want is your money!", "helpfulness": 2, "user": "Martin S", "date": "April 24, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3402098}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Being British we thought it high time that we 'do' London to see what all the fuss is about.", "title": "Incredible 5* location", "user": "LauraJHodson", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 114944746}, {"rating": 2.0, "stay_parameters": "Stayed June 2011", "text": "Please do not try and drive up to this hotel- nowhere to park/unload- you can however get good parking deals on the internet in advance if you plan to drive into London, so you can park within a 10 min. walk radius. So, the lobby is nice, no problems at check in, the rooms are fairly small but attractively furnished, the bathroom we had was nice (no complaints), but that's all been said before. Long wait for check-out (we couldn't believe there wasn't an express check-out option), gorgeous pool in basement, outrageously priced mini bar (£4.50 for a can of coke) when there are plenty of shops and cafes within 200 metres. The location is insanely central- we walked absolutely all over. It took under 20 mins to walk to L'Atalier de Joel Robuchon, The Ivy, Leicester Square, Mayfair, Buckingham Palace- there's literally stuff in all directions. Slightly further afield, No10, Harrods, Tower Bridge, London etc. all accessible by foot. Great location for shopping, restaurants and sightseeing. Surprised by how green and pleasant it all was. We got a great deal through lastminute (half web site price) after some careful research. Staff were pleasant; some were up for a long chat (especially about smoking as there's no designated area which makes it hard for customers and staff alike) and no-one acted like they were self-important or were too busy for you. All in all a great experience and I would recommend this hotel for its location, provided you get a good price. Had I paid £250+ I may have been a bit disappointed. 4*+", "title": "Rude staff and terrible bathrooms", "helpfulness": 1, "user": "IrishStephen", "date": "June 30, 2011", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 114903815}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "While having stayed at the Le Méridien several times before and hanging in there for the renovations to complete I can say nothing but I am very disappointed.", "title": "Fabulous location. Small rooms.", "user": "Salfordred_9", "date": "June 27, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 114809952}, {"rating": 4.0, "title": "Great location and good London accomodation", "text": "I encountered a very rude duty manager while staying when simply asking if I could be placed in a room with a newly renovated bathroom on my next visit. It was a take it or leave it attitude even when I pointed out that my bathroom was falling apart and dirty.", "user": "soshbfly", "date": "June 26, 2011", "id": 114765513}, {"rating": 1.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "I will not return again and take my business to the fabulous looking W Hotel down the road.", "title": "Not a five Star Hotel", "helpfulness": 1, "user": "KML64", "date": "June 17, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 1.0, "value": 3.0, "service": 1.0}, "id": 114044000}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 147, "average": 234, "very good": 479, "terrible": 93, "excellent": 295}, "aka": "Le Meridien Piccadilly Hotel London", "slim_ranking": 0.398698884758, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 5.0}, "description": "Le Meridien Piccadilly is set in the heart of the West End one of London’s most fashionable destination, and only moments away from London’s cultural attractions, including Piccadilly Circus, Leicester Square, and Covent Garden. The hotel features many amenities including meeting facilities and banqueting suites, the Piccadilly Health Club and one of London’s largest indoor swimming pools."}