{"user_rating": 4.0, "review_count": 627, "name": "Le Meridien Philadelphia", "reviews": [{"rating": 5.0, "title": "Breathe easy, this boutique hotel does it all", "text": "Dates of stay: December 27, 2011 through January 2, 2012 (6 nights)", "user": "AtlanticHonu", "date": "January 5, 2012", "id": 122600740}, {"rating": 4.0, "title": "Swanky. Clean. Great location.", "text": "Guests: Family of 3 (two adults, one child)", "user": "r0ckyd0ck", "date": "January 3, 2012", "id": 122490970}, {"rating": 3.0, "title": "a pleasant stay", "text": "Room Type: Double Superior", "user": "simplecity", "date": "January 3, 2012", "id": 122460733}, {"rating": 5.0, "title": "Second stay and better than the first!!", "text": "(Superior offers a view of Philadelphia's gorgeous City Hall; and is a little larger than the Classic, which I believe does not have a view of City Hall)", "user": "winelvr83", "date": "January 1, 2012", "id": 122381856}, {"rating": 4.0, "title": "Nice hotel, great location", "text": "Overview", "user": "JimMc085", "date": "December 30, 2011", "id": 122292454}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Over the past 2 to 3 years - I have come to love the city of Philadelphia. This is my 1st stay at the Meridien and boy did it meet my expectations. Just like the previous reviewer - I got the exact same deal through priceline and stayed here over the long weekend.My girlfriend and I drove down from Toronto for the long weekend and since this was her first time in Philadelphia she we both had high expectations.", "title": "Excellent Stay, Friendly Staff, Great Location", "helpfulness": 2, "user": "gliu25", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125102662}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The hotel was beautiful. The lobby was modern and very comfortable - I felt like I was staying in a condo rather than a hotel. There was a bar and a restaurant in the lobby, and the check in staff were extremely friendly. As I mentioned before, I booked the hotel through priceline but called in to make a request for a king bed. The staff took my SPG number and gladly put me up on the 10th floor (which is the highest floor) with a great view of the city.", "title": "We had a great stay at Le Meridien", "user": "relayer", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124893760}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The room was clean, modern, and had all the amenities we needed. There was a LCD TV, a safe, and a minibar. The washroom was really clean, and my girlfriend and I really liked the shower (with a glass door) which is different from other hotels. The bed was really comfortable and the pillows were so soft - I felt like I was at home. The cleaning staff always had a smile on their face and were extremely accomodating.", "title": "I stayed here a few weekends ago and loved it....", "user": "daniPhila", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124883968}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I used the gym all 3 nights I was here and like previous reviewers mentioned - it is very basic and I would have expected a lot more from a 4 star hotel. However the weights and treadmills were enough to help keep my exercise routine.", "title": "Great local get-a-way", "user": "Famo4Philly_PA", "date": "February 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124445112}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The biggest positive of this hotel is the location. It is smack in the middle of city hall and close to everything. The majority of the tourist attractions are within a walking distance and there are many restaurants within a few minutes. There is a Mcdonalds right next door for breakfast or late night snacks and the hotel is right across from JFK plaza.", "title": "Best place to stay in center city, hands-down!", "helpfulness": 1, "user": "dcmiley", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124298556}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This is a very nice place to stay in the heart of Philly. We stayed 2 nites and took the Septa to a Sixers basketaball game one night. Very easy! Had a wonderful stay. Very clean rooms and friendly staff. When you step off the elevator your in for a treat!!! Decor is modern & artsy.......awesome building! We stayed on the top (10th) floor. Great view. Will, for sure, stay here again.", "title": "Great location!!", "helpfulness": 1, "user": "Diane F", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 124297327}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed here for a weekend getaway from NYC. Nice hotel overall, clean room and public area. Our room was on the 6th Floor with the window facing the interior courtyard, good because it was quiet but annoying because it felt dark most of the time. Wi-Fi costs $9.99 a day if you want to use it while in your room. Paid $148/night (not including tax) and figure maybe at this price Wi-Fi might be included. No bathtub in the room, only a standing shower.", "title": "Would stay here again but...", "helpfulness": 1, "user": "amywolfieNewYork_NY", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124207091}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "All this would've still warranted a 5-circle rating but the room service meal we received docked my rating. Ordered a Caeser salad, club sandwich, and water. With the delivery charge and some handling charge, it came to $46, fine, room service is expensive so whatever. But the quality of the food was less than impressive. Some chopped up romaine (a few brown pieces) and croutons (not dressed) alongside a small cup of dressing. No cheese on top or anything. Club sandwich was two pieces of bread sandwiching cold pieces of burnt bacon, sloppy tomato, and limp lettuce. Something resembling a half hearted effort from the kitchen. Too bad because a hotel of this calibre (OK, not the Ritz here) should at least have a higher standard in food for their guests. So yes, I would stay here again but would not order room service again, maybe instead stumble down to the McDonald's in the corner and call it a night.", "title": "Well Done!", "user": "KWRochester", "date": "February 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124111125}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "I don't often share my opinion online about the many hotels I stay in while on business. This hotel was a beautiful and unique experience, however, and deserves the kudos. Without exception, the staff was so helpful, nice and accomodating. Our meetings enjoyed some incredible food with unique offerings, always beautifully presented. My room was so well appointed, modern, sleek, clean, and cozy. The robe and slippers were a nice touch!! The hotel was once the YMCA, and while they maintained some of the historic architecture in the design, the modern redo is spectacular! I highly recommend this hotel. From the front door to the desk to the room, nothing but incredible hospitality. Well done!", "title": "Le Meridien Philadelphia", "user": "momfrombostonBoston", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123977590}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Nice hotel with funky modern decor. Lobby was awkward-you enter direcly into the bar area. My coffee maker didn't work and neither did the printers in the business center...But a nice, quiet hotel with comfy beds and a great location.", "title": "Neighborhood is not great.", "helpfulness": 10, "user": "wanderlust2014", "date": "January 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 123803834}, {"rating": 4.0, "title": "Stylish hotel with a few flaws", "text": "I love Philly and was excited to see the LeMeridien come here a few years back. I love that it has stylishly filled the old DA's office (or whatever building that was). The lobby bar is gorgeous. The front desk staff acted cool, but they weren't overly welcoming, and they didn't acknowledge my SPG Gold status like I usually get at other LeMeridiens and SPG-affiliated hotels. They could've done a better job of welcoming me. We got a standard room, no upgrade. The room was pretty cool, but I think the king size bed was shortened to fit in the narrow room. My feet don't normally hang off the end of a king. I would have liked some sort of welcome goodie for being SPG Gold (again like I get at other places), but alas, no water, no goodies, no letter. #whitecollarproblems I know. Also, they didn't have glass glasses. That's a pet peeve. Flimsy plastic glasses wrapped in plastic bags? Tacky. There are nice solutions to having unbreakable glasses. This is the cheap, inelegant solution.", "user": "seawall77", "date": "January 27, 2012", "id": 123719986}, {"rating": 4.0, "title": "This is a great hotel", "text": "I do love the verbana toiletries (even though we had to call down to get them, since our room was stocked with three conditioners and no shampoo or lotion). I'd probably stay here again, because I love the style of the place, but they should really make sure everything matches the style of the decorating and make sure the service is as spectacular as the prices and style would indicate it should be. It's so close to perfect, but not quite there.", "user": "ReadyToGoHome", "date": "January 20, 2012", "id": 123368388}, {"rating": 5.0, "title": "Great for Business Travelers", "text": "Location is great, fabulous integration of old building into a modern style. Classy place to meet and entertain clents. Very comfortable beds, excellent workspace and fast internet. Business persons dream", "user": "AlwaysSomewhereNew", "date": "January 16, 2012", "id": 123161058}, {"rating": 5.0, "title": "An elegant old beauty with up to the minute style", "text": "I am a frequent visitor to Philadelphia and have tried several hotels over the years. I am happy to say that I finally found the perfect spot. The Le Meridien is in a good location, beautifully decorated and offers all the amenities that I am looking for.", "user": "Anne W", "date": "January 15, 2012", "id": 123135679}, {"rating": 4.0, "title": "Excellent stay!", "text": "The rooms are clean, a decent size, very modern decor and most have great views of City Hall. All rooms have 42in flat screen TV's (some have 2) and the perfect desk to get caught up on some email. I really enjoy staying in the suites where they have a \"living room\" with a couch and additional TV. They provide a bath robe which is perfect while getting ready in the morning. The bed linens/pillows are very comfortable and the room temperature stays very consistent throughout the evening.", "user": "ChristinaG602", "date": "January 15, 2012", "id": 123101023}], "location": {}, "stars": 4, "variance": {"poor": 19, "average": 89, "very good": 213, "terrible": 17, "excellent": 289}, "aka": "Le Meridien Philadelphia Hotel Philadelphia", "slim_ranking": 0.297619047619, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}