{"user_rating": 4.5, "review_count": 1389, "name": "Le Meridien Budapest", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed here for two nights a couple of weeks back. We had a nice room with a small balcony overlooking the square, and we could see the Basilica, Parliament building and castle from our window - which was wonderful! The location could not have been better, as we were a short walk from Gerbeaud cafe, the Basilica, Parliament and the shops and restaurants and bars. Even the castle was a short meander to the Chain Bridge, a pleasant walk over the river and then a hop on the funicular railway. We would also recommend the hotel's Sunday champagne brunch. The only disappointment was that the hotel pool and spa were closed for renovation, so we had to go next door to the Kempinski hotel to use their facilities (free of charge) rather than wander along the hall.", "title": "Superb location", "helpfulness": 1, "user": "TBUK", "date": "August 24, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8493542}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Le Meridien has the perfect location right outside a metro station and close to Váci utca (street) a main tourist street. The hotel was very clean, the staff friendly and the indoor gym and pool were excellent. The room was large and had a nice view of St. Stephen's Basilica. The beds were comfortable and the bathrooms very clean.", "title": "Great Hotel, Great Location", "helpfulness": 3, "user": "magicjc", "date": "August 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8474456, "likes": {"liked": "— The Quality"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Housekeeping services were outstanding. I asked for more towels and bodywash and they arrived promptly with copious amounts of each. Additionally, each night the maids would come to turn down the room and provide a bottle of water.", "title": "Luxurious Le Meridien in great location", "helpfulness": 3, "user": "Jim_Putney", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8446142}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "One small problem was that none of the ice machines on 3 floors I went to were working, so I called the front desk to notify them. They were apologetic and delivered a bucket of ice without me asking.", "title": "OK but would not stay there again", "helpfulness": 1, "user": "DoogLondon", "date": "August 14, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 8419777, "likes": {"liked": "— Large rooms", "disliked": "— Garish design and uncomfortable beds"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Le Meridien is a great hotel. I’m a fan of Starwood hotels, and my stay in the Budapest Le Meridien has only strengthened my admiration of this chain. Why? Well, for a start, all of the hotel staff-members were excellent: polite, courteous and helpful. The décor throughout is tasteful and understated. The rooms are large and comfortable, and are well-equipped with good air-conditioning (Budapest gets hot and humid in the summer), large flat-screen TVs, etc. The attention to detail throughout gives the sense that considerable thought has gone into the guest experience. For example, the heated bathroom mirrors never steam up.", "title": "Fantastic Hotel", "helpfulness": 3, "user": "Kim J", "date": "August 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8384046, "likes": {"liked": "— Cleanliness", "disliked": "— The Expense!"}}, {"rating": 5.0, "title": "Fabulous!", "text": "We spent three nights at the Le Meridian and enjoyed every minute. The staff were friendly and professional, the room was outstanding and the location great. It was an oasis of calm to return to after sight seeing. The buffet breakfast was excellent and we also enjoyed the Friday night Hungarian buffet and entertainment. Highly recommend it and would definitely stay there again.", "user": "oz5travel", "date": "August 3, 2007", "id": 8283024}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Perfect location for a weekend trip, close to all major attractions. The hotel is what you can expect from a Le Meridien - good but not very spectacular. Rooms are spacious and well furnited. Hotel service just ok - could not meet our request for late check out.", "title": "Great location, ordinary hotel", "helpfulness": 1, "user": "City&beach", "date": "August 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8275294, "likes": {"liked": "— Location", "disliked": "— Lack of personal service"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Unfortunately, we only stayed for one night at this lovely hotel before boarding a riverboat to cruise to Amsterdam.", "title": "Lovely hotel", "user": "Speges", "date": "July 29, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 8251693, "likes": {"liked": "— Overall decoration", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The hotel was beautifully furnished and very comfortable. The food in the restaurant was very good and the staff were lovely.", "title": "Le Meridian Budapest - the Best", "helpfulness": 2, "user": "judymol", "date": "June 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8028030, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007", "text": "We would certainly stay here again.", "title": "Beware-the Meridien staff steals from your room!", "helpfulness": 14, "user": "SSNYC02", "date": "June 27, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 3.0, "rooms": 1.0}, "id": 8016027}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "I have traveled extensively around Europe and Eastern Europe and therefore have stayed in many hotels. This was absolutely the best hotel!!! It was very beautiful, clean and the staff was very accomodating. The hotel was in a great location and we were able to walk all over the city. From our room we had a beautiful view of the basilica. I can't say enough good things about this hotel. Budapest is my favorite city and a large part of it is probably because of Le Meridien. (well.. Budapest is beautiful - no doubt!) I highly recommend that you stay here!!! I want to go back - right now!! Perfect hotel. Stay there!!", "title": "My Favorite Hotel!!!", "helpfulness": 5, "user": "trips4life", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7867712, "likes": {"liked": "— everything - decor, location, staff, cleanliness", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We arrived in Budapest at 12.00 on Saturday last for a 2 night stay in an executive suite in Le Meridien - details of the property are fairly sketchy on the website, compared with other hotel groups, but it didn't matter. Le Meridien was absolutely gorgeous. It's very centrally located in the heart of District V in Pest, right beside the Deak Ferenk Ter Metro & within walking distance of all the major points of interest.", "title": "Stunning hotel in a fantastic location", "helpfulness": 10, "user": "babaduck", "date": "May 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7629640, "likes": {"liked": "— The location & the luxury", "disliked": "— The price"}}, {"rating": 1.0, "title": "5 star ??????????", "text": "If you're landing at BUD airport, I'd highly recommend getting the Airport Minibus service rather than a taxi (unless you're in a terrible hurry). It's HUF 2300 o/w and HUF 3900 return. You can buy your tickets either in the baggage hall or in the arrivals hall (they take major credit cards). You need to go to the desk in the arrivals hall & tell them what hotel you're staying at, and then take a seat. A few minutes later, you'll be \"claimed\" by a driver & dropped to your destination. You need to call them the day before to arrange your return trip - allow 1h for the journey.", "helpfulness": 10, "user": "phoebelondon", "date": "May 8, 2007", "id": 7564068}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Back to the hotel... it was stunning & our suite (No. 820) was superb. We had a very large sitting room with two sofas, a large LCD TV, stereo, balcony, huge bedroom (2 large twin beds zipped together with incredibly comfortable duvets), extensive wardrobe space and a very well appointed bathroom with great toiletries, cosy robes & slippers.", "title": "Twin Single Beds!", "helpfulness": 10, "user": "MMIreland", "date": "April 30, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 7484544, "likes": {"liked": "— It's location", "disliked": "— Bed type is not as described in booking"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "We received a welcome fruit & cake plate from the general manager, and bottles of sparkling water with the turndown service. As we only had 48 hours in Budapest, we spent most of our time out of the hotel, however we made great use of the pool and jacuzzi which was very welcome after the very warm weather outside.", "title": "Exceptional", "helpfulness": 2, "user": "Weemacedinburgh", "date": "April 19, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7394878, "likes": {"liked": "— The room and the staff", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "very convenient location for all areas of Pest; only a few mins walk from the river.", "title": "Excellent Standard", "helpfulness": 6, "user": "JohnCole99", "date": "March 26, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7225127, "likes": {"liked": "— Room Decor"}}, {"rating": 2.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Excellent imposing building and entrance. Room was very clean and decorated to a high standard. friendly and polite staff.", "title": "4 Star hotel with 3 star service", "helpfulness": 8, "user": "FastidiousZoe", "date": "February 23, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 6831257, "likes": {"liked": "— The water pressure in the hotel", "disliked": "— The staff"}}, {"rating": 5.0, "title": "A comfortable stay", "text": "An excellent hotel to spend a luxurious city break", "helpfulness": 8, "user": "stegosaurus", "date": "February 18, 2007", "id": 6807983}, {"rating": 5.0, "title": "Very central beautiful hotel", "text": "Upon checking in, I was asked to take a seat. After 15 minutes of sitting there, I went back up to see how long it would be. They then informed me that my room was not ready, eventhough the hotel was hardly full. I came back several hours later to be shown to my extremely small room. It took 30 minutes for them to bring the luggage to my room, eventhough there were plenty of hotel staff standing around with nothing to do. The bedspread in the hotel was old and very outdated. I tried to take a nap but was continuously disturbed by some drilling and construction taking place in or near the hotel. When I went to breakfast the next morning, I was told that I had to pay for breakfast, eventhough I booked a package that included breakfast. The front desk manager then came to my table to announce that I did not have breakfast included. Finally after breakfast, I went to the desk to show him my confirmation. Eventhough the confirmation did show that breakfast was included, it still took a lot of effort to convince the front desk that I should not have to pay for breakfast. In the bathroom, there was one bar of soap and one small bottle of shower gel. Once those ran out, they were not replaced. I had to take one off the maid's cart myself in order to shower. Finally, I asked the hotel for a TAXI to the airport. Since the guide books warned that taxis often charged whatever they wanted, I asked what the fee would be. The concierge said 7000 HUF. Since I paid 4100 HUF to get to the hotel I asked why it was so much more. The concierge then said he could call me a city taxi and it would be cheaper. Note that the city taxi ended up costing us only 3000 HUF, so I was a bit annoyed that the hotel would organize a taxi for more than twice the price. Given there are so many other luxury hotels in Budapest, I will definitely try some place else next time.", "helpfulness": 4, "user": "ri_ra_2004", "date": "February 13, 2007", "id": 6784957}, {"rating": 5.0, "stay_parameters": "Stayed December 2005, traveled as a couple", "text": "We planned a 5 day stay in Budapest between Christmas and New Year, thinking we would enjoy the holiday atmosphere and experience the delights of Budapest in the snow. In fact, we both came down with the flu and spent most of the time in the hotel; normally we only come back to our hotel to sleep, so this review is unusually well informed! I have to say, that I can't imagine a better hotel to be ill in. Our room was large, quiet and comfortable in every way. We ordered up room service on several occasions, and the food was flawless. It is very centrally located, so it was easy to go out for a couple of hours to see some of the sights when we felt up to it. Towards the end, when I was feeling better, the concierge ordered me tickets for the Nutcracker at the Operahouse - they charged a fee, but the service couldn't have been better, and the ballet was a marvelous old-world production. The english-language television selection was not fantastic, but they had BBC prime and CNN, which was fine.", "title": "Had a great stay!", "helpfulness": 11, "user": "Thomh21", "date": "January 29, 2007", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 6712898, "likes": {"liked": "— All parts!", "disliked": "— Nothing"}}], "location": {"country": "Hungary", "region": "Central Hungary", "continent": "Europe", "city": "Budapest"}, "stars": 5, "variance": {"poor": 23, "average": 63, "very good": 312, "terrible": 17, "excellent": 974}, "aka": "Le Meridien Budapest Hotel Budapest", "slim_ranking": 0.062874251497, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}}