{"user_rating": 3.0, "review_count": 485, "name": "Le Meridien Dead Sea Hotel", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "There is nothing I can say good about this hotel. The room was gross and dirty. We had a two night reservation and left after one. The food was HORRID and made me sick all night. There are no other near by options to eat- so your screwed. The staff is rude and acts like they are doing you a favor. The facilities are old and out dated. Everything about this place is bad. Do Not Go.", "title": "Do not go! Stay anywhere but- This hotel is horrible", "user": "allinaomi", "date": "January 18, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 53758990}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "I am a travel agent and went as part of the Dead Sea Convention to promote the Dead Sea and its hotels. The hotel was disgusting. Reception staff were rude, arrogant and basically did not care. Had to ask 3 times to have my room cleaned on one day, the key to my room did not work most of the time. The room needed complete renovation as the plug was hanging out the wall, mould round the bath etc. The hotel areas are dirty almost to the point of utter filth. Every time I asked to speak to a manager to discuss these points (amongst many others) there was no-one available and the staff did not really take any notice.", "title": "Hated it - never again!", "helpfulness": 1, "user": "shazzahard", "date": "December 10, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 51006947}, {"rating": 1.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Many other people were complaining and had the same response.", "title": "Bypass this hotel and choose another", "helpfulness": 1, "user": "FrigginGr8", "date": "November 23, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 49873921}, {"rating": 2.0, "stay_parameters": "Stayed October 2009, traveled solo", "text": "I would love to go back to the Dead Sea but would NEVER recommend this hotel to anyone.", "title": "Not worth the 3 hour wait to check-in and definitely not a 4 star hotel.", "helpfulness": 1, "user": "detravel", "date": "October 16, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 3.0}, "id": 46999985}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This hotel is in no way a 4 star resort. The desk clerk had an attitude when we checked in. Got to our room and there was feces in the toilet, the carpet was badly stained and the sheets were so thin you could see through them. This hotel is in critical need of a renovation. My reservation was for 3 people and clearly stated so. When we checked out the hotel charged us an additional $70 a night for a cot for the 3rd person! We called Starwood from the front desk, the representative argued with the desk clerk as her computer showed a reservation for 3 and he still refused to adjust the bill! We would never stay at this hotel again. To be fair, Starwood, sent me a refund check for the additional charge. This is the first Starwood hotel I have ever had a problem in and I am a Starwood Gold member.", "title": "Enjoyed our stay!", "helpfulness": 2, "user": "liorlaub", "date": "October 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 46546972}, {"rating": 1.0, "stay_parameters": "Stayed November 2005, traveled solo", "text": "Too much of hype about hotel on lemeridien but reality is simply terrible. I planned to stay there for 3 nights, but managed to stay just one night. First, there were about 100 or so people storming the reception at check in, no order/line whatsoever, waited for about 1.5 hours to check in.", "title": "The worst hotel every stayed", "helpfulness": 3, "user": "visitor123456", "date": "August 7, 2006", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5564881, "likes": {"liked": "— nothing", "disliked": "— everything - service, room, food"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Room furniture is very old and cheap, bathroom not clean (looks like they have not cleaned it for several weeks), long walk to the beach, supercrowded and super noisy restaurants, staff who do not care about what you think at all, concierge refused to look for El Al reservations phone number.", "title": "Good Hotel, Great View, Great Pool", "helpfulness": 10, "user": "dgatsby", "date": "August 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5553148}, {"rating": 1.0, "title": "Worst Hotel Ever", "text": "To make things worse, they've charged twice my credit card for the amount due and I had to wait for about one month to get my money back.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 19, 2006", "id": 5482607}, {"rating": 1.0, "title": "Where to begin, wlll just STAY AWAY!!", "text": "I am a 29 year old male from Boston, MA. I am very well traveled and have lived in 4 countries. I have been to Israel 5 times before and twice to the dead sea. Let me tell you that I had a massive panic attack the day before my stay with my parents at Le Meridien when I read the reviews on TripAdvisor. I called 4 other hotels and begged for a room, I was even willing to pay the 1 night cancellation -- In the end I stayed 3 nights at this hotel and HAD A GREAT TIME!. All this talk about this being the worst hotel on earth is BALONEY!!!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5470568}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "First of all, this hotel predominantly serves Israeli tourists. Almost all of the staff speaks English, but its not cosmopolitan. As such, the service level is 4 stars Israeli, which is about 3 stars US. The facilities were very nice and if you have a problem with a broken tile or a blade of grass that’s out of place, then this hotel (and most of the Middle East) is not for you.", "title": "Worst Hotel I have ever visisted", "helpfulness": 7, "user": "GilBronner", "date": "July 2, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5417437}, {"rating": 2.0, "stay_parameters": "Stayed December 2009", "text": "This hotel may have been grand at some point, but is now old and dated. My room was spacious with a great view. Cleanliness left a lot to be desired: the luggage stand in my room was crusted with mud. The bathtub was old with the coating peeling off. The dining room was overcrowded and inefficiently run, with long lines everywhere. The food was OK. The spa was also overcrowded and I could not get a robe because they had run out. The Wireless connection was expensive. There is not much to do around the hotel.", "title": "Forgettable", "user": "cqfp123", "date": "February 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 57295974}, {"rating": 4.0, "title": "Great experience", "text": "Overall forgettable.", "user": "kceesse", "date": "February 16, 2010", "id": 56160712}, {"rating": 4.0, "stay_parameters": "Stayed February 2010", "text": "Pros", "title": "Very good from our place", "user": "thegarageguy", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 55789892}, {"rating": 3.0, "title": "It is fine to stay there if you know what to expect..", "text": "- Large rooms and large bathrooms", "user": "openhearted", "date": "February 11, 2010", "id": 55707973}, {"rating": 3.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "- Nice atrium where most rooms would face an interior courtyard", "title": "Not So Impressive", "user": "SarahRamatAviv", "date": "January 23, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 54159484}, {"rating": 3.0, "stay_parameters": "Stayed June 2006", "text": "We were placed in a room that was one floor above the lobby. There was some kind of event down at the lobby, and we could hear it loud for a few hours. The room design was poor.", "title": "Not as expected.", "helpfulness": 1, "user": "fmDafna", "date": "June 23, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 5378033}, {"rating": 5.0, "title": "Pampering Hotel", "text": "The pool was great.", "user": "SBCATraveler", "date": "June 1, 2006", "id": 5291308}, {"rating": 1.0, "title": "Nightmare!", "text": "Dinner was excellent, breakfast was not-so-good.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 6, 2006", "id": 4941655}, {"rating": 1.0, "stay_parameters": "Stayed April 2006", "text": "When you go to the Dead Sea it is for relaxing and getting pampered. The Le Meridien Hotel will definitely help you with that. We had a wonderful room with a balcony which overlooked the Dead Sea. We spent time in their Dead Sea pools and spa getting a massage. You can walk from the hotel to the Dead Sea to be able to experience the real thing. The room includes breakfast which is a feast, but for dinner we would recommend the Thai restaurant at the Crowne Hotel down the street (you can walk to the restaurant).", "title": "Eeech!", "helpfulness": 4, "user": "BRLTHREE", "date": "April 5, 2006", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "service": 2.0}, "id": 4933751}, {"rating": 4.0, "title": "Nicest Hotel in the Area - Close to US Standards", "text": "My husband and I recently stayed at the Le Meridian Dead Sea hotel for one night to celebrate my husband's birthday Not only did we not enjoy our stay, I can honestly say that we suffered. We came to the hotel for a break and rest from the stress of every day life and instead we were greeted with a series of discomforts that culminated in not being able to sleep at night.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "April 2, 2006", "id": 4828415}, {"rating": 3.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "The hotel is very good compared to the other options in the Dead Sea area. Check in was a bit hectic, but to understand that people in Israel, don't truly understand the concept of waiting in a line. The room is clean, standard, could use some updating, but over all good. We used SPG points for 2 nights and could not be happier. We did not eat at the restaurant, we did have Chinese at the Crown Plaza, it was slightly expensive, but a good alternative to normal Mediterranean cuisine you become familiar with while visiting Israel. There is also an Aroma Cafe Coffee shop within walking distance that has great coffee, breakfast, sandwiches and salads.", "title": "Pleasant Experience on Points!", "helpfulness": 1, "user": "uesider", "date": "September 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 43610786}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The pool is clean and large, it was crowded with families and children as are most hotels in this area. We found a quite spot under and umbrella and forgot our worries. Didn't partake in the spa, but they have an unlimited menu of treatments. They do have a salt water pool where you can experience the water of Dead Sea without going to the beach.", "title": "Avoid this hotel.", "helpfulness": 3, "user": "superbbob", "date": "August 28, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 39040965}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We went to Masada (15min drive) and hiked to the waterfalls in En Gedi. This Le Meridian is run by an Israeli hotel company called Fattal. If you have stayed in other Le Meridian Hotels, don't expect the same quality of standard. Not a four star by any means, but I would give it a solid 3 stars all the way.", "title": "A wonderful get away", "helpfulness": 1, "user": "Buzz82", "date": "August 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 38476019}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "I am so sorry I didn't listen to reviews written here. This hotel is a low level barely 3 star resort; We paid over 1000 us dollars for three nights.", "title": "Miserable staff, fine location, poor service", "helpfulness": 1, "user": "Oaklands4", "date": "July 29, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 36168686}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Positive:", "title": "Dirty rooms, awful service, unedible food! Stay away!", "helpfulness": 2, "user": "Bordass", "date": "July 12, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 34509140}, {"rating": 3.0, "title": "vast hotel, hanger-like restaurant", "text": "This is a vast hotel, so you have to view it accordingly, and accept that it's heaving with people, loads of kids and the only restaurant is buffet-style for breakfast and for dinner. And despite the restaurant being enormous, the hotel is so big that people are queueing for dinner.", "helpfulness": 4, "user": "davidfisher", "date": "November 7, 2006", "id": 6083469}, {"rating": 2.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "Lots of food, great choice - but it's not a place for a romantic dinner a deux with a bottle of wine.", "title": "Don't eat the food on Saturday night", "helpfulness": 6, "user": "tvdude", "date": "November 3, 2006", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 4.0}, "id": 6052394, "likes": {"liked": "— Lots of massage possibilities", "disliked": "— the inconsistent quality of their food"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2006", "text": "Probably worth staying there is your destination is the Dead Sea for Massada and Ein Gedi, but the whole resort area is very artificial and concretey.", "title": "Le Meridien", "helpfulness": 3, "user": "superjohn64", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 5927626}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled with family", "text": "Hotel had a lot of amenities. Great for people who want to enjoy the spa experience. I had one major problem though. The dinner on Friday night ( sabbath) was fantastic Unfortunately , the dinner on Saturday night was really bad. They don't cook to much on the sabbath so it didn't taste fresh. I had the Gefilte fish, a jewish minced fish,(which was also available on the Friday night) and both me and my friend were violently sick for the entire night. Throwing up and diarria. The hotel management refused to believe that it was the fish although it was the only thing that my friend and I both ate. I was told later by others that this could have been the same fish that they served on Friday night because they would not have cooked a new batch on Saturday. I never expected this could happen in a 5 star hotel. After I complained to numerous people, they didn't charge me for the water I bought the whole night to replenish myself or for the doctor I asked to see in the morning. (but originally they would have if I didn't complain so much) This sleepless night ruined my next day as well. Also, when I ordered a bottle of red wine, it came with a lot of cork inside so we sent it back. They took about 10 minutes and brought the already opened bottle to me. It seemed as though a bit of wine was misssing and I am convinced that they just removed the cork and served the same bottle. Make sure you have them open the bottle in front of you.", "title": "Nice hotel very crowded", "helpfulness": 2, "user": "dnasb", "date": "October 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5906457, "likes": {"liked": "— The Room and The Spa", "disliked": "— Crowded meals"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "The beach was nice but a bit of a walk. (they have a guy in a golf cart who will take you half way). There is no other placed to eat at all except mcdonalds. Buyer, be aware......", "title": "Best in the area", "helpfulness": 4, "user": "mbgandco", "date": "August 29, 2006", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 5718777, "likes": {"liked": "— rooms", "disliked": "— food"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The Dead Sea is incredible. The hotel was very busy with tourist from everywhere. Hotel services when checking in and out was hectic. We were upgraded to a family suite and tried their best to please us. The hotel is situated in a beautiful stop. The spa, fitness area.,salt water pools, private beach, and chlorine pools make this destination a perfect choice. Breakfast is from. 7AM till 10 AM. Do not miss. The buffet of fruits, vegetables, breads, eggs, pickled herring, tuna, cheeses is over the top . Regency Lounge provides computer, alcohol, fruit, and salad from 9AM till 8PM. Dining choices are limited outside the hotel.", "title": "The hotel to Stay When Visiting The Dead Sea & Masada", "helpfulness": 1, "user": "sunsurfandsand", "date": "June 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68115345}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "I don't know what the other people saw - all their complaints - don't listen to them or pay attention to their reviews. My room was wonderful - loved the bathroom - wanted to take it home. I loved the balcony!! The dining room was fabulous - so upscaled, beautiful and romantic.......I could write a novel in that place. The food was wonderful - so much food and all fresh. The spa was nice - I just didn't like the salt water - it scared me - it kept you up....anyways my daughter loved it as do most people. We walked to the Dead Sea and got in it - very nice - had a nice time. We only stayed one night, but I would definitely go back. Everyone was polite and wonderful. The Israeli's are wonderful people - I fell in love with them during my trip to Israel.....they are not rude or anything like that.......they are amazing people.....I was hesitant about what I would discover in Israel - my first trip outside of the US except for Mexico and Canada.....it was marvelous - loved every minute of it. And I loved the Le Meridien........I would highly reccommend it to everyone......", "title": "Wonderful - Relaxing - Tranquill", "user": "Skyscape049", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63859239}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled solo", "text": "I had been in Meridien Dead Sea Hotel last September and it was a great experience !!! I surprised to read the bad reviews.. 2 Day before I came to the Hotel they called me to ask about the spa treatment and I dont want any so they said thanx and good by. Didn't push or anything.. the check in was quick, the room was clean . Minutes after I enter the room the reception call to ask if everything is o.k. and to say have a great vacation. the food (morning and evening) was great and delicious. the pool is one of the biggest and the impressive that i had ever seen. the hotel is not cheap at all, even expensive , but with a good value for the money. I'm planing to stay in Meridien Dead Sea Hotel again in this June.", "title": "I dont understand the reviews over here....", "helpfulness": 3, "user": "kerend", "date": "May 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63583917}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "If you're staying at any hotel in Israel don't expect the best service. It's not a service oriented culture. In this case though, who cares? You're on the Dead Sea. The surroundings are unbelievably beautiful. Rent a car and do some hiking at Nachal Arugot or Nachal David. Get a massage or shop for skin care products. Best of all, bathe in the Dead Sea at the Hotel's private beach. This was one of the biggest perks of this hotel. The beach isn't luxorious, but it's fairly quiet and there is lots of mud in that area.", "title": "Not the best service by who cares", "helpfulness": 1, "user": "asussm", "date": "April 4, 2010", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 60327692}, {"rating": 1.0, "stay_parameters": "Stayed November 2009, traveled solo", "text": "The hotel itself is actually luxorious. The house cleaning but not be top notch and some of the amenities may leave something to be desired, but the hotel is the nicest in the area. The views are fantastic. The beds are the most comfortable you will find in Israel.", "title": "Typical pathetic Israel", "user": "Larry8241", "date": "March 16, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 58765596}], "location": {"country": "Israel", "region": "Dead Sea Region", "continent": "Middle East", "city": "Ein Bokek"}, "stars": 5, "variance": {"poor": 84, "average": 70, "very good": 105, "terrible": 125, "excellent": 101}, "aka": "Meridien Dead Sea", "slim_ranking": 0.789473684211, "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.5, "rooms": 3.5, "location": 4.0}, "description": "Le Meridien Dead Sea Resort and Spa is the largest, most extravagant and most lavish of all Dead Sea hotels. A vacation at Le Meridien Dead Sea is a unique and classic vacation experience, starting with the hotel’s prime location at Ein Bokek Beach near the shores of the Dead Sea, including the breathtaking scenery visible from every room and the high hospitality standards set by the Meridien hotel chain."}