{"user_rating": 4.5, "review_count": 311, "name": "Le Morgane", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "We needed a hotel at last minute due to problems in our chalet. Staff very helpful and went out of their way to accommodate us. The rooms were very clean and beds comfortable. We had an awe view of the mountains and the tram. Enjoyed our stay and the friendly people we met.", "title": "Great views of Mount Blanc and helpful staff", "user": "NorthHeroKatie", "date": "June 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164855349}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "Stayed for two nights, cannot fault hotel, staff, food, parking, comfort. Slight down side with bedroom smallish but beds were unusually comfortable for a hotel stay so no problem, cost and position fantastic. Free secure parking or underground enclosed parking with fee. Staff were excellent. 150 mtrs from cable car to view Mont Blanc. Cannot fault this Hotel in anyway. Would definitely stay here again. Also blessed with lovely weather to top off a great short stay. free spa with use of towels, even supplied with dressing gowns and slippers!!! Excellent breakfast need I go on??", "title": "Great Place to stay", "user": "Leo l L", "date": "June 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 163841022}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We stayed here whilst traveling through the alps. We had driven from the UK all the way through the alps from Pau in southern france. We booked the hotel on the spur of the moment. It was seriously classy and we were very impressed with the room. We had a balcony overlooking the road, which I have to say wasn't that noisy.", "title": "Very impressive! would definitely go again.", "helpfulness": 1, "user": "Bristolboy900", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 163579185}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "We were driving so being in the centre of town wasn't a problem for us, but if you are skiing, then I'm sure you would have to make some other travel arrangements. That being said it was close to everything in the centre of town. They had an underground car park which made things really easy!", "title": "Nice hotel in great position", "helpfulness": 1, "user": "12cameron", "date": "June 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 163573988}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The staff were very helpful and we spent two great nights there and would definitely go back again. We didn't eat there as there were so many places to go in the town, but we did have breakfast which was excellent.", "title": "Not quite 4 star", "helpfulness": 1, "user": "molyno", "date": "June 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 163055143}, {"rating": 4.0, "title": "Great place to stay in Chamonix", "text": "Excellent ambience topped with great service describes this hotel best. It started when stopping the carin front of the hotel, a service person helped us with our luggage and parked the car for us. Then we were quided to our room and topped with several hints of what to do in Chamonix. Great service concept in all! The room was of contemporary design, very clean and functional despite the size of it (some 25 sqm max). We invested in the mountain view and it was worth it; it is magnificent to look at glacier Le Bossons from your bed, no tv needed! There is no AC so keep the balcony door open for extra air; only minus is that then the seldomly passing car or people might wake one up if no ear-plugs are used. I did have and no problem. In all, excellent hotel in this price category!", "user": "Erkka L", "date": "July 19, 2013", "id": 168129803}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Great location, very clean and comfortable, helpful staff. The only issue we encountered was that it took several times around the block and finally a trip to the front desk before we could figure out where to park. We got the very nice surprise of an upgrade to our room, which was spacious and had a balcony overlooking the river. Definitely recommend staying here.", "title": "Loved it!", "user": "mns06", "date": "July 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167816169}, {"rating": 5.0, "title": "Simply outstanding", "text": "from the minute of arrival this hotel was outstanding. Geoffrey was fantastic and ensured that our luggage was catered for, the car was parked and catered for everything that we required. The entire hotel staff were exceptional. Great location and fantastic views of the breathtaking mountains. The SPA is very new and has everything that you need after a hard days riding, walking or hiking. We will definitely visit again.", "user": "em_3112_13", "date": "July 16, 2013", "id": 167761659}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This hotel is comfortable, centrally located and the staff are wonderful. The staff helped us book some reservations at huts along the Tour de Mont Blanc trail and helped us with other logistics. They went out of their way to be helpful. The rooms are large and comfortable and the spa facilities are fantastic (sauna, steam room, pool with jets). The breakfast is on the basic side, but enough variety and good quality (wonderful coffee as well). This is an excellent hotel for a great price. I highly recommend this hotel and will definitely stay here next time I visit Chamonix.", "title": "Fantastic hotel", "user": "CritiquerCA", "date": "July 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166341376}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with friends", "text": "We went to this hotel for a summer friends' week end. The hotel is well located and the rooms were clean and big. The service was really amazing, and the staff very friendly and helpful. And the hotel has a free car park and a nice spa! I would really advise to go there to stay in Chamonix, we really had an amazing time.", "title": "Amazing staff", "user": "Jessica R", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164995367}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "great hotel with secure parking in the centre of Chamonix. decent price. room very good with balcony looking at Mont Blanc. great to wake up to the view. only criticism is the doors to the bathroom are sliding doors to the room and therefore little privacy to the bedroom. staff very helpful and attentative", "title": "passing through on way to Italy great stop over", "helpfulness": 1, "user": "peter B", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161814844}, {"rating": 3.0, "title": "Disappointed", "text": "Very average. Clean modern rooms, with slightly better design than a Holiday Express at five times the price. Badly designed bathrooms- no room for your toiletries, probably the smallest hotel bathroom I have ever seen. The concept to keep the toilet separate was good however it just does not work.The glass wall in the bathroom, means that the light will disturb anyone else trying to sleep. There is no storage for clothing, if you are planning more than a weekend be prepared to live out of your suitcase. For the price this hotel is nothing special and over pretentious. I would also suggest that you eat somewhere else for dinner unless you have a penchant for expensive foam! Staff are efficient but not overly welcoming. Book a space in the garage for the car, large spaces and very secure.", "helpfulness": 1, "user": "MDS1960", "date": "May 18, 2013", "id": 161056290}, {"rating": 4.0, "stay_parameters": "Stayed April 2013", "text": "Rooms are nice and spacey. Cool porch with gorgeous view of the river and mountains. Great location close to town center.", "title": "Nice rooms with great view of the mountains", "helpfulness": 1, "user": "BeckyBarron", "date": "May 2, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 159408154}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "Breakfast was sparse - basics only. No vegetables to be seen or had, but coffee was better than the usual French standard.", "title": "Perfect location, modern, clean with very good restaurant", "user": "Tequila007", "date": "April 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158918107}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "No shampoo/body soap in the room on arrival, but the bathrobes are very nice to have.", "title": "Lovely and clean in a good location", "user": "Barnesy73", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 158609414}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This hotel is very well located just moments walk from the main street of Chamonix in one direction and the Aiguille du Midi cable car in the other. The appearance from the outside isn't the most attractive of buildings but there is useful parking next to the hotel as well as an underground car park.", "title": "Trendy and cosy", "user": "MatthewGreen", "date": "July 22, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168618779}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Once inside the property becomes stunning. The hotel successfully combines modern almost minimalist urban chic design with a traditional alpine feel of cosy fabrics and pine. The basement spa/pool area is quite stunning although the pool isn't really large enough to use as a lap pool, merely lounge around in the water enjoying the various bubble and jet zones.", "title": "Great hotel in great location!", "helpfulness": 1, "user": "Chris M", "date": "July 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 168505654}, {"rating": 5.0, "title": "Great hotel in the city center", "text": "We booked a standard room which had a small balcony and a view of the Aiguille du Midi. The room was small and as such probably not a room 2 people would want to share for a full week but it was comfortable non the less and the bed and bedding allowed for a very sound nights sleep.", "helpfulness": 1, "user": "JMO4104", "date": "July 21, 2013", "id": 168457276}, {"rating": 5.0, "stay_parameters": "Stayed June 2013", "text": "Reception staff were extremely helpful and friendly, my only slight complaint would be that the service in the bar in the evening was virtually non-existant with the staff member seeming more concerned with what was going on in the restaurant and perhaps coming across as somewhat aloof.", "title": "Great hotel, perfect position, excellent experience", "user": "yamahafz1", "date": "July 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 168335239}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The suite was perfect for our family of 4,to use as a base for a week of fun in the French Alps!Great service,staff and room quality excellent!The hotel is perfectly located very close to the centre of Chamonix and well situated for the cablecars on either side of the valley.", "title": "le morgane", "helpfulness": 1, "user": "agarwal_bhartendu", "date": "July 20, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 168276483}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 31, "very good": 120, "terrible": 1, "excellent": 152}, "aka": "Le Morgane Hotel Chamonix", "slim_ranking": 0.168831168831, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}, "description": "in the heart of Chamonix and at the foot step of the Aiguille du Midi cable car, Le Morgane combines the elegance of a 4 **** hotel with the relaxed, sporting mood of Chamonix offering a breathtaking view of the surrounding mythical peaks."}