{"user_rating": 4.5, "review_count": 119, "name": "Le Manumea Hotel", "reviews": [{"rating": 4.0, "title": "Best Bathrooms in Upolo", "text": "I am not a budget traveller so was struggling to find a hotel that would be up to my 'standards' in Upolo. I held my breath not sure what to expect but I can honestly say it was a lovely hotel.", "user": "MissTravelAlot", "date": "October 21, 2013", "id": 181884056}, {"rating": 4.0, "title": "+Great Room and welcoming service+", "text": "Your not going to get what we expect of a five star resort in Samoa but this was the pick of the bunch.", "user": "Honest_best_policy", "date": "October 10, 2013", "id": 180504543}, {"rating": 3.0, "title": "Great Rooms & Good Service", "text": "Our rooms were very large and clean, serviced every day. The outdoor bathroom is perfect (We moved onto Le Lagato, best resort in Savaii, after this hotel and their bathrooms weren't a patch on this one)", "user": "CCCV000", "date": "October 6, 2013", "id": 179991006}, {"rating": 4.0, "title": "Good value hotel with nice rooms", "text": "The air conditioner works extremely well and there is a ceiling fan. Even if you were travelling with four, I think these rooms would be adequately sized.", "user": "Stevo3161981", "date": "September 8, 2013", "id": 176250536}, {"rating": 5.0, "title": "Best stay in Apia", "text": "Now location, this is up the cross island road. Not near the 'town' of Apai. About 10 min drive. We had a car so no problem but Apia itself isnt that much of an attraction so didnt bother me being away from it. A taxi ride costs about $5 aussie, each way. If you need a car use funaway rentals, they were by far the most cost effective.", "user": "Ron K", "date": "September 3, 2013", "id": 175413058}], "location": {}, "variance": {"poor": 4, "average": 12, "very good": 37, "terrible": 2, "excellent": 64}, "aka": "Manumea Hotel Apia", "slim_ranking": 0.206896551724, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.0}, "description": "Le Manumea Hotel is located on the Cross Island Road, approximately 10 minutes from Samoa's capital, Apia. Nestled at the base of Mt Vaea, the resting place of the late Robert Louis Stevenson, the Hotel is only minutes walk away from the late-author's residence which is now a museum and grave-site.The Hotel's 12 Executive Suites command panoramic views of the Pacific horizon. Fully air conditioned with a ceiling fan, each suite has a secure indoor/outdoor bathroom with hot and cold water, a quaint little kitchenette with coffee and tea amenities with a little mini fridge and microwave. A 22\" TV is provided, and laundry service is available. The Hotel restaurant serves a range of Europeen and Samoan dishes and the bar is fully stocked and ready to serve a range of beverages which can be enjoyed poolside. Also on site is an air conditioned Conference Suite, which can seat up to 40 people."}