{"user_rating": 4.0, "review_count": 1474, "name": "Le Meridien Munich", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed November 2004", "text": "My husband and I stayed here for 3 nights in November for his 30th Birthday. Because we were in between Oktoberfest and the Christmas markets we had a great price. The hotel is extremely convenient being across the street from the main trainstation. It is within walking distance of all the main attractions in Munich. The hotel is ultra-modern and my husband appreciated the plasma screens hanging on the wall while I appeciated the reasonably priced German beer stocked in the minibar. Overall, we had a fantastic stay and will definately be coming back to both Munich and Le Meridien.", "title": "Fabulous hotel", "helpfulness": 2, "user": "Diro", "date": "January 7, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 2987948}, {"rating": 3.0, "title": "Just OK", "text": "Comfortable rooms, friendly service, but can do much better with location. Being next to the train station is not a huge plus. Neighborhood is not great. Will stay someplace else next time.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "January 7, 2005", "id": 2986717}, {"rating": 4.0, "title": "Great Stay", "text": "Overrall had a very good stay at this hotel. Being next to the train station was very convenient and the Marienplatz is a short walk away. The hotel was very clean and the bed was very comfortable. Our luggage was lost and the concierge kept calling the airline on our behalf. The hotel spa is very nice with a sauna, steam bath, whirlpool, and pool. My only complaint with the spa was people using the lap pool for diving and splashing around. Another problem was that the mini bar is automatic so if a bottle even shifts then it will show up on your bill; however the hotel was quick to remove these charges upon check out. Even with these slight issues, I would recommend staying here.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "January 2, 2005", "id": 2969735}, {"rating": 4.0, "title": "Very nice hotel", "text": "Le Meridien is a very nice hotel and the staff was fabulous. They have converters for use with just a deposit, which was helpful. If you are a non-smoker, avoid a room on the second floor. After one night we moved to the fifth floor, which was 100% better. Free coffee in the lobby in the mornings was a welcomed treat.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "October 12, 2004", "id": 2698937}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "If you are going on vacation to Munich, you will not find any ambiance at this hotel if you are expecting a German feel. As their website states, this is a \"centrally located business hotel\". It is a very nice hotel, very modern, large rooms, great staff, clean...but a business hotel. It depends on what you are looking for. To get to the tourist areas (The Marienplatz, the Old Town Hall,the Viktualienmarkt, Augustiner Keller biergarten ) is a 10-15 minute walk. However, you can catch the U-bahn which is very close to the hotel and get to all of these locations easily. We were there before Christmas and the view from our room was of the courtyard. The hotel is located in is right across from the Munich train station.", "title": "A good business hotel, but would not recommend for tourists", "user": "misssaintsomewhere", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 84923742}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This was my first trip to Munich and once again this hotel was given to me when I chose lastminute.com's 'top secret hotel'. And I was not disappointed!", "title": "Chic and stylish", "user": "Drake_Sheldon", "date": "October 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 84774356}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "First of all the hotel is in an excellent location - slightly outside of the historic centre, but only a 10 minute walk to Marienplatz (or two stops on the U-Bahn). The hotel is located right outside of Munich's train station so arrival either via by rail or air (great connections from the airport) couldn't be easier.", "title": "Kids very happy / Best to stay for Thai !!!", "user": "v_ponlapat", "date": "October 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84501974}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "As a part of the 'secret room deal' is that breakfast wasn't provided - however we ate (relatively) cheaply at the train station.", "title": "Just OK.", "user": "tablerockin", "date": "October 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 84387883}, {"rating": 5.0, "stay_parameters": "Stayed January 2010", "text": "The room was large and roomy and well heated - although we were there during the second week of March it was freezing and it started to snow on the second day (this made for some great photos).", "title": "Beautiful...great location.", "user": "joburkholder1", "date": "October 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 84385946}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "My husband and I stayed here for two nights while we visited Munich for Oktoberfest. I can't tell you how incredibly convenient it was to have the hotel just across the street from the Munich train station (we took the train in from Prague). My only warning would be to make sure you exit out onto the correct street (Bayerstrasse). If you don't, you may end up walking for blocks around the station until you finally reach the hotel. Also adding to its great location was the fact that we were just a few blocks from Oktoberfest and walking distance to the Hafbrauhaus, the Glockenspiel and many restaurants... The only downfall that comes with the hotel being in such a central location and close to the train station was the street noise at night... Just make sure to drink enough beer so you sleep soundly through all the sirens. :)", "title": "Nice Hotel, Great Location", "user": "SDTraveler909", "date": "October 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 82101332}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "My review is based only on what the hotel was like during Oktoberfest, so some of this may not apply to the rest of the year...", "title": "Good option for Oktoberfest", "user": "atljs", "date": "October 3, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 81984594}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Some friends and I had several rooms at Le Meridien Munich during Oktoberfest 2010. It's a good location for this. The hotel is right across from the train station, which has plenty of food options for a quick bite. It's also a short walk (10 minutes or so) to Oktoberfest, and a shorter walk to shopping, restaurants, etc. The design of the hotel is nice, and all of our rooms were spotless.", "title": "Great visit", "user": "darrennelson", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 81974716}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We used the hotel's parking garage, which is adjacent to the hotel. Didn't have breakfast in the hotel, since it seemed a little pricey.", "title": "Fabulous staff, convenient location, great value at reasonable price", "user": "obietraveler1", "date": "October 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 81863605}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Would definitely consider staying here again, but would also look into other options.", "title": "Perfect touristic location.", "user": "Katique", "date": "September 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81504744}, {"rating": 4.0, "title": "Meridian is great!!", "text": "This upscale hotel was next to the train station and within walking distance of all the major sites in Munich. The rooms were large with modern furnishings and great bathrooms. Breakfast is not included but available. The front desk was extremely helpful and friendly.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "August 31, 2004", "id": 2505064}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I have traveled a lot and this was one of the worst, over-priced hotels I have ever stayed at. It is like something washed up from the \"70's\". The hotel staff was rude and inattentive. We were told our room would be available in 45 minutes; 3 1/2 hours later, although we were situated only ten feet away, we were told, only after a fourth inquiry, our room was ready. The room smelled and the bedding, which during the entire stay was never changed, reeked with body odor. During the night the room rang with the shouts of drunks and sirens from the street. The expensive restauant food was easily topped by the bill of fare at the train station. Other than location, you would have no sane reason to visit this dump.", "title": "Room With a Smell", "helpfulness": 1, "user": "yoshijim", "date": "October 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 83965666}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "My wife and I are getting to be frequent visitors to LM Munich...we stayed here the first time 4 years ago, and have come back every year since!!", "title": "Our Favorite Hotel in Munich!", "user": "The_Traveling_Tom", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83469214}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The outgoing and friendly staff couldn't be more helpful (thank you Troy!) and it is nice to be greeted like an old friend upon arrival...a warm welcome and anniversary greetings (thank you Ellen!!) even preceded heading up to our beautifully remodeled room!", "title": "Excellent hotel - great location & value", "user": "Kram73", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 83169559}, {"rating": 1.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "Le Meridien feels more like a Bavarian Inn clothed in modern designer garb than a big city hotel in the heart of the \"action.\" Typically we take the Lufthansa airport bus from MUC, and are dropped off at the Hauptbanhof just across from the hotel...thus using LM as a travel base is easy when we travel by train on a sidetrip, or catch other transportation around the city. The concierge staff couldn't be any more helpful in helping you navigate around this beautiful city...they even have day passes for sale!", "title": "Great Location but bad service", "helpfulness": 1, "user": "SpiRiTeD77", "date": "October 7, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 82389755}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "From the hotel it is a quick walk to Old Town Munich in one direction, or to Oktoberfest in the other...and Troy was nice enough to help me to get a table reservation at the Big Party before we arrived. Can you tell that we really like this hotel?", "title": "The Good, The Bad and The Indifferent", "user": "94131Traveler", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82384609}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "We stayed in the Le Meridien Munich for 5 nights in November 2010. As I had stayed here before about 5 years back and had a reasonably good experience, I decided to book the hotel again - this time staying with 2 of my friends. We booked an Executive Suite, which is supposed to be their very best Suite according to the reservations personnel.", "title": "Not as good as before ...", "helpfulness": 1, "user": "SingaporeGuy10", "date": "November 6, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 86205462}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "The hotel does not look as though its changed since 5 years back when I first stayed there. The real main advantage of this hotel is its location - just opposite the Main Munich Train Terminal and within walking distance of the Lufthansa Airport Bus Station (very good value to and from the airport into the city centre). Unfortunately, the best part stops here. After that, it was sort of downhill all the way ...", "title": "Great Experience", "user": "Eliane47", "date": "November 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 85891396}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled solo", "text": "The Suite was average in size for a European Hotel I suppose. However, the ameneties were rather \"basic\". Having paid something like 450 Euros per night excluding taxes, I would say that the Suite is pretty pricey for its size (about 55 sq metres). The room was reasonably clean though you can see some wear and tear hear and there. Bathroom was not very well maintained I must say.", "title": "A fine hotel, provided you are have a sound level of IT competence!", "user": "Franzdorette", "date": "November 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 85879869}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "Housekeeping was certainly not up to par at all. The housekeeping staff seemed to \"stinch\" on the toiletries - resulting in me having to keep calling the service desk to send up replenishments daily. Even the Nespresso Coffee machine capsules were not replenished until I asked it to be! The nightly turn-down service was inconsistent and there was one night when they didn't come at all.", "title": "Nice and Convenient", "user": "Frankhairguy", "date": "November 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 85793588}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "I would have thought that as a so-called \"Business Hotel\", all rooms would have wireless high speed Internet access but alas, this hotel DOES NOT. So do not expect this. The cable connection was mostly very slow. So if you need to have Internet access, do not come to this hotel. Even the business centre charges for Internet access!", "title": "One of the very best hotels", "user": "kwongman", "date": "October 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84929410}], "location": {"country": "Germany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 59, "average": 182, "very good": 530, "terrible": 30, "excellent": 673}, "aka": "Le Meridien Munich Hotel Munich", "slim_ranking": 0.135770234987, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}