{"user_rating": 4.0, "review_count": 656, "name": "Le Meridien Beach Plaza", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Beautiful hotel amazing views. Staff typical French thinking they are equal to their guest once put in their place Ok. Once teething problems sorted i enjoyed the hotel they always try to give u a bad room but you need to get what you pay for and fight. The restaurant staff were great. lovely beach relaxed people.. Will go back again next year as I did last year. I like this hotel great... Its Monaco but i would say one of the the best as stayed in a few there..", "title": "Great views", "helpfulness": 1, "user": "leeabbey", "date": "June 15, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 67618418}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Nice hotel in a nice area. At the desk we had a terrible welcome from a rude employee. The room was not with \"sea view and beach\", but only partial with a view on the town. The room medium size with an unconfortable bathroom with small towels. The beach was dirty and at the swimming pool at 4 p.m. they put table for evening buffet, terrible. Very bad experience.", "title": "Nice Hotel, with terrible service", "user": "TizMilan", "date": "June 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 67435647}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "I stayed at this hotel on business. The room had nice sea view. But the furnishings, linen, fittings, curtains, etc., looked quite tired. Room service food was terrible. Breakfast buffet was ordinary by European standards. For the food prices they charge I expect better quality and taste. Only one restaurant was open. Location of the hotel is good. This is the only hotel with a private beach, however the size of this private beach is very small. For the room rates they charged, I expected much better accommodation and certainly a higher class of restaurant.", "title": "Doesn't meet Le Meridien expectations, food generally sub-par", "user": "ADDHongKong", "date": "May 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 65821910}, {"rating": 1.0, "title": "dont book through gtahotels", "text": "hi i booked this hotel through gtahotels and last minute they cancelled it due to alleged credit card fraud.Thing is they took my money but they say they will give it back!!!.When i tryed to book direct guess what it was sold out at the weekend.I think starwood/le meridien need to get onto this", "helpfulness": 1, "user": "ManchesterLou_art", "date": "May 28, 2010", "id": 65628476}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Stayed during the Grand Prix and due to early (11am) arrival our room was nor ready. Was given a non renovated room on 2nd floor. Not worth the money. Outdated room with a small balconyt to the sea. Yes the views were great but I woke up on people talking/shouting on the backyard. So, go but opt for a high renovated floor.", "title": "Avoid the old rooms", "user": "Guniguguu", "date": "May 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 65041699}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "On arrival they upgraded us to Premium room for my husbands 50th birthday. Sea view was amazing. Breakfast was wonderful & you could have seconds! Staff were very nice & helpful. Especially Alessandro and Francesco they were wonderful!! This hotel is situated at one end of Princesse Grace, however, the walk into the centre is lovely. You can get the number 6 bus outside the hotel to take you into town. If you buy a Tourist pass on the bus it's 3 Euros each & you can get on & off all buses as often as you want for 1 day. Otherwise, it's 1 Euro for every trip.(at the moment). Casinos are good. Shops are good, make sure you go to the shopping mall!! Very clean and luxurious! Avoid Louis Viton shop they were rude. Gucci were very nice! Purchased something for the memory!! Anyway, HOTEL MERIDIAN IS BRILLIANT!!", "title": "This hotel was amazing and we would come back again.", "user": "Louloububu", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 61798670}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "Only, thing was the outside swimming pool was closed for repairs, should have been told this really when we booked. However, used the indoor pool instead once.", "title": "Cool Le Meridien, nice sea view rooms", "user": "Windsurfer147", "date": "April 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 61228046}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "One thing the bathroom was lovely but not enough shampoo and shower gel for two people for 5 days. Did not bring our own because of the liquid restrictions on hand luggage at airports. Visit the Palace, Jardin Exotique and Grotte, McCarthys Pub, Very dissapointed that the Oceanographic Institute was closed though. Helicopter transfer excellent!! Overall our stay, the food, (drinks very expensive but not at McCarthey's), the hotel, the whole experience was BRILLIANT! We will return.", "title": "A Taste of luxury amongst riches", "user": "myself-7", "date": "April 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 61198969}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "I Stayed there with my partner on starwood weekend promotion points and the hotel could not be faulted. However it might not have the glam of the more luxurious Metropole, Fairmont etc. so if you need a hotel with more \"monaco\" touch and you are ready to spend a bit more then best look to those around the casino.", "title": "Best breakfast ever", "user": "hotelharpy", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 60436668}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Rooms : We were upgraded (gold SPG at the time) to the sea view corners which are under the Blue rounded windows. Amazing view, great bed, Nice bathroom but not spotless (wood floor and some corners were a bit \"dated\")", "title": "Wonderfully relaxing, everywhere you want to visit within 5 minutes walk", "user": "amapBristol", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60430394}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "My fiance and I stayed here in June. The hotel itself is nice, especially the small private beach area, but we found the staff to be a bit pretentious and cost of food/room service exorbitant ($40 for a burger). Yes, Monaco in general is pricey, but at least you get what you pay for outside of the hotel. They hold private parties on their private beach, so we were asked to leave the one afternoon we decided to take advantage of it. The walk to the center of town is approximately 30 minutes and quite pretty, but I would probably stay somewhere higher up on the hill next time.", "title": "Nice hotel, but not a good value", "user": "phillyfoodie23", "date": "February 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 55631542}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "I booked le meridien in monte carlo for my husbands 40th birthday last year and we both had an amazing time. We couldn't wait to book again and we are now on count down to our next trip back in 5 weeks time. The hotel was incredible, very contemporary, very clean with excellent restaurants and friendly staff who are happy to help at all times. We booked a sea view balcony room and i would reccomend this to anyone, It was a beautiful view to wake up to every morning.", "title": "The most amazing place", "user": "THEJOHNSONSSSS", "date": "February 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55253179}, {"rating": 4.0, "title": "Relaxing", "text": "Enjoyed it a lot... I will send people here. Thanks for the lovely stay", "user": "antonturco1983", "date": "December 26, 2009", "id": 51888645}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "Stayed there two nights. Nice hotel big rooms, balcony, sea view. Own beach and pools. As all Monte Carlo hotel too overpriced, but no regrets. Walking distance from Grand Casino and nightlife.", "title": "Business class hotel - Monte Carlo pricelevel!", "user": "Jaarman", "date": "December 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 51283102}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled on business", "text": "This hotel is the only one in Monaco to have its own private beach. Its situated along the sea front and is only 5 minutes walk from the Grimaldi Forum - expo centre.", "title": "Ideal Location - private beach plus good for business users", "user": "Jonaeroblue23", "date": "December 15, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 51264106, "likes": {"liked": "— Location", "disliked": "— Expense"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "My husband and I stayed at the Le Meridien Beach Plaza during our European honeymoon last summer. The staff were exceptional, from check-in to check-out. Location of the hotel was phenomenal; close enough to walk to the city centre, but still a little oasis on its own with a private beach and sparkling blue salt water pools. Add the wonderful restaurants and you could not ask for more in a hotel!", "title": "Loved it so much...returning again this summer!!!", "helpfulness": 1, "user": "Ren711", "date": "March 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59542725}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The highlights of our stay were staff members Caroline from Reservations and one of the Bellmen (unfortunately, we did not get his name). Caroline arranged for an upgrade for us as it was our honeymoon and made sure our room was fabulous. The bellman helped us out when we realized the scooter rental company opened too late for us to return our scooter before we needed to leave to catch our flight. When my husband approached him with our dilemma, he gladly offered to return the scooter himself on our behalf. We could not believe how helpful he was, going way above and beyond to help us out.", "title": "Over priced and complacent", "helpfulness": 1, "user": "Doofler", "date": "March 15, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 4.0, "location": 3.0}, "id": 58624957}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We highly recommend this hotel in Monte Carlo and loved it so much that we are returning again this July for our 1 year anniversary. We can't wait to return!", "title": "Good value in a very expensive town!", "helpfulness": 1, "user": "aldeb001", "date": "March 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 58241172}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "I stayed at the hotel for two nights midweek. The hotel is located at the end of the promenade but there is a convienient bus stop right out side.", "title": "Incredible view from the beach", "user": "I_tell_you", "date": "March 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 57903875}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled on business", "text": "The room was clean and tidy with all the facilites you would expect and a nice bathroom. The TV did not work howver and had to be fixed while we there. We were on the 11th floor (top floor) and had a balcony with very good views over Monte Carlo. However, unfortunately the 11th floor was being renovated which I didn't mind but when they started work with power tools and hammers at 8.15am I thought this was far too early. We also had problems reaching our floor as two of the lifts did not go to the 11th floor and a further had broken down and required repair.", "title": "Great view from the room to the ocean, excellent service, good food & friendly staff made the trip enjoyable", "user": "ozone10", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55797001}], "location": {"country": "Monaco", "continent": "Europe"}, "stars": 4, "variance": {"poor": 41, "average": 125, "very good": 204, "terrible": 29, "excellent": 257}, "aka": "Le Meridien Beach Plaza Hotel Monte-Carlo", "slim_ranking": 0.9, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Ideally located in the heart of Monte-Carlo, Le Méridien Beach Plaza is the only hotel with a private beach with direct access in Monaco. Le Méridien Beach Plaza offers limitless possibilities to explore the city of Monaco."}