{"user_rating": 4.0, "review_count": 1263, "name": "Le Meridien Barcelona", "reviews": [{"rating": 5.0, "title": "Great Experience at Le Meridien Barcelona", "text": "My girlfriend and i spent three days in Barcelona and had a great stay at Le Meridien. The concierage and front desk staff were tremendous. In particular, Anthony, the concierage, was a great help. He was outstanding maping out all the must see spots and things to avoid. Anthony also did a great recommending local restaurants and tapas bars. He really helped make it a great trip instead of just a good trip for my now fiance and me.", "user": "gmh72", "date": "August 6, 2007", "id": 8361995}, {"rating": 4.0, "title": "Overall Very Good", "text": "The hotel was finishing up a renovation of the lobby. The rooms, however, were complete by the time of our stay. Rooms were great, with plenty of space. We really enjoyed the style of the hotel - modern, but not too crazy like some W hotels. This hotel is a no brainer - you are right in the middle of everything on La Rambla.", "user": "stanatl", "date": "August 2, 2007", "id": 8279618}, {"rating": 4.0, "title": "Good choice for central Barcelona", "text": "My wife and I stayed at the Le Meridien for seven days in July. We arrived early on Sunday morning from New York and our room wasn't ready. Not a big deal as we were there so early that we didn't expect it. I'm an SPG Gold Member and they told us that they would put the room cleaning on a priority list and that the room would be ready in about 1.5 hours. We went for a walk on Las Ramblas, had a cup of coffe and returned to the hotel about 1.5 hours later. The temporary lobby in the bar/restaurant area (renovations in the actual lobby) was absolutely packed with new arrivals waiting for their rooms. To make a long story short, we waited 4 hours to get a room and didn't get that one unitl I spoke to a Manager about the situation.", "user": "Andrew2001", "date": "July 30, 2007", "id": 8256820}, {"rating": 5.0, "title": "I loved this hotel", "text": "Luckily, that was the only negative we experienced. There were room and lobby renovations going on, but there was no noise to speak of and the work did not affect our stay. The room was a renovated one on the 8th floor with a patio and facing Las Ramblas. It was good size for Europe, modern/clean and verything worked fine. The location of the hotel was perfect for sight seeing and the staff was very helpful. They really don't have a concierge as such but use the front desk people in that capacity. They were helpful and very friendly. The buffet breakfast was teriffic (well stocked at all times) and the breakfast help were responsive and friendly. We ate two meals in their restaurant and it was o.k., but not great.", "user": "ellie0916", "date": "July 20, 2007", "id": 8203218}, {"rating": 5.0, "title": "ramble on the ramblas", "text": "We wound up having a great stay and would recommend this hotel to anyone.", "user": "Ratty-and-Mole", "date": "July 12, 2007", "id": 8105488}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "We decided to have a few days in Barcelona with friends, and got a good deal at Le Meridien, attracted by its location on Las Ramblas and the official 5 star rating. I was wary about the previous reports on refurbishment, but it sounded substantially complete. On arrival, we found that the main reception and lounge area was being re-developed, and so had to use a temporary reception. This gave a poor impression of the hotel overall. The temporary reception was very busy and crowded with suitcases etc of those checking out, or waiting for transport. Our room was initially not ready, but after a walk around the area, we were allocated our room. This had been fully refurbished in a modern, minimalist style, and the bathroom, although very smart, had a large shower area but no bathtub. The view from the room was of the back of some appartments and offices opposite. We did not have dinner in the hotel, but had a couple of drinks in the lounge, which offered good service, but high prices.", "title": "Currently not a 5 star", "helpfulness": 4, "user": "Durhampuma", "date": "August 20, 2007", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8456617, "likes": {"liked": "— Comfortable and quiet", "disliked": "— No Bathtub in room"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "Breakfast was included in our package, and was very varied and tasty, with some egg dishes cooked to order. Unfortunately on the last morning, the overnight thunderstorm had caused the flat roof above the breakfast buffet to leak, resulting in water dripping through the still live light fittings - not a very safe situation!", "title": "Great hotel in perfect location", "helpfulness": 2, "user": "sftmars", "date": "August 17, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8444648}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Overall the hotel was disappointing, and it was difficult to see how the 5 star rating was justified, even if the refurbishment was disregarded, and if staying in Barcelona again we would certainly look at other options.", "title": "Highly recommend Le Meridien Barcelona", "helpfulness": 4, "user": "tootsiemontreal", "date": "August 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8383427, "likes": {"liked": "— cleanliness, location, service", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "My wife and I spent the end of our honeymoon at the Le Meridien in Barcelona. The downside of our trip - the hotel's main lobby was under construction. That was the ONLY downside. The room we got was excellent - it was not huge, but clearly recently remodeled with a very modern bathroom and a great bed. VERY comfortable room. The hotel location is ideal for a short trip - very near the Gothic quarter for exploring. On the Ramblas. The concierge booked us into an incredible restaurant (La Dama) for dinner - superb experience. Highly recommended.", "title": "What a disappointment!", "helpfulness": 3, "user": "ramgad", "date": "August 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 5.0, "value": 2.0, "location": 5.0, "rooms": 1.0}, "id": 8374060, "likes": {"liked": "— nothing", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "I absolutely loved this hotel and Barcelona. It is located right on Las Ramblas which is a great street with plenty to see and do. There are restaurants and little shops all around the hotel within walking distance.", "title": "What a great hotel!", "helpfulness": 2, "user": "mem2699", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8101401}, {"rating": 1.0, "title": "How to ruin your trip", "text": "If you want to ruin your trip to Barcelona, stay here.", "helpfulness": 4, "user": "GlobalTraveler100", "date": "November 30, 2007", "id": 11163615}, {"rating": 2.0, "stay_parameters": "Stayed November 2007", "text": "It is highly overpriced, rooms are small and dark,services are inferior, and the staff is rude and unhelpful. It starts at the curb, where you can struggle to get your luggage out of a taxi on the cramped side street, as the doorman stands still and watches you. (And then expects a gratuity) I had reason to approach the front desk 3 times during my stay. Each time I had to wait behind other couples who were filing complaints or trying to check out early and go somewhere else. The web information is highly misleading and misrepresents the ranking of this hotel. Staying here makes you feel ripped off, and casts a palor over what ought to be a great stay in a fabulous city.", "title": "Great location. Disappointing hotel", "helpfulness": 2, "user": "KWhis", "date": "November 28, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 5.0}, "id": 11128113}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "I'd rather sleep in the park.", "title": "Excellent!", "helpfulness": 2, "user": "BVsmurfette", "date": "November 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 11121571}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "This hotel is in a great location right on La Rambla. The hotel itself was disappointing. The lobby still isn't finished. The desk staff was totally unhelpful when we asked questions about directions or sights. The rooms were very small, but they were modern and clean. Luckily we were using Starwood points. Otherwise this hotel was not worth the rates it charged.", "title": "Excellent Barcelona Hotel", "helpfulness": 1, "user": "MKristian", "date": "November 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10889260}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "Amazing location - right on La Rambala.", "title": "Wait until the construction has finished - 3 star", "user": "LiamDublinIreland", "date": "November 16, 2007", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 10859083, "likes": {"liked": "— Friendly Staff", "disliked": "— Construction Noise"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "This hotel is in a perfect location on La Rambla!! In addition to that the service was excellent and everyone spoke perfect english. The rooms have just been upgraded and offer very comfortable beds and", "title": "Great hotel with great value!!", "helpfulness": 2, "user": "pjs17", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7836058, "likes": {"liked": "— the rooms were recently renovated and the hotel was a great location", "disliked": "— the on premise hotel dining was very expensive....a grilled cheese cost me 20 bucks!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled as a couple", "text": "big screen plasma tv's in each room. The bathrooms were also very nice, ceiling shower was very relaxing the bathroom was very spacious", "title": "Great location", "helpfulness": 2, "user": "brown258", "date": "June 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7729359, "likes": {"liked": "— The location on LaRambla", "disliked": "— The room size could have been larger. Really, everything was satisfactory."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "unlike most european hotels.", "title": "Good Hotel, Great Location", "helpfulness": 2, "user": "jj7654", "date": "June 1, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7728891}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "I was traveling with a 2 year old and a 7 months old, which led them to offer me a suite for lower than the standard rate so we can all fit more comfortably. I had to pay for upgrade but it was a great rate and it was well received.", "title": "Location!", "helpfulness": 1, "user": "NYTraveler021", "date": "May 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7715979, "likes": {"liked": "— location", "disliked": "— no gym at the hotel and no outdoor pool area"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled solo", "text": "There is a park around the corner if your traveling with kids and they offer free internet service in the lobby to check email and browse the web. I don't know if its every hotel in spain which the staff is so nice, but this over achieved my expectations.", "title": "Loved the Barcelona", "user": "Gougy", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7707448, "likes": {"liked": "— Location and supermodern rooms"}}, {"rating": 5.0, "title": "What a Great Hotel", "text": "We had a great stay at this hotel. It is in a wonderful location, right on La Rambla, but that also made it noisy and our first room was right on the street. So, after the first night, we asked for and got a very quiet room at the back.", "user": "GinOaklandCA", "date": "March 29, 2008", "id": 14621699}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled solo", "text": "The decor and amenities were very, very nice, including robe and slippers. Beautiful bathrooms, too.", "title": "Great rooms", "user": "CCQueenAnne", "date": "March 8, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 4.0, "location": 4.0, "value": 4.0, "rooms": 5.0}, "id": 14142766, "likes": {"liked": "— Great location, comfy bed, great bathroom", "disliked": "— Street noise, expensive"}}, {"rating": 5.0, "title": "hip hotel on ramblas", "text": "We love our internet and the business center was open 24/7 with free high speed internet.", "helpfulness": 1, "user": "travelfan84", "date": "February 25, 2008", "id": 13845841}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "I would highly recommend this hotel.", "title": "Great Rooms, Great Service, Convenient Location", "helpfulness": 3, "user": "linbay", "date": "February 25, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 13826424, "likes": {"liked": "— Comfort", "disliked": "— None"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "If you want to stay on La Rambla, this is an excellent hotel choice. My room was on the small size, but not tiny as some European rooms can be. The decor was very hip and the bed extremely comfortable. The bathroom was great with an amazing deep tub and rain-style shower - plus a TV in the bathroom so you could watch as you soak (though the only English channels are news and sports).", "title": "Very nice, Great Location", "user": "tjjlucas", "date": "February 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 13438655, "likes": {"liked": "— The comfy beds", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Well the hotel was modern and new but the service was terrible. I checked in to be given a smoking room wrong standard I complained and asked for correct room and the manager told me if I did not like it to leave. I eventually got what I asked for the next morning. Moved rooms and when I arrived back after a day sight seeing and the sheets had not been changed and the room had not be cleaned properly. Day 3 came back and 3/4 a bottle of Moet had been dumped by the maid without my permission. When I complained and asked for the champagne to be replaced they did not want to do it.", "title": "Worst Service", "helpfulness": 4, "user": "leeabbey", "date": "August 28, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 1.0, "cleanliness": 1.0, "rooms": 3.0, "location": 2.0}, "id": 8522355}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "To be honest if I had a problem instead of being accomodating the staff wanted to have the last word not find me a solution. Dont forget this is meant to be a 5* hotel!!", "title": "Great Location", "helpfulness": 1, "user": "AtlantaSingle", "date": "August 25, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8501900, "likes": {"liked": "— Location", "disliked": "— Hectic Front Desk"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed at the hotel July 7-8, 2007 and found it to be a great property. I booked a standard room with Starwood points. It wasn't ready by the time they promised so they gave us a much larger room with a huge balcony overlooking las Ramblas. It wasn't a remodeled room, but still very nice and spacious by European standards. The front desk staff was extremely friendly and helpful with restaurant recommendations and reservations. It's in a great area right on las Ramblas, but beware it is very crowded with tourists in July. Overall I would definitely recommend this hotel for a stay in Barcelona.", "title": "Great Hotel & Location", "helpfulness": 2, "user": "Chicago_ILUSAChicago", "date": "July 11, 2007", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 5.0, "value": 3.0, "rooms": 4.0}, "id": 8100881, "likes": {"liked": "— Location and Staff", "disliked": "— Area very crowded with tourists"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "I stayed there in April on points and am a platinum starwood member. All the reviews have been so great but I do want to tell my tale of woe as a word of caution. I felt very sorry for the staff as they dealt with one disaster after another and seemed quite embarrased..", "title": "maybe my individual tale of woes?", "helpfulness": 2, "user": "racb", "date": "June 15, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 7853718}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "1) Disaster 1: The first room was a suite and when we arrived there was a problem with the electronic lock-- no key but the hotel master key could open it. It was supposed to be fixed the following day but was not. I finally had to really push to get a hotel manager to see the lock who then apologized and quickly moved me to nice room with a balcony view", "title": "Great style & location", "helpfulness": 2, "user": "CBCarveth", "date": "June 12, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7841872, "likes": {"liked": "— Very comfortable room, great location", "disliked": "— Due to narrow street the view of Las Ramblas is limited"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "This hotel is located in the perfect location. It is on La Rambla which is one of the main roads in Barcelona. We were able to walk almost everywhere from the hotel which saved us a lot of money on taxis. The hotel is modern and since it is in a city the rooms were small. We had wished it had a pool to sit at like some of the other Barcelona hotels because the weather was beautfiul. The staff at the hotel were wonderful helping us to select restaurants during our stay. We would highly recommend eating at Rosa Vinya. It was a small restaurant that wasn't touristy and the food was amazing.", "title": "Be alrert! Unbelievable poor customer handling!", "helpfulness": 1, "user": "MuiMuiHOngKong", "date": "May 22, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 7671688}, {"rating": 4.0, "stay_parameters": "Stayed September 2005, traveled with friends", "text": "I loved Barcelona and the stay at Le Meridien was a good choice too. Perfectly located at Ramblas (the entrance to the hotel is from side street) and even they were going renovations on I founded my stay just fine. The hotel architecture fits into this part of town but inside the rooms are from 21st century. Ultramodern and incredibly clean - love this. Loved the raishowers - was in my room as well as in the second room we had - corner suite. Large plasma TV and smaller LCDs in bedroom and bathroom were fine as well as small blue nightlight operating when you go to the bathroom at night - cool:). Have not triyed breakfast the coffee from Starbucks next door was fine to go and explore Barcelona.", "title": "Excellent Location!!!", "user": "Bev72", "date": "May 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7605537, "likes": {"liked": "— location", "disliked": "— That we didn't get to stay longer than a weekend."}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "There were many options for the return trip to Barcelona - but the budget didn't accommodate a return to the Hotel Arts (too bad fur us) but fortune smiled on this trip and we spent three nights at the Le Meridien Hotel, smack dab in the middle of why folks go to Barcelona in the first place - the street scene and energy of La Rambla. Located towards the top end of famous pedestrian boulevard and a two minute walk to Plaza Catalunya - the vortex of all transportation options - and facing a side street a block from the famous Boqueria Market - the Meridien turned a great stay in the city into an outstanding memory. Rafael at the front desk, backed up by Brendan and our pal Rauol at he bar - the staff could not have been nicer - first name basis nice.", "title": "Winner in Barcelona", "helpfulness": 1, "user": "truefeedback", "date": "February 3, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 13236201, "likes": {"liked": "— style"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2008, traveled as a couple", "text": "Our room at $245 euros per was on the fourth floor in the rear away from the potential street noise of late night Barcelona. A Starbucks in the builidng next store helped immensely as there is not anything open when your starting an \"early morning\" walk on American time .", "title": "Not a 5 Star", "helpfulness": 1, "user": "cba50", "date": "January 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 4.0, "rooms": 3.0}, "id": 12783986, "likes": {"liked": "— location", "disliked": "— overpriced and over-rated"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Hip decor, clean lines, flat panel electronics, quality bed linens and the most magical shower head I have ever experienced characterized the hotel. I never believed all the hype about \"sunflower shower heads\" but the Meridien had one in our bathroom and it was indeed magical in its power to reinvigorate the most jet lagged tourist. Our room had an ante-room outside the bedroom, a likely left over space from a renovation one year ago. The added square footage made for a splendid feel to the room.", "title": "The Center of it all in Barcelona!", "helpfulness": 2, "user": "SisterMoon_8", "date": "January 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 12364144, "likes": {"liked": "— Restaurant, Large Bathrooms and Views from our deck, comfy beds!"}}, {"rating": 4.0, "title": "Good Experience", "text": "For us the location, amenities, compactness of the facility and a staff that performs at the level you expect - and beyond - the Meridien was a true winner for us in Barcelona's Gothic Quarter area.", "helpfulness": 1, "user": "atllocal", "date": "January 4, 2008", "id": 12328887}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Just returned from 4 nights in Barcelona, 3 spent at Le Meridien.", "title": "Great Location", "helpfulness": 1, "user": "fgnewyork", "date": "December 31, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 12135684, "likes": {"liked": "— Upgraded to suite", "disliked": "— Rude check in staff, unknowledgeable conierge staff, under renovation"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "I stayed at this hotel while on vacation. My room had been upgraded to a room right on Las Ramblas. Considering how many people were walking in front of my room, my room was quiet. The room is indeed very small as others have noted, but I have stayed in smaller rooms in NYC. The room was dark, but thats not a problem for me. If I had to put makeup on everyday I could see that being a problem. The shower had drainage problems. Despite the fact that I speak Spanish and explained the problem to the staff twice, nothing was done to resolve the problem. I had to shower in a pool of water at my feet every night... and once I had been in the shower for more than five minutes... the water would flow into the main bathroom... not pretty. The workout facility was under construction while I was there, but passes were given out to a local gym. The local gym is very nice but was a nice ten to fifteen minute walk away from the hotel. I love my starwood points so I might consider staying here again, but otherwise, its just a nice hotel with a great location. Nothing really special about the hotel or the staff. However, the location can not be beat... its perfect for someone who wants to see Barcelona.", "title": "Nice Hotel", "helpfulness": 3, "user": "avillebud", "date": "December 21, 2007", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 11883530, "likes": {"liked": "— Location", "disliked": "— Pool of water at my feet in shower."}}, {"rating": 5.0, "title": "Wonderful hotel in Barcelona", "text": "A wonderful business hotel with friendly staff and a great location. My hotel room was one of the best I have ever had, complete with large balcony. I enjoyed my stay and can recommend this hotel. Construction work for a new lobby was well managed. Mark, Switzerland", "user": "MarkCDavies", "date": "December 17, 2007", "id": 11631360}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The location is just perfect, on the Ramblas next to the Barrio Gotico and with a street buzzing with people and shops. We had been advised that the lobby was under renovation prior to our arrival. I must say however, it was very discreet and we never saw any workmen around, it was clean and not noisy at all. The reception has been discretly placed in the bar provisionally, so you can have a drink while you check-in/out. Had a wonderful \"Mediterranean\" suite with the most amazing bathroom and jacuzzi! The variety at the buffet breakfast is very good. We liked the touch of a teddy bear with a small card saying \"Please bear with us during the renovation\". Highly recommended!", "title": "Excellent, considering the circumstances", "helpfulness": 1, "user": "KatyaLisbon", "date": "December 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 11547022, "likes": {"liked": "— Location", "disliked": "— No long mirror in room"}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This is a nice hotel, in a great location. They are doing construction, but that really wasn’t an issue as we were typically out and about while the noisy stuff was going on. I was told it would be completed by the first of December, but trust me, they weren’t close when we stayed there. Some guests were demanding they be moved to another hotel. Overall for the price and rating, the property should be better. The personnel were, uh, okay. Mostly good. But, they should have been great. They suffer from that ugly syndrome many properties suffer from. They mistakenly think their discussions with fellow employees and following procedures trump the needs of their guests. The room was cool, but tiny. It had weird motion lights. Great when they worked properly, annoying when they didn’t.", "title": "Great location, nice hotel", "helpfulness": 1, "user": "Trav1964", "date": "December 14, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 11545746, "likes": {"liked": "— The location", "disliked": "— The construction"}}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "This hotel is right on La Ramblas, so the location is perfect if you are new to Barcelona. If you aren’t a quieter option over in the Gothic area might be preferable. If you do spend time walking down La Ramblas, enjoy the spectacle, but keep your wallet safe. Don’t give money to anyone for anything (okay, maybe a mime or two). Most locals are trying to scam you. We watched tourist after tourist get taken by the shell game…gees, the oldest scam in the book.", "title": "Very disappointing - do not recommend to anyone", "helpfulness": 3, "user": "LLT1", "date": "December 4, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 11245755}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "We spent 1 night in the Le Meridien Barcelona after a cruise. The location in the middle of La Rambla could not have been better as you can walk to all the good areas from this location. I asked for an interior room to be more quiet and it was very quiet. The room was large, comfortable and ultra-modern decor. The beds are huge by European standards and heavenly to sleep on. The only draw back was the lighting that seemed complicated and hard to figure out. The airconditioner was making noise at night so I had to turn it off so I could get some sleep. My advice is to always bring earplugs when you travel. Great shower and even has a TV in the bathroom. We used points to stay in this hotel for free but other than that is is probably around $500 a night. A real treat for us and a great way to enjoy our last day in Barcelona before returning home. The airport is only a 20 minute taxi ride away....I would highly recommend staying in this hotel.", "title": "Best Location in Barcelona & Best Bed!", "helpfulness": 1, "user": "ROSEOC", "date": "October 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10034617, "likes": {"liked": "— The location and the bed", "disliked": "— The lighting in the room"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Modern rooms, very sleek decor,great bathrooms. Rooms have flat screen TVs, comfy beds. Didn't eat at the restaurant with all the wonderful tapas bars around.", "title": "Le Meridien on La Rambla", "helpfulness": 1, "user": "whitem21", "date": "September 29, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 10016658, "likes": {"liked": "— It's on La Rambla, near the tour bus hub, you can't beat that!", "disliked": "— No pool, no gym, no rooftop lounge."}}, {"rating": 2.0, "stay_parameters": "Stayed September 2007", "text": "The bar to the right as you leave the lobby was very local, friendly and good late-night food or early morning as it may be.", "title": "Wait till Constructions Finished!", "user": "carolboca", "date": "September 23, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 8864697, "likes": {"liked": "— Helpful staff, good restaurant", "disliked": "— Bathroom design"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled solo", "text": "No concierge, or, if there was they were never around, but the staff speaks English pretty well and has maps.", "title": "The best i've found in Barcelona", "helpfulness": 1, "user": "dokanman", "date": "September 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8713086, "likes": {"liked": "— Room, room service, location.", "disliked": "— Nothing to mention"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Don't get me wrong, nice and reputable hotel brand, but I would rather have stayed at the hotel across the street Hotel 1898. Much more character, rooftop pool and lounging area, beautiful rooms.", "title": "Great location, ultra-modern room", "user": "Drifterbytrade", "date": "September 12, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8703009, "likes": {"liked": "— Location, quality of room", "disliked": "— ongoing renovations made reception difficult"}}, {"rating": 4.0, "title": "If it suits your budget then do it.....", "text": "Our hotel room was beautiful and had a great view of La Ramblas. The bed was the most comfortable bed I have ever slept in and the location was excellent near shops, great cafes and restaurants and only a 10 minute walk to the beach and marina.", "user": "Lady_SpitfireKent_UK", "date": "May 12, 2007", "id": 7592352}, {"rating": 5.0, "title": "Location, location, location!", "text": "I can't fault this hotel - it was perfect.", "user": "blubs99", "date": "April 30, 2007", "id": 7486569}, {"rating": 4.0, "title": "Perfect Location!", "text": "Stayed in a Junior Suite in April for a long weekend. We asked for one of the refurbished rooms and we were not disappointed. Room had a main bedroom and a seperate lounge in which my son had a sofa bed. Both rooms and the bathroom had a TV. Bathroom was very modern and at night blue lights lit up automatically from the bedroom and lounge to guide you to the loo........ :)", "user": "blue_who", "date": "April 21, 2007", "id": 7405778}, {"rating": 4.0, "title": "Great location, great service, suites a little worn...", "text": "Although on the first floor the room was very quite if the windows were closed and Yes the air conditioning was working!", "user": "reviewguy", "date": "April 2, 2007", "id": 7269744}], "location": {}, "stars": 5, "variance": {"poor": 60, "average": 138, "very good": 460, "terrible": 30, "excellent": 575}, "aka": "Le Meridien Barcelona Hotel", "slim_ranking": 0.146946564885, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.0, "location": 5.0}, "description": "Elegant Downtown Hotel close to business area & all major tourist attractions."}