{"user_rating": 5.0, "review_count": 43, "name": "Le Petit Hotel des Hortensias", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "La Trinite sur Mer is a delightful seaside village dedicated to sailing and the Petit Hotel des Hortensias fits the nautical theme perfectly. The hotel building is an old granite pile of 3 stories like so many of the Brittany seaside villas. It has been decorated with great charm and nautical style (residents of Nantucket or Martha's Vineyard would feel very much at home). Rooms are comfortable with a nice, homey feel and the downstairs sitting rooms actually feel like a private seaside home. Add to all this traditional charm, a modern wooden deck and a fun restaurant serving all manner of seafood and a view of sailboats in the harbor and you have the makings of a perfect, relaxing seaside retreat.", "title": "Nautical charm and style", "user": "FloridaTravelmum", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36915628}, {"rating": 4.0, "stay_parameters": "Stayed August 2007", "text": "Breakfasts (not included in the lodging price but worth the extra charge) on the deck overlooking the harbor and watching the young kids take off for their sailing lessons were a real treat and a great way to start a day. We like nothing better than seaside villages of charm with just enough activity to hold your interest. La Trinite sur Mer furnishes all of that (and some pretty good shopping and dining options) and Petit Hotel des Horensias is the perfect place to stay in order to soak it all in. Natalie, the manager, saw to our comfort and seemed like a friend or neighbor stopping in to visit us in our own seaside villa. We loved this place and would return in a heartbeat.", "title": "Little Hotel in a beautiful seating...", "helpfulness": 1, "user": "margarida", "date": "September 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 20351635, "likes": {"liked": "— the location,the breakfast and the different decor", "disliked": "— The room was not the one that I booked"}}], "location": {"country": "France", "region": "Brittany", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 10, "terrible": 0, "excellent": 33}, "aka": "Le Petit Hotel Des Hortensias La Trinite-Sur-Mer, France - Brittany", "slim_ranking": 0.2, "description": "Litlle Hotel ideally located on the port of la Trinité sur Mer, South Brittany. Only 6 charming rooms, all different and recently redecorated with smooth material. The rooms widely open on the port. All are very spacefull, bathroom, free WI FI, telephone...You can have lunch and dinner in the restaurant l'Arrosoir, where a fine cooking is served.A \"feel like home\" place, unique location in la Trinité sur mer"}