{"user_rating": 4.0, "review_count": 3142, "name": "Le Parker Meridien New York", "reviews": [{"rating": 3.0, "title": "Mixed feelings on this stay", "text": "I stayed at the Le Parker Meridien the week of July 4th for a two day biz trip. I have stayed at this hotel several times over the past three years as it is close to my company's Corp offices in midtown manhattan. However, this was the first time I have stayed more than one night. Check In was fine but the hotel is having some construction around it and my room was adjacent to some major noises. I requested a move which I had to defend requesting for several minutes before the front desk moved me to a higher floor. The second room had a poorrly performing,old and crusty air conditioner vent that was wheezily keeping about 25 % of the room cool. While the room was comfortable and clean, my sleep was not pleasant due to the room's warmness over two July nights. Because of the tone received after my first room chnage request, i chose go tough it out since i knew id be out of the room most of the daystime.The room also had a residual cigarette smoke smell evn after being cleaned. Despite the hotels proximity for my business, I don't plan to stay there again. I didn't feel that feel that any effort was made to perk me as a longtime SPG member and was surprised by the initial pushback to the room change request.", "helpfulness": 1, "user": "Farmerica", "date": "July 8, 2011", "id": 115168750}, {"rating": 1.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "This is my first review here on Tripadvisor and I have had hundreds of very successful stays at hotels all around the world. So it saddens me to have to write this, but I really want to warn future potential guests.", "title": "So unhappy - was bitten multiple times, hotel refuses responsibility. Stay at your own peril.", "helpfulness": 9, "user": "feathermeow", "date": "July 7, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 4.0, "value": 1.0, "service": 1.0}, "id": 115134982}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I stayed here over a weekend in July - the hotel was OK - the bathroom was a little dirty but otherwise the stay was fine. I am an SPG Gold and received nothing in comparison to what I receive typically from Hyatt and Hilton (am Gold/Diamond status). I stay in NY at various hotels probably once a month or more.", "title": "Wonderful!", "user": "ClareMethven", "date": "July 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115126697}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "As we were leaving the hotel, I noticed HUGE bug bites, all over my legs, upper chest, and even on my face. I first went to the concierge to try to get some resolution, with no response - was just told to call the customer service line. So I had to check out with these huge bites all over my body...on a six hour flight (just look at the photos). I had two huge bites on my face..and I am getting married in less than a month. Can you imagine the stress?", "title": "great hotel we will be back", "user": "gidoc3", "date": "July 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 115126593}, {"rating": 2.0, "title": "\"Great staff\" Mean Management!!", "text": "So long story short...I have called the SPG customer service hotline...communicated with Le Meridien..who have said that they had the room checked and there were no bugs. They ever so kindly pointed out to me all the times that other customers were wrong, and wanted to help me clear up \"my misconception\". They offered that even though I was clearly wrong, they would give me free water and treat me like a platinum on my next trip there - basically telling me that as compensation, they would treat me like how I am already treated at EVERY OTHER HOTEL CHAIN. Can you believe this?", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 7, 2011", "id": 115118115}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Loved the location. Close to subways and right behind Carnegie Hall.", "title": "Great location. Really nice rooms.", "user": "Kerry J", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128474140}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Le Parker Meridien is my hotel of choice when in NY. It has a fantastic location, great rooms and rates and many of the employees are there from trip to trip.", "title": "The Only One", "user": "ten4tman", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 128472381}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Nice hotel. Stayed a few times in the past and was always superior...until recently. Room furnishings were tired and dated, and electronics were poor. Regular TV reception was very poor (no HD or I-pod player). Spent alot of money on an upgraded \"Park-view\" room, only to be staring at a construction crane. When I tried to move, there was nothing left..and no adjustment of our bill. Also spent alot of money on room service for diner and breakfast, which was mediocore at best. But the worst part was being charged a fee to use the hotel pool. I have used this pool many tmes without being charged, so when the front desk advised me of this charge I couldn't believe it. For the amount of money that this hotel charges for everything, to charge to use the pool is unconscionable. If you have a choice, stay somewhere else and save some money.", "title": "Nickel-and-Dimed", "helpfulness": 1, "user": "Michael N", "date": "April 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 128447644}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Checked in last week and had read reviews that the staff was unfriendly. So untrue. Anandi Nellore helped us check in and then called the room to find out of all was ok. I said the view of Central was spectacular but that the room was quite small. She called back a short time later and said that she would move us to a suite the next day. The hotel to fully booked our first night. The suite was great.", "title": "Great front desk service", "user": "dpacker", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128444968}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "All of the staff were friendly, helpful and bent over backwards to be of assistance. I was handed an umbrella as I walked out of the hotel into pouring rain.", "title": "Ok Hotel - Not top notch", "user": "freq_traveler09", "date": "April 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 128443102}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled solo", "text": "I like the style of the room. It's not super fancy but simple and neat. My room was also quite spacious for one person. The bad thing about the room is that it was a bit old. You could see scratches on the bathtub and the safety. The TV also looked very old and worked slowly, I had to wait for the TV to respond after pressing the button on the remote control. The A/C didn't work well, too. I gave up and turned it off. There was no coffee maker in the room, so I had to order a 16 dollar room service coffee the first morning.", "title": "good location, the hotel is a bit old", "user": "Liang-yu C", "date": "April 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128146408}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The location of the hotel is excellent, close to the central park and the subway stations.", "title": "Good location", "user": "Kayakgirl55", "date": "April 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128133740}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Stayed one night on a theater trip with family. Arrived at noon not expecting our rooms to be ready, but we were able to check in, anxious to get out on a beautiful Sat. afternoon and explore (our rooms were ready at 3 PM, a promised). We able to leave our bags with the bellman, which was great. My daughter needed to change, and we were directed to the fitness area one flight below the lobby. The three overly-made-up women in black tee's who were attending this massively busy area (one person using equipment) seemed flummoxed by this request. I don't know if the hotel operates the fitness center, but perhaps the lovely, friendly and professional front desk personnel could give these employees a few lessons in courtesy. Other than that our room on the 17th floor was quiet and comfortable, the bathroom adequate for our needs and very clean. No views, but we weren't in the room that long to require one. Enjoyed Central Park and some of the local sights. I would stay again.", "title": "Nice location, rooms and top floor pool", "user": "Cara F", "date": "April 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 128129683}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The hotel was a perfect location for a family trip to NYC with kids. Close to theater, the playgrounds in the park, and an indoor pool for a break from the city for the kids. The only big problem was the heat/AC. You cannot adjust it at all. The hotel can turn it \"on\" or \"off\" but that's it. The first night was a hot, sweatly one because we couldn't stop the heat from blowing. Not much sleep that night. The elevators were very, very slow, and the TVs in the elevators weren't working right, but the staff was nice, and the room (we had a suite) worked well for a family of 4. Bell staff was especially friendly.", "title": "Nice hotel, great service, but A/C issues forced upgrade to Suite", "helpfulness": 5, "user": "Tar Heel Bill 92", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 128069950}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I recently returned from a 3 week business trip, and after concluding a business stay at the Hilton Garden Inn/Chelsea I wanted to stay in a nicer, more plush hotel for my weekend respite. I chose the Le Parker Meridien because I am a Starwood Platinum guest and because I'm not a big fan of the St. Regis in New York City. I also got a fantastic rate of $239 per night for a deluxe king room.", "title": "A wonderful birthday trip", "user": "Tavis D", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128069116}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "The pool is fantastic, and the location is good - can walk to the park and walk to Times Square to the shows.", "title": "A Lot of Rudeness!", "helpfulness": 2, "user": "DianeAtlanta", "date": "June 9, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 3.0, "location": 4.0}, "id": 16798832}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The service is close to the worst that I have ever experienced. From the \"incorrect\" information given to us at booking to rude doormen (we carried our own bags in) to a three hour wait for our rooms (not ready until 4:15PM) to rude front desk staff to a manager who could care less about customer service to a housekeeping staff that needed to be called once at 4:30 PM to clean the room and then twice the next day to maintenance staff that \"fixed\" a leaking air conditioning unit (not) to hostile staff at Norma's, I really felt that my presence in \"their\" hotel was a total inconvenience to all of them. These people need to learn that they do work in the hospitality industry, and that a shred of customer service is a requirement of the job. No one actually swore at us or told us to get the heck out of there, but the message was certainly received loud and clear.", "title": "Great Location, Horrible Hotel", "user": "NY_Jayhawk", "date": "June 3, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 16649911, "likes": {"liked": "— View from the roof", "disliked": "— Staying there any longer than to take pictures"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "We had an air conditioning unit that leaked all over the king bedroom of a junior suite to the point that half of the floor was completely soaked. Maintenance came to fix it. It continued to leak. They did not come back. No one offered us a room with a dry floor. We just walked around in \"the swamp bedroom\" for 600$ per night.", "title": "Fantastic Location", "user": "Ronin1512", "date": "May 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 16524546, "likes": {"liked": "— The location", "disliked": "— No problems at all"}}, {"rating": 5.0, "title": "Great stay!", "text": "The view from the rooms is nothing - just other buildings. The only view of the park from the rooms is the trees.", "helpfulness": 1, "user": "mrswh", "date": "May 28, 2008", "id": 16471582}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Norma's is pretty much the epicenter of rude people.", "title": "Won't be staying there again", "helpfulness": 1, "user": "stevekatmart", "date": "May 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 16455894, "likes": {"liked": "— ok location if shopping", "disliked": "— Lack of Hotel ambiance and bland rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "Great property. Location is really great - close to 30 Rock and most of the big attractions. Rooms are designed to make the use of space and have a great setup. My only problem was that the hotel was a little strict about the raging party we threw at 3am on a Saturday. Which was all my fault but they could've handled it better!", "title": "The other side of this Parker is a Spiderman", "user": "Pechorin L", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128421311}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The hotel is well located, has good rooms with clean bathrooms and we enjoyed a wonderful central park view. Staff is efficient, but I would say rather on a distance than friendly.", "title": "Great hotel, but be prepared to pay for anything extra", "helpfulness": 1, "user": "MissKipperella", "date": "April 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128401340}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "As it's not the cheapest hotel in the city, you'd expect to have at least one perk included, like a (small) breakfast, a drink downstairs, a day in the pool or the fitness, free wireless internet, ... but all of these services are fully priced. I know that's common for New York, but to pay for an hour of internet in your room is really not about the friendliness and customer service that is so passionately presented on their website.", "title": "Not all perfect", "user": "George B", "date": "April 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128333508}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "I brought my sister and family to New York for her first time and for her 60th birthday. We stayed 5 nights, received great room upgrades, and the front desk staff and the concierge were wonderful. On our last night, we got back to the hotel in a pouring rain and wanted a farewell night cap. The bar was closed because its ceiling had just collapsed so the front desk suggested a beer in the very downscale on-site hamburger joint. The staff there was very disorganized and rude. We tried to stand in line at the order window to get some beer and were told to sit down and wait for table service. We no one came to the table, we tried to get the attention of a waiter and were told we had to go back in stand in line at the order window. We ended up never getting served, and got no satisfaction when complaining to Food and Beverage Manager Aiske who was also unpleasant and ineffectual. The only choice left to us was a mini-bar drink in the room which was hardly a fitting birthday party. On top of that, only 2 of the 3 elevators serving the hotel's upper floors are in working condition, leaving us with 10 to 20 minute waits every time we wanted to go up or down. Upon checkout, the front desk person asked about my stay and said that considering our experience at the hamburger place the night before, he'd try to waive a $10 workout fee. He checked with the Front Desk Manager who denied the request. No attempt for remedy and quite unusually weak management for the Le Meridien standard!!l", "title": "Nice hotel", "user": "lozmcewen", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128254236}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Fantastic location and overall nice hotel.", "title": "Great Location - good for business but not the place to relax during the day", "user": "Andrew Y", "date": "April 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 128250890}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "Stayed here several times. Love the location. Quiet location but still close to many spots. Very clean and quiet rooms. Great service. I always try to stay at Le parker meridien if available.", "title": "Great hotel. Avoid the Burger Joint.", "user": "CraisyDaisy2", "date": "July 6, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 115104368}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "But stay away and avoid the Burger Joint. Saw it on tv and wanted to try it. Burgers are ok. Buns are ordinary. Fries are worst. Nothing great. The service was the worst. Most unfriendly and rude service I've ever had. The cashier I had was so rude and had the worst attitude ever.", "title": "We loved it and loved the design and layout of the rooms.", "user": "happycustomer77", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115104294}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Hotel recommend but don't bother with the Burger Joint.", "title": "Wonderful weekend getaway made better by the hotel staff", "helpfulness": 2, "user": "cmmnj", "date": "July 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115092152}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "Whoever designed the rooms really put alot of thought into it. Everything was there but a kettle for tea. The bed was really comfortable, great pillows. Loved the built-in window sofa, the desk area, huge walk-in shower and especially the swivelling multi-media centre with extra storage tucked everywhere.", "title": "Absolutely great hotel, loved it!", "user": "nickjoly1", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115068145}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Good, functional design but very nicely appointed. The location couldn't be beat with easy walking access to the best of New York. I am planning on returning soon and will be bringing my aging mother. She will find it very comfortable.", "title": "As always, a great stay at Le Parker Meridien", "user": "workadaddy", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115061517}, {"rating": 4.0, "title": "An interesting experience", "text": "Get rid of the short clips in the elevators and replace them with ads. Ads will much less annoying, and at least they will generate some revenues for you. Re-do the elevators -- they look drab. By the way, re-do the halls for the same reason.", "user": "fredOOL", "date": "June 29, 2011", "id": 114885671}, {"rating": 4.0, "title": "Great location, concierge", "text": "Free in-room internet would be greatly appreciated.", "user": "jag1jag1", "date": "June 29, 2011", "id": 114873775}, {"rating": 4.0, "title": "I will always be one of your loyal guests", "text": "At times, the front desk was overwhelmed -- too few staff at peak times, and there was no separate line for gold and platinum preferred guests.", "user": "chiefejangue", "date": "June 29, 2011", "id": 114854047}, {"rating": 5.0, "title": "Great spot for anniversary celebration", "text": "We have stayed at Le Parker Meridien multiple times over the years. As other reviewers have mentioned, the location is terrific. The concierges are extremely helpful. In particular, Maria, the chief concierge, has given us really good advice and is great fun to talk to. The beds are comfortable, and the rooms are quiet. On the downside, the shower head in our room was broken (though quickly fixed when we called), the handle on the doorknob in the bathroom was falling off, and one of our elevators didn't seem to work correctly one morning.", "user": "Marquism1", "date": "June 28, 2011", "id": 114848234}, {"rating": 1.0, "title": "Bed Bugged", "text": "The hotel is one of the best in NYC. The only problem is lack of a full fledged restaurant for a stylish dinner or lunch", "user": "FairlyFrequentTravel", "date": "June 28, 2011", "id": 114846351}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "Having spent the previous week in downtown NYC, I was keen to stay nearer to the big shopping areas and central park so choose the Parker Merdien. Certainly, the location is in excellent reach of any restaurant, shop or service you could possibly want.", "title": "Alright, but no real personality", "user": "MooHunter", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 18018108, "likes": {"liked": "— Location, location, location", "disliked": "— room size, paying for the gym,"}}, {"rating": 3.0, "title": "Just \"ok\" for NYC.....", "text": "Once in the hotel, the lobby is average, and certainly with few wow factors. in fact, the famous NYC burger joint is one of the unique attractions of the hotel and is purposely hidden away by gigantic curtains....apparently to keep the secret alive...rightio... Actually, the burger was pretty good there, although the cafe is small, cramped and quite smelly - you come out of there smelling like a greasy spoon. We had a deluxe superior King on the 31st floor - a great view and certainly less noise than the lower floors. The hotel also boasts a roof top pool, but seriously, if you are accustomed to hotel pools and like to work off calories by swimming lengths, then this pool will disappoint, as you can't swing a cat in it. There is no hotel gym, but guests are encouraged to use a gym next door which is $10 per day which was rather disappointing; however the gym was good, above average. The room itself was small, but clean and bright. Has a modern design and makes the best of the space - in fact the room contains all the essentials you need in a room, but not luxurious. Bathroom was even smaller - the kind that once you're on the toilet you get knocked off if you want to close the door! The mini bar saga which I read about on a previous review did not catch us out, although to be fair, the check in guy did tell us even if we moved a bottle, our room would be charged. All in all a pleasant stay, but nothing that would pull us back there again.", "user": "A TripAdvisor user", "date": "July 17, 2008", "id": 17994421}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Ok, let's not get off on the wrong foot here, it was a good hotel overall. However, NYC has got some real serious competition when it comes to lodging.", "title": "My Long Lost Love :(", "helpfulness": 1, "user": "ponomo", "date": "July 15, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 3.0}, "id": 17903921, "likes": {"liked": "— Location,Norma's,and the good ol day's of this hotel", "disliked": "— Price,front desk service (mini bar issues)"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "A client of my wife's bailed on the company reservation on a Wednesday evening, so the room was going to go unused. You better believed we hopped right on that! Now we are both born and raised in NYC so even though it was a unique experience staying in the hotel for the night, the whole Manhattan thing was nothing new to us.", "title": "A total ripp off!", "helpfulness": 1, "user": "umanitek", "date": "July 11, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 17795505, "likes": {"liked": "— The location and the room", "disliked": "— The outrageous and ridiculous charges for every little thing"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I personally am a middle of the road hotel guy - HILTON, RADISON, HYATT, etc but my wife has to put clients in higher end hotels, like Westins, Four Seasons and so on. I expected this hotel to be on that level and although nice, clean, and somewhat trendy (like a W), it didn't compare to the other high-end hotels.", "title": "Mini-Bar & Billing Problems", "user": "ProfRS", "date": "July 10, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 1.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 17750399, "likes": {"liked": "— location", "disliked": "— staff service, cost & management of amenities"}}, {"rating": 5.0, "title": "The Parker Meridien: A Great Hotel", "text": "We stayed at the Parker Meridien Hotel for the Fourth of July weekend. It was one of the best times I've ever had in my life. The food at Norma's was delicious, but very expensive. The rooms were very modern and spacious. But the best part of the Meridien is by far the pool. There is a sunbathing deck on the roof, which is great if the weather is good. We had a lot of fun at the Meridien and especially at the pool.", "helpfulness": 3, "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3644358}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled on business", "text": "Stayed at Le Parker Meridien for two nights and were not disappionted. The staff was very friendly and helfpul. Including the maid who cleaned our room after 3pm b/c we both kept coming back to the room at different times, thus not giving her an opportunity to clean it. Also including the man on the top floor who let us into the penthouse to take a peak at the view from the terrace there overlooking central park - and what a view it was - as my husband put it, there is nothing in the world like manhattan - and there really isn't, it takes your breath away from this vantage point (and we lived here for 10 years and never tire of it).", "title": "A great time....", "helpfulness": 4, "user": "Amymow", "date": "July 4, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3634110}, {"rating": 1.0, "title": "Best part was cheking out!", "text": "The rooms were very spacious, clean, modern, trendy. Loved the mirror in the bathroom and the unique center that housed the tv. We thoroughly enjoyed the modern and swank decor. The bathrooms are not large, but this is nyc, you'll rarely get a large bathroom unless you book an outrageously priced suite, it's just the way it is, most buildings were not built with big bathrooms, so don't expect it. The lobby is spacious and unique and we loved the dark hallways with the glowing blue numbers, it felt very clubby. So if you want light family friendly areas, stay elsewhere. Lastly, eat breakfast at Norma's, it was outstanding. Pricey, $60 for two and that was just w/a juice and a coffee, but if you don't mind parting pennies, it's absolutely incredible and unique. I had the most amazing french toast w/a hot caramel sauce and spouse had some incredible mango crepes. To die for. We'd go back just to have breakfast here! If you like modern, suave decor with nice quiet (albeit low light hallways), then this place just might be the ticket for you. Oh, and it's also right next to some of the best shopping ever!", "helpfulness": 9, "user": "Allen19", "date": "June 20, 2005", "id": 3588065}, {"rating": 4.0, "title": "nice hotel, great location", "text": "We are from S. Califorina and have only been to NY a couple of times so we were pleased to find the TripAdvisor. However, my wife thought it would be interesting to try Hotwire and only select the highest rated hotel possible. How could we go wrong? Big mistake! Le Parker Meridian was our surprise hotel and it was without a doubt one of the worst hotels we have ever experienced. Our terrific Hotwire rate of $302 was $302 too much. Mold on the bathroom ceiling, two out of three slow evevators working, hallway that looked like Disneyland's haunted mansion, carpet in the hall that was bumpy, up & down elevator markers that were cut in the drywall and never finished, a view out of our 7th floor room that looked into the wall of some rusty tenement building, small room and smaller bathroom, a bellman that took us to our room and when I asked for ice he said, \"you can find it at the end of the hall\", and never offered to get some. I would be happy to tip well and I aways do. The plus is that we were there only one night and our next night was at the Four Seasons. Thank God. By the way, most of the TripAdvisor reviews were very accurate on Le Parker Meridian but it was too late for me to cancell because once you book on Hotwire you cannot cancell or get a refund. I'll never use Hotwire again!", "helpfulness": 6, "user": "blrn1", "date": "May 31, 2005", "id": 3515201}, {"rating": 3.0, "stay_parameters": "Stayed May 2005", "text": "Spent three nights here last week; really, no complaints. Front desk staff were very pleasant and helpful. Room was very clean. View from rooftop pool was awesome. Burger Joint was definitely worth the wait on Friday afternoon. Location was great -- we walked just about everywhere.", "title": "One or two problems...", "helpfulness": 3, "user": "Cydney", "date": "May 31, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3512624}, {"rating": 4.0, "title": "good stay in a convenient location", "text": "I stayed at Parker Meridien for tow nights on a business trip this past week. I finally managed an upgrade after trying for four years on my annual trip to NYC for an event in April. The 1BR suite was a perfect size and really quite functional for someone who is working, going back and forth to an office during the day in midtown, changing clothes for meetings and evening events, etc. The bathroom was huge and I loved the design of the modern shower. I did not order room service or use the gym or pool on this trip.", "user": "Farmerica", "date": "April 25, 2012", "id": 128622428}, {"rating": 5.0, "title": "Is there a pool in heaven", "text": "I had breakfast both mornings in Norma's and found the eggs \"odd\", there is no other word, each time. They were fluffy in a fake way and seemed to have been coated in some sort of fake butter and still had no real flavor. The applewood bacon was heavily peppered for some reason and almost inedible.", "user": "2Dine4", "date": "April 25, 2012", "id": 128617787}, {"rating": 3.0, "title": "Tired and over-rated", "text": "As mentioned, the larger room really enhanced my stay this time and made the end of my work days highly relaxing. The staff is good and responsive here and there are usually no surprises if you request something from them. My one complaint was the slowness of the elevators; particularly in the morning hours when people are on their way to work or meetings. They really need to upgrade them in some way.", "user": "D j R", "date": "April 25, 2012", "id": 128578352}, {"rating": 4.0, "title": "crazy NYC hotel", "text": "Parker is not my favorite hotel in NYC, but its convenience to my office in midtown and other attractions makes it a mainstay for my trips to the city.", "user": "5Continents3toGo", "date": "April 24, 2012", "id": 128532096}, {"rating": 4.0, "title": "+1 fitness center, +1 rooms, +1 location", "text": "Stayed for several days with grandkids. Fantastic expeerience. Front desk upgraded us to a larger available room. Fantastic city and park views, 2 bathrooms, excellent in room dining service, and the pool on roof which got visited every day - great morning aquasize class; singing Bellman (really funny with grands).", "user": "dbcme", "date": "April 23, 2012", "id": 128493942}, {"rating": 4.0, "title": "Love the Le Parker Meridian!", "text": "Thanks to our wonderful contact in the Sales Dept. and Guest Service agent, Reina, I got a room with a fabulous view of Central Park. Although this is not the first time I've stayed here, the rooms I great a well without the view!!", "user": "Nachi36", "date": "July 5, 2011", "id": 115061498}, {"rating": 5.0, "title": "great room, great rate, great stay", "text": "having read some of the reviews from past guest at the parker i was expecting the worst, all the things i read before checking in at the parker, where not the experience we had! how room was bright and big! true it was not done last year, but it was clean, carpet was good and the bathroom was spotless!", "user": "maxMontreal_Canada", "date": "July 5, 2011", "id": 115060671}, {"rating": 4.0, "title": "Good value stay, good service.", "text": "Good value hotel. Very nice view over the central park. Good central location. Nice lobby and bar, proper rooms, exterior improvable (and currently under refurbishment), very good service. It's not the top of the pops, but the hotel offered a good value for us.", "user": "amdrax", "date": "July 4, 2011", "id": 115015388}, {"rating": 5.0, "title": "Great hotel!", "text": "The location is excellent, within walking distance of lots of stuff, and several subway stations. If you look real close, you _might_ be able to tell that this building is old. Indeed, they have done a really nice job at making everything look both nice and modern. The rooms are definitely well maintained and well designed. If you get above the 30th floor or so, the views, especially of the Park, are really nice. There is a rooftop pool (which I didn't discover until the final day) which might be really good for some vacation exercise. The elevators were slightly rickety, but not so much as to feel unsafe, and they had monitors that were constantly playing Tom and Jerry; someone told us that this was to get people to look up into the security camera. The downstairs restaurant was quite good, and the breakfasts were especially yummy. The bar was small, but with a nice, dark ambiance. In general, the service was great. There was one of the employees at the concierge desk who was rude, in that she spoke to us like we were back-woods yokels. Otherwise, the concierge service was great; they even got us a reservation at Nobu on 57th.", "user": "nhodge", "date": "July 3, 2011", "id": 114998913}, {"rating": 5.0, "title": "Elegant midtown refuge", "text": "Overall, an excellent experience.", "user": "CarolPrinceton_NJ", "date": "July 3, 2011", "id": 114988896}, {"rating": 1.0, "title": "Horrible, Horrible, Horrible", "text": "Undoubtedly the most overrated hotel I've ever stayed at. 5 star prices, 1 star bathrooms and public spaces, 0 star service. Tiny rooms, tiny bathrooms, tired and dirty all in one location. If you are thinking about staying here, don't. If you have a reservation, cancel it. Service was incompetent, negligent and downright hostile. Management was too inept to accomodate for that. Not sure where the \"Soho attitude\" comes from, they work at a toilet.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "July 21, 2005", "id": 3689513}, {"rating": 4.0, "title": "Great rooms, great position - but those lifts!", "text": "Had a great break in New York with two teenage kids who thought the hotel pretty cool. Rooms very spacious for NY and you can walk everywhere. Norma's (it is expensive - we ate there once only), gym (especially basketball court) and rooftop sundeck and pool all great hits. Downs are the interminable waits for the lifts - one was broken all the week we were there - nice apologetic note but no sign of it ever working - and the lack of a bar. Whatever happened to Jack's? Would stay there again however.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 19, 2005", "id": 3683062}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "You expect a lot of special touches from a four star hotel and here there were few. If you want a doorman to help you upon your arrival, enter from the 56th Street, well hidden entrance instead of the 57th St. entrance, otherwise you'll haul your bags through a sea of tourists in the long hall way until you finally come to the front desk. Expect to wait with 6 or seven other groups of people if you want a doorman to hail you a cab on 56th street in the rain, until you give up and go to the 57th street side and get one yourself. Expect to wait, and wait, and wait for an elevator if your room is on the 22nd floor or below. According to frequent business visitors we met while waiting, there is always one elevator out of service. On our first day one out of 3 elevators was in operation.", "title": "Overrated four star", "helpfulness": 7, "user": "tvchickAtlanta_GA", "date": "July 14, 2005", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3664693}, {"rating": 1.0, "title": "Unhelpful", "text": "On the positive side, the view from the pentouse pool is spectacular, the rooms are quiet, the beds comfortable and the location is great, especially if you like to walk or jog in Central Park, attend a performance at Lincoln Center or shop at Bergdorfs.", "helpfulness": 7, "user": "A TripAdvisor user", "date": "July 13, 2005", "id": 3664025}, {"rating": 4.0, "stay_parameters": "Stayed July 2005", "text": "But,the Ritz or Four Seasons this is not.", "title": "Rooftop Makes This Special", "helpfulness": 3, "user": "frozenfamilyof5", "date": "July 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 3655057}, {"rating": 2.0, "title": "Never again", "text": "For approx $400 per night we expected more. The reported fantastic view of Central Park from floor 36 was totally unexpected as it appeared as a small area of distant green trees surrounded and overpowered by high rise buildings with additional views of rooftop buildings either under construction or piled with refuse.", "helpfulness": 4, "user": "normansue", "date": "October 5, 2005", "id": 3995497}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "We travel regularly and this is the only hotel with a bathroom so small that I could wash my feet in the bath and wash my hands in the washbasin whilst sitting on the toilet. However the bed was exceptionally comfortable.", "title": "Parker meridien, great service, good value and pool in nyc", "helpfulness": 3, "user": "andyone", "date": "October 2, 2005", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3983597}, {"rating": 2.0, "stay_parameters": "Stayed September 2005", "text": "The pre arrival booking service help was great and the staff were friendly however whilst Seppis restaurant outside area was a haven for the smoker and it had tables reserved for those who favour tobacco we regularly had to place our order up to four times to get served and had the same problem in trying to get the bill.", "title": "Disapointed!", "helpfulness": 4, "user": "Minkey13", "date": "September 28, 2005", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 3.0, "service": 2.0}, "id": 3945338}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "We will not be returning to Le Parker Meridien.", "title": "Stay here, It's a GREAT hotel!", "helpfulness": 13, "user": "irvin", "date": "September 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3847850}, {"rating": 3.0, "stay_parameters": "Stayed September 2005", "text": "My wife and I took a gaggle (9 total) of teenage girls to celebrate our daughter's thirteenth birthday. Other friends had recommended the parker meridien. I felt that the serviece was very attentive and the junior suites were of a good size. The problems that occured to others are there and should be noted that they may or may not bother one depending on circumstance. We reserved by phone and were upgraded on arrival by asking. We were in the off season with no large groups. The physical plant is wearing, but hte rooms were redone and nice, but no privacy in the suites. All large hotels have bad, cheap rooms especially in this day and age of large groups and hotwire. Don't expect perfection when a large hotel has 200 passenger groups, or your rate is 50 percent off the rack rate. Every business knows its business better than the customer. In a forty story hotel, cheap rooms will be on very low floors. In NYC that means noise. I stayed at other luxury hotels in NYC. If you want excellent service and amenities you will always pay for it. The parker meridien has its pluses- great pool, location, the suites are nice for a family.", "title": "No better than average", "helpfulness": 8, "user": "kydonna", "date": "September 4, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3842183}, {"rating": 5.0, "title": "Le Fantastique but Mucho Dinero", "text": "Le Parker Meridien is the epitome of an excellent city hotel. The rooms have been renovated with modern design and comfort in mind. The health club is one of the best in the city. The restaurants, especially the breakfast experience, is reknown throughout Gotham. However, prices have sky rocketted since I paid $195.00. If you can get this hotel at a good price and want to stay in Midtown, you cannot do better.", "helpfulness": 4, "user": "enofile1", "date": "August 23, 2005", "id": 3800692}, {"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "Visually spectacular, vast reception area, excellent position for sightseeing. Service fine although concierges need to swot up on infomation. twice sent on wild goose chase because of wrong info.", "title": "All front and no knickers", "helpfulness": 7, "user": "polly", "date": "August 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "rooms": 3.0, "service": 3.0}, "id": 3782556}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled on business", "text": "The downside for me was the very simple fact that there was no tea/coffee making facilities. Everyone needs to make a cuppa on waking, and during the day. neither was there a fridge to keep any drinks we might have bought cold. The drinks cabinet was well stocked, but was pricey.", "title": "Spectacular", "helpfulness": 10, "user": "huggings", "date": "August 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3753931}, {"rating": 5.0, "title": "Loved Le Parker Meridien", "text": "This small but inportant detail, would prevent me from revisiting or recommending", "helpfulness": 5, "user": "A TripAdvisor user", "date": "August 10, 2005", "id": 3751336}, {"rating": 4.0, "stay_parameters": "Stayed September 2002", "text": "Great service, facilities, and location. What more can you ask for than a hotel that is clean, stylish, and fun?", "title": "Fab Hotel", "helpfulness": 4, "user": "Kathy B", "date": "July 31, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3724455}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "First off, Ican't believe the most recent review is 2 years ago.", "title": "July 4th a dud.", "user": "jkuryak", "date": "July 6, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 17599244}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "Other than some of the staff who were helpful, our stay was just OK.", "title": "Great Stay at the Parker Meridien", "helpfulness": 1, "user": "K_M_McK", "date": "June 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17138049, "likes": {"liked": "— The sheets on the bed!", "disliked": "— I can't think of a single thing."}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled with family", "text": "I booked thru Priceline and selected a 4 star hotel. I wish a different hotel had accepted my offer. I can't believe this is a 4 star.", "title": "Pleasant stay", "helpfulness": 1, "user": "staceye2003", "date": "June 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 16952574, "likes": {"liked": "— location and space of room", "disliked": "— doormen"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The first room was dirty and they switched us to a different room. Room was OK but overall, the hotel seems tired.", "title": "Can do better", "helpfulness": 1, "user": "Rudders71", "date": "June 14, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 3.0}, "id": 16915696, "likes": {"liked": "— Leaving", "disliked": "— Arriving"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "With all the other options, I would not go back nor would I recommend this hotel to others.", "title": "great location, modern rooms", "helpfulness": 1, "user": "lilbopeep", "date": "June 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16907748, "likes": {"liked": "— location and modern layout", "disliked": "— restaurants always busy"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Everything about this hotel is first rate. If you're lucky enough to get a room with a Central Park view, the experience is sublime. We'll never stay anywhere else in New York City now that we've stayed at the Le Parker Meridien.", "title": "Fabulous hotel!!", "user": "fymi", "date": "May 27, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 16444712, "likes": {"liked": "— management, location, decor"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "We stayed over the Memorial Day weekend at Le Parler Meridien and had a great time. We were somewhat concerned about our stay because of the middling reviews, but were pleasantly surprised. They gave us a free upgrade to a junior suite when we arrived without us requesting, and for a small fee, we were able to secure a small refrigerator for our room.", "title": "Great Stay at Le Parker Meridien", "helpfulness": 1, "user": "ponc", "date": "May 27, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 16426338}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The room itself was spacious for NYC standards, with Scandanavian sleekness, and a beautiful, large shower, and nice bathroom. My wife thought that the bed was one of the most comfortable she's ever slept on. It also had a nice flat-screen television as well as a DVD player.", "title": "Spacious room, good value", "user": "Sunshine2006", "date": "May 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 16408562}, {"rating": 2.0, "title": "Caught them on a bad weekend perhaps...?", "text": "The restaurants are very good - Norma's serves some of the best breakfast fare (albeit at a hefty price tag) in the city, Seppi's has nice French bitsro fare, and the casual Burger Joint features some of the best, relatively cheap burgers in the city (the wait, however, can at times be prohibitive).", "user": "suzeQNYC", "date": "May 19, 2008", "id": 16221815}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "The hotel also features a pool on its highest floor and a decent view of Central Park from its rooftop.", "title": "The Most Perfect Week!", "user": "loubylou89", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16202585, "likes": {"liked": "— EVERYTHING, esp the view of the park!", "disliked": "— The lift to the 38th floor, kinda made my ears pop haha"}}], "location": {"country": "United States", "city": "New York City"}, "stars": 4, "variance": {"poor": 168, "average": 409, "very good": 1142, "terrible": 171, "excellent": 1252}, "aka": "Le Parker Meridien Hotel New York City", "slim_ranking": 0.325056433409, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}