{"user_rating": 4.5, "review_count": 277, "name": "Le Relais du Louvre", "reviews": [{"rating": 5.0, "title": "Location, Location, Location", "text": "This hotel was great. Close to everything. Wonderful boulangerie around the corner and a couple of cafes as well. Other restaurants were not a very far walk. 2 Metro stops very close. The staff was extremely helpful and friendly. The room was a typical European room. Not extravagant, but very clean. I would definitely stay here again.", "helpfulness": 9, "user": "A TripAdvisor user", "date": "February 2, 2005", "id": 3112097}, {"rating": 5.0, "title": "Wonderful as Always", "text": "This small hotel is an absolute find! My husband and I travel to Paris every few months, and of all the hotels we've stayed out (pricey, fairly so, and not so) this one is by far our favorite. Have stayed there 3 times -each time, we've found the staff to be v. friendly and professional, the rooms - while not large - well priced, of decent size and v. clean, and you could not ask for a more convenient location for seeing Paris' sights. Request a room at the front of the hotel, and you will have a wonderful view of the church across the street...", "helpfulness": 10, "user": "menmrsj", "date": "January 19, 2005", "id": 3016588}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "I was wary of what my friend and I would find at Relais du Louvre, given the inexpensive rate for a single room. We were delighted! We each had a single room on the courtyard. Yes, the room is small and the bathroom is very small, but no matter. Each room had ample wadrobe space, TV, mini-bar, writing desk, thick towels, quiet central AC. The hotel is very well kept, nothing shabby around the edges. Pleasant decor and very clean. I had read every review I could find before arriving in Paris - it is true that the entrance to the shower in the signle room is very small - a heavy person would have problems! And the metro does run under the hotel, but did not bother me - and I am very easily bothered by noise. I had coffee each morning in my room - it arrived a minute after I placed the call to reception. We had breakfast at the wonderful boulangerie just down the street. The hotel staff were extremely helpful. Excellent location. We felt very much at home after our 6 day stay. Would certainly stay there again.", "title": "Excellent value in this cozy and charming hotel", "helpfulness": 12, "user": "CapeCodJane", "date": "September 20, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3924718}, {"rating": 1.0, "title": "Not recommended.", "text": "The hotel is in a great location. But so are the many of hundreds of other hotels in Paris. The staff was very friendly upon check-in. but the room was another story. The air-conditioning was not true air-conditioning. just a tiny vent blowing air, not even cool air. The lobby was cool, but our room on the 5th floor was hot. When we inquired about the situation with the hotel staff, they seemed not even interested in dealing with it. They didn't even come up to the room to check it out. I was very dissappionted to say the least. I thought they would of at least of offered us another room. ( the hotel did not appear to be full) Thankfully we were only there for one night.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "August 8, 2005", "id": 3745933}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "We stayed at Le Relais du Louvre May 7 - 13 and were VERY happy with our stay. We were in a triple room and it was much larger than we expected.", "title": "VERY happy with this hotel!", "helpfulness": 7, "user": "amma", "date": "May 15, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3474390}, {"rating": 5.0, "stay_parameters": "Stayed July 2003", "text": "PROS: The staff was EXTREMELY friendly and spoke excellent english. They made reservations at a show and at restaurants for us, which was awesome since we spoke very little french. The room was very clean and and spacious. There was a computer in the lobby with internet access (7 Euros per 1/2 hour). Fantastic location!! 5 minute walk to the Louvre, 5 minute walk to the Metro. Bakery and cafe on the same street as the hotel and many shops and restaurants within 5 - 10 minute walk. Nice mini-bar in the room too.", "title": "Perfect location and service", "helpfulness": 9, "user": "Mari58", "date": "April 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3372746}, {"rating": 4.0, "title": "Relais and Paris are great", "text": "CONS: The shower water was sometimes cold (I assume at times when other guests were also showering). And sometimes we could hear other guests in their rooms talking, watching TV, using the blow dryer....", "helpfulness": 8, "user": "A TripAdvisor user", "date": "February 12, 2005", "id": 3181731}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 3, "variance": {"poor": 3, "average": 19, "very good": 97, "terrible": 6, "excellent": 152}, "aka": "Le Relais Du Louvre Hotel Paris", "slim_ranking": 0.0831009481316, "description": "This charming hotel offers 22 fully renovated rooms right in front of the Louvre Museum (10 rooms have a view on the Louvre Museum). The street is very quiet but located right in the middle of the city. Most monuments such as Notre-Dame, the Louvre Museum, the Opera House, the Champs Elysées, the Pompidou Centre, the Sainte-Chapelle and the Conciergerie but also the Seine river with the Ile de la Cité and Ile Saint-Louis are walking distance. Parking is available and internet is free and unlimited in the whole hotel. The staff speaks many languages fluently and wolcomes you as if you were guest in our home."}