{"user_rating": 4.0, "review_count": 329, "name": "Le Royal Hotels & Resorts - Luxembourg", "reviews": [{"rating": 4.0, "title": "Comfortable without surprises, good or bad", "text": "The hotel is located very close to the retail and historic center, on a rather large road. The rooms are well equipped, but are very common, without any particular charm. Feels like in an Hilton room in the 80s, anywhere in the world (with nevertheless free wifi, something unusual in 5 stars hotel where it is usually overpriced). The staff at front desk is very helpful, quick, nice and efficient. The hotel has a good and varied buffet breakfast. It also has a small in door swimming pool. To sum up: do not expect to be thrilled by the charm of the room, but you will sleep well, eat well and be able to work comfortably.", "helpfulness": 1, "user": "angelbe", "date": "October 27, 2012", "id": 143863978}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Spent a lovely weekend there with my girlfriend. The hotel is very close to the (very small) city centre. I think the hotel was built in the 70s and hasn't received a thorough update since. The rooms look old, the restaurant looks old, the lobby looks old. Only thing that looks new is the pool/spa area! Service was really good, food as well. Drinks in the bar are really overpriced, but come with a nice atmosphere thanks to the piano.", "title": "Little outdated, good service and spa.", "helpfulness": 1, "user": "Amsterdam99", "date": "October 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 143518167}, {"rating": 3.0, "stay_parameters": "Stayed October 2012", "text": "The Piano Bar has a nice atmosphere if you are into 70s hotels and is a big comfortable relaxing place, But the cappuccino is just a 6 euro small white coffee, the tea is obnoxious and the hot chocolate was old...plus service was amateurish. We expected much more of a 5 star hotel, probably best to go there for a whisky and a cigar.", "title": "Not a 5 star piano bar", "helpfulness": 1, "user": "inst", "date": "October 22, 2012", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 143421120}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled solo", "text": "The best thing about Le Royal is the service.", "title": "Superb service at every level - Le Royal is a class act", "helpfulness": 1, "user": "EuVoyager", "date": "October 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 142762764}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Put simply, service at the Le Royal is what you hope all five star hotels could achieve. Every interaction with the staff was professional, kind and surprisingly thoughtful. This was true from arrival in the taxi to the check-out experience. Room service, breakfast all nice; in particular the concierge was a pro. They seem to really have found \"the right people\" in every area. Any special request was handled with aplomb. As a frequent traveller, I was pleasantly surprised to find this kind of consistent service exists in a European hotel. So comfortable I could have moved in.", "title": "A Very Positive Experience", "helpfulness": 2, "user": "Steve W", "date": "October 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 142313468}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed a weekend for the Xmas markets in town and the hotel was very swish, with comfortable rooms and a great selection for breakfast. Only one niggle, for a 5 star hotel to not have a kettle to make hot drinks in the room was a major hassle; I did not take a travel kettle with me so I was quite put out. Would otherwise be a top rating !", "title": "smart place but no kettle :-(((", "user": "veejayw", "date": "December 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 147155985}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "Stayed at Le Royal for one week in November during a business trip my husband had. It was our first time in Luxembourg. Have to say, this was the best choice I could have get.", "title": "Great location, excellent customer service, great hotel.", "user": "mtitus", "date": "November 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146106574}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled on business", "text": "Location:The hotel is ideally located, if you want to walk around downtown to enjoy Plaza D'Armas, shopping on the upscale stores, sightseeing Petrussa, Notre Dame, etc. etc.. Or eating at any of the numerous restaurant around this area. The food was exquisite on every restaurant we try for dinner, it's hard to pick a favorite. The average price on that area for a good dinner is around euros 30 - 50 / person.", "title": "Oldies but goldies", "helpfulness": 2, "user": "Dmitry Z", "date": "November 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145230872}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The Room: Super clean and well kept! -- We stayed at the king suite non-smoking. Have to say for the price we paid, and our culture (american), I was expecting a bigger size room, but the size was fine, enough just for the basic set-up. A small desk with a chair, lounge chair, a queen size bed dressed with delicate sheets and smooth pillows. A 42\" flat HD TV and a small refrigerator. The bathroom has marble floors and walls, one sink, a bath tub with a shower (not recommend it for handicap the tub is quite high), a dryer, an electric outlet with a 120 V adapter, well thought! We saved some money here since we forgot our adapter at home.", "title": "Service, breakfast & location", "helpfulness": 1, "user": "Ljungskog", "date": "November 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 145101274}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We only had one problem in the room, the heather system is standard for the hotel, you are not able to control the thermostat, nor even open the windows, they took the handles out of the window. So, the first night our room was extremely hot, around 77 F, I turned down the thermostat, went to bed thinking the thermostat works... long story short, got up at 1 am, called the reception complaining about the problem, they sent a guy to open the windows for us and we let that window open for the rest of our stay. Maintenance came to fix the thermostat to turn off the heat. They addressed our problem right away. They offer room service twice a day.", "title": "Service on the highest level", "helpfulness": 1, "user": "Trawellangel", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 144717981}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Exceptionally clean and comfortable. Our breakfast was included and started the day off right. Nice selection of cold meats, salmon, cheeses and other items. Attentive staff and efficient. Business center could use a few more machines. Dinner menu is average, but Chef's specials are very tasty.", "title": "Very nice acommodations", "user": "dwalsh9000", "date": "January 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 150038586}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "A decent hotel but only just five star. Royal club rooms are reasonable, with Hermes toiletries, and of good size but have a 1980s feel. Pillows are well below standard, though bedding otherwise comfortable. Queen bed, not a king bed so small if not alone. Good food but both restaurants have outdated decor and need money and talent to instil elegance. Bar is more comfortable. The hotel has one MAJOR problem. It allows guests to smoke in public areas - so I guess the management or the owner is just plain stupid - as the smell of stale cigarettes still pervades as it used to decades ago before the law and common sense intervened to ensure better quality air. This seems to be the best hotel in Luxembourg but there is clearly little competition. A fine selection of wines by the glass.", "title": "A decent hotel, good service, in need of some refurbishment", "user": "JHMH1959", "date": "January 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 149482012}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed here with 3 friends on a short city break for a weekend and we were very pleased.", "title": "Definitely 5 Star - Would Recommend", "user": "matthewjhaskell", "date": "January 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148781371}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "We had superior rooms on the 5th floor and they had everything you could want making a very comfortable stay - including english tv channels.", "title": "Old World Elegance", "user": "LederonUK", "date": "December 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147707612}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "It was close to all of the sights in Luxembourg and the Concierge was very helpful in directing us around.", "title": "A bit below expectations", "helpfulness": 1, "user": "MCMember", "date": "December 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 147506488}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Having last visited the hotel back in the mid-1980s it was good to see that the high standards of yesteryear are still practiced today. Staff are friendly yet professional and helpful. The hotel was a warm sanctuary during a bitterly cold week in Luxembourg.", "title": "Regal stay at Le Royal", "user": "zippyfan", "date": "March 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154866551}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "The rooms are clean and nicely appointed with comfortable and luxurious bedding. I don't agree with reports that rooms need major refurbishment but perhaps a lick of paint in the odd area. A nice touch was the blue ray DVD player which means you could watch your own movies - a plus if the weather is cold outside.", "title": "2nd review - not as positive", "helpfulness": 1, "user": "SF94597", "date": "March 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 154050455}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Breakfast was a real treat and was included in the room rate, otherwise it is €30. There's an extensive buffet to choose from and a good range of items that are cooked to order, all of which can be washed down with a local sparkling wine.", "title": "Old times charm", "user": "MarioRiodeJaneiro", "date": "February 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152705011}, {"rating": 4.0, "title": "Hotel Le Royal Luxembourg", "text": "All in all it was a very relaxing stay. Make sure to use the complimentary shuttle to and from the airport if you aren't driving.", "user": "Vini_55", "date": "February 11, 2013", "id": 151907933}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I have stayed at this property 10 times & first time I rated this hotel, I rated it a 5 - now a 3 - although visit this week a 2. For some reason, on my second visit they provided me a nice fruit basket - not since. I travel to Luxembourg 2-3 times per year & will be trying another hotel next visit. The location is convenient to city center & some of the staff are very good. However, after 10 visits, I do think appropriate to recognize me as a repeat guest -- each time I am greeted with \"have you stayed with us before?\". Some times breakfast is included, sometimes not -- even though I book through same corporate travel agent (if breakfast is not included it is outrageously expensive). There is no coffee in the room & think 5 euros for cup in hotel. I typically go to a local cafe - although in winter, a hassle. Rooms are nice sized, however, getting worn & outdated. Charge for a newspaper. No ironing board. TripAdvisor ratings have dropped in the last few years & I agree.", "title": "Le Royal, so so", "helpfulness": 2, "user": "Giny", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 150385816}], "location": {"country": "Luxembourg", "continent": "Europe"}, "stars": 5, "variance": {"poor": 8, "average": 51, "very good": 119, "terrible": 2, "excellent": 149}, "aka": "Hotel Le Royal Luxembourg City", "slim_ranking": 0.115384615385, "description": "Hotel with traditional furnishings, tasteful decor, fine dining in two restaurants; located in commercial center bordering parks."}