{"user_rating": 4.0, "review_count": 499, "name": "Le Relais du Marais", "reviews": [{"rating": 4.0, "title": "great spot", "text": "We stayed in Paris for three nights at Le Relais du Marais. The room was nice with a good view from the balcony, and the breakfasts were good. It was a good base from which to explore Paris.", "user": "helennewmansa", "date": "October 9, 2007", "id": 10057015}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We booked this because it was in the heart of the marais district, when we arrived we were told that are booking has been changed and we were staying in the \"Le Molay\" around the corner, we also had a friend that booked the same hotel and his booking also got changed. I think that if you want a good hotel book \"Le Molay\" rue de achieves, just minutes from the Gay District. Wonderful.", "title": "Great Hotel, shame we didn't stay there", "user": "Drewbin", "date": "August 15, 2007", "detail_rating": {"value": 3.0}, "id": 8429907}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The best feature here are the friendly and helpful staff. We found Room 51 to be too dark - even though recently refurbished like the rest of the hotel, it was very claustrophobic with only a small window looking nowhere, but the staff did their very best to move us to a front room which they managed for our final night. The front rooms (we had 55) are terrific and the double-glazing means the street noise is not a problem. Breakfast was very good and the cleaning staff also great. With a room fronting the street, we would stay here every time in Paris.", "title": "Excellent hotel", "user": "grey_traveller_7", "date": "August 12, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 8401959, "likes": {"liked": "— friendly staff", "disliked": "— amount of light in Room 51"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "I just returned from a week in Paris and my choice of this hotel was a good one. The are several key elements behind this comment, the first being the friendliness of the staff. Comments about the staff in other reviews here helped me make my hotel decision, and they were all right on point. All of the staff was very positive and helpful, especially front deskpersons Hakim and Lena. Also, everyone speaks fluent English, making requests and questions very easy. All rooms have nice AC (controlled in-room), which is not a given in Paris. Another good reason to choose this hotel. I was worried, however, that the smoking in Paris hotels would find the rooms to be musty and smelling of stale smoke. Not so at Relais du Marais. I'm allergic to tobacco and didn't notice a hint of prior smoke as the room was always fresh and clean.", "title": "Friendly Paris Hotel", "user": "RichNY62", "date": "August 11, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 8393888, "likes": {"liked": "— Staff", "disliked": "— Size of rooms"}}, {"rating": 5.0, "title": "Great Choice", "text": "For American travelers: a warning on the size of the rooms. Having been to London twice and reading and prepping for a first trip to Paris, I knew that, generally, hotel rooms in Europe are small by American standards, so be forewarned. I suppose you could find large rooms in Paris, but you will pay. Keep in mind that this is a two star-plus hotel. It is very clean, however, and all of the hallways and rooms are freshly painted and decorated, with new, good-sized bathrooms.", "user": "CBSCLSVLSNJS", "date": "July 14, 2007", "id": 8116416}, {"rating": 4.0, "title": "lovely", "text": "this hotel is 2 stars but gives you more like 3 ***", "user": "IsraelJoe", "date": "May 7, 2007", "id": 7553778}, {"rating": 4.0, "stay_parameters": "Stayed June 2005, traveled as a couple", "text": "the owner and manager is very kind and helpful, the stuff are kind and all together you get wonderful hotel, clean and nice.", "title": "Hotel With Personality", "user": "tjdibo", "date": "May 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7549727, "likes": {"liked": "— The Staff", "disliked": "— The Location"}}, {"rating": 3.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "the location is very good - you have the metro by walk and you can get allot of lines that take every place in the city.", "title": "Ideal location", "user": "Paul_Ireland", "date": "May 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 5.0, "rooms": 3.0}, "id": 7542014, "likes": {"liked": "— Location", "disliked": "— Traffic noise"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "take this hotel it worth the price", "title": "Clean, friendly and a good location", "user": "allanballan", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 7390896, "likes": {"liked": "— Cleanliness", "disliked": "— The small room"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "My wife and I stayed at this hotel for a week while we were on our honeymoon in Paris. This little hotel was wonderful, great service, very friendly staff and would ask any questions that they could, good buffet breakfast, and the staff spoke very good English. The rooms were pretty small but what european hotels arn't. This hotel is pretty far from the Eiffel Tower and other attractions so I would suggest getting a subway pass to see everything this wonderful city has to offer. This hotel could very easily be a 4* and I would stay here again the next time we go to Paris", "title": "Good Little Hotel", "user": "ChrisF", "date": "April 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 7279783}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We booked this hotel after reading some trip advisor reviews.The room we had was agood size in comparison to other Paris hotels we have stayed in and though it needs redecorating ,it was clean and comfortable with a modern bathroom.Areas of the hotel were being painted and rooms that have not been upgraded will be in the future.The one next to us had been completed and looked lovely.The staff are marvellous-friendly,funny and extremely helpful.The location is good with lots ofattractions nearby and 2 metro stations to choose from.Overall a very pleasant experience.", "title": "A great little hotel", "user": "STARKEY", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 8077046, "likes": {"liked": "— clean comfortable rooms and excellent staff", "disliked": "— decor needed attention"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "I will not bore you with all the details since several others have already covered the important stuff. I will say that we had the best room in the place which is #64. There are three rooms like this that have been renovated and there are plans to continue with the other rooms. If you look at their website you will see the room that we had. I stayed at this hotel for 8 nights with my 16 year old daughter. I would be happy to answer any questions you may have.", "title": "You will not be disappointed!", "user": "kittycat1961", "date": "June 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8023120, "likes": {"liked": "— The Room", "disliked": "— Nothing negative to say"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled with friends", "text": "The Relais is in a great location in the Marais district, close to two metros (Arts and Metiers + Temple) and within walking distance of the Picasso museum. Neighborhood isn't too crazy, and there are great patisseries and grocers nearby. Owner was very friendly and accomodating - upon departure, he got us a cab and white wine while waiting! Rooms are large; a plus to the bed sheets (comfy) and bathrooms (large, with north american electrical outputs!). Highly recommended, and worth paying a bit extra.", "title": "Great Parais Hotel and Location", "user": "EB83", "date": "June 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 8019520, "likes": {"liked": "— Service", "disliked": "— n/a"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "This hotel is a real gem! I stayed there in April with a group of best mates to celebrate my hen weekend. We wanted to be close to all the action, especially the bars in the Marais and the main tourist sights in Paris, and this hotel was spot on for location. The staff were also great, really helpful and friendly. Our rooms all had balconies so we could look out over the street and soak up the atmosphere whilst still getting a quiet night's sleep because there was good double glazing and air con (a real bonus!). At the end of our stay, we all said we'd recommend this hotel to our other friends and family. All in all, superb value and customer service!", "title": "Little gem of a hotel!", "user": "Oxfordite", "date": "June 27, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 8004329, "likes": {"liked": "— Value for money, customer service and location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed here for three days. Like most buildings in the older neighborhoods, it had 5 stories. It has an elevator (small by US standards but large by Parisian standards--easily fits two adults and baggage) which is really important if you end up on the 5th floor as we did.", "title": "Central, friendly, happening", "user": "Sitbone", "date": "June 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7988037}, {"rating": 5.0, "stay_parameters": "Stayed May 2007", "text": "My name is kevin, My partner and I stayed at the hotel relais du marais from May 26, 27 and 28, 2007. We had a great time. What we liked about the hotel was that it was central in the marais area. The hotel was close to the rue du temple metro and the République metro, which connected us all of paris.", "title": "Excellent service, great location and close to bars", "user": "kevinNyc", "date": "June 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7830810}, {"rating": 3.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "I really enjoyed the breakfast and the hotel and rooms where clean. Most inportantly We found the staff to be very helpful. One male staff member who worked over night took the time to go over and mark site seeing locations and direction on both metro and street maps. We would recommend this hotel if you would like to have a comfort and enjoyable stay in Paris.", "title": "Nice budget hotel", "user": "happy_evil", "date": "June 7, 2007", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 3.0}, "id": 7802756, "likes": {"liked": "— cleaness of bathroom, and air condition", "disliked": "— no shower curtain in the bath tub!"}}, {"rating": 4.0, "title": "kind helpfull people", "text": "Kevin", "user": "Monisim", "date": "June 1, 2007", "id": 7728353}, {"rating": 1.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "My friend and I spent 5 nights in the Relais du Marais. Location is good: 2 mins walk to Temple metro station, 5 mins walk to Republique metro station (5 lines of metro). There is a Monoprix and Post Office on the street behind the hotel, which is really handy.", "title": "Never got to stay there.....", "user": "davidwebster300", "date": "May 27, 2007", "detail_rating": {"front_desk": 1.0, "value": 1.0}, "id": 7702580}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with family", "text": "Hotel room in the small size but bathroom is quite big and super clean. It’s quite strange that the bathroom door, is made by frosted glass... It makes the room looks bigger, but I’m not sure that if most people like this idea... There is air condition in the room, or you can open the window. But it’s quite noisy outside so turning the A/C on should be a better idea.", "title": "Parisiens rude??-mais Non!!", "user": "Celiasmith", "date": "May 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7682324, "likes": {"liked": "— The welcoming reception", "disliked": "— Nothing"}}], "location": {"country": "France", "region": "Ile-de-France", "continent": "Europe", "city": "Paris"}, "stars": 2, "variance": {"poor": 17, "average": 67, "very good": 241, "terrible": 6, "excellent": 168}, "aka": "Le Relais Du Marais Hotel Paris", "slim_ranking": 0.248745119911, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}}