{"user_rating": 3.0, "review_count": 18, "name": "Le Sunset", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed July 2005, traveled with friends", "text": "We stayed in a two bedrooms suite/apartment with a another couple, friends of us. The building is located a little far from Downtown, but it had a garage we could use, which was good. The area where it is located is not very good.", "title": "Needs Maintenance", "helpfulness": 1, "user": "Gremio", "date": "July 12, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "location": 2.0}, "id": 8107003, "likes": {"liked": "— Room size", "disliked": "— Cleanliness, condition"}}, {"rating": 4.0, "title": "nice suite", "text": "The building looks like it was very good in the past, but it needs some urgent repairs. The apartment we stayed was very big, but in a very bad condition and not clean at all. One of the bathrooms didn't have the toilet seat, and sometimes it would torn on the light. It was actually funny, when we could get the light on we would try to don't turn it off anymore.", "user": "cwfjmf", "date": "July 6, 2006", "id": 5434079}, {"rating": 5.0, "title": "We liked the suites. I thought it was a little too big. Good price though.", "text": "The balcony from the master bedroom was in very bad condition, it looked like it would fall at any time. The beds were not comfortable.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "October 4, 2005", "id": 3992613}, {"rating": 5.0, "title": "Sunset Suites Montreal was perfect for us ", "text": "There was no room service. Our contact person was very nice. However he would forget whatever we asked him.", "helpfulness": 4, "user": "Christie77777772", "date": "September 12, 2005", "id": 3896398}], "location": {"country": "Canada", "city": "Montreal"}, "variance": {"poor": 2, "average": 0, "very good": 4, "terrible": 6, "excellent": 6}, "slim_ranking": 0.648648648649, "description": "Whether for business or vacation, we offer an ideal solution, with convenient and comfortable fully furnished and equipped apartments for rent.Our furnished apartments are adapted to short-term or long-term stay in Montreal (3 nights minimum). We offer daily, weekly, monthly and also annual rates.Our furnished apartments are spacious, fully equipped and multi-serviced. They provide more space and flexibility than most hotels in Montreal. Rediscover the comfort of home away from home with the amenities of a hotel."}