{"user_rating": 4.0, "review_count": 832, "name": "Le Westin Montreal", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "In time, say 6 to 9 months, this facility may be ready for service. Until then I would", "title": "Not Ready For Prime Time", "user": "madper", "date": "August 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 1.0, "rooms": 3.0}, "id": 38924891}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "suggest you try another property. As a Starwood member, we usually select a Westin", "title": "Great location, lovely service, clean, and rooms to perfection!", "user": "VermontTravelfan100", "date": "August 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38914259}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "where available because of the outstanding service provided. However, this hotel is", "title": "Le Westin Montreal is the best!", "user": "linbe", "date": "August 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38688842}, {"rating": 2.0, "title": "Nice building, good location, not quite finished.", "text": "far below the high standards of The Westin.", "user": "bjsetegn", "date": "August 24, 2009", "id": 38660483}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "There are so many problems with this hotel that it is difficult to know where to begin.", "title": "Fabulous location, clean, pleasant stay, wouldn't stay anywhere else upon returning to Montreal", "user": "brett31m", "date": "August 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38386570}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled on business", "text": "We recently stayed for a week at this hotel while attending a conference at the Palais de Congres across the street.The hotel was also in easy walking distance of the Notre Dame basilica and Old Montreal. Thanks to my husband's Starwood Gold status, we were upgraded to the club lounge level. (We had also signed up for a great pre-paid deal, where every other night was half-price.) Our room was fantastic: comfy beds, double-headed stall shower, good blackout shades. The workout facilities were open and provided various machines, plus a pool. The only sign we had that the hotel was still not complete were workmen around during the day (although we didn't hear them in the morning) and the elevators malfunctioned a couple of times. However, I would highly recommend this hotel: the room was great and the staff were all helpful and friendly.", "title": "Terrific Stay, Great Location", "user": "JGMotek", "date": "August 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38196944}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I arrived late for my meeting. Fortunately, I was greeted in the lobby and my car was taken promptly for valet parking. I checked in, went to my room, changed and was back on the street in 15 minutes.", "title": "Great spot, wonderful bed", "user": "BDHNewHampshire", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38059805}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "Everyone was polite, courteous and efficient. I felt like I was staying with friends. The rooms are new, the bed is comfortable and the food at the hotel restaurant was excellent. It was hot in Montreal (!!) but the room was nice and cool. Excellent location both to reach by car and to visit the old city. I will definitely stay there again. It is an excellent Westin hotel. Wife agrees.", "title": "Nice stay, still not ready", "user": "nebularis", "date": "August 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 38049931}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "I was excited to stay at this new Westin property in Old Montreal. There still seems to be a bit of work left to do to make it an inviting hotel experience.", "title": "Westin was okay, but still has a few problems.", "user": "Robins44", "date": "August 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 37620185}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The style is very nice, I liked the grand entrance and the glass bottom pool. The room was fairly spacious and well appointed, very nice bathroom with glass door shower and very comfortable Queen-size beds.", "title": "Great location, great staff, but overall let-down", "user": "Letustrade", "date": "August 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 37321431}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "I arrived with my husband after a 6 hour drive. We arrived an hour or so after check-in so it wasn't that busy. However, there was no one around when we pulled up to the hotel. After waiting a couple of minutes I went to the front desk to check-in while my husband unloaded the car. He joined me at the check-in desk with our luggage in tow and no one offered to help us with it. The clerk at the desk was not friendly at all in fact he was actually quite cold. I found this very strange because even though I was tired from the drive, I greeted him in French and with a smile. I found out upon check-in that Expedia booked the wrong package. I was on the phone with Expedia Customer Care while they phoned the hotel to request an upgrade. They were told that there were no upgrades available but minutes after I hung up the phone another clerk upgraded a package for someone else checking in after us! We decided to go to our room and to our horror, the room overlooked the back and roof of office buildings. We once again attempted a room change to no avail. We were literally ready to just leave and go elsewhere but stayed because the room was pre-paid. We only found the consierge once but we did find a lovely young lady from the Sales Department who saved the trip for us by giving us dinner suggestions and just greeting us everytime that she sa us with a smile.", "title": "This was my first impression of Montreal and I was ready to leave upon arrival.", "user": "Safar73", "date": "August 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 37066107}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The hotels advantages are the covered entrance and its proximity to everything in Old Montreal. We did not take the car out even once, The room despite the horrific view was clean and the decor was very Asian inspired with realxing color choices. Construction was complete so we didn't encounter any construction noise or zones but the Spa was not yet opened which we knew in advance. The staff must improve their customer service or this hotels elegant Zen-like environment will not be able to sustain it.", "title": "We will be back at the Westin", "user": "mbagirl4", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 36938679}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Don't believe the reviews saying that this hotel has worked out it's kinks, anyone there this past Sunday (when the elevators were all broken again and the valet area was a complete disaster) would disagree.", "title": "Still not ready for primetime...", "user": "nroffman", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 4.0}, "id": 37315223}, {"rating": 1.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The rooms themselves are large and nice and ready for guests, at least for the most part, but the property as a whole still seems like it hasn't undergone a final check through with Starwood, in preparation for actually opening. As a result, as with any franchise, it kind of tarnishes the brand as a whole.", "title": "Worse Valet Service Ever", "user": "BillyToronto", "date": "August 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 37282355}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with friends", "text": "The underlying problem we witnessed over four days was a management/manpower one: this property needs desperately a competent general manager and then it needs to hire many more workers, especially on weekends. The staff we encountered were helpful and great but there just weren't enough of them. This caused a horrible tie up in the valet area with guests waiting an hour for their cars and an employee passing out from being overworked. This also caused long check-in lines and in actuality no real dedicated concierge, as they were expected to check people in, too.", "title": "Great Location, Huge Rooms, Wonderful Stay!", "user": "twocoasts", "date": "August 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 37261350}, {"rating": 1.0, "title": "The Westin Hotel on St. Antoine", "text": "As for the elevators, the property should act like the airlines and give some sort of credit to anyone staying there when they are broken. It really isn't fun carrying kids up dozens of flights of stairs. This isn't all the property's fault - I'm sure it's Thyssen Krupp - who installed defective elevators - including designing a system that could take down all of the three elevators at once. But as consumers we don't think about the bad service work of Thyssen Krupp, but instead blame the hotel.", "user": "byrddawg", "date": "August 9, 2009", "id": 37190352}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "It's just not the only little design flaw of the hotel . Aside from the parking debacle and lack of sufficient space, I don't understand how someone could have designed a swimming pool that small for a property that large. The heat still doesn't work so it now appears that there are three small pools but at some point in the future they will eventually fix the heating problems and then the sole remaining pool will be tiny (even if the glass bottom is very cool).", "title": "Uninspired Corporate Hotel with a Good Location and Restaurant", "user": "See_the_World_too", "date": "August 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 37086027}], "location": {"country": "Canada", "city": "Montreal"}, "stars": 4, "variance": {"poor": 25, "average": 86, "very good": 318, "terrible": 25, "excellent": 378}, "aka": "Le Westin Montreal Hotel Montreal", "slim_ranking": 0.152941176471, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Conveniently located at the junction of Old Montreal and downtown, Le Westin Montreal features 454 spacious bedrooms and suites, all offering the unparalelled comfort of Westin's Heavenly bed, complementary WiFi, in-room safe, iHome with mp3 clock and small fridge. Le Westin Montreal is connected by underground walkway to Montreal Palais des Congres (main Convention Centre) and to Montreal Subway (Metro)."}