{"user_rating": 4.5, "review_count": 9, "name": "Lea Farm", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "When you're shown your room, it's rather like stepping into a time warp...perhaps as far back as Louis XIV! But everything is clean, functional and working. There's everything you need and Alan and Jean must be amongst the friendliest people we have ever met. Nothing is too much trouble for them and, if you can put up with Alan's bombardment of jokes and puns, it's an experience to be relished. An excellent breakfast with a view of the pond and the peacocks. Make sure you try Jean's gooseberry and ginger jam. Wonderful...our stay and the jam! While there, try The Bhurtore Inn at Aston...one of the best pubs I've been into for beer, lager and food...and I've been in some pubs!", "title": "Wonderful experience.", "helpfulness": 3, "user": "bigfozbelper_England", "date": "November 1, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120031198}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Lea Farm is on the edege of a beautiful Cheshire village, a 30 minute stroll to the White Swan, a great drinks and food pub. The farm was formerly a dairy producer in the family for 75 years, now a cattle breeding farm. The accommodation , welcome and breakfast are exactly as you would expect, fulsome and comfortable, the added bonus is the humour of Mr Calwood who will tell you true funny stories from his life. Jean is the perfect hostess and your stay will be all you could wish for.", "title": "a proper farm stay with honest folk", "helpfulness": 2, "user": "davekeevil", "date": "July 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116014672}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 0, "average": 0, "very good": 5, "terrible": 0, "excellent": 4}, "aka": "Lea Farm Nantwich, Cheshire", "slim_ranking": 0.545454545455}