{"user_rating": 4.0, "review_count": 89, "name": "Leavenworth Village Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "We stayed in the rustic chic suite and had a great time. This is a one bedroom suite that had plenty of room for our family and a huge kitchen. Helpful staff, soft pillows and upscale rooms made this a great choice that we will choose again!", "title": "Great Time! Lovely Hotel!", "user": "Kathy H", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148375531}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "I don't usually write reviews for anything, but after staying at the Leavenworth Village Inn I felt the need to do just that. Upon checking in, we immediately noticed the level of hospitality was second to none. The reception was fantastic, the rooms were immaculate, very well decorated, and the overall feel of the inn was exactly what we were looking for. The staff always took care of us immediately like we were their own family, and there was just a feeling of sincerity that is rarely experienced at a hotel. Thank you for making our stay such a memorable experience.", "title": "Fantastic stay", "user": "Mike R", "date": "December 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148110213}, {"rating": 1.0, "stay_parameters": "Stayed October 2012", "text": "Worst place ive ever stayed. For starters the price we reserved for was not the price I was charges. I was told their site made a mistake and it was $50 more than the original price. We were celebrating our engagement and were set on this date. We thought reserving the suite was going to be wonderful. We were so wrong. When we got there, no parking in their lot so we had to walk 4 blocks. Finally get checked in and the whole room smells of bleach. The linens and towels were all stiff and scratched anything they touched. No soap, no coffee, and the blankets stunk of mold.", "title": "No sleep, trip to the ER, and owner could care less.", "helpfulness": 2, "user": "Cheetahtravel", "date": "December 1, 2012", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 2.0, "service": 1.0, "rooms": 1.0}, "id": 146563210}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We enjoyed our afternoon and evening in leavenworth. It is when we returned that things got worse. The building shared a parking lot and space with the towns event center. This particular night there was a very large wedding going on. Atleast 400 people going in and out of the center. The noise from the sound system was so loud we couldn't even watch tv. We decided to get into the jacuzzi tub. This is when the rash started from bleach being in the tub. At about midnight we had to tell the severely intoxicated wedding guests to move away from our window. We got no sleep, ended ip in the ER for rashes due to the bleach, and our engagement was completely a bad memory. The worst part is I spoke to the woman at check out and she said she would have the manager call, I even called three times for two weeks, no call.", "title": "Kept Coming Back to Stay", "user": "kdbug331", "date": "November 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145493610}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "Since I work for a prominent travel company, I have them ample time to respond or correct this issue. I will never send clients to this establishment. I am currently contemplating the BBB.", "title": "Perfect choice", "helpfulness": 1, "user": "Terry L", "date": "September 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141349140}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The price was very reasonable, the location can't be better, the room was clean and comfortable with a nice view, everything was perfect. They provide wifi, and every morning you will find coffee, cookies and yogurts at no extra cost.", "title": "Excellent!", "user": "PaliMon", "date": "April 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 157367104}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "It was cold outside but in the room the temperature was perfect!", "title": "Great Stay!", "user": "durbindogs", "date": "April 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 156635094}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I hope to come back soon", "title": "Updated motel at a good price", "user": "SFerence", "date": "March 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 155766875}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We were pleased with the service and room we stayed in. It was clean and comfortable. The view out our window every morning was beautiful! We were just a short walk (a half a block) from the Icicle Brewery and shops. I would definately stay here again for the views, the really nice rooms and the great staff! Thank you all for the great stay!", "title": "Amazing!", "user": "CBKCNPT", "date": "March 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155351064}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "I come from the mindset where I'd rather use my money on vacation for fun things rather than spending a ton per night on a room. However, I do expect a clean room with a comfortable bed.", "title": "Above and Beyond", "user": "Sam S", "date": "March 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 155014508}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "I'll start this review with a disclaimer. About a dozen years ago, when it was owned by another party, I was the sales director for this property. Because of that, it had a special place in my heart. We stayed in room 206, overlooking the village street and not the courtyard.We enjoyed the sound of the horse-drawn carriage clip-clopping down the road and the vehicle traffic was really not an issue.", "title": "Would have been better with breakfast.", "helpfulness": 1, "user": "CouleeCat", "date": "June 25, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 165198883}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I was very pleased with the some of the updates, i.e. plush towels, nice bed linens, window coverings. The room was very clean, bed was comfy, good pillows, shower hot with good water pressure and even though it was on the floor 2 of 3, we didn't experience any excessive noise. These to me are very important criteria for a good nights lodging.", "title": "Just Average", "helpfulness": 1, "user": "Andrew K", "date": "June 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 164321094}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Here is why I rated the property just average: no breakfast. Nearly every inn in Leavenworth prides itself on their included breakfast. Instead, they chose to turn their breakfast room into a small wine bar that during our two nights there, I never saw any customers using. In the room, they provided yougurt and 390 calorie breakfast cookies \"to start the day\". Some fresh fruit would have been more appreciated than the small high-cal sugar bombs. There was a coffee maker with Organic coffee, but the absolute cheapest coffee-whitener packets they could find. A nice flavored coffee creamer or even just a half & half creamer would have been more in line.", "title": "Very clean!", "helpfulness": 1, "user": "ArleneMSW", "date": "June 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 164094324}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "In the end, we slept well, but we probably won't choose this property on our next visit because there are so many other great inns in the village.", "title": "Perfect Bavarian Experience", "helpfulness": 1, "user": "Barbara M", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161616150}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "I rented the \"Grand Suite\" for my family to unwind in during an overnight stay. Walking into the room, there was certainly a \"wow\" factor when we saw how big the living room area was. The bedroom was large too, with a jetted jub in it. But as we settled in, the room started showing its age. The TVs were old analog tube models sitting inside chipped cabinets. A cracked faux-granite tile in the bathroom was loose under our feet. The bathroom door creaked so loudly it sounded like we were entering a tomb in an old horror movie.", "title": "Great place right downtown", "user": "Lovelytravelgirl", "date": "April 15, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 157798221}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "we stayed in the \"romantic suite room\" cute place, close to town and good price! we really liked this place, very clean and felt very much like a little home. complimentry breakfast cookies, coffee and water. will defiently be back!", "title": "very happy", "user": "grapeape428", "date": "March 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154524083}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "This is a great place to stay. The staff is very friendly. Rooms are very clean and very quiet at night. Parking is a little tight if you have a big vehicle. So you can leave your vehicleat the hotel and walk to everything in town.", "title": "Get Away", "user": "Suzanne O", "date": "March 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153790169}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "What an amazing town you have! We enjoyed the beautiful Christmas lights, and plan on returning next year for a longer stay. Your Inn was in a great location, close to the shops, but still quiet, and our room was very comfortable. Thank you for a bright spot in our weekend.", "title": "Comfortable and Affordable", "user": "Fay J", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150677039}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "I stayed at the Leavenworth Village Inn a few weeks ago and I feel I owe it everyone to write a review. First off when you get to the Inn you notice how well the place is taken care of, it was beautiful. Second when checking in the staff were second to none!! Then when I got to my room I immediately noticed that this was the cleanest hotel I have ever stayed in. It was decorated beautifully and the towels were really plush and nice. Then I found their wine bar!!! This place is amazing, great selection of specialty beers and wine, they even had a really nice cheese plate (of which I devoured). Everytime I needed anything the staff were all over it, I felt like I was family here. I would give this place 6 stars if I could we will definitly be coming back!!!", "title": "Amazing place!!!!", "helpfulness": 2, "user": "Rebecca P", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148652194}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "Nice bed and lines. Nice pillows. Clean. Good shower. Close to town so you don't have to drive anywhere. Friendly help. Nice little wine/beer bar. Free WiFi. I would go back. Fun trip. We only stayed one night. Wish we would have stayed longer. Our view was excellent.", "title": "Nice place to stay", "helpfulness": 1, "user": "allen1ma", "date": "January 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148628790}], "location": {"country": "United States", "city": "Leavenworth"}, "variance": {"poor": 5, "average": 11, "very good": 22, "terrible": 3, "excellent": 48}, "aka": "Leavenworth Village Hotel Leavenworth", "slim_ranking": 0.52, "description": "Relax with Luxurious Comfort in the heart of Washington's Bavarian Village! Attention to detail is exemplified in our Deluxe rooms and Suites promoting your relaxation. Leavenworth Village Inn provides Rejuvenation, Comfort and a Superb Location with luxurious bedding, fine bath amenities, complimentary Morning Light Fare, an intimately chic Wine Bar, complimentary parking and complimentary wireless internet. Our team is committed to providing our guests a memorable stay while visiting Leavenworth."}