{"user_rating": 4.5, "review_count": 22, "name": "Legian Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "This is our second stay at the Legian, Bali. The first being 10 years prior. On this trip we had spent 6 weeks away travelling throughout Asia and parts of Europe. Our most impressive memory of quality of service and outstanding attention to detail was at the Legian, Bali. We have been fortunate to experience 5 * service and hotels with our business over many years but the Legian far exceeds the standards of any hotel we have ever stayed at bar none! It is obvious that the thing that drives this high level of attention to detail and customer interaction is the General Manager, Kevin. We found every member of his staff that we interacted with was always quietly doing that little bit more to ensure our stay was memorable. This level of service begins with Kevins personal warm welcome at check-in. It is the only hotel we have ever been in where you see the General Manager actively engaging and interacting with genuine interest with his guests as if you were in a small boutique hotel.", "title": "Outstanding Service and Quality", "user": "Pittwaterblue", "date": "September 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 178761278}, {"rating": 2.0, "title": "Reservation and booking process", "text": "The beauty of the Legian is that you don't have to go anywhere. The rooms, food, grounds, outlook and the amenities are all first class.", "helpfulness": 2, "user": "Leagh R", "date": "August 7, 2013", "id": 171257847}, {"rating": 5.0, "title": "The only place I will ever stay in seminyak", "text": "We have already begun plans for our next visit at this beautiful hotel before the year is out.", "user": "brett_AJ72", "date": "June 15, 2013", "id": 164039313}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "I need to share my disappointment with the reservation and booking process for this hotel. Firstly unlike 90% of the hotels in the immediate area they refused to quote my room rate in Australian dollars only US dollars. Secondly they did not devulge the taxes when quoting the room rate. Thirdly it was only a matter of 2 hours approximately that my circumstances changed and I notified reservations immediately to change my booking from a 2 person room to a 3 person room. This more than doubled my original room rate, it in actual fact made the whole stay out of our reach price wise. The original room amount had already been taken from my credit card and reservations would not accept my upgrade until I paid the balance now outstanding in full. Once I complained they reduced the additional person room rate by $ 20 per night and have agreed for me to pay the balance on arrival which is very generous, but unfortunately even with these concessions it still becomes a very expensive stay at this hotel. I have asked for a full refund so we can stay at another cheaper hotel, and the hotel have refused to return my money stating their no cancellation policy, which again I have search a number of hotels in the area and they do not have such a policy. PLEASE BE CAREFUL WHEN BOOKING THIS HOTEL!!! They seem to be inflexible with their bookings, I wonder what their service will be like now I have been forced into staying there.........", "title": "Excellent", "helpfulness": 1, "user": "gregzer2000", "date": "May 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 160776606}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This was my 2nd stay here the first was 9 yrs ago. Not much has changed except a new pool which is a great addition. We had one of the 2 roomed suites on level 2 overlooking the pool and ocean. This room came with a butler (wayan) who catered to every need and request.", "title": "Perfect service", "user": "Katepadgetkoh", "date": "May 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 160037696}], "location": {"country": "Indonesia", "continent": "Asia"}, "stars": 3, "variance": {"poor": 1, "average": 0, "very good": 5, "terrible": 1, "excellent": 15}, "slim_ranking": 0.374851720047}