{"user_rating": 3.5, "review_count": 202, "name": "Lemon Tree Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Originally booked for two nights from the UK we extended our stay for seven, clean tidy and in a great location for local attratctions and access to highway 101 if you are travelling / sight seeing. Hotel was empty during our stay and quiet, there was some noise from from adjoining rooms at the weekend,", "title": "Excellent value for money", "helpfulness": 1, "user": "WilliamsA77", "date": "May 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 109533634}, {"rating": 4.0, "title": "Perfectly good", "text": "Nice helpful people, a good heated pool, and reasonable rates.", "user": "WJClinton", "date": "February 24, 2011", "id": 97842415}, {"rating": 5.0, "title": "Don't understand the negative reviews...", "text": "Checked in late last night with a group of 5 as nowhere else seemed to have any vacancies. Price was incredibly reasonable (worked out as something like $45 each). Free parking and wi-fi (no free breakfast/coffee/any sort of food pre-11am). Location is not great as we will need to drive everywhere but for the price I can't really complain. Rooms were roomy - flat screen TV, nice pool, not uncomfortable beds. I think this place has either redesigned since the bad reviews or is just getting a harsh time of it! Would definitely come back if back in Santa Barbara area.", "helpfulness": 1, "user": "admanmcd", "date": "September 16, 2010", "id": 79786619}, {"rating": 1.0, "stay_parameters": "Stayed August 2010", "text": "Fantastic location and a great layout...BUT no coffee maker, no mini fridge, not even a pad of paper or a pen or disposable liner for the ice bucket. The only way the bed could have been more uncomfortable is if it had been a bed of nails. The mattress was hard as a rock and each pillow was so firm, it felt like i slept sitting up. If there were amenities to be had (business center, room service, etc., they were not listed anywhere in the room).", "title": "Shockingly bare bones basic", "helpfulness": 1, "user": "LJSmall", "date": "August 16, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 75428596}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Staff at desk was friendly. Rooms are large and the private patio was fantastic. Santa Barbara is pricey so I was prepared to have to spend the money. I just didn't expect to get so little for my money. This seems to be an example of a business that knows they have their clientele by the short hairs, charges the (high) going rate for the area but then cuts every corner it can to maximize their profit. Wish I'd gone to Motel 6.", "title": "Nice, Clean and Reasonable", "user": "dnagirlone", "date": "August 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 74930743}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "This hotel is a regular stop for many of my friends and the second visit for me. The rooms are nice, roomy with a standard bath plus a second mirror and sink. First floor rooms have glass patio doors that open up to beautiful, lush grounds while second floor rooms open up to a decent sized balcony. There is a nice pool area and a hot tub. The on-site restaurant has a full-bar and our dinner was quite good. The price was a bit on the high-side ($210 per night with 2 double beds) but overall this is a nice place to stay and we will likely return again in the future.", "title": "Somewhat pricey but very nice", "user": "JohnKr", "date": "July 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 3.0, "service": 3.0, "rooms": 3.0}, "id": 34043678}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "It's the location that is the main draw here. The hotel offers basic clean rooms with friendly service. The prices are in line with how expensive santa barbara is and how close it is to the night scene and the beach. Pretty good food at the bar/restaurant also, worked out great for my vacation.", "title": "Good location for the vacation", "helpfulness": 1, "user": "armygentlema", "date": "April 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 27790107}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "great value,beautiful courtyard,fantastic pool/spa restsraunt bar rocks!!", "title": "great value", "helpfulness": 1, "user": "mrswifty", "date": "December 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 22677848, "likes": {"liked": "— pool area"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We wanted a good, clean and convenient place to stay for one night, while visiting our son at UCSB. Many hotels in Santa Barbara require two nights minimum. Our large room was very nice for this class of hotel. The staff I talked to on the phone and at the front desk were all friendly and efficient. The courtyard and pool area were pretty, with lush landscaping. We would stay here again under the same circumstances.", "title": "Just right for our needs", "helpfulness": 1, "user": "onthego_sj", "date": "September 22, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 5.0, "location": 3.0, "value": 3.0, "rooms": 4.0}, "id": 20263218}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "This is the worst hotel I've stayed in. The beds are least 25 years old. They claim it was remodeled in 2003. NOT. There was nothing nice about it. Not the room or the people working there. Way too much money for nothing. An average of 180.00 a night. What a joke!", "title": "Too much money for what you get.", "user": "Yazhi", "date": "August 18, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 19090086, "likes": {"liked": "— nothing", "disliked": "— The horrible beds."}}, {"rating": 4.0, "title": "Good Value for Santa Barbara", "text": "My husband and I came down to Santa Barbara at the last minute, traveling through the night for seven hours, because our daughter, who lives near to this hotel, had taken ill. We checked in at 5:30am and were given a very basic, but very clean King-size room with a balcony. We face the street which is a bit noisy -- but we were happy to find the room at such a reasonable rate ($105/night with our AARP and AAA) in Santa Barbara during Fiesta Week. We have been told the rate will go up to $175 per night on the weekend.", "user": "FoothillTraveler7432", "date": "August 4, 2010", "id": 73811998}, {"rating": 1.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "It appears that the hotel is undergoing some renovations. Our room does smell of fresh paint, there is obviously new furniture and a new flat screen Sony TV. The front desk personnel have all been very friendly and accomodating with our situation as we aren't sure how long we will be staying. The housekeeping staff is thorough and has provided any extras we have requested. Our room is quite clean fresh. All floors and surfaces are washed down each day. The grounds are inviting and the restaurant and pool look like places I would visit. The area is upscale, an upper State Street neighborhood with Trader Joes and Whole Food within a mile of the hotel. Downtown is apx 1.5 miles away.", "title": "Not worth the unreasonable rates", "user": "Knowledge9", "date": "February 14, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 55954723}, {"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled with family", "text": "The bed linens aren't favorites of mine. They are not what I would use at home and if I hadn't been in such a rush to get down here -- I would have brought my own linens as I have done when visiting other hotels. But they are clean and serviceable. The bathroom is old, but updated.", "title": "I would urge you to choose another hotel if you're staying in Santa Barbara", "user": "MDWLosAngeles", "date": "December 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 1.0, "rooms": 3.0}, "id": 50821202}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "For Santa Barbara this hotel is a great value. This our seventh year visiting this city and we have spent far more for far worse accomodations. We will stay here again when we visit our daughter.", "title": "Nice. Relaxing", "user": "Turffking", "date": "September 30, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 45527745}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The website does not give an accurate reflection of this motel. It is in a bad area on a busy street and the exterior is very old and outdated. Parking was also a minor hassle. I was very disappointed with the condition of our room. There were dirty scuff marks on the wall and what appeared to be a booger stuck to the wall. The beds and bedding was extremely old and the pillows were lumpy and uncomfortable.", "title": "this hotel sucks!!", "helpfulness": 1, "user": "mdwlark", "date": "July 31, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 1.0}, "id": 36369190}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We only stayed here for one night and it was adequate for our family. Check in was easy and the man who checked us in was very friendly and very helpful. Our room opened out on to the pool which was nice with a hot tub, but there were no pool towels. Our room was quite large with a large plasma screen TV. wi- fi was available in the room. The furnishings and fittings in the room were ok , I think it could do with a little updating. There were coffee making facilities as well as hairdryers and irons. the bathroom was large but really needs updating my daughter described it looking like a public toilet very unattractive . the towels were of very poor quality and had seen better days but it was very clean .", "title": "Average Motel", "user": "Diwinny", "date": "July 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 116012824}, {"rating": 2.0, "title": "Spend your $ somewhere else", "text": "the Bar and lounge areas of the hotel were nice although we didn't get the opportunity to Eat or drink there.", "user": "leahlag", "date": "July 19, 2011", "id": 115541979}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "I know that hotels in the Santa Barbara area are all overpriced. But I would have been upset spending even $50 for this room. I think we ended up spending $150 and it was NOT WORTH IT. The room reeked of old mildewy carpet, even after leaving the back door and front door open for an hour before leaving for the night. Our hope of airing that smell out was futile. Spend the extra $100+ on a nicer place. You'll sleep better.", "title": "Lemon Tree Inn -------\"Lemon\"", "helpfulness": 1, "user": "GCSMaryland", "date": "July 18, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 2.0}, "id": 115507127}, {"rating": 2.0, "title": "Not greatest!! But if you are looking for a motel maybe.", "text": "Driving from San Francisco to Santa Barbara on Rt. 1, Scenic Coast Road, this was the last hotel we stayed.", "helpfulness": 1, "user": "meandroe", "date": "July 5, 2011", "id": 115062507}, {"rating": 2.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The \"Lemon Tree Inn\" should just remove \"Tree\" from its name. Very, very disappointing. Room very dated and seemed not properly cleaned. Odor was present as soon as door was opened. Carpet seemed not vacumed. Clean sheets, although also thin and worn. Bedspread had odor which was very noticeable upon getting into bed to sleep. Bathroom sink was seperate behind wall in bedroom. Toilet and shower only in seperate room with door. Only plus was toiletries were present. Room given, standard, was only a few doors from busy road, State Street.", "title": "Could easily have been better", "user": "Meli299", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 1.0, "value": 2.0, "service": 3.0}, "id": 115033081}], "location": {"country": "United States", "city": "Santa Barbara"}, "variance": {"poor": 17, "average": 40, "very good": 91, "terrible": 22, "excellent": 32}, "aka": "Lemon Tree Hotel Santa Barbara", "slim_ranking": 0.516666666667, "description": "Classic neo-60s Inn in the Center of Paradise. Set on a Tropical 4 acres, Modern Guest Rooms with Private Patios or Balconies face our Lush one acre Courtyard with Giant Heated Swimming Pool and Hydro-Spa. Guest love our Crocodile Restaurant and Bar which features Californian style Italian Cuisine with something for every appetite. Dine in our Chic Dining Room or at our Cool Bar, on our Tropical patio or enjoy private In-Room Dining. Our Full-Bar features an extensive Wine List, Great local Draughts, Traditional and Exotic Cocktails.Spacious Guest Rooms feature comfortable Beds, Sony Flat Panel TVs, In-Rooms safes, In-Room Coffee. We Offer Pool-Side Rooms, Garden and Mountain View rooms and Atrium rooms...all accessable by Elevator.The Lemon Tree has Meeting Space and offers full In-House Licensed catering for all types of events.Our Friendly 24 Hour Front Desk Staff is eager to welcome you to the Lemon Tree Inn and Beautiful Santa Barbara."}