{"user_rating": 4.0, "review_count": 98, "name": "Leogrand Hotel & Convention Center", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "We were really impressed with the Leogrand. Right in the heart of the city, really friendly and helpful staff who all seem to speak good English, and an excellent room with lots of space and all necessary facilities. No coffee making facilities but we woiuldn't expect that in most European hotels. The bathroom is quite small, but perfectly adequate and all immaculately clean, modern equipment. Everything seems to be run efficiently and nothing is too much trouble, The breakfast is very good quality with a wide range of cereals, fruit, bread and hot items (although sugared carrors and mixed veg were not something we were tempted by), and all accompanied by delightful harp music played live by a very talented young girl. Effective air-conditioning, free wi-fi and a room safe that fitted my netbook computer comfortably were all very welcome extras, and the mini-bar prices were reasonable (although helped by the exchange rate). A great place to stay, although 2 or 3 nights is probably enough to take in most of the sights of the city.", "title": "Couldn't have asked for more", "user": "Steve-G23", "date": "July 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71233859}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I have spent in Leogrand 10 days in a row. Mainly it was ok. I had an issue but it was my fault. I put my money into the safe in the room and 100EUR dispeared. I have reported it at the recepcion and asked them to arrange a meeteing with the security manager also. Because it was at saturday it was not possible but they did not arranged it for monday. So do not leave your money in the safe. The brekfast is realy good with the live music but its not soo good that the walls are so thin that I could hear when the couple in the next room had sex...", "title": "Not evrithing is green", "helpfulness": 2, "user": "Sztyerna", "date": "July 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 69954169}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "I've stayed three times at the Leogrand in recent years, and will keep coming back. It's familiar, comfortable, and has a great location just blocks from just about everything in central Chisinau. The rooms and the building are nothing extraordinary, recent construction, but it's a good, clean, no-nonsense hotel with helpful staff, nice buffet breakfast (usually with a harpist - nice touch!). And not for that reason alone, the place just strikes the right chord. It's all a business traveler needs.", "title": "Comfortable, Helpful, Good Location", "user": "Three_0f_Us", "date": "May 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63378072}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled on business", "text": "I have been coming to Moldova for many years now. I was coming for a long stay and stayed here. Since then, I haven't stayed anywhere else. This is a very nice hotel with a devoted staff and fantastic meeting facilities. The rooms were very nice and super clean. The restaurants were very good with both European and traditional cuisine. Security was top notch. I had a situation one night where I needed the manager to come and help. It was 00:15 a.m., and in literally less than five minutes, he was at our doorstep with a smile and super helpfulness. I really enjoy my stays in this Hotel! Yes, it's not cheap...but, it's worth it.", "title": "Extremely helpful staff", "user": "Traveller84Boston", "date": "October 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 47879036}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "I was staying at Leogrand (ex-Dedeman Hotel) for several times. My last visit was in the beginning of May - business trip and I really enjoyed my stay! The hotel is situated just in the center of the city. Th e atmosphere is nice, rooms are clean, the food is good. During the breakfast the harp is playing and its really splendid!", "title": "Adequate prices for the excelent service!!!!!! :)", "helpfulness": 1, "user": "CesarioLondon", "date": "June 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32173468}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "This hotel is clearly overpriced, at least for the simplest room they offer. The design is kitchy, they try to keep one in the room, but it still doesn't fit the style. The room are big, nice furniture, TV set with a lot of programs, everything is extra clean, the room is cleand daily, the sheets are also changed daily. Any service except for what is included ( breakfast, internet or gym) is very expensive. The breakfast is good enough, still if you don't get up early, you get no fruit or other things they run out of. The staff is ok, but not friendly enough, still the maid who cleans the room is very nice.", "title": "Overpriced", "user": "eiola", "date": "September 15, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 20097605, "likes": {"liked": "— Cleanliness, location", "disliked": "— Staff, service, design"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "At check-out they wanted to charge me for something I never ordered, because they messed the bills and I had to spend 30 mins proving I haven't signed any order, which was very unpleasant.", "title": "Nicest Hotel in Chisinau", "user": "jplenny", "date": "August 5, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0}, "id": 18637739}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "For Chisinau this might be a good choice if you look for some kind of luxury, but it's definitely not worth the price.", "title": "Good hotel, but pricey", "helpfulness": 1, "user": "sean_e78", "date": "June 10, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 16823698}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled with friends", "text": "Leogrand Hotel & Convention Center is the nicest hotel in Chisinau and the prices reflect this. The rooms are decent sized and the bed was comfortable. The hotel offered wire internet service for a fee. The hotel was within walking distance of the main streets in Chisinua, where you can find lots of shops and places to eat.", "title": "Expensive and good", "helpfulness": 4, "user": "Leifaa", "date": "September 30, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 10020653, "likes": {"liked": "— The level of service", "disliked": "— The cost of being there does not match the overall price level of the city"}}, {"rating": 5.0, "title": "Leogrand Hotel", "text": "Breakfast was good, but the hotel's quirky extra charges for orange juice seemed strange for a buffet style offering. The other issue is that the non-smoking side of the breakfast restaurant is next to the walkway, where the beauty shop workers take a break and smoke. If smoke bothers you, I advise you to sit more toward the center of the restaurant. Other than these two issues, the place was fine. There was a good choice of various breakfast foods.", "helpfulness": 3, "user": "ThiCph", "date": "July 6, 2007", "id": 8069338}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled on business", "text": "I am traveling often to Moldova and I have stayed in different hotels. I can say, and believe me is so, Leogrand is teh best hotel in Chisinau. I agree is is little bit more expensive then others but the difference in the room rates with other hotels is not so big when you compare with the quality of the services. Staff is very proffesional and very polite, even not to compare with non moldavian hotels and many europeans hotels. I advise you to choose Leogrand for everybody who cares about the service and atitude. Success to the team and keep it up!", "title": "Best hotel in Chisinau!!!!!", "helpfulness": 2, "user": "It-Runner", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 32013198}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I stayed in Room 708 from 16 to 20 February 2009.", "title": "Professional Staff", "helpfulness": 1, "user": "sokin", "date": "February 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25250577}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "What makes this hotel wonderful is not its furniture, which definitely needs some upgrade or its slow (sometimes very slow) internet (provided by orange.md), but the people who run it and in particular the General Manager Mr. Ozkan Alkan and the Sales Manager Mrs. Ana Moraru.", "title": "Great Hotel", "helpfulness": 2, "user": "gokselt", "date": "February 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24167977}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled on business", "text": "After a misunderstanding (the hotel's fault) I submitted a written complaint to the Hotel's General Manager and he immediately took all the necessary action to resolve it to my complete satisfaction and even more!!!", "title": "Good 4-Star", "helpfulness": 1, "user": "Michael W", "date": "January 30, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 24035850, "likes": {"liked": "— Staff, butterfish for dinner.", "disliked": "— Either far too much heat or none."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I will be going to Chisinau a lot in the following years and Leogrand will always be on the top of my list!", "title": "Good business hotel, nice sun deck café", "helpfulness": 1, "user": "TrophyCollector", "date": "January 12, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23480330}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "The hotel is nice and in general there is nothing to complain, all is clean and working.", "title": "Nice Hotel, but poor Service level and missing any personal touch", "helpfulness": 5, "user": "dana_christian", "date": "May 26, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 7699234, "likes": {"liked": "— Central and clean, good standards", "disliked": "— service"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "But, for a business hotel I am always irritated when they ask me to pay extra for Orange Juice and Capucino at the breakfast. For the price they ask, such costs should be included. Especially the face of the waiters/waitresses when they tell you that it costs extra is usually destroying my breakfast \"But you know that Capucino costs extra!\"", "title": "Among the best business hotels in town", "helpfulness": 6, "user": "florini", "date": "April 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7478738}], "location": {"country": "Moldova", "continent": "Europe", "city": "Chisinau"}, "stars": 5, "variance": {"poor": 1, "average": 10, "very good": 53, "terrible": 3, "excellent": 31}, "aka": "Leogrand Hotel", "slim_ranking": 0.114285714286, "description": "A shining jewel in the heart of Chisinau, the capital city of Moldova, Leogrand Hotel & Convention Center gracefully blends the classic with contemporary amenities and service. Located in the ultra center of the city it is convenient to the area's major government and business offices, shopping malls, theaters and cultural attractions. Situated in a superb location, offering exclusive meeting facilities and elegant environment Leogrand Hotel & Convention Center ranks as the best business hotel in Moldova. Cozy décor here is combined with all the features expected by today's business and leisure travelers. As high class residence and convention center Leogrand focuses on providing high quality service in friendly atmosphere.Leogrand Convention Center featuring 1000 m2 of elegant function space and a large pre-function area is an exclusive preferred site for glittering galas, sophisticated receptions and noteworthy events. This well-appointed function area is equipped with the latest support systems: audio and lighting systems, air-conditioning and computers - Internet connection, LCD Projector, speaker systems, fire alarm system, flip chart and other facilities."}