{"user_rating": 4.5, "review_count": 787, "name": "Les Suites Orient, Bund Shanghai", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This is an awesome hotel with great staff and amazing views! It was pure luxury in an amazing location and a highlight of our stay in China.", "title": "This hotel is pure luxury with Amazing Views", "helpfulness": 1, "user": "Rattyos", "date": "July 20, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115569186}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "We stayed here for one night in June 2011 with our two young boys aged 4 and 6. We asked for a Bund view room. The hotel room itself is top quality with coffee machine, remote control blinds, TV over the bath tub, piped music, coffee table books and reading materials. The view from our room was incredible! We checked out the Shanghai lights at night from the comfort of our lounge while the kids slept in the sleeping area!", "title": "Why all the fuss ...", "helpfulness": 1, "user": "thomas_destinations", "date": "July 20, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 2.0, "service": 4.0}, "id": 115561461}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "We had a suite which had one King bed and we asked for a rollaway to be added. The rollaway was a big small for two kids but was placed beside the couch in front of the window in the sleeping room so we set the other child on the couch. A child could easily have slept in the king size bed with us as it was very big.", "title": "Great location with personal service and attention to detail", "helpfulness": 1, "user": "ttc45", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115542648}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The staff were absolutely the friendliest and most professional team. The restaurant manager offered our children gifts at breakfast. The team were extremely helpful with any requests. English was very well spoken.", "title": "awesome location with the view of the bundt", "helpfulness": 1, "user": "winefrance", "date": "July 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115482160}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled solo", "text": "The restaurant and free business centre area were also beautiful in decor. The hotel room and common areas of the hotel have the feel of visiting someone's house - with coffee table books, magazines and ornaments and photos around.", "title": "A wonderful gem on the Bund", "user": "Casa131", "date": "July 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115413141}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled solo", "text": "A modern hotel, with big room, great view from Bund,helpful and friendly staff,Rooms are very confortable .Lcation is perfect,corner with Bund, couldn´t be better.Breakfast is great, with chinese and western food.", "title": "Very good", "user": "FRANCISCO7", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116084970}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I really liked this hotel. It has an amazing view of the river with all the boats & buildings opposite lit up at night. The bed is enormous & comfortable. The fitout is well designed, with interesting connections between the room & bathroom. I like the stone, timber parquet & ply cladding materials. Rug & furniture has a 50s modernist touches which I like. Bathroom fittings are luxurious. Service was enthusiastic but discreet. Breakfast was great.", "title": "Beautiful", "user": "NessR", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116083873}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The public spaces are interestingly decorated - old suitcases, photos, beautiful & unusual flower arrangements, china - displayed unfussily in an art museum manner.", "title": "Our Shanghai Home Away From Home", "helpfulness": 1, "user": "Pazful", "date": "July 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116071621}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "WOW!! We found this Shanghai \"pearl\" of a hotel through Trip Advisor. My wife and I are in Shanghai for five weeks teaching doctoral candidates at a local university and had never visited Shanghai. We are experienced travelers with a strong desire to use our in country hotel as a base of operations and respite from the daily hustle and bustle of the global big cities we tend to travel to. Having no idea where to stay in Shanghai, we consulted Trip Advisor who has never disappointed by providing us with a range of accurate reviews from people who are candid about every aspect of their trip experience.", "title": "What a view!!!", "helpfulness": 1, "user": "MRGLondon", "date": "July 29, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 115953159}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled solo", "text": "Les Suites Orient Hotel is quite simply the best hotel, in the best location with the best staff in Shanghai. My wife and I could not have found a more perfect fit for our taste. The staff is courteous, helpful and protective of guests. Lucky, the front office manager and Mr. Joseph Pi, the corporate Chief Operating Officer are extraordinary. The hotel's restaurant was recently reviewed in China Daily newspaper as it raved about its menu which features delicious samplings from from China, Taiwan and the West!", "title": "You will be happy if you stay here", "helpfulness": 1, "user": "Sauvignon2008", "date": "July 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115903429}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Superb style, superb location, superb service, overall an excellent place to stay in central Shanghai. Every thing about this relaxed hotel from view from the bath to the peaceful lounge equipped with complimentary computers (with colour printer) and ipads, from the (small) rooms with coffee machine and ipod dock to the classical music and stunning minimalist flower arrangments oozed style. The service from the helpful staff was uniformly excellent.", "title": "Location, Style & Service", "user": "Intrepidtoo", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116533180}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I stayed recently at LSO in this superbly designed hotel on the Bund (Puxi area of Shanghai)", "title": "Wonderful, edgy and wonderful hotel, great choice", "user": "OnTheRoadAgainAussie", "date": "August 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116515860}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "What a great place this is, a real jewel. I have stayed in Shanghai many times and won't stay anywhere else from now on. The rooms (get a River view room) are sensational and really well equipped.", "title": "Best mistake of our trip", "user": "Robtheironguy", "date": "August 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116497812}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "The staff are excellent and nothing is a problem. Eric even asked if he could show us Shanghai on his day off! We had a wonderful tour and long ( hot pot ) lunch and he was the perfect host. (We still keep in touch)", "title": "Great Place to stay in Shanghai", "user": "Eaglemania", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 116416598}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "The facility is state of the art and a nice stroll along the Bund area to the Nanjing road shopping street, nearby restaurants (try the Lost Heaven around the corner) and directly opposite the ferry to the Pudong side.", "title": "Excellent Shanghai Accomocation", "user": "Fan-tc", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 116369555}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "This was the best hotel we stayed in during our China trip, but it also ranks as one of the nicest hotels we've stayed in anywhere - and that includes 5 star hotels in the States and in Europe. The service was amazing, the breakfast was outstanding, the amenities were top rate (lobby with several computers and internet, and wonderful coffee, tea, and treats in the lobby), and the rooms were modern, clean, and fun! Where else can you take a shower or bath while looking out over a river? And from your bathroom perch, you can just glance at your bathroom mirror, and for your convenience you will have the outside temperature displayed? We looked like a fairly motley crew - we arrived sweaty and unkempt - but we were treated like royalty our entire stay. Fabulous hotel - no need to look elsewhere.", "title": "One of the best hotels we've ever stayed in", "helpfulness": 1, "user": "ruchelaya", "date": "July 27, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115863207}, {"rating": 5.0, "title": "Really enjoyable with great service", "text": "We enjoyed this hotel. Very flexible and helpful staff. Breakfast was really good- quality foodstuffs. The view from room 808 was stunning. It is right near the cross river ferry. Shanghai unlike Hangzhou has many available taxis and the staff get them for you in a jiffy. Our next hotel was in Alice Springs Australia. Price the same but the service at Les Suites Orient put the Australian hotel to shame. I wanted to go back to China right away to get some courtesy and a decent breakfast. I really recommend Les Suites Orient in Shanghai.", "user": "senorsolomon", "date": "July 26, 2011", "id": 115788641}, {"rating": 5.0, "stay_parameters": "Stayed July 2011", "text": "2 big TVs, fantastic bathroom, honest and sincerely helpful staff. Good air con, unbeatable view, good food, free computer in contrast to Australia. Les Suites was a really wonderful experience. The rooms were spacious and the bathroom was roomy and well equipped. Somehow it was fun in this hotel. Wanted to stay there rather than go out coz the views from the room were better than anywhere else. Its right near the famous Bund. Strongly recommended for sure for those who want comfort.", "title": "Excellent, highly recommend!", "helpfulness": 1, "user": "Abi28c", "date": "July 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 115758973}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The rooms were amazing, we stayed in a deluxe room and glad we spent the extra. There was all the mid cons and more besides, and the bed was huge and so comfy. The staff were great and did try to help although their English was just ok. We booked the ERA acrobatic show through reception and that was amazing. Breakfast was good, so much choice. All in all I would certainly recommend and would go back. It's excellent for the money and the location on the Bund is great. Would recommend getting tickets for 2 days for the big city bus which you can take to all the sights with English commentary, also good to sit in the aircon bus when it gets hot!! Enjoy!", "title": "Beautifully decorated, top service and location", "helpfulness": 2, "user": "starfruitsalad", "date": "July 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115718527}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Very tastefully decorated hotel. Room overlooked the river and had all the amenities of a top 5 star hotel. Service was always friendly and helpful, we were greeted with fresh juice at reception at arrival. The location is also very convenient - you're on the Bund and Pudong and the shopping area are really close. Free wifi!", "title": "Elegant hotel in a wonderful location", "helpfulness": 1, "user": "Annejs", "date": "July 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115635400}], "location": {"country": "China", "continent": "Asia"}, "stars": 4.5, "variance": {"poor": 7, "average": 24, "very good": 139, "terrible": 6, "excellent": 611}, "aka": "Les Suites Orient Hotel", "slim_ranking": 0.00199828718242, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "As a truly boutique hotel, Les Suites Orient is situated on the historic Bund with breathtaking views of the Huangpu River and the Pudong skyline. It is also conveniently located near the famous Yu Gardens, the tunnel connecting to the Pudong financial district, and the Pudong ferry terminal.Les Suites Orient offers 168 exquisite guest rooms, including 43 suites. Rooms are decorated in a clean and elegant tone with reduced forms and warm colors, creating a comfortable and relaxing atmosphere. All rooms are equipped with a range of the latest technological features including wireless internet and high-speed cable access."}