{"user_rating": 4.0, "review_count": 138, "name": "Les Sables Blancs", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "You've heard of infinity pools, the kind of swimming pools that look as if they meet the horizon so that there is no \"end\" or side of the pool, only water stretching to meet the sky. Well that's a description of the hotel rooms at Les Sables Blancs. You can lay in your king size bed and gaze over the narrow deck with its white table and chairs, and past the floor to ceiling white curtains that billow in the breeze, out to the ocean peppered here and there with sailboats or sailboards and on to the horizon, as the sound of the waves breaking on the unseen beach below relaxes you completely. That's how I imagined this place after seeing pictures of it on the internet website--and that's exactly how it was in reality. The view was probably the most beautiful I've ever experienced in a hotel room anywhere at any price. And the view alone was well worth the price we paid for the room--195 euros per night for the standard room.", "title": "Infinity hotel room", "user": "FloridaTravelmum", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 36920284}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "But the room itself was nice as well in that modern, design hotel way currently in vogue. Linens were white and walls were painted a pale aqua to mirror the shades of the sea. Floors were plain blond wood. The bathroom was long and narrow (as was the room itself) with glass surfaces and a square glass window between the bathroom and the bedroom which could be made opaque or transparent by the push of a button.", "title": "the sound of the sea through your window", "helpfulness": 2, "user": "daviesbagrie", "date": "September 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 10007172, "likes": {"liked": "— Those enormous bedroom windows with the seaview", "disliked": "— a little on the sparse side for decoration & the meals were not QUITE as good as the place."}}], "location": {"country": "France", "region": "Brittany", "continent": "Europe"}, "stars": 4, "variance": {"poor": 11, "average": 16, "very good": 42, "terrible": 2, "excellent": 67}, "aka": "Les Sables Blancs Concarneau", "slim_ranking": 0.2}