{"user_rating": 5.0, "review_count": 180, "name": "Les 4 Etoiles", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled on business", "text": "I stayed in Les 4 Etoiles (in the Izar room) for 6 nights during a conference in June (took a cab from the airport; driving looks tricky). The host, Pierre, is wonderful: warm, helpful, friendly, ready to make a phone call for you or check on a reservation. There are 4 rooms here: all open on to the main sitting/kitchen area, and there's also a small patio/sitting area. I saw two of the rooms, and the only difference might be whether they face the street or, like mine, the common garden/pool area behind. The location is not in the center of the old city -- hence, less noise and bustle, but also some travel plan. The walk was about 15 minutes, but there is a tram 2 minutes away that goes right to the train station, and also goes on the edge of the old city at the bottom of the hill. Either way, it's easy to get in, easy to get around. Les 4 Etoiles was spotlessly clean, the fixtures modern, the breakfast fine. But the real reason to stay here is Pierre.", "title": "Great B&B near old city", "helpfulness": 1, "user": "Genings", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 167191288}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "My partner and I stayed at Les 4 Etoiles for 4 nights in July 2013. We were made extremely welcome by Marie who proved to be an excellent source of information regarding Montpellier, especially restaurants. She could not have been more helpful. Accommodation was very good; our room overlooked the garden of the adjacent apartment complex. The bed was especially comfortable and we particularly appreciated the silent and efficient air conditioning.", "title": "The warmest of welcomes", "user": "revitalise", "date": "July 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 167167321}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Breakfast was excellent and was a good opportunity to make contact with our fellow guests.", "title": "Excellent - but can be tricky to access by car", "helpfulness": 1, "user": "aussiekpn", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166996183}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The guest house is in a residential area but only a short walk from the Place de Peyrou and old Montpellier. As mentioned by another contributor, the market (Sat/Tues) alongside the aqueduct in Les Arceaux is a delight. I also recommend the modern tram system, particularly if arriving by train.", "title": "French charm", "helpfulness": 2, "user": "Aussies10", "date": "June 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164974844}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "All in all a great choice which I recommend without hesitation.", "title": "Comfortable, good location, great service", "helpfulness": 2, "user": "Dublin_Honeymooners", "date": "June 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 164143911}], "location": {"country": "France", "region": "Languedoc-Roussillon", "continent": "Europe"}, "variance": {"poor": 0, "average": 5, "very good": 13, "terrible": 1, "excellent": 161}, "slim_ranking": 0.0416666666667, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.5}, "description": "It is our pleasure to welcome you in warm comfortable environment offering 4 charming bedrooms, ideally situated on the historic axis of Montpelier’s city center. This heirloom family property is the current home of its fifth generation. It allies vintage charm and contemporary design while respecting the environment. Our interior designer Jacques de Milleville created a contemporary and welcoming space while preserving the spirit of this 1930’s house."}