{"user_rating": 4.5, "review_count": 92, "name": "Les Fleurs Boutique Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "The decor of this hotel is unusual in that it carries a flower motif throughout the hotel so it is not your usual bland style. However it does not lack anything due to this style. the rooms are fairly spacious with good facilities. We had a bath in our room (No35) and very good shower. The shower cubicle is partially int he bedroom (maybe not a good idea if you are the shy type). The area for hanging clothes is very generous and there were bath robes and slippers. Breakfast was fast and good (I assume they took note of the comments which said it was slow). Location couldn't be better as it is on the main shopping street but very quite at night. You do hear the trams early in the morning if your room is at the front but it's not too bad. Overall an excellent hotel for a short stay.", "title": "Unusual but lovely", "helpfulness": 1, "user": "marieb5", "date": "May 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 29527573}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "An amazing hotel. It is located right in the middle of town on the main shopping street, and is a beautiful glass building with flowers on the outside, to reflect its theme. They have paid attention to every little detail with this hotel, and the whole thing is a work of art. The bedrooms are gorgeous (ours was just a standard double) - incredibly comfortable and beautifully decorated. The bathroom was amazing with a huge rainforest shower, a flower mosaic on the walls, and speakers that let you listen to the TV while you are in there! Free Lanvin toiletries and you can borrow DVDs free from reception and watch them in your room. The breakfast was delicious too. The staff are delightful - very polite, friendly and attentive. And all this for about £80 per night - amazing. Definitely the best hotel I have ever stayed in - when I think of Sofia I don't think of the city, I think of this hotel!! I have since attempted to decorate my house in the style of this hotel!!", "title": "Best hotel I've ever stayed in", "user": "lc2789", "date": "April 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27746126}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "This is a really attractive boutique hotel, slap bang in the centre of Sofia.", "title": "Would Give 4.5 Stars if Possible", "user": "bagg10", "date": "March 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 26407171}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We had the regular sized room which, as others have mentioned, is a bit on the small side. Bathrooms (no actual bath though) are a good size and the shower is fantastic.", "title": "Very good", "user": "RamblingRambler", "date": "February 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 25104341}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "First morning's breakfast was very quiet. I think we only saw three other couples and yet, it took half an hour for our order to arrive and, when it did, it was only luke warm, which was baffling! Second morning was much quicker but it would be much better if you could help yourself to tea, coffee or juice, instead of having to ask.", "title": "Lives up to its #1 rating", "user": "josher96", "date": "December 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 23064336, "likes": {"liked": "— Very cool room, nice location"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "This hotel made me feel good about Sofia/Bulgaria from the word go. It's staffed by young people who are really anxious to help the guest and make everything as smooth as possible. The level of cleanliness is excellent. And the location can't be bettered - right on Vitosha Boulevard in the heart of the city. There were no negatives from my perspective.", "title": "Great location and very friendly staff", "user": "Screenname48", "date": "September 18, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 20180537, "likes": {"liked": "— The friendly staff", "disliked": "— Nothing to say here."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008", "text": "In a city, with few nice hotels, Hotel Les Fleurs is a shining example of how things ought to be done.", "title": "Fantastic base", "user": "joethetravellerUK", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19204809}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "Free welcome drinks, parking possibilities, beautiful rooms, excellent location, etc. etc.", "title": "A property of trade-offs", "helpfulness": 1, "user": "abcdxyz001", "date": "July 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 1.0, "service": 5.0, "cleanliness": 2.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 17854271}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Most importantly, however, Les Fleurs has really invested in customer service. The staff are friendly and helpful.", "title": "great cosy hotel in a fantastic location", "user": "Sof1a", "date": "May 7, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "business": 3.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15744685, "likes": {"liked": "— bathrooms and beds", "disliked": "— the views"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "The breakfast buffet is accompanied by quite a large selection of made to order items (french toast, waffles, crepes, eggs) which we enjoyed.", "title": "Veeery stylish !", "user": "Eikoor", "date": "February 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 13365973, "likes": {"liked": "— That big flower painted on the wall ! Weird yet nice."}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "boutique hotel in the best place in sofia (vitosha street), near a lot of atrractions, resturants and business center. new builded, good service and excellent food. the price is high comering to bulgaria (155 euro), but it worth it.", "title": "one of the best hotels", "user": "udias", "date": "November 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22075818, "likes": {"liked": "— service and food", "disliked": "— the are rooms without openable windows"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "I have the unfortunate job of commuting to Sofia about twice a month for work. As you may imagine i have sampled pretty much most of the major hotels in Sofia.", "title": "All the gear but no idea?", "helpfulness": 2, "user": "rustymomo", "date": "October 17, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 20950744, "likes": {"liked": "— service and food", "disliked": "— The service and food is below par"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Les Fleurs opened about a year ago, a converted shopping centre on Sofias most commercial street, Vitoshka Blvd. In essence, the first boutique hotel in Sofia and a real change from the huge 'James Bond' style Russian architecture hotels.", "title": "Enjoyable Stay", "user": "NealeG", "date": "September 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20396547, "likes": {"liked": "— Rooms", "disliked": "— No juice at breakfast"}}, {"rating": 5.0, "title": "Fantastic Hotel", "text": "For me, a young man, it was very exciting, I was a gold member at the Grand Hotel Sofia however started using Les Fleur more and more. Location for anyone who wants to be in the middle of the action, its very good.", "user": "Tubs", "date": "September 22, 2008", "id": 20272338}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Internally, although I can understand where they were going with the style it is done in a typically Bulgarian 'over the top' style. I often find Bulgaria lacks anything chic, and to me this proves it. Yes, it has nicely moulded walls, flowers pressed all over the place, but inside the rooms, they have gone overboard, the fabrics are a little grotesk and it is all a bit OTT! (A mid eastern european i have to say)", "title": "Beautiful", "helpfulness": 1, "user": "NPUk", "date": "September 21, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20250158, "likes": {"liked": "— Comfort", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Les Fleurs is a city centre boutique hotel in easy walking distance of all the main tourist attractions. The rooms are small but very comfortable, well equipped and tastefully furnished. Everything is good quality and spotlessly clean and the bathrooms are particularly high spec. Staff were all good english speakers and very attentive. Breakfasts were excellent, particularly the hot food which was prepared to order and so freshly cooked. In summary, hard to fault and highly recommended.", "title": "Lovely hotel in great location", "user": "Steve-G23", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 37005900}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We decided to spend a weekend in Sofia to see what it was like, found this hotel on TripAdvisor and saw that they had a special spring deal so decided to take advantage of it. The room (one of their \"luxury\" rooms) was wonderfully decorated with lots of attention to detail. The very large, freestanding bathtub was strewn with rose petals and the deal we got also included amazing chocolate lava cakes delivered to our room. Add in the complementary breakfast (cooked to order omelets, wonderful croissants, cappuccino) in the morning in their comfortably elegant restaurant and we were very happy. The hotel is very well located and all of the staff couldn't be more helpful (they even had someone walk us to the restaurant where we had dinner reservations because we were having trouble finding it.) We would go definitely go back for one of their special deals again - a real bargain.", "title": "Doesn't get much more romantic than this...", "user": "desertdiver", "date": "June 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 33144525}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "As someone who travels frequently to central and eastern Europe I was looking forward to my stay at what promised to be a genuine boutique hotel. Although I had a pleasant stay at the Arena di Serdica a year earlier, I chose Les Fleurs for its central location.", "title": "Design wins over Comfort", "helpfulness": 1, "user": "Fotobear", "date": "June 21, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 32819982}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "The car transfer from the airport to the hotel was punctual and comfortable. The check-in process was rather slow, but at least I was offered help with the luggage and I was also given a quick tour of the room's facilities. The decor in the public areas as well as the bedrooms is fun, if a bit over the top, and the ideas for some features (bubble mobiles on either side of the bed, the half circular shower door) seemed to have come straight out of the design handbook for the 'space age'. Unfortunately neither functionality nor the comfort of the guests seem to have played a big role in the architect/designer's considerations, and the room itself was disappointingly small, with the bed taking up most of the floorspace and no room for any luggage. The bathroom was spacious, but I'd rather have one that's 100% clean and that didn't flood when taking a shower.", "title": "Nice standard", "user": "Svestka", "date": "June 6, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 31701522}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled solo", "text": "Breakfast was, well, weird, with the tiniest buffet I have seen in any hotel ever. Only after I'd sat down with my croissant (which seemed to be the 'safest' choice) did a waitress come and offer coffee and juice, and then only after I had received those did she bring a breakfast menu. Nice, though it would have been nicer to know beforehand. The atmosphere in the breakfast room is dungeon-like, not a place you'd like to be for much longer than ten minutes or so.", "title": "Nice and well-located", "user": "Keremis", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 30422067}], "location": {"country": "Bulgaria", "continent": "Europe", "city": "Sofia"}, "stars": 4, "variance": {"poor": 1, "average": 3, "very good": 40, "terrible": 2, "excellent": 46}, "aka": "Les Fleurs Hotel", "slim_ranking": 0.116666666667, "description": "Situated in the heart of the city of Sofia, at the foot of Vitosha Mountain Les Fleurs Boutique Hotel is unique with its exquisite décor, floral surroundings and elegancy. The hotel is located in the area of main shopping and historical attractions - St. Nedelia and Alexander Nevski Cathedral, Russian Church, National Theatre, many Museums and City Art Gallery. Business travelers appreciate their close accessibility to the main commercial, financial and administrative buildings.Hotel Les Fleurs is only 20 minutes away from Sofia airport by car. The stylish guest rooms have been smartly equipped with work area, minibar, safety deposit box, Free WIFI and 24 hours Front Desk Service. To revive the body and soul, a fitness center is available nearby the hotel. For the culinary at heart, Le Bouquet Restaurant offers its delicious food. Our Chef’s homemade cake, served in the hotel lobby. The atmosphere which makes all our guests to feel like home."}