{"user_rating": 4.0, "review_count": 181, "name": "Lesse Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Just returned back last night from the Lesse hotel. myself & my boyfriend stayed for a week and had a fabulous time. Hotel is quite quiet with not much to do on an evening, however you can walk into the main square which has plenty of bars and places to eat. We went on the sunshine cruise excursion which we would highly recommend, had a really nice day sailing the sea, and stopping off at various remote beaches.", "title": "Fantastic Time @ The Lesse!", "user": "Allie86", "date": "August 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 74635855}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel itself was spotless, and the staff were really friendly, we especially enjoyed the Greek BBQ night which they seem to do every Thursday, the food was excellent!! It was also great to see the bar staff (especially George) dressed up in traditional Greek dresses lol! The only little thing negative to say about the hotel is the showers....one minute your being frozen to death then the next minute your being burnt alive! so just be careful with that! :-) Lauren the rep was fab aswell, really knowledgable and new everything about Halkidiki and the surrounding areas. All in all we loved our stay at the Lesse, and would definitely recommend it to friends and family as a fantastic hotel to stay in, for a relaxed, chilled out break away! :-)", "title": "Lovely!", "user": "GolfersWidow", "date": "August 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 73644532}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The Hotel was very clean, the pool area was lovely! Plenty of Sun Beds with a fabulous view of the sea!", "title": "Brilliant holiday!!", "user": "Sophie1712", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73002134}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The staff were very friendly with excellent English and they all worked very long hours. Rooms were clean and large, bathrooms were a little small and there was battle with the shower curtain whilst in the shower.", "title": "Lesse is More", "user": "52Asher", "date": "July 27, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 72569962}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We booked our holiday with First Choice and the Rep Lauren was very good, very friendly and knowledgeable of the area.", "title": "Really lovely", "user": "Suet1408", "date": "July 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72510886}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We went to Greece because I have been once before and wanted to introduce my partner Dan to all the great food out there. We looked up the Lesse and thought it looked okay but when we arrived we realised that the brochure had not done it justice, it was great! The pool is fantastic with plenty of space for everyone and lots of sun loungers. We flew from Luton - which left uber early but go us there just in time for lunch, we immediately headed to the bar, which is decorated in a chill-out style with constant table service, happy hour from 19:00-21:00 so definately worth getting in there early. There was a mini market on site and we found that they were as reasonably priced as the other places so after day one we just brought water etc from there.", "title": "Lesse means more...", "user": "wotters_k", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79655036}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "The hotel accomadation is superb, made all the more impressive by the constant attentiveness of the staff who are continuously smiling, nothing is too much trouble for them, big shout-outs to George and John from the bar, if you go try the Rusty Nails, Skittles and Dr Pepper drinks as they are lethal but excellent. Also the owners, Thassos and Anastacia who were always available for recommendations on restaurants, day trips and local nightlife and Thassos kind of stole the show at Karaoke on our last night. However I will always remember Las Ketchup by John....watch out X Factor...", "title": "Sun, Pool, Amazing Staff...what more could you need?", "helpfulness": 1, "user": "trophysophie212", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79603505}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We were surprised by how often our rooms were cleaned and our towels were changed, it meant every afternoon we had our lovely clean room to retire to and the air conditioning was powerful and not noisy...unlike some other places we have stayed.", "title": "FANTASTIC STAFF=FANTASTIC HOLIDAY!", "user": "welshdragon1963", "date": "September 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 79558977}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We went B&B and had self catering facilities within our room but to be honest we didn't need them because we ate out every night, we found a lovely restuarant called Tropicana in the main part of Hanioti (a 10-15 minute walk) and we ate there most nights, even recommended it to other people at the Lesse and they liked it too, great filet steak and fabulous Sea Bass.", "title": "Great Hotel", "helpfulness": 1, "user": "jaxxy031", "date": "September 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 79040033}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Hanioti itself is touristy (I don't think this is a problem though), it has a choice cocktail bars, restaurants, gift shops, mini market, pharmacy and 3 cash points, ice cream, bakers etc, everything you might want. We enjoyed the drinks at Kelfos where they serve large and usually sparkling cocktails, also for the more hardened drinker they sell fishbowls of Long Island Ice Tea...yum. There were places to watch the football (England Vs Switzerland, Arsenal Vs Bolton) and we liked the fact that we had the choice to go somewhere and watch if we wanted.", "title": "Lazing out at Lesse", "user": "ters100", "date": "September 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 78345642}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "The Lesse is a very friendly, clean, tidy, well kept hotel. The pool area is superb and the bar and pool staff do all they can to make your days as pleasant as possible. The rooms are spacious, simple and clean, the bathrooms are normal hotel bathroom size, I wouldn't describe them as pokey at all, the shower does run hot and cold though.", "title": "Lovely hotel, wouldn't go back to Hanioti", "user": "Eaveswig", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 77818682}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "The breakfasts cannot be faulted. We also ate in the restaurant in the evenings on a few occasions as well as the weekly Greek night, the food was perhaps the best we ate on this particular holiday, even though I'm not a fan of buffets, the quality was great.", "title": "The Lesse Hotel really cannot be faulted !", "helpfulness": 1, "user": "Somersetsteve2", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77235215}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My one criticism is not really a criticism of the hotel itself. The location is, as the descriptions state, 150 metres from the beach but there is very little on the beach in the way of tavernas or places to eat. My perfect day would be laze on a sunbed then drag myself to a lovely taverna overlooking the sea for a cold Mythos and a greek salad then back for a swim. There are beach bars but no restaurants, we ended up having to go back and eat at the Lesse pool bar each day, again very nice but a bit repetitive.", "title": "Good for beach and resort centre", "user": "Skellys", "date": "August 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 5.0}, "id": 75600408}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "It seems that the area around the Lesse is full of villas and apartments for wealthier Greeks. Even further in to Hanioti there is little beachside eating and drinking to be done. With young children we weren't really mobile enough to wander around and find places in the heat of the day, so back to the Lesse it was and relax by the pool in the afternoon.", "title": "this hotel was perfect in every way", "user": "scottiezx9r", "date": "August 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 74792457}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "At night, Hanioti does bars and gyros joints very well but again there is less of the traditional, quaint, Greek taverna. If this is what you're after, I'd steer clear of this resort.", "title": "Adequate", "user": "pinuk", "date": "August 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 74663956}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I normally never book package holidays, but after being given some First Choice vouchers for Christmas and struggling all year to use them, I finally gave in and booked the Lesse hotel for 6 days.", "title": "It grew on me...", "user": "Beckiboo1983", "date": "October 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 81844027}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The first thing I saw when I arrived was a sign for \"kareoke on Sunday nights!\" to which I groaned inwardly at the thought of this being a typical \"Brist Abroad\" type of hotel, which I normally try and avoid!", "title": "GREAT HOLIDAY - BUT", "helpfulness": 3, "user": "Jenmartl", "date": "September 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 81377554}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "When we arrived the first room we were given was on the ground floor, even though I had specifically asked for a sea view. I went to chat to the hotel manager, and rather unfriendly pregnant lady who told me to \"go and sit down for 10 minutes\" and she would see what she could do. Finally she came over to say she had a room on the second floor. She made me feel as though she was doing me a massive favour by changing rooms, not really how a new guest wants to feel upon arrival.", "title": "Nothing Special - Just OK", "user": "justroving", "date": "September 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 80320177}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The rooms were... ok I guess. The furnite is quite old and dated. The bathroom especially is no way a 4 star, more like a two star! The shower was in dire need of replacement and kicked up a funny smell when you got in and started the water.", "title": "fun pool", "user": "jetsetter087", "date": "September 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 80164411}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "The actual bedroom was big with two single beds pushed together (we're a couple) and a balcony looking out to the forest and the sea. The room was pretty clean, although we did find a trail of ants eating a discarded sweet in the corner of our room on the second night.", "title": "Don't expect lifts to the upper floors'", "user": "MaryDee59", "date": "September 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 79958476}], "location": {"country": "Greece", "region": "Central Macedonia", "continent": "Europe"}, "stars": 4, "variance": {"poor": 10, "average": 23, "very good": 52, "terrible": 5, "excellent": 91}, "aka": "Lesse Hotel Hanioti", "slim_ranking": 0.24}