{"user_rating": 4.5, "review_count": 65, "name": "Lighthouse Bay Resort Hotel", "reviews": [{"rating": 5.0, "title": "Our Own Private Paradise", "text": "This was an early 10th anniversary trip for my husband and me. We've always been intrigued by Barbuda. It sounded like Paradise (at least to us) but very little is written about the island. When we found out about the Lighthouse Bay Resort Hotel, we knew we'd end up there one day. This trip was taken the last week of August 2009. We were there for 5 nights and arrived on the island via Winair.", "user": "MrsTraveler", "date": "September 5, 2009", "id": 39830597}, {"rating": 5.0, "title": "It doesn't get any better than this!", "text": "Upon landing on Barbuda, we were greeted by a resort employee (Luenda), driven to the nearby lagoon pier where we were taken on a 15-minute boat ride to the resort.", "user": "Melletonia", "date": "August 29, 2009", "id": 39185952}, {"rating": 5.0, "title": "We found paradise!!", "text": "THE RESORT: The Lighthouse Bay Resort is a brand new hotel set on a GORGEOUS stretch of beach. The resort is literally on a narrow piece of land with the sea on one side and a lagoon on the other. It has only 9 rooms. The food is included in the room rate. There's a pool if you need a change from the sea. There's free internet connection for those of you who can't bear to be totally disconnected from the outside world.", "user": "nikkifromholland", "date": "July 27, 2009", "id": 35907006}, {"rating": 5.0, "title": "A Jewel of the Caribbean", "text": "OUR ROOM: We stayed in a master suite and may I say WOW?! Like the resort, the suite is beautifully decorated. It has a separate living area, flat-screen televisions (satellite TV) in the bedroom and the living room. The bathroom has a huge walk-in shower and a vanity with 2 sinks. The front door opens to the pool area. The back door opens to a balcony with a view of the lagoon.", "user": "meng44", "date": "July 24, 2009", "id": 35680602}, {"rating": 5.0, "title": "Paradise Revisited!", "text": "THE BEACH: This 17-mile long beach is STUNNING. The color of the water will make you sigh. Surprisingly, the water is not as clear as one would think... a little bit cloudy due to the fine sand maybe? I'm really not sure why. The sand is soft and perfect for long walks. On the water's edge, there are some bits of coral, broken shells that make the sand pink. Once you're in the water, the sand is once again completely soft and smooth. The sea is like a big pool. We were told there's no good snorkeling off this beach so we didn't try to snorkel. However, my husband did spot a sea turtle while swimming. I was in our room so I completely missed it. :-(", "user": "SJ*HL*S", "date": "July 14, 2009", "id": 34786359}], "location": {}, "stars": 3.5, "variance": {"poor": 1, "average": 1, "very good": 2, "terrible": 6, "excellent": 55}, "aka": "Lighthouse Bay Hotel Codrington", "slim_ranking": 1.0, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 5.0, "rooms": 4.5, "location": 5.0}, "description": "Luxury Boutique hotel on one of the last remaining secluded beaches in the Caribbean. Surrounded by water, your own private island getaway. Luxurious accommodation with all amenities imaginable. Top Class European Caribbean cuisine in a splendid setting, on the beach. Attentive service from the friendliest people of Barbuda the Lighthouse Bay Barbuda will fulfill your vacation dreams."}