{"user_rating": 4.0, "review_count": 718, "name": "Lilianfels Blue Mountains Resort & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "I have been lucky enough to have stayed in many hotels all over the world and this has to be one of, if not the best hotel I have ever stayed in.", "title": "I cannot fault this outstanding hotel.", "user": "MatthewGreen", "date": "December 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187782903}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "The location is fantastic and the overall feel of the \"resort\" is utterly charming, like an elegant and yet cosy country house. Some could argue the décor of the rooms is overly floral or twee but it utterly suited the hotel and I found it to be very smart.", "title": "Excellent!", "helpfulness": 1, "user": "Majocale", "date": "December 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187392537}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "The bedrooms are beautiful, large, well appointed and come with fantastic marble bathrooms. The public areas and gardens were all impeccably maintained with beautiful indoor and outdoor pool areas.", "title": "Good quality, good service", "helpfulness": 1, "user": "Kate M", "date": "December 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187146056}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "I should also mention that the staff were excellent being warm, friendly and professional without any pretentiousness which can often be a case in hotels that consider themselves superior.", "title": "Lovely place for a long weekend", "user": "Kelliekat", "date": "December 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187120847}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled with friends", "text": "I would absolutely recommend this hotel to others.", "title": "A relaxing place to stay", "user": "pathogens", "date": "December 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 187092608}, {"rating": 5.0, "title": "Totally Spoilt", "text": "We have just returned back home Sydney from 2 nights, at Lillianfels. The whole experience was fantastic. From the first contact by phone to book to the very last minute, with Paul getting the car delivered to the front door ( due to my mother not being able to walk very far) the service was outstanding. Special Mention to Sarah at breakfast too.", "user": "Mudda1961", "date": "December 1, 2013", "id": 186391332}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "No only did she remember that we wanted to sit by the window, but she also remembered what type of eggs we had & what coffee & tea we both ordered the morning before. Impressive !!! Jess was also very professional & accommodating when looking after at The Orangery restaurant. All staff were attentive & professional. Highly recommended. Can't wait to return soon with my husband.", "title": "Silver experience", "user": "Christine D", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186212096}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We have just returned from a spectacular 4 days spent celebrating our 25th wedding anniversary at Lilianfels in the Blue Mountains.", "title": "Comfy & Magical", "user": "senorita08", "date": "November 27, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 186123800}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The whole experience was luxurious. We enjoyed the well appointed room, the heated indoor pool, hearty breakfast, meals in the dining room near the fire and of course the very special 'Royal Temple' massage in the SPA.", "title": "Tea for Three", "user": "lizziecritt", "date": "November 26, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 185931443}, {"rating": 4.0, "stay_parameters": "Stayed November 2013", "text": "We ate at Darleys Restaurant on the night of our anniversary and this was a spectacular success. Beautifully designed food that looked and tasted superb accompanied by some lovely wine. The staff were friendly and professional without being at all intrusive on the meal they made us feel welcome and special.", "title": "Very tranquil", "user": "Atw86", "date": "November 26, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 185918224}, {"rating": 3.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Over the years we have stayed at Lilianfels many time, we had our family Christmas’s there when our Children were young, and the only down side to our stay was the room, stain on carpet, basin was chipped, some of the wallpaper was coming loose and there was dirt/maybe light mould above the bed on canopy ceiling, it just didn’t feel as clean as usual and we had to ask for tissues and soap.", "title": "Staff, Darley’s and other facilities were great but disappointed by the room", "helpfulness": 1, "user": "JohnP P", "date": "December 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 187010469}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "I hope I’m wrong but I can’t help feeling that because we had pre-paid we got substandard, substandard for Lilianfels, accommodation, the hotel was nearly empty, so there should not have been any shortage of rooms and one shouldn’t have to complain to get up to the standard accommodation.", "title": "Old World Charm Today", "user": "Joey A", "date": "December 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186712622}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Arriving late, hungry and in rain did not diminish the warmth of the hotel's charm nor its formidable staff. Once helped to our lovely room (looks just like the photos) by a wonderfully warm & cordial young man in Reception, we dined in the opulent yet comfie dining room. That first meal was as excellent as every other meal eaten @ Lilianfels over our 3 days. We indulged in High Tea one afternoon in the Lounge. A definite must!", "title": "Fabulous resort, perfect location", "user": "ilab", "date": "December 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186694474}, {"rating": 5.0, "stay_parameters": "Stayed December 2013, traveled as a couple", "text": "Our room overlooked the escarpment. It was in a wing with a dormer. Large and well appointed, but very cosy.", "title": "Ultimate Service and Luxury", "user": "Dawn R", "date": "December 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 186691574}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "A special mention to Anthony in the dining room - who initiated the high level of service on our 1st evening that continued with all the staff throughout our stay; to David at the front desk - who provided us with detailed information and maps of hikes in the area. We particularly enjoyed the hike starting across from Solitary Restaurant in the Leura area - 5 minute drive from hotel.", "title": "Attention to Detail, Excellent Service, Great Food!", "user": "Staywise", "date": "December 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186391773}, {"rating": 1.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "We stayed in the deluxe twin room for two nights starting from 12 Nov 2013. The room is spacious. However, this resort is far from providing \"five-stars\" services. One main complaint was the housekeeping did not make up our room during the second day.", "title": "Poor housekeeping", "helpfulness": 3, "user": "Poh182", "date": "November 22, 2013", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 185469131}, {"rating": 5.0, "title": "Superb stay", "text": "When we complaint to the front desk, they claimed that their housekeeping will not make-up room unless guest places the \"make-up\"sign on the door. This is our first encounter of such weird practice after having stayed over hundreds of hotels worldwide.", "helpfulness": 1, "user": "Caroline B", "date": "November 18, 2013", "id": 185127821}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "Ironically, when we checked our room, we could only find two \"Do not disturb\" signs. Thus we are not sure whether this was a deliberate attempt for housekeeping to avoid cleaning up room.", "title": "Stunning!", "user": "Nomesy82", "date": "November 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 185122844}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Staying at Lilianfels was like being wrapped in a big fluffy blanket and being utterly looked after. Pity we only stayed one night. The rooms were of a decent size with exceptionally comfortable beds. Good sized bathrooms and bath! Breakfast was beautifully cooked, some of the best scrambled eggs in an hotel I have had in a long time. Would thoroughly recommend staying here.", "title": "Peaceful & Relaxing", "helpfulness": 1, "user": "Marty533", "date": "November 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184645450}, {"rating": 5.0, "stay_parameters": "Stayed November 2013", "text": "What a beautiful resort. It was in a great location, just walking distance to the 3 Sisters, and a very close drive to the centre of town. The beds were very comfortable, and products in the bathrooms were lovely. We dined at Darley's which was an outstanding experience. Service throughout the property was exceptional.", "title": "Relaxing", "user": "Marian T", "date": "November 13, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 184559225}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 42, "average": 124, "very good": 186, "terrible": 20, "excellent": 346}, "aka": "Lilianfels Blue Mountains Resort And Spa", "slim_ranking": 0.125, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Lilianfels Resort and Spa is a renowned haven for relaxation in one of Australia's most beautiful destinations. This multi-award winning hotel & resort is set amidst two acres of manicured gardens, overlooking the most spectacular scenery in the World Heritage Listed Blue Mountains National Park in NSW, Australia.Blue Mountains Accommodation | Blue Mountains HotelLilianfels Resort and Spa is a 5 Star resort with 85 Deluxe rooms and Suites. Onsite recreational facilities include heated indoor and outdoor pool, tennis court, billiard/games room, library and gym. Lilianfels is perfectly located within 5 minutes walk to the iconic 3 sisters rock formation at Echo Point and is close to all major attractions including Scenic World, Leura shopping village and award winning restaurants. Blue Mountains Dining | Blue Mountains RestaurantSituated within the grounds of the historic homestead of Sir Frederick Darley, Lilianfels is home to the multi-award winning Darleys Restaurant which features the best seasonal produce from the region, served in an elegant and romantic setting that is unmistakeably fine dining. Celebrate that special occasion in glamour and experience the revival of Lilianfels 'Old World Charm' as we invite you to peruse and tempt your palette with our new A La Carte Menu.Re-discover why our Multi-Award winning Restaurant excels again in style and service.Blue Mountains Conferences | Blue Mountains MeetingsWith meeting and events space for up to 100 guests complete with state-of-the-art equipment, 85 spacious accommodation rooms to house your delegates, and a fabulous array of fine dining options to choose from, it’s the ideal setting for meetings and conferences which will show your colleagues or clients how much you value them.Blue Mountains WeddingsThis European style country house hotel specialises in smaller weddings and events of up to 100 people. Personalised service, exceptional facilities and thoughtful attention to detail, accompanied by stunning views of the Jamison Valley make the hotel the ideal wedding venue.Blue Mountains Spa | Blue Mountains Beauty TreatmentsLilianfels is also renowned for its Spa. Guests can indulge in an array of soothing spa treatments individually tailored to refresh and rejuvenate. Enliven your senses with our soothing and restorative body and beauty treatments delivered by a team of caring and talented spa professionals.Dining with Spectacular Views at our sister property – Echoes RestaurantDiscover why Echoes Restaurant was awarded best regional restaurant in Australia by AHA in 2012. The combination of fine dining and spectacular views of the Jamison Valley have made Echoes a destination in the Blue Mountains."}