{"user_rating": 4.0, "review_count": 384, "name": "Lindner Grand Hotel Beau Rivage", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "This hotel is definately not a 5 star hotel as rated.The hotel does not have the facliities of a 5 star.They do not have an kettle in the room which is a basic always.The service was not good at all at the reception.The attendant was pretty rude and had an attitude.Otherwise the place is ok.The food and breakfast were average nothing great.There is no interlaken view from the rooms.The pool water is cold and not something that you can swim in and the authorities do not do anything about it..Overall was very dissappointed with the service provided.", "title": "Not a 5 star!!", "helpfulness": 1, "user": "Vishkru", "date": "October 22, 2008", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 21089367, "likes": {"liked": "— Convinient", "disliked": "— Service"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The Beau Rivage is in a great setting with excellent views from rooms on the front of the hotel. Front desk staff was friendly and helpful and the buffet breakfast was wonderful. Rooms were very dated; bed was uncomfortable and too much street noise. Also, there was a convention at the hotel and getting through the lobby was difficult and they dining room one evening to accommodate the convention goers at the expense of individual guests. Would not stay here again.", "title": "Showing its age", "user": "4MillionMilesLater", "date": "October 12, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 5.0, "rooms": 2.0}, "id": 20826665, "likes": {"liked": "— location", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "My wife and I stayed at the Beu Rivage for three nights and had a very nice time there.", "title": "Great 5 star hotel at a very reasonable price.", "user": "Daniel025", "date": "October 8, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20717373, "likes": {"liked": "— The views form our room.", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007", "text": "The property is very beautiful, with a nice garden and a charming entrance.", "title": "Nice Hotel", "helpfulness": 2, "user": "FatSuen", "date": "September 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20461876}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Even though there were some conventions going on and we were the only ones wearing hiking boots at breakfast, the hotel is very nice and very easy to reach by car. The parking lot is huge and you do not get charged for parking.", "title": "defination for 5 Star has been changed", "helpfulness": 2, "user": "guptavikash", "date": "September 24, 2008", "detail_rating": {"front_desk": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 20328282, "likes": {"liked": "— View from Some rooms", "disliked": "— room"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "First of all, I cannot believe that anyone would give this property a ONE based on the fact that it 'is not a 5 star hotel'. By doing this you are unfairy skewing traveller opinions. Sure, there are 5 stars down the road from this place (which is more like a 4 star, but a very good 4 star), but they cost up to three times as much! This hotel is beautiful, and historical. The fact that it is so old may be why some consider it a tad rough around the edges, but you can see the amount of care that is put into maintaining such an old property. It is not as easy as maintaining a minimalist boutique.", "title": "Beautiful Experience", "user": "Surlaplage", "date": "March 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 26805527}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "The views were breathtaking. The rooms were a little dated, but this is definitely reflected in the cost! They were clean and the bathrooms were very new. The breakfast buffet was wonderful. There were options for any dietary needs and the coffee was fresh and tasty. The breakfast room was gorgeous and full of the old world charm that is reflected throughout this hotel.", "title": "Old hotel with character with breathtaking views.", "user": "JDJackie", "date": "March 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26184812}, {"rating": 3.0, "stay_parameters": "Stayed March 2009, traveled with friends", "text": "I am glad I stayed here. If you want a 5 star there are others in the area, but you will not get the value that you get here. My only complaint was the price of wifi, but this is a typical problem in Europe.", "title": "Good Option For Interlaken", "helpfulness": 1, "user": "SHFT54", "date": "March 5, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 25666052}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "Stayed here on recommendation of a friend. Location was great. Views were awesome. Hotel room was spacious. Somewhat dated interior but it has great character. Nice spa, ski room and very helpful staff.", "title": "One of my best experience in Switzerland", "helpfulness": 1, "user": "soleil_azia", "date": "February 20, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 24850903}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Room felt like I was staying at my Grandma's house, which is good and bad. Room was cozy and very big and had a great view out all 3 windows. The furniture and carpet very old though. You could feel the springs through the mattress and the tv was old and oddly placed where you couldn't use the remote from the right side of the bed. The key to the room weighs like two pounds and is very bulky to carry around(encountered similar in other Swiss hotels). The bathroom is nice but poorly arranged as you have to sit on an angle to use the toilet due to heater in bathroom. But fresh robes and slippers are a nice touch. Location is a big plus, walking distance to the train station for anyone in any kind of shape, and if you can't make it there's a free shuttle. It's also close to dining and entertainment in Interlaken. Thr free breakfast was nicer than most hotel buffets. Many coffees are available made to order including expressos, lattes, cappuccinos, etc. Eggs are also made any way you want. The staff was awesome in informing us about Jungfrau train schedules, help finding our hotel in Thun, and recommending Laterne( a restaurant well off the tourist path in Interlaken. We kept joking that the hallways to the rooms looked like the ones in the movie The Shining and the outside looked like a haunted mansion, but they're both very nice. The lobby is also very grand in decor. For anyone wanting to stay in Interlaken I'd highly recommend this hotel, however if like most your just there to visit the Jungfrau I'd recommend staying in Wengen, Murren, or Grindlewald. All my grips with this hotel were just minor to me and are expressed just to give you an idea of what to expect.", "title": "Beautiful room with a view", "helpfulness": 1, "user": "nursemillymolly", "date": "February 8, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 24378964, "likes": {"liked": "— the view", "disliked": "— the bed"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Delightful looking hotel. Very comfortable bedroom and modern bathroom. Excellent breakfast in lovely room, in better weather, breakfast can be eaten on the patio which is wonderful. Helpful and fairly friendly reception staff. Great location, very close to Interlaken West station (3 minute walk). On arrival at the station with suitcases, we called the hotel and were picked up and driven to the hotel. Interlaken West is at the quieter end of Interlaken and makes a welcome break from the busy, hustle and bustle of Interlaken Ost. There are plenty of local restaurants. Great trips to do from Interlaken West. I would say the best rooms are at the front of the hotel opposite the mountains. Side rooms might be a bit noisy due to the railway running along side nearby. This is a 5 star hotel but really I would classify this hotel as a good 4 star. An enjoyable stay. Recommend going on the boat trip from Interlaken to Thun and a trip to the Jungfraujoch (only in better weather).", "title": "A lovely hotel", "helpfulness": 1, "user": "nearlyfiftyNorthwood", "date": "September 18, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 4.0, "value": 3.0, "rooms": 4.0}, "id": 20180031, "likes": {"liked": "— Fairly large sized bedrooms and nice bathrooms", "disliked": "— Pillows werent that comfortable"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "I needed hotel very close to the Interlaken Ost station (which is where the trains up to Lauterbrunnen and then Jungfraujoch (3454 meters) leave from). After seeing 2 other hotels with less stars, the Lindner had the best price (274 CHF for a single). And I got a mountain and river view room, very quiet. Room a bit small but quite OK. Had all I needed. I did not eat there and had no time for breakfast, but had a great dinner in my room from a take-away between station and hotel (3 minutes walk), there is a cheap Italian and a Chinese restaurant there to take-away.", "title": "Great location, price relatively good", "helpfulness": 3, "user": "vanderveldenton", "date": "September 18, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 20166482, "likes": {"liked": "— Location and price", "disliked": "— Nothing offered to me when having to leave before breakfast (included in price)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Not all staff very friendly and I was not offered anything for a alternative breakfast when I had to leave at 6 AM but saw filled paper bags standing on the counter.", "title": "Nice hotel", "helpfulness": 1, "user": "JohnMooney", "date": "September 14, 2008", "detail_rating": {"cleanliness": 4.0, "front_desk": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 20058027}, {"rating": 3.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This hotel is 5 stars but in the hotel chain it is in it is not in the \"Deluxe collection\" but the middle class, which shows it might be better called a 4 star.", "title": "doesnt live up to the price and name!!", "helpfulness": 2, "user": "phatbrainz", "date": "August 29, 2008", "detail_rating": {"value": 1.0}, "id": 19523750, "likes": {"liked": "— The pool, friendliness of the few staff, the nutella", "disliked": "— the less that five star service and room quality"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "But a great, albeit short experience.", "title": "a very pleasant stay indeed", "helpfulness": 2, "user": "akglobalmaharaja", "date": "August 28, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19457148, "likes": {"liked": "— the lake flows just behidn the hotel and its walking distance from the station", "disliked": "— the staff wasn't very fluent in english"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "we arrived at the hotel about 6 pm on a snowy cold night to meet by a very helpful and polite front desk lady who informed us we had been up graded to a junior suite, gave us all the information we needed and was very helpful.", "title": "great hotel and staff", "helpfulness": 1, "user": "wayneanddee", "date": "December 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22410792, "likes": {"liked": "— staff", "disliked": "— internet price"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "the room was beautiful, suited the style of hotel was always warm and very clean. and quiet.", "title": "Loved it", "user": "Dianer11", "date": "November 20, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 22037660}, {"rating": 1.0, "stay_parameters": "Stayed November 2008", "text": "breakfast was very good again with very helpful and polite staff.", "title": "not a 5 star", "helpfulness": 6, "user": "siraj_chowdhry", "date": "November 10, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 21699739, "likes": {"liked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "having worked in hotels for 26 years this was a great change to see that a hotel run very profesionaly with great staff.", "title": "good location and quality", "helpfulness": 1, "user": "JulzE", "date": "November 7, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 21637266, "likes": {"liked": "— location, quality,pool, spa"}}, {"rating": 5.0, "title": "Fine Hotel and a Great Location", "text": "as we were there for my wifes birthday, a nice supprise was the champange delived to our room complimeof the hotel, just another nice thing offered from the staff", "user": "night_train_george", "date": "October 22, 2008", "id": 21103455}], "location": {"country": "Switzerland", "continent": "Europe"}, "stars": 5, "variance": {"poor": 34, "average": 81, "very good": 108, "terrible": 22, "excellent": 139}, "aka": "Lindner Grand Resort Beau Rivage", "slim_ranking": 0.625}