{"user_rating": 4.0, "review_count": 105, "name": "Links House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My partner and I recently spent a night here. We selected randomly after reading TA reviews. The staff were very nice and friendly. The rooms were clean and olde worlde, but we were very disappointed by the bathroom. Very tiny. You would have great trouble swinging a cat there. Also disappointed by the stuffiness. It was very hot and we only had a ceiling fan that was adjusted to one speed. Aesthetically, the building and gardens are very pretty, but you can get a better overnight experience elsewhere. The highlight was the food. Although we waited for 45 minutes for our main course in the hotel restaurant (and it was NOT busy), the dishes when they finally arrived were divine. Confit duck and Atlantic Salmon done to perfection. Deserts were gorgeous - the best Sticky Date pudding I have ever tasted. A la carte brekkie the next morning was delicious. This place is well worth a visit for the food.", "title": "Amazing cuisine", "helpfulness": 2, "user": "Cosmiclove12", "date": "January 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 148943049}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Thanks so much to the great staff for their care and friendly service. We only stayed one night but it felt longer - so relaxing. Beautiful, quiet setting, country ambience. It was all we had hoped for and more. Food was divine - we enjoyed our dinner tremendously and breakfast was the best we have experienced in any hotel previously. We will keep Links House on our list of favourite places to stay and will book again when returning to the region.", "title": "Links House -relaxed, friendly and inviting atmosphere!", "helpfulness": 2, "user": "Bernice B", "date": "December 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 148468338}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Packages sold for this hotel include a set menu for the dining room. Check out the La Carte as we visit this dining room when we can without staying there as we have family in the region. A French chef in the kitchen means the menu has some excellent choices and a lot of local produce as well.", "title": "Vids - Eat in the dining room", "helpfulness": 1, "user": "JAMO58", "date": "December 23, 2012", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 147931424}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "I'm writing this from inside the property, as I didn't want to forget posting my review.", "title": "Perfectly picturesque", "helpfulness": 1, "user": "SydneyBolo", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 144541139}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We were looking for somewhere picturesque and country with character, but not too 'country styled.' Links House met all my requirements. With a pretty entrance, this house is ideally set opposite a golf course, in a street of grand residential homes. From the front it looks like a house, with 2 living rooms and the reception area, plus the dining room and a small bar.", "title": "Links House - what an awesome experience!", "user": "AussieandPaddy_14", "date": "October 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 143329311}, {"rating": 5.0, "title": "Great atmosphere and service", "text": "How refreshing to stay at a hotel where you are made to feel like one of the family. Great service by Lisa and Michael and the other staff and the best steak either of us have had in a good long time.", "helpfulness": 1, "user": "Anne C", "date": "April 7, 2013", "id": 156850394}, {"rating": 5.0, "title": "Don't eat or stay anywhere else!", "text": "The rooms are comfortable and well appointed and the common rooms, the lounge and dining rooms, cozy and inviting.", "user": "Rocket R", "date": "April 4, 2013", "id": 156560497}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Great value too so it's all good news!", "title": "Tranquil, made you feel right at home", "user": "Chris S", "date": "April 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 156433280}, {"rating": 5.0, "stay_parameters": "Stayed March 2013", "text": "Wow, from the moment you arrive you feel like a king (or queen). Great service (waiter Michael) and sensational food, wine and coffee in the restaurant (recommend the rib eye for dinner and omelette for brekky). Refreshing to stay here rather than a traditional chain hotel! Ps views of golf course from restaurant are also nice!", "title": "Welcoming, comfortable and well-catered!", "user": "MGGra", "date": "March 31, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 156201917}, {"rating": 4.0, "stay_parameters": "Stayed March 2013", "text": "We took a little get away over the Easter break, the room configuration (we had booked a family room) could have a been a little better as we got stuck with the single beds as they were in the main room, which gave us access to the entrance door, fridge and TV as we have a little 16 month old boy we felt ensuring he had uninterrupted sleep was more important than having the queen bed. Overall it was a great hotel with welcoming hosts, happy to accommodate all our needs and in nice grounds and a spacious lounge with an open fire place which was great in the afternoons. The restaurant had a great breakfast and we hope to venture to enjoy the restaurant at night as the menu sounded really nice next time we visit Bowral.", "title": "Beautiful home, great gardens, brilliant breakfast!", "user": "Heiners", "date": "March 23, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 155386478}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled solo", "text": "I stayed there for 2 nights recently. I was staying in the Links Suite which is supposed to be their best room. While it was clean and spacious, the bathroom was very basic and tired. In fact the bathroom was not cleaned after the first evening. The front gardens are tidy the back were not well kept. The restaurant was nice. I felt that it was expensive for what it was and as such may not return when I next head to Bowral.", "title": "Nice but tired", "helpfulness": 2, "user": "T-A-UK", "date": "June 7, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 163252376}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "My friend and I recently stayed at Links House. Two same sex mates travelling together- not always easy to get a twin bed room but here we did!", "title": "Great experience", "helpfulness": 1, "user": "gardenia09", "date": "May 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 162064624}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "The staff were friendly and nothing was too much trouble. Michael even found somewhere for us to stay the following night as Links House,was sold out. I'm not surprised.", "title": "Flawless!", "helpfulness": 2, "user": "EOGirl", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160742038}, {"rating": 1.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Gorgeous open fire, great breakfast and delightful garden.", "title": "Beware of Additional Costs", "helpfulness": 2, "user": "MrsAShoalhaven", "date": "May 13, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 160624472}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "I highly recommend Links House and can't wait to return.", "title": "A really great B&B in Bowral", "helpfulness": 1, "user": "kentos", "date": "May 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 160125511}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed 4 nights at Links House and thoroughly enjoyed our stay. The hotel has a very nice, slightly older world feel to it (as does much of Bowral). The rooms are very comfortable and clean, though perhaps just a little dated. Our room had a bedroom, sitting area and small en suite bathroom. There is a lounge for guests and a dining room for breakfasts, which also doubles as a restaurant for dinner several nights a week. The included breakfasts were very good and we had an excellent dinner in the restaurant on one night. The dining room has a wonderful outlook across the garden to the Bowral Golf Course across the road. The staff at Links House were all extremely pleasant and helpful and made our stay most enjoyable. The hotel provided me with a discounted voucher to play golf at the Bowral Golf Course, which is an excellent course. The hotel is fairly pricey, but worth the money. No complaints whatever about Links House and would be very happy to stay there again.", "title": "Very good boutique hotel in Bowral", "user": "AussieTraveller56", "date": "April 27, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 158917158}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "This was our first stay at Links House and it proved as inviting as many of the reviews suggest. The hotel has a nice feel to it and the staff were very friendly and welcoming. The room we had was more than large enough for two people, with nice ensuite bathroom, adequate hanging space for a short stay as well as two seats (I prefer to sit on chair than on the bed :-). (I think the stand alone Garden Room has a bath.) Despite the cool night, the room was very warm as were the hotel's common areas.", "title": "Warm & Friendly with Good Dining", "helpfulness": 1, "user": "OzSooty", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 158541088}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Drinks are available by the glass from the small bar in the Lounge and while there wasn't an open fire during our stay, I'm sure as the temperature drops, the common lounge area with fireplace would be very popular. The hotel restaurant was a treat, with very nice vegetarian, meat and fish options. The wine selection is small but sufficient with various local wineries also represented. Breakfast was included in the price.", "title": "Great For A Short Getaway", "user": "richardlizkt", "date": "April 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 158081326}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "As the name suggests, the hotel is opposite the Bowral Golf Course, around 2kms from the main shopping area of Bowral. There is plenty of off-street parking.", "title": "The perfect choice for a group celebration", "helpfulness": 1, "user": "Wendy G", "date": "April 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 157779720}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled with friends", "text": "The best thing about this place was it's host. What a nice guy! Nothing was to much trouble. The location is quiet and peacful. We has the small suite, which had a gas fire and separate sitting room. The bed was very comfy with beautiful linen. Breakfast was included, and it was excellent. Thoroughly recommend the moroccan eggs! Peeked into some other rooms..they all looked fine, quie roomy. Only downside...cheap TV has pixelated reception. A good tip too...let the water run in the shower for a while before jumping in...takes a while to get hot!", "title": "Most pleasant weekend - good but misses the top marks.", "helpfulness": 2, "user": "Toya A", "date": "April 14, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 157667699}], "location": {"country": "Australia", "continent": "South Pacific", "city": "Bowral"}, "stars": 4, "variance": {"poor": 7, "average": 10, "very good": 37, "terrible": 2, "excellent": 49}, "aka": "Links House Hotel Bowral", "slim_ranking": 0.111111111111}