{"user_rating": 4.0, "review_count": 53, "name": "Lisbon Serviced Apartments - Bairro Alto", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "For our group of 3 couples and a single friend, you could not do better than to stay in one of the apartments here. We were in the Penthouse Apartment (Loft), and I have to say it was wonderful for our group! From the initial booking from Australia, right through to receiving our bond back, I knew we were dealing with an incredibly professional organisation. All the way from the owner Luis, right through to her cleaning staff, I was so impressed with PAaricia eye for detail. The decor was top notch, the linens of the highest quality, and the kitchen was amazing! Not that we used it at all, as you have the most amazing array of restaurants all within a very small radius! You could live here for years, and not visit the same restaurant twice! There was a choice of 2 subway lines within a couple of blocks, and we made full use of this as well! And the shopping at Chiado which would be about a 5 minute walk, well........!!!! I would not hesitate for a second to come back here if ever I was fortunate to be able to visit Lisbon again!", "title": "Absolutely Ideal!", "user": "raks1979", "date": "July 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115021172}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Apartment great, but the night time noise was terrible, could not sleep between 10 p.m. and 3 a.m.. There was a cheap,1 euro per shot, drinking club opposite, very loud, spilling onto the street outside directly under our window. People pissed up, shouting and screeching.", "title": "No sleep", "user": "SandmanBournemouth", "date": "July 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 2.0, "service": 4.0}, "id": 114993057}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "At the end of the day you need a room to sleep in if you can't do that it's pointless. Sorry I can't recommend this place to anyone unless they're stone deaf or don't go to bed before 3 a.m.", "title": "I cannot thank enough", "user": "dorian095", "date": "July 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 114938230}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I stayed here in September and have to say when we walked down the street that first morning, I was a bit concerned about the choice. The street was strewn with plastic beer/mojito cups. I knew we had landed in the party district. Our concerns were quickly alleviated. Street cleaning crews took care of the rubbish and when we entered the apartment it was a pleasant surprise. The decor was sleek and clean. It was also well insulated from street noise. The combo makes this place a great stay. You will be in the heart of the fun but steps away where you can turn it off in the comfort of your own apartment. There was an issue with the coffeemaker that may have been our fault (it leaked everywhere but we had not used one like this before so it could have been user error). Other than that, the off-premises staff was very attentive, responding within 30 minutes when the Internet connection went down (pretty slow when working).", "title": "Great stay in a fun part of the city", "user": "VAGreg", "date": "September 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118430227}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "One other note if you stay here - just up the hill at the next street there is a bar on the corner called Bar Faia (I think). Have a drink there and meet the waitress who is amazingly friendly and a superb ambassador for the city. She is the short, blonde woman with a positive attitude that is infectious. They serve great sangria blanca. This is a nice quiet-ish bar amidst some pretty crazy places. Great people watching beginning around 10 each night.", "title": "Very nice apartment, but...", "user": "Fredrik H", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 117731011}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Lived with 3 friends here for 3 days. The ad said that the loft were supposed to be 97m3. It was not more then 70m3. Also the pic from webpage was from another apartment then we first was allocated to. We called to Lisbon Serviced Apartments (from the cleaners phone since we did not bring a phone on our one).", "title": "OMG, the location was awfull!", "helpfulness": 1, "user": "DanubianGirl", "date": "September 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 117630251}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We were then 1 hour later changed from 4a to 4b (the only 2 top apartments they have). Both apartments are the same size ~70m3, but 4b atleast had 2 beds (4a have a bed and a sofa).", "title": "Would defo go back!", "helpfulness": 1, "user": "Sukh84", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117072865}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "Unfortunately the AC and internet was not working in our apartment and since we didn´t brought phone we could not call for service. (Did this becuse we were supposed to have internet)..", "title": "A home away from home!", "user": "rewb", "date": "July 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115055103}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "First point -- Bairro Alto is the main bar/nightlife neighborhood of Lisbon. It's a pedestrian neighborhood -- folks party into the street late into the night, and they make a lot of noise, and create quite a mess (all cleaned up by 10 the following morning). If have children or you are not into coming home to partiers on your doorstep and drunken 3 a.m. serenades, choose another location (I think Lisbon Serviced Apts have 3 other buildings in quieter parts of Lisbon).", "title": "Groovy Apt in Bairro Alto", "user": "Anjouan17", "date": "April 27, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 5.0, "location": 5.0}, "id": 128780196}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "But if you DO want to stay in Lisbon's equivalent of the French Quarter of New Orleans for a few nights, you've come to the right place. Large, spacious apartments can comfortably sleep up to 4, and their kitchenettes and washing machines mean you can save a bit of money on restaurants and laundry. Satellite t.v., free wifi...and at far lower cost than staying even in a 3 star hotel. So if you are young or young at heart, consider staying here!", "title": "Hotel Falsely Informs that they have free complymentary parking", "helpfulness": 1, "user": "Jose C", "date": "March 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 125702465}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I stayed in this hotel on january 2012. I booked through Expedia.com. In the site it says \"Complimentary parking is available on site.\" This is false. There is no parking. The hotel is an old building without even one single parking place or garage. Actually, even the access to the street of this neighborhood is restricted and during weekends only cabs and residents are allowed to drive in the streets. So, this hotel has no parking, let alone complimentary. What is sad is that, after two months of my complains, the site of the hotel and the information at Expedia.com, still informs that there is \"Complimentary parking is available on site.\" Absurd.", "title": "Excelent apartment, great location", "helpfulness": 1, "user": "Sara R", "date": "November 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120178008}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Bedroom was very spacious and comfortable. The living/ dining room was also very big and very comfortable (even slept in the sofa one night it was so huge and comfortable). The kitchen was modern and well equipped. We had a few problems while checking in but that was resolved very quickly and efficiently by very friendly staff. If we needed anything during our stay they were very helpful.", "title": "AVOID - unless you love to party", "helpfulness": 2, "user": "LondonTravellingDeb", "date": "October 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 4.0, "location": 2.0}, "id": 119723630}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Would definitely return as it was very comfortable, central (minutes walk from town center and next to ice skating and arena) and was great value for money! Friends who visited also commented on how nice the apartment was. 10 out of 10", "title": "Great apartment", "user": "cwitkows", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 119276063}, {"rating": 1.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "This apt. looks great. It is located in a small street that looks pretty quiet. We stayed in apt. 4A, although the picture from GlobalCityBreak showed another apt. (4B). The apt. is on the 4.th floor, it was very spacious and modern. It did not have two double beds as advertised, only one and a sleping couch. It did not have a dish washer as advertised, but a washing machine instead. But these errors were not not a problem for us.", "title": "Inferno of noise at night", "user": "travelviking", "date": "August 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 136291127}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "So far so good. The problem started at night, 11 pm. when the small bar right beneath the apt. began to attract huge crowds of really noisy people who gathered in the street. They partied all night long 6 out of the 7 nights we stayed there. We had all the windows closed and the airconditioners on to reduce the noise, but it did not help much. It felt like trying sleeping on top of the Wembley stadium during the cup final. We bought silicone earplugs but still did not sleep well, especially our 12-year old son was bothered by the party noise.", "title": "Clean, modern, great location", "user": "ndny25", "date": "July 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134460414}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Don´t go here if you are not part of the partying crowd. Dont bring children here.", "title": "Great apartments", "user": "mtcnyc34", "date": "June 28, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 132928883}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Before deciding on this apt. Global City Break assured me that noise would not be a problem even though it was in Bairro Alto (I told them in advance we brought a 12 year old kid).", "title": "Far nicer than a hotel!", "user": "stickyJ", "date": "May 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129578951}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "When I complained about the noise after the first night Global City Break offered to find us another apt. We declined this offer, wish we had not. We hoped it would get better.", "title": "Best location if you want feel the city", "user": "Charles M", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128964358}], "location": {"country": "Portugal", "region": "Estremadura", "continent": "Europe", "city": "Lisbon"}, "stars": 4, "variance": {"poor": 4, "average": 7, "very good": 15, "terrible": 6, "excellent": 21}, "aka": "Lisbon Serviced Apartments - Bairro Alto Hotel Lisbon", "slim_ranking": 0.845454545455, "description": "The apartments are in a brand new building, centrally located in one of the oldest parts of Lisbon, where you can feel the pulse of city life. Close to the best restaurants, bars, craft shops and commerce these apartments combine the modern, comfortable accommodation of a luxuriously decorated apartment with the service of a hotel. FREEDOM: the sensation of being at home while enjoying freedom in the heart of Lisbon."}