{"user_rating": 4.0, "review_count": 781, "name": "Little America Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "I stayed in the Little America SLC for a few weeks on business travel, so I can provide some good and bad thoughts on this stay.", "title": "Great place, convenient location", "helpfulness": 3, "user": "jastor", "date": "August 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 8349961, "likes": {"liked": "— convenient location", "disliked": "— shower head installed too low."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "First the good...", "title": "Huge hotel", "helpfulness": 1, "user": "SmokeysMom", "date": "August 1, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 5.0}, "id": 8272958, "likes": {"liked": "— The room, the food", "disliked": "— Requests for pillows and menus took a long time."}}, {"rating": 3.0, "stay_parameters": "Stayed March 2007", "text": "The hotel was clean and inviting and the employees were polite.", "title": "Go to the tower rooms", "helpfulness": 1, "user": "jc12100", "date": "July 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 8238936, "likes": {"liked": "— The size of the room and the bed", "disliked": "— Noise and sense of unsecurity"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "The service and food in the coffee shop was great, and was delivered in a decent amount of time.", "title": "Highly recommend, though minor problems.", "helpfulness": 1, "user": "SydneyRom", "date": "July 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 8226312, "likes": {"liked": "— The spacious room and good service.", "disliked": "— Paying for an internet cord. Being assigned to a room needing maintenance."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The gift shops and newsstand provided souvenirs or other necessities that may have been forgotten. (deodorants, hygiene products, etc).", "title": "Great stay in the tower!", "helpfulness": 1, "user": "Gulliver_Ron", "date": "July 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8218923, "likes": {"liked": "— Spacious room and quietness", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "I stayed at the Little America after booking with Hotwire for $85 plus fees. When we checked in we opted to upgrade to a tower room for $40 more. The room was very spacious and clean, it had a separate dressing area with vanity and sink. The bathroom was large and so was the tub ( I love that) with nice toiletries. The big downside was the decor, very grandma like. My room was done is blue and gold and seemed very 1980's elegant. The plasma TV seemed really out of place but much appreciated. we had the breakfast buffet in the restaurant ($13 weekdays) and it was very good although not a hug selection. The staff was very good from the porters to the waitstaff. Would I stay here again? Yes, but I would try to get a different room.", "title": "Nice but a little outdated", "helpfulness": 1, "user": "lauraleigh9mm", "date": "December 20, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 11713459, "likes": {"liked": "— location", "disliked": "— decor of rooms"}}, {"rating": 1.0, "title": "Veneer of Luxury Can't Cover Up Bad Air and Stained Sheets", "text": "We stayed at Little America SLC in late September in one of the 10th-floor tower rooms (we upgraded from the motel room).The room was huge with ornate Louis the XV style furniture and a mirrored bar. It looked nice in a dated, kitchy kind of way and had great views.", "helpfulness": 2, "user": "OaklandSusan", "date": "November 12, 2007", "id": 10780316}, {"rating": 5.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "The low rating is due to the blood stains on our sheets; a cup full of old, wet cigarrette butts on the balcony; bad reception on the flat screen; other guests' second-hand smoke wafting from their balconies into our room (all tower rooms are technically non-smoking, so smokers use their balconies); and very weak air-conditioning (which we tried to use once we closed the windows to avoid the cigarette smoke). We checked-out very early in the morning and mentioned to the polite desk clerk that the room was pretty bad and he graciously apologized. Maybe it was just our room, but I would not recommend this hotel.", "title": "What a Great Surprise", "helpfulness": 1, "user": "Cruiser0814", "date": "November 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 10541185, "likes": {"liked": "— location", "disliked": "— separate buildings, but it was not really a problem."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2007, traveled as a couple", "text": "My husband had a Conference in Salt Lake City and this was one of the two Hotels offering special rates to the conference attendees. We chose this one because it had an indoor pool and what sounded like a nice spa. This sounded good to me, I would have something to do while he worked all day.", "title": "Loved it!", "helpfulness": 1, "user": "Auburn_Traveller", "date": "October 22, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10244393}, {"rating": 4.0, "title": "Great Hotel", "text": "As we got a special low rate we were not in the main building, we thought we would get a substandard room,I believe it was called \"Garden View\", second floor, there were only 2 floors in the building, but it did have an elevator, . To our great surprise our room was wonderful! The room was huge, the bathroom was huge with a double sink vanity. The room was beautifully furnished, not the same old boring hotel colors. The linens were very nice and they would change them at your request. Bathroom amenities and towels were high quality. The information provided told you that you could have a coffee pot in your room if you wanted one, a refrigerator was provided and a very nice wet bar/sink area. Free high speed internet, but you did need an ethernet cable, which we always carry. Newspapers were delivered every morning for free. The concierge was very helpful as were all of the staff. I loved the pool but I did pay the extra fee to use the SPA at the Grand American Hotel across the street, only because it offered more services.", "helpfulness": 1, "user": "Snowbird88", "date": "October 2, 2007", "id": 10033121}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "We stayed at Little America for 3 nights earlier this month, and throughly enjoyed all aspects on our stay.", "title": "Luxury at a low price...", "helpfulness": 3, "user": "icem2829", "date": "January 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 13095658, "likes": {"liked": "— Comfort of rooms, pool area", "disliked": "— Long walk to room, and complete lack of view."}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "From first glimpse the set up of this hotel is a little strange. It's not the most impressive place when you first drive in. Its looks a little old and tired from the outside ( especially the non-tower rooms), but the lobby and most of the interior are superb. It's broken up into motel style rooms with outdoor entrances , garden wing rooms , and tower rooms. The garden and motel style rooms seem to all surround the parking lots. We stayed in a garden view, which actually ended up being a street view. The room was quite a walk from the lobby, and a little confusing to get to, but the room itself was great. Plenty big enough for the two of us, with a large bathroom and seperate vanity outside the bathroom. As other people have stated the furnishing are quite dated, but still very nice. And I found the beds to be outstanding.", "title": "Worst Hotel Experience of My Life", "helpfulness": 1, "user": "chasintrades", "date": "January 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 12852164, "likes": {"liked": "— Checking out.", "disliked": "— Rude, unproffesional staff"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled solo", "text": "As far at the staff, we found nearly everyone we dealt with was very polite and professional and able to handle any request we had. They do seem to have a number of employees who cant speak ANY english though. Which I always find a little strange. I asked 2 housekeepers how to get to the pool area and neither one could understand me. The pool and fitness area were quite impressive. They have a heated outdoor/indoor pool which they keep at about 90. Inside its surrounded by nice lounge chairs much like you would see in any fancy hotel pool. And they also fully stocked changing/showering facilites much like you would find a in spa.", "title": "1 of Da best hotels around overall", "helpfulness": 1, "user": "TRUTH2daPoint", "date": "January 19, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 12779526, "likes": {"liked": "— the size of the room, the cleaniness, the location, the diner"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled with friends", "text": "Little America has great dining choices as well. I noticed a Steakhouse, a full serve coffee shop, a sports bar, and lobby lounge. There may be addittional choices that I didnt see. The only place we ate at was the sports bar, and the food and local beers were very good and well priced. Great place to watch a game.", "title": "Pretty nice place....", "helpfulness": 1, "user": "BananaH993", "date": "January 16, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 3.0}, "id": 12693255}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "All in all this was an excellent place, with especially great value. I will certainly stay here again.", "title": "I should have given it 4 stars, but here's why I gave it 5:", "helpfulness": 1, "user": "Utahrd", "date": "December 21, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 11871507, "likes": {"liked": "— Great location in downtown SLC and it costs a whole lot less than it's hoity toit neighbor to the east.", "disliked": "— 10 bazillion kids in the pool, but what did I expect? It's Utah."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I really could not believe that this was the same hotel shown on their website. It really reminded me of a motel 6, The rooms are arranged in buildings that look like military barracks. They are tiny and the bathroom is so small that you almost have to back in to use the facilities. My no smoking room reeked of smoke and was beside the street with a barking dog in a room in my building. Sleep is impossible since the road noise is constant and loud and the blinds are wraped and will not close properly. There are drapes but if you close them they block off the air conditional vent. There is no in room internet service at all and no work area. The mattress and pillows are out of the dark ages.The cafe was an experience. I sent my food back but it came back worst the second time. How hard is it to scramble eggs with out burning them? The front desk was no help at all. I had prepaid and when I saw my room I requested a refund and wanted to go elsewhere. They refused the refund and they would not move me to another room. In 30 years of business travel I have NEVER been more disappointed by a hotel. This hotel is grossly misrepresented by the hotel's website and by Orbitz. I can make no sense of the positive reveiws that this dump has gotten. The only postive things I can say are that it has a great location, free parking, and the muffins were good in the cafe even if the eggs were burnt.", "title": "This hotel is closer to a motel 6 than a 4 star", "helpfulness": 5, "user": "pugvol", "date": "September 29, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 10019470, "likes": {"liked": "— location", "disliked": "— room"}}, {"rating": 5.0, "title": "Excellent", "text": "Stayed 2 nights we were in the cheapest room, courtside queen,with tax, 100 a night, The room was very clean, there was a slight odor like a musty rug smell, but not bad.", "helpfulness": 1, "user": "EvyDel", "date": "September 23, 2007", "id": 8865281}, {"rating": 4.0, "stay_parameters": "Stayed September 2007, traveled on business", "text": "I would definately choose this option again, Excellent location, felt safe. Ask for a room that opens to the parking lot. The courtside rooms can open to the street or a corridor that is open", "title": "Opulence from a bygone era?", "helpfulness": 1, "user": "thedonk", "date": "September 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8668186}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled solo", "text": "all night which could be unsafe, or the parking lot, that is more of a swimming pool, fountain, garden parking lot.", "title": "Litttle America needs TLC", "helpfulness": 2, "user": "Footloosewomen", "date": "August 24, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "rooms": 3.0, "location": 3.0}, "id": 8499813, "likes": {"liked": "— Food and staff", "disliked": "— Room appearance and odor"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "We were treated royally and had use of the excellent restaurants,", "title": "Good choice", "helpfulness": 1, "user": "Come_to_Canada", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 8420089, "likes": {"liked": "— Clean", "disliked": "— -"}}], "location": {"country": "United States", "city": "Salt Lake City"}, "stars": 4, "variance": {"poor": 38, "average": 79, "very good": 277, "terrible": 30, "excellent": 357}, "aka": "Hotel Little America", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.0, "location": 4.5}}