{"user_rating": 4.0, "review_count": 81, "name": "Locanda l'Elisa", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "This hotel is just not worth the money. Our room cost 390 euros for one night and although it was nice, it wasn't THAT nice! The bathroom wasn't very clean either. We thought the pool and sumptous breakfast might make up for it but the pool was so cold that I couldn't get into it and my husband had to grit his teeth to jump in. The breakfast was a huge disappointment for such a pricey hotel. i was offered a bowl of museli and a coffee with one croissant and I overheard another guest say that there was cheese in her cheese omelette which she had paid extra for! The hotel has a very small bar area and restaurant but we chose to eat out at the fabulous da Giulio trattoria in Lucca which made our whole visit worthwhile....", "title": "not worth the money", "helpfulness": 7, "user": "Kathyweston", "date": "June 11, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 4.0, "service": 3.0}, "id": 5331318}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Arrived from Venice for 6 nights in a Suite (maybe a Junior Suite). A few kilometres outside of Lucca. Great for getting into town, either driving or getting a taxi. I thought the room was a little noisy but maybe we're used to the Carribean/Indian Ocean too much.", "title": "Great staff........", "helpfulness": 7, "user": "asmith1999", "date": "October 6, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 3998159}, {"rating": 4.0, "title": "On the outskirts of Lucca", "text": "The staff are fantastic, Chris the porter, Walter (Italian, married to an English Lady) the head Barman/Waiter and all the lovely girls on reception.", "helpfulness": 4, "user": "richam", "date": "July 24, 2005", "id": 3696517}, {"rating": 5.0, "title": "Best selection in Lucca", "text": "The food is excellent as befits a Relais and Chateaux property but do try to explore, Michelin starred and Relais and Cateaux food is beautiful, well prepared etc etc but for real local native food get out and about and meet some real restauranteurs. Bucca di San Antonio in Lucca is superb and for a real adventure jump in a taxi and head out to Ristorante Dante in San Macario in Piano, we were in the taxi so long in the middle of nowhere we thought we being kidnapped. Eventually we arrived at a quaint restaurant in the middle of nowehere, the owner chose our meals (really) we had crostini, home-made (by Mamma) ravioli, steaks and it was all 'real' food, absolutely delicious. Interesting to note that the dearest main course on this menu was cheaper than the cheapest 'starter' on the menu at Locanda D'Elisa, unbelievable. After the owner and waiter had plied us with free liqueur at the end of our meal we were dragged in to the kitchen to meet his wife and daughter and all the staff who were preparing food for the following day. He even sorted us out with a taxi back to our hotel.", "helpfulness": 12, "user": "gwillis", "date": "January 10, 2005", "id": 2993024}, {"rating": 2.0, "title": "Locanda l'Elisa disappoints", "text": "I'd recommend having a drink in the small bar before dinner in the hotel, very ambient, good measures and a good spot for checking out your fellow diners. Walter is very knowledgeable about wine and will make sensible recommendations to match your food.", "helpfulness": 11, "user": "A TripAdvisor user", "date": "June 3, 2004", "id": 2149916}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My favorite room in all of Italy. Automatically upgraded to the one bedroom apartment style room upon arrival - what a wonderful surprise. I can't tell you how great this room was. It had a very comfortable couch, chair, ottoman, dining room area, separate bedroom area (with very heavy curtains between the rooms, you could close for privacy). The apartment was warm and cozy. I felt like I was in the summer estate of some royal family member. The bathroom was modern and had a tented fancy ceiling that just took my breath away. The shower was heavenly after having to endure \"baths only\" in some of the hotels we stayed at. The living room area/bar off the lobby was a comfortable place to sit, considering the very deep and high backed couch, and wing chair. They actually opened the restaurant for us that night, which was our Thanksgiving Day back home. The restaurant is a very beautiful, very fancy gazebo. Custom curtain treatments, linens, crystal, candles, soft background music - everything you hope a romantic dinner will be. The service was exceptional as well as the food. Truly a memory we will cherish for a lifetime.", "title": "Felt Like Royalty", "user": "ChampagnePrincess", "date": "December 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121364275}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The location of the hotel is perfectly situated between Lucca and Pisa. Both of which we really enjoyed. The Tower was recently refurbished and is so clean and white it actually sparkled in the sun the day we were there. The Cathedral of Pisa is one of the most stunning we have ever seen (and believe me, we have seen hundreds). We had a delicious pasta lunch in the pizzeria about two blocks outside the opening exit/entrance near the back of the tower complex. It was just a regular looking pizzeria with a little outside sidewalk terrace area that had a lot of locals in it. (It's right across from the university cafeteria that looks like a garage) Highly recommend. Sorry, I digress...", "title": "Wonderful experience", "helpfulness": 1, "user": "jantanzer", "date": "November 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120145121}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel staff was friendly and very efficient. You give them the large key ring when you leave the \"house\" and pick it up again at the desk upon your return. They provide maps. There is a cafeteria type of breakfast place right next door that we got breakfast and coffee to go from. The wi-fi service worked great in the room. The fresh fruit basket was delicious and much appreciated as we were starving when we arrived. The fine bone china dinnerware set up for two on the dining room table in the room was really the icing on the cake. Talk about \"being made to feel welcome\" is an understatement here. The walls of the apartment are all padded and covered with silk wall coverings. The carpeting throughout the whole hotel was wonderful and made the room just feel that much more like home. No cold hardwood or linoleum here - thank goodness. Some hotels throughout Italy, no matter how expensive, simply don't carpet their rooms. I just don't get it. Also, don't expect soft beds, big feather pillows, small wash clothes or hair conditioner in any hotel (they only provide shampoo and body wash). We stayed in six different cities and realized they simply don't provide these items in Italy (at least we never got them). The room had a safe and a mini bar.", "title": "Disappointing", "helpfulness": 1, "user": "trilllixxx", "date": "August 2, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 1.0, "location": 2.0}, "id": 73392942}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "You will love your stay here. Don't hesitate to book it right now if Pisa and Lucca are in your plans. Enjoy!", "title": "Romantic", "helpfulness": 1, "user": "denalda", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 47158661}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We chose this hotel after reading Karen Brown's review. We have found her books most useful in choosing accomodations and we travel alot. After reading recent reviews on trip advisor we were so concerned we almost cancelled our reservation. I am SO glad we didn't. From the moment we entered the hotel we were so delighted that I wondered if the poor reviews were about a different place!!! All the staff were so warm and helpful. The hotel is charming and was very clean. Even the pool was clean although it was too cold too swim. We were immediately told that although we were paying for a deluxe room we were upgraded into a small suite--bedroom and living room and complementary fruit bowl. We enjoyed the complementary continental breakfast--excellent latte and delicious baked goods. My only recommendation is that lighting in the bedroom is improved. It was too dim. We really liked the peace and serenity of being outside Lucca and we loved exploring the town of Lucca , bicycling on the ramparts and listening to opera arias in one of the churches which occurs every night. I would definitely recommend going to Lucca and staying at Locanda L'Elisa.", "title": "Don't go there - its very expensive and just not good value for ( a lot of) money.", "helpfulness": 3, "user": "NancyArmstrong", "date": "September 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 41056212}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This hotel was recommended to me by my friends..i was searching for a quiet but romantic place for me and my partner. Somehow by chance I was lucky to find everything I needed for enjoyable stay. Outstanding hotel service was in full conformity with our desires and expectations..i have never been once disappointed. The attentive boy from reception met us on arrival and carefully explained all the facilities nearby. Every matter was settled at the double. Our room was very beautiful and spacious. The antique style of decoration gives I think even more romanticism to overall image. The room was always perfectly cleaned up. What I want to mark specially is the restaurant Gazebo. The food was daintily formalized and it was real jam! A great range of dishes and wines were offered to us. Moreover we were pleasantly surprised for low prices and immaculate waiting. The swimming pool is not very big, but the ambience is relaxing and cosy.", "title": "Perfect place for a perfect holiday!!!!", "helpfulness": 2, "user": "k0nfetka", "date": "September 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 39733711}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with family", "text": "I highly recommend this hotel to people who appreciate quality and comfort!", "title": "Nice Inn, Good Restaurant", "helpfulness": 3, "user": "Picwa", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 10625043, "likes": {"liked": "— Nice room, friendly staff", "disliked": "— A little on the expensive side"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "Locanda L'Elisa is a relatively small inn located mid-way between Lucca and Pisa. You need a car (or a driver) to reach the hotel. Lucca is about a 10 minute drive; Pisa is about a 20 minute drive. We had the \"small\" double and were apprehensive about it being the size of a closet, but we were pleasantly surprised. The room was of good size. (We looked in one of the large doubles, and it was huge.) The desk staff spoke English and was very friendly and helpful. The attached restaurant was excellent, but fairly expensive. We did not eat breakfast there. Breakfast was expensive. You can walk (or drive) to a pastry shop next door. In addition to Lucca and Pisa, we also visited Volterra, which was about an hour and a half away. All in all,", "title": "Not So Great...A Little Tired", "helpfulness": 3, "user": "INDEPENDENT1", "date": "November 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 4.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 1.0}, "id": 10613781, "likes": {"liked": "— food", "disliked": "— interior"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "this is a nice spot to stay if you are visiting northern Tuscany.", "title": "A verdant villa retreat", "helpfulness": 3, "user": "Gothampanda", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8656007, "likes": {"liked": "— pool, garden setting"}}, {"rating": 5.0, "title": "Beautiful, but pricey", "text": "We booked this hotel because we know 5 star hotels are the only way to go in Europe. This was FAR from a 5 star hotel...interior was VERY tired. Food/restaurant was excellent as was the staff.", "helpfulness": 2, "user": "TimeTraveler123", "date": "December 16, 2006", "id": 6448239}], "location": {"country": "Italy", "region": "Tuscany", "continent": "Europe"}, "stars": 5, "variance": {"poor": 17, "average": 5, "very good": 23, "terrible": 3, "excellent": 33}, "aka": "Locanda l`Elisa Hotel Lucca", "slim_ranking": 0.566666666667}