{"user_rating": 4.0, "review_count": 268, "name": "Locanda Leon Bianco", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Venice’s best kept secret. If you are looking for a hotel with sweeping Grand Canal views, a superb central location, and the best value for your euro, Locanda Leon Bianco, is highly recommended. The kind, courteous, and accommodating Stefano is the perfect host. Marina who is upbeat and energetic, will greet you with a smile upon check in. She is a wealth of information and will provide you with a Venice map, tips & suggestions, to help make your stay enjoyable.", "title": "Venice's Best Kept Secret", "helpfulness": 1, "user": "abeurohi", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68149264}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "We stayed at Room #3 with unobstructed Grand Canal views. Our room was spacious, sunny and comfortable. The décor had an elegant charming old world Venice feel. The high ceiling and smooth hardwood floor, a/c and mini-fridge, helped keep the temperatures cool. Continental breakfast is served in your room. The fresh out of the oven marmalade filled croissants were so good we looked for them at a bakery, and found them! While we enjoyed breakfast, we watched across the Grand Canal, the produce/fish vendors set up at the Mercato Rialto.", "title": "romantic city break", "helpfulness": 1, "user": "minibreaker2010", "date": "May 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 62996030}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The hotel is in a convenient everything-at-your-finger-tips-neighborhood. Restaurants, shops, atms. A supermarket, gelateria, pizzeria, internet café. The hotel offers free internet for those who have a laptop. No in room television but who needs it when you have the nautical activity of the Grand Canal just outside your window to keep you entertained. On our last night, we decided to order take out from a nearby pizzeria, stay in our room, and watch the sunset over the Grand Canal. Iconic, classic, and timeless.", "title": "A delightful room with beautiful view of the canal", "user": "gabriellaotty", "date": "April 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60919521}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This is our second stay at Locanda Leon Bianco here and for what the hotel has to offer, the rooms rates are competitive. Email Stefano for possible specials.", "title": "It was like going back in time; we had a room with a beautiful view in an excellent location and at a reasonable price.", "user": "bidyou", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60398981}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "wonderful trip. was suprised at the amazing quality of the the hotel and the kindness and friendly welcome shown to us by the staff at the hotel. it was a small family run business, tucked away yet right next to a canal. a real hidden gem!", "title": "Fantastic value, excellent location, helpful staff", "user": "webberanne", "date": "April 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60307418}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Located 5 min. away from the Rialto bridge. No lift, so you have to carry the luggage up a lot of stairs. Only 7 rooms. Our room had a view of a side canal and you can hear the gondollas sailing by all the time if you keep the window open. The room was spacious with modern bathroom. Fridge+tv+ac. Breakfast served in room. Great location. Quiet even though it is located close to the sights. Great staff. Good value at 110 euro pr night for two adults and a 10 year old", "title": "Canal atmosphere - super location", "helpfulness": 1, "user": "travelviking", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73639593}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Location is everything in Venice and this was excellent, right on the Grand Canal. Excellent view of the Canal right up to Rialto Bridge. Atmosphere was olde world and quaint. Rooms were spacious and front desk staff was very helpful.", "title": "Great Location and Service", "user": "ausman_2007", "date": "July 28, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 72665076}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Great room with old style furniture; wonderful mornings from the window view on the small streets; tasty breakfast and very nice staff. It makes you want to come back. I had 1044 photos in 4 days. I wanted to take photos from every corner of Venice to have pieces of a great puzzle.", "title": "the town that filled my heart in", "helpfulness": 1, "user": "Iuliana_Hreniuc", "date": "July 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71997979}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Excellent value and an excellent location. Room was comfortable, oldfashioned but in a good way with excellent modern bathroom. Breakfast was promptly and pleasantly served in our room - lovely fresh croissants. Our room overlooked a side canal - when we return we will have a room overlooking the Canal Grande. Stefano on the desk very helpful and attentive.", "title": "Stay here and you'll want to return!", "user": "4888Rob", "date": "July 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 71876998}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "Good family restaurant just 50 metres away by the bridge.", "title": "Fantastico......a true Venetian experience", "user": "gillian1andlaurie2", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71721082}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We were surprised at how easy it was to find the place - once you cross the bridge you turn right and hotel (no 5629) is situated in a small coirtyard behind a small gate", "title": "Convenient and easy going", "user": "CarolineBrowning", "date": "February 4, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55183282}, {"rating": 5.0, "title": "Charming, courteous staff at comfortable hotel with stunning location", "text": "We fully appreciated the staff representative who waited for us to arrive late in the night. Hotel facilities are adequate, breakfast service very satisfactory and hotel attitude feels very much like home.", "user": "mattjcurtin", "date": "January 22, 2010", "id": 54099518}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "It is suggested better sign posting is available before client gets to Ponte Santi Apostoli!", "title": "Good location, nice service, up three flights of stairs", "user": "VeniceCiao", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 54034025}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "Rarely have we had such a charming and courteous welcome at a small hotel. It may be just a bed and breakfast, and good value only in a Venetian context, but the clean, simply furnished rooms, together with the stunning location on the Grand Canal not far from the Rialto, make it a comfortable, central base for exploring Venice.", "title": "Perfect Hotel in the heart of Venice", "user": "December2009", "date": "January 19, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 53828929}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled with family", "text": "On one floor of a palazzo, hidden in a tiny courtyard. You get a set of keys and let yourself in and out. Our room was looking over side canal, but you still get gondolas and working boats going by. Heating was good! Shades of former glory - terrazzo floor, high ceiling, chandelier. Breakfasts nice - except the coffee was instant. Handy for Rialto. If you come over from airport on Allilaguna ferry (13 euros) get off at Fondamente Nove, which saves you having a long hike from San Marco. If you do, make sure they put your luggage in the Fondamente Nove pile.", "title": "Ideal Hotel in Venice", "helpfulness": 1, "user": "gratefultraveler02", "date": "January 11, 2010", "detail_rating": {"cleanliness": 5.0, "location": 5.0, "value": 5.0, "rooms": 5.0}, "id": 53186924}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "Located on the Grand Canal, but just off the beaten track. Follow your street directions through a small alley and past an iron gate to find the door. Just around the corner from a major tourist boulevard, a 5 minute walk to the Rialto and 15-20 to San Marco.", "title": "excellent location, nice accomodations, reasonable price", "user": "maizer", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 59383938}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The proprietor, Stefano, speaks good English and was friendly.", "title": "We just got back from our fourth stay at Leon Bianco", "helpfulness": 2, "user": "bertram31", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59062088}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "Yes, we like this place so much we have stayed there during four different trips to Venice. My wife considers Room # 4 as \"home\". Well, we were there during a snow blizzard this time! Stephano loaned us knee-high boots and off we went around town in the snow. It was really fun to see. Also, Stephano's recommendations for restaurants were perfect. Not only did we have spectacular food but the people were enjoyable. I noticed that one person commented previously that they were cold at night. Well, it was about 20 degrees F and we were just fine. Of course, Stephano loaned us an extra blanket and we slept real close!", "title": "Excellent, familiar, lovely small hotel. Feeling of the 16th. century!", "user": "Feco55", "date": "March 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 58008862}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We spent four wonderful days during the Venice carnival. We were lucky to get this excellent \"locanda\" in Venice. We lived four days in the 16th century, of course with internet in our room. The place is completely venetian. If you want a high grade \"HOTEL\" with big glass entrance, big lounge (ang expensive fare) this hotel is not what you eypect. But! If you want to feel and enjoy VENICE, come here. Look around from the windows of hotel and you will see, imagine the history. We will come back. Soon.", "title": "Lovely small hotel, helpful and friendly staff, overlooking the Grand Canal, not far from Rialto Bridge.", "user": "Brianaco", "date": "February 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 56070637}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "F. Laszlo from Budapest, Hungary", "title": "We look forward to going back...", "helpfulness": 1, "user": "krisandkelly", "date": "February 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 55874893}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "variance": {"poor": 14, "average": 24, "very good": 96, "terrible": 14, "excellent": 120}, "aka": "Locanda Leon Bianco Hotel", "slim_ranking": 0.335958005249}