{"user_rating": 4.5, "review_count": 482, "name": "Locanda Vivaldi", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "It wasn't easy to find a hotel in Venice, in the summer, for our family of four, but we were extremely happy with this hotel. We found it through Trip Advisor, which is how we found every hotel on our two week trip. The Locanda Vivaldi is right on the Grand Canal, just a bridge or two past the Danieli from St. Mark's, and has beautiful views over the water from some rooms and from the rooftop terrace. The rooms were large and family rooms are available, they are decorated beautifully and the bathrooms are modern. The terrace is open for drinks and dinner, and throughout the day and night is left available for guests to use at will. The service was adequate but certainly not friendly, but the hotel itself and the lcoation made this an excellent stay, and we would recommend it to anyone going to Venice.", "title": "Great hotel, excellent location", "helpfulness": 2, "user": "Mondak", "date": "September 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8660046, "likes": {"liked": "— Location and quality of room (size, decoration, A/C, quiet)", "disliked": "— Service was less than friendly"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "I've never had cause to complain on any review site before, but I have to say, the way my husband and I were treated at this hotel left me fuming. The front of desk staff were very rude and when we made a complaint my husband was called a liar. It seemed that any tourists or guest were treated like cattle and with much distain. The management does not seem to understand about customer service. I love Venice, and will definitely be back - but not to stay at this hotel!", "title": "Terrible treatment by staff", "helpfulness": 3, "user": "londonlady65", "date": "June 1, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7728358}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The Locanda Vivaldi's best feature is its location on Riva Degli Schiavoni & a 5 minute strole to San Marco.", "title": "Superb location", "helpfulness": 2, "user": "UKTravellerStHelens", "date": "May 28, 2007", "detail_rating": {"front_desk": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 7709350, "likes": {"liked": "— Location", "disliked": "— The coffee"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Our room faced the lagoon & was clean & nicely furnished. There's a turn down service, slippers, robes & a nightly weather forcast. The air conditioning kept the room to a sleepable temperature for a North European despite daytime temperatures of 30C.", "title": "Best room in Venice", "helpfulness": 1, "user": "Stubdoc", "date": "May 22, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7670872, "likes": {"liked": "— Location", "disliked": "— No internet access in rooms"}}, {"rating": 3.0, "title": "Disappointed by the Locanda Vivaldi", "text": "You are right opposite the San Zaccaria ferry stop which is great for getting around. Venice is not a late night city so the bustle & noise from the boats eases off after about 23.00.", "helpfulness": 1, "user": "newburygal", "date": "April 10, 2007", "id": 7324042}, {"rating": 1.0, "title": "would not suggest", "text": "My review is based largely on the staff. In particular Stefano the manager of the hotel is largely to blame for my poor review. In reality with the exception of Stefano and his horrid performance my review might have been very different. Never in my life have I been treated so horribly by a staff member at any establishment. After we checked in for 3 nights we were told by Stefano that our room would most likely be available for only 2 nights and we would have to move to another comparable room without a view. Stafano failed to tell us that the other room was half the size without a bath. My wife packed our bags on the second day and we were moved to the other room. when we returned and saw the room I complained and was told by the front desk that they couldn't understand why Stafano moved us because our original room was still available. The next day on check out before I had a chance to say anything Stafano confronted me called me a liar and said he had never told us the room was comparable he then yelled at me and insulted both my wife and myself. Honestly the man should not be working in the hotel. He ruined what is in essence a ver nice hotel. Unfortunatly he is the manager and therefore has a major affect on the hotel and your stay. Therefore I suggest finding something else. Feel free to write me at my email adress if you need more info.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5472642}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "The Locanda Vivaldi is located just 2 blocks from St. Mark's Square, an excellent location.", "title": "Great location, nice hotel, great room, staff was aloof", "helpfulness": 4, "user": "FreqTravelerTN", "date": "July 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 3.0}, "id": 5460773}, {"rating": 5.0, "title": "Venice with two young children (6+9)", "text": "We were a party of five, 2 adults and 3 children and had reserved a double and a triple. We were actually given a very nice suite with 2 bedrooms and a sliding door to close one room from the other. Each room had a very nice bathroom, and we had a small balcony overlooking the side canal with a partial view of the lagoon. The room was very well appointed with great built-in closets and nice furnishings. The rooms were surprisingly large, although we were actually in the building behind the main hotel building, so the views were not as good. The rooms were very clean, and the linens were excellent.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "July 6, 2006", "id": 5433112}, {"rating": 2.0, "stay_parameters": "Stayed June 2006", "text": "Breakfast was included, and was quite a good selection by Italian standards. The 2 breakfast rooms are very nice with plenty of tables. The roof-top bar has an excellent view, but the service is lacking. There is a computer in the lobby for internet access by the guests. We did not eat at the restaurant, but the menu looked good.", "title": "dissapointment", "helpfulness": 5, "user": "Kripri", "date": "July 5, 2006", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 5426464}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Our only minor complaint was that the staff was somewhat aloof. They honored our requests and provided the information we asked for, but they were not overly friendly or genuine; they were quite serious.", "title": "Ahhhh Venice!!!", "helpfulness": 9, "user": "Phil Cook", "date": "June 7, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 5323468}, {"rating": 1.0, "title": "stay somewhere else!", "text": "Just returned from a paris, venice , florence trip. Loved all of the hotels that we stayed at except this one. Had booked a lagoon room view, and upon arrival, received a room with a view on the first floor. We had to crouch down to change if the window was open because everyone could see in. The noise level was ridiculous, from the people right outside our window, to the boats arriving constantly. The room was too hot with the windows closed, and the mosquitoes were interesting with the windows open.", "helpfulness": 3, "user": "sachuest", "date": "March 26, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 7227295, "likes": {"liked": "— breakfast", "disliked": "— rude staff"}}, {"rating": 1.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "I asked for a room change the minute I saw it, as I knew immediatley that it was going to be too loud. I stated that I would be happy to accept one without a view . The receptionist told me that I should check in the morning as there was nothing available. I spoke with a genteman at breakfast the following morning and he said he had a quiet room in the back and he was checking out that morning. Again, I went to the reception desk and was told that there would be no ohter rooms avaiable for our entire stay.", "title": "Worst experience ever!", "helpfulness": 6, "user": "LondonBrittany", "date": "February 14, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 5.0, "rooms": 1.0}, "id": 6788140, "likes": {"liked": "— Location", "disliked": "— Bad service"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Staff in the breakfast room were nice, and the breakfast was fine. The hair dryer did not work ( I didn't dare ask about that!). No concierge, and the staff was annoyed if you asked for dinner reservations. Don't even bother about directions!", "title": "Great Location, Nice Clean Hotel", "helpfulness": 2, "user": "cynwhitte", "date": "January 7, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 6561398, "likes": {"liked": "— location", "disliked": "— extra charges"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "It certainly put a damper on our venice experience, they certainly do not see to care about their clients. I would definately seek another hotel!", "title": "A Perfect Stay", "helpfulness": 2, "user": "TripAdv100", "date": "January 2, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6543022}, {"rating": 5.0, "title": "Great Location", "text": "r.", "helpfulness": 2, "user": "alimoon", "date": "November 27, 2006", "id": 6181971}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 23, "very good": 137, "terrible": 7, "excellent": 307}, "aka": "Locanda Vivaldi Venice", "slim_ranking": 0.0734908136483, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Locanda Vivaldi is a small boutique hotel facing the lagoon, just few steps from Saint Mark's Square. The location is just perfect, the view from the rooms and the rooftop terrace is simply amazing. The atmosphere of the hotel is intimate, we are the right choice for a romantic escape to Venice! And don't forget to enjoy our rooftop Bar & restaurant, you will enjoy a unique view on Saint MArk's Basin, on the Lagoon of Venice and on the life going on in Riva degli Schiavoni."}