{"user_rating": 3.5, "review_count": 134, "name": "Locanda Canal", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2006", "text": "Just stayed at the Locanda Canal for 2 nights. The room was small and clean and the bathroom was great. Really clean and comfortable. The only problem was that our room was at the top of the stairs and so was very noisy in the mornings. Seemed like nearly all the rooms on the first floor were around the breakfast area so would also be that bit noisy. For the price, 120 Euro for a double room, it was quite good for Venice and was very centrally located.", "title": "Great for the price but can be noisy in the mornings", "helpfulness": 2, "user": "Olki", "date": "May 5, 2006", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 3.0, "service": 4.0}, "id": 5035260}, {"rating": 4.0, "title": "Nice hotel", "text": "The staff were friendly and we had no complaints. The directions given by the hotel on their website from the vaporetto were very accurate and if you have a Venicecard map, you'll be able to figure it out quite easily.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "March 28, 2006", "id": 4739355}, {"rating": 1.0, "stay_parameters": "Stayed October 2005", "text": "We'd stayed first in the Holiday Inn, Quarto d'Altino (E80 per night) which was really great but you couldn't just stop by in the evenings before going out again. (It's a 25 minute train ride from the hotel to Venice)", "title": "Do not stay at this dishonest hotel", "helpfulness": 8, "user": "Jen_SydneyNSW44", "date": "November 17, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 4123028}, {"rating": 4.0, "stay_parameters": "Stayed September 2005", "text": "Very nice hotel in a perfect location, ease to find it.Good services at good price. The owner is a very helpful people you can trust", "title": "Perfect hotel and location", "helpfulness": 1, "user": "Debbieluc", "date": "October 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3985883}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "Despite having written instructions and a map this was a very difficult hotel to find. Venice is a maze of tiny alleyways and with luggage in tow it was a little frustrating. However once we found it it was a gem. It is decorated in an older Venetian style but that just added to the charm. We had read previous reviews about the bathroom/shower and they were not wrong, \"phonebooth\" is an apt description of the shower stall but the jacuzzi shower unit within made up for the lack of size! Breakfast was nice, there is a friendly, attentive lady who serves you and will heat up croissants and bring more coffee if you need. \"Jr Suite\" is definitely a bit misleading when our room turned out to be one room with a double bed, a single bed against the wall and a cot folded out in the middle of the available floor space. That said, all the beds were comfortable, the A/C worked fine and the location was right in the centre of town. We would be happy to stay there again.", "title": "Great stay", "user": "atwied", "date": "July 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 70981975}, {"rating": 3.0, "title": "They moved us across town to their \"annex\" hotel", "text": "We were booked for five nights as part of our 50-year anniversary trip. Upon arrival, thanks to a good map, we were told that, even though we had a reservation [which they did not deny], there was no vacancy. Instead, we were to stay in their annex hotel just a few blocks away - a 5 minute walk.", "user": "A TripAdvisor user", "date": "May 20, 2010", "id": 64826338}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "So, we pulled our own luggage and followed their bell hop for a 20 minute walk clear across town to a scary looking alley hotel. The inside was nice, but we stayed there virtually alone that night - not even a person at the front desk! Yikes! Then, of course, the next day, we had to drag our luggage back to the other hotel for the remaining 4 nights.", "title": "Charming little hotel with a great location!", "user": "Alberica", "date": "February 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 55071387}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled solo", "text": "The last 4 nights were fine - it's a nice clean hotel, but everyone should definitely beware of the \"annex\".", "title": "Rare Venetian Bargain", "helpfulness": 1, "user": "Eltel6", "date": "January 22, 2010", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 54074338}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed at Locanda Canal for 5 days in January 2010. The location is perfect, you're at St. Mark's square in less than 5 minutes walking.", "title": "Nice, clean, good location, tight quarters", "user": "Barry B", "date": "July 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 4.0}, "id": 34134565}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "Stayed at Locanda Canal for two nights at beginning of May. My single room was small, charming and clean. There was a small, clean bathroom and a small terrace with table and chairs overlooking the canal. Great for having a quite read and a drink from the mini-bar before going out to dinner. Staff couldn't have been more helpful. My female friend and I felt very secure during our stay. It was noisy early in the morning when a delivery was made by barge to the shop down the street/canal, but it was worth it for atmosphere and otherwise very quiet. 2 mins from St Marks Square - safe streets - what more could you ask for at €100 per night? I wouldn't hesitate to stay at this hotel again.", "title": "Great value and friendly", "helpfulness": 1, "user": "CrankyDublin", "date": "May 18, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7639992, "likes": {"liked": "— Value and niceness", "disliked": "— Breakfast - no fibre!"}}, {"rating": 4.0, "title": "Great time in Venice", "text": "We didn't tip the man at reception who was so kind to us and feel really bad about it. Anyone who has a few bob to spare might do the needful for us and we'll pay you back in heaven. Cheers!", "helpfulness": 1, "user": "finnyTipperary", "date": "May 16, 2007", "id": 7630601}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "My girlfriend and I are just back from a 3 day stay in Venice. We stayed at the Locanda Canal and found it very nice. Would recommend to book a suite if possible as its good to have a little more space. We found it difficult at first to find the hotel, however i think that most visitors to Venice can vouche for that. When we found the hotel, we found that the doors were locked and we were waiting 20 mins before getting entry. Apparently the Hotel owns another Hotel in the area and their night porter has to go between two properities to check in late night arrivals. So dont worry if you cant get in straight away. Its worth having the Hotel Phone number to hand if they are any longer than this. All in all, we enjoyed our stayed. Very friendly staff and they couldnt do enough for us, especially on the final day when they allowed us to use hotel facilites to shower, change etc.", "title": "Excellent location, reasonable price", "helpfulness": 1, "user": "Clayoquot", "date": "May 3, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7543260, "likes": {"liked": "— Location, cleanliness, breakfast, Internet access", "disliked": "— (I can't think of any negatives, really.)"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled on business", "text": "The hotel is about 5 mins away from Marco Square.", "title": "Fabulous single room", "helpfulness": 1, "user": "John Beasley", "date": "April 24, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7427471, "likes": {"liked": "— Excellent room and nice location", "disliked": "— Poor TV reception"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "Definitely recommend this.", "title": "Good", "user": "Plnyan", "date": "August 5, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 5561258}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The top advantage of the hotel is its location - less than 5 minutes from San Marco square, 10 to Rialto bridge. At the same time it is located on a quiet street. On the negative side, the room was not very bright. As a whole, it is perfect for rest and sleeping at night while sightseeing during the day.", "title": "Great location for its price", "user": "xeronmud", "date": "July 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 33671972}, {"rating": 3.0, "stay_parameters": "Stayed June 2009", "text": "For anyone taking a cruise and wanting staying in Venice, I recommend that you stay at a hotel along the Piazzale Roma. The cruise shuttle will take you to/from the ship to Piazzale Roma and you can drop off your suitcases right away. We had to take our suitcases onto the water buses and then lug them along the busy walkways and stairs. That was an ordeal! One of my sister's has difficulty climbing stairs. Hotel Locanda Canal has a one-person lift which was useful. We reserved a Junior Suite with \"4 king beds\" which was actually 3 twin beds and 1 twin cot.", "title": "Good location for San Marco", "user": "PG2LA", "date": "June 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 32818950}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We had booked a Jr. Suite and the description of the room was: 2 bedrooms with King beds, and living room area. When we arrived and went to our \"suite\" it was a regular size hotel room with 1 queen bed, 1 twin and 1 cot all squeezed in with a tiny bath. We told them we must have the wrong room but they said that was considered a Jr. Suite. The next night they gave us an additional room (for only $70 Euro...the Jr. Suite was $259 Euro), which was basically the same size as the suite, with 1 queen bed and a huge bathroom. Very, very clean hotel! Very nice personnel willing to help with everything. Breakfast was okay, but don't ask for 2 cappuccinos or ask to take it to your room!", "title": "Nice, small, very clean hotel close to San Marco Piazza", "helpfulness": 1, "user": "SamanthaBoston_MA", "date": "May 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 29420764}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We just returned from a wonderful one-week-vacation in Venice staying in Hotel Locana Canal. It is a very romantic little Hotel, located on a small canal, very quiet, but only a 3 minutes walk to San Marco and a romantic canal-bridge- and square-crossing walk to Rialto and the whole ancient Venice - perfect!", "title": "Venice vacation 2008", "user": "AtinaGermany", "date": "June 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 17275358, "likes": {"liked": "— location,furniture,price, evrything!", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2005, traveled with family", "text": "The staff is very friendly and helpful. The furniture is new, very elegant stylish venecian but not overloaded - we loved it!!! and felt perfectly at home. Our room was very comfortable,stylish furnitured and perfect clean . Breakfast was every morning a wonderful beginning of the day in a lovely familiar room with a very nice waitress. We booked already for next year.", "title": "excellent location", "helpfulness": 1, "user": "JC78", "date": "September 24, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 8885642, "likes": {"liked": "— location"}}], "location": {"country": "Italy", "region": "Veneto", "continent": "Europe"}, "stars": 3, "variance": {"poor": 14, "average": 21, "very good": 67, "terrible": 9, "excellent": 23}, "aka": "Locanda Canal Hotel", "slim_ranking": 0.632545931759}