{"user_rating": 4.5, "review_count": 148, "name": "Locanda a Ca du Gigante", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "When we pulled into Monterossa, it was heaven to see this hotel. It is a winding trip to go by car, but well worth it. We were 4 and in two rooms and there was nothing that Claudia wouldn't do for us. She told us the ship hours and where to eat and what to do, and when it was all over, we were saddened that after two weeks, we didn't stay there longer.", "title": "Heaven in Cinque Terre", "user": "barrycher", "date": "May 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7709482, "likes": {"liked": "— Comfortableness of the rooms", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Home Away From Home", "text": "As you may read, they own a fabulous restaurant Miky, don't miss it and if you have time for two dinners, make sure you eat at CIAK's(pronounced Jacks) in Old Town. I believe that Miky and Ciaks compete", "user": "Ellenlyn", "date": "January 30, 2007", "id": 6716365}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled with friends", "text": "for #1 in my book. By the way, be daring and try some of the fish items, they are great. They really start to roll at about 8:30 PM, so MAKE RESERVATIONS.", "title": "Quaint A Ca du Gigante", "helpfulness": 1, "user": "jtf3", "date": "October 31, 2006", "detail_rating": {"front_desk": 5.0, "business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 6034056, "likes": {"liked": "— location", "disliked": "— small rooms"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "A trip to Italy must include CinqueTerre, and a trip to CinqueTerre must include a stay at A Ca Du Gigante (you'll see the gigante/giant on the rocks).", "title": "Pleasant, Quiet Location, But Just Average", "helpfulness": 7, "user": "ABohemianGirl", "date": "October 4, 2006", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 5909835, "likes": {"liked": "— Parking was right in front of the hotel. Others had to use a parking lot at the beach.", "disliked": "— Kinda cramped. Room was dark."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "This is a lovely place, small but full of charm. Maria Pia is the perfect hostess, she greeted us as if we had met each other before. The breakfast is very nice. The rooms are not large, but enough for me, my husband and my son to all room together. Ca du Gigante is in a perfect spot close to the sea. It was one of our favorite spots in Italy!", "title": "Excellent!!!!", "user": "raytim", "date": "September 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5885608, "likes": {"liked": "— Friendly Staff", "disliked": "— We didn't stay long enough!!"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled with family", "text": "Our family stayed at this hotel during a recent 2 week trip to Italy. We loved the hotel, its tasteful personalized decor, wonderful location close to the beach and the personal attention. The breakfast was wonderful too with ample variety of breads, juices, fruits and yogurt. This hotel is an absolute gem and we would recommend it to all our friends", "title": "Great boutique hotel tastefully decorated", "helpfulness": 1, "user": "AJFlorida", "date": "September 19, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 5817323, "likes": {"liked": "— Tastefully decorated rooms", "disliked": "— Old town monterosso has some of the best restaurants in tuscany"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "This hotel was the perfect spot to stay in the Cinque Terre. It fits its surroundings beautifully by providing a home like atmosphere, with large rooms, a good breakfast, and a location just a half a block from the sandy beach. Maria Pia was and the rest of the staff were very friendly, spoke perfect English and gave good tips for the Cinque Terre and the rest of our travels. We stayed in a room that was right next to the lobby entrance, which worried us when we first arrived, but turned out not to be a problem at all. The room was large, with a modern and clean bathroom, and with the door closed we did not hear any noise. Plus, we had a nice terrace with a retractable awning! Perfect!", "title": "Perfect, quaint hotel in the Cinque Terre", "helpfulness": 4, "user": "smm130", "date": "July 28, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5521853}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "We spent two weeks in Italy, and our stay in A Ca du Gigante was our favorite stay among the five hotels we visited. The rooms are a bit small but immaculate. My wife and I had a queen bed, a small love seat, TV, refrigerator and safe. The bathroom was very clean and had a great shower in it (with the rain-style shower head). I believe there are only six or seven rooms in this hotel, so you get a lot of personal attention. The staff was very helpful to us recommended restaurants and other activities. Breakfast was amazing!! Homemade pastries galore, fresh fruit, and wonderful caffes. The location is excellent just off the main roadway in Monterosso.", "title": "Wonderful experience!!", "helpfulness": 1, "user": "Joe P", "date": "June 19, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5362705}], "location": {"country": "Italy", "region": "Liguria", "continent": "Europe"}, "variance": {"poor": 3, "average": 15, "very good": 37, "terrible": 5, "excellent": 88}, "aka": "Locanda a Ca Du Gigante Hotel Monterosso Al Mare", "slim_ranking": 0.380952380952, "description": "A Ca' du Gigante is a brand new relais which has just been built in Monterosso al Mare, major village of the 5 Terre.The building is only 50 metres far from the beach and the crystal clear waters of this corner of the ligurian riviera.It is a unique place, both refined and homely: its only six fully equipped rooms and three luxurious suite are for those privileged few who will find continental breakfast , relax lounges and wine tasting in the spectacular scenario of a unique surrounding."}