{"user_rating": 5.0, "review_count": 124, "name": "Loch Beag Bed & Breakfast", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Imagine you arrive at the end of the world and imagine it is one of the friendliest places you can stay in Scotland. Welcome to Loch Beag. Edna and Angus are borne to be hosts. They are always happy to talk to you and this is what we like about staying in B&Bs. Their door was open whenever we felt like having a chat or asking a question. Breakfast is plenty and excellent. Try the Stornoway black pudding by McLeod! You can even have dinner if you let Edna know in advance. But she will also book a table for you in a restaurant nearby. The area is great for walking. It does not take you long to get to the beach. The rooms are spotlessly clean, cosy and with en-suite bathroom. Ours had a nice view to the beach and the lighthouse. Do not forget to pet the dog. And, if you like tweed make Edna show you what she does with it. Even if you did not plan to stay at the Point of Ness, this B&B is a reason to do so.", "title": "\"Amazingly friendly hosts - great dog\"", "user": "J_und_M", "date": "October 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118941467}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Loch Beag offers a wonderful place to stay, it is in the true surroundings that you expect from visiting the Outer Hebrides. Edna is a wonderful hostess, who is warm and friendly and nothing is too much trouble. We will definiately be recommending Loch Beag to anyone who is going to The Isle of Lewis.", "title": "Lovely trip", "user": "sueade11", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118745149}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Edna was a very welcoming host and nothing was too much trouble. She booked a restaurant table for us and cooked us the biggest belly busting breakfast ever. Note to readers; eat nothing for 5 days before you attempt one of Edna's breakfasts!!", "title": "Excellent Edna!", "user": "MarkandHelen_5", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118424955}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The room was comfortable, spotlessley clean, and the toiletries Edna provided would far outweigh any 5 star Hotel. A stones throw from the Butt of Lewis this B & B is well worth a visit and the nearby beach is a must for a stroll to see the wildlife and wild flowers.", "title": "Outstanding!!!!!", "user": "Mark M", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118374689}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We stayed with Edna a couple of days after the summer solstice, fantastic to see the sun still shining so near to midnight!", "title": "HOME FROM HOME", "user": "skyliner916", "date": "September 14, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118120079}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Because we'd underestimated how long it took to drive up these gorgeous little islands there was a moment when we considered ringing to cancel as we thought it would be too far. I'm so glad we stayed though it was the best B&B of our week long holiday. Edna was just so lovely and welcoming, she even gave me some slippers as I'd forgotten mine. Everything we needed and we left feeling so holiday-ed even after just one night. Will defo return :-) ooh a lovely deserted beach to paddle in the sea just like on the postcards!", "title": "thank u for the slippers!", "user": "themanandthelady", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117839642}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Warmth, care and attention to detail, kindness and a genuine interest in the traveller who crosses their doorstep. Facilities and food of the best quality, conversation and information to enhance the visit; Edna and Angus, and of course the dog Poppy, made our stay memorial. A hard act to follow and I will be back with other friends and family next spring!", "title": "The best of Highland welcomes", "user": "Betty J", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117836958}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We stayed in this B&B only for one night but we felt as if we were at home with our family. The room was big, very clean and with lots of details for the travelers. The breakfast was delicious. We strongly recommend it!", "title": "Lovely place", "user": "Raquelina81", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117629825}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "I visited Lewis on business and stayed at Edna, Angus and Poppy the dog's lovely B&B. The owners make every possible effort to ensure you have a wonderful time.The room and ensuite were absolutely spotless and cozy and the cooked breakfast a wonderful, huge, and well needed start to a long day walking across the Lewis peatbogs. Edna kindly phoned ahead to a place to eat in the evening. I can recommend the Cross Inn if the restaurant at the harbour is closed as it was when I was there. A possible downside for business travellers is that there is no internet connection, but it is the top end of Lewis after all, so just enjoy having an evening or two away from it. The only possible downside is that Edna and I chatted for so long after breakfast I felt guilty about eating into my working day :-). I will be back and hopefully for a bit longer next time. Thank You!", "title": "Excellent Lewis hospitality - a home from home", "user": "Rebekka A", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117560161}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I honestly don't know where to start - this was like visiting best friends, or family (the nicest bits of your family!)", "title": "Reluctant to leave,and we'll definitely be back!", "user": "Jay99", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117487029}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "My wife and I stayed for a week in this little B&B tucked away in the northernmost point of the Outer Hebrides. It was a great experience. The hosts, Edna and Angus, were so warm and welcoming, as was their cute friendly old dog, Poppy - the star of many of the reviews of Loch Beag on this site, perhaps the most photographed dog on the Hebrides, and unofficially the head of the household.", "title": "Wonderful B&B made for a perfect getaway in the Outer Hebrides", "user": "Bualabus", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130685845}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "We stayed in both guestrooms over the course of the week. They were clean and very comfortably furnished, and great attention to detail was evident, from the meticulous housekeeping to the complimentary shortbread and chocolate snacks that Edna laid out by the coffee in our room every day.", "title": "Best service and attention", "helpfulness": 1, "user": "RosadeValencia", "date": "April 16, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127997361}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The breakfasts were huge - we had to ask her to give us less food in the end, as it was all so good that the temptation was high to just keep eating, and sleep it off during the day, and we did want to see a little of the Hebrides while there.", "title": "Great Experience", "helpfulness": 1, "user": "Carol B", "date": "April 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127856610}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Edna and Angus were also very helpful with tips and Edna even lent my wife her coat, as one of our suitcases was delayed in arriving.", "title": "Superb one night!", "helpfulness": 1, "user": "andrew l", "date": "February 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125171893}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "I would highly recommend this to anybody going to the Hebrides, but only if you are nice people. Edna and Angus only deserve nice people as visitors.", "title": "A great place to stay...", "helpfulness": 1, "user": "Jasmin S", "date": "December 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122316556}, {"rating": 5.0, "stay_parameters": "Stayed October 2011", "text": "A very friendly welcome and a hearty breakfast to set you up for the day. Very comfortable rooms and super clean bathroom. Perfect!", "title": "Loch Beag B&B", "user": "Eericsmith", "date": "October 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119804388}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I went with my mother who was visiting her Granddaughter and Great Grandchildren on Lewis for the first time. Edna's hospitality made the trip even more enjoyable. We both had excellent clean and comfortable en suite rooms which had lovely little extras (toiletries and chocolate biscuits!) and the breakfasts......well! - the full Scottish was sublime and certainly set us up for the day ahead. Many thanks to Edna and Angus for a warm welcome and a thoroughly enjoyable stay. See you soon!", "title": "A very warm welcome...", "helpfulness": 1, "user": "Lynn B", "date": "October 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119453117}, {"rating": 5.0, "title": "Excellent Bed and Breakfast", "text": "Lynn and Dorothy", "user": "C S", "date": "October 12, 2011", "id": 119234664}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "x", "title": "Second to none", "user": "47happycamper", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119102712}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Spent very nice weekend in Ness with the MacLeods. Very welcoming and accommodating. Excellent breakfast. Lovely clean room. Chocolate biscuits. Friendly old dog. Local knowledge. Thank you.", "title": "Very Scottish...wonderful", "user": "Muhammad_Zohaib_Ali", "date": "October 6, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 119004928}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 0, "average": 0, "very good": 2, "terrible": 0, "excellent": 122}, "aka": "Loch Beag Bed & Breakfast Isle Of Lewis, Scotland", "slim_ranking": 0.0363636363636, "description": "Loch Beag is a B&B in Fivepenny, a Gaelic speaking community in the North of Lewis. We have a double room and twin room both en-suite, with tea making facilities, tv with free view and hairdryers. We serve a full Scottish breakfast and special diets are catered for. Evening meals are available by prior arrangement."}