{"user_rating": 4.5, "review_count": 178, "name": "Loch Tummel Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Firstly, do not confuse this gem with the Loch Tummel Hotel.", "title": "Peace, perfect peace.", "helpfulness": 1, "user": "DerbyshireElaine", "date": "March 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126265432}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Loch Tummel Inn is located about half way down Loch Tummel beside the road, although there is no traffic noise. It is an exceptionally peaceful location. The hotel overlooks the loch which you can gaze at whilst eating your breakfast or dinner. We went in March so dinner was served in the bar downstairs (fewer diners I guess).", "title": "Fantastic Place & People !", "helpfulness": 4, "user": "61Bridget", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125660795}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "We reserved the Dinner, Bed and Breakfast option on line.", "title": "Great service", "helpfulness": 1, "user": "Twizzle103", "date": "March 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 125616098}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "When we arrived we were welcomed by Amanda, one of the owners who showed us to our room, (#1) a large, comfortable, clean and cosy room with an enormous ensuite. This has a central bath and a separate power shower, all tastefully done. Unfortunately one of the shower doors was hanging off. The room included an iron and ironing board, a hairdryer and tea and coffee making facilities.", "title": "Excellent dinner", "user": "dave_fo", "date": "February 25, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 125170237}, {"rating": 4.0, "title": "Good spot with great food", "text": "There is no TV in the room but there is a really comfortable guest lounge with a TV - and a piano if you are so inclined!", "user": "Mordrydd", "date": "February 18, 2012", "id": 124781222}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Our one night stay here was entirely satisfactory from the warm welcome to the massive Scottish breakfast. Our room was spacious and clean, dinner was excellent and the atmosphere in the bar/dining room was excellent.", "title": "Quaint, Quirky and Quintessentially Scottish", "helpfulness": 2, "user": "luceo", "date": "April 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128422770}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I have no hesitation in recommending this hotel and I hope to return in the not too distant future.", "title": "Not family/child friendly", "helpfulness": 3, "user": "Lynieloo", "date": "April 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 5.0}, "id": 128346734}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We will not return! Upon arrival we were shown to our room to find the travel cot had not been made up and we were issued with a quilt for our child (under 2). The room was dull and exhausted, the wardrobe was mouldy and very smelly, wallpaper peeling and no TV in the room, not very clean either. As a family friendly hotel we noticed no plug covers, the front main entrance jammed open leading to main road, no child safety protection throughout. Ordered dinner in the bar and was told that there was only 1 high chair and it was being used by another family, what were we meant to do...... The glasses were dirty, we returned the drink and were issued with another without an apology. The food was okay, our child did not eat his dinner (macaroni cheese), I understand why, it was very bland and he was expected to sit at the table to eat. The owners seemed harassed. It was also very clear they had their favourite guests, not very welcoming! The positive, the view: stunning!", "title": "Wonderful hospitality, good food", "helpfulness": 2, "user": "edinburgh t", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128325153}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My wife and I spent two nights here last week. Very good small hotel with excellent views over Loch Tummel. Amanda is such a natural, friendly and welcoming hostess and the other staff are equally nice. Our room was spacious, comfortable and very clean. We ate both nights in the hotel bar/restaurant as the atmosphere was pleasant and the food excellent and reasonably priced. We would definitely.recommend this hotel.", "title": "SPW on tour", "helpfulness": 1, "user": "Pete W", "date": "April 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128270091}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We stayed for one night on 17th April and couldn't have picked a better location or hotel. The scenery and tranquility was superb. Amanda and her staff were really friendly, the food was excellent. The room was clean and bright with nice views over the loch and hills.", "title": "Margaret & Derrick's xmas prezzy", "user": "BathgateDerrick", "date": "April 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128171232}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We made a reservation here after a few people who'd been in the area had raved about it for a meal.", "title": "Not as fantastic as people raved about", "helpfulness": 2, "user": "Groovee", "date": "April 6, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 127366015}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We went in and it seemed like we didn't have a reservation but we got allocated a table at the bottom of the restaurant. The menu seemed to be a tad fancy rather than ye olde country inn sort of food.", "title": "A Wee Gem in a Beautiful Setting", "helpfulness": 1, "user": "thebriggie", "date": "April 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127080899}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The foreign waitress seemed to have difficulty understanding that our son didn't want mash but chips. Then had problems understanding Macaroni cheese. She then got my husband to point out what extra he wanted on his burger. She also seemed to not get my husband wanted a beer and not a coke.", "title": "Only tiny changes and it would be perfect", "helpfulness": 2, "user": "algal15", "date": "March 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 126647559}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "While we were waiting we became aware that the other 2 tables were having problems with their orders. One seemed to be missing a main meal and the other was a meal wrong. So much so that they were offered the meal on the house in the end.", "title": "Perfect", "user": "davesharpe", "date": "March 20, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0}, "id": 126391430}, {"rating": 5.0, "stay_parameters": "Stayed February 2012", "text": "When our meal arrived, there were no hand cut chips. They were skinny french fries which were just greasy. Then my husband's burger had blue cheese and mushroom instead of Cheese and bacon. Luckily they sorted it but by the time his meal arrived, we were finished and bored. The scottish staff were friendly and apologetic, but my husband made the point that they were sorting out many mistakes with all of this waitress's orders which really made it disappointing for everyone.", "title": "Beautiful Inn in a perfect location with friendly staff and great food!", "helpfulness": 1, "user": "Gill450", "date": "March 19, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 126360240}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "We were given this break as a present, which was booked through Itison. It is a charming small hotel (only 6 rooms i think) that boasts lovely views and excellent food. The bedroom had a loch view and was perfectly well equipped although it had no TV or internet access (if you need that sort of thing); there is, however, a small TV lounge. The bar / restaurant is at the heart of the hotel and has a lovely quiet atmosphere and all meals were very good. Would definitely recommend for couples but not the place to come if you want raucous nightlife.", "title": "Lovely Small Hotel", "user": "tullythedhog", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127833069}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My wife and I stayed in the hotel for four nights at the start of April. It is situated off the A9 in beautiful surroundings obverlooking Loch Tummel and is easy to find. It is situated to the west of Pitlochry about four miles past the Queen's View on the main road to Loch Rannoch. You can walk to your heart's content on the various trails in the area and Pitlochry itself is a beautiful town.", "title": "Great wee family run hotel for a break away from it all.", "helpfulness": 1, "user": "Brian L", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127738890}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We were greeted by the owners Amanda and Tom on arrival and shown to room 1 on the top floor of the hotel. This is an excellent room with a great Loch view to the front and a side window view towards Schiehallion. The adjoining en suite bathroom is big enough for a game of heidie fitba' and includes a shower and a free standing bath. THe bed was excellent and I had the best sleep I've had in a hotel that I can remember.", "title": "easter weekend at loch tummel inn,never again.", "helpfulness": 2, "user": "Frank T", "date": "April 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 2.0}, "id": 127527072}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The upstairs restaurant was only used at this time of year for breakfast and the bar downstairs was used for evening meals. The view from the restaurant in the morning is superb as was the food. A choice of fresh grapefruit or porridge and a full Scottish breakfast plus fruit juice and cereals and all the tea/coffee and toast you want.", "title": "Beautiful Location, amazing food, friendly owners", "user": "younglau", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 127479143}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "The atmosphere in the evening was relaxing and the food excellent. There are three courses and believe me if you have the full works at breakfast and all three courses at night you won't need much at mid-day unless you intend to run up Schiehallion or cycle forty miles during the day. There was an acceptable delay between courses because each dish was freshly prepared and individually presented. The haggis starter with Irn Bru and chilli jus was superb as was the rare pan fried venison and everything else we tried. The menu changes on A Tuesday and includes \"specials\". The wine list although not extensive contains a good selection and is reasonably priced.", "title": "Family run = personal touch", "helpfulness": 2, "user": "Scotiamac", "date": "April 7, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 127415263}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 9, "average": 6, "very good": 36, "terrible": 6, "excellent": 121}, "aka": "Loch Tummel Hotel Strath Tummel", "slim_ranking": 1.0}