{"user_rating": 4.5, "review_count": 1764, "name": "Loews Boston Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "My daughter and I spent 3 very happy days in Boston , staying at the Back Bay Hotel.The hotel is very well located to be within walking distance of the \"must see\" items on our list. It is 5 or 10 minutes walk from underground stations. The staff at the hotel were warm and friendly, nothing was ever too much trouble.The concierge was painstakingly helpful in helping us to plan our sight seeing. The beds and rooms were very comfortable ;and we experienced very good room service for the evening meal ,the first evening. We ate from the good and varied breakfast menu, but chose to dine and the plentiful nearby restaurants. In all a very pleasant experience.", "title": "A short 3 night stay in January 2012", "helpfulness": 3, "user": "Elizabeth W", "date": "January 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123926698}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We needed a night out in the city, and the Back Bay Hotel didn't disappoint. We had a nice, corner room with King Bed and huge bathroom (I'm not sure if that's the case for all King rooms, but this was great). The location of the hotel is right around the corner from great restaurants and shopping... allowing you to walk around rather than taking cabs or T.", "title": "Great weekend out.", "user": "Nahant_Snique", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123857491}, {"rating": 5.0, "title": "Great place to stay!", "text": "The hotel restaurant/bar (Cuffs) was great and one of the few hotel bars we found in the city with a working fireplace to sit next to and hide from the Boston winter... Highly recommend.", "helpfulness": 1, "user": "wmike_31", "date": "January 30, 2012", "id": 123846762}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Great place to stay when in Boston. Smaller feel, great restaurants, clean rooms, and excellent staff!", "title": "Exceptional Service", "helpfulness": 1, "user": "TheCogsShow", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123809372}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Excellent hotel in almost every capacity. The service is phenomenal and no matter what I called down for at any time day or night, they were able to accommodate me with a pleasant voice on the other end of the phone and a cheerful smile at my door.", "title": "First Class All the Way", "user": "Global_Coug", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 123704333}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with family", "text": "I stayed at the Jurys with my 17 yo daughter for 4 nights in Feb/08 and loved the hotel. The room was extremely comfortable, if a little small, but the bathroom quite spacious. The beds, luxurious sheets and towels, heated towel rack, and L'Occitane toiletries made us feel pampered. The best thing about the Jurys for us was the location! Three blocks from Newbury Street, within easy walking distance to Copley Place, Back Bay, the Public Garden, and Downtown Crossing made the Jurys the ideal hotel for us. Public transportation could not have been easier: less than 2 blocks from Arlington Station on the Green Line, within 4 blocks of South Station on the Orange Line which is also the Back Bay stop for Amtrack. A Hertz rental car facility was only a couple blocks away near the Park Plaza Hotel. In short, a wonderful base from which to explore the Boston area. While the location is fairly quiet in the evening, the Jurys' hotel bar is quite popular and filled with revelry every night. We asked for a quiet room and never heard a peep from the crowds in the bar. It wasn't until our last day that I discovered the spacious and comfortable sitting area in the hotel lobby. It's separate from, and off to the left of, the check-in area.", "title": "Wonderful Hotel, Great Location", "helpfulness": 1, "user": "slcSF", "date": "March 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 14604325, "likes": {"liked": "— location and comfort of rooms", "disliked": "— downstairs and elevator decor; smallness of rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2008", "text": "Stayed this week-end at Jury's and had a lovely time. They're very welcoming from the time we pulled up in our car to the time we left. While there really aren't many restaurants immediately around Jury's, there are a bunch of great looking restaurants within a 10-15 minute walk (especially on Tremont Street). The hotel rooms are small, but pretty, and well-designed. In the interest of being \"green\" the thermostat is kept at 69 degrees, which is fine, but that temperature is cold when you're getting out of the shower (no baths). They should have a heat lamp in that bathroom so you don't freeze! Other than that, the only negative I have is the $39 plus taxes charge for parking your car. Worked out to almost 25% of the room cost. However, we would recommend Jury's for a nice Boston hotel.", "title": "Jury's Boston Hotel", "helpfulness": 2, "user": "Franticflo", "date": "March 24, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 14486949}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with family", "text": "We stayed in Jury's for five nights recently and it was excellent. All the staff we met were very helpful and polite. The room was beautiful, very clean and the free bottles of water were a lovely touch. There is free Internet access in the business centre which was handy. The location is very central - there are plenty of good restaurants with in easy walking distance and the shops on Newbury and Boylston are close by. We caught the T at Airlington Station just two blocks away. I knew that Jury's was No. 1 for hotels in Boston on Trip Advisor but it was even better than I expected.", "title": "Jury's - Trip Advisors Were Spot On", "helpfulness": 1, "user": "honorGalway_Ireland", "date": "March 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14470822, "likes": {"liked": "— The high quality of the service and the personal touch."}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Just stayed at Jurys Boston for five days over Paddys weekend. I work in the hotel business and can be very critical of other hotels but I must say I could not find fault with Jurys. The rooms were spotless, the staff were really friendly and helpful and the food...well not gourmet but american! I think I overloaded on fries. Just watch if you are having breakfast and do not want to eat much order off the a la carte menu as the buffet menu is great but costs $18.00 per person.", "title": "Jurys Boston is Fab", "helpfulness": 3, "user": "TahirDublin", "date": "March 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14433877, "likes": {"liked": "— Cleanliness & Friendly staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "Jury’s is an amazing hotel, Building is stunning, and Décor is very tasteful and well done. (My husband is in the building trade and was impressed with the high standard of finish and detail.), Great location", "title": "Best Hotel we have stayed in!!!", "helpfulness": 2, "user": "AuntieNoodles", "date": "March 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 14277379, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "For my husbands birthday I planned a night out in the Back Bay area. I found this hotel on T.A. and we got a great deal booking with one of their winter getaway packages.", "title": "Fantastic Birthday Weekend", "user": "BodhisMommy", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124527328}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The hotel and service was consistently above and beyond. The valet service was so fast and helpful, they got our bags to our room shortly after we finished checking in and gave us bottled water for the ride home. And we were happy that we never had to wait for a taxi.", "title": "Excellent accommodations and personal service", "helpfulness": 1, "user": "4659kelly", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124482413}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "We had a delux suite which was a generous size (especially if you are used to hotel rooms in the city). One of my favorite little details was the motion sensor light in the bathroom that was very dim - just enough to light the floor for you in the dark.", "title": "Thanksgiving Trip to Boston", "helpfulness": 1, "user": "sassygCalifornia", "date": "February 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 124373613}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The turn down service was a nice touch to come back to after dinner, we had an espresso maker in the room and complimentary water in the mini fridge (which is not stocked with a mini bar, something I really like). The building itself is gorgeous with every detail in place. We had no problems getting a wonderful nights sleep, never heard a single neighbor (which is something to appreciate if you have ever stayed somewhere where the walls are so thin you feel like you are sleeping in the hallway).", "title": "Nice hotel - Probably better located hotels out there", "user": "DebAndNick", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 124293012}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "We had breakfast in the restaurant on the ground floor in the morning, the buffet was included with our package (a $50 credit for 2), and it was impressive for a buffet. Included in the buffet was the option of freshly cooked eggs any way or an omelette. We were both very happy wit the service and food.", "title": "Holiday Boston trip with teens", "helpfulness": 1, "user": "Elvis422", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124231241}, {"rating": 5.0, "title": "What a great pleasure!", "text": "Stayed at the Jurys Boston this past weekend 8/28 to 8/31. Found this hotel on this website - what a pleasant surprise this jewel is. Probably the best service and the most professional staff I have encountered in a long time. Surprised to find the bar currently the hot spot of the Back Bay,even the staff has no explaination for it! Room was very comfortable, loved the large bathroom with tiled walk in shower. Location was convient and quiet during the evening hours, felt very safe walking around. Richard at the concierge desk has a great sense of humor and gives 110% to his job.", "user": "maxfli", "date": "August 1, 2005", "id": 3728384}, {"rating": 4.0, "title": "Great Hotel, Great Location", "text": "This is an excellent hotel located beside John Hancock Tower. This former Boston Police Headquarters was opened in June '04 and the staff are amongst the most pleasant you will find in any American property. Rooms are an adequate size and very well designed with in room safe and ironing facilities. Bathrooms are modern and of a great standard. All rooms offer free WiFi facilities.", "user": "kenny d", "date": "July 31, 2005", "id": 3725284}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The bar on the ground floor is excellent, altho can be quite crowded at night as it has an outside patio area for the smokers!!!.", "title": "Great hotel; great location", "user": "Dalkeith33", "date": "July 17, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3676979}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Overall, one of the nicest, happiest hotels you're likely to experience in North America with staff that really make you feel at home.", "title": "Great Hotel, great value!", "user": "kboyd912", "date": "July 11, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3659045}, {"rating": 5.0, "title": "Superb", "text": "Jury's Boston has been open about a year and has it all, including a pleasant and helpful staff, and very comfortable beds. A short walk to the Public Gardens, and to Legal Seafood! We will be back.", "user": "A TripAdvisor user", "date": "July 10, 2005", "id": 3654425}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We have just come back from a weekend stay in Jurys and we were not disappointed.", "title": "Great Hotel", "user": "**Pampered**!!!-7", "date": "June 30, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3622262}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We arrived early and our room was not ready, so rather that leaving us waiting the receptionist gave us an upgrade. Lovely touch. The room was lovely, decor modern and unfussy , bed was huge and very very comfortable. I know it is a cliche but I loved the turn down service.", "title": "Incredible...", "user": "Headwall", "date": "June 27, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3614364}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "The staff were very very friendly. From the concierge to the bell boy, they could not have been more helpful answering all our questions and providing us with loads of suggestions of how to spend the weekend.", "title": "Jurys a good choice", "user": "JLG", "date": "June 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3607560}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "Free internet acess in the business center was an additional bonus.", "title": "Loved the Jury's", "user": "Msk6261", "date": "June 23, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3607380}, {"rating": 2.0, "title": "I don't see it", "text": "My wife and I went to Boston for our 1st wedding anniversary and the Jury's hotel was one of the many highlights of our trip. The employees were very attentive, after our room service the front desk called to make sure it was alright. Walking distance to many shops, parks, and other bars if Cuffs gets to crowded. We are going to stay here again when we return to Boston.", "user": "A TripAdvisor user", "date": "June 20, 2005", "id": 3583572}, {"rating": 5.0, "title": "First visit to USA will definitely be back", "text": "Visited Boston on 5th June and this was our first trip to the States. Encouraged by the reviews of Jurys on your website I booked our eight night stay there. We had an excellent time in Boston and managed to see all the main sights either on foot or by using the excellent public transport system. Jurys was well placed for the station around the corner at Back Bay and we managed visits to Rockport and Salem on the commuter trains.", "user": "Dianne H", "date": "July 9, 2005", "id": 3651572}, {"rating": 5.0, "title": "Love the Irish Accents!", "text": "The hotel staff were all very friendly and the room quiet and comfortable. The people of Boston were very helpful - whenever we stopped to consult our town map someone would usually come up to us and ask if we needed any guidance.", "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3640232}, {"rating": 5.0, "title": "Exceeds Expectations", "text": "We have travelled extensively in Europe over the years but we will definitely be back to Boston next year and look forward to staying at Jurys again.", "user": "A TripAdvisor user", "date": "July 6, 2005", "id": 3639200}, {"rating": 5.0, "title": "Great Hotel & location", "text": "Everyone was so friendly at this hotel, even though it was July 4th weekend in Boston and hectic. Our room was the standard room, a bit small, so next time I will reserve a larger one, but the amenities were bountiful..Aveda products, heated towel racks, comfortable bed, and a great bar. The only thing I would recommend would be a coffee maker in the room. I had a hard time wanting to leave my room in search of coffee after a night out in the town.", "user": "trickydicky", "date": "July 5, 2005", "id": 3637584}, {"rating": 5.0, "stay_parameters": "Stayed May 2005", "text": "The Jury's in Boston is a great hotel. The rooms are clean and modern, yet manage to keep a historical presence in the old Police building in which they are located. The staff is exemplary and the concierge Richard Owen was a great host to the hotel as well as the city of Boston, giving directions and suggestions, which proved very helpful. The restaurants and bars in house a great, but the Jury's is also within walking distance to most of the city. It was the perfect place to stay in Boston and will definitely be staying there again!", "title": "Fantastic hotel - highly recommend", "user": "njh", "date": "July 3, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3631524}, {"rating": 5.0, "title": "wonderful", "text": "Great hotel for a boston getaway. Stylish, serene, impeccable details. My only complaint was having to leave in the morning. Be careful if you would like a tub and shower. Our corner king had only a shower, which was no problem for the night but for longer stays I would have liked a tub in the bathroom. Given the excellent attention to detail, I have no doubt that if I mentioned this to the front desk, we would have been moved without a hesitation to a room with a tub.", "helpfulness": 1, "user": "linkakk", "date": "August 23, 2007", "id": 8486188}, {"rating": 4.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Within walking distance to super restaurants, shopping and Boston Commons. This converted Boston police station is a top notch hotel. The lounge on the ground floor is Cuffs, with pictures of old Boston policemen. Very friendly and accommodating staff. The room was relaxing and peaceful.", "title": "Intersting Irish hotel in an old Police station", "helpfulness": 1, "user": "Mad537", "date": "August 21, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8467484, "likes": {"liked": "— Location and comfort", "disliked": "— Metal towel bar shelf was heated to keep towels warm, jdut warmed your hand when you reached for a towel"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with friends", "text": "Jury's was a great little surprise - wonderful location, walking distance to many Boston sites and areas. The staff were friendly and helpful. We will definitely stay again when in the area.", "title": "Jury's was fantastic!", "user": "kmoran927", "date": "August 19, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8452292}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Stayed at Jurys for two nights at the start of August. First impressions of the hotel were great, it was a relief to step from into a cool air air conditioned are from the hot humid streets. The lobby is a mix of new and old with glass steps and a wall covered by a waterfall. Check in was quick and we were upgraded. The rooms are clean and all contain a CD Player which I though was a nice touch. Bathrooms are small, but have nice hot and powerful showers.", "title": "Great Hotel in a Great Location!", "helpfulness": 1, "user": "Jonathan2", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8447681}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We useed the irish bar downstairs \"Cuffs\" which was very reasonably priced and ate there one night also. The food is of a very high quality and unusual for a hotel that you get loads of it.", "title": "Extremely good", "helpfulness": 2, "user": "Traveller73London", "date": "August 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8446270, "likes": {"liked": "— Comfort & Service", "disliked": "— No Tea/Coffee Facilities"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We recently stayed one night as a birthday get away in town. Just as the other reviewers describe, the Back Bay was cozy but charming hotel. You can’t go wrong if you need a nice place to stay and close to the Back Bay area. A block away from the hustle and bustle of tourists and businesses, it was tucked away but easy to find, check in and out was smooth, overall service was great. Lots of shops and restaurants in walking distance or if you walk too far, take a cab back. We had a corner king room on the 8th floor. It was a smaller room but cozy and large bathroom. Overall clean and well decorated. A little worn but well kept. Only huge negative and turnoff was the extremely dirty remote which looked like…never mind. Since the local restaurants were swamped in the afternoon with a 40+ minute wait and I was “starving”, we ended up back at Cuffs, bar at hotel, for a late lunch and drinks. The food and service were good and drinks went down easy. It didn’t feel like a “hotel bar”. We used the valet parking, room service for breakfast, and ordered a movie. All were great, though the movies are a little pricey. Breakfast was average but we chose to stay in versus going out. We came to relax and rest (I was under the weather unfortunately) and the hotel and room were extremely quiet and it felt like we were the only guests on the floor. I typically don’t sleep well at hotels but in this case I got my 8 hours of sleep! A huge plus/kudos to the hotel for not making us feel like we were rushed or on their time table – we felt like true guests. I didn’t see a check in/out time on reservation, their website, or in the room nor were we reminded at check in. This set the tone for our 24+ hours of relaxing. Thank you!", "title": "Sweet Dreams...", "helpfulness": 2, "user": "Daphne418", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124974347}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Stayed at The Back Bay in January for 3 nights and really enjoyed it. Very comfortable room, clean, modern design with everything I needed. Staff were very very helpful. Only ate once, in the Irish pub downstairs, but the food was very good. I'd definitely recommend it!", "title": "A short trip, made very comfortable", "helpfulness": 2, "user": "Jcollins007", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124653470}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The service at this hotel will be noticed from the moment you pull up at the valet on the main street entrance. You will be greeted by friendly staff every step of the way. I believe there were [5] separate staff members that helped us before we had even been in our room. The lobby is classy and trendy with wood, stone and glass accents and very trendy colored lighting accents. There is a small but very cozy bar with a fireplace that was comfortably crowded. Men and women from their twenties to their sixties seemed to all have a spot to stand or sit where everyone seemed to be comfortable.", "title": "Modern & Classy", "helpfulness": 2, "user": "GCaldwell333", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 124585538}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The Deluxe Room with Tub that we stayed in was 5 Star from to top bottom form the wood furnishings to the stone in the bathroom. Very spacious, with all of the amenities such as luscious bedding, a desk, a small refrigerator (not a mini bar), and ironing board and iron, hair dryer & safe. They even went the extra mile and provided a robe and slippers, an umbrella and a bottle opener. There was also a nice stereo with a cassette and CD player (no iPod Dock) and a fancy Kureg style espresso/coffee maker with a variety of coffee cartridges and ceramic cups. The tub was not conducive to sharing but the shower was quite large with [2] shower heads.", "title": "Boston 4 day break", "helpfulness": 1, "user": "Barry G", "date": "February 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124576680}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We enjoyed the breakfast buffet in the restaurant that came complimentary with our package. The service continued to be very impressive, we were offered coffee and beverages (no bloody mary’s until 11:00am on Sunday) and were served our coffee quickly. The buffet was no continental breakfast, had a wide range of cold cereals and yogurts, hot American style breakfast offerings, and many different pastries and breads. The waiter also offered us anything we requested from the grille, such as an omelet or waffle at no additional cost (included with the breakfast buffet – typically $24/pp).", "title": "I was tired, early and welcomed with open arms...", "user": "Justine O", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124537536}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "My daughter and I stayed here in August 2007.", "title": "Very nice, friendly hotel.", "helpfulness": 2, "user": "taglio1", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 8656366, "likes": {"liked": "— clean, safe area, easy acess to the T.", "disliked": "— carpet was a bit stained. Room a bit small."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We arrived from CA at 7:30 am and by the time we reached the hotel it was still several hours to check-in. We did the paperwork and left our bags with the concierge and asked for an early check-in if possible. My daughter and I went to kill time having breakfast and shopping, but the concierge called and we were in our room getting ready to get a nap by 10:45am!!!", "title": "Another excellent visit", "helpfulness": 3, "user": "sue-manchester", "date": "September 4, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8617404, "likes": {"liked": "— Good location, clean, efficiently run", "disliked": "— nothing"}}, {"rating": 5.0, "title": "Absolutely Fantastic Place.....book this now!", "text": "The room was a king and on the small side but the bathroom was very spacious and nice. The carpet in the room could use cleaning.", "helpfulness": 6, "user": "dre51", "date": "September 2, 2007", "id": 8609507}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "We stayed 6 nights and enjoyed the cool well decorated hotel. They turned down the bed every night and the bed was comfortable with crisp linens.", "title": "Great City Hotel", "user": "Maier", "date": "August 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 2.0, "cleanliness": 3.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8579806, "likes": {"liked": "— Location", "disliked": "— Bar and lobby area"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Location was wonderful and very close to the \"T\" (metro)Newberry Street, lots of shopping, historical sites and restaurants.", "title": "Good hotel", "helpfulness": 1, "user": "mollyBarcelona", "date": "August 30, 2007", "detail_rating": {"front_desk": 2.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 5.0}, "id": 8547702}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I recently returned from Boston and my 3rd stay at The Back Bay Hotel. I really love this place. It's location is definitely a huge plus point - right in the heart of the Back Bay area, within easy walking distance of some great shopping (Newbury Street, the Prudential Center etc), restaurants and Boston Common, as well as a number of 'T' stations.", "title": "A welcoming stay, as always", "user": "NancyBlank", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124199251}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "As for the hotel itself, it has real character throughout: from the buidling (the old Police Headquarters, to the classic decor, to the people working there. The rooms (although not necessarily huge) are comfortable, very clean and have great bathrooms. The bar (Cuffs) downstairs is a great place to hang out, relax and defrost in front of the fire and feels much more cosy and welcoming than a lot of hotel bars I've been in. The staff have been fantastic on every visit and this time was no exception. They smile, say hello to you in the corridor and hold doors open for you. I have always made to feel like a welcome guest and will definitely return to the hotel in future.", "title": "Great stay for the price", "helpfulness": 1, "user": "Elsa3", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124155631}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "I stayed at this hotel for 3 nights. It is a very nice hotel in a good location. It is 3 blocks walk to Trinity Church. The staff was friendly and helpful. There is a bar/lounge on the botton floor which which nice to relax in after a day of touring. I especially liked the seperate shower and bath in the room. Shower also had a body spray. That was totally unexpected. I look forward to staying there again.", "title": "Great highend hotel.", "user": "Laurany25", "date": "February 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 124109493}, {"rating": 4.0, "title": "Don't let the name scare ou", "text": "I loved the back bay hotel. The beds were comfortable and the bathrooms big with heated towel racks!! Location and restaurant were great and all of the staff was helpful and friendly. I would return and stay there any time I am back in Boston.", "user": "DCJD2012", "date": "February 3, 2012", "id": 124093692}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I needed a last minute hotel for a business trip. It was the same weekend as a big event at Harvard, so there were very few rooms in the city. My travel service was able to locate a room at this hotel, and not knowing anything about it it, other than it being named the \"Back Bay Hotel,\" I was in great fear of it being a small, independent tourist trap in the Back Bay.", "title": "Great First Night Stay", "helpfulness": 1, "user": "BOBFOC", "date": "February 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 123955864}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We stayed here for 2 nights on our trip to the US. Loved Boston and Jurys! The room was lovely, beautifully decorated and cute soups/shampoo etc. This hotel is also very centrally located and the service is great! Would recommend to anyone - definitely would stay here again!", "title": "A great experience!!!", "user": "Helinski", "date": "October 26, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21247929, "likes": {"liked": "— Loveliness of the room and location.", "disliked": "— No in-room coffee/tea making facilities"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "My mum and I stayed in Jurys the 1st week of september, and the next time we go to Boston we will stay there again. The hotel is beautiful, the rooms are superb and the staff couldnt be nicer. I really wouldnt take any notice of the reviewer from philly because it soulnd like sour grapes. Everything was rated below average, because of an incident which they admitted happened!!!", "title": "Jurys is a credit to the brand", "helpfulness": 3, "user": "redlisab", "date": "October 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 21091741, "likes": {"liked": "— Rooms especailly bathrooms", "disliked": "— Nothing springs to mind"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "Anyways moving on, we fould the staff exceptional. Do order room service, we were hit by hte rains of the hurricane on the sat and ordered the steak and the pizza. In the room in 30mins and so beautifully presented. $40 total incl room service charge, tax etc.", "title": "BRILLIANT!!!!", "helpfulness": 3, "user": "irene1206", "date": "October 19, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 21002702, "likes": {"liked": "— romm comfort", "disliked": "— no coffee making facilities in room"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "Do go to the oulet centre. This can be booked with boston common coaches, or through the concierge. $35, you are collected and dropped off at your hotel. My advice is to walk to the very top and work your way back, make sure and check out Ruby tuesdays for lunch there, The salad bar is amazing.", "title": "Verdict is in... Jury's is the Best", "helpfulness": 2, "user": "luggageinhand", "date": "October 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20956529, "likes": {"liked": "— Incredible Employess!", "disliked": "— The food prepared late at night is not the best."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled solo", "text": "Try legal seafoods if you like fish!", "title": "Worst Hotel Stay Ever", "user": "philly11", "date": "October 13, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20858470}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The Jury's in Boston is a wonderful hotel, the staff are pleasant and helpful. The rooms are immaculate and the restaurant is one of the best in the city!!!!", "title": "This hotel makes your stay in Boston!!!", "helpfulness": 4, "user": "claired11", "date": "October 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20797402, "likes": {"liked": "— The attitude of the staff", "disliked": "— Nothing!!!!"}}, {"rating": 5.0, "title": "Will go again!!", "text": "Me and my boyfriend stayed at this hotel while on holiday in America, we chose it due to the reviews the on site and it was well worth it. From the moment we stepped inside the hotel we were treated as if we were royalty!!!", "helpfulness": 4, "user": "Ali2503", "date": "October 10, 2008", "id": 20772856}, {"rating": 3.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "We dined at the restaurant and it was the best meal we had in the city!", "title": "Average hotel, at best.", "helpfulness": 2, "user": "papahills", "date": "October 7, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 20686712, "likes": {"liked": "— comfortable bed", "disliked": "— noise from the lobby bar"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "We would definately recommend this hotel to anyone!!!", "title": "Lovely hotel", "helpfulness": 3, "user": "Geecee_7", "date": "October 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 20670697, "likes": {"liked": "— Hot towels to refresh you on arrival", "disliked": "— Nothing - it was all fab!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My partner and I stayed at Jury's for 3 nights and would definately recommend it to others. It was in a good location, really easy to walk everywhere, 2 minutes to Newbury street (nice shopping and restaurants. Also Grill 23 is opposite the hotel (not cheap in dollars but compared to home not bad for such good food and service) definately worth a visit if your having a romantic evening and want to stay close to the hotel.", "title": "A most pleasant stay, with very friendly and accommodating staff", "helpfulness": 3, "user": "MinisterOfCulture", "date": "October 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 20577321, "likes": {"liked": "— The friendliness of the staff", "disliked": "— The service for breakfast in the restaurant was a bit slow, possibly a bit disorganized"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "Jury's hotel is centrally located in the Cityof Boston and walkable almost to everything worthwhile except for the Seaport and wharf area.", "title": "Simply Lovely", "helpfulness": 2, "user": "VivaG", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8525520, "likes": {"liked": "— The lavish service and accomodation", "disliked": "— Hard to reach Concierge"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "It's located in the former police headquarters which fits well into the mixtures of older and newer architecture in the downtown area.", "title": "Excellent hotel", "helpfulness": 3, "user": "Muzzdobetter", "date": "August 28, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 8522202, "likes": {"liked": "— Quiet, clean, very comfortable"}}, {"rating": 4.0, "title": "Nice hotel", "text": "Our room the first night was a regular king room and although not huge it was extremely well appointed with all the conveniences. The furniture was deep cherry in color including the bathroom vanity. The bathroom had tile and marble. The color scheeme was green, gold and tan which is perfect since this is supposed to be an \"Irish\" Hotel. The linens were frette and gorgeously high thread count. The duvet and sham covers were luxurious and I only wish I could have them at my home. I loved that they had always replenished complimentary bottles of drinking water in the inroom fridge and 24 hour room service for snacks, meals and all types of beverages.", "helpfulness": 3, "user": "mong1114", "date": "August 28, 2007", "id": 8522028}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The front desk personnel were fast, efficient, and mostly Irish. The head concierge was tremendously accomodating when I could finally get a hold of him and helped with dinner reservations and a private driving tour of the city. HIs restaurant suggestions met our needs exactly and we were trememndously impressed by the reccommendations.", "title": "great place to stay in boston", "user": "kevinfromtheuk", "date": "August 27, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8516598}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Housekeeping did a tremendous job and the same housekeeper tends to the same block of rooms day after day which I found refreshing, so I knew my tips were going directly to the person responsible for the upkeep.", "title": "Fantastic hotel!", "helpfulness": 1, "user": "daveCalifornia", "date": "August 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8489331, "likes": {"liked": "— Bedding", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Stayed 3 nights at this hotel late last month.", "title": "Best Hotel Ive stayed at", "user": "scot5", "date": "August 11, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "service": 4.0}, "id": 3754467}, {"rating": 5.0, "title": "The Jury's not out!", "text": "It was excellent, the location was great, the staff were very helpful. the rooms were big and spotless, Bathroom was also great and spacious.", "user": "A TripAdvisor user", "date": "August 11, 2005", "id": 3754009}, {"rating": 5.0, "title": "superb hotel", "text": "They even turned down our beds at night and left soft music and chocs.", "user": "A TripAdvisor user", "date": "August 7, 2005", "id": 3743887}, {"rating": 5.0, "stay_parameters": "Stayed August 2005", "text": "I would stay at this hotel again without a doubt.", "title": "Great Hotel", "user": "Geezo", "date": "August 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "service": 5.0}, "id": 3741411}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The bar was very busy at night, but that was probably due to it recently reopening, however it could not be heard from the rooms.", "title": "Nicest Hotel we have ever stayed in!", "user": "BBrookline,MA", "date": "August 5, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3738548}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled with friends", "text": "Fantastic place, terrific staff, warm welcome and very clean. Food very good. Will definately be back!", "title": "Fantastic Staff", "user": "Globetrotter037", "date": "March 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14168086, "likes": {"liked": "— Convenient location for all attractions", "disliked": "— Didn't dislike anything"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "This is an excellent hotel, well located in a fantastic city. On arrival, the staff are friendly and courteous. The room was reasonably sized and clean. The bed was very comfortable and there was a 32 inch TV. One nice touch was that 2 complimentary bottles of water were in the fridge and replaced every day.", "title": "Great Location, Great Hotel", "helpfulness": 1, "user": "CorkPaul23", "date": "March 7, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 14111891, "likes": {"liked": "— Location and staff", "disliked": "— Leaving!"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled with friends", "text": "The maid service was excellent and the room was thoroughly cleaned each day with a turn down service each evening. as mentioned previously, Cuffs bar is nice and very popular locally.", "title": "Best bar in town", "helpfulness": 1, "user": "MJMGlasgow", "date": "February 27, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 13896289, "likes": {"liked": "— bar", "disliked": "— glass stairs to reception"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2008, traveled as a couple", "text": "The hotel organise a bus to the outlet shops in Wrentham every day for $38 per person and it takes about an hour to get there. On the bus you will get a coupon book and if the aim of your visit is shopping this is very useful.", "title": "Excellent choice in Boston", "helpfulness": 4, "user": "Dana_SF", "date": "February 23, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 13792332}, {"rating": 4.0, "stay_parameters": "Stayed February 2008, traveled on business", "text": "The hotel is well located in Boston and Boston Common is within 5 minutes walk of the hotel. For shopping Newbury street is 10 minutes away. The closest T station is arlington and even more shopping can be found in Quincy Market (3 stops on the green line to Government Buildings)", "title": "A different kind of hotel", "helpfulness": 1, "user": "cfalker", "date": "February 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 13782943, "likes": {"liked": "— Staff", "disliked": "— exericse room"}}, {"rating": 3.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My husband and I recently spent three nights at Jury's. The hotel was nice enough but nowhere near the standard we were expecting after reading all the reviews on Trip Advisor.", "title": "Not as good as expected", "helpfulness": 1, "user": "Traveller from UK", "date": "September 24, 2008", "detail_rating": {"cleanliness": 3.0, "front_desk": 4.0, "location": 3.0, "value": 3.0, "rooms": 3.0}, "id": 20340938, "likes": {"liked": "— The fluffy towels and bath robes and good location", "disliked": "— No coffee maker in the room"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Our room (on the third floor) was very cramped, with dated furniture and the carpet had obviously not been cleaned properly for a very long time as it was covered in stains. The most surprising thing was that there was no coffee maker provided in the room. It was possible to get coffee downstairs but only at very odd times and certainly not during the main part of the day.", "title": "top hotel", "user": "merseydave", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20127815, "likes": {"liked": "— great location", "disliked": "— nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The bathroom was a reasonable size with lovely thick towels and robes but we only had a walk-in shower and no bath. It would have been lovely to have been able to soak our aching feet at the end of each day!!!", "title": "Met expectations", "helpfulness": 1, "user": "n1cf2", "date": "September 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20112728, "likes": {"liked": "— Location", "disliked": "— On the weekend, the hotel coffee bar does not open until 6:30am. All coffee shops are at least 2 blocks away. Coffee maker is not provided in room."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "The bar in the lobby was really noisy and always so full that even if we had wanted to get a drink or a snack, it would have been impossible.", "title": "Love Jurys Hotel! #1 in Boston!", "helpfulness": 1, "user": "rokeedy", "date": "September 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20089910, "likes": {"liked": "— Everything!"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Jury's was definately not our idea of a \"boutique Hotel\".", "title": "Great Hotel, great staff.", "helpfulness": 1, "user": "WANTOTGOTHERE", "date": "September 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20042920, "likes": {"liked": "— Just About Everything", "disliked": "— Parking Charges"}}, {"rating": 2.0, "title": "Big Mistake", "text": "I booked this hotel because of all the great reviews on this site. BAD IDEA. We checked in in the late afternoon and learned they gave our confirmed room with two double beds away (with confirmed guarantee for late arrival which we weren't late for at all) and offered us what they said was an upgrade...a corner room with one king size bed for two adults and two children. After waiting for over one hour for their engineer to figure out how they will fit in two roll-aways (which was against the fire code) they decided to move out the desk, chairs etc to fit the beds in. The roll aways were just threads away from the springs popping out, needless to say the kids were up all night and so then were my husband and I.", "user": "jetlagged7", "date": "May 7, 2008", "id": 15781494}, {"rating": 5.0, "title": "Pricey but nearly flawless", "text": "The manager on duty offered half off for the night, after I said we weren't paying for the night. Not exactly the gold standard in customer service...the room should have been offered at no charge right off the bat since they broke their confirmation with us, had us wait for over an hour to try and resolve and then delivered two horrific roll-aways. We checked out in the morning and moved to another hotel. When they learned we were checking out two nights early they offered us the junior suite. By that time we were so aggravated and had made other arrangements and were ready to go. We moved over to the Hyatt Regency...professional staff and very clean hotel.", "user": "thehebrewhoya", "date": "April 30, 2008", "id": 15519856}, {"rating": 5.0, "title": "great hotel", "text": "Pluses: good location, professional and friendly staff, well-appointed and well-sized rooms (why do people think they're small?), tasty food from room service, free water bottles in the minibar and no tempting junk food (unless you request it to be stocked).", "user": "ukgirl48", "date": "April 24, 2008", "id": 15330288}, {"rating": 5.0, "title": "Great Hotel", "text": "Minuses: overpriced valet parking (use a garage instead), overpriced a la carte menu (order the pre-set breakfasts via the door tag instead), not all rooms have bathtubs (but the shower was nice), crowded bar downstairs (no problems with noise, and the bar may be your scene, but it wasn't for me).", "user": "janiel", "date": "April 24, 2008", "id": 15318212}, {"rating": 4.0, "title": "Comfortable bed", "text": "I didn't have as good a view of the city at Jury's, but I thought our room was great and convenient. The room was smaller than the other Boston hotel I stayed at, but it was very comfortable and the corridors were nicer. Lots of staff at the desk and doors, though checking in or out can get congested at times. The elevators had this awful shiny wallpaper in them, but the stairs by the bar had a nice waterfall... I will be booking Jury's again for my next trip to Boston.", "user": "Tony M", "date": "April 19, 2008", "id": 15144394}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Could not fault the Jurys though didn't utilise all its features.", "title": "Perfect!", "helpfulness": 1, "user": "tinytay1or1981", "date": "April 17, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15105874, "likes": {"liked": "— Extended check out (additional 2 hours for me)", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The double bedroom was small but perfectly formed. There was also a mini fridge in the room which was replenished daily with two bottles of still water yet enough room to house own refreshments. The bathroom only has a shower, not an issue for me, but I appreciate the need for some travellers to have a bath. Luxury toiletries (including ear buds and cotton wool) which were, again, replaced after use.", "title": "Great time at the Jurys", "helpfulness": 2, "user": "orchard_03", "date": "April 13, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15005005}, {"rating": 2.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "I used the fitness room at 6am, 7am, 8am and 6pm and, although small (6 cardio machines, rack of free weights and modular weights) I didn't have a problem with having to Q for equipment. It also has three tv screens, magazines, a water machine and towels.", "title": "No Coffeemaker", "helpfulness": 1, "user": "AnnaAnnapolis", "date": "April 12, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "location": 4.0}, "id": 14983536, "likes": {"liked": "— Location", "disliked": "— No coffee maker"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled as a couple", "text": "As other reviews have mentioned; location's ideal, staff are pleasant and helpfull and internet access was a bonus. I would recommend this hotel to anyone and would gladly stay here again if I ever return to Boston.", "title": "Amazing time at the Jurys Boston Hotel", "helpfulness": 3, "user": "Albs86", "date": "April 6, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 14836884, "likes": {"liked": "— the location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Just got back from a 6 night stay in Boston at Jurys hotel in early April, staying in a deluxe double room with my husband and 9 year old daughter.", "title": "Comfy room; great service; reasonable price", "helpfulness": 1, "user": "DorkySwede", "date": "April 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 14741826, "likes": {"liked": "— Comfy room", "disliked": "— Lots of stairs in lobby area"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "The Jurys was a solid 4-star hotel experience. The service was unfailingly professional and friendly, from the bell staff to the concierge to the front desk. Our room, a deluxe with two double beds, was standard-size and was decorated nicely in a contemporary, neutral palette. The extra touches in the room that we appreciated were: free bottled water in the mini-fridge, a full-sized hairdryer that wasn't attached to the wall, Aveda toiletries, comfy double-sheeted beds with good-quality linens, a CD player, a fairly large television, a cool retro bedside clock, turndown service with chocolates, and 24 hour room service (with decent food, no less!)", "title": "Solid 4-star experience", "helpfulness": 1, "user": "SanFranciscoSfgal", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 8439100, "likes": {"liked": "— Service, location, room"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "The only negative I can think of about the room is that there were no cotton balls or q-tips provided in the bathroom. It wouldn't have been a big deal had I not forgotten mine. I'm sure I could have called housekeeping and they would have brought some.", "title": "Friendly Hotel", "helpfulness": 2, "user": "Stuart84", "date": "August 16, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 8435688, "likes": {"liked": "— Location"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "Finally, the decor of the lobby was a little bit off. The hotel has a mostly traditional-to-contemporary feel, so I am not sure why the designer thought it would be a good idea to throw in some neon lights under the stairs and weird disco panels on the walls of the wood-paneled elevators. Dunno, maybe they were trying to make it look more trendy. I thought it looked out of place.", "title": "Style, Luxury and Amazing restaurant", "user": "tlhjar", "date": "August 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8421302, "likes": {"liked": "— Room, Elevator (sparkly), restaurant, front desk & concierge", "disliked": "— No pool or gift shop"}}, {"rating": 5.0, "title": "Great Hotel - Love the bathrobes", "text": "Overall, though, a good place to stay and a good location for shopping in Copley and along Newbury Street.", "helpfulness": 1, "user": "warrenokane", "date": "August 14, 2007", "id": 8419881}, {"rating": 5.0, "stay_parameters": "Stayed March 2007", "text": "We stayed at the Jurys Boston for four nights and chose it after reading the Trip Advisor reviews. We were not disappointed, the hotel has atmosphere, the staff are friendly, the bar and restaurant are well used and popular. The location was ideal for us, not too close to the centre but within easy walking distance of shops, bars, restaurants. Definitely a great base from which to explore Boston.", "title": "One of the Best Hotels we've stayed", "helpfulness": 4, "user": "sacanon", "date": "August 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8376317, "likes": {"liked": "— When arriving in my room", "disliked": "— When I had to leave"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008", "text": "After reading the Tripadvisor reviews we decided to spluge and stay at the Jury's during a recent trip to Boston. The hotel is lovely, with nice amenities and the staff couldn't have been more helpful and/or friendly. For us the hotel was perfectly located and it was easy for us to navigate to/from. Our package included breakfast which was delicious and generous. The room was small and did not have a nice view but was well appointed and clean. Try the Jury's for a splurge or a special event... but prepare yourself for a pricey stay.", "title": "Nice stay though a bit pricey", "helpfulness": 1, "user": "tovaent", "date": "October 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 20540680}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Spent 8 night's in Boston with my 19 year old daughter. I selected Jury's on the basis of other trip adviser reports and the fact that I got a good rate of £840 from Opodo back in January for 8 nights.", "title": "Good Hotel", "helpfulness": 2, "user": "cannytraveller2008", "date": "September 26, 2008", "detail_rating": {"front_desk": 4.0, "service": 3.0, "business": 4.0, "cleanliness": 3.0, "rooms": 3.0, "location": 4.0}, "id": 20404766, "likes": {"liked": "— Free internet access", "disliked": "— Lacked that special something"}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The hotel was perfectly adequate but lacked the special something that other guests seemed to find. The restaurant was pricey, the bar (Cuff's) noisy. I missed the fact that there were no coffee making facilities in the room although I accept that American hotels just don't seem to do this. We made use of the fridge and hotel safe but toiletries were not replenished each day which was annoying.", "title": "Loved the place!", "helpfulness": 1, "user": "Rich_Forbes", "date": "September 26, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20392986, "likes": {"liked": "— Great location", "disliked": "— International call charges..."}}, {"rating": 4.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The free bottles of water and chocolates on our pillow were a nice touch but my quilt had a cigarette burn hole which should have been noticed when room was prepared and the bathroom light only worked when the main room light was on which made life difficult during the night.", "title": "Would definitely recommend", "helpfulness": 1, "user": "LondonIrishgirl", "date": "September 26, 2008", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "value": 4.0, "rooms": 4.0, "service": 5.0}, "id": 20389705, "likes": {"liked": "— The service was excellent. A really nice atmosphere about the whole hotel"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Concierge was helpful when approached and willing to keep our bags on the last day as our flight home was in the evening.", "title": "Great Hotel in a great location!", "helpfulness": 1, "user": "DevanSam", "date": "September 25, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20379844, "likes": {"liked": "— Spacious, well appointed rooms"}}], "location": {"country": "United States", "city": "Boston"}, "stars": 4, "variance": {"poor": 51, "average": 113, "very good": 518, "terrible": 18, "excellent": 1064}, "aka": "Back Bay Hotel", "slim_ranking": 0.25974025974, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Here you'll find an extraordinary hotel with a landmark address in the heart of the historic Back Bay area. The Back Bay Hotel, formerly Jurys Boston Hotel, is located at the former Boston Police Headquarters, offering a unusual fusion of old and new with a historic building and spacious elegance, updated with exquisitely detailed design and world-class service. With an urban American grill, a vibrant and traditional bar, a state-of-the-art business centre and a gym, this four-diamond hotel offers something entirely unique for frequent business and leisure travelers who seek a distinctive Boston experience. There cannot be a better way to experience Boston."}