{"user_rating": 4.0, "review_count": 571, "name": "Loews New Orleans Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "No frills, just nice and convenient for the convention center as well as the French Quarter.", "title": "Pretty nice place", "user": "Salandtal", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 103030733}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Stayed in Mid-march while in twon for a conference at teh Sheraton.", "title": "Good solid business hotel", "helpfulness": 1, "user": "auroraclubjazz", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 102322654}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "Room: had a \"grand luxury\" room - very large, with king bed, couch, sitting chair, two flat screen TVs, a great CD player, work desk and good lighting options. The room had individual climate control. The bath was large, with a separate tub and shower. Good water pressure and temp. Tub was slightly larger than average but not a real soaking tub. Room also came with bathrobes. There was a safe that fit my 14\" laptop, but a 15.6” widescreen may not fit. The room also had a mini-bar and snacks. Spendy as usual but nice to have and much more convenient than room service. Overall decor was nothing special - functional, not opulent. Room seemed clean. This is not a historic hotel by any means. It is a good solid functional hotel.", "title": "Great service, convenient location", "user": "momsadreamer", "date": "March 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 101551943}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Gym/pool: Pool is long enough for decent, albeit short, lap workouts. It is a saltwater pool, which is more environmentally sound, but some people don’t like that sort of thing. The whirlpool is a good size and was hot. There is a sauna as well, but you will need to fire it up well before you want to use it. I didn’t use the gym, but it looked nice. There is also a spa on that floor. Didn’t use that either.", "title": "Great service, excellent location, wonderful hotel", "helpfulness": 1, "user": "monkeylizard", "date": "March 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 101454061}, {"rating": 2.0, "stay_parameters": "Stayed March 2011", "text": "View: The view is important to me as I like to kick back at the end of the day and watch the world go by out my window. I was on the 11th floor, which I think is the first floor of rooms, and I had an interesting view of the Spanish Plaza, Poydras St, the CBD, and of the line of people waiting to eat at Mothers. The opposite side of the building faces a high rise hotel, so views on that side are limited in some rooms. Windows are large.", "title": "Sister Trip that Started Wrong", "user": "crazy2all", "date": "March 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 101279110}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I stayed here on a business trip recently. The hotel was fine - just fine. The location is good (within walking distance of much of what you go to New Orleans to see) and the hotel, for the most part, is clean and functional so an overall decent place to stay (plus they allow pets, which is always nice in case you want to bring your dog or cat!). But it wasn't amazing - things in my room (phone, computer cord) were broken, the sheets and towels looked a little worn, room had a generally ok, but not super modernized feel about it. I probably would stay somewhere else if I were to go back to New Orleans for fun. The beds were comfortable though - I will say that!", "title": "Decent place - not a standout (particuarly bad OR good)", "helpfulness": 2, "user": "LJWNYC2008", "date": "September 29, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 118745912}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "Hotel was very clean, very nice view of river. Lobby is very nicely designed. Very impressed", "title": "Nice Hotel - Exclusive!", "helpfulness": 1, "user": "OnDaBeech", "date": "September 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118708845}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This is our second trip to the Loews Hotel. Both times we've stayed here have been free with credit card rewards. It is directly across the street from Harrah's Casino. Probably a good 15 minute walk from the French Quarter. It is a nice hotel, rather upscale, a bit on the snobby side in my opinion. Bell attendants are great and very friendly! My biggest complaint would be that the Valet parking price is ridiculous! It cost us $76 to park for two days. There is no parking in New Orleans, so you don't have much of a choice. It cost us less to park at our airport for 6 days than to park 2 nites here! And, don't touch anything in the room other than the coffee (free) because everything else comes with a hefty price tag. Nice place, though, and clean which is very important to us.", "title": "Nice hotel - expensive parking", "helpfulness": 2, "user": "Judi D", "date": "September 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118388591}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "In a city where good hotels abound, Lowe's does not rise above average. It is showing its age and the lobby is very small. The rooms are very spacious, however, and the views of the Mississippi are nice from the upper floor rooms. The rate, via TravelZoo was very good and included parking.", "title": "AVERAGE HOTEL", "helpfulness": 2, "user": "SPTrav", "date": "September 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118371327}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The location is very good, the French Quarter, the Casino, the St Charles Line, etc. are right there.", "title": "Love the NOLA charm and service!", "helpfulness": 2, "user": "belladolcevita", "date": "September 19, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118320250}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My husband & I just stayed this past weekend since I won a promotional 'stay-cation' from a local radio station. I would never have thought to stay on the Poydras side of the French Quarter but it really is a great location.", "title": "Great hotel, away from the hustle and bustle", "helpfulness": 2, "user": "lporle", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "service": 5.0}, "id": 117473978}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The hotel is in a great spot, walking distance to Harrah's, Canal Place, The Riverwalk, French Quarter and also the Wharehouse District. Not only is it convenient to everything but the plus is that it's not noisy since it's not in the heart for the French Quarter.", "title": "Huge Rooms and Great Service", "helpfulness": 4, "user": "VermontEnthusiast", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117413363}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Everyone we came in contact with at the hotel was very friendly and willing to help if needed. The brunch at the hotel restaurant, Cafe Adelaide, was quite delish and not terribly over priced for a hotel. The rooms are very spacious and full of great amenities. I loved having a decent cup of coffee in the room, they have Keurig's with Emeril's coffee in the room with plenty of sweetner/cream (there usually isn't enough for me). The beds were also quite comfortable. The best past was how quiet it is at night, making it possible to get a good night's sleep.", "title": "Nice", "helpfulness": 2, "user": "Sowegadoc1", "date": "August 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 117323486}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I think having stayed in both the FQ and on the out skirts now I would choose this hotel and over and over each time. It's a great get away and so charming.", "title": "Luxury without a luxury price", "helpfulness": 3, "user": "JemJoch", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117189296}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My family and I just spent the weekend at the Loews in New Orleans and really enjoyed our experience. We booked a suite using Loews Suite Deal which included free wireless internet, free parking and a $50 room credit per day. This made the huge suite very affordable, and when I say huge, I mean huge. It was bigger than my sisters apartment in Boston! The king bed is extremely comfortable and my 12 year old son said the pull out queen couch was comfy too. Shower pressure is nice and strong, and the shower stall is double size. The suite is in a corner so there are two huge windows in the bedroom and sitting room that overlook the Mississippi River and one window over the whirlpool tub in the bathroom that overlooks the city. The room was clean and the service was top notch. Everyone is extremely friendly and willing to be of service. We had room service for breakfast and the food arrived hot, on time, and with a smile. It was delicious! The location is excellent...just a couple of blocks from the Riverwalk Mall, Saks, and Pinkberry (yes, there is a Pinkberry Yogurt in New Orleans now!), and just across the street from Harrah's Casino. It's a short walk (15 minutes) to Jackson Square but by not staying in the French Quarter, you don't have to deal with the noise and the revelry. This is a quite hotel so you can get a good night sleep.", "title": "Best of both worlds: Peace and quiet close to Bourbon St.", "helpfulness": 3, "user": "Needsomesun29", "date": "August 23, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117156431}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Everyone from the doorman to the general manager were friendly and helpful. The bar and restaurant were fantastic. We were there for the Tail of the Cocktail dinner, and the food and cocktails were exceptional. The room was very large in comparison to other hotels, and they had all the detail things I wanted. It is a short walk to the quarter, so a few times we just took the cabs that are right outside the hotel. The river walk and casino were super convienient to walk to though. The bed was very soft, and the linen was nice. Overall, we had a great stay, and will stay here in the future.", "title": "Classy as the Ritz, but casual as the Holiday Inn.", "helpfulness": 3, "user": "SimonTheSpaceWandere", "date": "August 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116684081}, {"rating": 4.0, "stay_parameters": "Stayed August 2011", "text": "Doormen, valet, front desk all very accommodating & seem truly happy to provide service to us as their guests. Nice view from our room of the Plaza d'Italia. Comfy beds and a good stay overall! Only downside was no soft drinks or water except for $6 bottled water in mini fridge. Had to walk across street to purchase at another hotel?", "title": "Great service from hotel staff made our stay pleasant", "helpfulness": 1, "user": "txmom23boys", "date": "August 11, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 116581641}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My husband and I were really looking forward to massages and using this spa following our 6 hour bike tour of the city the day before. We walked there from our hotel in FQ and forgot our bathing suits. When we mentioned our disappointment over missing the chance to try out the pool/sauna, they did nothing to recommend a remedy-that was a pretty big missed opportunity in my book to have done something above and beyond service-wise. We had pretty good massages, but when we went to pay they gave us a WHOLE BIG HASSLE over accepting our pre-booked spa deal which it clearly communicated on our booking. The difference in price was not that big either. The manager of the spa was not helpful---she was arguing with my husband on who's fault it was and kept going back and forth with her staff on who booked it and input the info wrongly. THIS TOTALLY RUINED the relaxation and de-stressing that we'd gotten from the massage. To me it was a WASTE. I would not return to this spa nor ever stay at that hotel. In a city with so many other great places to try I was expecting much more.", "title": "SPA ONLY REVIEW----would not return", "user": "livelaughlove42", "date": "August 11, 2011", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "service": 1.0}, "id": 116563402}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We were expecting more from a '4-star' hotel. It was average in appearance and average in service. Ok for singles or adults, but not for a family. Esp. when you need easy and quick access to your car. We needed to retrieve several items that were left in the car throughout our stay. We waited twice for more than 20 minutes for our car. Not family oriented as far as cost -- everyone expects a tip for any service rendered. We had requested a refrigerator & microwave when we made our reservation one month in advance, and called the hotel a day before our arrival to make sure they would be available. When we arrived in our room, we had a refrig that did not work and no microwave. The process to reserve a refrig and microwave need to be revised (if there is a process). The toilet was also plugged up when we first got to our room, and the second day no one came to the room to clean.", "title": "Not What Expected", "user": "dynamicbush", "date": "August 8, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 116442071}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "It was a nice hotel. The bed was very comfortable, our view was of the cruise ship dock and the Crescent City Connection. The location is OK, a little far from the Quater, but you can easily walk it. it is across the street from Harrahs, so that is a plus.", "title": "Nice Hotel", "helpfulness": 1, "user": "ajimsojka", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116429308}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We stayed here when we were at a convention. I really liked our room - it was large and had nice amenities like single cup Kerig coffee maker, refrigerator and large bathroom with separate shower & tub. They were even kind enough to bring up a microwave when we asked. The location was close to the convention center and the river and not too far away from the French Quarter.", "title": "Nice Hotel, Good Location", "user": "iam_intrigued", "date": "February 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 151761418}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The restaurant did not look too inviting and the doorman were not too friendly. Those were the only two negatives. The front waiting area was very nice and the check in staff were nice. This is a nice, quality hotel.", "title": "Very nice hotel, well appointed and convenient to all", "user": "fjrbandit", "date": "January 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150510343}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Located across the street from Harrah's, three blocks from the French Quarter this hotel is within walking distance of all of the attractions New Orleans has to offer. The room was very nice, clean and spacious. The hotel staff could not have been friendlier. While we didn't visit the bar or restaurant they were certainly crowded and appeared to draw quite a crowd both nights we were there. My next trip to New Orleans will definitely include a stay at Loew's.", "title": "Great location, excellent service", "user": "naylorchick", "date": "January 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 150373122}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I must admit that the rug in my lovely room had seen better days...but frankly, I just didin;t care. The room was spacious, huge windows lots of natural light. The location of the hotel was excellent in my opinion..close enought to walk to the quarter, casino, warehouse district, and the St Charles streetcar. It was just removed enough from the craziness of Bourbon street....I did like that. Many really good restaurants nearby as well as the museums and canal street for supplies, tee shirts..etc etc.", "title": "Very good for New Orleans; Just average overall.", "helpfulness": 2, "user": "Nick_PHX_AZ", "date": "January 21, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 150237519}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "The customer service is very good here....excellent concierge services. I felt very taken care of there....all in all a great stay and I would love to retrun!", "title": "Loved our stay plus great staff", "user": "BrentKY", "date": "January 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 150234220}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Nice upscale hotel with only a few small issues.If your looking for a hotel with class and a top notch spa look no futher.The location is great,it's right across the street from Harrahs and about 5 or 6 blocks from the La. Superdome.Also about 3 blocks to the French Quarter.Don't forget to hit Dragos for it's charbroiled oysters,at The Hilton Riverside(2 blocks).The small issues were the hot tub had a bit of mold,the bed was a bit too firm,and the ac didn't seem to put out too good..But believe me the hotel was still top notch.", "title": "Great Spa", "user": "harleybonz", "date": "November 3, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 21498260, "likes": {"liked": "— nice river view", "disliked": "— weak a.c.,firm bed"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "We checked into a room with mold in the corner grout of the bathtub. The slip strips were discolored. 11 ring marks & a spill on the coffee table. As an \"upscale\" hotel, I expected more. So, I asked for a new room on speaker phone since the cordless phone was dead.", "title": "Housekeeping issues - some redeemable qualities", "helpfulness": 1, "user": "Msshuffler", "date": "September 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 20239994}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "The second room had cookie crumbs in the wingback chair and a something elliptical resting on the top ledge of the thick baseboards. No mold, but still nasty looking slip strips. I called and asked for housekeeping to come while we went to dinner. When we returned two hours later, no one had been in the room. When I called and said we wanted to head to bed, two housekeepers arrived in minutes. The housekeeper who picked up the item of the baseboard said it was gum although my guess is still peanut.", "title": "Loved this place!", "helpfulness": 1, "user": "faat1", "date": "September 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 20162045, "likes": {"liked": "— Great location and facilities.", "disliked": "— Sofa in the room was stained and old."}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "We began a \"check before use\" policy that found dirty smudges on a wash cloth and a pillow sham. The washcloth was particularly gross because of proximity to the toilet. The next morning, I found the blow dryer inoperable - about 10 minutes for the replacement.", "title": "The Best Hotel Staff EVER", "helpfulness": 1, "user": "RayPRoch", "date": "September 10, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19968189, "likes": {"liked": "— Staff and it's Pet Friendly", "disliked": "— Absolutely Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "In addition to my housekeeping calls, we were \"needy\" guests: Early check-in; left the car in the valet stand while we checked in; late check-out; had to get back in the room after check-out; asked to borrow an umbrella after check-out; luggage storage. All of these requests were accommodated. No person, was ever short or rude (even the folks who cleaned the room while we looked on.)", "title": "Great Hotel", "helpfulness": 1, "user": "travman62", "date": "August 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 18926519, "likes": {"liked": "— Very good service, very large and clean rooms and a great location.", "disliked": "— The bartenders were a bit grumpy at 1 am in the bar."}}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Poor customer service, no inclusions, bathroom shower leaking water, inconvenient location to restaurants and bars. Room and bed was average. Fire alarm drill before 8am without explanation. No wireless in rooms (have to go to lobby). Find somewhere with better customer service and better inclusions.", "title": "Crap", "helpfulness": 5, "user": "Robbie_Tarls", "date": "September 15, 2011", "detail_rating": {"value": 1.0, "location": 2.0, "service": 1.0, "rooms": 2.0}, "id": 118137048}, {"rating": 1.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We staid at this hotel in September of 2011. The fire alarm went off early in the morning several times. Then very loud announcements were made over a speaker, repeatedly, saying it was a false alarm.", "title": "Fire Alarm Goes off Very Early in the Morning", "helpfulness": 3, "user": "HippoNC", "date": "September 13, 2011", "detail_rating": {"value": 1.0, "location": 5.0, "service": 1.0, "rooms": 1.0}, "id": 118090432}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We complained several times to the hotel staff the next day. As far as we can tell they did not do very much for most of the guests. We were offered a free drink at the bar and did not receive anything additional until we complained repeatedly and even then it was not as much as we should have received.", "title": "A room witha view!", "helpfulness": 1, "user": "ringerb", "date": "September 13, 2011", "detail_rating": {"value": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 118044422}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The hotel staff blamed the false alarm on a tropical storm that was in the area, but the truth is, the weather was not that bad and we were not aware of any other hotels with fire alarms going off because of the tropical storm. I would not stay here again or recommend it.", "title": "LOVED IT!", "helpfulness": 2, "user": "Ricks911", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117921713}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "We were on the 18th floor so the view of the river was fantastic. Our bellhop was very helpful, showed us everything in the room and later retrieved an article that we'd left in our car. Huge room, 10 foot ceilings with crown mouldings, very tasteful furnishings, large shower and seperate bathtub, two LG flatsceen TV's and the best bed we've been in for a week. Never heard a sound from other guests or from the street. Only gripe is the $13/day internet which is painfully slow. Valets were fast. Convenient to everything. Wouldn't hesitate to stay here again.", "title": "Modern, Comfortable with Nice Amenities In Good Location", "helpfulness": 2, "user": "cyclistmike", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 117920158}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Wanted to enjoy the New Year in New Orleans, so returned to the Loews. Dined early in Cafe Adelaide for NY Eve, loved it, then went to Woldenberg Park for the fireworks, and then to Casino, and then back to the Hotel. A great night in 3 blocks!", "title": "Another Great Staycation", "user": "JudyPonchatoula_LA", "date": "January 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 92467250}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "Next day, late breakfast and spa!!!", "title": "Made us feel like royalty! An EXCEPTIONAL hotel experience!", "user": "Emptynester2313", "date": "December 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 91115763}, {"rating": 3.0, "stay_parameters": "Stayed December 2010", "text": "The whole week, the staff catered to us like royalty...yet were warm and friendly like family! We were upgraded to a 14th floor room overlooking the cruise ship/steamboat/barge traffic around a hairpin turn on the Mississippi River...and on full moon-lit nights...stunning view! Fabulous room amenities. Most luxurious bedding! Restaurant and Cocktail Lounge delicious every time...never disappointed! GREAT, GREAT, GREAT Location...safe, upscale, valet parking only. Doormen/valets really, really friendly ... great guys...they greeted us by name every time we arrived/departed hotel! And the concierge staff, starting with \"Neil\" was better than hotels that cost 4 times the price! They actually WANT to help visitors to their city and NEVER acted as if they were too busy. All staff work very well with each other. Positive attitudes! The day manager and front desk day staff were the best we've ever encountered! Sharp, friendly, attentive, classy! Watch this hotel for equally great price deals. A fabulous place for a pre-Christmas holiday!! Can't wait to return. One of the top hotel experiences I've had in the last 15 years!", "title": "Fabulous concierge and staff but terrible housekeeping!", "user": "Meena_tai", "date": "December 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 2.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 90751930}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "My daughter and I stayed at the Loews Hotel last week. We were there for three nights", "title": "Best American hotel so far", "user": "MIKEYDREAD", "date": "December 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 89933622}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled on business", "text": "Here's the good bits - The hotel had our room ready even though we arrived early in the morning (we had requested an early check in) and it was good to be able to check into our room at 10.30 am! The check in staff was good. Polite efficient & friendly. As were the staff in the restaurant & bar. Special mention must be made of Neil and Debbie, who manned the concierge desk on two separate days. They were simply magnificent. Helpful, eager to guide and advise, willing to go out of their way to help.", "title": "overall, didn't deliver", "helpfulness": 1, "user": "east12", "date": "December 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 88962225}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "I stayed for two nights while attending a conference. I come to NOLA about once a year for conferences. Always love the food and the vibe in the Quarter but am usually disappointed by the shabbiness of the hotels in the Quarter and near the Casino that most conferences seem to use. I've stayed at the Hyatt, Hilton and Marriott. They are fine but all a bit threadbare. This time I picked the Loews (it was one of the options for the conference) and was very pleasantly surprised. The room was lovely - well-decorated, large and in pristine condition. The atmosphere was relaxed but luxurious. Great bar with good food. Good gym. Even has a nice lap pool and hot tub. Very attentive service. I'd stay here even if I was paying.", "title": "Just Right", "helpfulness": 2, "user": "Kwazimotosan", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 149122308}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "This hotel is soooo gorgeous. The Luxury King Suite (room 2110) that we stayed in was lovely. My only complaint with the room was that the description when I reserved it described the bathroom as luxurious, which for the most part it was, except that the bathtub was verrrrrrrrrrrrrrrry small. The staff was also a little snooty - bunch of kids probably making minimum wage but think they are rich people because that's who generally stays at their hotel. We definitely didn't look like the rest of the hotel guests, as we had to save up some time to get this room. .", "title": "It was lovely enough.", "user": "MarleeMar", "date": "January 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 148625560}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "My husband and I got married that weekend, and the room was just spacious enough for me to get ready and get him ready as well. The mini-bar and water/snacks in the room are ridiculously overpriced, but I guess that would be the same in any hotel like this one. (On an unrelated note, it is sort of funny how people with a ton of money would rather pay 2.25 for a 16 oz. can of soda than walk a block to get one for less than 1/3 of that price, isn't it?)", "title": "Hospitable and Very Comfortable.", "user": "mstraveler54", "date": "December 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 148369802}, {"rating": 5.0, "stay_parameters": "Stayed December 2012", "text": "We were on the top floor. There was a huge, gorgeous window but most of the view was obstructed by the Harrah's hotel building. However, if you looked to either side of it there was an okay view of the river and the city. They also tried to charge us a \"deposit\" that was never listed on anything whatsoever when we booked the room to the tune of another $200. I think they are used to people coming through with that kind of \"extra cash\", but we simply didn't have an \"extra\" $200 on our wedding weekend. My husband worked that out with management, and it must have gone well because he was smiling and happy when he came back up to the room. I, frankly, wasn't up for dealing with such issues at the time.", "title": "Very good CBD Choice", "user": "Brooklyntraveling", "date": "December 29, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 148313442}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled with friends", "text": "The location was fantastic, and you can park for $16/day less if you're willing to give up the valet service and walk the whopping 2 blocks from a nice public parking lot to the hotel, which we were.", "title": "Great Location!", "user": "tnmainsail", "date": "December 26, 2012", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 148097256}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "My husband and I stayed 3 nights at this hotel. It is in a great location within walking distance of the riverfront where you can catch a trolley or you can easily walk to the French Quarter. The rooms are larger than most in the area and very clean. Staff at the hotel were extremely friendly and helpful. We will stay here again on future visits to New Orleans.", "title": "Will return", "helpfulness": 1, "user": "churchmouse", "date": "January 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150208430}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "We stayed here leading up to, and for New Year's 2012. Prices were of course up, but found them to be reasonable for the time of year. Easy walk to the Superdome for a Saints game, tons of great restaurants nearby, right by the Riverwalk and Harrah's Casino. The rooms are so comfortable, clean, and spacious, most have great views. Had wonderful service with everyone we encountered at the hotel. Nice that it is a few blocks, but still an easy walk to all the excitement of Bourbon St and Jackson Sq. Quiet area. Will probably stay again next time we're in town. Decent fitness facility. Spa and pool available, but we didn't use.", "title": "Fantastic Place in NOLA", "user": "ChristinaM41_12", "date": "January 13, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149616739}, {"rating": 5.0, "stay_parameters": "Stayed January 2013", "text": "We travel a lot with our pets (2 large breed dogs...a German Shepherd & a St. Bernard). A lot of times we have to comprise luxury for a lower quality hotel that will accept our dogs. But at this hotel we had the best of both worlds! Luxurious hotel & our dogs were more than welcome! There was only a $25 fee for our entire stay with both dogs! We've always had to pay a higher pet fee than this...even at hotels that weren't nearly as nice. Loews even has a room service menu for pets.", "title": "Excellent! And pet friendly too!", "helpfulness": 1, "user": "z28blondie", "date": "January 12, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 149518830}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled on business", "text": "Our room was very nice & clean, bed was large & comfy. Great location...in the french quarter but an area that was a little more quiet & laid back...but still very close to everything. (Walking distance). The hotel staff were courteous, valet was equally courteous & helpful. There were no vending machines in the hotel (that we saw), but our room came with a fully stocked mini bar.", "title": "Stellar service near the French Quarter", "helpfulness": 2, "user": "Corie R", "date": "January 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 149361703}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "We have absolutely no complaints about this hotel! We will definitly stay here again!", "title": "Great service, good location", "user": "christinamn", "date": "January 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 149130379}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "My husband and I had a very pleasant stay at the Loews hotel in April 2008. We actually ended up at the Loews due to some unusual circumstances - we were relocated from the Windsor Court due to \"special guests\" at the Windsor (the President was in town!). Anyway, we were comped a free night at the Loews for the inconvenience, so maybe my review is a little biased(!), but honestly, I think I would have felt the same even if we had paid.", "title": "Very pleasant stay - 3.5 stars!", "helpfulness": 2, "user": "KOinCT", "date": "June 4, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 16671610, "likes": {"liked": "— comfortable beds; airy & spacious rooms", "disliked": "— N/A"}}, {"rating": 1.0, "stay_parameters": "Stayed May 2008, traveled with friends", "text": "Check-in was easy and the front desk staff was incredibly warm and welcoming (refreshing, citrus-infused water was offered to us while we waited). The lobby is small but hip with a nice sitting area (w/tables and chairs) and I believe there is free wi-fi in the lobby.", "title": "Disappointed", "helpfulness": 1, "user": "Aggie_Traveller", "date": "May 26, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 1.0, "location": 3.0, "rooms": 2.0}, "id": 16421490, "likes": {"liked": "— comfortable bed", "disliked": "— service"}}, {"rating": 3.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Our room was incredibly clean, comfortable and open with abundant sunlight that flooded into the room through the windows. The layout was very conducive to just moving around without feeling cramped or restricted in any way. The bathroom was also well-lit, nicely stocked with plush towels and very spacious.", "title": "Average service", "user": "hal9341", "date": "May 19, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 2.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 16200024, "likes": {"liked": "— Spacious, well appointed room", "disliked": "— Service and pool"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "We did not try any of the hotel restaurants/bars, but Loews is conveniently located across the street from one of the most well-known establishments in New Orleans - Mother's Restaurant - get there early for their fabulous breakfast. Another plus (for us) was being a bit outside of the French Quarter. Nothing is worse than the loud, obnoxious crowds at night, so the Loews was a nice retreat from that. Harrah's Hotel & Casino is also close-by as is Windsor Court Hotel (their afternoon tea is wonderful).", "title": "Wonderful Place!", "helpfulness": 1, "user": "msudog98", "date": "May 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 16057474}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "We only stayed one night at Loews, so perhaps we didn't see (negative) things that we might have seen had we stayed longer. But for what it's worth, we had no problems whatsoever and wouldn't hesitate to stay at the Loews again in the future. We also had friendly staff upon our exit to help us hail a cab back to the airport. So overall, a wonderful experience and if I had the option, I would actually give this hotel a 3.5 rating instead of just three.", "title": "I'll stay at the Loews NOLA again and again!", "helpfulness": 4, "user": "blondemommy05", "date": "May 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 15827000, "likes": {"liked": "— Friendly staff, kid-friendliness, room size, cleanliness, comfy bed, location", "disliked": "— service"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Hard Beds, Tremendous Location, They tried to charge twice as much when I called to extend my reservation and then they suddenly found a better rate, then an even better rate. They have a tremendous location, deecnt bar and decent food. The menu for dinner is very limited and high priced. But then again, location, location, location...", "title": "Great Location, Overpriced", "user": "Maggie R", "date": "December 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 147728948}, {"rating": 3.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "I've thought about this for several days....Based on my experience ths hotel caters to business travellers more than tourists. It wasn't a bad choice, but there was nothing to make me say \"I'm happy I chose this hotel\".", "title": "Mixed Feelings, No WOW Factor", "user": "travelfun001", "date": "December 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 147717893}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Location - really good, right across from the casino, we walked everywhere. We're not gamblers so we did not go into the casino.", "title": "Very good stay. One of the better.", "user": "lashing", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147694428}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled on business", "text": "Check in - efficient. The lobby is really nice. Concierge - mixed, started a 11:00 one day when we had questions; provided limited info and almost curt responses. When we asked about taking a bus one day he looked at us like we were crazy. Front desk could not (or would not) answer even a simple question.", "title": "Great hotel! convenient location", "user": "Arachma", "date": "December 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 147650105}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Room - spacious king room, view of the river, furniture just OK, no rack for our suitcase which had to rest on the floor or the desk. Clean. Towels OK. Good shower. Quiet.", "title": "Anniversary Excellence", "user": "Fazzio", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147581433}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "Excellent stay. Room quite comfortable, and hotel in a great location for walking.", "title": "Jazzfest", "helpfulness": 1, "user": "Washington_DCPzero", "date": "May 4, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 15628103, "likes": {"liked": "— Location", "disliked": "— non working phone"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "I recently won a trip through my company to attend the Jazz Fest in New Orleans and my company paid for the accommodations at Loews Hotel. The staff was friendly and went our of their way to take care of my needs; the hotel was not only spotless, but architecturally fascinating, and the rooms were well appointed. I brought a guest and we stayed in a double queen suite. I loved my view and especially liked the appointments in the bathroom (the lighting was a bit dim ladies, but they provide a two sided mirror for makeup application). If you plan to watch tv, it is a bit small- I didn't spend much time in my room, so that wasn't important to me. I loved that they provided an umbrella since it rained frequently and being from Las Vegas I didn't prepare for the weather. I have travelled through the south before and one of the things I liked most was the hotel had an excellent dehumdifying system- it was clammy outside, but comfortable in the rooms and you couldn't feel the moisture walking through the halls like some other places I have stayed! The hotel itself is located ideally between the warehouse district and the French quarters, so that you can enjoy a quick walk down to Bourbon street. I would highly recommend checking out Preservation Hall, for a great jazz experience (on St. Peters off of Bourbon st). The Hotel has an entire floor dedicated to relaxation and fitness. I didn't use the amenities, but my fellow traveler loved the pool (very large, but not olympic), and the rejuvenation spa; which offers a hang over remedy! I don't know if I could afford a week at Loews on my own budget, but if you are looking for a great place you should stay at Loews!", "title": "A New Orleans treat!", "helpfulness": 1, "user": "Pepsqueeker", "date": "May 2, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 15587975, "likes": {"liked": "— The excellent staff and beautiful architecture!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "Stayed here for our 10th anniversary and Jazzfest - the service was awesome, the shuttle was very accomadating ; the lounge and drinks wer lovely, the valet was very attentive....we were VERY happy here......they could only do one thing better that I could see....leave the pool and hot tub open LATE at night for folks coming back in the wee hours after fun out on the town.....", "title": "Lived in New Orleans; LOVED LOEWS", "helpfulness": 2, "user": "MomDoc", "date": "April 28, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 15440766}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "I tagged along with my husband on a business trip this April and stayed for just 1 night at Loews. It is in a fabulous location across the street from harrahs. It is a few short blocks from Bourbon Street. The room was pristine, the check in was accomodating, the indoor lap pool was beautiful and they have a full service spa. The doormen are friendly and open the door with a smile well before you get there. The view was beautiful and the robes were comforable. I still dream about the shower there! I'm glad the company paid for it, however. This is not somewhere I would have deemed a good value. When we were in New Orleans, we were no where near our hotel!", "title": "Fabulously Overpriced Hotel!", "helpfulness": 1, "user": "corrineski", "date": "April 22, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 15231637, "likes": {"liked": "— Cleanliness, Friendly Staff", "disliked": "— Leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2008, traveled with friends", "text": "So, here are the positives and negatives.", "title": "Mixed Bag", "helpfulness": 2, "user": "Giveypup", "date": "April 14, 2008", "detail_rating": {"front_desk": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 15024552, "likes": {"liked": "— the beds, cleanliness of room", "disliked": "— The dog piss smell in room--the hotel accepts hounds, so beware"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My SO and I stayed here two nights for free (comped by Harrah's); however, I won't let that affect my review. I would most definitely stay here again whether it was free or not. (We recently stayed at the nearby Hilton and it wasn't nearly as nice as this.)", "title": "Fantastic Hotel!", "helpfulness": 1, "user": "aktx", "date": "August 11, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 18853639, "likes": {"liked": "— Oversized room", "disliked": "— housekeeping blunder"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "We were here on a weekend so we parked on the street for free, so I have no comment on the hotel's parking situation.", "title": "A very nice hotel", "helpfulness": 2, "user": "luv2travelMiami", "date": "August 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 3.0}, "id": 18617970, "likes": {"liked": "— It is a very nice hotel.", "disliked": "— Distance from Quarter and housekeeping attention."}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled on business", "text": "The front desk staff was great and upgraded us to a nicer room on the executive floor. We had a fantastic view of the city and Mississippi River. This room was like the perfect hotel room: oversized, clean, modern and well-appointed.", "title": "Enjoyed my stay", "helpfulness": 1, "user": "alk222", "date": "August 2, 2008", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 18555319, "likes": {"liked": "— Location", "disliked": "— Front Desk Staff"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I loved the large entry area. It provides extra space for things and had a nice long table along the wall with a shelf underneath. The king size bed was extremely comfortable and had very comfy pillows too. There was a sitting area with couch and coffee table as well as a very large desk and chair. The TV, which sat on top of a hutch with drawers, swiveled so you could view it if you were in bed or sitting on the couch. However, unless you propped something behind the TV, it would swivel back around. (The hotel menu book came in handy for something. LOL!)", "title": "Wonderful Weekend!", "helpfulness": 1, "user": "jasmineflowers", "date": "June 24, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 17198200, "likes": {"liked": "— Classic and nice, away from the drunkeness of downtown! ; )"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008", "text": "The bathroom was average-size but stylish and had some nice toiletries (shampoo, conditioner, lotion, body wash, sewing kit and q-tips, but no shower cap) and a high-wattage blow dryer. The towels were plentiful and plush and included two oversized bath sheets. Nice! Outside the bathroom was additional counter space on which was an Ipod port & speakers, and underneath that on pull-out shelves was a coffee maker & fixin's (Emeril's coffee, decaf, green tea and black tea), ice bucket and glasses. Across from that was an ample-sized closet with an iron and ironing board and a pair of robes.", "title": "Good Downtown Choice", "helpfulness": 1, "user": "shalmunzies", "date": "June 7, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 16748250}, {"rating": 1.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "I have stayed in this property in the past and had a great experience. My most recent Saturday/Sunday stay was horrible beyond comparison. From a dirty vomit filled room to lack of service in the restaurant to poor room service(both quality of the food and lack of timeliness). The management attempted to redress these ills not be comping the room but offerring a \"make-up\" stay for the family. I was actually thinking maybe this was more typical of Loew's great service when the certificate came for any time BUT the weekend! Not very helpful for a family with children.", "title": "We don't want to do it quite right", "helpfulness": 1, "user": "2cajun", "date": "March 23, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 5.0, "rooms": 1.0, "location": 3.0}, "id": 101239859}, {"rating": 5.0, "stay_parameters": "Stayed February 2011", "text": "Love the view, the rooms, everything!!! Also, excellent service!", "title": "Excellent!!!!", "user": "Frida03", "date": "February 25, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 97953081}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The location is equidistant between the Convention Center and Cafe Du Monde. I like that it is outside the Bourbon street chaos, but easy to walk to if you want to join that party. Loads of great restaurants nearby. I stayed in a Grand King. It was a huge room and very quiet. We slept well. Shower had great water pressure. Sadly I didn't make it to the workout facility during my stay. Lobby bar is a great classy place to meet a friend for a cocktail.", "title": "Great location, lovely hotel", "user": "2travelingscientists", "date": "February 7, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 95818587}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "I chose the Loewe's after much research. I was in New Orleans for some specialized surgery and needed a great room, comfortable sleeping and quiet environment to help me recuperate. Loewe's has a king suite, which was PERFECT for my needs - a small sitting room with sofa, chairs, TV; separate king bed, and a gorgeous walk-in bathroom with walk-in shower, jacuzzi tub and very large double sink area. My husband and I were given a 15th floor room with a beautiful view of the Mississippi river. The rooms were clean, the bed was tremendously comfortable, the workout facilities/spa/pool very new and generous for a hotel . The Loewe's is right by the Riverwalk, Harrah's Casino, and within steps of the French Quarter. A perfect location, if you want respite at the end of the day. Hotel amenities are great as is all the staff. I'm a \"picky\" hotel guest and I'd stay again in a minute!!", "title": "Best Hotel in New Orleans", "user": "Montagneny", "date": "February 4, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 95469220}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "We traveled with four kids, also got a good rate through American Airlines website. Location is great, not right in the quarter, but very easy walk to it and to the riverwalk shopping (which is kind of run down) in the other direction. Big rooms, indoor pool which is a rarity in the area but nice to have in January. Harrahs is right across the street for an evening escape from the kids. We did not eat at the onsite restaurant Adelaide's just because the menu was a little eclectic for the kids. There is a quiet, very reasonable priced little cafe just west of the hotel... M's cafe which became our daily breakfast stop. The staff was great, we had no problems with housekeeping, the beds were fine. This is a very solid four star property and we will return here on our next visit to the Crescent City.", "title": "Easy Big Easy family trip", "user": "Gulfcoasters", "date": "January 19, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93805995}, {"rating": 5.0, "title": "Best Hotel in New Orleans", "text": "Without a doubt The Loews is the nicest hotel in New Orleans.We are locals and stayed at just about every hotel in and around the French Quarter and Loews is our number 1 choice..The workers always have a smile and aim to please you.The rooms are very modern and very clean.There are only 2 or 3 hotels that have a spa.My wife likes the Loews Spa.They have an indoor pool and hot tub.There is no way this hotel should not be in the top five hotels in New orleans......", "user": "harleybonz", "date": "April 25, 2011", "id": 105414311}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Good hotel in Busines/warehouse area. breakfast were Ok at reasonable prices. Parking costs are a bit high at $32 per day", "title": "good hotel in a good location thats not in french quarter", "user": "missie0", "date": "April 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105346242}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "I recently stayed at the Loews April 13-16th with my family. Now this hotel is located in the Warehouse District which is on the edge of the French Quarter...a good 15 minute walk from the heart of the action. But this place is awesome! The service from the door man to the valet to the concierge. There's no where else I would stay. The room are large and the view from the 21st floor is amazing. It was a great place to accomodate our children, 3 and 6 years old. Even though its a walk to the French Quarter it is worth it. The river walk is a block away and the Harrah's casino is right across the street.", "title": "Awesome hotel with amazing service!", "user": "cjzubok", "date": "April 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 104520560}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Bottom line...this is where we will stay when we are in New Orleans!", "title": "Beautiful property -- just ask for a no-smoking room!", "user": "secondwife", "date": "April 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 103829652}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "The rooms and bathrooms are very spacious, and this venue is well located. The place is beautiful, and the cumulative personal service -- from the restaurant to the bellmen, doormen, hotel taxi drivers, etc. -- is really better than any other hotel I know of. The only thing I'd recommend (I wish I'd known this) is that if you don't like smoke, like me, you MUST ask for a room far, far, away from the smoking floor/s. One floor above doesn't cut it. You'll still smell smoke intermittently if you're like me. The hotel restaurant is okay, not great (okay, the white chocolate bread pudding was superlative) but the entrees, soup, salad were disappointing, especially given the town's raised culinary bar. The $12.95/night internet was fine for normal e-mail, etc., but took a very long time to load Netflix and anything else that has to be buffered -- very frustrating. The spa is very nice and well priced for beauty services. I would love to stay here again.", "title": "Good stay", "user": "Roadtravlr", "date": "April 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 103700898}], "location": {"country": "United States", "city": "New Orleans"}, "stars": 4, "variance": {"poor": 29, "average": 56, "very good": 181, "terrible": 21, "excellent": 284}, "aka": "Loews New Orleans", "slim_ranking": 0.28, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "With the best of the Crescent City outside our doors, Loews New Orleans Hotel personifies the captivating spirit of the Big Easy with vibrant, elegant décor and extraordinary service. A gateway to the city’s Arts District, the hotel is directly across from Harrah’s Casino, three blocks to the historic French Quarter and a short stroll from the Riverfront. Famous restaurants, jazz clubs and premiere shopping are steps away. With the city’s largest guest rooms, boasting magnificent views of the Mississippi River or the city skyline, the hotel also features Balance Spa and Fitness Center with lap pool, whirlpool and dry sauna and Café Adelaide and the Swizzle Stick Bar, by the Commander’s Palace Family of Restaurants."}