{"user_rating": 4.0, "review_count": 1159, "name": "Loews Santa Monica Beach Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2005", "text": "We stayed here for 2 nights and didn't have a problem with the hotel. The rooms were nice with good views (although you would need to be up high for that). All services were fine although none were exceptional. The locations is great for the beach but not for the town so much. All in all a good hotel to stay in if you need access to LA, and especially the airport which is only 20 mins away, but want to stay on the beach. Also considerably cheaper than Shutters just down the road.", "title": "Nice Hotel", "helpfulness": 1, "user": "sjwoolnough", "date": "August 20, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3791864}, {"rating": 2.0, "title": "Incredibly bad value and mis-leading website", "text": "Whoever designed the website did a fantastic job because its nothing like the reality of the place.", "helpfulness": 4, "user": "Freddy22", "date": "August 12, 2005", "id": 3757108}, {"rating": 1.0, "stay_parameters": "Stayed July 2005", "text": "Firstly, this hotel is not on the beach. You have to cross over a main road and then another side road to get onto the beach.", "title": "Service, What service! at The Leows Santa Monica Beach", "helpfulness": 5, "user": "regmeister", "date": "August 4, 2005", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "rooms": 3.0, "service": 1.0}, "id": 3736838}, {"rating": 1.0, "stay_parameters": "Stayed August 2005", "text": "The swimming pool is unappealing as its small, narrow and claustrophobic as its very closely surrounded by three high rise sides of the hotel.", "title": "Going Down Hill", "helpfulness": 7, "user": "Nangirl", "date": "August 3, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3734883}, {"rating": 4.0, "title": "Nice hotel, nice location", "text": "The sea-view rooms currently have a view of a building site. You cannot sit on the balconies as they are only 18 inches wide.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "August 1, 2005", "id": 3726585}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "I was not too happy with The Loews when we booked in after an 11 hr flight to find they did not have our room ready for our 7 night stay despite the fact we had booked and paid months in advance and had called them a few days before we arrived to check everything was OK (I had booked the holiday online and was a bit worried)", "title": "Good and Bad", "helpfulness": 4, "user": "sarah l", "date": "June 10, 2005", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 3542805}, {"rating": 2.0, "title": "Comfy beds, but overall really disappointing", "text": "There were three other people being dealt with at the desk before us who obviously had some problems also - which did not bode well - and I had to smile when I heard one man being offered cookies and milk to be sent to his room - obviously their standard way of dealing with a problem!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "May 31, 2005", "id": 3514171}, {"rating": 5.0, "title": "The best service ever!!", "text": "Anyway - they booked us in to a smoking room that stank of smoke that had been covered up with a horrible air-freshener- we could not unpack and the next day could not go far afield because we did not know when they would want us to move. Even though we had not unpacked properly it seemed to be impossible for them to move our cases to our proper room without us being there !", "helpfulness": 5, "user": "A TripAdvisor user", "date": "May 8, 2005", "id": 3449741}, {"rating": 1.0, "stay_parameters": "Stayed May 2005", "text": "The room did have a patio though - so I sunbathed there while my partner went roller blading - however - while I was asleep the maids locked me out on the patio with no phone, water,suncream - so I got burnt and dehydrated before luckily my partner returned to let me in.", "title": "Can I get my $ back?", "helpfulness": 3, "user": "raulmiranda", "date": "May 4, 2005", "detail_rating": {"cleanliness": 1.0, "rooms": 1.0, "value": 1.0}, "id": 3438714}, {"rating": 4.0, "stay_parameters": "Stayed April 2005, traveled on business", "text": "BTW - the bottle of Fiji water in your room is NOT complementary as I presumed - it costs $7 !!! - but only $1.50 in the supermarket.", "title": "Very Good Hotel", "helpfulness": 4, "user": "PhatChick", "date": "April 14, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 4.0}, "id": 3357405}, {"rating": 1.0, "title": "Not only do they accept dogs - they treat you like one too!", "text": "The service at this place was so bad that if you saw an employee smile, it meant that it was time to tip them. You are very fortunate to have come upon this review before booking this hotel for your vacation. Don't do it.", "helpfulness": 16, "user": "A TripAdvisor user", "date": "July 25, 2005", "id": 3699677}, {"rating": 1.0, "stay_parameters": "Stayed June 2005", "text": "This hotel looks nothing like the pictures. Its resemblance with its pictures is about the same as mine with Brad Pitt. They also ignore to tell you that there is a massive construction project going on between the hotel and the beach. So much for ocean view.", "title": "Loewer Your Expectations", "helpfulness": 10, "user": "HamishMC62", "date": "July 23, 2005", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 2.0, "service": 1.0}, "id": 3695509}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "This hotel was a disaster from the moment I pulled in. At the front desk they tried to overcharge me for the room. Fortunately, I had an email copy of my reservation confirmation. Then they put me in a smoking room when I had requested a non-smoking one. It took them 20 minutes to give me another room. I requested a bell boy to move my luggage to the new room. After 15 minutes of waiting, I did it myself.", "title": "An animal may have slept in your bed !", "helpfulness": 5, "user": "Bysshe98", "date": "July 18, 2005", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3679234}, {"rating": 5.0, "title": "excellent hotel", "text": "Service was bad throughout the stay. Calls to the front desk or concierge commonly resulted in hold times of up to 5 minutes. I once called and requested 2 wine glasses - about 45 minutes later, I got 4 regular glasses. Request for a late check-out was denied.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 9, 2005", "id": 3652547}, {"rating": 3.0, "stay_parameters": "Stayed June 2005", "text": "The food, rooms and amenities were mediocre - yet exorbitantly priced. The towels were the kind you find at Target for 4 bucks. The carpets desperately needed to be shampooed. There was no coffee maker in the room - and a pot of coffee delivered to my room cost $14.", "title": "Wonderful Location, Old Hotel", "helpfulness": 6, "user": "jaknix", "date": "June 12, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 3.0}, "id": 3546090}], "location": {"country": "United States", "city": "Santa Monica"}, "stars": 4, "variance": {"poor": 100, "average": 185, "very good": 368, "terrible": 63, "excellent": 443}, "aka": "Loews Santa Monica", "slim_ranking": 0.411764705882, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Situated on the Pacific Ocean with the thriving Santa Monica city on one side and the sands of legendary Muscle Beach on the other, the Four-Diamond Loews Santa Monica Beach Hotel is a beachfront retreat offering dramatic views of the Pacific Ocean and beyond. Loews Santa Monica Beach Hotel has become the first luxury hotel in Santa Monica to receive the Santa Monica Green Business Certification. Offered through a partnership between The City of Santa Monica, Santa Monica Convention and Visitors Bureau, Santa Monica Chamber of Commerce and Sustainable Works, the certification program honors businesses that have taken measurable steps to incorporate sustainable practices into their operations.Open for breakfast, lunch and dinner, Ocean & Vine offers the option to dine fireside or outdoors on a spacious patio while enjoying breathtaking views of the Pacific Ocean and world-famous Santa Monica Pier. Chef Keith Roberts’ California contemporary cuisine showcases creative interpretations of the familiar favorites. Located in Ocean & Vine, the chic new Sushi at Sunset sushi bar features a variety of inventive rolls as well as traditional sushi, nigiri and sake pairings. Recently named one of the “Best Hotel Spas” by the readers of Conde Nast Traveler for the second year in a row, Ocean Spa & Fitness offers an array of supremely-relaxing services. From Heated Lava Shell Massages to Age defying Facials, the eco-friendly Ocean Spa will keep you feeling relaxed…naturally. An expansive fitness center features state-of-the-art cardio equipment with iPod docking stations and personal televisions. Guests may also take advantage of the full service salon. World-class biking, surfing, dining and shopping are right outside the hotel’s door. Offering convenient access to everything Santa Monica has to offer, the hotel is just blocks away from the Santa Monica Pier, Third Street Promenade and the new Santa Monica Place mall. Muscle Beach's 26-mile paved strand offers the ideal setting to bike or blade. Santa Monica also boasts rich cultural history with an abundance of museums and theaters. Working with one of the hotel’s Les Clefs d’Or certified Concierges puts all this and more at each guest’s fingertips."}