{"user_rating": 4.0, "review_count": 1198, "name": "Loews Coronado Bay Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with friends", "text": "I stayed with a friend and her six year old in mid-July. I was pleasantly surprised (after reading some of the reviews) by the updated room, customer service, and great pool area. It was clear that the hotel is undergoing a renovation - one of the wings closed all together - and the hallways are a bit outdated. However, the room was bright, sunny, and a cross between modern and luxury. The bed was extremely comfortable.", "title": "Great for kids", "user": "freqtrav88", "date": "August 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 38072078}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We spent our days at the pool which was perfect for time with a six year old. While he jumped in the pool with other kids, we lounged in the comfortable chairs. There are three pools - one adult, one kid, and one family. Although it did get busy, the area never felt overcrowded.", "title": "Not what it should have been...", "helpfulness": 1, "user": "maverickmt", "date": "August 17, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 37963710}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "The service was better than the service of some of the Four Seasons and Ritz properties I've stayed in. The pool staff was always attentive - they came around with frozen grapes, towels, and the like. I went to the gym twice and everyone was great. I took a spinning class with a great group of ladies from the neighborhood and the instructor was fantastic.", "title": "One of the best Hotels in San Diego", "user": "CybeRise", "date": "August 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 37882469}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "I had a terrific experience at the Loews and would go back again. I wouldn't recommend it for a romantic vacation or for younger guests looking for nightlife but it is really ideal for families.", "title": "Ruined the end of our Honeymoon", "user": "Doddyoz", "date": "August 16, 2009", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 37848848}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "We stayed at this hotel during a friend’s wedding at the nearby naval base - I wasn’t expecting service that would have matched the nearby Hotel Del, but I was expecting better then I received. We checked in late on Thursday and had a car with us, I expected this wouldn’t be a problem but was told that parking was not included in our room rate and ran an additional 28 a day - strike one. Next we were brought to our room, which smelled of smoke and had a shower cap taped over the smoke detector - strike two. We called the front desk and were brought to a new room - this one was dirty, used towel on the ground and opened hand soap - strike 3. Maybe I am being too harsh, I realize that people are going to smoke in rooms and that it isn’t the hotels fault. On the other hand, how do they not notice a taped shower cap on the smoke detector? I also felt like the room we were transferred to was not as nice as our original room, we had opted for the nicest of the standard rooms and although smelly our original room certainly had the view we were promised at booking - our next room did not.", "title": "Everything I Expected", "user": "SaraLasVegas", "date": "August 15, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 37770080}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "My wife and I Just returned from a five night stay. We found a great rate through Travelzoo.", "title": "Overall, a nice stay at the Loews", "helpfulness": 1, "user": "Dave148", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 15999527, "likes": {"liked": "— The location", "disliked": "— $19 for self parking."}}, {"rating": 5.0, "title": "Enjoyed It...much better than the reviews giving.", "text": "Check-in was a breeze. The bellperson was very helpful.", "helpfulness": 2, "user": "NHFitnessGirl", "date": "May 8, 2008", "id": 15803211}, {"rating": 4.0, "title": "Decent & Lovely", "text": "Our room was fine. Good quality bedding and linens. The mattress was a bit soft for my taste. Nice flat screen TV. Turn down service every evening.", "user": "mountaindewbebe", "date": "May 2, 2008", "id": 15596769}, {"rating": 3.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "The pool area is very nice. Not crowded and well kept.", "title": "Fair", "helpfulness": 1, "user": "pgirl42", "date": "April 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 15442298, "likes": {"liked": "— fresh rooms", "disliked": "— dogs, children, noisy and a $45 cab ride to Gas Lamp District"}}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled on business", "text": "Since it's a resort, expect to be charged accordingly. Self-parking is $19/day. The food is priced as expected. We did not eat at the resort. Plenty of dining choices in downtown Coronado.", "title": "Close, but no cigar", "helpfulness": 1, "user": "jcpsychobilly", "date": "April 28, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 15430958}, {"rating": 2.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Loews Resort at Coronado Bay was not a convenient place to stay. It was far from downtown Coronado and did not offer convenient transportation. You had to make reservations in advance for the shuttle, which only went into the town and back 4 times a day and only stopped at one place. The last ride back to the resort was at 6:15 p.m. so you could not enjoy San Diego very long if you wanted to catch the shuttle back to the resort. The shuttle stop was 12 blocks away from the waterfront so you had to walk a long way to catch the ferry. When we decided to take the city bus back to the resort so we could stay in San Diego later, we were dropped off about 1 mile away from the resort. We had to walk that long distance and all of us had blisters on our feet by the time we arrived. Fortunately, we were in pretty good shape. However, this would have been very difficult for senior citizens or families with small children. In addition, it would have been very dangerous for teenage girls or young women to walk that far by themselves after dark.", "title": "Inconvenient", "helpfulness": 1, "user": "cmwhite", "date": "August 13, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 1.0, "service": 2.0, "rooms": 3.0}, "id": 37578379}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Aside from the transportation issues, the resort should have offered more activities. There was plenty for children to do; however, our teenagers were extremely bored. There was no opportunity for them to meet other teens in the resort. Loews should have also had more opportunities for the adults to socialize, such as laus, 50s night, etc. Since the resort is so far from everything, a night club with dancing would have prevented our desire to go elsewhere.", "title": "Very nice hotel and resort, but lots of small fees", "helpfulness": 2, "user": "JulieNMM", "date": "August 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 37501720}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled solo", "text": "I stayed here last week for 4 days with my mom, sister, neice, nephew, son, and daughter. The 4 kids LOVED the teen lounge and we could hardly pry them away from there! The Xbox and Guitar Hero were hits and the games were free. We asked for 2 adjoining double bed rooms and were told they don't have these. ? So we were 4 doors down from each other, which was not as good as connecting, but fine. The rooms are huge and the bathroom is gigantic! Our rooms both had the same layout: huge jacuzzi tub, separate stand up shower, plush towels, and plenty of bathroom counter space. Our balconies faced the marina and we had a great view. There was plenty of room in the room. Downside is that we had to pay $10 per day for a mini fridge and it was old and dingy. The linens on the bed were dingy, too, and just didn't seem very new or clean. There was some small debris/trash under the beds and dresser. (Not that I check there when I get to a new room, but my nephew lost a lego!) The resort is far from town and so we spend a lot of time at the resort. The food in the Market Cafe was way overpriced, but tasty. They had a kids buffet every night that the kids loved. Adult entrees were about $15-20. We had the breakfast buffet every morning and it was $9 for kids and $15 for adults. Food was standard. We did play Bingo which was a hotel-sponsored activity and that was fun. Valet parking was $28 a night and we had 2 cars = $250 just to park! Self parking was $22 a day. We all loved the pools, although the family jacuzzi was closed for one day and another day the family pool was shut down. Rumor was a small child had pooped in the pool, so it had ot be disinfected. Not Loew's fault, but still affected our trip. The food by the pool was a good price for the kids meals ($5 each). Our family also went on a gondola ride one evening and that was fun, for $30 per person. Keep in mind that this hotel is 10 mins out of town so you will need to drive to go anywhere. The Internet was $15 in the room but free in the lobby. Go to the lobby! Overall, we had a nice time and the kids loved it. I felt there were a lot of extra and overpriced charges, though. Definitely a fun place to take the family.", "title": "Beautiful Hotel / A bit of a drive though beautiful scenery", "helpfulness": 1, "user": "GandYMac", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 36918668}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "This resort is beautiful! There are 2 pools, plus 3 jacuzzis and a baby pool. We were visiting in February, so the pool bar was closed. We were fortunate to have 80 degree weather, so the pool was great and we had it to ourselves. It is also heated. There is a ping-pong table set up by the pool for guests. There is a spa onsite, however I didn't utilize it.", "title": "Get a Car !", "helpfulness": 1, "user": "Fatcat153", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 2.0, "service": 4.0, "rooms": 4.0}, "id": 36870178}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "Keep in mind, this resort is through Coronado, past the Navy Seals and other Navy base, and past the bay. It may be too far to walk in to Coronado for dinner (just over 4 miles). There is a walking/biking path, but it's a good distance from Coronado. Check out google map and take a look. The hotel is located down toward Silver Strand Beach.", "title": "does not seem 4 star to me...", "helpfulness": 2, "user": "momofkkidsSanDiego", "date": "August 6, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 5.0, "service": 2.0, "rooms": 2.0}, "id": 36856249}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We spent 4 nights at Loews Coronado as part of our annual summer vacation and loved it. Alot of people complain about the extra charges for parking and internet, however similar hotels in Coronado and San Diego charge similar fees. I was able to get a smoking deal on Priceline for the hotel. This hotel really caters to kids. Our 2 four year olds loved the special attention. Toys at check in, kids only pool, kid sized games poolside, kids eat free at breakfast. The hotel is right across the street from the beach and the hotel provides a shuttle along with towels, chairs and umbrella. The hotel is only about 5 minutes from downtown Coronado.", "title": "Another great stay at Loews Coronado", "user": "perryfamilyAZ", "date": "August 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 76550071}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "This was the our second stay at the Loews Coronado. Love it! Great breakfast (which was free with our room package), we had a beautiful view of the bay, bridge, and surf, staff was so nice, and the spa is great. Our kids loved the complimentary toys they received when we checked in. Felipe with housekeeping was so helpful getting us a fridge and crib. The pool is great! Everybody from valet to waitstaff to front desk made our week-long stay one of the best trips we ever had. Thank you Loews!", "title": "Love loews!", "user": "Txmom32", "date": "August 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76345508}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Family of four arrived in Coronado and checked in (briefly) to a hotel in town, but found that hotel unacceptable. Called Loews Coronado Bay Resort, checked availability, and made our way there immediately. Glad we did! Full bay view, lovely room/decor, AAA rate, marina location, made for a perfect stay. Hotel provides shuttle service to their beach, as well as the beach near Hotel Del Coronado. The location of Loews is a bit removed from the center of town, but we saw this as a plus. Rented kayaks and waverunners during our stay. Definitely a full service resort. Would stay again and would recommend to those traveling to the San Diego area.", "title": "Great Choice", "user": "beachmusic", "date": "August 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76209345}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "My husband decided at the last minute to attend a conference at the San Diego Convention Center. I frantically searched for a nice pet-friendly hotel where we can bring our little Pomeranian named \"Thor\". Trying to find a room as you may know, during a weekend is not easy. Especially if you are looking for a pet-friendly hotel. Because of the conference, all the pet-friendly hotels near the convention center were booked. I decided to visit the Tripadvisor site and found that the Loews Coronado Bay Resort takes pets and there was availability for the dates we needed. You cannot imagine my relief and surprise. The rate I found was pretty reasonable considering I did not book early to get a better rate.", "title": "Pleasantly Surprised", "user": "Yosemite_Travelers", "date": "August 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76200206}, {"rating": 5.0, "title": "Great Place to Stay", "text": "I booked our reservations online and informed Loews we will be bringing our dog. Their pet fee is only $25 per stay. That's a bargain compared to what other pet-friendly hotels charge. We arrived late Friday evening. I didn't know what to expect and was pleasantly surprised. We didn't mind that you are a bit further away from either downtown Coronado or downtown San Diego. The location was fine for us. The lobby was beautifully decorated with many sitting areas for guests. Our room was clean, comfortable and spacious. And It's true--\"Loews Loves Pets\". Not only does Loews have many nice amenities for their guests, pets have nice amenities too. Our room type was a Superior King with a lush garden view. I guess that means being on the 1st floor poolside. The hotel is surrounded by water and has a fantastic view of downtown San Diego. A trip into San Diego from the hotel requires going over the Coronado bridge but it is a pleasant enough drive and takes only 15-20 minutes.", "user": "Like2Travel01", "date": "August 20, 2010", "id": 76101803}, {"rating": 4.0, "title": "Fantastic Once Again - Top Notch Service", "text": "My husband and I visited for the second time for one evening last week. Every person that we encountered was friendly and helpful. Check-in was fast and efficient (we were able to check-in early), the pool service at La Cantina was terrific, the spa manager and masseuse were excellent, and check-out was easy (we were able to get a late check-out). We were well accomodated at every level.", "user": "freqtrav88", "date": "September 9, 2010", "id": 78936714}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We've been to much higher end hotels where pool service is non-existent - the Loews waiters were not only quick and efficient, they even refilled our glasses of water without us asking. I know that does not mean much but compared to most southern California restaurants and hotels - it means the world.", "title": "Going the extra mile = normal behavior at this hotel", "user": "DaveTO", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78855270}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "My masseuse was wonderful and I really appreciated the helpfulness of the spa manager. I wish I could recall her name to thank her - she went out of her way to accomodate us. The spa was quiet, relaxing, and clean.", "title": "Most exquisite room I've every stayed in.", "user": "JRDNSGMA", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78700687}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "Our room was very comfortable with a plush bed and modern bathroom. More than anything, the service made our experience truly wonderful. The only bad point to our trip was having to leave for a stay at the lackluster, enormous Hilton at the convention center. One other quick point - while other parts of San Diego and the entire coast were fogged in from the awful marine layer - it seemed to disappear early at the Loews (maybe that is true of Coronado all together - I don't know). Thank you Loews - we will return!", "title": "Great Stay!", "user": "NTMNinc", "date": "September 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78635997}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My fiancee and I travelled here over the Labor Day long weekend, and had high expectations (based on previous reviews here). Within 10 minutes of arriving, those expectations were far exceeded! I had called earlier to request an upgrade to a suite; the colleague (Andy) who spoke with me happened to be on duty and remembered our conversation from over 4 months earlier! I had also received an email that offered a similar upgrade for a lower price, and he honored the lower rate for our upgrade.", "title": "Heaven for Families!", "user": "BAO1", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78390195}, {"rating": 2.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "This hotel tries to be all things to all people, but falls short if you visit without unruly kids. We arrived on Sunday and went for a walk around the grounds, only to be turned back half-way around because a large section of the hotel was roped off for a wedding party. We then looked for the main outdoor patio to have a drink and watch the sunset. When we finally found it (two staff members that we asked could not help), it was also off-limits to the regular guests because it had been booked for a wedding. A tour group of high school kids stayed while we were there, and the hotel parked their tour bus right outside our balcony. The bus came back from dinner just before midnight, and the balcony door did nothing to stop the noise. The bus also served as our wake-up call in the morning when the group left - the operator was very consciensous, starting the bus an hour before they boarded, testing all of the hydraulics, brakes, engine, etc. We asked to be moved to another room on day two, and were told that the bus would not be back that evening. Guess what pulled back into the parking spots outside our room that evening around midnight? The amenities are nice, but expect to pay extra if you actually want to use them - gym, spa, even the tennis courts have a surcharge. Food at the restaurant was excellent, view of the bay was nice, but the service was downright poor. We stayed two nights, and the hallway outside our room was never cleaned despite desperately needing it. Kids had thrown cereal all over the place, lots of sand, etc. With our Sunday through Tuesday stay, we got an incredible rate booking at the last minute - about 50% of the regular rate. Had we paid what they usually ask for these rooms, we would have felt as though we had been taken. If you have kids and you don't pay more than $200 for the room, we would recommend this hotel to you. Otherwise, there are much better options in SoCal. Definitely not a 5 or even a 4 star resort.", "title": "Fell a bit short of expectations", "user": "coppersmith99", "date": "September 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 77894254}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "My 3 children, ages 6-13, husband, brother and I had a wonderful experience with Loews. Our room was very clean and modern. Bathroom was huge. Shower was a bit small but good water pressure. Bed was very comfortable. Housekeeping staff was very good and there was never a delay in getting our room clean. Check in was very fast. There are three pool areas; one is for adults only which is nice. On our first visit out to the pool, the staff greeted us and asked us how many towels we needed and seat covers and took us to chairs. The pools were very, very clean. They provided cute dolphin floats for the kids. The pool bar employees were very quick and professional. The lobby area is huge and it has a lovely restaurant our small area if you just want sodas, coffee and snacks. The gift shop is very, very nice with more upscale items. Whoever their buyer is, they do a good job. Our most favorite thing was that there is a kayak, jet-ski and boat rental immediately outside the lobby area. We rented a boat and took it out to the bay. That was our most favorite part of the trip. The location is about a five minute drive from the \"most happening\" part of the island; that was the only negative but a small negative at that. Our room, which was a basic room, overlooked the ocean. Many of the rooms have great views. I highly recommend this Loews!", "title": "Wonderful Experience", "helpfulness": 1, "user": "Susie60768", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 77224853}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "After a tour through california we ended our trip in this hotel. It was supposed to be for relaxing and ctching sunshine. And it exactly fulfilled our expecations.", "title": "Ideal place to end a califonia trip", "user": "Juretennis1", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77222055}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Spacious, well equipped rooms, enough space at the pools, very friendly and supportive staff.", "title": "Downscale service, poor housekeeping", "helpfulness": 1, "user": "vizy", "date": "August 28, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 5.0}, "id": 77173632}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Location needs a car to get to San Diego and the attractions, however, we already planned for that.", "title": "Good choice for a San Diego stay", "user": "bklyn_sea_gull", "date": "August 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 77115195}, {"rating": 2.0, "title": "don't waste yur money", "text": "extremly dissapointed with this property. ws supposed to be first class (chose over 4 seasons to save a few bucks). everything that could go wrong did. too much to cover here but... very under staffed. obviously cost cutting everywhere. every key card, parking pass, computer system was down all the time. screwed up our rooms and took 3 tries to get somewhat close to what we needed. I guess the 1st family can't come here because they have guests with dogs(big dogs!!) everywhere! even in the restaurant! howling dogs in rooms all around us and paper thin walls! Doors slammed all night long. 1 complete wing closed and front dest kept sending me there to laundry facilities. didn't they know that 1 out of 4 wings of the hotel want boarded up and under construction? I don't think the AC even worked. it was so humid!! in San Diego? lived there 15 years and never saw a place so damp! The rooms were damp and musty ( we diodn't say at the more reasonable marriott at the other end of the island because reviews stated their rooms were must yand we have an asthmatic child)", "user": "ellenLongIsland", "date": "August 1, 2009", "id": 36403179}, {"rating": 2.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "WAY OVER PRICED FOR THE HOTEL! 2 weeks later I was at the courtyard Marriott in central SD for another event. it ws nicer, dryer, far quieter and less that 1/3 the price. Do not waste your money - I know this property once was nice. It is not worth it now", "title": "Not Loews quality", "user": "ZaiZaiLv", "date": "July 30, 2009", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "location": 2.0, "service": 3.0, "rooms": 2.0}, "id": 36240426}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Let me just start out by saying that we didn't pay their regular price; we got our room from Hotwire for $120, so there's a chance that we were deemed less important.", "title": "Good choice for a family vacation", "user": "SLS006", "date": "July 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 36230083}, {"rating": 1.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "My initial interaction with the hotel before the trip was not good. As suggested by Hotwire, I called the hotel to confirm our two beds request. Called the hotel number and asked if they could confirm our request, only to be told they couldn't take special requests from Hotwire customers and Hotwire didn't request the two beds. Called Hotwire back and relaid the message to them only to be told that such case would have to be handled by the hotel directly. By now, I was seriously frustrated. The husband who is blessed with patience made the next call. A nicer rep promised to note our two beds request on our reservation. Okay, good enough. At least, she was being helpful, not like the first rep I spoke to who was downright rude when she found out I booked through Hotwire.", "title": "Overbooked? At 3:30 in afternoon? Poor customer service", "helpfulness": 2, "user": "Rob0ny", "date": "July 29, 2009", "detail_rating": {"service": 1.0}, "id": 36135489}, {"rating": 4.0, "stay_parameters": "Stayed July 2009, traveled with family", "text": "Check in time was at 4, but we made it to the hotel around 3:30 and they let us check in early. Even before I had a chance to ask for the two beds, the rep who checked us in informed us that there were no more 2 beds available, but he was going to send an extra bed to the room and wasn't going to charge us for it. That was really nice, so I thought, okay, maybe this wasn't going to be as bad as I thought.", "title": "Nice and relaxing but beware of dogs", "helpfulness": 1, "user": "Richoooo", "date": "July 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 35551382}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I intended to propose to my fiance at Loews Coronado. I called the concierge to make some arrangements. The hotel is very old and feels like they slapped some lipstick on a pig and tried to call it new. A perfect example of this is the fact that there are no fans in the bathrooms. The pool looks like it is straight out of the 70's.", "title": "This is the real scoop - avoid at all costs!", "helpfulness": 4, "user": "TucksPop", "date": "August 18, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 75829863}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "It would have been nice if the reservation taker told me that there would be a convention at the hotel which would occupy most of the property, making it impossible for me to have the quaint romantic get away we were hoping for. The hotel is very small and if there is a convention there, plan on fading into the background.", "title": "2 days was perfect", "user": "jlarsen0908", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 75786751}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "Our room had a view of someone's wedding rehearsal dinner that was very loud, making it difficult to relax in the room at all. Since the weather was 60 degrees in August (not the hotel's fault) you might find yoursefl wanting to relax in the room. Forget it.", "title": "Great place to crash", "user": "KTC0509", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 75315104}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "When I asked for a room with an upgraded view and offered to pay for it, they said were all booked up.", "title": "Nice 4 Star Resort", "user": "StealthTraveler", "date": "August 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 75215813}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We had dinner in their high end restaurant. They kept promoting the view but most people eat dinner at night - it was dark, no view. The food was aweful and I let them know about it. It was the most expensive meal we had in a while (and we live in Las Vegas) and I was actuallty embarrased for the chef.", "title": "Fantastic as always!", "user": "Coomster", "date": "August 13, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75028925}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled on business", "text": "The hotel lobby was beautiful and so were the grounds. Our room was a little tired. The bathroom shower leaked onto the floor and the bed was way too soft. The cordless phone didn't work either. Their valet service appeared to be something they didn't expect guests to utilize. There was a new ticket each time you came back to the hotel and it just seemed like it would have been easier to self park (I am probably being a little picky). The linens were top quality and the view from the room outstanding. It would be nice to see a hotel that actually puts hangers in their closets. There are never enough. If I am vacationing in Coronado again I would stay there. If I am there for business in San Diego I will stay closer to town.", "title": "Nice hotel, location a little far", "helpfulness": 1, "user": "fussiefoodie", "date": "June 21, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 3.0, "cleanliness": 3.0, "value": 5.0, "location": 4.0, "rooms": 3.0}, "id": 17101286, "likes": {"liked": "— The grounds and the lobby", "disliked": "— location and the bed"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "\"San Diego's Worst!!!!", "title": "San Diego's Worst...Not a family resort/hotel", "helpfulness": 3, "user": "Sandy2008", "date": "June 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 16932207, "likes": {"liked": "— Nothing...very bad services, clear biases agains families", "disliked": "— Everything - negative biases agains family, $25 parking, middle of no where location, bad food"}}, {"rating": 3.0, "title": "Expensive Resort Charges and No Free Internet or Breakfast", "text": "if you are family person and have some self respect, you do not want to stay in Loews Coronado. We were booked for three nights and we decided to check out after one day because of really bad experience. They do not like kids, the resort is in middle of no where, bad food, very bad service, $25 daily parking, and miles of walking before you can do any outdoor activities.", "helpfulness": 2, "user": "wroughtironron", "date": "June 7, 2008", "id": 16756511}, {"rating": 3.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "We had terrible experience in their Mistral restaurant and they have a pattern of holding biases against family and kids. They like business events or people in their 50s and 60s without kids but please if you do not want bad time during your vacation, do not even consider this aweful place.\"", "title": "Overpriced resort", "helpfulness": 2, "user": "glow4011", "date": "June 6, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 3.0}, "id": 16710846, "likes": {"liked": "— It's pet-friendly, I'm a pet owner so it was nice to know", "disliked": "— Should include breakfast, free wifi and parking (should be no fee)"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "This is a nice Hotel and my room did overlook the bay, but whilst other rooms had balconies, not this one. I get the feeling that Hotwire Bookers get the least when it comes to allocations, and usually I'm at the furthest end of a 300 yard corridor.", "title": "Doggie Heaven", "helpfulness": 2, "user": "AvenueBee", "date": "June 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 16682365, "likes": {"liked": "— Scenery", "disliked": "— Distance from town"}}, {"rating": 4.0, "title": "Very Relaxing", "text": "June stay for 4 nights (luxury room)", "helpfulness": 1, "user": "AmAstley", "date": "July 21, 2009", "id": 35346243}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We had a wonderful and relaxing time at this hotel, yes the corridors are a little dated (reminded me of the 80’s) and we had some trouble with our key not working (twice) but apart from that the room, the pool and the location was fantastic. We actually wished we had booked for a bit longer (after staying at Loews Santa Monica – we were disappointed we hadn’t booked this hotel for 9 nights compared to that – it was terrible!) anyway, we were sorry to leave this hotel and Coronado.", "title": "Not Loews Quality", "helpfulness": 1, "user": "NycM26", "date": "July 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 4.0, "rooms": 3.0}, "id": 34851682}, {"rating": 2.0, "stay_parameters": "Stayed June 2009, traveled on business", "text": "We only paid £135 a night for this hotel and didn’t really expect it to be as nice, clean and generally a great hotel that it was. The parking worked very well, it was easy to park near your block (we were in block 4). Going out in the car and unloading it was very easy because it was quite near your room and you didn’t have to ask anyone to bring it to you. Well, we thought that was a good system and at about $22 a day – that didn’t seem too bad (compared to $30-$40 in some hotels on our trip).", "title": "Run, do not walk away from here", "helpfulness": 1, "user": "straykitten11", "date": "July 14, 2009", "detail_rating": {"cleanliness": 1.0, "value": 2.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 34692616}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "We ate in Ocean & Vine (I think it was called) a number of times (due to the room credit) the food was excellent; the staff were very pleasant as well.", "title": "Great Hotel and even better service!", "user": "OCHAnnapGM", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34626061}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "The view from our room wasn’t the best; you could see the bay if you craned your neck but it was extremely quiet which we had requested so we couldn’t complain. The staff seemed very nice, and when you requested something (our coffee machine broke) they came straight away.", "title": "I could live here!", "helpfulness": 1, "user": "bluebrooke11", "date": "July 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34591280}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "I loved staying here! There is a huge pool network outside with an adult pool, kids pool, and family pool. There are also 2 hot tubs. When the weather was nice this is where we mostly stayed. There are also tennis courts, a spa and boat rentals/boat rides available for a fee. There are several restaurants on site and although all are pricey the food and views are great, and obviously the location in convenient. The hotel is a few miles away from the downtown Coronado area so a rental car (I got mine for 11/day through priceline name your own price) is convenient. I found the hotel staff to be incredibly friendly, and when we asked to have our room moved away from the loud children next door they moved us quickly. One note, this is a very family friendly hotel and maybe not the best spot for a romantic honeymoon trip although this was our purpose and we had a great time!", "title": "Great trip even with the cold weather", "helpfulness": 2, "user": "MaryBt", "date": "May 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 16515093, "likes": {"liked": "— The massive pools, pool bar and separate bath/tub", "disliked": "— Not directly on the beach"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008, traveled with family", "text": "The pool bar menu has a $5 kids menu and I ordered the chicken fingers and fries and found it to be enough food for me for lunch! The frozen drinks at the pool bar are $10/piece, so you can do some serious damage here.", "title": "LOVED the experience", "helpfulness": 1, "user": "Jules70Toronto", "date": "May 30, 2008", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 16514431, "likes": {"liked": "— Clean, and elegant", "disliked": "— Kids club was never open during our stay."}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "For breakfast we went downtown on orange st and ate at Cafe 1132 a couple times (reasonable prices, healthy food) http://www.ecoronado.com/cafe1134/", "title": "Terrible Room Location Next to Pool and Hot Tub", "user": "CalistaS", "date": "May 20, 2008", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 1.0, "rooms": 2.0}, "id": 16256921, "likes": {"liked": "— Nice common areas.", "disliked": "— Room location and hotel's unwillingness to move us."}}, {"rating": 4.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "For our favorite Mexican food we went to \"Old Town\" and ate at Old Town Mexican cafe and cantina.", "title": "Beautiful, great service, nice rooms! (just a little far to downtown SD)", "helpfulness": 1, "user": "2ColoradoTravelerz", "date": "May 16, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16088359, "likes": {"liked": "— Beatiful hotel/resort and friendly staff", "disliked": "— Distance from downtown"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "We also ate at Miguels cocina in Coronado but did not think it was as good.", "title": "For My Purposes, Great", "helpfulness": 2, "user": "holjim", "date": "May 13, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 16004470, "likes": {"liked": "— Nice room. Away from the congestion of downtown Coronado."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with friends", "text": "At one time not long ago, the Loews Market Cafe offered one of the better brunches in San Diego. Now a shadow of it's former glory; gone are the outdoor grill, superb seafod selection, both smoked and fresh. In its place was a tired array of typical bruch items, as well as long lines for the few, more interesting items like omelettes made to order as well as the crepe bar. As always, the ingredients were high quality, and service was friendly, if not high caliber.", "title": "Boycotting the Sunday Brunch...", "helpfulness": 2, "user": "volvo99", "date": "July 13, 2008", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 4.0, "service": 3.0}, "id": 17842181, "likes": {"liked": "— n/a", "disliked": "— n/a"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "In short, a major disappointment to a reputaion it previously earned.", "title": "Poor Service, Overpriced, Spoiled Food", "helpfulness": 1, "user": "CaliKitty", "date": "July 10, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 2.0}, "id": 17770894, "likes": {"liked": "— Pool area was nice", "disliked": "— Food, Service, Not a Good Value"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed one night. we arrived at 2:30pm 6/28. It took a total of 40 min of waiting in line at registration, plus one hour killing time for our room to be cleaned, for us to finally check in. Decent room, one of few with no balcony, and right next to the ice machine. View of the rooms across the sidewalk. Had to request a rollaway bed twice before it finally showed up. Mistral served me spoiled mussels, I exchanged them for spaghetti and meatballs. Just what I want when I'm on vacation...Very overpriced and subpar food. I didn't even finish my creme brulee, it wasn't worth the effort. Concrete surrounding the pool is very slippery. My son fell, and several others were slipping, too. Parking is hugely overpriced. There is nothing else to do here without getting in a car to drive to town. When we returned home, there was a message on our answering machine from Loew's stating \"your room is ready\" when my husband had specifically asked them to call his cell phone to advise of our room status. I then became ill (from what little of the mussles that I ingested) for a couple hours. Our friends who live in Coronoado highly recommended it, but we will never return.", "title": "Manage your expectations at the coronado", "helpfulness": 2, "user": "ajmickelso", "date": "July 4, 2008", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 17535817, "likes": {"liked": "— patio", "disliked": "— location"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "We booked this through hotwire and got probably half off by doing so (pretty easy to figure out which resort hotel it was). After reading the reviews, we were really apprehensive. But, we came in with low expectations and were pleasantly surprised. BUT! You will not be happy here if you do not like children or dogs - they are everywhere here. We have an 18 month old, and from the easy access pool to toy library and helpful staff - he was thoroughly entertained. I could tell that the desk person was not too happy i was a hotwire guest, but hey, to get 150 off a night, i will accept some stink eye. Come here if you get a good deal, it will be nice and enjoyable - but get ready to get charged for the usual resort stuff (parking, expensive restaurant etc.)", "title": "Great Experience!", "helpfulness": 2, "user": "Drumhead59", "date": "July 1, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17416280}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I read many reviews—positive and negative—of the hotels on Coronado. Even though everyone talks about the Hotel Del, it is right in town and very crowded with guests and busloads of tourists day and night. Not our idea of getting away from it all. We were flying in and renting a car and wanted an out-of-the-way place to relax near the beach. Driving in to the property, I was impressed with the location and look of the resort—with multi-million dollar properties on the water next door. The hotel was full, but Jewel worked very hard to accommodate what I had requested and she gave us a great room with a superb view of the bay. We were also around a corner at the end of a hall, so no noise, even though the hotel was full. If you want, you could never leave during your stay. They've got everything here—even a Starbucks kiosk. Yes, the restaurants are pricey, but you are at a 4 star resort. Yes, you pay to self-park ($16.50 per day) but you can park right under your building and take an elevator right off the garage to your floor. The Silver Strand beach goes on for miles just across from the resort. Golf cart shuttles take you to the beach and back, even though it's not a far walk. The Loews has a table there all day where you show your room key and can check out boogie boards, chairs, umbrellas, and towels at no extra charge. A great perk. The marina rents bikes, paddle boats, kayaks, wave runners, and you can arrange for gondola and boat rides. EVERY employee we encountered was very nice and personal. We found them to be very kid-friendly and even though some folks had their dogs there, it wasn't a big deal. If you have a car (or rent bikes at the marina), go into Coronado. It is a refreshing Americana retro experience. There are many great restaurants and gift shops there. For families , the Beach-N-Diner is the best—great breakfasts (served anytime), burgers, salads, etc. Next door, the Moo-time Creamery is better than any of the chain ice cream spots. Cafe Azul has good Mexican and Village Pizzaria has great pizza. I'm glad I ignored the negative reviews and booked our vacation at the Loews. Our family had a great, relaxing time and I would return to the Loews with no hesitation.", "title": "What an amazing stay.......", "user": "wleasure", "date": "June 30, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 17366061, "likes": {"liked": "— The room and the service. Julius was awesome and kept us happy through our entire stay.", "disliked": "— The parking charges are a bit steep as others mention, but come on; it helps keep the common folk away."}}], "location": {"country": "United States", "city": "Coronado"}, "stars": 4, "variance": {"poor": 105, "average": 184, "very good": 432, "terrible": 45, "excellent": 432}, "aka": "Loews Coronado Bay Hotel Coronado", "slim_ranking": 0.578947368421, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "description": "Welcome to Loews Coronado Bay, our beautiful bay front San Diego luxury hotel. Step into a world of luxury with breathtaking views, direct access to the Pacific Ocean and luxurious spa escapes. This all awaits you in the comfortable setting of the Loews San Diego Hotel. Our rooms are designed to fit your specific needs, whether those needs be spacious rooms perfect for families or flexible work areas ideal for business travelers looking to get work done while traveling. Voted one of the top Family Beach Resorts in the U.S. by Parents magazine, the resort boasts endless activities for guests of all ages. Whether you choose to cruise in a gondola, relax on the beach or visit one of San Diego's world-famous attractions, the possibilities are endless. Or, simply unwind with a soothing massage at our luxurious Sea Spa."}