{"user_rating": 3.5, "review_count": 18, "name": "Loki Salta", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "I wasn't going to write up a review on Loki Salta as I figure the Loki brand would get enough reviews on it's own eventually, but feel compelled to after reading the frankly unjust review below.", "title": "A gem in the countryside", "helpfulness": 2, "user": "Beckiboo1983", "date": "January 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149266068}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled solo", "text": "I stayed at Loki Salta with my partner in November 2012 and we had a great time. After travelling for over eight months and staying in dingy dorms, arriving in the beautiful Argentinian countryside and making our way to this ranch and looking at the comfortable new beds was sooo welcome!!", "title": "Maybe great later, but not ready to be open yet", "user": "AngelaMelody", "date": "December 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 147577480}], "location": {"country": "Argentina", "region": "Northern Argentina", "continent": "South America"}, "variance": {"poor": 1, "average": 3, "very good": 5, "terrible": 3, "excellent": 6}, "slim_ranking": 0.306818181818, "description": "Loki has landed in Argentina and we are proud to present our beautiful new backpackers sanctuary in the heart of the countryside. Salta is a key gateway point for travels between Argentina, Bolivia, Chile and Brazil and therefore the ideal location to stop off, kick back and re-charge before the journey ahead. Our brand new Loki is situated 20 mins outside of Salta city, in a small 'pueblo' of little over 1,000 residents whose origins are synonymous with the lifestyle of the gaucho and tobacco grower. With panoramic views of the surrounding Andes mountains, a highland subtropical climate, and all the fresh air, sounds and smells of rural Argentina, you can choose to do as little or as much as you like. Our brand new hostel in Salta is the new addition to the Loki family. Our services within the hostel include, bar, restaurant, swimming pool, tennis court, ping pong and pool table, all you can eat BBQs twice weekly, nightly dinners and entertainment."}