{"user_rating": 4.0, "review_count": 502, "name": "Long Bay Beach Club", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "My husband and I had walked around Long Bay Resort 16 years ago while staying in a Villa in West End. We agreed that if we returned to Tortola, that is where we would stay. It took awhile to get back; so many islands, so little time.", "title": "Everything we wanted and expected it to be", "helpfulness": 1, "user": "LynnandBob", "date": "June 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 67623869}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "First off, we were upgraded from Hillside Ocean View (lowest cat.) to Beachfront Deluxe, an upgrade of several levels. That went a long way toward making us happy. We had booked at a great sale price through Elite Island Resorts. I recommend EIR highly, take a look at their properties online sometime. Great deals and reliable service.", "title": "Diamond in the rough....", "helpfulness": 2, "user": "CanadianTraveler1978", "date": "June 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 67504726}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The room was large and recently refurbished. I loved the huge shower with a big window. Since we were on the 2nd floor we could leave the blinds open and look at the ocean while showering. Nice. Long vanity counter with two sinks, huge walk in closet with room to stash the luggage. Nice balcony with basic dining table and two chairs. We had many meals there and would sit for so long either planning our day in the a.m. or reviewing it at dinner. There is a tiny kitchen with sink, counter, fridge and when we asked if there was somewhere in the lobby to pop popcorn the front desk staff immediately brought us a microwave. It came in handy reheating restaurant leftovers and saved us lots of money.", "title": "Welcome to the Long Bay Beach Resort and Mosquito Breeding Ground", "helpfulness": 1, "user": "sstachoni", "date": "June 10, 2010", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 3.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 67128945}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "The pool is really big. One side is a lap pool and the other has a sliding board. We loved setting up under one of the flower covered arbors in the shade and spending the afternoon there. Usually only a handful of other people around.", "title": "Old and dated, but great beaches", "helpfulness": 2, "user": "GlobalTravelerM", "date": "June 6, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 66605188}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The beach, of course, is heaven. We walked it end to end every morning, carrying our coffee, beachcombing, running into new friends we had met at the pool (Hi Polly and Beth, miss you!) while deciding whether to have breakfast on the balcony, at the restaurant or at Sebastian's just down the road.,", "title": "We loved this Place", "user": "sptfyr", "date": "June 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 66149326}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Stayed there in 2007 on vacation, in one of the beach side villas. Out view was like postcard, complete with shady palm tree, that sadly we were not able to take advantage of as other gusts who were not staying right on the beach were earlier risers than us and copped seats underneath everyday of our stay. But no matter, as we had a beautiful porch on which to enjoy the same spectacular view. The resort had a pool on the grounds that had a cool swim up bar that was a fun afternoon to get away from the beach. The beach itself was gorgeous, but very rocky, so much so that I wished I had brought water shoes! Restaurant had good fresh fish - conch chowder was very tasty. Only thing was the sheets were low quality, or maybe just old, and were very itchy. If you go, consider bringing your own set from home!", "title": "Amazing view - great beach - get there early!", "user": "cape_nyc10", "date": "May 18, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 64560573}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "My family stayed at the Long Bay Beach Resort in 1990 and had a wonderful time. Because of that experience, my husband and I decided to stay there when we took a trip to the BVIs in January 2010. I was a little concerned as to how the resort had weathered the past 20 years, and given some of the mixed reviews I had read, we were a bit nervous.", "title": "Great Location! Great Resort! Wonderful Trip to the BVIs!", "helpfulness": 1, "user": "geekgirlsc", "date": "May 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63165854}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "From the moment we arrived, we realized that we had no cause for concern. The resort is in a beautiful location and our room (which was one of the least expensive villas) had a phenomenal view of the beaches and surrounding area.", "title": "Just what we were looking for!", "helpfulness": 1, "user": "travelswithdogs0", "date": "May 2, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63062489}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The room was clean and comfortable. The resort was aged but maintained well, and we could tell that the management is working to bring the resort up a level in beautification.", "title": "Simple Rooms, Gracious Staff, Beautiful Beach!", "user": "cbernard1sc", "date": "April 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 62257239}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "The resort is somewhat isolated, but we found ourselves enjoying dining and nightlife in Sopher's Hole, Carrot Bay, and Apple Bay with an inexpensive cab ride.", "title": "Just what we were looking for.", "user": "JPell224", "date": "April 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 62200732}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our trip to the BVI was probably the best vacation we've ever taken and Long Bay Beach Resort was a really great location. At first it felt a little isolated (since it's in the West End, it's a 45 minute ride from the Beef Island airport by cab), but the location is absolutely outstanding. The Long Bay beach is stunning - beautiful, relaxing. I guess because the hotel wasn't full, we were upgraded (without us asking) to a room up on the hill with an incredible ocean view. The hotel and the room are not five star quality, so don't expect that, but everything was clean and pleasant and well-kept and really comfortable. The grounds are well-maintained.", "title": "Really nice stay", "user": "extraextra", "date": "July 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 72301887}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The best thing about this hotel is the location. We did the 20 minute walk a couple of times to Smuggler's Cove beach, which has to be one of the best beaches we've ever been to. We snorkeled and hung out in the water for hours at a time; swam with turtles, snorkeled in the middle of masses and masses of anchovy, and watched pelicans and other birds dive bomb the fish. This beach is so relaxing and somehow, both times that we went, the water was as still as a lake. There are also a couple of beach bars so you can get a nice umbrella cocktail here.", "title": "Wonderful Room with a Nice View", "user": "Dave_Nuffer", "date": "July 20, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71705151}, {"rating": 3.0, "stay_parameters": "Stayed July 2010", "text": "The hotel has WiFi in the lobby, but it was sort of intermittent in the room. The lobby had a pool table and there's a library of used books and a sort of game room and a large projector TV room. There's also a little store to get sodas and beers and chips and there are a couple of car rental agencies right on the property.", "title": "Nice view and room but expensive food & rude resturante staff", "user": "Hilma49", "date": "July 9, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 70245545}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We rented a car for a couple of days and went to Cane Garden Bay and Brewster's Bay. Brewster's Bay had some pretty decent snorkeling, a beautiful beach, and a restaurant/bar. Carrot Bay and Cane Garden Bay seemed to have more restaurants than the Long Bay Beach area. We also drove to Roadtown and found a Rite Way grocery store (market) there where we stocked up on lunch and breakfast items - fruit and bread and milk , etc (the room comes with a small refrigerator). You can also get some basic grocery items at the little tiny market called Sebastians (1/2 a mile over a pretty steep hill) and there is a market in Cane Garden bay called Bobby's that has almost everything. Buying breakfast and lunch items is a good idea because the breakfasts at Long Bay start getting pricey.", "title": "Adventure! Good and Bad", "helpfulness": 1, "user": "Buccaneers2010", "date": "July 4, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 69649110}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "The Long Bay restaurant had the BEST BBQ spare ribs we've ever had. The beach view in that restaurant is really lovely at sunset. Breakfast was just okay and on Tuesdays and Thursday nights, the restaurant turns into another restaurant called the Pasta Shop or Pasta Store. That is just okay too. We were surprised at how many people complained about the service - we had great, friendly service everytime we went there.", "title": "24 Steps from the Sea", "helpfulness": 5, "user": "williamtorrillo", "date": "June 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67819905}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "We vacationed at Long Bay for one week in March with another family. Our attempt to get there was crazy because of the ferry schedule. Make sure you understand that Long Bay is around the corner form West End and not Road Town. The Inn and property were historically interesting, but could use a little sprucing up. Our rooms were on the beach and totally outdated. The wood was rotten on the doors and we had some bug issues. We hardly spent anytime in the room so that was easy to overcome, but still disappointing. The main help/front desk was very efficient, but the wait staff was extremely slow!!!! They were polite, but not 5 star service. The beach itself was well kept and clean. The view from our room was breathtaking. We did not do all inclusive so that we could roam the island at meal time. I can not stress the excellence of Bananakeet restaurant! The food at Long Bay was also very good! This is not a \"resort\" atmosphere but a quaint little nook that is semi secluded. We enjoyed the safe feeling for our kids ranging in ages 10-14. They could go to pool and beach safely on their own. I would go back and felt it was a good value, but it was not 5 star resort.", "title": "Beautiful location resort needs some touch ups!", "helpfulness": 2, "user": "kellynichols", "date": "April 20, 2010", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 62011109}, {"rating": 4.0, "title": "Great family getaway and a superb location", "text": "We recently returned from a 5 night stay at Longbay and had a wonderful experience. I was a little concerned about some of the negative reviews on this site but we found the place to be great for a family trip. I came to the conclusion that the majority of the negative reviews were due to people not understanding that the BVI is quite different from the USVI and that if you want \"5 star\" service and impeccable accommodations, then the BVI is probably not for you.", "helpfulness": 1, "user": "Hlhat", "date": "April 8, 2010", "id": 60751146}, {"rating": 2.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "We stayed in a 3 bedroom villa that had a great veranda complete with a gas grill and 6 seat table. We spent most of our \"open time\" in the villa out on the veranda with a wonderful view of the ocean and neighboring islands. In fact, I think we ate most of our meals out on the veranda when we weren't eating out. The kitchen was satisfactorily equipped with a full size refirgerator and stove, microwave and toaster. The bedrooms were comfortable and all of them had balcony access and the same view as on the veranda. We only used the AC at night and didn't really even need it then or during the day given the constant breeze through the villa through the screened doors.", "title": "Not worth the trouble", "helpfulness": 1, "user": "EnduranceIdaho", "date": "March 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 59436674}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We only had one meal at the property at the 1748 restaurant and is was pretty good but not great. It had a fairly limited menu but all in all not too bad. The kids did have a lunch or two at the poolside bar (burgers, sandwiches, etc) but we didn't make it to the other restaurant on site.", "title": "Beautiful, Lovely, and Relaxing", "user": "messyjessy24", "date": "March 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 59042280}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The beach area is beautiful and uncrowded. There are numerous shady areas under the palm trees if you need it and plenty of beach chairs in the area. The water right off the beach is a little rocky but better near the 1748 restaurant area with more of a sandy bottom. In the entrire time we were in Tortola, we didn't see a better beach area at any of the other hotels or resorts. Cane Garden Bay is nice but be prepared to share the area with all of the boisterous cruise ship people that come over there on day trips.", "title": "GREAT place to stay!", "user": "lovetraveling70", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58716063}], "location": {"country": "Caribbean"}, "stars": 3, "variance": {"poor": 48, "average": 73, "very good": 199, "terrible": 32, "excellent": 150}, "aka": "Long Bay Beach Resort And Villas", "slim_ranking": 0.285714285714, "detail_rating": {"service": 3.5, "cleanliness": 4.0, "value": 3.5, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Located on one of the most beautiful, mile-long stretches of white sand beach in the Caribbean, Long Bay Beach Club is truly the gem of the British Virgin Islands. Guests enjoy terrific accommodations including Beachfront Rooms and Suites. The resort amenities include the historic beachfront 1748 Restaurant & Bar, tennis, amazing beach and much more. Fantastic location on Tortola's much sought after West End, just minutes from Soper's Hole Marina. Popular excursions include sailing, diving, sightseeing, and shopping. Great restaurants, bars, and nightlife nearby. Perfect for couples, friends, and families. Also ideal for those seeking a land / sea vacation that includes sailing and hotel stay."}