{"user_rating": 3.0, "review_count": 74, "name": "Long Beach Motor Inn", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed May 2004", "text": "Reading the negative reviews on this hotel really hits home because several years ago, when my children were young, we were staying in York at the Anchorage Inn. We walked next door to the Long Beach Motor Inn to admire the property and inquire about rates for a possible future stay there. There was a woman sitting in a chair outside the office who is the same \"woman\" on the phone that the negative posters have spoken to. I am also sure that this same woman is the owner. When we saw her, she had her arms folded, no smile or even a hello, and was definitely not welcoming us onto her property. She was extremely rude to us, and my young children were nervous as they had never really met someone like her before.", "title": "Another Bad Experience with the Woman at the Long Beach Motor Inn", "helpfulness": 40, "user": "SuzanneE", "date": "May 27, 2006", "detail_rating": {"service": 1.0}, "id": 5223935}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "A couple of years ago I saw the Long Beach Motor Inn listed on the web site of the York Chamber of Commerce so thought maybe there was a new owner and called to ask about rates. It was the same woman we had talked to when we visited the first time who answered the phone this time. She was not friendly nor welcoming and gave me the rate. I started to say, Thank you, I will get back to you…\", .and she HUNG UP on me also before I could finish!", "title": "LOVED Long Beach Motor Inn", "helpfulness": 39, "user": "Lilian_rose", "date": "May 23, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5204718}, {"rating": 1.0, "title": "It is hard to get a reservation when they hang up on you!", "text": "We still vacation in York, my children are much older now, and now we can laugh about the rude woman at the Long Beach Motor Inn. When we drive by there, we always look for her chair outside the office, and many times it is there, sometimes with her sitting in it!", "helpfulness": 34, "user": "A TripAdvisor user", "date": "April 20, 2006", "id": 4992285}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "I agree with others, a wondeful and great place to stay. I am a returning customer for years now and just love this Inn. It is always clean, neat, tidy: a perfect place to stay with or without children. YOU FEEL LIKE A WELCOMED GUEST! The owners are friendly and very personable. The pool is spectacular, crystal clear. Stay here, you will never regret it at all. Thumbs up and and A+++++++++++++++++++!", "title": "Home Sweet Home", "helpfulness": 36, "user": "Kettie72", "date": "October 6, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3998247}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "I called to get rate and availability information in March for a June stay at the Long Beach because their website does not have this information (when you click on the link you get an error screen). The woman who answered the phone would not give me any information, just told me to go to their website. I explained the information was not available and she reluctantly took down my address to send me a brochure. I called again three weeks later because I hadn't receive anything from the Long Beach and this is my exact conversation with the same woman:", "title": "Just like home", "helpfulness": 34, "user": "Foamy", "date": "September 26, 2005", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 3940209}, {"rating": 5.0, "title": "First trip to the sea !!", "text": "First visit to the ocean and at the Long Beach Motor Inn also.", "user": "A TripAdvisor user", "date": "September 22, 2005", "id": 3932429}, {"rating": 5.0, "title": "A very nice trip", "text": "Incredible the home feeling you get when staying at the long Beach Motor Inn!", "user": "A TripAdvisor user", "date": "September 17, 2005", "id": 3911880}, {"rating": 5.0, "title": "Loved the Long Beach Motor Inn", "text": "From my room, exceptional view marying the green grass & trees to the red and white flowers into a beautiful landscape corridor unrolling directly to the sea like if I were alone in this fantastic town of York.", "user": "Patulla", "date": "September 16, 2005", "id": 3909909}, {"rating": 5.0, "title": "We love the Long Beach Motor Inn", "text": "Everything was comform to my exigence; impeccable services of all kinds distributed with a smile. But most important since I travel alone was their 24/24 hour security in place at the Long Beach Motor Inn.", "user": "A TripAdvisor user", "date": "September 11, 2005", "id": 3894913}, {"rating": 1.0, "title": "Terrible Customer Service", "text": "Sincerely,", "user": "amtravel", "date": "August 11, 2005", "id": 3754308}], "location": {"country": "United States"}, "variance": {"poor": 4, "average": 2, "very good": 7, "terrible": 28, "excellent": 33}, "aka": "Long Beach Motor Hotel York Beach", "slim_ranking": 0.666666666667}