{"user_rating": 4.5, "review_count": 1083, "name": "Long Beach Lodge Resort", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled with family", "text": "Words cannot describe this haven on the coast of VC Island! It is literally the most perfect hotel, where everything is catered for. We recently stayed in one of the resort's \"rainforest cottages\" which came with it's own Hot Tub, kitchen & living room, and even raincoats!", "title": "Perfect in every way!", "helpfulness": 2, "user": "Josh S", "date": "July 17, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17974651, "likes": {"liked": "— Honestly - absolutely everything!", "disliked": "— It took a while to get to from the port on the other side of the island."}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The hotel itself is pure bliss - beautifully designed with a gorgeous restaurant and lounge! The kids went surfing and in the evening, after dinner, we all went and played Frisbee on the beach.", "title": "Way over priced", "user": "mumph", "date": "July 16, 2008", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 17941564, "likes": {"liked": "— good room with fine view from balcony", "disliked": "— staff lacked experience,motivation, and enthusiasm"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2005", "text": "One of the nights we stayed, we used the resorts complimentary gas BBQ, regularly cleaned and sheltered in their own little gazebos around the woodlands. It made a really nice change from that sort of drudge you get into of going out for dinner every evening.", "title": "I love this place", "user": "Helenabombana", "date": "June 26, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 17249577, "likes": {"liked": "— Amazing location", "disliked": "— Disappointed by size and location of restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008", "text": "Even the little things all start to add up - for example the free DVD library you can browse at reception or the cleverly lit pathways leading you back to your room,", "title": "The Perfect Getaway", "user": "SomeoneCanada", "date": "June 18, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 17017283, "likes": {"liked": "— Everything"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I absolutely love this hotel, I'd recommend it to everyone who wants the perfect holiday experience!", "title": "Nice Lodge for families but also for romantic time", "user": "tsb72", "date": "June 9, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 16807659, "likes": {"liked": "— The large rainwoodforest cottage", "disliked": "— The price"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We have just returned from 5 days at Long Beach which were wonderful. The drive in itself from Nanaimo is breathtaking. We stayed in a \"rainforest cottage\" which was exceptionally roomy, finished to a very high standard with very tasteful furnishings, very well kitted out and looked like it had been completed yesterday in terms of the level of wear and tear. Having a cottage and the use of the 'Great Room' for meals and to hang out in if we wanted a change of scene was an ideal set up - a home from home without the responsability for meals if you don't want it. Meal options are numerous - Tofino has some great restaurants and paying for meals separately enables you to sample the restaurants of other local lodges such as the Wickannish Inn which is just down the road. We also made use of the wonderful gas barbeque adjacent to the cottages at Long Beach one night. Meals in Long beach's Great Room were of a high standard, but the menu is not v. extensive and guests staying several nights would probably quickly get through their preferred selections. The serving staff were increadibly friendly and helpful but service was not very rapid. Booking for the restaurant is essential and a good idea to do the day before if you want the most popular eating times. We were exceptionally lucky with the weather, we saw some wonderful sunsets from the breaktaking views from the Great Room. Cox Bay, where the resort is situated, is a stunning location with miles of deserted sand and great surf. The water is freezing, but there are plenty of outfitters in Tofino who will rent you wetsuits and surfboards. We whale watched and bear watched courtesy of Ocean Outfitters in Tofino who were great. I consider myself to be a discerning traveller, prepared to pay a high price for a quality product. I rate Long Beach as a great value, high quality location, professionally run by very friendly staff - if it wasn't the other side of the world, we'd be regular customers!", "title": "A stunning location for a high quality lodge", "helpfulness": 1, "user": "wildatheart78", "date": "August 21, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 19202675, "likes": {"liked": "— spacious, tastefully decorated accommodation - possibility of having a cottage", "disliked": "— lack of choice and slow service in the restaurant"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My partner and I celebrated our 25th year together by treating ourselves to a night at Long beach Lodge on the shores of beautiful Cox Bay. The setting is magnificent and the room had a lovely view of the beach. The room featured a fireplace comfy armchairs a jacuzzi tub and a nice balcony. The room and setting was the perfect romantic getaway we had wanted. Unfortunately we discovered that the room had a unpleasant odor of stale colonge. The windows were dirty with fingerprints all over. The toilet ran and needed adjusting after each use. The balcony was dirty with debris. One of the supplied bathrobes was dirty and smelled heavily of colonge. Not what you would expect for a room with a rate of $500.00 / night.", "title": "Great Location - unclean room - poor service - poor value for price", "helpfulness": 5, "user": "TravelGuys1202", "date": "August 17, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 19047307, "likes": {"liked": "— setting", "disliked": "— poor and bias service -poor value"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Restaurant- we had booked our celebration dinner in the Lodge Restaurant. Beautiful setting and a nice decor with views of the ocean. The food was adequate but for the same price - superb food and ambience can be had at the Pointe restaurant at the Wicaninish Inn nearby. The service was poor at the restaurant. We waited in the lounge area with a cocktail and were told we would be called when our table was ready. We waited and waited and finally inquired and discovered that there were lots of tables- they had just forgotten about us. Our wait person serviced other tables that had arrived after us and throughout the entire dinner we had to wait an inordinate amount of time for service compared to other tables being served by the same waitress. We observed her giving attentive and friendly service to the other tables, but to us her service was perfunctory at best. As a same sex couple we wonder if her treatment of us was somewhat coloured by a personal bias. For the standard of the restaurant we would expect much more. Also our reservation info was incorrect & upon checking in when we brought this up we discovered at the end of our stay it had not been updated. We had been asked if there was a special occasion and we said it was our 25th Anniversary - so you expect some sort of acknowledgment of this during our stay but there was none. We would encourage others to stay at the nearby Wickininish Inn which offers the same price for a better experience.", "title": "Great place", "user": "MWHE", "date": "August 16, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19003244, "likes": {"liked": "— Atmosphere, location", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed June 2008", "text": "Stayed on a friend's recommendation in one of their cottages, party of 2 adults 2 children. Liked the place a lot, friendly staff, relaxed, good food at not too expensive prices. Good access to private beach. Tofino was more interesting than I expected. Bit of a drive from the ferry (100m / 3 hrs+) but worth it. Would certainly recommend.", "title": "Great location, average service", "helpfulness": 1, "user": "haveboots_willtravel", "date": "August 3, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 4.0, "location": 5.0}, "id": 18564629}, {"rating": 2.0, "stay_parameters": "Stayed June 2008, traveled with family", "text": "Excellent location, good food in the restaurant, and a nice room with sea view and large bath. Unfortunately the hotel staff often give the impression that they're just there on holiday (the restaurant staff being the exception). Housekeeping seemed to have a problem with replacing bathroom toiletries and even toilet roll.", "title": "Choose the Wick instead", "helpfulness": 2, "user": "UluruAustralia", "date": "July 24, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 18220732, "likes": {"liked": "— Overlooked by nearby resort with associated building noise"}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008", "text": "The Long Beach Lodge offers a lot of fall/winter discounts and we took advantage of one to book a \"beach front\" room. I was really glad that we hadn't booked one of the cottages. Far from being \"nestled in the forest\", the cabins are actually lined up on either side of the access road that comes from the highway to the lodge. Our room in the lodge seemed small and claustrophobic, though it may have just been my mood. One ridiculous \"feature\" was a window between the bathroom and the bedroom that had wooden louvers. This was supposedly so that you could sit in the tub and look out at the ocean. It seemed to me they were just trying to emulate the Wickaninnish Inn, just down the road, which has rooms where the tub is right up against an outside window. The food in the restaurant was pretty good. The staff was efficient and workmanlike doing their jobs but they sure didn't seem to be very happy. All told, I would recommend staying at the Wickaninnish instead of the Long Beach Lodge.", "title": "Glad I didn't pay full price", "helpfulness": 1, "user": "jbullock47", "date": "October 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 21158578}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "I was looking for something special for my husbands 70th birthday and our stay at the Long Beach Resort certainly exceeded my expectations. A complimentary bottle of bubbly with birthday wishes set the tone for a fantastic weekend.", "title": "surprise birthday", "user": "sunsetloverVictoria", "date": "October 20, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 21034632, "likes": {"liked": "— private beachfront room", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We're casual, outdoor people so we appreciated the spacious ground floor room with walk- out to the ocean. We felt like we had our own private luxury cabin complete with fireplace and nature guide books. Their choice of landscaping with native grasses, stone pathways and a discrete beach entrance meant the resort blended attractively into the surroundings. The resort is nicely located for exploring the many National Park trails as well as a place to enjoy picturesque Cox Bay.", "title": "Wonderful hotel, stunning location, great service.", "user": "MooseketeerOriginal", "date": "October 14, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20865833, "likes": {"liked": "— Luxurious yet relaxed"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Staff were attentive to our needs without being intrusive. A perfect combination for a peasant stay.", "title": "A magical place", "user": "Magnolia13", "date": "October 12, 2008", "detail_rating": {"front_desk": 5.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20826332, "likes": {"liked": "— location", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled on business", "text": "Perfect hotel for a bit of relaxation and Island fun.", "title": "Long Beach Lodge Resort, one of Canada's top holiday destinations!", "helpfulness": 2, "user": "FishhookCanada", "date": "September 18, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 20178593, "likes": {"liked": "— Relaxed atmosphere and scenery", "disliked": "— Weak cell phone reception around Tofino in general"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "My husband and I stayed at the Lodge in a waterfront ground level room taking advantage of a off season rate the hotel was offering. We both agreed it was one of the most beautiful hotels we had ever stayed at with a perfect location to watch the sunsets and walk the mile of smooth beach directly in front of the hotel. We were also lucky to have some of the best weather of the whole summer. Loved the layout of the room, comfort of the king size bed, extra touches of bathrobes, irons, inroom safe and wingback chairs.", "title": "Magnificent setting", "helpfulness": 1, "user": "thunderingfox", "date": "September 17, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20131427, "likes": {"liked": "— Beachfront location, condition of hotel", "disliked": "— Lack of informal dining"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "Several people in the previous reviews commented on the restaurant and we had a somewhat similar experience. Good food, limited menu but the service was a little absent minded for a really first class restaurant ie dishes weren't cleared promptly, you were left to pour your own wine. Also it would be nice to have a \"cafe\" section if you wanted to stay in to enjoy the view but didn't want a really formal meal.", "title": "Fabulous Stay at Long Beach Lodge", "helpfulness": 1, "user": "bluewater_2004", "date": "September 16, 2008", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 20127493, "likes": {"liked": "— Separate sleeping quarters for two couples travelling together", "disliked": "— Bathroom upstairs was small"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2008", "text": "Do get a waterfront room but ask for one on the 2 or 3rd floor. You will get a better view of the ocean. Take a camera with a tripod for those sunset shots.", "title": "tofino beautiful, lodge ok", "helpfulness": 2, "user": "aussie_rose64", "date": "September 11, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 3.0, "rooms": 4.0, "location": 4.0}, "id": 19974391, "likes": {"liked": "— location", "disliked": "— dining choices"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "Lastly the road to Tofino can be windy and bumpy in sections, so try to time your arrival before dark.", "title": "A truly lovely hotel", "helpfulness": 1, "user": "Londoner16", "date": "September 3, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19688806, "likes": {"liked": "— Location and high quality decor.", "disliked": "— Room cleaning service."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2008, traveled as a couple", "text": "Wow! We LOVED this place. Gorgeous spot mid-beach so you could walk to either end. Had dinner there twice and while the menu is a bit limited the food was very good and the service was great. We did wish they had had an appetizer menu to have something light with drinks in the late afternoon but that's a very minor complaint. We shared a cottage with friends which worked out well, with the bedrooms and bathrooms on separate floors for privacy. Breakfast was excellent with lots of choice and some delicious pastries. Beautiful spot for photography with the beach, mountains and lighthouse - perfect for sunset shots.", "title": "Long Beach Lodge is always going to be our favorite get away.", "user": "Happy-non-campers", "date": "August 23, 2008", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 19273977, "likes": {"liked": "— fantastic beds, views, breakfast, service and management", "disliked": "— that we didn't stay longer."}}], "location": {"country": "Canada"}, "stars": 4, "variance": {"poor": 35, "average": 51, "very good": 150, "terrible": 13, "excellent": 834}, "aka": "Long Beach Hotel Tofino", "slim_ranking": 0.133333333333, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Welcome to our luxury Oceanfront Tofino Accommodations! A luxurious beachfront resort for the discerning traveler, is perched on the edge of Cox Bay, between the pristine beauty of Pacific Rim National Park and spectacular Clayoquot Sound. This cedar-shingled lodge offers 5 star amenities and casual service in a rustic setting, creating a perfect, serene retreat from everyday responsibilities. This area has become a year-round destination for those who revel in unspoiled wilderness. Walk along endless stretches of deserted beach, hike rainforest trails, explore the galleries and shops or simply sit, relax, watch and wonder at it all.Experience the natural beauty, exceptional amenities and handcrafted cuisine at Long Beach Lodge Resort, our luxurious Tofino resort located on a beautiful beach front acreage on Vancouver Island's rugged West Coast. The Resort is set amongst the native coastal vegetation and takes full advantage of the expansive sandy beach and the open ocean with wild west coast surf... in fact it is one of the few Tofino hotels that can claim such a spectacular locale. Come view Tofino's biggest waves from the comfort of our iconic Great Room and partake in some of our award-winning cuisine!Long Beach Lodge is the ONLY resort on Cox Bay Beach offering ANY of these in-house services:full service restaurant & lounge (Great Room) surf instruction & rentals with spa-like change rooms, lockers, hot tub & sauna (Surf Club Centre) boat charter service (Marine Adventures); whale watching, bear watching and other wildlife viewing We are honored to be recognized as the #1 Vancouver Island Resort by Condé Nast Traveler Magazine Reader Choice Awards AND a TripAdvisor Travellers' Choice 2013 winner!"}