{"user_rating": 4.5, "review_count": 1172, "name": "Lopesan Villa Del Conde Resort And Thalasso", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "Our arrival at the hotel was unfortunately marred by a 45 min queue to check in, only to find that they had lost our reservation and prepayment. The reception staff were not at all helpful and gave little assistance to find us a free room of the type we had reserved.", "title": "Could be a wonderful hotel but spoilt by a few easily remedied annoyances", "helpfulness": 10, "user": "mizzyz", "date": "December 16, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 1.0, "location": 3.0, "service": 3.0, "rooms": 4.0}, "id": 6448137, "likes": {"liked": "— Beautiful grounds", "disliked": "— Noisy, hard beds, poor reception, dining scrum"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006", "text": "The reception, gardens, pools and rooms are beautiful and well laid out (although the gardeners amongst us might criticise the lack of flowers and attention to detail). The grounds are well kept and one large pool heated to a reasonable temperature. The hotel was less than half full when we were there, so most of the time there were enough sun beds, although they were most unkind on the back.", "title": "Reasonable 5 star", "helpfulness": 16, "user": "Keogh", "date": "November 13, 2006", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6113429, "likes": {"liked": "— Pool Area, Food, Clientele", "disliked": "— Request Quiet Room through Travel Agent"}}, {"rating": 1.0, "stay_parameters": "Stayed October 2006, traveled with family", "text": "It was very disappointing that no indoor pool was available without paying 30 euros per person per entry to the thalassotherapy centre - rather a lot for a quick dip!", "title": "Its not a 5*hotel!", "helpfulness": 19, "user": "ADLDGD", "date": "October 20, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 3.0, "rooms": 3.0}, "id": 5974320, "likes": {"liked": "— The rooms are quite nice and the bathrooms are lovely", "disliked": "— The noise from above, below and outside was just terrible!"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "The room was very well serviced and spacious, but the beds were very hard, there was no shower over the bath and no double door to reduce a lot of resounding noise from the corridor - footsteps, voices, trolleys etc.", "title": "Speechless", "helpfulness": 5, "user": "d1nsy", "date": "October 15, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5956433, "likes": {"liked": "— Everything", "disliked": "— Bars in hotel closed at 12, although disco opened til 2"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We stayed in this hotel in August 2006. I know the review is quite a while after our trip but I use tripadvisor alot and I thought the hotel was worthy of a review. We travelled with two children aged 10 and 6 and stayed in a Junior Suite. We generally book Junior suites and have hit quite a few in our sun holidays abroad. This was the best of them. The Junior suite was huge and very tastefully furnished. There was a main bathroom off the main bedroom and a shower room off the living quarters where the children slept. The hotel was excellent. It was very large and did not feel in any way crowded but the service was excellent and the staff very nice and friendly. The food was varied and the buffet was extensive. The spa looked fab. and overlooked the sea. The resort itself is very small and while there are several restaurants we tended to return to the same ones over our week's holiday.", "title": "Great Hotel", "helpfulness": 9, "user": "trivia", "date": "March 14, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7162214, "likes": {"liked": "— spacious clean"}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "All in all I would very much recommend this hotel.", "title": "Ok if you're gay too!", "helpfulness": 9, "user": "suebry", "date": "February 16, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 6801494, "likes": {"liked": "— Room and food", "disliked": "— Towels on the poolchairs and cold plates!"}}, {"rating": 5.0, "title": "beautiful", "text": "My partner and I were there early Feb 2007 for eleven nights. We had a lovely spacious room which overlooked the immaculately kept tropical gardens. (Fortunately we weren't overlooking the pools otherwise, I feel I would have been wanting to shout at people who, inspite of hotel rules, insisted on reserving poolchairs with their towels!!)", "helpfulness": 13, "user": "moScotland", "date": "February 13, 2007", "id": 6787085}, {"rating": 5.0, "stay_parameters": "Stayed January 2007", "text": "The room had a robust spacious shower to die for and great 'her's and her's' twin sinks - no arguments over who's using the mirror first! The maid cleaned the rooms meticulously each day and earnt her tip at the end of our stay. Shame about the ablutions one can hear from nextdoors bathroom and the 'click-click' of stilletoes from the room above.. and the usual noise of late revellers. I may suggest also, that families with babies and children are all housed seperately in one block, as they all seemed to wake up crying from 0630hrs...", "title": "impressed", "helpfulness": 6, "user": "poot", "date": "January 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 3.0}, "id": 6710320, "likes": {"liked": "— large and modern hotel", "disliked": "— mediocre evening buffet"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The weather was fabulously hot and sunny and so we just succumbed to iliotherapy with a touch of luxury in the thalasotherapy too - watch the 'marble' beds though, they vary greatly in temperature and can burn your back: tell the staff, who are very obliging!", "title": "most enjoyable holiday", "helpfulness": 10, "user": "JohnP.Shifnal", "date": "December 22, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6482566, "likes": {"liked": "— quality service and furnishings", "disliked": "— Thin walls in guest rooms"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Booked 10 days via lastminute.com, have just returned. The hotel is modelled on a trypical Canarian village, with a central square (for evening entertainment) and the main hotel reception/entrance inspired by a church (take a trip up to San Bartolome de Tirajana to see the church used as inspiration for its design), lit up at night it can be seen from miles around.", "title": "Probably the best hotel on the island!", "helpfulness": 7, "user": "Lapchien", "date": "May 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 7616012, "likes": {"liked": "— Location - on the beach, good views", "disliked": "— Noise from other rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "The facilities are numerous, as you would expect of a 5 star hotel, 4 restaurants (1 fine dining, 1 Italian and 1 buffet style for breakfast/dinner for half-boarders, and 1 general place for lunch, everything from seafood mixed grill to burgers), plus a coffee bar and snack bar. There's also a bar in the cavernous reception area, dominated by a massive Chandelier, which for some reason reminded me of the one in Only Fools and Horses :)", "title": "Really good, clean and helpfull staff", "helpfulness": 6, "user": "catiouch", "date": "May 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 4.0, "cleanliness": 5.0, "rooms": 5.0, "location": 4.0}, "id": 7541761, "likes": {"liked": "— Clean, garden, room, contemporary style, atmosphere", "disliked": "— Noisy tiles and selfish people (not educated)."}}, {"rating": 5.0, "title": "Fantastic family holiday", "text": "The selection at breakfast is very good, all the usual items and more, including half a dozen types of yoghurt. Dinner can get a bit repetitive. Some of the non Brits can become animals at feeding time though. Is it only Brits who know how to queue?! The food was okay - I couldn't really recommend it though, it's just *okay*, and because of that I never ate in the fine dining place (it never looked busy though). In the buffet restaurant waiters tend to manage their own areas. Tip - try to sit in the same area on mornings and in the evening to build a relationship with your waiter. Look out for a lad called Jose - inside, right, at the front. Nothing too much trouble. Others - especially the waiters in the outside area can be a bit grumpy (until you tip them on the morning you leave, then its all smiles).", "helpfulness": 6, "user": "reecey", "date": "April 25, 2007", "id": 7434695}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "There are 2 large pools, 1 heated and by an artificial 'beach area', the other cold, but large and curved. There is a seawater pool, freezing cold. There's a tranquil pool, quite large and peaceful - no mobiles or screaming kids allowed (they have their own pool and club). There's also a smaller heated pool, quite small but on a patio, in 10 days I only saw 1 person in it. Some of the pools have built in jacuzzis. There's also half a dozen pool-type rooms in the spa, including a flotation tank and ice shower - you will have to discover those delights for yourselves!", "title": "Very good hotel overall", "helpfulness": 4, "user": "hollipops", "date": "April 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "rooms": 2.0, "location": 4.0}, "id": 7307534, "likes": {"liked": "— The hot chocolate with cream", "disliked": "— the nasty hard beds ...sleep on the floor its softer"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The only real criticism I have of this place is the noise from other rooms. The tile floors mean that you can hear every clip-clop of shoes and chairs being dragged etc, and unfortunately any nocturnal naughtiness can be heard in detail. We had retired couples next door to us until 2 nights ago, they must have left their pills at home, but the next couple were on a mission until 2 or 3 in the morning.", "title": "This place is awesome - 10/10", "helpfulness": 9, "user": "AndyandJo", "date": "April 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7285064, "likes": {"liked": "— Overall quality of the building, cleanliness and attitude of staff.", "disliked": "— Nothing"}}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 5, "variance": {"poor": 32, "average": 93, "very good": 306, "terrible": 16, "excellent": 725}, "aka": "Lopesan Villa Del Conde Resort And Thalasso Hotel Maspalomas", "slim_ranking": 0.5, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.5, "location": 4.5}, "description": "The Lopesan Villa del Conde Resort & Thalasso is excellently situated on the sea front on the south part of Gran Canaria, very close to Meloneras beach (300m) and just a few minutes on foot to the lighthouse and the dunes of Maspalomas Nature Preserve (800m). The 56,340m2, 5 star hotel construction reflects some of the most common characteristics from the canary Island traditional architecture and presents a similar structure to that of a welcoming town on the island, with a central square, gardens and charming stately homes with hanging wooden balconies. The spectacular reception is an authentic adaptation of one of the oldest churches on Gran Canaria, with two maintowers, a bell tower and central dome."}