{"user_rating": 4.0, "review_count": 999, "name": "Lord Elgin", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "This is an old hotel with good history and is very close to the convention center- a nice walk over - watch out for the bus when you cross the road - and walk through the mall if you don't want to walk the stairs. Close to the Market and Canal - great restaurants. The rooms are a little small and the only complaint would be how loud the showers/water is, unusually loud. Staff was friendly and the restaurant was good.", "title": "Solid hotel near convention center", "user": "Munnis01", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 134010711}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "Our family of four stayed here for three nights. We had a suite on the third floor which was enormous - wonderfully spacious. The suite had an extra powder room off the entry, a small kitchen with m/w, fridge, coffee maker, a very large closet, two tv's, a great master bathroom with jet tub, and we had lots of windows, which was great. The traffic noise from Elgin was pretty constant but not unbearable. It was fun to watch the Changing of the Guard procession up Elgin St in the morning. The location was perfect for us. There is a Starbucks in the lobby, and the restaurant downstairs seemed okay (we only ordered room service once but it was reasonable food and delivered quickly). We were close to everything we wanted to see. The pool and exercise room were great.", "title": "Great location, helpful staff", "user": "mkpoms", "date": "July 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 133995281}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled with family", "text": "There were a couple of minor issues: 1. Couldn't find any sheets for the fold out couch initially but this was very quickly sorted out by phoning the front desk. 2. The fold out couch was not of great quality, and was not very comfortable. I would have expected better in such a hotel. However, overall, staying in this hotel added to our very nice time in Ottawa. I would definitely recommend it to others.", "title": "Good value for the price", "user": "Jandaonvacation", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 133859443}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Not a great reception at the front desk, valet was slow. That's it for complaints. After that, the hotel is elegant but not stuffy. Very quiet for a great night's sleep. Nice cool oasis in the heat wave we encountered during our stay. Don't bother asking for an upgrade, the person at check in can't make the decision. Seems they have an issue when you ask for upgrades and a manager (i thought he was a manager but not sure) came running when we asked about an upgrade and whispered a quote to the clerk in front of us, who then gave us a ridiculous price. Really there's no need to upgrade. Our room was spacious, great view of the statues and activity on Elgin Street. Valet took a long time to bring our car around but were quick to credit us a valet charge when we spoke to them about it.", "title": "Good location", "user": "vanguy28", "date": "July 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133857264}, {"rating": 2.0, "stay_parameters": "Stayed June 2012", "text": "Stayed here in April 2012. The hotle is well located for business or seeing the sights around Ottawa. It is right across the bridge from the convention center. 5 min walk to the Rideau Canal or Parliament Buildings. An short walk or cab down to the Market where you can find all kinds of pubs and restaurants.", "title": "Old hotel. Guest services very un accommodating", "user": "JasonandJennifer", "date": "July 7, 2012", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 133721465}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My daughter attends the University of Ottawa. Every time we visit her we stay at the Lord Elgin. The service is excellent and the packages that include parking and breakfast make our stay easy. No worries ever about cleanliness or noise. Staying at the Lord Elgin is like stepping back in time to an era when staff welcomes you back and appreciates that you return time after time. The central location means we can walk where ever we need to go in the city. The bonus for me is Starbucks delivered to my room at the time of my choice in the morning.", "title": "Starbucks delivery and all the comfort one needs.", "helpfulness": 1, "user": "missbeenie", "date": "June 25, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132713533}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This is a very nice hotel, with excellent location, good service and nice facility. In addition to that, I have more comments. The reason is, while I stayed in the hotel, there was an incident , the side mirror of my car was damaged accidentally. The hotel was very responsible after the incident, payed for the replacement for the car mirror. I highly appreciate that, and want to say that this hotel really cares about customers.", "title": "Lord Elgin is not only a very nice hotel, but also very helpful, very reliable and very responsible.", "helpfulness": 2, "user": "Alice_Toronto_2000", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132547309}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This is a very good hotel and an old one in the city as it dates back to the 30s.", "title": "Very good", "helpfulness": 1, "user": "Ollivander1978", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132427682}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "It has a very central location, you are a step away from all there is to see and do in the city, staff is very helpful. Just be careful with the rooms as some are close to the A/C motors and so very noisy. We asked to be moved to a different room for that and there was no problem", "title": "Comfort & Location, location, location.", "helpfulness": 1, "user": "kerrv", "date": "June 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 132299341}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Perfect location to be in the heart of Ottawa to sightsee on foot. The preforming art centre is1/2 a block up on the opposite side of the road, which was ideal as we saw Gordon Lightfoot. We had a king room which was large and comfortable, although at the back of the building overlooking office buildings, but as we were there just to sleep, it was alright. The staff were very friendly and helpful, always asking if you needed help or directions for anything. The hotel is well maintained, clean and has an old world charm. $25. a day for valet parking which was very efficient. A good $4.99 bacon and egger 1 block down and left on Sparks, as breakfast was very pricey at the hotel. Would certainly stay her again.", "title": "A Bit of Old World in Ottawa", "helpfulness": 1, "user": "Logical_Traveler", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 132231913}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I have stayed many times at this hotel with Board members, convenient location and good university rates for the colleagues and myself. I have always tolerated the underservices such as the bar area and dining room, but easy to look past for a solid business hotel. This trip was a tipping point for me, one poor quality experience after another: After trying for a half hour to print in the business centr and being told use the other computer becuase that one is broken (and never getting our printouts),... to not having accesss to the public restroom between the bar and the business centre because they were locked - too many problems with homeless people sleeping in them... to being told during the last two minutes of the Habs playoff game, you have to buy a drink or move out of the bar, instead of 'would you like a beverage?'. Even the 200+ tween kids in the hotel I can manage. Having my $125 sun glasses go missing from my room and being told that it has NEVER happened in our hotel and there is nothing we can do - unacceptable. Very dissappointing and very off the travel list.", "title": "Dissappointed... and off the Ottawa option list!", "user": "UWaterlooTraveller", "date": "May 1, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 62972313}, {"rating": 5.0, "title": "Love it!", "text": "Clean, perfect location to all the attractions and will go back!", "helpfulness": 5, "user": "PMTR", "date": "April 14, 2010", "id": 61298627}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "We have stayed a few times now and every time we are always glad that we keep coming back. The rooms are spacious and quiet. It's definitely worth the extra money to get an executive room as they are the corner rooms so they are bright and airy and over the park, and internet and breakfast are included. Everything is clean and the housekeeping are very friendly, always greeting you and stopping to chat when you meet them in the hallways. Breakfast is great, lots of choices at the buffet and you are never rushed and take your time and read the paper. The hotel is within walking distance of everything but if your need your car the valet service has it brought around very quickly. So we will definitely be back again as I don't see any reason to go anywhere else.", "title": "Once again the Lord Elgin in tops", "helpfulness": 8, "user": "Philly413", "date": "April 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 61203663}, {"rating": 4.0, "title": "very clean and excellent service.", "text": "i would highly recommend the lord elgin for anyone visiting ottawa who wants good accommadations for a reasonable price and close to all the downtown sites and activities.", "helpfulness": 5, "user": "babbaganoosh", "date": "April 12, 2010", "id": 61135380}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "I went to a show at the nearby National Arts Centre and decided to stay at the Lord Elgin overnight (I live about 40 minutes from downtown Ottawa). I've been to this hotel before moving to Ottawa, and I wish other cities had places like this one. The price just can't be beat for the location, and service has always been top-notch. As an example, almost on all occasions I was there, there were road closures and detours (including this time), and staff was always very knowledgeable and readily provided driving alternatives. All of Ottawa's main attractions are literally a few footsteps away, and the hotel has many useful amenities too, like refrigerators in rooms, fitness centre, Internet, etc. Book early if you're going for the Ottawa marathon or the Tulip festival!", "title": "Time and again, this hotel is perfect on all fronts", "helpfulness": 5, "user": "elfy10", "date": "April 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60852983}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled solo", "text": "I stayed at this hotel for one night in May 2010. It is centrally located in the middle of Ottawa. You can walk anywhere from the hotel. The room was spacious and the bed was very comfortable. I requested late checkout and was able to keep the room until 2 pm. Then I checked my luggage and returned later for it. All the staff were very polite and efficient.", "title": "Great customer service and beautiful hotel", "helpfulness": 7, "user": "LikesToTravel333", "date": "May 31, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65956401}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "As a frequent traveller to Ottawa for both business and pleasure, I completely recommend this hotel for all. If you have business to do downtown, in the east end or in the west end of the city the Lord Elgin's location is convenient. By car, it is a 10 minute drive to Orleans or Kanata in the AM because you are against the flow of traffic. Same for the end of the day coming back downtown, and then you get to spend your evenings in downtown (which is amazing) instead of the suburbs (could be anytown USA).", "title": "Quality and excellence in downtown Ottawa", "helpfulness": 10, "user": "waygup", "date": "May 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 65661569}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "The hotel staff are simply some of the best I have encountered. In the the 30+ nights I have stayed here I have never been disappointed. During my last trip I was given attentive service like I have never before experienced, and it seems like the hotel is trying to put a little extra polish on everything. Decor is classic but not dated. The elevators have a nice touch to them, old school style.", "title": "A perfect stay in Ottawa", "helpfulness": 8, "user": "HollyCee", "date": "May 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 65376112}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "I was taking my mother out for the weekend as a belated mothers day gift and found the 'art lovers package' on this hotel's website. It was a great hotel, clean rooms, friendly staff, historic feel (but not outdated), great location, nice pool, and the cafe for breakfast was great. Our favorite thing to do was sit on the sidewalk patio and have breakfast every morning. It was also great that the starbucks was attached to the hotel!", "title": "nice hotel", "helpfulness": 7, "user": "happercamper", "date": "May 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63960444}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "This was my Mother's first visit to Ottawa and this hotel helped make it truly special!", "title": "A Great Hotel", "helpfulness": 6, "user": "Izzy7032", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 63764832}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "I combined a 2-day business trip and a 1 personal day in Ottawa with my husband, and we stayed in Lord Elgin for 3 nights. The location is great -- right downtown and near all the attractions (ByWard Market, Parliament, etc.). We took walks in the surrounding regions and really enjoyed the city. However, the hotel itself is fairly ordinary. What I don't like is the poor sound insulation. I was woken up by the neighbour's shower sound at 5am every morning. When the neighbour closed the door a little hard, we could feel our bed shake a bit! We were on the 3rd floor and the view outside our window was extremely ugly -- some ventilation installation on a lower roof and the rest of the view was completely blocked by the nearby high-rises. I would have thought for $170/+Tax per night we could have better stay than this. Valet parking was also very expensive $23/day, especially since we didn't use our car at all during the 3 day stay.", "title": "Good location but that's about all", "helpfulness": 1, "user": "CanadianTraveller100", "date": "June 25, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 68602801}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "We signed up for a City Package deal when I first booked the reservation. At check-in, I mentioned the deal (applicable only for the last day of stay), and the front desk told me that it would be delivered to me soon, but nothing happened. I had to remind them the night before check out, and they still hadn't prepared the package. After we waited in the lobby for 15 minutes, the front desk clerk delivered the package to us, very politely, but unfortunately, it was the wrong package! Anyway, things did get straightened out in the end, and the deal was good, but it wasn't a pleasant experience!", "title": "Nice accessible hotel in perfect location", "helpfulness": 5, "user": "wywk", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68490127}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled on business", "text": "Stayed there for 2 weeks in a wheelchair accessible room which met all the required standards. Rooom was nice and clean. Large bathroom with roll-in shower, nice king bed and desk. No mini-bar but they provide a mini-fridge and coffee maker.", "title": "Simply outstanding - this is a quality exceptional hotel", "helpfulness": 5, "user": "FCFireConsulting", "date": "June 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68112775}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Positives :", "title": "Awesome stay", "helpfulness": 5, "user": "rssmith", "date": "June 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67219467}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled on business", "text": "- Nicely priced for the level of service we received. One of the very few hotels in downtown Ottawa that offered accessible rooms with roll-in shower. The rooms were large enough and comfortable. Decorated to match the period and history of the hotel.", "title": "Wonderful Hospitality", "helpfulness": 6, "user": "nb_fiddler", "date": "June 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 66859271}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Great location but the room we had was extremely small for 2 adults with 2 suitcases. The room was very, very hot upon checkin and never cooled down even with window open and heat off therefore we found it very uncomfortable for sleeping.Starbucks attached to hotel but didn't open until 8 am!! Bar staff need some bartending lessons. Breakfast was great. Overall preferred the Sheraton which we stayed at for our return trip through Ottawa - rooms much bigger and in same basic location. Sheraton had Starbucks in the room and also served it at breakfast.", "title": "Bit of a disapointment for the money", "user": "kristine61", "date": "February 26, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 98154779}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Well situated hotel in the centre of Ottawa in easy walking distance, even in January, of main government office and Parliament. Very good service on reception, plenty of lifts. Good quality room - although lighting not very bright. Wired internet only in room, CAN$9.99. Reasonable value buffet breakfast; bar area not very appealing", "title": "Good value business hotel in the centre of Ottawa", "helpfulness": 2, "user": "AndrewWombat", "date": "February 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 97923749}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The location was good, being within 5 minutes of several major attractions including Parliament and the National Arts Centre and Byward Market only 12 minutes away. Many restaurants are in the area or close by. The hotel room was ok, room was a little crowded for two but had a nice sized desk, a small refrigerator that can be used for things other than a minibar. The bathroom was nice but the the toilet flusher was in an awkward position, under the counter and you needed to put all the seats down. The room was clean. The staff were friendly. Check-in and out were a breeze. The only real complaint would be that the elevators needed more cleaning. I would stay there again.", "title": "Nice location and room", "helpfulness": 2, "user": "DLRVancouver", "date": "February 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 97769399}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Looking at the other reviews, we were a little hesitant to stay here for Winterlude but were quite pleased. Front desk was courteous as were the rest of the staff. The Elgin was built in 1941 so it does have historical charm. The hotel room we were in looked like it was recently renovated. Mattress not too hard and not too soft. I sleep on firm mattress so the soft ones can cause me a lot of pain. Temperature in the room was fine for me, the wife and two kids. Of course the best thing about the Elgin is the central location and right across the street from the ice sculptures and the top of the Rideau canal.", "title": "Pretty good stay", "helpfulness": 2, "user": "condo6290", "date": "February 23, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 97659587}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "- hot tub was a more than welcome relief after a day of walking and skating.", "title": "Wonderful stay for Winterlude", "helpfulness": 2, "user": "2cuties4us2008", "date": "February 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 96727538}, {"rating": 3.0, "stay_parameters": "Stayed July 2012, traveled on business", "text": "I have no other complaint about this hotel except for the gym. The equipment is straight from the early 80's. And the carpet and wall paint match the age of the equipment as well. Poor layout of the machines (universal machine is a mile away from the free weight, separated by the treadmills and stationary bikes. Anyway, the whole place screams for renovation, and I lost any motivation for work out when I stepped into this place. Definitely not a section that should retain any of the \"old charm\" that is famous for this hotel. Not to mention how confusing it is that not every elevator can get to the fitness centre (basement) level.", "title": "Much needed updating for the fitness centre", "helpfulness": 1, "user": "AKLVancouver_Canada_", "date": "July 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 134637015}, {"rating": 5.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "By the way, I love the size of the pool that one can actually swim in. However, the on/off dial for the jacuzzi is on a wall that is far far away, you can't even see it when sitting in the jacuzzi. Some direction/placard on the location of the dial should be put around the jacuzzi area.", "title": "Wonderful weekend in Ottawa", "helpfulness": 2, "user": "sperro60", "date": "July 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 134607610}, {"rating": 4.0, "title": "Good location", "text": "My wife and I liked to come back to the Lord Elgin when we go to Ottawa. It is a nice and comfort independant hotel. The room are always clean, the staff is friendly, and good room service. The hotel is well located. We had an excellent dinner at the Gril 41, the hotel's restaurant.", "helpfulness": 1, "user": "Hgross88", "date": "July 17, 2012", "id": 134586629}, {"rating": 3.0, "title": "Convenient location, needs some updating", "text": "We stayed here for one night in mid-July 2012. Our room (615) featured a king bed and was located at the south end of the 6th floor. It was quiet for the most part, well decorated and clean. The bed was very comfortable. Hypoallergenic pillows are provied and upgraded pillows are available on request. Byward Market is about a 10 minute walk away, as are restaurants further south on Elgin Street.", "user": "EJF212", "date": "July 14, 2012", "id": 134378384}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The Lord Elgin is in a good location - near the convention centre, parliament, Byward market and more. One of the front desk staff was terrific - he gave us plenty of local advice and a warm welcome at check-in. I had a reasonable size room on the sixth floor but size turned out to be its best feature. Despite having two windows the room was dark and gloomy, mostly because of the decor. The hot water supply was poor - it could take 5 minutes or more before the shower reached a tolerable temperature. The air con was erratic - my room was stuffy all week despite the air con being turned to its coldest position and left on full, while colleagues complained their rooms were very cold despite having turned the dials up. The hotel has clearly upgraded some things recently - the furniture looked quite new and was decent quality, for example - but attention is needed elsewhere if the hotel is to give the building the style it deserves and to properly justify its prices. Wifi costs $9.95 a day extra which I don't think is justifiable, especially when you can only use one device at a time.", "title": "Beautiful hotel, awesome location", "helpfulness": 2, "user": "toddski", "date": "July 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 134147936}, {"rating": 4.0, "title": "Great Location for Visiting", "text": "During our three day two night stay we filled our days with tours of the Legislative Buildings and the Aqua Bus-'Lady Dive' The reception at the hotel was incredibly helpful with the concerage assisting us immediately with loads of information. The restaraunts complimentary breakfast buffet was incredible and our corner room had a beautiful view of the adjacent park. The only downside was the lack of upgrading and a sort of drabness to our room (for the price). For the location and being such a tourism catch, I would think the paint and furnishings in the suite would be a little more upscale. Staff were very approachable and friendly though. Our visit to this amazing historical town and it's glorioius sights far outweighed slight of decor. We may however choose a different hotel if visiting again.", "user": "Giltam", "date": "September 21, 2011", "id": 118411442}, {"rating": 4.0, "title": "I liked it.", "text": "The Lord Elgin is located within walking distance to most of the sites of downtown Ottawa, and a short jaunt to the Byward Market. The rooms were a good size nicely kept. I stayed there on business, and found the meeting rooms, ball rooms, etc. to be nothing special (if they ever are). The staff were very pleasant throughout my entire stay.", "user": "guybeachbum", "date": "September 21, 2011", "id": 118408476}, {"rating": 3.0, "title": "Great location, ok service, below average room", "text": "Although there are more esteemed hotels in Ottawa, the Lord Elgin made for a comfortable stay. I would not be disappointed to stay there again,", "user": "Nathatt", "date": "September 20, 2011", "id": 118371335}, {"rating": 5.0, "title": "Very comfortable, great location!", "text": "I visited the Lord Elgin on a business trip and stayed for several nights. Upon check in there was an issue with my credit card and the desk staff was apologetic but not particularly helpful. I was able to find a work around and went up to my room.", "user": "CSpringsDeb", "date": "September 17, 2011", "id": 118239862}, {"rating": 5.0, "title": "Great hotel!", "text": "The room was clean but small. The view was terrible (second floor view of a tree). I expected a better view since I had a park view room but was tired of dealing with the desk staff. The room did not include a microwave or refrigerator, helpful items for an extended stay. The television turned on but then would not turn off. I reported this but had to unplug it to go to sleep. The next day someone fixed the problem and it worked correctly the remainder of my stay. I was also promised free internet access due a group rate but was told I would have to accept the $10/day fee and then wait for it to be removed from the bill. It was removed but this was an inconvenient solution.", "user": "Lotty79", "date": "September 15, 2011", "id": 118170247}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "Excellen hotel, service was great, location was perfect, Valet service was excellent.", "title": "Wonderful visit", "helpfulness": 6, "user": "rhus1", "date": "April 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 60585319}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "This hotel is well worth the price, and location, location, location.", "title": "Friendly service and terrific location", "helpfulness": 5, "user": "Weerobbie", "date": "April 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 60473637}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "Pub grub can be had a D'arcy McGee's... great services and we were lucky to sit on the patio... in April...", "title": "Very pleasant stay", "helpfulness": 6, "user": "mteq", "date": "April 1, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 60100225}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Just park your car and walk everywhere,.. Sparks St. Byward Market, Museum of Civilization, Rideau Canal, Parliament Hill,", "title": "Historic, with efficient service", "helpfulness": 6, "user": "JulieJ8", "date": "March 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 59375192}, {"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled with family", "text": "The Front Desk is efficient and friendly. The rooms are very clean and comfortable with extremely good beds. The location is superb being right downtown near Parliament, the National Arts Centre, the Rideau Canal and the Ottawa River. I have stayed here numerous times for business and pleasure and will be going back again.", "title": "Stayed for the Week end", "helpfulness": 4, "user": "Charmaed", "date": "March 23, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 59341261}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Couple, early sixties, stayed here for two nights as part of a Canadian tour. Hotel overall was good but our room was at the back of the hotel and despite being a few floors above ground level there was constant noise (day and night) from the large bank of kitchen fans - not too noisy, but noticeable; rooms at the front of the hotel face the park and have a much better view. our room was of a good standard, clean and well maintained. there are many great eateries in the vicinity so we were spoilt for choice, and we didn't use the hotel restaurant. Staff were always very helpful. Overall a good hotel in a great location. we'd certainly stay there again if we visit Ottawa.", "title": "good hotel in a good location", "helpfulness": 1, "user": "JRPWashington_UK", "date": "July 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133571602}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Just got back from a 4-day visit to Ottawa, with my 15-yr old daughter and her best friend and we had an excellent stay at the Lord Elgin. Our room was clean and well-appointed; we were on the 3rd floor facing Confederation Park/Elgin street, so we were privileged to watch the march of the Guard to Parliament Hill every morning. As well, the Ottawa Jazz Festival was on so we were also treated to 1st-class music every night from the park!", "title": "Mini vacation in Nation's Capital", "helpfulness": 2, "user": "CazThomas", "date": "July 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 133167037}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The Lord Elgin is a small hotel, but it is big on service! All of the staff were superb. Our stay at the hotel added immensely to our time in the city and I would highly recommend it for anyone traveling to Ottawa for leisure -- the Lord Elgin is in the heart of everything one would want to take in while in town... steps from Parliament and Sparks St, a few blocks from the By Ward and its amazing array of restaurants, and a short (and pleasant) walk from key attractions like the Notre Dame Basilica, National Gallery and Museum of Civilization.", "title": "Another enjoyable stay at the Lord Elgin", "helpfulness": 2, "user": "BobD2011", "date": "June 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133033749}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Kudos and thanks to the Lord Elgin and its friendly team of service providers! We had a blast!", "title": "Overall a great stay", "helpfulness": 2, "user": "dbandbb", "date": "June 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 133027590}, {"rating": 4.0, "stay_parameters": "Stayed June 2012", "text": "As a fairly regular traveller, it is always nice to come back to a hotel with staff that are warm friendly and provide excellent service. One of the nicest sounds to a person's ears is that of their own name. Tammy in the dining room makes a point of getting to know repeat customers and makes a point to greet them by their first name.", "title": "Excellent hotel in the centre of things", "helpfulness": 1, "user": "kerlinso", "date": "June 29, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 133024999}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "The best word that comes to mind to describe this hotel is adequate. It is in a good location just a couple of blocks from Parliament and is a very clean albeit tired-looking hotel. The rooms are spacious and ours had a fridge and coffee maker. There is an indoor pool and hot tub (a requirement usually for us), however it was closed for most of our 3 night stay, which did detract from our enjoyment of this hotel. We also found it a bit noisey...the toilet flushing was the loudest I've ever heard and we often heard the doors to guest rooms slamming shut.", "title": "Good location, adequate room, good value for money", "helpfulness": 1, "user": "TO-KH", "date": "September 5, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 4.0, "service": 4.0}, "id": 117716746}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The valet parking was an additional $23 per night, which is typical for a big city. All the staff we encountered were helpful and friendly. All in all it was good value for the money we paid.", "title": "Great three day getaway - enjoyed it very much", "user": "duckymerida", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117533913}, {"rating": 5.0, "title": "Fantastic!", "text": "There is so much to see and do in Ottawa and we had a great time there. I was a little bit surprised at some of the nearby areas and how they seemed a bit questionable and seedy looking, but I guess that's life in any big city.", "user": "Ivan G", "date": "August 31, 2011", "id": 117518799}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Parked our car and spent two full days walking and enjoying the area. We used to live in Ottawa so it was fun reconnecting. Very good location - handy to many points of interest and Sparks street is a great place to hang out.", "title": "Nightmare at Lord Elgin!!", "user": "NovaScotianExplorer", "date": "August 28, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 2.0}, "id": 117353556}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "Two small complaints - one the fact that wireless was an add on - not included and we were not told when we reserved that the pool was not in service. Wish we had known that.", "title": "OK for price and location, but not for the food\"", "user": "BC_traveller154", "date": "August 25, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117255026}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband and I usually stay at the Chateau Laurier. However, this time, we chose the Lord Elgin, since he had a lot of work to do, and, unlike the Chateau, the Lord Elgin has a free business center. We chose an Executive Level room, and were pleasantly surprised to get a large, well-appointed, corner room with a lovely view of the major city sights, a large flat screen television set, a comfortable bathroom (a rare sight in Ottawa hotels, for some reason), and lots of room for our clothes. The room fee included a buffet breakfast for the two of us, and while nothing in the breakfast was extraordinary, the service was good (unobtrusive but friendly and prompt -- exactly what one needs in the morning). One small detail, when one is serving eggs to large quantities of people, they must be prepared in a rather bland manner. How about offering some hot sauce somewhere?", "title": "A good choice in Ottawa", "user": "ysolde", "date": "September 27, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118664835}, {"rating": 3.0, "stay_parameters": "Stayed August 2011", "text": "The front desk and and bell desk were friendly and helpful at all times. Many thanks.", "title": "Adequate hotel", "user": "ferrari07", "date": "September 26, 2011", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 118633296}, {"rating": 4.0, "title": "Nice but not over the top.", "text": "The location of the Lord Elgin is excellent -- it is at the heart of downtown Ottawa, near Parliament, the Tomb of the Unknown Soldier, the Sparks Street Mall, and other locations of interest to tourists. Views from the hotel are beautiful.", "user": "Kilgorie", "date": "September 25, 2011", "id": 118565764}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "The coffeemaker in the room is good and easy to use.", "title": "Just the sort of place you imagined it was!", "user": "flipandjude", "date": "September 25, 2011", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "location": 5.0, "service": 4.0}, "id": 118558802}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "There is also a Starbuck's in the hotel lobby, for those who need their quick cup of joe in the morning.", "title": "It was just right for us", "user": "pharmate", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118429482}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "Visited Ottawa for the great Winterlude festivities. Third time we have stayed at the Lord Elgin. Great location and decent rooms. Unfortunately this time we had a problem with the room keys - just about every time we tried to enter our room neither of our keys would work. So back to the lobby to wait in line behind people checking in or out. We wasted quite a bit of time in line. The same questioning/explanation was given - did you have it next to your Black Berry ? No we don't have a BB nor was it next to our phone or credit cards. Every time it was the same routine with some added possibilities for the failure even after we explained how many times this had occurred in our three day stay Never did they question that the room lock might be the issue. Our friends staying a few doors down had a similar problem but not quite as bad. I just wish the hotel staff would have thought about looking into the problem! I stay at many hotels with this type of key system and never have this problem. Fix your system!", "title": "Key to a good stay", "user": "Fondue4two", "date": "February 14, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 96642922}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Also $14/day for internet!? And no in room wifi!? I traveled all over Europe last fall for 3 weeks and only one hotel did not have wifi and it was all free. Free wifi is as essential as towels these days....", "title": "Tired hotel with tired service", "user": "DorashCalgary", "date": "February 7, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 95804577}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Firstly, I am unsure of the rates paid, as this trip was paid by a third party. So, I am unsure of whether there was value for the money.", "title": "The Lord Elgin is getting tired!", "user": "camsmom", "date": "January 31, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 95010227}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled solo", "text": "Check-in was terrible, with no thought paid to provide a 'system' that would satisfy those waiting to check in. Chaos was on display, with cars blocking the entrance, the doors blocked due to luggage and people everywhere in regard to attempting a check-in. After waiting 20 minutes to get to the desk, surliness met impatience! I was not impressed, but assumed that their day had been tougher than my flight, and gave the staff the benefit of the doubt. Unfortunately, every person at this hotel provided the same surly attitude throughout our stay.", "title": "OK", "user": "Softball1245", "date": "January 23, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 2.0, "location": 4.0}, "id": 94156180}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The room I was checked into was: cramped, tired, with rust showing on the hinges and appliances, poor faucets with dirt observable - all covered over by a semi-recent makeover - with wallpaper and furnishings attempting to take one's attention away from the old toilet and bathtub. Even the TV is a decade old, although encased in a 'nice' amoire. Walls were paper thin, and the front desk inadvertantly provided a wake-up call at 0530.", "title": "Do not book this hotel.", "user": "Jessimiah", "date": "January 20, 2011", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 93892983}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "My family and I were in need of a vacation as we have not been anywhere for the past 8 years. I booked a surprise getaway to the Lord Elgin for a 3 night stay, it was one of the best things I could do for my children. We enjoyed our stay so much at the Lord Elgin, the staff is amazing, they made my family and I feel like royalty, it doesn't seem to matter at this Hotel if you have lots of money or just trying to make ends meet, I noticed they treated everyone with class. I really hope someday to return and to make this place a regular vacation spot for us. A huge thank you to the staff, \"you are amazing\". Thanks again, Belinda Mclean", "title": "Royalty", "helpfulness": 1, "user": "Belinda M", "date": "September 13, 2011", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 118063232}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "When we had an opportunity to visit my son in Ottawa prior to the university school year, we immediately chose the Lord Elgin. We were not disappointed. The hotel staff were friendly and helpful. The room was clean and well appointed. Last time we had a room overlooking the park, but this time we decided to save a few dollars and get a back saving room. I think next time we will ask for a park view again.", "title": "Very pleased again!", "user": "Bob163", "date": "September 12, 2011", "detail_rating": {"value": 4.0, "service": 4.0}, "id": 118029672}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We had stayed here before and decided to return given the hotel had a special rate of $111 a night on hotels.com. It's a great building in a great location, and the service is solid. The rooms are starting to show their age but they're still decent. If you absolutely need a flat screen TV, then this isn't the place for you. The only thing I didn't like was the $23 valet fee. The hotel should supply a cheaper option, or cut the fee.", "title": "Can't go wrong", "user": "Oxxy909", "date": "September 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117980039}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "we stayed at this hotel for 2 nights at the end of August 2011. the room was clean and the beds very comfortable, the staff were polite and helping. I was particularly happy with the location, just 5 minutes walking to the parliament hill, Rideau canal and a bunch of other places one would want to check out during a short stay in Ottawa. will definitely consider staying there when visiting Ottawa again.", "title": "great location!", "user": "morelloc", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117876649}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "Have stayed here a few times and it is always first class. Staff is very friendly from the checkin people to the maids. Location is awesome we park the car and can walk to everything no need for cabs.", "title": "Love this hotel", "user": "mackster101", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117739004}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I had a very positive experience with this hotel. It has very comfortable location so you practically can walk to everywehere in Downtown. The park on the other side of the street is also a very nice place. If you get a room with parkview you can watch the change of the gurad parade right from your window.", "title": "Very nice hotel", "helpfulness": 1, "user": "NNork", "date": "January 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 93865291}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Hotel itself was very clean, had a small but pleasant pool. Overall, it was great, maybe nothing special or luxarious but definitely nohing to complain about either.", "title": "LOVED this hotel.", "helpfulness": 2, "user": "RoadTripMika", "date": "January 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93666423}, {"rating": 5.0, "stay_parameters": "Stayed January 2011", "text": "I was very happy with my satay and wouldn't mind to stay there again.", "title": "Even the locals love it", "helpfulness": 2, "user": "erinsunley", "date": "January 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 93650981}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with friends", "text": "We booked online and signed up for one of their packages. The room was gorgeous. The details were not overlooked. A nice little parcel with starbucks cards, chocolates, etc greeted us upon arrival. I had forgotten my medication in the car, and the valet was superb at helping me retrieve it. The beds were beyond comfortable, we were sad to leave them to go and enjoy the city. We were spoiled rotten in every way. The location was great, a nice walk to some key spots, a great view. Nice staff. LOVED IT!", "title": "Beautiful Historic Hotel!", "helpfulness": 2, "user": "Marg094", "date": "January 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93428226}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "The Lord Elgin is a great place to stay in ottawa. I can say as someone from the city it was a great place to have a get away close to all the fun downtown has to offer. No need to cab around close to great restaurants and shoping", "title": "Very nice and ellegant.", "helpfulness": 2, "user": "MattNovi", "date": "January 17, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 93325714}, {"rating": 4.0, "title": "Great customer service.", "text": "I just got back from a business in trip in Ottawa. We stayed at The Lord Elgin Hotel. Upon our arrival at the hotel we were greeted with a nice welcome from the bell boy. Our check his was smooth and the check in person was so friendly and informative. During our stay we ate our breakfast in the dining room. Our server was Tammy, OMG she was amazing. I am a manager of two pubs so I know about custome service. If I lived in Ottawa, I would go to The Lord Elgin for breakfast just to have a great experience. I highly recommend this hotel to anyone going to Ottawa. Also Rideau Mall is basically accross the road along with Rideau Canal if you want to go skating.", "helpfulness": 2, "user": "Judy19641964", "date": "January 14, 2011", "id": 92875172}, {"rating": 3.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The rooms here were small but comfortable but a little bit noisy. Nothing really outstanding about the place. We arrived late in the afternoon and the restaurant at the hotel was full and we couldnt get a meal. Location is good. A couple of blocks walk in the snow to the nearest food outlets, and easy walk over to the Rideau Canal, markets, parliament house etc", "title": "average hotel", "user": "Delco63", "date": "January 12, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 92710965}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "I just read a terrible review of the hotel from a hockey parent who thought they should be able to meet in hallways and drink in public places. No I would not appreciate any of that as a regular guest of the Hotel. I have always found the staff to be professional, respectful and rooms both quaint and modern. I often travel alone and very much value the peace and security of the Lord Elgin. As a professional business person I do not want to have to step over a drinking party to get to my room. By all means sir, go to the best western, A hockey camp in the hallway is hardly the stuff of a respectable hotel. I wonder what example it set for the children to have your hallway parties and complaints so noticable that staff had to call the constabulary. I would be embarrased to put any hotel staff to such measures rather than accept the conditions and rules of hotel guests. Buying a room does not entitle a consumer to ruin the stay of other guests or abuse the hospitality of the hotel. I certainly will choose the Lord Elgin again precisely because they were not amenable to the conduct you describe in your criticism.", "title": "Gracious and without pretention, quality service and respect", "helpfulness": 2, "user": "kathleen011", "date": "January 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 92599613}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The service we received at the front desk was outstanding. The clerk was friendly, helpful, and funny. I was immediately made to feel welcome. The rooms were clean, tastefully decorated and a decent size. The bathroom was a good size too. The room had a bar fridge also. The pool area was clean, a bit dark, and lots of towels were always available. We were across from the National Art Centre, in close walking distance to Parliament Hill, the Rideau Centre, and Sparks Street Mall. We would have ventured further but it was quite cold so we drove to further locations. Valet parking was only a problem one evening when we were ready to come back to the hotel but there were so many cars waiting, we drove to a restaurant and came back later. The only thing that would make it better is breakfast included.", "title": "A clean, family friendly hotel in a good location.", "helpfulness": 1, "user": "OntarioKerr", "date": "January 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 92186626}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We have had some very good experiences at the Lord Elgin. It's an old-fashioned style hotel with a central location for downtown Ottawa, Parliament, the Rideau Center, skating on the Canal, etc. It's very reasonable. Some rooms are quite small but nicely appointed; some are larger. The valet parking is convenient. However this time was NOT pleasant. We came for a romantic getaway on New Year's Eve for two nights. We paid to upgrade our room and ended up in 330 right near the elevator and conference room where scores of young hockey players were running around and screaming til all hours. We lived with it on New years' Eve because we were out fairly late, but the next morning I asked about it at the front desk and was told they would still be there that night. I asked about moving our room and was told we could call and complain if the kids made noise and then grudgingly that it might be possible to move rooms (despite having been told when we arrived that most people were leaving on Jan. 1). We called twice to complain that night, to no avail. When we checked out there was no apology or concern of any kind. We realize that it's good business for the hotel to have all those kids staying there, but they could do a lot more to isolate them from others and especially to show some concern for ruining the time of adults wanting to get away from stress at home. We are loyal customers when treated well, but will think twice before staying at the Lord Elgin again.", "title": "Nice, traditional, well-located hotel with mediocre service", "helpfulness": 2, "user": "delia25", "date": "January 6, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 91953526}], "location": {"country": "Canada"}, "stars": 3.5, "variance": {"poor": 53, "average": 168, "very good": 415, "terrible": 24, "excellent": 339}, "aka": "Lord Elgin Hotel Ottawa", "slim_ranking": 0.283582089552, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "description": "One of the nicest Ottawa hotels and ideally located in the heart of downtown Ottawa - directly across from Confederation Park and the National Arts Centre. The Lord Elgin Hotel - steps away from the Rideau Canal, Ottawa Congress Centre, Parliament Buildings and the Ottawa Rideau Centre.Guestrooms reflect Ottawa's elegance. From the tall picture windows, bold tulip inspired artwork, to Biedermeier style luxury furnishings, you cannot help but feel pampered. Ottawa hotel guests enjoy the lap pool with adjoining whirlpool, sauna and fitness."}