{"user_rating": 3.5, "review_count": 1768, "name": "Los Zocos Club Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "The hotel was nice. we stayed all inclusive for a few days and self catering for the rest as we like to try different places to eat. The all inc food was good, cant complain, lots of choice. the entertainment was definately aimed at the families, but as we went with two young kids, it suited us fine. The apartments are basic but clean and the maids come regularly. The staff are all nice and the kids club was lovely, our little one liked it alot. The town is nice also, plenty of bars and restaurants to go to. All in all, a nice place. Would return.", "title": "Nice place", "helpfulness": 1, "user": "sj_hrl", "date": "February 19, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 124820912}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "Excellent Hotel & Facilities, Kids Club made my lads 3 & 11 welcome, Food Outlets & Restaurants could have been better, but a fantastic base in a fantastic resort", "title": "Excellent", "helpfulness": 2, "user": "wba5dingles1", "date": "February 18, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124763335}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We were met by an overwhelming stench of cat pee at reception - yuk!! Luke warm, bland and repetative food - however, slight improvement in the Boulevard restaurant - if you can get past the awful smell of the ever present cat pee odour (to be fair, we complained and the whole restaurant was deep cleaned). That said, the night after the smell was back. Very tired rooms with extra charges for TV, use of safe (!) and even kiddies high chair in room and no towels available for use by the pool. Staff are very hard working and pleasant but they need to get rid of those damn cats!!", "title": "Great place ...... if you like the smell of cats!!", "helpfulness": 2, "user": "loulouMuscat", "date": "February 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 124688239}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My son and I wanted a bit of winter sunshine. We found Costa Teguise a lovely resort.. We stayed 4 nights at Los Zocos self catering.Lovely having sunshine without mosquitos.", "title": "A perfect cheap sunshine winter break.", "helpfulness": 3, "user": "Happymum1_11", "date": "February 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124462667}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Accomodation was clean and new. Facilities included a very efficient fridge and kettle microwave and small stove.We ate out which was very reasonable at a variety of restaurants.", "title": "Distinctly average", "helpfulness": 2, "user": "C B", "date": "February 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 124396852}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The apartment was very spacious including the fridge. Outlook over the pool with mountains beyond. Plenty of swimming pools and one for people who prefer the quieter more relaxing surroundings without piped music and \"animation\". Lots of English guests as it is used by First Choice. All inclusive available but self catering gives you the opportunity to venture out to many excellent restaurants nearby.", "title": "Recipe for a good stay all at Los Zocos", "helpfulness": 5, "user": "awebster48", "date": "January 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123932486}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The square has live music nighlty whilst you enjoy a cheap beer or tasty meal al fresco,and a craft fair a couple of times a week. The public bus stop is outside the hotel that takes you to Arrecife, Puerto del Carmen every twenty minutes and Teguise market on Sundays. It's just a four minute walk to a fabulous beach and promenade that takes you around the coast for a few miles. Daytime was warm when the sun came out but cold in the evening. Reasonably priced hotel with option to take all inclusive deals on a daily basis. It was very quiet generally with fewer holidaymakers. In this economic climate, all inclusive is becoming more popular but the downside to this is that the restaurants and pubs are fighting to survive and not all are succeeding. The streets are in danger of becoming ghost towns as we all stay in the hotel as \"value\" addicts.", "title": "Quiet but not remote, basic but clean.. all good!", "helpfulness": 11, "user": "hannahlove7", "date": "January 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123783641}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "I recently got back from a week in Lanzarote at Los Zocos. This is a resort of the 'cheap and cheerful' variety and so i was a little nervous about what to expect. We went self-catering, and had a 1 bedroom apartment on the ground floor. Our apartment was of a decent size and had an outdoor terrace area, kitchenette, and separate bedroom and bathroom.", "title": "Excellent location, clean, well laid out and friendly, reasonable price", "helpfulness": 13, "user": "BlueClearSkies", "date": "January 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123609067}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "Whilst cheap, the quality of the hotel in general was above the standard of hotels double the price here in the UK. It was very clean and comfortable, no nasty surprises, and the beds were very comfortable. There was a large safe which could be used for an extra 18euros a week which was great for storing my camera and laptop when i wanted to stroll to the shop to pick up some food. The grounds of the hotel are well maintained and they seem to have a lot of staff on duty at any one time, we never had problems getting anyone to deal with any queries we had. Our room was cleaned 5 times over the week.", "title": "the great los zocos", "helpfulness": 3, "user": "1207_11", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123293249}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "As a resort, it was extremely quiet when we were there. It made a great base from which to explore the island, but i'm not sure it's a place i'd like to be 'all inclusive' and simply stay put within the resort, purely because it was so quiet when we were there we would have been bored silly. I see from other reviews that it can get rather more busy, so we must have hit it at a rare quiet time!", "title": "Great family hotel", "helpfulness": 14, "user": "A Z", "date": "January 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 123274065}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Our check in was fairly quick, however the women behind the desk could have probably halved the time if they hadn’t been chatting to each other instead of sorting out their customers. Wasn’t a huge problem though and none of the bar staff or waiters/waitresses did this. The safe was 28 Euros for the week, 10 Euros is given back to you when your return the key. I was really pleased we were put in block one as I had emailed to request it after reading some reviews on here. I’d definitely recommend block one, it is in the sun morning, noon and night and we found our balcony the best place to sunbathe as completely sheltered from the wind.", "title": "Nice food, nice atmosphere, a lovely holiday", "helpfulness": 7, "user": "kayliesteve", "date": "February 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125119418}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The room itself was very substantial, kitchen area was clean and had a fridge, toaster, kettle, microwave and plenty of utensils although we were all inclusive so didn’t use much of it. Nice modern dining table and benches, very comfortable large L shape sofa, TV with no free English channels (yet there was 1 free German channel and plenty of Spanish) charged at 4 Euros a day, and some nice pictures on the walls. Bedroom was 2 single beds pushed together with single bed sheets; we had a couple of lumpy pillows but if it had been a problem I have no doubt they would have changed them for us immediately. The bathroom had a nice walk in shower, sink area and toilet. Our bathroom door kind of opened onto the toilet which was a little annoying. The towels aren’t very big which didn’t bother us but may some people. The cleaners did a fantastic job, they clean every day except Mondays & Fridays, they even folded up my PJ’s for me and washed our glasses which I thought was above and beyond their duties.", "title": "Honest review from a seasoned 3*AI traveller", "helpfulness": 3, "user": "K_POTTERS", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125043117}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We didn’t lay by the pool area as its quite open so was quite cool and windy the week we stayed, but both pool areas looked clean and well maintained. The water was freezing, but it is winter and plenty of children still went swimming every day. There are 2 pool areas, one near the bar and with music and entertainment for both adults and children and one with no music or entertainment. There is a crazy golf area, Tennis courts, pool tables, air hockey tables and table tennis so plenty to do if you get restless. The pool bar was open from 10am until 8pm and served hotdogs, burgers, chips, pancakes, rolls & a variety of salads every day. You can help yourself to juice, beer, fizzy drinks or ask the staff for any other drink you want. The pool bar was very nice inside and had plenty of seating.", "title": "dont listen", "helpfulness": 6, "user": "kaye m", "date": "February 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125024699}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The main restaurant ‘El Mirador’ is where you get your breakfast everyday, and is also open for lunch every day. You have your dinner in here on a Tuesday, Thursday and Sunday. The other restaurant ‘Boulevard’ is where you have your dinner on the Monday, Wednesday, Friday & Saturday. We preferred El Mirador, but both are nice serving a wide range of food, always with some fresh meat and fish on offer, soup, salad, fruit, pasta, rice vegetables, potatoes, chips, pizza, children’s dishes and desserts. Boulevard has different areas serving Asian food, Italian, English and Spanish dishes. The Boulevard restaurant has the big ship bar which looked very nice and has evening entertainment on the nights it’s open. Personally I preferred the lunch times in ‘El Mirador’ to all the evening meals, but all in all its very nice food and we were happy to be all inclusive.", "title": "Booooring", "helpfulness": 4, "user": "katusaAtlanta_GA", "date": "February 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 124983987}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "The main bar ‘Aguamarina’ has plenty of very nice comfortable chairs around tables, nice lighting and evening entertainment. Plenty of choice of all inclusive drinks and cocktails, the shots of alcohol are huge I had to ask for small shots! The canary Island local beer ‘Tropical’ is very nice according to my partner who managed to drink lots of it! The children’s entertainment (which includes a lot of screaming) runs until about 9-30pm and is then replaced with entertainment for the adults too there is a variety from bird of prey shows to Michael Jackson tribute. The bar staff in here are very efficient and clear the tables regularly. I particularly liked the little short lady with short dark hair and glasses; she remembered what we had to drink and got it straight away for us. There is a door through to the ‘chill out’ bar where you have to pay for drinks, but it is away from the screaming a bit more. We never actually saw any staff in there, but there were very few people using the bar and I think most had taken their all inclusive drinks in there with them.", "title": "Value For Money", "helpfulness": 3, "user": "charlie9", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124905765}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "had a really good time here. some staff could have been more helpful but the majority was helpful :) cleanliness was pretty good... fab for kids so much to do and the acts that we did see where brilliant. would most probably stay again had a lovely time and met some really nice people x", "title": "our stay", "helpfulness": 2, "user": "siobhanxmarie", "date": "February 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124366880}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "i have just spent a week at los Zocos and can honestly say the staff were all very efficient and happy to help- the room was cleaned and towels changed o9n 5 of the 7 days and the maids were pleasant and friendly", "title": "very good service", "helpfulness": 3, "user": "karen M", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 124351762}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The appartments are welll positioned for everything in the area and with a bus stop outside it is easy to investigate the island without a car", "title": "Excellent Holiday, really friendly staff, very clean", "helpfulness": 7, "user": "Marianne070", "date": "February 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124312264}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Stayed at Los Zocos November 2011 and were so pleased, went back and stayed again this year. The hotel is very clean, all the staff are helpful and everyone speaks or acknowledges you. Stayed in block 2 which meant we had the sunshine on our balcony from 9.00am - 4.00pm every day and the pool we were facing never had more than 5 - 6 couples at it (Kids pool area was behind us) so it was very quiet. There is a good range of food - ok, it is not always as hot as you would have at home, but this is typical and there is a microwave for you to use. Variety included steaks, roast beef, pork chops, prawns, and good vegetarian options. Beach is just across the road and through the small shopping centre opposite the hotel.", "title": "Very surprised - excellent short break", "helpfulness": 8, "user": "JanCgled", "date": "February 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124251275}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "After reading a few slightly negative reviews about Los Zocos, I was a little apprehensive....I really don't know why. To the people who made negative reviews about this place - I ask - what exactly did you want? The staff were very friendly, the appartment, although not one of the ones that had been through a refurb yet, was excellent (i had emailed and requested a ground floor near the quiet pool and that was exactly what we got), the food (we were all inclusive) had received some negatives reviews, but could not have been better. Yes - it was a similar menu every day both lunchtime and evening - by that, I mean ALWAYS a few fresh pasta dishes with a couple of different sauces, ALWAYS fresh griddled meat or fish, ALWAYS a multitude of salads, veg, pizza, chips, fresh bread, chinese, soup, full english or continental breakfast etc. A mixture enough for everyone. We had the most delicious fresh tuna streaks, pork chops etc.", "title": "Perfect for a short break", "helpfulness": 4, "user": "TheSmiths05", "date": "February 1, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "location": 5.0, "value": 4.0, "rooms": 4.0}, "id": 123984443}], "location": {"country": "Spain", "continent": "Europe"}, "stars": 3, "variance": {"poor": 162, "average": 432, "very good": 631, "terrible": 118, "excellent": 425}, "aka": "Los Zocos Costa Teguise", "slim_ranking": 0.55, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 4.0, "location": 4.0}}