{"user_rating": 3.0, "review_count": 8, "name": "Los Jitos Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled solo", "text": "I give this four stars though I am trading off some niceties for price. These are budget accomodations, and therefore are not beautiful. Note there is no longer a night club there, so it was quiet and relaxing. The management seems to understand keeping everything functioning is important. This was fine. But every patch in the wall or ceiling was left as is without painting over to make it blend in again. The jacuzzi doesn't work. The pool on the roof could be beautiful and the view is great, but it is plain. The staff was very nice. There is everything you need around you. If you like visual appeal, you will be disappointed. But if you are fine with a clean, spacious room, you will feel like you got a bargain.", "title": "Not luxury, but a decent stay", "helpfulness": 3, "user": "bakphoenix", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 166572528}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled solo", "text": "I chose this hotel because the site said it had a spa. Upon arrival, I was told it had closed down. Fortunately I found the San Carlos Wellness Center on the main highway, behind the Sagitario gift shop... a true gem of a place where Margarita gives excellent spa treatments, which are much cheaper than those at the San Carlos Plaza and the Paradiso.", "title": "No, No, No", "helpfulness": 6, "user": "phoenixvoyageur", "date": "October 21, 2008", "detail_rating": {"cleanliness": 2.0, "front_desk": 4.0, "location": 3.0, "value": 2.0, "rooms": 2.0}, "id": 21050940, "likes": {"liked": "— location", "disliked": "— Lack of security"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I would not stay at this hotel again.The desk staff was great BUT.... The open plan design means that the hotel corridors are open to anyone who wants to wander in and the room locks are not secure enough... no dead bolts.( Some rooms have glass patio doors with one lock, others have flimsy wooden doors with one lock ..( metal keys not plastic ). I experienced a child running up and down the corridor outside my room, screaming and screeching loudly at 11 p.m. at night. I had a couple of bugs in the room ( no idea what they were - not roaches or crickets ...dark brown and an inch and a half long), no hot water at the bathroom basin, a dirty bath mat, a huge crack in the glass coffee pot, shabby room ( peeling plaster on ceiling),etc. Yes, it was cheap($44.00 a night ) but you would be better off spending an extra $12.00 a night and staying at the Best Western,( which I did for 2 nights), which is cleaner and newer, has a continental breakfast,better security,great desk staff, a decent bar /restaurant overlooking the ocean, and throws in a couple of free margueritas.", "title": "Horrible bed", "helpfulness": 8, "user": "NurseKathy", "date": "September 24, 2006", "detail_rating": {"front_desk": 3.0, "business": 1.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 1.0}, "id": 5833301, "likes": {"liked": "— price", "disliked": "— bed/ no hot shower"}}, {"rating": 1.0, "title": "Think Twice BEFORE You Stay Here", "text": "The office staff were polite and helpful and provided a wake-up call when we asked. Negatives: the bed was rock hard; it was like sleeping on a box. The air-conditioner was great until the last night when it appeared to freeze over and only put out a little cool air. There was only occasional lukewarm water in the shower, coming out in sputtering stream.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "April 10, 2006", "id": 4956676}, {"rating": 3.0, "title": "Exploring San Carlos", "text": "We paid only $44/night but will not stay here again. They definitely need to put more money into this place and add satellite TV which would provide a little entertainment.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "April 29, 2005", "id": 3424101}], "location": {"country": "Mexico", "region": "Northern Mexico"}, "variance": {"poor": 3, "average": 1, "very good": 2, "terrible": 1, "excellent": 1}, "slim_ranking": 0.75, "description": "We are a located in downtown San Carlos, in the upper part of Los Jitos Plaza, a beautiful plaza with a typical Mexican style. •We offer Standard Rooms and Junior Suites. • King Size or Double bedsOur Junior Suites with a kitchen•View to the plaza• Air Conditioned• PoolServices and Amenities:• Guest Services desk• Convenient self-parking."}