{"user_rating": 4.5, "review_count": 937, "name": "Lost Iguana Resort & Spa", "reviews": [{"rating": 4.0, "title": "Probably the best in the area", "text": "My girlfriend and I stayed at the Lost Iguana for 4 nights, and were very pleased with our stay. We stayed in the deluxe suite (#36 Tucanes) on the second floor. The room was quite large with an unbelievable view of the active side of the volcano. We had no insect invasions with the exception of a firefly, and several tree frogs came to visit us each night in the balcony. The room was kept clean, and the odor (I think from the humidity) that several people noted was minimal in this room at its worst, and after the first 5 minutes was forgotten completely. Our only minor complaint about the room was that the doors to the balcony and jacuzzi were difficult to get closed and sometimes blew open when the wind really picked up.", "helpfulness": 9, "user": "Exotvet", "date": "January 28, 2007", "id": 6711420}, {"rating": 4.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The buildings are atop steep hills, with the parking lots about midway down the hills, but weren't terrible and there was always a hotel employee zipping about in a golf cart looking to give people a ride. Considering that most people coming to Costa Rica are doing at least some hiking, this shouldn't be an issue at all.", "title": "Loved the room, not the service!", "helpfulness": 10, "user": "jakeodog", "date": "January 26, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 6699395, "likes": {"liked": "— The room", "disliked": "— the service"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006", "text": "Our sole major complaint was about the staff. Most appeared to be 15 years old, and almost none seemed to know much about the hotel itself. We knew what tours we wanted to book in advance (they're advertised on the hotel's website), but it took some effort to get the front desk to figure out how to arrange them. They were also unable to give us directions back to San Jose, and we were advised to buy a map in La Fortuna instead. Additionally, when we went to the restaurant, the waiters were insistent that we sit at a volcano view obstructed 2 person table, even though only 1 of the other 20 tables was occupied because they didn't want to have to remove the extra 2 place settings from the 4 person table.", "title": "Staff doesnt have a clue !", "helpfulness": 17, "user": "gs8", "date": "January 19, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "location": 5.0, "rooms": 3.0}, "id": 6622849}, {"rating": 1.0, "stay_parameters": "Stayed January 2007", "text": "With a better trained staff, this would be a 5 star rating. I've stayed at Tabacon, and this is far prettier (although less organized). The volcano view is unparalleled, the rooms are lovely, and wildlife abounds on the hotel's property. On our last day there, the volcano erupted during breakfast and we spent the entire day on our balcony, watching the explosions and a pair of white hawks playing in the sky. An exceptional ending to our vacation.", "title": "no service no hospitality, enough said", "helpfulness": 24, "user": "zlygoidy", "date": "January 16, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 6606525, "likes": {"liked": "— nothing", "disliked": "— the attitude"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "PS - If you go to Arenal and don't take the Cano Negro boat tour, you're insane. We saw more animals in 15 minutes than in all of the other 8 days of hiking through Monteverde and Arenal.", "title": "Quaint place: serenity, beauty, peace", "helpfulness": 18, "user": "harrison4", "date": "January 15, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6599742, "likes": {"liked": "— the outstanding views and spacious balcony", "disliked": "— probably its distance from other locales--although that added to its charm"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Our family of four stayed here three nights over Christmas. Overall, the place was pretty nice and we had good service. Based on what we were looking for, however, I think that we would have been better off at Tabacon.", "title": "Nice, Not Great", "helpfulness": 25, "user": "Jeff K", "date": "January 12, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 6582188, "likes": {"liked": "— The room.", "disliked": "— Location."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We stayed at the Lost Iguana primarily because the of the quality of the rooms and the view of the volcano. The rooms are large and generally pretty nice. We did see several examples of shoddy construction that others have mentioned, but nothing major. The view of the volcano didn't pan out as it was cloudy and rainy during our entire stay.", "title": "Our favorite hotel of our Costa Rica vacation", "helpfulness": 4, "user": "kentisland", "date": "January 8, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 4.0}, "id": 6565123, "likes": {"liked": "— Beautiful, comfortable deluxe room", "disliked": "— very hilly"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We thought that the restaurant was pretty good. The complimentary breakfast was fine. We also ate dinner there one night. The food was good and reasonably priced (e.g. pasta dishes were around $10 - $12).. Service was outstanding.", "title": "Hidden Gem", "helpfulness": 3, "user": "J&K-2Illinois", "date": "January 8, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6564982, "likes": {"liked": "— Friendly, accomodating, excellent room,delicious food and amenities.", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "We were really irritated on Christmas when the restaurant discontinued room service without advance notice, and only offered a buffet for $30 each. We were only interested in a light dinner and were forced to have to make the drive back in to La Fortuna to get some sandwiches.", "title": "Lost at the Lost Iguana", "helpfulness": 2, "user": "hillerlee", "date": "January 2, 2007", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 4.0, "cleanliness": 5.0, "value": 2.0, "location": 3.0, "rooms": 4.0}, "id": 6540917, "likes": {"liked": "— the food and the atmosphere", "disliked": "— front desk/reception area/internet access"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2006", "text": "I think Tabacon might have been better for us because it's closer to town and there would have been more to do for our teenage children. Tabacon's also layout looked better. We got a little tired of having to walk up and down the hills to get anywhere at the Lost Iguana, particularly with the frequent rains.", "title": "Almost great", "helpfulness": 1, "user": "erictcove", "date": "January 1, 2007", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6534239}, {"rating": 5.0, "stay_parameters": "Stayed September 2005", "text": "I am a world traveller and this hotel and its amazing view of the volcano early in the morning while lying in bed is surely one of the highlights of my life. It is a bit out of the town of La fortuna so you will need preferably a small SUV(not a sedan) to navigate the road conditions and travel the steep inclined and curvey roads from both San Jose and La fortuna. This is truely one of the more fantastic hotels of the world and you will realize how fortunate you are to have stumbled on to this hotel and the energy around it. After this visit, we drove to the central pacific area, more specifically, Quepos and Manuel Antonia National Park and stayed in an overly priced hotel. This area is overrated and too commercial unless you are a surfer or an older type who wants luxury.", "title": "Shangra-La", "helpfulness": 9, "user": "calmkey", "date": "October 10, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4004539}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My wife and I visited this resort recently and had a real nice romantic getaway. The staff was courteous and the accommodations fantastic. Loved the view of the Volcano. Highly recommended for couples......5 Stars!", "title": "Great Romantic Getaway", "helpfulness": 1, "user": "Miles H", "date": "September 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118697275}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Wow!", "title": "june stay", "helpfulness": 1, "user": "victor a", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 118409680}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "The website doesn't do the Lost Iguana justice. We picked the resort", "title": "great for group trip!", "helpfulness": 2, "user": "sarah ann p", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118388356}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "because of the reviews and the good summer prices. When we arrived we", "title": "An appendage of It's inviroment", "user": "Seaskisiren", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118377150}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "were amazed... The landscaping is jungle paradise and all the roads", "title": "Great Getaway, Really Enjoyed!", "helpfulness": 1, "user": "mfh435", "date": "September 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 118369296}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We had a suite with a view of Arenal and an open air shower. The hotel has a great pool, bar and restaurant. The hotel has a hiking path through it's forest that has places marked to see bats and a stream. This was perfect for a couple looking to go hiking and have some quiet time in private away from the tourist zone.", "title": "Fantastic- lodges in a jungle with views of Arenal", "helpfulness": 1, "user": "Michelle M", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129069264}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We just got home from our trip to Costa Rica and my husband and I absolutely loved our 3 nights at the Lost Iguana. It's such a special place and words can't really do it justice. You feel so remote, like you're really experiencing the best of what the Arenal area has to offer. The grounds are lush attracting all sorts of wild life...we saw SO many hummingbirds (and many other species), lizards and butterflies.", "title": "Great Views, Great Staff", "helpfulness": 3, "user": "natalieaz9", "date": "April 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 129011069}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Hotel -", "title": "All around great place.", "user": "0-Excelsior-0", "date": "April 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129000114}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "The staff was amazing, they were all so nice and helpful. From letting us a hitch a free ride with the staff to La Fortuna to the amazing wait staff. We just felt very comfortable the entire time we were there, I was actually sad to leave! We really enjoyed the entire staff, especially Nancy :) You will get the most amazing views of the volcano from this hotel, it was truly spectacular to wake up and look out the window. I will say that the volcano has not been really active for quite awhile, so if you are expecting to see lava I wouldn't hold your breath. But it's amazing with or without lava. The rooms are cute, exactly what I would imagined...not frilly, but cozy. The pool and restaurant are great, I really have nothing bad to say.", "title": "Beautiful Hotel in an Amazing Place", "helpfulness": 1, "user": "moonjelly", "date": "April 27, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128950145}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Activities -", "title": "Thoroughly Enjoyed the Lost Iguana Location, Facilities and Staff", "user": "Nathan C", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 128563546}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My husband and I had a luxury suite with a deck overlooking the Arenal Volcano--what a magnificent view. The seclusion, the views of the volcano and the rainforest, and the wood lodges made for an especially romantic setting. The hotel hooked us up with all of these fun activities--canyoning, zip lining, hiking, etc. We stayed in at the resort for a couple of days too, during which we mainly lounged by the pool; one of the pools is heated with seats in the water that are at the bar! On top of that, happy hour is from 3-6. We also spent some time at the spa, which was every bit as relaxing as they make it look on the site, with the sound of nearby streams filling the air around you--so peaceful. The food was really delicious too--lots of different options, even for people like us whom do not eat meat of shellfish. One of the nicest things about this resort, though, was the service. Everyone who works there is so nice and helpful. Altogether, it made for a trip that was adventurous at some times and utterly relaxing at others.", "title": "Time stands still at this place", "user": "Shelly R", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129237156}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The hotel's web site does not do it justice. The 40 some rooms are spread over a large amount of land with beautifully landscaped grounds. All the buildings have jaw dropping views of the volcano and curving trails that go from rooms to the restaurant and pools. We truly felt like we were in paradise.", "title": "Incredible Setting", "user": "William s", "date": "May 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129232662}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Half of the land is primary rainforest and has natural trails that can be a bit strenuous at points. But definitely worth the effort. Take some water and snacks and sit and enjoy the river when you want to rest. We also went to Hanging Bridges which we enjoyed, but preferred the hotel's trails since they were so private. We went twice and never saw anyone on the trails even though the hotel was full.", "title": "Lost Iguana Resort", "helpfulness": 2, "user": "hellen73", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 129205357}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "The staff was lovely. Very friendly and went out of their way to help with tours and special needs in the restaurant. We did not use the bar, but it was a popular spot in the afternoon. We talked to guests at dinner who told us the spa was amazing but we were not there long enough to try it.", "title": "Hated to Leave", "user": "Mori H", "date": "May 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129151674}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "We will definitely go back and plan to stay longer.", "title": "Awesome rainforest location", "user": "saxj", "date": "April 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129090045}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "We stayed here one night after driving from Alajuela, and it's quite the drive to the secluded hillside resort. The staff was very nice and the resort itself is beautiful and there are fantastic views of Arenal Volcano. I couldn't recommend this place highly enough if you want an out of the way romantic stay with views.", "title": "Very Cool Place", "helpfulness": 3, "user": "mattnla", "date": "July 29, 2005", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "service": 5.0}, "id": 3718862}, {"rating": 5.0, "stay_parameters": "Stayed June 2005", "text": "We loved our stay at the Lost Iguana resort, Arenal area, for 3 nights. We saw lava flow from our private patio all 3 nights we stayed there! Every room at the Lost Iguana has a volcano view. However please realize that nature alone decides whether you actually get to see any lava. Without the lava, the volcano is still beautiful, it is like a dark mountain shape looming up, ringed by clouds at the top. But for us, the afternoon rain chased the clouds away revealing the volcano top by evening with a brilliant red lava flow against the night sky.", "title": "Enjoyed Jungle Luxury at the Lost Iguana!", "helpfulness": 24, "user": "Melissa5", "date": "July 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 4.0}, "id": 3679444}, {"rating": 5.0, "title": "Hidden Gem", "text": "Sound effects: for us, there was a lightening and thunder storm moving off into the distance 1 night, adding sound and drama to nature's show! Also from our private patio we could hear a frog chorus with calls of 6 different types of frogs! (My husband is a biologist.) I fell asleep at night listening to the frog chorus, like a jungle lullaby.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "July 18, 2005", "id": 3679084}, {"rating": 5.0, "title": "Mesmerizing Volcano Views", "text": "My husband and I stayed in a luxury suite on the first floor, and our 3 young adult children shared a standard deluxe room next to us.", "helpfulness": 8, "user": "A TripAdvisor user", "date": "June 16, 2005", "id": 3570730}, {"rating": 5.0, "title": "Perfection!", "text": "The luxury suite is the best thing about the Lost Iguana! Has to be the best room in Arenal area. It is very romantic and attractively decorated in a style I would call \"jungle luxury\". I predict the Lost Iguana is going to be the best resort overall in Arenal area within a year. Right now it has only been open a year and the owner, Elaine, is working hard to make everything right and she listens to feedback and answered all my e-mails before our trip. Everything she told me was accurate.", "helpfulness": 17, "user": "A TripAdvisor user", "date": "June 14, 2005", "id": 3550988}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "Our family of 5 stayed at the Lost Iguana resort in August of 2006. We really enjoyed ourselves. After reading online and looking through guidebooks, we had to choose between Tabacon and Lost Iguana. We made the right choice. We stayed in one of the Celebrity Villas, which were fantastic. Ours had 2 bedrooms, 2 queen beds in one room, 1 king in the master bedroom, as well as a kitchen, living room and patio. There was a hot tub on the back patio right by a miniature pond teeming with life! Not to mention the view of the volcano... BREATH TAKING! You could hear the booms of the volcano and one night we were lucky enough to see it spit lava into the night sky. Truly unforgettable.", "title": "True 'Pura Vida'", "user": "MeetmeinSanJuan", "date": "March 10, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7010449, "likes": {"liked": "— Location, Service, rooms", "disliked": "— nothing much"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The ammenities at Lost Iguana are great. The pools and swim up bar and nice to enjoy after a day of exploring the sites. The food was fine, above par but Costa Rica isn't known for its cuisine. At the main restaurant, there was live music every night, which we really enjoyed. The staff was friendly and quick to come to our aid. The resort's trails and other grounds are well-groomed, and landscape, yet still preserve the rainforest feel. All in all, we had a wonderful stay and would return in a heartbeat. Costa Rica is paradise and the Lost Iguana is no exception.", "title": "A Peaceful and Romantic Getaway", "helpfulness": 2, "user": "djastrid", "date": "March 4, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6911607, "likes": {"liked": "— The jacuzzi in the private patio outside our room", "disliked": "— Far away from the town."}}, {"rating": 4.0, "stay_parameters": "Stayed February 2007", "text": "Upon ariving at this luxurious hotel, we were mesmerized by the beautiful landscaping. Although it rained 2 out of 3 days we were there, it did not ruin our trip. Although the hotel is a bit isolated from eveyrything, it was still a nice relaxing environment. The tranquility and peacefulness took some getting used to, but since we were on our honeymoon, it was perfect! The rooms were big and spacious. My jaw dropped as we entered the room and saw the view of the volcano. We stayed in a corner room that had an oustide shower and a jacuzzi in the patio. The room was very private and although you felt like you were outside when using the shower and jacuzzi, there was enough privacy that even I enjoyed it (and some might say i'm a prude!). It felt like paradise in the room and it was hard to pull away when it came time to go. The extra money for this suite is well worth it and I would do it again in a heartbeat!", "title": "A hideaway", "helpfulness": 1, "user": "Shpilkes", "date": "March 4, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 6911414}, {"rating": 4.0, "stay_parameters": "Stayed February 2007, traveled as a couple", "text": "Spent one night here upon arriving in the Arenal region. Lost Iguana is a good little hotel: low-key, easygoing, and befitting its name.", "title": "Great jungle hideaway", "helpfulness": 3, "user": "SarahKNC", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 6893401, "likes": {"liked": "— our view, the staff, adventures around the resort", "disliked": "— leaving,hearing other couples through walls"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007", "text": "The hotel staff is friendly and hard-working and the grounds feel natural and inviting. The resort is built into the side of a mountain, making walks to our room steep but authentic. Our room was comfortable and well appointed, with modern mid-grade amenities and good cable TV (we actually caught the Oscars broadcast). We had a fantastic view of the volcano and saw an extensive eruption without cloud cover. There's a pretty pool, a comfortable small lobby with wifi, and a restaurant with surprisingly fresh and tasty food.", "title": "Absolutely Fantastic", "helpfulness": 2, "user": "not2woryluv", "date": "February 28, 2007", "detail_rating": {"front_desk": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 6891432}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with family", "text": "My husband, 8 year old son and I spent four nights in a deluxe suite which couldn't have been nicer. We had a huge outdoor lava rock shower and private outdoor jacuzzi which we used every day. The room was huge and very clean and soundproof (both my husband and I are light sleepers). The air conditioning also was quiet and worked well. There were no reading lights near our bed which made it impossible to read at night. We were extremely fortunate to be able to see the volcano 3 of the 4 nights we were there. At night when there is a good lava show, the hotel will ring your room twice to let you know that you should wake up and watch the eruption. I found this very annoying, since we saw the lava before we went to bed, so I would take the phone off the hook before I went to bed.", "title": "This is a first rate hotel with the most amazing views!", "helpfulness": 2, "user": "susaneobrien", "date": "February 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 6842783, "likes": {"liked": "— We had a great room with a fabulous view", "disliked": "— No reading lights"}}, {"rating": 5.0, "title": "Fabulous", "text": "The breakfast was plentiful and delicious and the pool was nice. The hotel has several hikes on the property; I took the two hour one which I thoroughly enjoyed. We also enjoyed the nearby hanging bridges through the rain forest and saw several monkeys and interesting birds when we did it. There are also amazing views from this walk which also takes about two hours. If you buy your tickets at the hotel, you save $5 per person. The hotel has free internet access which was fairly fast (for Costa Rica).", "helpfulness": 2, "user": "psu2kids", "date": "February 20, 2007", "id": 6819611}, {"rating": 4.0, "title": "Very nice hotel!", "text": "We enjoyed eating lunch and dinner at the hotel which wasn't as pricy as I expected. The staff was friendly and the food was delicious. Also we loved the view and food at the Kioro restaurant which is on the other side of Tabacon. If you have kids, you should head to Los Lagos Hotel. They have several pools (both hot and cold) with three water slides, a butterfly garden, crocodile farm, tilapia fish hachery, frog pond, many walking trails, a great canopy tour with terrific people running it (ask for Antonio), and many walking and hiking trails. There is even a trail which you can drive to if you have an SUV to get closer to the action of the volcano. Even if you're not staying at Los Lagos, you can pay a small fee to use the pool. Or if you do the canopy tour, you can use the facilities for free. My son loved it there and wanted to go there every day.", "helpfulness": 1, "user": "ldavis77", "date": "February 12, 2007", "id": 6783477}, {"rating": 3.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "The only negative thing I can say about Lost Iguana, which to some people may be a positive thing, is its location. It is located basically at the end of the road from the town of La Fortuna; it takes about 30 mintues to get to town. However, many of the other attractions (i.e., restaurants, Los Lagos Hotel, Tabacon, Baldi Hot Springs, etc.) are located between La Fortuna and Lost Iguana and therefore take less time to get to. I would totally recommend renting a car - I can't imagine going there without one. I guess you could use taxis but that would be expensive. We didn't do any of the tours which you book from the hotel, so I can't comment on that. Everyone which we met seemed happy to be there.", "title": "Liked it", "helpfulness": 5, "user": "SuperJonny", "date": "February 3, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 6737739, "likes": {"liked": "— Location", "disliked": "— price"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "We'll be back! The views of the rainforest were great. We even saw the volcano erupt one evening while eating at the restaurant. The hiking was strenuous and so convenient since it was on the hotel property.", "title": "Peeping Tom Spied on us Outside our Room!", "helpfulness": 12, "user": "kenagross", "date": "February 2, 2007", "detail_rating": {"front_desk": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 4.0, "location": 2.0}, "id": 6731441, "likes": {"liked": "— The room and view", "disliked": "— The Peeping Tom who spied on me trying to take a bath."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "This is my second stay at Lost Iguana and it gets better every time. Between the beautiful rain forest, tropical birds and the view of the Volcano - there is no better place. The rooms are beautifully decorated, the food is wonderful and the spa is one of my favorites. The couples massage is a must with the background of the sounds of the birds and the water running in the creek and sometimes even the sounds of the active volcano make it a memorable experience. They also have the best gift shop around and I always have to get an additional suitcase or carry on to bring back all my goodies. And if you’re a hiker, this is the place. Hiking in the rainforest is fabulous and great exercise and it is part of this fabulous resort. I would highly recommend this resort to all my family, friends and all of you reading these reviews. Sharon", "title": "Escape to Paradise for a second visit", "helpfulness": 4, "user": "sharonquer", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119166207}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "Unreal hotel resort. Clean,safe, well trained staff, outstanding food,lots to do and see. Great views.", "title": "Terrific vacation", "user": "captainslick591", "date": "October 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119125193}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I shall return.", "title": "Escape to Paradise at Lost Iguana Resort at Spa", "helpfulness": 6, "user": "Glenn S", "date": "October 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119082208}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "H. Goldstock", "title": "Paradise", "helpfulness": 2, "user": "wgmorgan7777", "date": "October 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119043133}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Boca Raton", "title": "Best resort ever!", "helpfulness": 2, "user": "Suzanne S", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118752713}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We stayed at the Lost Iguana for one night during our trip. Our first choice, the Nayara was not available on our arrival day in La Fortuna. Unfortunately, we arrived at night and were not able to appreciate the grounds of the hotel as much as I would have liked.", "title": "Could have been perfect, but...", "helpfulness": 4, "user": "Snoweman", "date": "October 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119533516}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "On the plus side, the rooms are EXACTLY as advertised. We stayed in a luxury suite. There is no trick photography at all. The room was very spacious, as was the bath and deck. To say it was clean wouldn't do it justice. It was immaculate. Yes, I think there was a tiny gecko and maybe a fly in the bathroom, but, hey, this is Costa Rica. The view of the volcano the next morning was superb, and also precisely as advertised. We took a tour of the hanging bridges in the morning and then checked out to go to the Nayara in the afternoon. I really wish we could have enjoyed the other amenities of the hotel, but just didn't have time. Another plus was the rate – 40% off of rack rates!", "title": "friends stay at cool spa", "helpfulness": 2, "user": "cxdesign", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119529550}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Here's where they went wrong: After arrival we headed to the restaurant for dinner with the couple we were traveling with. We brought down our own bottle of wine they had bought in the duty free shop. The restaurant was fine with bringing our own bottle (and no corking fee – big kudos for this). During the dinner we finished our bottle, and ordered another. The waiter suggested a bottle of Pinot Noir. While I was going to order the Malbec, I decided to take the waiters suggestion. The waiter opens the bottle and hands me the cork. This should have been my first hint there was something wrong. I don't usually see wine stains half way up the cork. He poured a taste and I sniffed it. I very rarely get anything out of sniffing – the alcohol smell overpowers all the other aromas for me. When I smelled this sample, I knew something was wrong. I tasted it, and it just tasted bad. I gave the others the small glass of wine and we agreed it had turned, or the cork was bad. This is the very first time I have ever refused a bottle of wine at a restaurant. The waiter took the bottle away, and we continued our conversation. I then notice the waiter and manager (I assume he was in charge) a few tables away with the bad bottle of wine. The manager tastes the wine and then looks over at the table. He walks away, and then comes back to our table.", "title": "great time", "helpfulness": 2, "user": "Cathy m", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119518970}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "He said to me, “I have tasted the wine. It is fine. You will have to make another selection.”", "title": "A very nice experience", "helpfulness": 1, "user": "Jaime O", "date": "October 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 119518225}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "Really??? Did he think I was trying to impress my friends and spouse by refusing to take a bottle of wine?", "title": "Amazing amazing!!", "helpfulness": 3, "user": "Naomi C", "date": "October 18, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 119420571}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This is a lovely hotel surrounded by lushness, flora and fauna. We got a great deal on Groupon, in a basic room. The room was attractive and roomy, with a small refrigerator and a balcony overlooking the volcano. The birds sounds we woke up to were like nothing I had ever heard.", "title": "What a gorgeous setting...and the sounds...", "user": "mfnyc", "date": "May 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129936115}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "There is a bird feeder is right outside the dining area, and during breakfast you are entertained by visiting birds, including a pair of toucans. Breakfast was a basic hot/cold buffet with an eggs-to-order station as well. The front desk was very friendly and helpful. They also can get some discounts to excursions, and will give you a lift to the hanging bridges (nearby). The pool area was also very nice and relaxing, with a roomy hot tub, and happy hour.", "title": "Lovely jungle retreat", "user": "worldcurious2", "date": "May 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 129534288}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "It's a bit of a cab ride from town, but given the setting, it's worth it. Overall we were glad we stayed here.", "title": "Beautiful place hidden in lush beauty", "user": "Ceciliaaaaa", "date": "May 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 129473644}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "We were on a family trip (8 people total, 4 adults, 4 kids) to Costa Rica, and we had 4 rooms at Lost Iguana, two suites and two regular rooms for 4 nights. The rooms were large, nicely furnished, and the volcano views were breathtaking. The place has a 'rustic luxury' feels -- our room had an outdoor enclosed shower which I adored, but might not be everyone's cup of tea. We also had an outdoor jacuzzi, which was lovely. The rooms were generally well-appointed and charming, and we loved the walk amidst the buildings on the property, the setting of the open-air restaurant, and the friendly staff. The trails on the property were secluded and beautiful. The pools on the property aren't anything exceptional, but the warm pool is indeed pleasantly warm, and the swim-up bar is a nice touch.", "title": "Loved it :)", "user": "CB8882", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129329378}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "Generally, the food was quite good and better than I expected -- the poblano soup was a particular highlight, the palms in the heart of palm salad were fresh and delicious, and we thought the fajitas were good too.", "title": "Paradise in Paradise", "user": "SusanMalphurs", "date": "May 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129302767}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We had an amazing time at the resort. I would defiantly recommend this to people with family. The grounds were beautiful and the food fantastic. We were here for two nights with our 4 yr old and 6 yr old who couldn't get enough of the pool!", "title": "Great family resort", "user": "melodyny", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 128471188}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "My husband and I just returned from vacation in Costa Rica. We stayed the The Lost Iguana for three nights. We stayed in one of the suites and it was absolutely outstanding! The rooms are very private. Our room was clean, the view of the volcano was amazing and the room service was spectacular! My husband and I loved reading outside on the balcony in the morning while sipping the delicious coffee! There are trails right on the resort grounds as well. The food at the restaurant is spectacular(best we had in Arenal) I would highly recommend making reservations for dinner at the restaurant on grounds, as it fills up fast. The hotel staff are very accommodating. Our rental car ran out of gas and wouldn't start; the hotel staff went and got us a can of gas and put enough in to get to a gas station(free of charge) My husband and I have traveled all around the world, we would come back to Arenal just for this hotel! HIGHLY recommend it!", "title": "One of the best hotels we've ever stayed at!", "user": "Lindsay M", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128348800}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "My partner and I arrived at the Lost Iguana on the 18th of April after a 4 day stay at a busy (and noisy) resort in Playa Hemosa.", "title": "The Iguana may be lost, but this is certainly Paradise Found", "helpfulness": 1, "user": "DougieG67", "date": "April 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128322954}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "What an absolutely amazing resort! The staff greeted us and promptly checked us in, informed us of the facilities and the opening times, and assigned us our rooms. We had booked a Deluxe Suite So I was expecting something like a residence in with a small kitchenette. I had no doubt that the views would be amazing, but was not prepared for what greeted us.", "title": "A Great stay in the Rainforest at the Lost Iguana", "helpfulness": 2, "user": "szky", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128253219}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The room (#23) was absolutely huge with a large king bed and canopy, a small love seat, a bar area with sink and fridge and loads of open space to move around. The main bathroom was amazing with an outdoor double shower that made you feel like you were in the jungle, but was very private and secure from the wildlife.", "title": "Great place with excellent family accommodation", "user": "246cav", "date": "April 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 128250245}, {"rating": 5.0, "title": "visit the most beautiful", "text": "this resort was perfect-every detail taken care of,along with beautiful grounds. an absolute for a vacation resort!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 24, 2005", "id": 3803402}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "The person that wrote “Perfection” really got it right! There is not much I can add they did not say. I agree with everything they said but would add a couple of thoughts of my own.", "title": "Truely Magical!", "helpfulness": 11, "user": "DavidjDenverColorado", "date": "August 16, 2005", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 3767890}, {"rating": 5.0, "title": "Wow!! Loved the Lost Iguana Resort", "text": "There is no way to describe feeling of sitting there watching the lava flow (Race?)down the flanks of Arenal while the Fireflies dance their dance with the night time jungle as a back drop. It was almost like a Ferry Tale!", "helpfulness": 3, "user": "A TripAdvisor user", "date": "August 12, 2005", "id": 3758017}, {"rating": 3.0, "title": "Not as advertised", "text": "The entire hotel, from the way the beds and hot tubs face to the swimming pools have been designed with the view of Arenal in mind. (I feel they have the best and most panoramic view of the volcano in the area.)", "helpfulness": 13, "user": "A TripAdvisor user", "date": "August 8, 2005", "id": 3746561}, {"rating": 3.0, "stay_parameters": "Stayed July 2005", "text": "The owner, Elaine, takes a special pride in the hotel she has created out of the jungle. She really wants to share what she has created with other people and goes out of her way to make sure they are enjoying their every minute at her hotel.", "title": "Nice place but out of the way...service was not good", "helpfulness": 12, "user": "svangron1", "date": "August 7, 2005", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "rooms": 3.0, "service": 2.0}, "id": 3743998}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "This lodge is really beautiful, immaculately kept up. The room my friend and I had was gorgeous, with a beautiful room, jacuzzi on the deck, and a separate deck with rocking chairs and a sweeping view of the volcano and the valley below.", "title": "Lovely spot from which to enjoy Arenal", "helpfulness": 1, "user": "tashy1019", "date": "October 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119949313}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "The breakfast every morning was a buffet that had a lot of good options (french toast, rice and beans, scrambled eggs, fruit juice, etc.) and also had an omelette station where you could pick your omelette.", "title": "Nice place to stay", "helpfulness": 2, "user": "MapmakerJenny", "date": "October 29, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 119859915}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Everyone working here was very friendly and helpful, and they all spoke excellent english but of course appreciated it if you tried to speak a little spanish.", "title": "Much better than I expected!!", "helpfulness": 2, "user": "Momo F", "date": "October 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 119835516}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "The swim up pool bar was nice, it was heated; the pool below was not heated and was not warm enough for me to brave even after a margarita. The deck area with lounge chairs was nice and many of the guests wiled away the afternoon in them.", "title": "Great Resort and Excellent customer service", "helpfulness": 2, "user": "Rashmi M", "date": "October 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 119749122}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "The pool bar and bar area do have a 2-for-1 happy hour every afternoon and early evening.", "title": "Yoga trip at Lost Iguana Resort", "helpfulness": 1, "user": "simmonstw", "date": "October 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119691641}], "location": {"country": "Costa Rica", "continent": "Central America"}, "stars": 3.5, "variance": {"poor": 35, "average": 51, "very good": 182, "terrible": 5, "excellent": 664}, "aka": "Lost Iguana Hotel La Fortuna De San Carlos", "slim_ranking": 0.109375, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The Lost Iguana Resort is Arenal's newest hotel, offering luxury accommodations in the rain forest The resort's 100 acre property overlooks the world's most active volcano, Arenal Volcano located near La Fortuna, Costa Rica. A premiere, upscale retreat nestled gently in the jungle, the Lost Iguana Resort only offers rooms with large private balconies overlooking the Arenal Volcano and Arenal River Gorge. All rooms are spacious and well appointed with first-class furnishings, artwork and full amenities."}