{"user_rating": 4.5, "review_count": 988, "name": "Lough Eske Castle, a Solis Hotel & Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Have visited Solis many times to visit and lunch and stayed for the first time in Feb-2012. We got a great deal on Travelzoo and I appreciate may not have loved it just as much had we paid full whack. Granted on top of the 1 night 2 ppl B&B deal and 1 meal for £95 we paid an additional 100euro on food and at the bar but it was all worth it for us. Thoroughly relaxing break, food excellent, breakfast about 7/10 for me (everything smoked) Spa 9/10 and lacking the 1 because you have to go outside to access it. Ensuite bathrooms had heated floor which was totally lush. All in all peaceful and relaxing and will definitely go back (when we get another voucher deal!!)", "title": "Can't wait to go back", "helpfulness": 2, "user": "caitni2000", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124634411}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "An excellent stay at Lough Eske Castle - only stayed one night but honestly felt that we had been away for 2/3 nights. Stunning location and lovely room with 4 poster etc, and service and staff were superb throughout restaurants, bars and hotel. Can't wait to return.", "title": "Fabulous Stay", "helpfulness": 1, "user": "dgjm01", "date": "February 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 124532701}, {"rating": 4.0, "stay_parameters": "Stayed February 2012", "text": "Had a great stay, only let down was the room didn't appear to be serviced to the standards you would expect from a five star hotel. The coffee and sugar hadn't been replenished. The hanky box was empty. The toilet roll holder was broke. Walls in the toilet were grubby as were the glass shower doors, with strains and fingerprints on them. The magnifying mirror was faulty with thumb prints on it. In all I expected perfection and this let the hotel down in my opinion.", "title": "Lovely stay- but with all the hype expected more!", "user": "kizzyshouse", "date": "February 12, 2012", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 124493011}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Stayed at Lough Eske twice and just booked for a third time. In truth, the hotel lacks a bit of character as it's a bit too renovated for me - I can see the Americans loving it but felt a tiny bit contrived to me inside. Outside is beautiful, though, and the junior suite we had was the nicest hotel room I've stayed in. What blew me away was the customer service. At breakfast, a waitress spilled a whole pot of hot coffee on me - a bit of an inconvenience but an innocent accident. I made no issue but the hotel offered me a free overnight stay as recompense. This was above and beyond the cost of the inconvenience. Just booked in for a garden suite room for next week. Aside from his, had one of the nicest meals ever at dinner on my previous stay - perfect rare steak with brilliant accompaniments. Good value meal too. Highly recommended. The spa treatments are great too but it's the customer service that makes the difference to me. Highly recommended.", "title": "Perfect service", "helpfulness": 1, "user": "NIcityhopper", "date": "February 10, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 124400297}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "We booked a deluxe room and it was definitely the best room in its class that we have stayed in over the last few years. The castle itself is really impressive as are the bars and ante-rooms. Unfortunately the trip to the Spa involved a walk outdoors and the Spa itself is just OK. Food was good but it didn’t live up to the quality of the surroundings. The walk to the restaurant from the lobby feels like a walk into a convention centre - the architect could have been a bit more sympathetic to the architectural integrity of the castle when they designed the ‘new part’ but the restaurant itself is actually very nice. All in all, Lough Eske was really enjoyable and we would definitely go back.", "title": "Rooms are excellent, Castle is Beautiful...", "helpfulness": 1, "user": "MarkL4984", "date": "February 10, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 124396143}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "We spent two nights here in Oct 2011. The service when we arrived was superb compared to many hotels in Ireland. I have stayed in 5 star hotels around the world and the staff here are definitely well trained in 5 star service. The hotel and grounds are beautiful, the scene in all the pictures is exactly what greets you as you drive up to the hotel and it is really stunning. Our room was huge and very tastefully decorated, it feels brand new but nicely complements the old elements of the castle. The spa is fantastic and you could spend hours there just relaxing. The restaurant is excellent, food is delicious and great selection of local fare and is very reasonably priced. Great wine selection and also very reasonably priced. Activities are slightly limited so if more than two nights you may find yourself a little bored. You can play golf at local courses or cycle around the nearby Lough Eske. I would suggest the hotel install a large screen TV with good sound system in one of the common rooms and offer a selection of DVD's to watch, this would be great for rainy days, I know there are movies in the bedrooms but you don't always want to be locked away in the room. Overall I really enjoyed my stay, it is a little hidden gem that is not very well know. I would definitely recommend this place for a weekend away.", "title": "Excellent service, beautiful hotel", "user": "CMD-SH", "date": "February 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124044197}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I have stayed in many hotels and by far my experience at the Lough Eske has been the best. On arrival the staff were already waiting at the door to greet us, take our bags and welcome us in from the cold. At the front desk when asked where our rooms were located instead of a mere hand gesture we were escorted to our rooms. My room was bigger than the flat I live in! The bed was gigantic and the bathroom was in a whole league of its own! During my stay the food I experienced was divine, I have never had such tender steak in my life and the staff were more than happy to help with any food intolerences or dislikes. I must say however the greastest element about this hotel is its staff, they are a credit to the hotel and are just beyond the call of service. I myself work in hospitality and try to strive for excellence which these individuals achieve and will go to any lengths to make their guests happy. Whenever my glass was half full I received another, they would all say hello when they walked past, each one seemed genuinely interested in my day. It was just so lovely and refreshing from the usual hotels I experience. Thank you to the Lough Eske! I hope to visit you again very soon!", "title": "The greatest hotel I have ever stayed in.", "user": "Dollytobrolly", "date": "February 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124030710}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Stayed at Lough Eske for a Sat night. We booked a suite which was amazing, the biggest I have ever stayed in, the bathroom being the highlight. We ate in the gallery bar which was ok, my partners steak sandwhich was a bit tough and not too warm, and the cheese board had no blue cheese!! They also let the fire in the lounge burn out. That said it really is a lovely hotel and def worth a visit.", "title": "Lovely hotel", "user": "2tricky2", "date": "February 1, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 123960025}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Spent a fantastic weekend at the Lough Eske Hotel. Staff welcome and service second to none. Great entertainment particularly Friday evening in the Gallery Bar. Fantastic acoustic guitarist and singer. Beautiful meal in Cedars Restaurant on Saturday. Relaxing massage in spa. As a gay group of guys we were made to feel most welcome. We'll be back.", "title": "Gorgeous Donegal Chillout.", "user": "Michael D", "date": "January 30, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 123830188}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Excellent hotel - got a lovely room with a 4 poster bed, massive bathroom. We travelled on a Travelzoo offer - £99 for a night b and b and 50E credit for the restuarant or spa.", "title": "Cannot fault it", "user": "dm1313", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123825191}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "This hotel is an example of how hotels should be operated. Staff weren't above and beyond and their customer service is exemplary. Rooms were absolute luxury and great atmosphere. Food in restaurant was a little disappointing but ate in the bar the second night and this was faultless. Breakfast was outstanding and Sunday Lunch was amazing! This is definately a hotel I will return to for a special break again and again.", "title": "Fabulous hotel with superb customer service", "user": "Jo-JoKesh", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124345902}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "OMG!! Where do I began about Lough Eske Castle, my wife and I stayed here in 4th February 2012 this place is fantastic from the moment we pulled up to the castle I know we were in for a good time. My wife always fancied staying at this Castle and told me how good it was, so we arrived good and early, you weren't suppose to check in till 3 but reception had no problems with us being there and got us a room without any fuss. After checking us in we were escorted to our room with the help of the bell hop who was very friendly.", "title": "Weekend Away", "user": "murphstar", "date": "February 9, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124338343}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "The room was massive and had everything you need in it, plenty of room to relax in it the bathroom was the biggest I have ever seen in a hotel and it had under floor heating I couldn't believe it!! You will see by pics what I mean.", "title": "Fantastic", "user": "Beth0889", "date": "February 8, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 124320178}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "We then went for some lunch before heading to the spa, the hotel has has many fires with in it and to see a warm fire on a wet day does your heart good......lunch was great and served with a smile and the staff couldn't do enough for us. At each entrance of the hotel their is umbrella's incase its raining a nice touch.", "title": "5* Relaxation", "user": "DANA20", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124167244}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "The spa is also great staff again are super friendly and very attentive first stop was the hydro pool which does the trick if you are after relaxation......beside the hydro pool there is a relaxation room which you wait in for your spa treatment, this rooms as papers, mags, water, juice, fruit and tea along with heated beds for you to relax in have to say they really have thought of everything. My wife got a facial and hand and foot massage and I got a back massage both of enjoyed them very much.", "title": "Perfect attention to detail", "user": "Nini2Ireland", "date": "February 4, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 124100675}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We had a great 2day break with our two small children. We had a garden suite and it was the biggest hotel room we have ever stayed in. With two cots in the room we used the sitting area each evening to relax and were able to enjoy our evenings while the kids slept. The food is amazing both in quality and presentation. All staff are friendly and helpful which makes the stay truly unforgettable. We look forward to returning in the near future", "title": "Amazing hotel", "user": "GMCG06", "date": "August 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171985892}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "I recently went to lough eske for afternoon tea. It was my first experience of afternoon tea and it was fantastic! The staff were lovely through it all. I won't forget it, it's a bit pricey but worth it. Definitely try it! Will definitely will be back.", "title": "Afternoon tea", "user": "Aisling H", "date": "August 12, 2013", "detail_rating": {"value": 5.0, "service": 5.0}, "id": 171971973}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "From the moment we arrived nothing was to much trouble for the friendly staff. Smooth check in. Comfortable courtyard room. Transport organised and on time.", "title": "Great welcome.", "user": "VeruMontanum", "date": "August 11, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 171751538}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Breakfast was busy but the staff worked hard and the full Irish was cooked perfectly.", "title": "Setting unrivaled.", "user": "BoneyOD", "date": "August 11, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171715272}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We hadn't time to enjoy the spa and pool. Definitely next time.", "title": "Fabulous luxury friendly", "helpfulness": 1, "user": "kamefa", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171465020}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Thoroughly enjoyed my stay. I availed of a deal on groupon.ie that gave me a 2 night stay with 75 euro food credit. The full value of the voucher was worth 615 euro and cost 350 euro. I did not feel the experience was worth 615 euro, but still thoroughly enjoyed my stay.", "title": "Excellent but expensive.", "user": "springer81", "date": "August 14, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 172272024}, {"rating": 2.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "I had a late lunch there recently with my mother and aunt and, when I examined the bill on getting home, I found that three drinks, totalling €17.90 had been incorrectly added to our bill. I phoned the hotel and the restaurant manager made little or no attempt to aplogoise but said he would refund the amount to my credit card. He sounded indifferent to the incident and his mundane apology lacked any concern. Neither did he attempt to explain how this could happen until I asked him. I pointed out to him that we found it odd that those in the dining area who were having afternoon tea were provided with table cloths while all other diners didn't even have a placemat on their table. He simply replied \"I'll pass on your comment\" - again totally disinterested.", "title": "late lunch in the bar", "helpfulness": 4, "user": "Patsy D", "date": "August 14, 2013", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 4.0, "service": 4.0}, "id": 172227065}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "While anyone can make a mistake, the response to my complaint was not the customer service you would expect from a 5 star hotel.", "title": "TOP CLASS", "user": "TCandTess", "date": "August 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172155756}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "On the positive side the staff we very friendly and helpful.", "title": "Totally Amazing", "user": "ash50London", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172047070}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "I will not be visiting there again and I certainly won't be recommending it to my friends", "title": "Wonderful service and a beautiful place.", "user": "Jane D", "date": "August 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 172042102}, {"rating": 5.0, "stay_parameters": "Stayed July 2013", "text": "We visited the hotel with our children and we very pleased with our stay. Nice big suite, gorgeous spa and we had wonderful weather.", "title": "Excellent hotel", "user": "The-great-family", "date": "August 17, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172615893}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Dinner in the restaurant was also good, when I complained about the fact that my fillet was cooked to long they did not hesitate to bring me a new one and on top", "title": "4 and a half stars", "helpfulness": 1, "user": "mjtoal", "date": "August 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 172539597}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "of that insisted that we would not pay for the wine. Everything is high service and to be honest info not get the point why some reviews say this is not a five star hotel. We have stayed in many 5 star hotels and this certainly deserves that rating.", "title": "Excellent honeymoon!", "user": "GalwayMidge", "date": "August 15, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 172424282}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "Overall highly recommended!", "title": "Beautiful hotel & great service", "user": "Joodle", "date": "August 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0}, "id": 172287982}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "we had previously stayed at lough Eske, about 3 years ago when the kids were a lot smaller and they stayed in a travel cot and Moses basket in the room. this time, at almost 6 and 4, different accommodation was required, so we booked a Garden Suite because of its spaciousness. The trip was planned pretty late so we thought getting availability would be tricky and when I called, the very helpful staff member looked at a bunch of options but there was one night booked out. So I had a look at the website and found accommodation and booked it. Then I got a nice email from the staff member saying she was pleased I had found a room presumably held over for web bookings. That was a nice touch. The rate was a 3 for 2 rate, with the third night free. This was credited as a 34% discount and was applied to each of the 5 nights we stayed.", "title": "Friendly and pleasant place,had a lovely stay.", "user": "Purplepig40", "date": "August 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 172287738}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Our group stayed at the Lough Eske Castle for one night. The property is simply stunning, and I personally love the modern, large rooms, with some of the best-ever bathrooms and bed seen in a European hotel. The plaze oozes of luxury!!", "title": "Fabulous.", "user": "mijansso", "date": "August 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 173303425}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "Service was ever so friendly, and we were made to feel extremely welcome. The staff in the hotel bar & restaurant were knowledgeable, and courteous. Their service was done with style - and with a smile. Products selection at the bar left nothing to be desired - 100% top experience.", "title": "Wow! - Wow! - Wow!", "user": "markusTyrone", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173234830}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "This place is slightly out of main roads, but the beautiful, serene nature that surrounds the castle enhances the feeling of luxury, and the scenery is equally stunning.", "title": "Relaxing", "user": "!!!!!!!!!!", "date": "August 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173206140}, {"rating": 5.0, "stay_parameters": "Stayed August 2013", "text": "My room had a huge, ever-so-comfortable bed, all the amenities I could ask for, and the bathroom was like from an Asian-style spa, with huge separate shower room, huge tub, table and walls of marble. The whole room was one of the cleanest I have seen in a hotel.", "title": "Beautiful!", "user": "Cb718", "date": "August 20, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 173133406}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "HIGHLY recommended. A taxi can be booked easily with the help of the staff, and with small sum one can visit the town of Donegal, and also get a ride back (we agreed this with the same taxi, who also was ever so helpful).", "title": "Wonderful", "user": "daragirl", "date": "August 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 173060705}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We flew into Dublin and drove to Lough Eske. Even with a GPS it took us 3 and a half hours (two and a half coming back when we had better advice). The hotel is not very well marked and makes for a very frustrating last 30 minutes after a long drive in front of you. Once there the place is very nice. Meals are simple but excellence. The spa is well done. The place is very relaxing but do not go here if you are not comfortable just staying at the hotel. Lots of local crowds during the weekend ruin the relaxing nature of the place but after the weekend it is enjoyable. One complaint. Do not expect anybody to pick up the phone when you call the resteraunt or the spa. For some reason they do not feel this is important.", "title": "Difficult to find but nice once you are there", "helpfulness": 1, "user": "Canadian_Nomad22", "date": "August 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 116262560}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Stayed here for 1 night on 31st July with my husband for a night 'away'. From arriving at the hotel until checkout the experience was fabulous. The staff at this hotel are excellent and exceptionally friendly and definately go the extra mile to make you feel welcome. We have stayed at other 5 star hotels in Ireland and over the world but this hotel is by far the best we have stayed in. We had a deluxe room which had a very large, very comfortable bed. The room and the bathroom were outstanding.", "title": "wonderful 5 star experience", "user": "shellbelfast_10", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116178212}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The grounds around the hotel are beautiful.", "title": "Lough Eske Castle - we will never go anywhere else", "helpfulness": 1, "user": "robja", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116168498}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I had a 90 min aromatherapy massage in the spa given by a lovely friendly girl called Derbla which was absolutely wonderful.", "title": "A very special place.....true 5-star", "helpfulness": 1, "user": "Cath2189", "date": "August 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116143305}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "Our only complaint was that we only stayed one night, we could have moved in !!", "title": "Romantic, relaxing, stunning setting and superb customer service!", "helpfulness": 2, "user": "NoRegrets31", "date": "August 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116107836}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed for three nights and were very happy with the facilities, service and experience. The buildings and grounds have been restored to a high quality and the grounds are very well maintained. Food is great. The most enjoyable part for us was the pool and thermal suite. Even though the hotel was full when we were there, the pool was always quiet!", "title": "great hotel", "user": "thegodmother", "date": "August 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 3.0, "service": 4.0}, "id": 116723664}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I'd suggest if you would prefer to visit the hotel when it is quiet, ask if there is a wedding booked as it is a very popular venue. That said, we were not affected by noise as the function room is located away from most of the bedrooms.", "title": "A true 5 star Castle", "user": "NiamhfromIreland", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116611298}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We had a buggy and there are lifts to negotiate most steps (of which there are a lots!). However, there are steps where there is no lift or ramp so be prepared to have to lift the buggy... Lastly, there was no air conditioing in our room, which I woudl expect to have in a 5 star hotel. All in all, these are relatively minor downsides.", "title": "Excellent, but not spectacular", "user": "Jumbo666", "date": "August 12, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116602875}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Donegal is a magical county and this castle is the perfect place to stay to explore it. The approach drive up to the hotel is truly beautiful and your relaxation begins immediately. The interior is very stylish and the rooms are very generous in size. The added bonus is that there are garden suites which are pet friendly so you can bring your best friend along to share the experience. (Harvey's Point hotel is also next door and well worth a trip for afternoon lunch and drinks.) The setting for Lough Eske Castle is perfect and you'll leave with your batteries re-charged and looking foward to the next trip. One of the nicest hotel spa's I've been to.", "title": "Fab", "user": "auds90", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116565577}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "A great hotel - the leather sofas by the log fire drinking lounge, spacious room (we had a suite), and most excellent spa are stand outs. The late and awesome breakfasts until 11pm, and 12pm checkout times are nice touchs also. Restaurant worth a visit as well.", "title": "Luxury in every way", "user": "Mervyn64", "date": "August 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116344650}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Originally totally bewildered by journey to bedroom - never attempted to go that way again. Rooms are beautiful and the bathroom was stunning with a beautiful candle for the bath and lovely toiletries. Huge very comfy bed. We had dinner in the restaurant the first night - very good but the staff were if anything over attentive and seemed to be worried about making mistakes - no need it was all lovely and we can pour our own wine - we have to do it all the time. Breakfast was outstanding - wonderful choice and everything was very fresh. Gardens are beautiful and Logh Eske itself is very scenic so we had a lovely walk and an afternoon in the swimming pool which is small but lovely with very nice changing rooms and very helpful staff. Dinner in the bar was lovely so we ate there again but by a lovely fire the third night. There are interesting rooms dotted about both large and small in which to have a drink or something to eat. Staff are lovely and well trained- it was truly a very relaxing few days - we were sad to leave.", "title": "total relaxation - perfect", "user": "fionnualag", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117663793}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "I stayed here with my partner for three nights and overall it was very good. We had a few issues over the course of our stay (which when brought to the attention of the manager were dealt with very well I must say) I would highly recommend this place for a cosy, romantic getaway!! There a lovely open fires with comfy couches to relax on in the bar and lobby area. Very compeditive weekend packages also...five star utter luxury!!! Cannot praise the hotel and the staff enough!!", "title": "Fabulous Place, Great Restaurant!! Complaint dealt with very well.....", "helpfulness": 1, "user": "AliHan_1", "date": "August 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117400663}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Top notch in every way. We booked the cheapest room (Courtyard room) but it was one of the largest hotel rooms we've stayed in. Staff excellent and very helpful, two good meals in restaurant and bar, spa facilities great, grounds lovely. Difficult to find fault.", "title": "We rate this 2nd in our 'best hotels we've ever stayed in' list!", "user": "clare22_10", "date": "August 28, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117346859}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My partner and I visited this hotel in June. The location is excellent, the rooms lovely and the staff very courteous. However, the standard of food is not good- definitely not up to the alleged 5* star billing.", "title": "Nice Hotel, Shame About the Food- Really Disappointing", "user": "421Heather", "date": "August 24, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 117179097}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We ate the dining room on the evening of our stay, and were not impressed at all. Aside from the wine list which is confined to a restrictive (and over-priced) range of largely French wines (there are no 'new world' wines, which seems very odd in an alleged 5* hotel) the menu was completely uninspiring. We ended up having salad type dishes as starters (which looked like something we could have chopped up ourselves at home), and then (due to a lack of choice on the menu) what was basically steak and chips/chicken and chips for a main course (again, we could have cooked this at home or found better quality food in a restaurant pretty much anywhere). The bread served at the table was also hard/stale, and wasn't replaced with fresh bread when we mentioned this.", "title": "Fit for a King or Queen", "user": "Bianca_Boris", "date": "August 22, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117058490}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "There is nothing quite so welcoming as the sound of gravel under your tyres as you approach a night of rest along a long driveway.", "title": "5 Star Treatment, the Donegal way", "helpfulness": 2, "user": "Sarah M", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123692325}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My boyfriend and I could tell we were in for a treat that Friday evening as we rounded the corner and first witnessed the impressive Lough Eske Castle Hotel in front of us.", "title": "5 star 5 Quality", "helpfulness": 1, "user": "mcgeeks", "date": "January 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123542840}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Check-in was quick, efficient and friendly and already we began to get a sense of the Donegal charm and ease of manor that was to become the benchmark of quality and service we would receive at Lough Eske.", "title": "Beautiful", "user": "SarahBenson", "date": "January 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123500932}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "The Porter showed us to our room. Decedant yet cosy, with segregated bathroom, toilet and shower. The underfloor heating was a treat that neither of us expected but both appreciated.", "title": "lovely place to stay", "user": "MeireadAshe", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123462137}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "The service at dinner was warm, friendly and professional. 5 Star treatment with the Donegal touch, which for me, was becoming the ongoing theme.", "title": "Amazing wedding", "user": "TheManInBlack19", "date": "January 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123152110}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Was at Solis recently for a wedding and loved every minute of it. The bedrooms were gorgeous and so spacious. Tastfully decorated. The wedding reception was the best wedding i have ever been at. The food at the wedding was so tasty and fresh.", "title": "Amazing hotel.One of the nicest hotels ive ever stayed in", "user": "spboyle14", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117048776}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "I really cant say how impressed i was with everything. The staff were so attentive polite and helpful.", "title": "What a place...wow", "user": "theonlyhayzer", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117047393}, {"rating": 5.0, "stay_parameters": "Stayed August 2011", "text": "Can't wait to go back to this wonderful place.", "title": "This beautiful castle is well worth a visit. A truly magical experience.", "user": "Tobycork", "date": "August 21, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 117046343}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "We visited Solis to view it for our civil partnership, so expectations were high. The place definately lived up to expectations. From the moment we arrived we were treated so well buy every member of staff, who seemed genuinely pleasant and friendly. The hotel is beautiful inside & out. The food was amazing, we had lunch in the bar, dinner in the restuarant and breakfast and all meals were lovely, especially the amazing dinner. The bedroom was huge and so tastefully decorated, with an amazing bathroom.We have decided to book our civil partnership in this venue. Cannot praise it enough.", "title": "Great hide-away, great food, friendly staff", "user": "Nicol090", "date": "August 15, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 116774249}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "The staff in the castle and spa are so well trained and professional. The rooms are spacious, spotless and very comfortable. Brilliant midweek specials with a trip to the cliffs a must. Great bar menu with open fires and acfantastic breakfast with the chef cooking omelettes, pancakes to order. A must to visit and a very enjoyable stay guaranteed with excellent 5* service.", "title": "Wonderful", "user": "janette14", "date": "August 15, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 116748540}], "location": {"country": "Ireland", "continent": "Europe"}, "stars": 5, "variance": {"poor": 25, "average": 62, "very good": 136, "terrible": 13, "excellent": 752}, "aka": "Lough Eske Castle Hotel Donegal Town", "slim_ranking": 0.333333333333, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.5}, "description": "Lough Eske Castle, a Solís Hotel & Spa is an historic castle dating to the 15th century and the O'Donnell Clan, the founding fathers of Donegal. Set in a secluded storybook location within 43 acres of native woodland on the shores of Lough Eske with the dramatic Bluestack Mountains as a stunning backdrop, it is the ideal place to relax and experience superior hospitality and exceptional friendly service. Winner of the 'World's Best Luxury Country Hotel' title in 2009, 2010, 2011 and 2012 and topping 'My Guide Ireland's Top 10 Hotels in Ireland, this lovingly restored castle hotel blends its historic past with a dash of contemporary luxury where you can escape into a world of relaxed elegance. From the spa to the dining table to your beautifully appointed guestroom, we provide a truly accommodating environment where our dedication to the guest is thoughtful, reliable, consistent and complete - a place where superb service and superior amenities make every day here a perfect day. Step into Solís Lough Eske Castle, and you step into an imposing Tudor-baronial castle, lavishly refurbished in 2007 and extended to create the modern comforts and graceful luxury of a world class boutique hotel. With stunning views and easy access to the great outdoors, the natural, unspoiled landscape is as magnificent as the hotel itself."}