{"user_rating": 4.0, "review_count": 236, "name": "Lovelady Shield Country House Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We loved it. We had a room at the front of the hotel and went to sleep hearing the lovely burbling stream and the night owls.", "title": "Comfort, peace, gourmet food and drink, attentive staff, only 2 hou in an idyllic locationWhat more for a weekend away ?", "helpfulness": 1, "user": "BaaCheshireUK", "date": "March 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 101164206}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "You do not expect to find a restaurant of this quality here and it is a real gem. What comes across here is how well they have chosen their staff and most of all how much they genuinely want to make you as comfortable and as welcome as possible. It is a small hotel. Staying here is a lovely mix of infomality, as in not having to dress up too much for dinner and formality, for example guests waiting in a separate area with a drink and canopes, not rushing, however hungry, and savouring the whole pre dinner experience, waiting to be called so that their food arrives perfectly cooked without wait in the dining area. Peter brings his skills and experience of a lifetime to the fore in this place and of course his passion for food and drink is obvious. The wine menu was just amazing. The house champagne is better than most places I have ever been. Our advice would be , if you have any problems at all, just ask and they will sort it out for you. Also, when following the hotel directions, remember to drive through every town they say, before moving on to the next instruction. Would suggest to the hotel that they get some updated leaflets from around the area on local walks/walks in The Lakes with maps as they are a little out of date and nothing we could easily take away. Great stay and Thank you very much !", "title": "Stunning hotel, a brilliant find in a gorgeous setting.", "user": "joanneh_11", "date": "March 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 100858891}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We knew very little about the hotel before arriving, and especially as we only paid £60 with a LateRooms deal, we were delighted with what we found. This is a true elegant, small country house, with opulent rooms and wood-panelled bar etc. We were lucky enough to be upgraded to a superior room, which probably helped, but we like the hotel - and its gorgeous setting - so much that I'm sure any room would have been fine. As we had our small baby with us we understandably weren't allowed to eat in the restaurant so I can't comment on that, but we were allowed to have him in the bar with us in the early evening, and could have a sandwich there. The boardgames in the library were also a great touch. The staff were also great, especially the breakfast staff (and we loved the actual breakfast, too). We will definitely be back. The only possible criticism we could make would be that there should probably be more food options than the taster menu. But that's a very small criticism.", "title": "Beautiful historic building,fabulous food great staff,superb", "user": "BIGNORM43", "date": "March 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 100497718}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Stayed this week as part of groupon food superb and worth the money as chef as won many awards best me and my wife have had and we have travelled worldwide.Bulding is old but itis old and if you dont want that and want new go to a travel lodge.Owners were welcoming and could not do enough and very knowledgeable.Would recommend to all and it is a romantic and stunning area and, we are in our forties bit sure anyone younger would appreciate this jewel.", "title": "Not superior described. OVERPRICED", "helpfulness": 1, "user": "donste2287", "date": "March 2, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 5.0}, "id": 98715287}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "Bought a groupon deal to stay for £37 a night which i thought was really cheap until we saw the small print which was we had to purchase the meals for £50 a head. Hotel cozy and secluded. Nice to get a way for a quiet get away. I would not recomend it for a romantic night if you are younger than 60. I am 40 and a young 40 and thought the rooms were old looking, room 14 had damp on the walls and in the tiny bathroom a tiny bath and a shower that came out as a fast trickle at best. Temperatures were hot and cold and had damp around the bath. Central heating was so noisy when on you could not sleep. Road to the hotel was full of deep pot holes. Food was very nice indeed but what you would expect for £50 a head. Hotel grounds are beautiful and this was the high light. If you are over 60 you will love the hotel as its OLD. Staff are very good but felt there were not enough staff as we had the one member greeting us, taking orders, pottering, running the bar. I really could not say that these rooms were in anyway worth what they are charging and unless you are 60 or over please do not bother. Might explain why there not booked up for the next 2 months. Even on a groupon deal we ended up spending over £200 for a one night stay with a meal. Ps the fire was great if they could leave a log to light it. And the mustard they have for sale actually expired a month ago.", "title": "Wonderful weekend break and wonderful people", "user": "UKTravellers89", "date": "January 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94288304}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Had a short break there just last week and everything I read about the hotel was spot on!", "title": "Cracking hotel and food!", "helpfulness": 1, "user": "neilb1959", "date": "March 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 59836476}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I would suggest this is a real 'foodies' hotel as the in house Chef puts on a cracking menu. We only ate in one evening (out of two) as a set 4 course meal was just a little bit too much for us, but based on the number of 'regulars' it obviously brings people back again and again!", "title": "Wow! What a place!", "helpfulness": 1, "user": "foodfan90", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 46180907}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Lovely quiet location, which I can only imagine is best during good weather.", "title": "So relaxing", "helpfulness": 1, "user": "BackOBennachie", "date": "August 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36906917}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Perfect for a relaxing break.", "title": "The perfect place in which to relax and unwind", "helpfulness": 2, "user": "syewtree", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34546527}, {"rating": 5.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We stayed for two nights in October 2009.", "title": "Fabulous location, comfortable and welcoming atmosphere", "helpfulness": 4, "user": "Writehotel", "date": "January 27, 2009", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 23945828, "likes": {"liked": "— A bit like being in your Mum's house", "disliked": "— Nothing"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "What a wonderful stay we've just had. We arrived about 6pm for our two night stay and were greeted by a roaring log fire and very helpful staff, Our hotel room was classed as a superior room (room 12) which didn't disappoint, the bed was very comfortable with loads of pillows (v.good nights sleep) The food in the restaurant was outstanding - we have eaten in Michelin restaurants before and the restaurant here would give them a run for there money. The hotel staff are very helpful and friendly, nothing was too much trouble. The wine list was very extensive so of course we had to sample a couple of bottles to compliment the food. The only downside would be that the shower pressure in room 12 was poor, but there was plentiful hot water and after a long walk the bath was so relaxing. Thankyou once again for everything. We will definately be back!", "title": "Top quality resaurants would struggle to provide food as fabulous as the food in the restaurant at Lovelady Shield Hotel", "user": "Nicky230201", "date": "January 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 93824383}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "I am speechless at some of the poor reviews on here. One wonders if they have got the lovelady shield mixed up with some 2 up 2 down B & B. We stayed for one night on a sunday to ensure we had the gourmet 7 course tasting menu. The ambiance,service and overall feel of the place is truly special. The chef posted details of all courses of the tasting menu and if you didnt fancy any of them, he would basically cook you whatever you want. Food was memorable as was the wine list.", "title": "Superb", "helpfulness": 1, "user": "paul1962Belfast", "date": "December 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88868111}, {"rating": 5.0, "stay_parameters": "Stayed October 2010, traveled on business", "text": "Our only niggle was that the atmosphere in the dining room was eeerily silent, with no background music. Only 3 or 4 other couples present (mainly elderly) did not help the \"could hear a pin drop atmosphere\". However, this was more amusing than annoying but I think that some appropriate music might create a better ambiance in the room.", "title": "Couldn't be more welcoming if they tried", "user": "Serlianna", "date": "October 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 85160591}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "Other than that I would recommend the lovelady very highly, especially for a quiet romantic break.", "title": "SUPERIOR ROOM NOT REALLY!!", "helpfulness": 5, "user": "yorkie25", "date": "September 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 77828577}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I returned with relief recently to stay at Lovelady Shield, where we've stayed many times before to find that the quailty of the welcome and the level of service here is still second to none; it was a pleasure to be back in this elegant house beside the burbling River Nent. Although the bedrooms are attractively furnished and the public rooms downstairs are gorgeous, it's the staff that really make it such a good experience - they're friendly, efficient, and clearly enjoy doing their job well. My only complaint? Proper biscuits in the room, please! Although I have to say that dinner is so splendid that one really shouldn't need to touch them at all...", "title": "Staff and food fantastic - grounds in need of TLC", "user": "Linsky28", "date": "August 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 77143274}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "this hotel is in a very quiet country location about 2 miles from the village of Alston. Don't be put off by the slightly potholed drive, the hotel is lovely once you get inside. The rooms are all of a good size. We travelled with our dog who was made welcome for a surcharge of ten pounds. The room we stayed in was very comfortable, clean and had everything we needed. A really friendly, very pleasant hotel", "title": "lovely individual hotel", "user": "cocopop12002", "date": "July 31, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 73156035}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Despite some of the reviews about the hotel needing a facelift, I think it did fit the country house image quite well, as did the public rooms and informal reception arrangements (ok, the pot holes DO need sorting). Our room had clearly been refurbished, and the bathroom looked brand new, with a view of the lovely garden. The mattress was soft, so soft, and actually that's not to our taste, but some would llike that, and we did have a good sleep, The only problem was that you can't sit on such a soft mattress so it made the room seem smaller, having to position the 2 chairs, especially with the tv in front of the wardrobe door! The bathroom was small, with a shower that only dribbled, but the general standard of the accommodation was good.", "title": "Real country house feel in an area with much to discover", "user": "moobox", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 72295698}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Service was friendly, and the chef produced some interesting breakfast dishes, including kedgeree and baked eggs florentine washed down with banana smoothie if, like me, you don't go for the full Cumbrian. I would say one needed to be fairly hungry to justify the £15 charge - no good if you are a toast and coffee only person, as one poor lady was.", "title": "Hotel Inspector Needs to work Her Magic....", "helpfulness": 1, "user": "Philippa H", "date": "July 9, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 70332277}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Dinner being expensive, I would recommend trying to get a deal with it included, but most of the food cooked by their master chef was a delight visually and interesting on the palate, from canapes through to interesting twists on classic desserts. Having said that, I much regretted choosing the vegetarian main course option on the second night as it was very ill-conceived, and the result of deep frying balls of risotto was just weird, at least to my taste. I was so disappointed that I complained and was at least given an extra cheese course instead, though the meal did not live up to the lovely turbot and prawn dish of the previous night.", "title": "Absolutely amazing place to stay, with wonderfully friendly and helpful staff!", "user": "icklefish", "date": "June 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68193546}, {"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The added joy of a very pleasant stay was that the area is unknown to many, yet so beautiful, from the lush valleys to the stark Pennine hills.", "title": "didn't live up to expectations", "user": "KatariLeicester", "date": "May 10, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 63718336}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 16, "average": 35, "very good": 65, "terrible": 10, "excellent": 110}, "aka": "Lovelady Shield Country Hotel", "slim_ranking": 0.454545454545}