{"user_rating": 4.0, "review_count": 393, "name": "Luccombe Hall Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "We travelled for a wedding nearby- the hotel staff were charming, our room had a sea view which was fab( and cost extra) the bathroom was tiny and a 1970s pink suite but clean, the bed a very small double- busy furnishings dated and a bit chipped but clean. Completely eccentric breakfast system where you had to sit at the same table allocated to your room rather than being able to sit in conservatory. My sister in law who was travelling alone on the night before was sat at the table next to the ktchen as a single person which was poor particularly as the languauge from the kitchen as rather offensive.", "title": "somewhat dated higgledy piggledy hotel but charming staff", "user": "surreysarahjk", "date": "July 1, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 4.0, "service": 3.0, "rooms": 2.0}, "id": 33644972}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Brakfast fine but poached eggs hard two days running!", "title": "A comfortable and hospitable hotel with great staff", "user": "CherylD23", "date": "June 10, 2009", "detail_rating": {"cleanliness": 3.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 32017358}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Lovely gardens in a typically english slightly disheveled way", "title": "Excellent value, good location, highly recommended", "user": "J W RUGBY", "date": "June 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 31406641}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Pool was a bit manky decided not to go in but the Therapist who gave me a massage was fantastic a lovely lady and a brilliant massage- highly recommended", "title": "Typically English hotel with friendly and efficient staff, clean rooms, lovely food and beautiful views!!", "user": "gillpaine", "date": "May 30, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 31173214}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "We booked for 3 nights and stayed an extra night as we liked it so much. The (superior) room was a good size, nicely furnished and the travel cot for our toddler was obviously quite new. There was a flat screen tv and dvd player up on the wall out of any little hand's reach. Bathroom was fairly small though very clean. The gardens are very well kept and provide plenty of seating and loungers and there is a nice small play area. Dinner was included in our package and the food was extremely good, both in quality and portion size, with a choice of at least 6 dishes for each course. The staff were all friendly and no request was too much trouble. Unfortunately our son was sick on the very first night, but the staff responded promptly with clean bedding, towels and disinfectant and were very understanding. We will definitely return.", "title": "Very pleasant, super location,good food and good value", "user": "david218", "date": "May 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 30784595}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "This hotel is an amazing place to stay as the food is amazing, the people are very very polite and friendly and the room and views where amazing. so all round i would recommend this place to anyone and already have to family and friends as me and my fiancee had an amazing time.", "title": "amazing place to stay 5 star", "user": "samrichardson22", "date": "May 25, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30687813}, {"rating": 1.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "5 STAR *****", "title": "Stay Clear - Worst place on the Island yet!", "helpfulness": 2, "user": "norakat79", "date": "May 15, 2009", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 30042053}, {"rating": 2.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Whilst the website boasts lovely looking rooms & offers treatments, do not let this fool you. Before arrival I tried to book a treatment & was told that they do not have their own treatment staff, only an external person who only works part time was available and not at any times that could suit over the weekend period.", "title": "stuck in the 70s", "helpfulness": 1, "user": "maxineWorcestershire", "date": "April 19, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 28314554}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Due to the Ferry we arrived late and was pleased to see a key had been left at the unmanned reception with our name on. Initial impression was worrying as the carpets in the main hall and stair way is way past worn.", "title": "Fantastic 40th Wedding Anniversary Celebration", "user": "davidheysham", "date": "April 14, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28004194}, {"rating": 1.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "We had booked an executive room with the nice 4 poster bed & seaviews. What we got was a freezing cold seaview room with a small solid hard bed. The carpet was worn, the bathroom was minimal, the room was basic.", "title": "25 years in the business very very poor", "helpfulness": 2, "user": "marc088", "date": "April 14, 2009", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 3.0, "service": 2.0, "rooms": 2.0}, "id": 27999206}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "first impressions were that the hotel was a bit dated ,we were put into room one which was next to the reception downstairs! it was the only room downstairs and i think it must be a disabeled room as there were handles in the bathroom ,but cos my oh didnt want me to start asking to be moved ,we didnt say anything . we paid £99 each on the travelzoo deal ant it included the ferry and 2 nights with meals ,as i expected we could hear everything going on outside the room at night ,but it was out of season and we were the youngest in the hotel ,so it could have been alot worse ,the girl who opened up in the morning should wear slippers to stop her clip clop of heels thumping around at 06.30 for an hour..anyway thats the only bad point ,the service is def a 4-5 star,the food is excellent ,the gym is poor though ,the indoor pool is great the sauna and the squash court are as well. location is good ,out of season ,there is not alot to do ,but for a get away its brill.", "title": "great food ,lovely staff,dont get room one though!", "user": "smilespiles", "date": "March 28, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 26961604}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "We took advantage of a special offer which included the car ferry. The hotel is in an excellent location with views out to sea. The garden would be delightful on a summer day. The food was very good with plenty of choice. Our only niggles were that the overall fabric of the building could do with some TLC. Some decoration would not go amiss. Our room was fine but the windowsill was chipped, the soap dish in the bathroom was loose and other minor things. Had we paid full price we would have found these niggles more important.", "title": "Excellent value", "user": "skyjilly", "date": "March 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 26921847}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled with family", "text": "The, mainly young, staff were all very friendly and efficient", "title": "Nice hotel, great food and the friendliest staff ever!", "user": "janeySLondonEngland", "date": "February 20, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 3.0}, "id": 24840260}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "We have just returned from this hotel after taking advantage of the £99 2 night Travelzoo break. It was amazing value and included the ferry crossing from Portsmouth.", "title": "It's refreshing to see staff actually enjoying their job!", "helpfulness": 1, "user": "dymondgeezer", "date": "February 9, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 24393317}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "The hotel was very easy to find using the directions provided by the hotel. We had no problems parking our car during our stay which was a surprise considering what other TA reviewers had said and it was half-term which meant the hotel was full.", "title": "Super romantic break", "user": "Starwoman33", "date": "February 1, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 24081733, "likes": {"liked": "— Warm friendly atmosphere provided by staff at the hotel", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed December 2008, traveled with family", "text": "Our family had a delightful 3 day break in the hotel. Having booked it via the internet for an extended family group of 5 adults, we were unsure as to what we could expect. Well it surpassed our expectations. Very helpful reception staff,delightful Italian head waiter, 5 star food and plesent evening entertainment. The pool was 84', more like a bath ,and the son wished he had taken his squash racket. We had a refurbished room with an enchanting view over the December sea.", "title": "Christingle Time Break", "helpfulness": 1, "user": "OurTwoPennyWorth", "date": "January 5, 2009", "detail_rating": {"front_desk": 5.0, "service": 5.0, "business": 5.0, "cleanliness": 5.0, "rooms": 4.0, "location": 5.0}, "id": 23293651, "likes": {"liked": "— reading room with papers", "disliked": "— small double room sold as a single was an interest 80's throw back complete with hanging nylon net!"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "A 3 star hotel offering 5 star services.", "title": "An enjoyable break - Could have been better", "helpfulness": 1, "user": "CerocDJ", "date": "July 15, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 3.0, "value": 2.0, "location": 4.0, "rooms": 3.0}, "id": 17894803, "likes": {"liked": "— Great Views, Breakfast and comfortable surroundings", "disliked": "— Management approach, Price, Car Parking"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "For us it was excellent value for money!", "title": "Loved the location", "user": "supelham", "date": "July 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 5.0}, "id": 17684269, "likes": {"liked": "— good location and friendly staff", "disliked": "— perhaps a lift to upper floors - but understand difficulty with older building"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2008", "text": "Booked the Luccombe Hall Hotel as a birthday weekend break with my partner for 2 nights on 11/12th July. As always, we read previous reviews and on balance thought that it was worth a visit, especially as there was an offer for the 2 night stay on BB basis and half price ferry which the hotel arranged. We also decided to upgrade to seaview room (worth doing). Booking process was ok, although I had to chase the confirmation e-mail which contained the ferry timing and ticket details.", "title": "Hotel with the view-truly stanning", "user": "nettLondon", "date": "April 30, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 15489882, "likes": {"liked": "— view", "disliked": "— nothing"}}, {"rating": 3.0, "title": "Okay but not great", "text": "The hotel location is great, but the word 'country' in the hotel name is misleading as it is 5 minutes from Shanklin centre. However it is set in lovely gardens, right by the cliffs and commands magnificent views.", "helpfulness": 1, "user": "Sharonswe", "date": "April 28, 2008", "id": 15420506}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 33, "average": 57, "very good": 142, "terrible": 26, "excellent": 135}, "aka": "Luccombe Hall Shanklin", "slim_ranking": 0.563636363636, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.5, "location": 4.5}, "description": "Located on the outskirts of the quaint Shanklin Old Village and within 4 acres of stunning landscaped cliff-top gardens, Luccombe Hall Country House Hotel offers the best position, best views and best range of facilities of any hotel on the Isle of Wight. With direct access to the sandy beach below, its great for a summer escape, or snuggle up in winter in the Bishops Snug with its roaring log fire.With a great range of indoor and outdoor leisure facilities you can be as active or relaxed as you please. Facilities include indoor and hot tub, sauna, outdoor pool, games room with table tennis, pool tables, squash court, childrens play area, family board games, outdoor play area with trampoline, slides, swings, mini putting and giant chess and draughts.Bedrooms options include Standard Rooms, Sea-Facing Rooms, Superior Sea-Facing Rooms and Executive Rooms with Private Balcony.Delicious meals are served in the Grand View Restaurant including a mouthwatering 3 course dinner and freshly prepared full english breakfast. Snacks are available from the Grand View Tea Garden overlooking the sea (during winter snacks available from the hotel bar and lounges)"}