{"user_rating": 4.5, "review_count": 336, "name": "Lucknam Park", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We have been coming to Lucknam Park since it opened in 1987/8; and each time it gets better. My wife and I just celebrated our Golden Wedding at Lucknam Park, it was sublime! We were upgraded to a beautiful suite \" The Orchid Room\" and the pampering and treatment by all the staff, was indeed fantastic. Lucknam is the most perfect place in England, nothing can come up to the Five Stars it deserves; the interiors, so clean, fresh and comfortable, and the gardens immaculate. We look forward to returning again and again and again!! Thank you all at Lucknam Park for such a wonderful experience, yet again. Anthony & Gloria Hyatt. Cardiff. UK", "title": "An Oasis of Peace & Tranquility", "helpfulness": 1, "user": "ANTHONYAHYATT", "date": "August 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116570937}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Our second time stay at Lucknam Park. Spotless and friendly service. I must say, it is difficult to find good service for mixed race couple like us. Swimming pool facility is one of the best I experienced. Very pricy, but the pool and sauna makes it quite OK.", "title": "Great place. Horrible child's bed (and The Brasserie)!!", "helpfulness": 1, "user": "Chiki-ko", "date": "August 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 116379214}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "However, I must note that our child's bed (sofa bed / spare bed) is absolutely awful. So old, as we lie down, we can feel the hard spring on our back. Very painful, noisy, and uncomfortable. One spring was poking out and dangerous. Please beware families. I was surprised to see such thing at this hotel. Also, food at The Brasserie restaurant at the spa is absolutely horrible. Not tasty at all on every plate we tried. Waste of time and money. Shame, service at the restaurant is so attentive. I don't understand why this restaurant is like this, while Park restaurant is so great. For eating out in this area, I very strongly recommend Stanton Manor. Their lunch was 2/3 the price of Brasserie, and everything we had was so fresh and delicious.", "title": "Beautiful. We'll be back!", "helpfulness": 2, "user": "alondongirl", "date": "August 3, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 116201481}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We went as a group of families with young children and all of us were not disappointed. The hotel was beautiful, especially the grounds. The entrance is awe inspiring. Took the kids for a pony ride on a beautiful sunny day, and then swimming in the afternoon. They had a great time.", "title": "Beautiful setting, great food & amazing spa", "helpfulness": 1, "user": "sausages4supper", "date": "July 21, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 115605671}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Food is good, service is wonderful. The spa and swimming pool are very nice.", "title": "Wonderful Spa. Great Staff", "helpfulness": 1, "user": "Bathlady", "date": "July 19, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 115518341}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "My husband and I stayed here for a couple of nights recently and loved every minute. Beautiful setting and building, really thoughtfully planted gardens between the hotel and the modern spa at the back of the building, excellent large pool, luxurious outdoor jacuzzi and superb food and service. I especially enjoyed playing backgammon and reading the papers in the wood panelled library before dinner and lazing in the spa. The meal in the Park was really outstanding and I'd like to give a namecheck to Iram (might be mis spelled!) who is the perfect mix of knowledgable, friendly and professional. The bedroom was the weakest point as it was pretty small and chintzy (in keeping with the house style) rather than smart. It was a standard room and we had been warned by a friend that a standard would not blow us away. That's fine by us as we planned to spend time everywhere but the room anyway.", "title": "country house R&R with fab food", "helpfulness": 3, "user": "AlYorks", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120417840}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Lucknam Park was great for a winter w/e but could imagine it being spot on all year round. Take note hubby - I want to go back!", "title": "Fantastic English Country hotel", "helpfulness": 1, "user": "emraki", "date": "November 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120373914}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled with friends", "text": "This is a beautiful hotel, that does everything perfectly. We love going there for the weekend, due to the facilities it has, whether rain or shine, as well as the beautiful house, rooms and food. We have stayed in a few different rooms in the main house and they have all been great.", "title": "Classic Spa", "user": "DreamJetsetter", "date": "November 8, 2011", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0}, "id": 120339779}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The service is excellent, and the staff always remember who guests are. My only concern is that they seem to be catering more and more towards families, which will eventually put me off going as a couple. At the moment though, its gorgeous.", "title": "Traditional luxury", "user": "jazzyjulesLondon", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 120291014}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Hopefully I'll be back soon.", "title": "Stunningly beautiful Hotel", "user": "Jeff074", "date": "November 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 120274286}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My wife and I celebrated our anniversary at Lucknam park...it was definitely the right choice. From the point of entering the immense landscape surrounding manor house you are transported into a place of true relaxation. The suite we stayed in was great, overlooking the courtyard. The cuisine was excellent, with dinner in the Park restaurant a real experience and complemented very well by a good wine list. The aspect that we were most enamoured with was the spa, a purpose built haven of relaxation. The treatments and the facilities were outstanding, as was the service, throughout our stay. We will be returning for sure.", "title": "Fantastic!", "user": "KDS01", "date": "September 17, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 118227631}, {"rating": 1.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "My daughter and I went to Lucknam for a mother and daughter couple of days and we could have stayed at home and been more comfortable.", "title": "VERY DISAPPOINTING", "helpfulness": 8, "user": "huggablemum", "date": "September 12, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 2.0, "value": 1.0, "service": 3.0}, "id": 117991810}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We arrived at the hotel at 1:40 pm and asked if we could check into our room a little early - rooms available from 2.00pm as we had massages and treatments booked as well as dinner at 8.00pm. To our surprise we were told that check in is 2.00pm and not before! I wanted to complain but my daughter said to let it go. We had an ok lunch in the brasserie and then had to go to the spa to get ready for our treatments which meant that our bags were taken to the room for us to unpack after our relaxing treatments.", "title": "Loved it!", "user": "Loz_b_11", "date": "August 31, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "service": 5.0}, "id": 117485216}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The treatments were ok - my daughter had a very good beautician, I felt that mine was very inexperienced. When we left the spa we had to wait for the receptionist to finish her phone call before she could call someone to show us to our room as we had no idea where on the property it was. Finally we were shown to the room.", "title": "Stunning wonderful Hotel and service", "user": "hayley.gibbs", "date": "August 30, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117452313}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "It was in a cottage block in the courtyard. The room itself was large - we had chosen a twin bedded room. My daughter went to have a shower and was quickly back saying that the shower was full of mould. It was but by now it was half past six and we needed to get ready for dinnner and so I called reception and asked them to thoroughly clean the bathroom once we had gone to dinner. I had a good look around the room after that and was less than impressed to discover that the armchair was full of dust, the underneath of the bed was also dusty with debris there. You have to wonder why we were kept waiting for the room if it was not cleaned.", "title": "Disappointed", "helpfulness": 9, "user": "orcas33", "date": "August 30, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 1.0, "value": 3.0, "service": 3.0}, "id": 117447234}, {"rating": 1.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Our experience here was so unrewarding that I do not feel it warrants the attention to report further. One word of warning - give the gastronomy here a miss. And one of advice - if you do your research there is plenty of alternative choice of the level that Lucknam Park aims for in the nearby neighboring areas. One fair word - the spa is very pleasant- largely due to the fact that it is recently opened.", "title": "Don't expect much luck at the Lucknam", "helpfulness": 9, "user": "grinchee", "date": "October 22, 2011", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 119603267}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "During my final week in the UK this trip, I had the great fortune to stay for a night in this lovely country estate.", "title": "A grand retreat, even for one night ...", "helpfulness": 2, "user": "CynWorldTraveller", "date": "September 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 118575468}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "I've read many of the reviews, both positive and less so. As we know, this site is dedicated to individual experiences, and we all look for different things in accommodation, dining, spa, etc.", "title": "Good in parts", "helpfulness": 4, "user": "Montezuma36", "date": "September 20, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 118388893}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "I easily view my stay at Lucknam Park as 5* from the moment I entered the main hall. Rocio greeted me immediately, and the entire check in process was efficient and welcoming. She took me on a tour of the hotel, and invited me to the spa to rest after my trip up from London. She showed me to my room, which was lovely, clean and perfectly appointed.", "title": "3* quality with a 5* price tag", "helpfulness": 6, "user": "emmapickfordwardle", "date": "September 20, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118352831}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I took her up on the suggestion to visit the spa, was again greeted with a warm smile by the gentleman manning the desk, provided with a robe and slippers and shown to the changing rooms. The pool and spa area was clean and the facilities top rate.", "title": "wonderful weekend hide-away place", "user": "Christine2112", "date": "September 19, 2011", "detail_rating": {"value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 118326041}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 6, "average": 16, "very good": 64, "terrible": 2, "excellent": 248}, "aka": "Lucknam Park Hotel Colerne", "slim_ranking": 1.0}