{"user_rating": 4.0, "review_count": 182, "name": "Luna Beach Resort", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Awesome dive boat and the ease of diving is outstanding. The resort is about a 10 minute walk to the West End and 20-30 minute walk to West Bay. Great location and very quiet. But the sand flies were so bad that you couldn't be outside for more than a minute without getting bit even with Deet bug spray on! Forget reading a book on the beach or in the hammock. We have been a lot of places in the world and Luna Beach had the worst bug issue by far.", "title": "Nice Resort - horrible bugs!!!!!!", "user": "TravelMonkey73", "date": "June 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 32490299}, {"rating": 5.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "The resort was very clean and Scott was an fantastic bartender. Lots of restaurants just a short walk from hotel. Lobster Pot, Chili Pepper, Mavis & Dixie, Rudy's for banana pancakes and Bare feet bar for Sunday BBQ.", "title": "Love this Place!", "helpfulness": 1, "user": "Treyball34", "date": "June 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 32051124}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled solo", "text": "The Luna Beach Resort is an excellent place to stay in Roatan. The resort is isolated between West Bay and West End, but closer to West End. Beautiful jungle fauna and birds surround the area. There is about a 10 minute walk to the town of West End. There are restaurants, shops and bars on the strip.", "title": "The Best of Roatan!", "helpfulness": 1, "user": "bobthefireman3", "date": "June 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 31513606}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "Room - Back to the resort, our room was perfect. My wife and I stayed in a 1 Bedroom (Deck Beach View-side door room). The place was very clean, affordable and about 50 feet from the ocean. We had our own refrigerator, A/C controls and plenty of space in the room.", "title": "Heaven on Earth", "user": "TravelLoverDallas", "date": "May 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 30591288}, {"rating": 3.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "Bar/Restaurant - We had breakfast every morning at the hotel. About $5 for eggs, toast and bacon/ham. Not a bad price and it was convenient. We never ate dinner at the restaurant, but we had a few drinks. They have the local beer and make pretty good strawberry daiquiri's (yes, i had a few of them). The service was very good.", "title": "A Huge Disappointment", "user": "flowerdiver", "date": "May 22, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 30526860}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Luna Beach Resort was everything we could ask for and so much more. After a lot of research of all the different places to stay in Roatan I decided on Luna Beach. And, boy am I glad I did. I wanted a place with a good, safe, respected dive shop (because I was and did get my diving certification). I also wanted a place with a beach so my wife could sit in the sun and go swimming when I was off doing my diving training. I also wanted some place that was quiet yet within walking distance of restaurants, shops etc. I didn't want to be too isolated. Well, Luna Beach fit all those criterias.", "title": "Everything We Could Ask For and More", "helpfulness": 3, "user": "brothbart", "date": "August 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 36980793}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "First, the dive shop is top rate. You may pay a little more here, but it is really worth it. The equipment is all new and top notch and you can tell that safety is their utmost importance. Neil, the diving instructor, is a top rate instructor who will make you understand how important your breathing is to your buoyancy and will teach you little tricks to make you a better diver. He is very professional and you can tell he really cares. Nate, the diving guide, really knows his stuff and has a knack for finding the things you want to see. I cannot say more about how professional the dive staff is.", "title": "A HIDDEN GEM NOT TO BE MISSED!", "helpfulness": 2, "user": "twotravelersDallas", "date": "July 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 35374419}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The resort, is between West End and West Bay. It is probably about a 40 minute walk to the end of West Bay and about a 30 minute walk to the end of West End. We walked into West End almost every night to eat. We even walked to the Butterfly Garden from Luna Beach. However, even though you are a 10 minute walk to the begining of West End shops and restaurants Luna Beach is still quiet and you can relax and nap to your heart's content. The beach is very nice and snorkeling from their beach is awesome. I saw rays, lobsters, barracuda and tons of other fish and coral.", "title": "The Island Beach Vacation Better than our Dreams", "helpfulness": 3, "user": "mgshc", "date": "July 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 34468280}, {"rating": 5.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "The room was clean and the bed was very comfortable. I know some of noted the decour, but who cares what the decour of the room is, as long as it is clean and comfortable. You aren't spending that much time in there.", "title": "Relaxation at it's best!", "helpfulness": 1, "user": "matador50", "date": "July 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34220167}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "They have hot water and they have a generator that will keep the power on (which means the air conditioner). We learned at the end of our vacation that the power was on and off for most of our stay, but we had no idead because Lars, the manager, would crank up the generator anytime the power went off. Speaking of Lars, he is a great guy that will help you in any way he can. All of the staff is very accomodating and helpful. Including Herman, a taxi driver, who picked us up at the airport and took us on a tour of the island.", "title": "Nice facility but something lacking (esp. at the price)", "user": "jeffbor", "date": "July 6, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 4.0}, "id": 33988327}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Just returned from another great stay at Luna Beach. We spent 2 weeks at the resort last year and enjoyed ourselves so much we had to return. Most of the staff members were the same as before and gave us a warm welcome back. The resort is private and quiet, a great place to recharge the batteries between dives. The restaurant and bar are great! Good food, strong drinks and great company.", "title": "A great resort and a great dive shop", "user": "divedog48", "date": "April 5, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 27444610}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled with family", "text": "The dive op is smaller than some of the other resorts so you get to know the staff and it's like diving with friends. PADI guidelines are strictly observed and safety is a priority. No cowboys here! The dive masters, Martin and David provide excellent briefings before each dive and they really know the reefs.They have a great comfortable boat with a table for camaras and other things and a rinse tank on board. The dive shop provides a drying room for your gear so its ready each day. The boat goes out three times each day so you can dive as much as you like (or as little) We really look forward to our next visit! Our thanks to Mr. Chuck, Lars, Neil and all the staff for making our stay so great.", "title": "We will return to Luna Beach", "helpfulness": 1, "user": "Glidster", "date": "March 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 26678399}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "After several challenging and fun days near LaCieba, we decided to relax and chill at Luna. Great dock and beach for swimming and a wonderful area of coral for snorkeling. We saw lobster, a myraid of fish and coral; and even a barracuda (with big teeth) right off shore. My wife thought the 'cuda was eyeing her up.", "title": "Fantastic Location - Figure Out What's Importatant To You First", "helpfulness": 3, "user": "Off-the-beaten", "date": "March 18, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 26380939}, {"rating": 4.0, "stay_parameters": "Stayed February 2009", "text": "I was somewhat surprised at an earlier review which chided Luna for security. They have extremely tight security (if you know how to travel, you take precautions in any 3rd world country) It has a great location between West End and West Bay-we were comfortable walking either way. One of the security guards was Horhay....spoke excellent english and kept an eye on the place. I trusted this place more than any place we stayed during our trip to Honduras.", "title": "Should have gone to Maui", "helpfulness": 1, "user": "travelerstrail", "date": "March 16, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 1.0, "service": 3.0, "rooms": 5.0}, "id": 26287106}, {"rating": 4.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "Breakfasts and nachos to die for-ask for the Guacomole. We had an excellent waiter ( I think his name is Scott) and Hiram makes some of the best drinks we've ever had.", "title": "Great position right on stunning beach.", "user": "suejm", "date": "March 16, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 26267639}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled solo", "text": "I first entered the property from atop a hill where I observed panoramic views of the jungle and the beautiful private-beach dotted with cabanas. My comfortably furnished villa was large enough to accommodate a crowd. During my first stay in January of 2009, the staff catered an impromptu, birtyday-party for newly made friends who were guest at Luna Beach. Fully equipped kitchens made for easy living, and I still communicate with the friends who I met on that trip. As a single woman, I felt very comfortable in the resort, as well as walking the ten-minute walk on the beach to the center of the city.", "title": "Luna Beach Resort - Unspoiled Paradise", "user": "CherimTexas", "date": "May 21, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 30447864}, {"rating": 5.0, "title": "Luna Beach Resort Dive Operation", "text": "I can't offer enough praise for the people who operate the resort. The owner and manager live on property and are readily available to assist you with any needs you might have. The public places, including an open-air restaurant and two bars are tropical and friendly, and the cooks were willing to help with my special dietary needs.", "user": "popsicle1diver", "date": "May 12, 2009", "id": 29877804}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled as a couple", "text": "I started planning my second trip , a dive-certification trip, the moment I returned to the U.S. This time I invited my daughter and several girl-friends to join me. Two were PADI certified that week from the Luna Beach Dive Shop. All the dive classes were conducted at the resort. My daughter and friends felt very safe and comfortable knowing that Neil, the dive-master was keeping a watchful eye over them at all times.", "title": "We enjoyed our stay but there is room for improvement!", "user": "Diver4eva", "date": "May 1, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 29113576}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "We are planning to return again this year for a family-reunion vacation.", "title": "You will love Luna Beach!", "user": "islanddaisy", "date": "April 27, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28893992}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled with friends", "text": "Three times in one year - WE LOVE IT THERE!", "title": "Great place. Great people. Great dives!", "user": "les_rae", "date": "April 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 28805181}], "location": {"country": "Honduras", "continent": "Central America"}, "variance": {"poor": 7, "average": 21, "very good": 39, "terrible": 15, "excellent": 100}, "aka": "Luna Beach Hotel West End", "slim_ranking": 1.0, "description": "This resort offers a perfect get away, with Beach Suites on the beach, Tropical Houses and Premium Houses up in the Jungle. With a private beach, beautiful sunsets, first class Dive Center, full service restaurant/bar, gift shop, beautiful landscaping, swimming pool, and much more all on 33 acres. Their location is superb, with its very secluded setting, but a mere 10 minute walk along the beach to West End, so no expensive taxi fares."}