{"user_rating": 4.0, "review_count": 612, "name": "Luton Hoo Hotel Golf and Spa", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I too was concerned by recent negative reviews of this hotel but went ahead and booked it anyway as a birthday treat for my wife. I found a reduced advance purchase rate on their website and booked a standard room.", "title": "Wonderful overnight stay", "helpfulness": 1, "user": "phill247", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78904888}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with friends", "text": "The staff throughout the hotel are friendly, polite and efficient providing an excellent level of service. The greeting from the doorman and reception staff was most memorable and they could not do enough to help explaining the layout of the hotel, taking our luggage, parking the car, personally escorting us to our room, bringing the luggage up, checking everything was okay, I could go on.", "title": "Great Weekend Venue for Golf", "user": "stallard", "date": "September 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78470155}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "I was amazed with the location and standard of the room we were allocated in the Mansion House. I cannot believe that given the quality and location it was their most 'basic' room. The grounds, as others have mentioned, are spectacular and it is a nice touch that when encountering gardeners / maintenance staff out and about many smile and say 'hello'. There are wonderful strolls to be had and many very pleasant spots in the grounds to either sit and relax or enjoy a drink.", "title": "Lovely setting, great staff.", "user": "Moosey41", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 77796962}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We made use of the Spa and pool where the quality of the facilities is good. There was a sign saying that the vitality pool was not in use but people were using it anyway although all the functions did not appear to be operating properly. This was one of the few (minor) disappointing elements to our stay. The two bars at the stables/spa area are more relaxed than in the mansion so there really is something to suit a variety of tastes.", "title": "the finest befordshire has to offer", "helpfulness": 1, "user": "lutonlagerlout", "date": "August 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 77359634}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "We enjoyed an excellent dinner in the opulent surroundings of the Werner restaurant. The service was again very good with only a couple of issues that only get a mention because the rest of the service was such a high standard e.g. it would be nice for the side dishes ordered to be left at the table rather than whisked away and I would have liked the selection of cheese to be explained to me. Again, very minor issues and I suppose I could have asked for the above if I wanted. The atmosphere is refined and quiet but this is the nature of the experience in the Werner, there are more relaxed dining options available and we enjoyed the evening as a special occasion.", "title": "EXCELLENT STAFF AND VENUE !!!!", "user": "buddylove13", "date": "August 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77231086}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "If you want to stay somewhere that feels like it's in the middle of nowhere, but less than 5 mins from the center of Harpenden, then Luton Hoo is a great choice.", "title": "Stunning location", "user": "eppingphil", "date": "November 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 184966711}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "It's grounds are so huge they have their own fleet of black taxis to run you around.", "title": "Outstanding service at Elegant Golf Hotel", "user": "Charlie C", "date": "November 11, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 184326865}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "Lots of different types of rooms, i stayed in the Flowergarden. My huge ground floor room had a stunning feature bed, sofa, armchair, coffee table, desk and chair.", "title": "Lovely Weekend with the Kids!", "user": "samndan2000", "date": "November 4, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 183561595}, {"rating": 1.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "I recommend this for the perfect couples weekend away. You can even bag 18 holes and a quick spa - perfect", "title": "Poor Afternoon Tea", "helpfulness": 6, "user": "Diana_dors", "date": "November 3, 2013", "detail_rating": {"value": 1.0, "service": 1.0}, "id": 183347270}, {"rating": 5.0, "title": "Stately home elegance and outstanding service", "text": "Our group of five get together every year to play golf at a different venue. We like somewhere where the golf isn't taken too seriously, we can relax and have a nice meal. Luton Hoo exceeded all expectations. The staff could not do enough for us to the extent of keeping the golf bar open late so we could watch the rugby on TV. The rooms, spa and mansion were sumptuous and the food in the brasserie full of flavour. The atmosphere late evening in the mansion rooms was very classy - nice sofas, attentive staff and all sat in the palatial surroundings of a stately home. All round great attention to detail, down to the non-alcoholic cocktails....and we didn't even have time to see the gardens etc. Highly recommended.", "user": "Trevspar", "date": "November 1, 2013", "id": 183180751}, {"rating": 3.0, "title": "Little touches mean a lot", "text": "Not stayed in the hotel but have just returned from a lunch in the Brasserie with visiting family. This was our second visit and really it did not impress as a 5 star hotel restaurant should. Our main waiter was good but some of the other waiting staff were very young and inexperienced and as far as we could tell were not being supervised. Asking who was having the soup when there was only one person with a spoon in front of them, stretching over in front of customers to reach dirty plates, not opening the second bottle of wine to breathe, not providing forks with dessert spoons when tarts were being served, bringing the wrong drinks order and so it went on. It sounds rather petty but they all added up to irritation when we wanted to have an impressive meal. The bill was certainly impressive and one I wouldn't have minded paying had all the above not happened. The jazz was good but a touch too loud as we couldn't have a conversation without shouting. Rather disappointed.", "user": "UKBells", "date": "December 8, 2013", "id": 187076780}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "My wife and i stayed here as part of a anniversary - we stayed in the modern part - not the main house. But the place was gorgeous, spotless, very large room with great TV and bathroom. The big plus was that it was close to a very nice indoor pool and spar. At night we ate in the restaurant, service and food was very good. In the morning we had breakfast in the main house and we could have stayed there all day - it was like going back in time and the breakfast was probably the best I have ever had. Later that day we walked around the grounds and down to the lake. Will be staying here again without doubt!", "title": "A taste of England", "user": "keithonmove", "date": "December 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186851279}, {"rating": 2.0, "stay_parameters": "Stayed October 2013, traveled with friends", "text": "Stayed here overnight in October in the main Mansion house. The building and our room were amazing and pleased we paid the extra to stay here rather than one of the out buildlings. That said, maintenance could be improved - half the lights in the dining room were not working.", "title": "Lovely building, poor service", "helpfulness": 1, "user": "Robbiebgg", "date": "December 4, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 186715812}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "On the basis that this is a five star hotel and you are paying for that service, dinner was not a good experience. Whilst the food was good, the service was awful, resulting in a letter of complaint being written to the General Manager. Maybe it is a sign of the lack of service in this place overall as I have never had an acknowledgement, let alone a reply!", "title": "A pleasant stay but lacking in the little details", "user": "Calthrop", "date": "December 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186541030}, {"rating": 4.0, "stay_parameters": "Stayed December 2013, traveled with family", "text": "I stayed here this weekend with my wife for one night on a dinner, bed and breakfast rate.", "title": "Pretty good spa treatment and dog friendly", "helpfulness": 1, "user": "europaexplorer", "date": "December 2, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 186505762}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "improbably located within sight (but not sound) of luton airport this is one very impressive 'country pile', with a suitably 'spicy history', these days with all mod con and excellent food and drink. was there as part of of a conference group and lodged in the 'outhouse' for this purpose, but absolutely nothing not to like about the spacious, quiet rooms.", "title": "downton abbey for real", "user": "Christopher K", "date": "November 30, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186346810}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled as a couple", "text": "We love this hotel so much it is our choice of hotel for both mine and my husband's birthday and wedding anniversary. We had a fantastic upgrade for our latest stay which was our wedding anniversary making it very special. The food in all the restaurants is delicious and room service breakfast is the best I have had anywhere.", "title": "3 times this year !", "helpfulness": 1, "user": "ALIHerts", "date": "November 28, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 186187547}, {"rating": 4.0, "stay_parameters": "Stayed November 2013, traveled with family", "text": "Thank you for all our enjoyable stays .", "title": "Another lovely weekend", "user": "princessshrek", "date": "November 25, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 185789022}, {"rating": 3.0, "stay_parameters": "Stayed November 2013, traveled on business", "text": "Beautiful hotel in fabulous grounds. Clay pigeon shooting was great fun. The spa is gorgeous. Food good as ever. Just lovely - wish I could have stayed longer and will be back soon.", "title": "Let down by food", "helpfulness": 1, "user": "brennP", "date": "November 19, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 185211030}, {"rating": 5.0, "stay_parameters": "Stayed November 2013, traveled with friends", "text": "You must stay in the Mansion. Rooms are large and have lots of features of the old mansion.", "title": "Simply amazing!", "user": "Navah", "date": "November 18, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 185109024}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled with family", "text": "I searched Trip advisor Luton area restaurants, as I wanted to place my review there as we only dined at the hotel. And I do not think it is fair to review the whole hotel based on the restaurant. However, having said that based on my visit to the Adam's Brassiere I would not recommend neither the restaurant or the hotel.", "title": "Restaurant Visit only - Very poor", "helpfulness": 3, "user": "ukboi", "date": "January 25, 2011", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0}, "id": 94398576}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Hospitality to me is based primarily on two things service and the food. Service, what service !, slow poorly trained staff, not really interested in the guests, zero effort.", "title": "Luton Hoo - Luxury at its best", "user": "IMAD123", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94127164}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "The wine was poorly served and kept, and the food was appalling. My main course steak was the worst served to me in any restaurant ever. Overcooked but cold, dry and tough and no taste. Sides equally appalling, especially the mushroom.", "title": "Don't believe everything that you read - lovely hotel.", "helpfulness": 1, "user": "MandS44", "date": "January 5, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 91860889}, {"rating": 1.0, "stay_parameters": "Stayed December 2010, traveled on business", "text": "Surrounding’s, for a newish hotel dated and warn. Poorly laid out room.", "title": "Faulty Towers /Chateau Grim", "helpfulness": 3, "user": "fivestarconnoisseur", "date": "December 22, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 90466312}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "I wanted to deduct from the bill, but rather than causing a scene felt it best to leave. I was taught the customer always wins, because they don't return and they tell their friends and family. Well I certainly won't return . Nor should you.", "title": "Memorable Afternoon Tea!", "helpfulness": 2, "user": "johnzina", "date": "December 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 90399441}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "Really loved this old English style stately home and its beautiful grounds. I found the hotel on wedding website", "title": "So Good couldnt believe it!!!!", "helpfulness": 3, "user": "jerry662013", "date": "October 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 183053382}, {"rating": 5.0, "stay_parameters": "Stayed October 2013, traveled with family", "text": "http://www.itsyourbigday.co.uk/venues/step-into-another-world-at-delightful-luton-hoo.aspx", "title": "It's a beautiful hotel to stay in.", "helpfulness": 1, "user": "L V", "date": "October 31, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 183042522}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled on business", "text": "and they raved about it. Total luxury and fabulous food. Our room overlooked the grounds and it was so different to the surrounding area. Having driven through Luton we were a bit worried but we could not fault anything. Would recommend for a romantic weekend away.", "title": "Fantastic", "user": "Nick_Tina", "date": "October 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 182257640}, {"rating": 4.0, "title": "Golf", "text": "The facilities and services are quite good. Only the breakfast is not as good as a 5-star hotel should be. The manager in the bar should be trained to be more friendly, instead of wearing a big arragant look by asking the guest, do you stay here, etc.", "user": "Paul W", "date": "October 24, 2013", "id": 182198587}, {"rating": 4.0, "stay_parameters": "Stayed October 2013, traveled as a couple", "text": "I was fortunate enough to stay for a couple of days here in September 2013. I stayed in the Warren Weir area which is a modern building but built within the character of the estate. The rooms are fantastic with plenty of space and the beds, bedding and pillows were to die for. In fact I think it was one of the first trips where I was genuinely looking forward to bed!", "title": "Fantastic classic British mansion and funny name", "user": "Anders G", "date": "October 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 182141281}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with friends", "text": "Like many people have commented recently, some to the reviews painted a negative picture of the hotel, especially the service levels. We stayed for the weekend to play golf and enjoyed a good weekend. The venue is good with the main house being very grand, well maintained and with lots of character. Our rooms were in the \"Flower Garden\" wing which were quite roomy, clean and well presented. We ate in Adam's Brasserie where the food was excellent and the service was attentive and polite. The staff throughout the hotel very polite and any issues were dealt with quickly and without fuss. The drinks were a bit on the expensive side but otherwise we were very impressed. The main downside was the fact that being so close to Luton Airport you are faced with a lot of aircraft noise - not the Hotel's fault but annoying when playing golf!", "title": "Good Hotel, Golf will get better but shame about the Planes.", "user": "NEC235", "date": "November 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 85537052}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The golf course is relatively new and has 2 distinct halves. The \"older\" part is very flat with the newer part more sculpted but with a lot of young trees. When these grow up (at least 10-20 years) it will be a very good course. The greens were firm, quick and had subtle breaks which made them a good challenge. The main problem is that there isn't an established club at the venue and that may mean that a lot of players do not appreciate the etiquette of golf. This is shown on the greens were pitch marks are rarely repaired which makes them a bit battle scared.", "title": "Dream Wedding at Dream Location", "helpfulness": 1, "user": "monstermit", "date": "October 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82579879}, {"rating": 4.0, "title": "Lovely hotel....but no Sky Sports in a 5-star \"Golf\" resort!", "text": "For a Golf Weekend, at present there are better places to play but this venue will get better in time.", "user": "A TripAdvisor user", "date": "October 4, 2010", "id": 82015557}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We got married on 5th September 2010 and we had The Faberge Suite for our ceremony and reception, and the Romanov for our wedding breakfast. This was the most amazing day of our lives. The venue is beautiful, all of it, not just the rooms we had for the day. We were very proud to hold our wedding there.", "title": "A real stately home experience", "helpfulness": 1, "user": "spanner48", "date": "October 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 81827934}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The wedding team are exceptional. Marje our wedding coordinator was amazing from the time we enquired about the venue 2 years before our wedding date to the day we got married. she was both funny and warm and made us feel at ease, nothing was a problem to her. and the communication was excellent.", "title": "Brilliant Hotel with lovely service", "user": "talen4", "date": "September 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 80578741}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "Like many others I too fell foul of the LACK of a Mini Bar Tariif BUT had items ADDED to my bill that were not used. A full refund was recieved but only after having ti forward my complaints directly to the General Manager. - Not other comments have been recieved to date. Here is a copy of my email", "title": "Fell short of standards I expected", "user": "TonyDNorfolk_uk", "date": "December 14, 2010", "detail_rating": {"service": 1.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89820483}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "I am contacting you reference my recent stay in Room 027 in the Mansion House on Wednesday 10th November 2010.", "title": "Amazing place", "helpfulness": 1, "user": "AnnFrank", "date": "December 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 89065590}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "My main reason for contacting you on my return home is the incorrect charges made on my bill that I had not previously noticed.", "title": "Fantastic location", "user": "RGWinchmoreHill", "date": "November 29, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 88535372}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "I dispute: Check#26928 Mixed Nuts at £5.00 - These were not eaten/taken", "title": "Service above and beyond our expectations", "user": "taddyuk", "date": "November 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 88078955}, {"rating": 3.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Check#26933 Tonic Water at £1.10 - This also was not used.", "title": "A beautiful loation and lovely, comfortable rooms but food really disappointing", "user": "BigH631961", "date": "November 19, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 87616713}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 5, "variance": {"poor": 55, "average": 86, "very good": 147, "terrible": 28, "excellent": 296}, "aka": "Luton Hoo Hotel Golf", "slim_ranking": 0.230769230769, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}}