{"user_rating": 4.5, "review_count": 1423, "name": "LUX Grand Gaube", "reviews": [{"rating": 5.0, "title": "Ignore negative reviews!", "text": "Having read the negative reviews recently given, I felt compelled to add my opinion on Legends. My husband and I stayed at Legends in January for our wedding and it was truly amazing. We have stayed at 5* resorts abroad before and have been quick to complain if we are less than satisfied however Legends completely surpassed our expectations.", "helpfulness": 6, "user": "gillerscat", "date": "July 7, 2007", "id": 8071591}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The service was fantastic, food was great and the rooms (we stayed in a Deluxe) were amazing - need I say more? The all inclusive is definitely the way to go - the choice is amazing and I cant imagine there are many all inclusives that include day trips, massages etc.", "title": "Amazing", "helpfulness": 6, "user": "mucksavage", "date": "July 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 8062986}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "The only thing I would say is that unlike some reviewers, I actually found the wedding co-ordinator a bit unhelpful at times but this did nothing to spoil our enjoyment of our holiday.", "title": "Great honeymoon", "helpfulness": 7, "user": "AnotherLimerickGuy", "date": "July 3, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8044147, "likes": {"liked": "— Everything", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We would go back to Legends in a flash and have already decided we will go there to celebrate our 25th wedding anniversary as it already holds a special place in our hearts.", "title": "Excellent well ran hotel - to be enjoyed by all.", "helpfulness": 7, "user": "MickMayo", "date": "June 28, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8018890, "likes": {"liked": "— Location", "disliked": "— Bird invasion"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "The place is amazing.", "title": "Pure Heaven", "helpfulness": 8, "user": "lisakenCarlow", "date": "June 23, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7969375, "likes": {"liked": "— room was cleaned twice a day and so comfortable", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We booked our honeymoon through Trailfinders, who are excellent, and used their Wedding Gift List option which worked well. We are very grateful to our generous guests as their gifts paid for our honeymoon, which was wonderful! Unfortunately we only had a week, which was probably the biggest downside to our holiday, as we wanted to stay for two!", "title": "An amazing resort", "helpfulness": 8, "user": "Kip9", "date": "June 21, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7958109, "likes": {"liked": "— The spa ambiance & great service", "disliked": "— Nothing!"}}, {"rating": 1.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "Legends is such a fantastic resort, and we would love to go there again. You feel like you have stepped into a spa advert. The main buildings have a very open feel, with few walls, lots of wood and windows overlooking the beautiful exotic plants & flowers, pools or fishponds. The roofs are thatched (I think with sugar cane) and the ceilings are vaulted and made of wooden beams. There are bowls of floating petals and other simple decorative touches, and the ambient music is very soft and relaxing, which all adds to the spa atmosphere and feeling that you are being pampered even just walking around.", "title": "Hated it.", "helpfulness": 10, "user": "RenaeBallaratVIC", "date": "June 21, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 3.0, "rooms": 1.0}, "id": 7954647, "likes": {"liked": "— The weather", "disliked": "— EVERYTHING"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "We were greeted with refreshing towels and sparkling wine, and the unbeatable service just went on from there. The staff are extremely friendly and attentive, but not over the top. Our standard room was perfect, and in the first block near the main buildings, which was great, although the way the resort is laid out I'm sure that any room location would have its advantages. Our valet unpacked our suitcase (a real treat as we were very tired!) while we laid back and checked out what the resort had to offer.", "title": "Beautiful views and great staff", "helpfulness": 5, "user": "cvl333", "date": "June 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7937110, "likes": {"liked": "— amazing accommodation - beautiful interiors and great service", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We decided to stay half board, and don't regret this. If you go for 2 weeks and intend to stay on the resort the whole time (a pity, as there is lots to see in the rest of Mauritius, and lunch is usually provided on tours, or it gives you a chance to try somewhere if you're out exploring independently), want unlimited drinks and the chance to eat in all the restaurants, then maybe AI is for you. On half board, breakfast and dinner at the Gingko restaurant is included, and we didn't get bored eating there each time as the food was very good & every night was different menu type/theme. As it's quite open, birds often fly in and join you for breakfast, but to us they were more entertaining than a nuisance. Although we love wine, when we're on holiday we drink cocktails (my fav was the Chinese Rhythm, a bit like a Mai Tai), and these were E8.50 each. We had crepes a few times (served 4-6pm in the bar), which were E6, and had lunch on the days we weren't 'off site'. Our total bill was just over GBP200 for the extra drinks & food for the week, which is cheaper than if we went AI.", "title": "Wonderful Honeymoon", "helpfulness": 8, "user": "socks16", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7873423, "likes": {"liked": "— Extensive all inclusive package", "disliked": "— Having to book a la carte dining so far in advance"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "It unfortunately rained a few days, but then you find other things to do for entertainment ;-) , and it can be very romantic curled up together on a beach recliner under an umbrella waiting for the shower to pass! The bar was full of people escaping the rain with a drink and a book, or playing a board game (they supplied a selection). We spent one lovely rainy afternoon in the beautiful spa, going from the different jacuzzi pools (outdoor, surrounded by volcanic rock, but with palms providing some overhead shelter) to the sauna. We would have probably not gone there if it was always sunny. There's a large umbrella provided in your room. Just be careful you don't slip on the tiled floors!", "title": "Best holiday ever!", "helpfulness": 7, "user": "ATimmers", "date": "June 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7871684}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed in Legends for 7 days from the 21st June 07. I was slightly underwhelmed upon our arrival, maybe it was the flight and the spilling rain, or the hype surrounding this hotel. Also it did take us a while to get the keys to our room.", "title": "Beautiful Resort", "helpfulness": 10, "user": "RoryMc", "date": "July 18, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 8176626, "likes": {"liked": "— The location and great staff", "disliked": "— Slightly overpriced"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "That being said, the resort is lovely. Our room was fairly spacious, clean and we had a partialy sea-view. The location is beautiful, with its own stretch of beach, but as said before, it isn't total tropical paradise, but i suppose that is hard to acheive with a pretty large hotel resort, but it never felt crowded, and the hotel was low rise and very attractive. The sandy beach is lovely, even though the sea is shallow with a lot of sea-weed. There were plenty of sun-loungers, once you got out around 10 / 10.30.", "title": "An excellent hotel", "helpfulness": 4, "user": "Butty59", "date": "July 17, 2007", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 8138175}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "The All Inclusive is an absolute must, as it is very expensive otherwise, but you do get a lot included in your package. The highlight being the treatments in the Spa. We both had the coffee scrubs and massages, which were wonderfully relaxing. There was also the boat trips, golf/tennis and cookery lessons, all meals and drinks apart from Karma, all room service (which is excellent!), and the minibar each day.", "title": "Truly a wonderful and memorable experience!", "helpfulness": 4, "user": "parny", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8116075, "likes": {"liked": "— Great food/drink and service", "disliked": "— Cold pools"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The restaurants and bars are very good, with an excellent choice. Ginko is the restaurant where the buffet breakfast is served and there is a superb choice. Dinner is also served here and even though no reservations are needed, we thought it was very good quality. The italian and seafood restaurants are also very good, but we thought Karma was a little too \"fine dining\" for our taste. There was a great choice for lunch, Banyan, the italian and the beachfront bar were great, if a little slow. There was nothing like ordering your desert back at your sun lounger!", "title": "Fantastic holiday complete luxury", "helpfulness": 4, "user": "killieblonde", "date": "July 14, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8115362, "likes": {"liked": "— very clean. staff very friendly and helpful. great facilities and choice of activities.", "disliked": "— nothing. we were all inclusive so was great. watch out for any hidden extras though."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2005, traveled with family", "text": "All in all we had a wonderful time in Legends, but felt it was a little overpriced for what you got.", "title": "Heaven", "helpfulness": 3, "user": "lianne1308", "date": "July 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 8101466, "likes": {"liked": "— Clean, Helpful Staff, Amazing Hotel", "disliked": "— Loved it all"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "While planning our first trip to Mauritius, we encountered a huge amount of nice looking hotels to choose from. Thanks to the many reviews on Tripadvisor, we ended up spending our 7 days holiday in the Legends hotel, and we were certainly not disappointed. The perfect feedback of many a visitor of this hotel made us opting for the Gold-All inclusive package and I agree with all the comments: AI is a must.", "title": "Good time at Legends", "helpfulness": 6, "user": "LaurentPerrier", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 7831921, "likes": {"liked": "— staff, food, all-inclusive activities", "disliked": "— the remark 'fully booked'"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "We had a 'bad' start as South African Airways forgot to send our suitcases with us. The good news was that the staff at the airport was already notified, and the suitcases would follow on a later Air Mauritius flight, and actually arrived 01:15 am in the morning.", "title": "Chicken, Sausage, Fish, Beer, wine, Champagne. WICKED LEGENDS", "helpfulness": 15, "user": "Cherrypink", "date": "June 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7797068, "likes": {"liked": "— The View", "disliked": "— We were not there long enough"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We were welcomed at the hotel with sparkling wine and towels after which we were checked in by the competent and friendly guest relations staff.", "title": "Fantastic...!", "helpfulness": 11, "user": "hartley10", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7775267, "likes": {"liked": "— staff, food, atmosphere"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "They brought us to our (standard) room, which to us was big enough, well equipped and very clean. The bathroom is very nice with two basins, bath and and (spacious) shower. TV offers a reasonable range of channels. The minibar is rather poorly stocked with water, beer, soft drinks and a bottle of locally produced rum, which isn't worth while opening, and some candy bars and nuts.", "title": "Beyond our Expectations", "helpfulness": 3, "user": "JanisT", "date": "June 5, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7771056}, {"rating": 2.0, "stay_parameters": "Stayed June 2007, traveled with family", "text": "The hotel is nicely situated but beaches are quite small. Various readers mentioned the towel race early in the morning to 'reserve' a beach bed, which is somewhat annoying. The smaller beach area at the Banyan pool is nice, and was never overcrowded.", "title": "Overpriced and overrated!!", "helpfulness": 9, "user": "63sigs", "date": "June 4, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 2.0, "cleanliness": 5.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 7754911, "likes": {"liked": "— The Villa was of a high standard", "disliked": "— The Ridiculous Prices and average service"}}], "location": {"city": "Grand Gaube", "continent": "Africa"}, "stars": 5, "variance": {"poor": 33, "average": 83, "very good": 253, "terrible": 12, "excellent": 1042}, "aka": "Lux Grand Gaube Hotel Grand Gaube", "slim_ranking": 0.25, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Stretching languorously along the silky, sandy beach of the north coast, Legends promises Zen relaxation based on harmony and well-being. The Chinese philosophy of Feng Shui pervades the hotel. There is equilibrium of Water, Earth, Wood, Fire and Metal, which helps positive energy to circulate. This, the only Feng Shui hotel in the Indian Ocean, provides a luxurious opportunity for the body and soul to repose awhile. Space, the natural or dark brown shades of the decor, the beauty of bamboo, the stone walls and the gentle sound of the chimes - all are reminders that this is a Feng Shui world."}