{"user_rating": 3.0, "review_count": 3399, "name": "LVH - Las Vegas Hotel & Casino", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I was in town for a large conference at the end of January through early February and the official conference hotel was the LV Hilton. I stay in Hiltons regularly and was surprised at how dumpy this place was compared to other Hiltons. The lobby was dated and my room was even worse. It appeared that my room had not been updated since the 70s. Wallpaper was torn, carpets stained, toilet and tub were chipped, and the very small bathroom was covered in pink tile. Some of my colleagues were in nicer rooms, so I think I just got a bad draw. At least the room was quiet and had a nice bed. I was also disappointed in the restaurants. After checking out a lot of the other hotels in Vegas, I realized that the Hilton definitely was not the same quality as the Strip properties.", "title": "Disappointing for a Hilton", "user": "RamieMIchigan", "date": "February 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 2.0, "location": 3.0}, "id": 96028001}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "I know that this review will not be applicable to most travelers, but I was impressed with how well hotel security dealt with firearms. I was traveling with a large number of firearms, and when I called the front desk to see what options I had and what the hotel policy was, they were well informed and sent me to the very helpful security team. It was wonderful to have everything locked down in the hotel armory instead of fussing with deposit boxes and flimsy in room safes.", "title": "Very gun friendly", "helpfulness": 1, "user": "TravelsWithGuns", "date": "February 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 95826019}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We were here for a conference and added a few extra days for fun. We paid over $200/per night and were told they don't charge \"resort fees\" as if that was going to save us money.", "title": "Nickel and dimed", "user": "mcsummer11", "date": "February 5, 2011", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 95534420}, {"rating": 2.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "Cons", "title": "Hilton should take the branding off of this one", "user": "snowchick77", "date": "February 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 2.0}, "id": 95435443}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "• $20/per hour fee to use the tennis courts", "title": "ONLY if you have too...", "user": "LoriRNMichigan", "date": "February 3, 2011", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 95410238}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "Although our room was visually attractive, the quality of the experience was terrible. Firrst, you can hear EVERY noise from the next room and bathroom, even when people are talking in a normal tone of voice. Not only is there poor soundproofing, but the air conditioning from the next room comes through the gaps under the doors.", "title": "Not worth the money", "user": "AquaImage", "date": "October 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 21385895, "likes": {"liked": "— Location convenient to convention center.", "disliked": "— Noise."}}, {"rating": 3.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The hallway was never vacuumed during the entire week we stayed at the hotel.", "title": "Hotel was not too bad for the price - but not sure if I'd stay here again", "user": "EvieDMn", "date": "October 28, 2008", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "location": 2.0, "rooms": 2.0}, "id": 21355428, "likes": {"liked": "— Convenient location next to the Convention Center", "disliked": "— Outdated appearance compared to other hotels in the area"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled with family", "text": "The thermostat does not show temperature in degrees.", "title": "A haven of tranquility", "helpfulness": 2, "user": "Piccasso", "date": "October 28, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 21345631, "likes": {"liked": "— Pool Area and the laid back atmosphere", "disliked": "— You really need a car or have to use the expensive monorail"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "The remote for the TV did not work the day we checked in and was never repaired.", "title": "pleasantly surprised", "helpfulness": 5, "user": "rrdub", "date": "October 25, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 21211738, "likes": {"liked": "— great hotel for the price", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "The Mexican restaurant food was terrible for the price. I could eat better at Taco Bell.", "title": "The only nice thing was our bellman", "helpfulness": 3, "user": "wendekm", "date": "October 24, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 2.0, "location": 2.0, "rooms": 3.0}, "id": 21182090, "likes": {"liked": "— THE BELLMAN", "disliked": "— The non smoking room that filled with smoke in the middle of the night"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "This hotel was a good value. As prices on the Strip rise...LVH well priced and is a nice hotel. Even though it is technically off the Strip, the monorail is a really convenient way to get around. The rooms are spacious and very clean. We were just there one night, so I can not speak to all the amenities, but it was really great for an over night stay.", "title": "Good Value", "user": "BchVball", "date": "June 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 132724401}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We were there from June 20-24th. Rooms were clean, hotel was clean, personnel were very friendly. Ate at the buffet and it was good, had several meals at the Paradise Cafe and our party of 5 enjoyed all meals. Fish and Chips were excellent! I would be hard press to find anything wrong with this facility. Would stay again!!", "title": "Would Stay Again", "user": "nubtog", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 132691066}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Overall experience was just okay . . . Service and food was great in F&B outlets. First night checked in and had hairs in-between the sheets. HSKP came up quickly to clean room. Other than that, other areas was fine.", "title": "Just Okay", "helpfulness": 1, "user": "Hawaii54a", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132605083}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "I stayed at the LVH earlier in the month and had nothing but problems. First, check in was late about an hour and told to come back. Had two special discount rates and coupons the front desk only gave us one. Moreover, we were on the 6th floor all the way at the end next to nothing. Upon entering the room the AC did not work correctly, TV would not turn on nor the refrigerator. I had to physically move the console to plug them in and try to work on them. Traveling all day this was the last thing we wanted to do. Overall the room was very clean. They sent a tech to look at AC unit told us the vents were not open correctly. Likewise, this was not the case and we had to complain again to move rooms. They changed our room on the opposite side of the hotel. Later in the week we decided to check out and get our money back after arguing with the Front Desk Manager. We switched hotels to finish out our trip. Much to say we wont be back.", "title": "Lots of Issues", "helpfulness": 4, "user": "David M", "date": "June 23, 2012", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 132604614}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "I stay in Vegas a lot for business and I have found that the value of the LVH hotel cannot be matched. It is not the most modern but the staff keeps it extremely clean and the rooms are large with plasma tv's. The spa here is excellent, not the most modern but the staff are more than excellent with first class service and excellent massage. They also reward you by going green and not having your room cleaned, they give you a $10 certificate for all restaurants in the hotel.Maybe some people have problems with check-in but I usually walk right up to the counter and the process takes less than 3 minutes. The monorail stops right at the hotel and the 108 bus line goes right in front for $2 a trip. The other great part of the hotel is the pool in the evening, they have a DJ that is excellent and on Fridays they have old school at the pool with free live entertainment. It is a great time.", "title": "The LVH Review", "helpfulness": 2, "user": "jmcgee918", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132588699}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We found the hotel to be ok.", "title": "Nice Stay", "helpfulness": 2, "user": "Mobsue", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 132574438}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Our room was on the 6th floor and was clean and very acceptable.", "title": "DON'T GO THERE", "helpfulness": 4, "user": "BelleDoc", "date": "June 21, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 132453369}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled solo", "text": "The hotel is tired in lots of areas and there is a weird smell around the hotel. It is sort of stale.", "title": "Jiminy Crickets", "helpfulness": 6, "user": "K_519", "date": "June 21, 2012", "detail_rating": {"cleanliness": 2.0, "sleep": 2.0, "location": 3.0, "value": 3.0, "rooms": 2.0}, "id": 132414536}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "We arrived on the Sunday and on our last day, Thursday, they had added something to the air con to give a citrus type of fresh smell. This helped.", "title": "Best Value so far", "user": "pamela161989", "date": "June 20, 2012", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "location": 3.0, "value": 5.0, "rooms": 4.0}, "id": 132412322}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We aren't smokers so the smoking everywhere was a bit of an issue.", "title": "Lvh las Vegas", "user": "BORIS021", "date": "June 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 132399762}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "I arrived alone at the Las Vegas Hilton at 2pm and was told I would have to wait 2 hours for my room to be ready. I had to stand in line to check my luggage and wait for the room to be cleaned. The casino is nice and pleasant. The wait staff in the Margarita Grill were exceptional and friendly. Quark's bar was a disappointment as the wait staff were not at all eager to wait on me. A character dressed as a Ferengi was downright rude to me. Overall, it is an OK property, but there are better on the strip.", "title": "Nice but worn", "helpfulness": 1, "user": "JiminCortez", "date": "March 30, 2006", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4774331}, {"rating": 1.0, "stay_parameters": "Stayed March 2006", "text": "Stayed at the Hilton Las Vegas March 22 and 23rd! What a disappointment! The hotel is dirty and rundown! The carpets were torn, the bathrooms were very outdated and the air conditioning did not work! The wash clothes had pubic hairs in them----GROSS! Would never stay at this hotel again....is this really a Hilton hotel????", "title": "Gross Hotel", "helpfulness": 5, "user": "kkaz", "date": "March 29, 2006", "detail_rating": {"cleanliness": 1.0, "value": 3.0, "rooms": 1.0, "service": 3.0}, "id": 4773430}, {"rating": 2.0, "stay_parameters": "Stayed October 2005, traveled on business", "text": "I stayed here for 4 nights in October 05'. For those of you who think this is a Hilton property, your wrong, Hilton sold this some time ago but the current owners have kept the name, however there are rumors of a name change coming this year.", "title": "Stayed here 4 nights....", "helpfulness": 10, "user": "Ping Golf", "date": "March 19, 2006", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "service": 1.0}, "id": 4692497}, {"rating": 4.0, "stay_parameters": "Stayed March 2006", "text": "This hotel is dated and worn and I agree with others that the service lacks in all aspects. I did however win some $$ on the slots which appear to be a bit more loose than the casino's on the strip or it was just my lucky trip.... :-)", "title": "Family vacation at the Hilton...great", "helpfulness": 8, "user": "dryice", "date": "March 18, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4691119}, {"rating": 3.0, "stay_parameters": "Stayed March 2006", "text": "Since this is no longer a true Hilton, the HHonors program, while still accepted will be phased out when a name change comes about, and it shows already in their attitude.", "title": "another reason to lock your doors", "helpfulness": 10, "user": "luuluu", "date": "March 18, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "service": 2.0}, "id": 4689741}, {"rating": 1.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We spent seven days at the LV Hilton and it was awful. First let me say that we love Las Vegas and spend from seven to ten days there 3 or 4 times each year. We like to stay at a different hotel each time, so I am familiar with the service (and respect) that other hotels still provide their customers. For seven days, we parked on the first floor of the hotel's garage. On Friday night, we were flagged down by a surly security guard and not permitted to park there. The reason was there was a concert held that night at the LV Hilton and we were forced to park on the roof. We were very lucky that the crowd was happy and respectful to us senior, but it could as easily not have worked out that well.", "title": "This was a terrible stay at the LV Hilton", "user": "Sp0rty", "date": "February 14, 2011", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 96668448}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "We were given two rooms when we checked in and neither had any heat. Since they promised to fix the heat the next day, we decided to stay in the room. I had already unpacked and I wanted a shower. If we had stayed in the room the full seven days, the bathtub would never have drained. What a mess. Against my better judgment, I packed again and moved to another room. We were escorted by housekeeping, not a bellman, so we had not choice but to repack. The room we ended up with was used as a hospitality room, so the bed was a Murphy bed, smaller than a queen. The frame stuck out 2\" all around and we kept running into it all week, but I didn't have to pack again. Oh, by the way, no heat in this room either. We were told by the manager that this room was an upgrade and he could not understand why the heat didn't work. Upgrade usually doesn't mean half the size, but at the LV Hilton it does. They fixed the heat and we stayed the 7 days. Never again. All the stores along the side entrance are empty -the pizza/yogurt/sandwich shop that has been there for years is only open on weekends. The whole place looks like a bizarre haunted house. Nasty. By the way, the housekeeping staff on the 26th floor was great - at least they are committed to customer service. More housekeeping, less \"suits.\"", "title": "Comfy bed. Great Bacon", "user": "Vaedee", "date": "February 12, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 96375179}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "My husband and I went for our honeymoon. It was wonderful. The bed was so comfortable. We ate at the Paradise Cafe, ok service, but an exceptional Club sandwich, the bacon was awesome.", "title": "Great service on 1/28/11; terrible service on 2/6-2/8 2011", "user": "NHGrammyG", "date": "February 11, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 96290536}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "What a difference a week makes! Stayed one night on our way to Hawaii... Cecily at front desk was friendly and helpful with great smile... everyone happy to ensure a great stay... checked in late on 2/6 (close to midnight) front desk was slow and seemed like something was happening behind the scenes. Called down for towels twice on 2/7 and they never arrived... no morning paper... long lines because only one cashier at breakfast buffet... lots of trash and sort in hallway... what happened in one week? We like this hotel, the beds are comfortable (no bed bugs- I check!) Rooms are nice with large tub... monorail is convenient... too bad the service was off on our way back through!", "title": "A very cold night", "user": "donnacraig", "date": "February 10, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 4.0}, "id": 96197664}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "Everything was very good but there was a problem with the air condition system call apound checkin to fix at 15:20 ad to caqll again at 17:50 and went to front desk at 19:46", "title": "The walls are paper thin, you can hear everything next door to you", "user": "Bendtraveler24", "date": "February 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 3.0, "location": 3.0}, "id": 96085652}, {"rating": 3.0, "stay_parameters": "Stayed February 2012", "text": "I wondered why Hilton remove their name and now I know. I booked through a conference package and thought it would be nice. What I found was a dated hotel that was expensive, dirty and a constantly running spigot in the bath tub (try sleeping at night with that going on) yes, I did call to get it looked at, but no takers.", "title": "If you are going to the convention center it is close.......", "helpfulness": 2, "user": "Tgus14", "date": "March 3, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 2.0}, "id": 125545490}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "My husband booked the LVH on a website that didn't allow him to see the hotel until it was paid for (yeah, you know the website I'm talking about). When we found out it was the LVH, I came here to read reviews. I was terrified to stay there! There were so many bad reviews. I did my best to go in with an open mind since we didn't have a choice at that point (unless we wanted to lose all of that money). When we arrived, I was impresssed. The lobby was beautiful. Upon check in, I expected to be told that we needed to upgrade, but that wasn't the case at all. The front desk staff was friendly and helpful. We headed up to our room and I was impressed further. The decor was up to date, the view of the golf course was nice (I don't care much to see the strip, I've been to Vegas many many times, it isn't anything special). The room was clean, smelled like bleach. Linens were clean (I'm the crazy lady that inspects them as I open the door to the room)! If I want to nit pick, I can say that the tile in the bathroom needs updating. However, the things that can easily be updated (walls, curtains, etc) were, and the overall feel was nice, even if the tile was a little outdated. It was still clean and presented fine, which is what matters to me.", "title": "Read too many reviews", "helpfulness": 3, "user": "Jacqui B", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 125502455}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "We headed down to the pool area. It was great. We have a toddler, and the pool has a nice, big shallow area (knee deep) that was perfect for him to play in. The spa was well maintained. The pool area had more of a \"resort\" feel than just a hotel. I was glad that there was a lifeguard on duty as well. There was an abundance of clean towels. It was a freak weekend of gorgeous weather, so there were a lot of people buy the pool, but it never felt crowded. The staff was friendly, greeted us upon entering and leaving.", "title": "Don't even think about staying here", "helpfulness": 4, "user": "FreqFlyer S", "date": "March 2, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 125501386}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Overall, I was very happy with our stay at LVH. I would stay there again, in a heartbeat!", "title": "Horrible!", "helpfulness": 6, "user": "Angela15227", "date": "February 29, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 4.0, "rooms": 1.0, "location": 4.0}, "id": 125394019}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I used to live down the street years ago and was curious as to why the Hilton name was stripped off the moniker. After checking into my room and dealing with some of the staff, it became clear. The rooms are old, dirty, outdated - bordering on truck stop quality. The staff is incredibly rude and act like they wish you had stayed somewhere else - which we should have. I was here for a business conference and was using the company card, but if all the upcharges ($13.99/day for Internet access and $20 to use a treadmill from 1980) were to come out of my pocket, I would have stayed somewhere else. Biggest complaints: water in the rub has been dripping for 5 days now, broken door to the bathroom, scratchy towels and toilet paper, marks on the wall, dirty windows, paper thin walls. I've been able to hear both my neighbors cough, talk, shower as if they were in my room. I'm telling you, this place will be imploded within a few years.", "title": "A place to lay your head...but not much else.", "helpfulness": 2, "user": "MrsCresswell", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 125247065}, {"rating": 1.0, "title": "Bedbugs ", "text": "I stayed at the Las Vegas Hilton with a friend on April 21 and 22, 2006. In the early morning hours of the 22nd I awoke with a feeling of something crawling on me. I put on the lights and to my horror I had what I now know as bedbugs crawling all over myself and my bed. As I crushed them between the sheets they exploded blood (a good sign that they had just gotten done feeding on me). We immediately checked my friend's bed and that too was infested with the bugs. After placing a call to the front desk, security was immediately dispatched to our room. The security officers took pictures and samples of the critters for their report. I had actually gotten bitten twice on my back and once on my leg. Since we were leaving the hotel that afternoon we declined a room change and just took quick showers and got the heck out of there. Upon leaving the hotel I went to the front desk (i was actually crying at this point) to tell them that I was very upset about the situation and that I didn't expect to be paying for my stay. I was told that only one night would be taken off of my bill and that I would need to dispute the second night. The front desk manager was called and quite frankly he treated me as if I had found a candy wrapper on my floor instead of being waken up covered with bedbugs.", "helpfulness": 31, "user": "A TripAdvisor user", "date": "April 25, 2006", "id": 5008497}, {"rating": 1.0, "title": "This place stinks!!!", "text": "The Las Vegas Hilton needs to get rid of its infested beds, get a good exterminator and also put its employees (especially its managers) through sensitivity training.", "helpfulness": 12, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 5003305}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "When we arrived they had misspelled my name so it took 30 minutes to check in. Then when we made it to our room, somebody was aready in it. After spending 30 more minutes in a hot hallway with a security officer, we were given a \"horrible\" room(smelled like a biker bar) and told there were no other rooms in hotel with over 2800 rooms. Give me a break! This place sucks!!!!!", "title": "Great Price -- Hotel a little long in the tooth", "helpfulness": 9, "user": "Bob2222", "date": "April 20, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 3.0, "service": 1.0}, "id": 4990057}, {"rating": 4.0, "title": "good value for money but still expensive", "text": "I stayed at the Hilton in April during the week. Got a terrific package through Southwest Airlines. ($264 roundtrip from Oakland, two nights stay, $25 gambling token). I stayed on the third floor East tower with a view of the golf course.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 18, 2006", "id": 4986239}, {"rating": 3.0, "stay_parameters": "Stayed April 2006", "text": "Since they were out of king size beds, I was given a free upgrade to a mini suite, which is actually two normal rooms with the wall removed. Think of it as one big room with no bedroom privacy. The non-bed half has some furniture and a bar with sink and refrigerator (no honor bar). I would not pay the $125/night upgrade for this room, however.", "title": "OK, but dosn't meet standards of most Hiltons.", "helpfulness": 9, "user": "natura11", "date": "April 16, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "service": 3.0}, "id": 4977001}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "After been send to this hotel ONLY because the original hotel where I've made the booking was overbooked, I decide to go away the following day.", "title": "Everything Else But Not Hilton", "helpfulness": 5, "user": "Dp60", "date": "December 8, 2007", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 11326453, "likes": {"liked": "— NOTHING", "disliked": "— EVERYTHING"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "If you think that this hotel named Hilton Las Vegas does match all cryteria of hilton standards than forget it, room are up-to-date, very common and basic furbished, NO Minibar either mini fridge, NO bathrobe, NO sleppers, NO courtesy amenities, NO good location against all main attractions in las vegas.", "title": "Nice hotel...can't say as much for the clientele", "helpfulness": 3, "user": "K-Bot", "date": "December 7, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 3.0, "value": 3.0, "rooms": 5.0, "location": 3.0}, "id": 11300015, "likes": {"liked": "— Beautiful room, Sunday Brunch at the Buffet", "disliked": "— The other guests"}}, {"rating": 3.0, "stay_parameters": "Stayed August 2007, traveled on business", "text": "Really if you're tourist and you go in las vegas for good time, go enywhere else but not at this hotel, got nothing to do with Hilton class and wonder why is belonging the hotel's chain, food is terrible and expensive, room are very noise, for the same price you can have better hotel better located against the strip way where all lifes goes on, if you love yourself you should never go there.", "title": "been to vegas a lot? like the monorail and to stay off the strip?", "helpfulness": 3, "user": "qualtyk9", "date": "December 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 3.0, "value": 3.0, "location": 3.0, "rooms": 4.0}, "id": 11245996, "likes": {"liked": "— happy hour by the pool, rooms are usually larger than other hiltons", "disliked": "— pool hours, dinner ends at 9-10pm at most of the sit down restaurants"}}, {"rating": 3.0, "title": "Never use the Hiltons collect calling in your room!!", "text": "small suggestions, MGM GRAND is your best deal at las vegas.", "helpfulness": 1, "user": "oopsmag", "date": "November 27, 2007", "id": 11108055}, {"rating": 1.0, "stay_parameters": "Stayed November 2007, traveled with friends", "text": "I stayed at the Hilton for one night on a business trip. Would have liked the opportunity to stay longer as I'm a \"Trekkie\" but didn't have sufficient time to enjoy \"The Star Trek Experience.\" Oh well....", "title": "Hated the Las Vegas Hilton", "helpfulness": 1, "user": "lotoluck", "date": "November 27, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 3.0}, "id": 11103388, "likes": {"liked": "— comfortable beds", "disliked": "— terrible service"}}, {"rating": 5.0, "title": "thoughtful & comfortable!", "text": "I have stayed at many hotels in Las Vegas, in all price categories...ALL have something to offer...depending on what you are looking for...The Las Vegas Hilton is a smaller company that is up against some big competition...I have been impressed with their entertainment, and have enjoyed many shows and plays...I will be returning in April to see \"Nunsence\". The rooms have enough space for 2 adults and also have a fridge so that you can store leftovers for the next day...or chill that bottle of champagne...the resaurants are top-notch...from the buffet (I loved the weekend brunch including all the mimosas you wanted) to TJ's Steakhouse (absolutely fantastic) to Benihana's...to the relaxing bar area with asian-themed zen-like water sounds. The Hilton has everything you need without the high-price tag, and the people working there are NICE! The monorail is right there...and you buy a 24-hour monorail pass for $12 and go as many times as you like to any hotels...I liked to go all the way down to the MGM...for a variety of resaurants and entertainment...then I was happy to come back to my comfy room at The Hilton...this is an excellent Hotel for the money...some of the other reviews are not fair...I have stayed here on more than 6 occasions...and have not been disappointed...I have also stayed at The Wynn, The Venitian, Caesar's Palace, The Aria, The MGM, The Paris, The Imperial Palace, and many others...please be sure to compare apples to apples when deciding upon a place to stay...when I told them it was my anniversary...they delivered Champagne and chocolate strawberries in chocolate tuxedos! Yummy!", "user": "mmmsmmmattie", "date": "February 3, 2011", "id": 95408526}, {"rating": 1.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "This hotel is terribly dated. The carpet in my room was frayed. The finial on the lamp was missing so the shade kept falling off. The cleaning staff didn't do their jobs - the ice bucket was never cleaned out; my dirty glasses were still on the counter when I returned to the room, and the same trash stayed in the corner of the room my entire stay. The heating/cooling did not work properly (complained several times), the bathtub stopper did not work (tub would not full with water unless you stuffed a washcloth around the drain). There are no coffee makers in the room (they want you to buy a $4 cup of coffee every morning) , no free internet access, the fitness room is not free and even when I tried to print out my boarding pass, there was a charge (which I did not pay, of course)! The location relative to Las Vegas strip was not good - at the far north end (dicey area)well off Las Vegas Blvd, even though the description says \"one block\" - ha! Had to take a cab or monorail to get anywhere with walking forever. I will NEVER stay in that place again!", "title": "Never again", "user": "bham813", "date": "February 1, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 1.0, "sleep": 3.0, "rooms": 2.0, "location": 1.0}, "id": 95206466}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "It's old, outdated and the service is AWFUL. I arrived last night to find that my reserved non-smoking room had been given away. So I'm in a musty, smoky smelly room. I realized I forgot toothpaste, but housekeeping doesn't provide toothpaste. I had to go searching for the gift shop at 1am my time zone to purchase toothpaste. The electric outlet beside my bed does not work.", "title": "This hotel was probably very fabulous about 50 years ago", "user": "klalala60898", "date": "January 31, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 1.0, "sleep": 5.0, "rooms": 2.0, "location": 1.0}, "id": 95117027}, {"rating": 2.0, "stay_parameters": "Stayed January 2011", "text": "Today I went to the front desk and asked if I could have a refrigerator because I have celiac disease and need to stock up on food from offsite since these people don't even know what gluten IS and none of their restaurants can accommodate my dietary restriction. After the ladies finished b***hing about someone and turned to look at me, they told me I should go back up to my room and call housekeeping. Like, isn't that your job? I'm still waiting on a refrigerator two hours later. No microwave. The closest place I can get gluten-free food is a 20 dollar cab ride away roundtrip.", "title": "Potential NOT Used.", "user": "stevenbrose", "date": "January 30, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 94990349}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "Excessive fees: They charge $150 to receive packages and $14 a day for Internet. Such a ripoff.", "title": "Love the 'Going Green Reward'!", "helpfulness": 1, "user": "FTLOC", "date": "January 30, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 94942963}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We arrived in Vegas a day earlier then expected, so being a Gold Card member, naturally checked into the Hilton - which had the best deal anyway! Got a free breakfast for being a Gold Card member and there is even a separate dining area for Gold/Platinum members, if you feel like it!", "title": "Better than expected", "helpfulness": 2, "user": "Gags", "date": "May 17, 2006", "detail_rating": {"cleanliness": 4.0, "rooms": 4.0, "value": 4.0}, "id": 5146842}, {"rating": 1.0, "stay_parameters": "Stayed May 2004", "text": "Room was better than expected, very large, even by American Standards. We were in the North Tower on the 17th floor, I am not sure how old it is. I guess the bathroom was a little worn, but very clean. We had 2 queen beds - very comfortable.", "title": "Hated it.", "helpfulness": 8, "user": "PraiseHim", "date": "May 12, 2006", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 5061145}, {"rating": 4.0, "stay_parameters": "Stayed May 2006", "text": "Hotel location is off the strip, but you can walk if you are fit enough. As explained in these reviews the monrail has a station in the Hotel - $5 o/w $9 return $15 day ticket.", "title": "I thought it was fine", "helpfulness": 8, "user": "Dorsalfin", "date": "May 10, 2006", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "service": 3.0}, "id": 5048712}, {"rating": 2.0, "stay_parameters": "Stayed May 2006", "text": "Pool area was large and clean - used it briefly.", "title": "Inconveniently located & needs updating", "helpfulness": 4, "user": "oregonswim", "date": "May 8, 2006", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "rooms": 2.0, "service": 3.0}, "id": 5042806}, {"rating": 1.0, "stay_parameters": "Stayed April 2006, traveled on business", "text": "Overall very good hotel - we had nothing to complain about.", "title": "Decorated by the Golden Girls (when they were young!)", "helpfulness": 11, "user": "WITWIL", "date": "May 1, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5022676}, {"rating": 1.0, "stay_parameters": "Stayed December 2007, traveled with friends", "text": "Eight of us booked 4 rooms for Monday, December 24, 2007 with reservation # 051058206-9 thru Hotel.com at Las Vegas Hilton. We drove from Los Angeles & reached Hilton 11:30pm. After a short wait at the line for our turn, the front desk person told us rooms were all dirty. We would have to wait for 1 ½ to 2 hrs. We were all upset since we were tired and needed rooms to sleep. To compensate for this terrible incident, she offered us complimentary meal to each of us to dine while waiting but we were not hungry, so we took the vouchers for next day instead. Lots of guests were mad. One front desk person was mad too. They exchanged words and the hotel rep slammed the telephone on the lady guest at the counter.", "title": "Worst hotel experience at Hilton Las Vegas", "helpfulness": 5, "user": "mcdeecpa", "date": "December 27, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "rooms": 4.0, "location": 4.0}, "id": 11988005, "likes": {"liked": "— None", "disliked": "— Room not available when arrived, 3 - 4 hrs wait to get rooms, self parking far away, not given $25 chips as promised."}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "After 1½ hours of waiting, we got our 1st room. We got the 2nd 3:20 am, the 3rd 3:35 am after begging and begging the housekeeper and room maids to clean them for us. The 4th room was not ready at the time and we did not know when it would be available. We could not wait any longer so we did not check in the 4th room. We just used 3 rooms for 8 of us. It was horrible experience for all of us to be treated like this. We stayed at other hotels in Las Vegas, such as the Mirage, Bellagio, MGM, Stratrosphere, Orleans before. None of them ever treated us like this. We would like to get a refund for the 4th room that we never got. Actually, we should have got refunds for all the rooms since we paid for them in advance and could not check in to get enough sleep even with those 3 rooms we got. We requested refund from the front desk rep name Reyna, she told us to get it from Hotel.com since the payment was made thru credit card charged by the Hotel.com. Also, we were supposed to get $25 chips with each booking (4 bookings = $100) but we never got. We were too busy running up and down the hotel trying just to get rooms to sleep for 8 of us. I am pretty sure at least about 20 to 30 guests were upset that night.", "title": "Fine Hotel, Great Bed", "helpfulness": 1, "user": "ThreeToedSloth", "date": "December 19, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 11698023}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "WITT MCDEE", "title": "Here are the facts, you decide.", "helpfulness": 2, "user": "WeTryItOnce", "date": "December 11, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 2.0}, "id": 11478366, "likes": {"liked": "— The noisy room (smoke and adjacent room 'activities').", "disliked": "— The Hilton Benihana food and poor service."}}, {"rating": 3.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "mcdeecpa@hotmail.com", "title": "2nd stay at the lv hilton", "user": "mauislick", "date": "December 10, 2007", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 2.0, "rooms": 4.0}, "id": 11467203, "likes": {"liked": "— conviniance", "disliked": "— pricey restaurants for average food"}}, {"rating": 1.0, "title": "Old and Tired", "text": "I stayed at the Las Vegas Hilton with my wife for one night (Saturday) in mid-November for under $100/night. A preliminary note about booking: there are two websites for this hotel. The website through hilton.com and then the hotel has its own independent website. We got a much better deal through the independent website.", "user": "BizTravelerNY", "date": "December 10, 2007", "id": 11463405}, {"rating": 3.0, "title": "LV Hilton, great value, good stay, yucky beds.....won't stay again", "text": "We just got back from our stay in Vegas. We stayed at the LVHIlton for 5 nights. We were happy with nearly everything but the beds were very uncomfortable and the pillows were lumpy! I would stay there again if it weren't for the beds.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 14, 2006", "id": 4973662}, {"rating": 4.0, "stay_parameters": "Stayed April 2006", "text": "We did, however, save a bunch of money staying there!", "title": "Everything we needed and more", "helpfulness": 9, "user": "MountainDawg", "date": "April 13, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 4970664}, {"rating": 5.0, "stay_parameters": "Stayed April 2006", "text": "The Paradise cafe is awesome for breakfast and not too pricey. Just watch out for a few cranky wait staff........we asked for tea and the woman sighed as if we asked her for a big favor. Then we asked our waiter for milk instead of cream twice and he was mumbling under his breath......luckily we only had these 2 clowns one morning, the rest were nice.", "title": "Really enjoyed the Hilton", "helpfulness": 9, "user": "JackieGarrard", "date": "April 12, 2006", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "rooms": 4.0, "service": 4.0}, "id": 4967535}, {"rating": 5.0, "stay_parameters": "Stayed March 2006", "text": "Other stuff:", "title": "Thr greatest Buffet in Las Vegas", "helpfulness": 9, "user": "matthewcookies930407", "date": "April 10, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 4955856}, {"rating": 5.0, "title": "What a treat!!!", "text": "Avoid Treasure Island's Buffet, \"Dishes\".......horrible!!!!!!", "helpfulness": 1, "user": "dcamp2", "date": "April 5, 2006", "id": 4940567}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "We've just returned from a 3 night stay at the Hilton. This will be our 5th stay over the past 2 years. Overall, we've been happy with the hotel.", "title": "Nice hotel", "helpfulness": 6, "user": "mom2w-h", "date": "December 30, 2007", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12065709, "likes": {"liked": "— The bed"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled solo", "text": "We have relatives that we visit on a regular basis, so being off the strip a bit doesn't bother us since we have a car to use. Also, if you're there for a convention, you can't beat the location. If you're wanting to be close to the 'action' of the Strip, then it's not so convient. Yes, the monorail station is right by the front entrance but the monorail isn't running as often and the stops are usually in the back of all the properties, so you have to walk quite a ways to get to the casinos in the front.", "title": "A Very Pleasant Stay", "helpfulness": 4, "user": "Wolftrapper", "date": "December 30, 2007", "detail_rating": {"front_desk": 2.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 3.0}, "id": 12063085, "likes": {"liked": "— Nice Rooms and Comfortable Beds", "disliked": "— Location is a little off the strip."}}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled with family", "text": "Here's a quick run down of the hotel:", "title": "Great Hotel to stay as a family", "helpfulness": 2, "user": "sudhu100", "date": "December 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 12018607}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "1) Rooms: we've stayed in rooms at all the different towers--they're all similiar, except for the view. The view of the Strip is nice, but it's far away so it's not so spectacular. The rooms have all been remodeled--new large oval tubs and fixtures, new granite tiles, new furniture, flat screen TV's. The beds were excellent--it's the Hilton's version of Marriot's Heavenly bed. The bed linens were also upgraded with down pillows. The curtains are operated by a motor, the room we stayed in on this trip--it was broken already. Be careful about the 'complimentary' bottled water for Resort Club guests--don't use them unless you've paid or got upgraded to the 'Resort Club'--which isn't included for the standard rooms.", "title": "Hilton was pretty good to us.", "helpfulness": 2, "user": "Chiefsrule", "date": "December 28, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 4.0}, "id": 12002519, "likes": {"liked": "— Bed and TV", "disliked": "— Broken AC"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled on business", "text": "If you're staying at the North tower, I'ld recommend walking down the hall and using the Central tower elevators since the North elevators were always full and seems smaller.", "title": "The hilton needs a lot of help", "helpfulness": 1, "user": "resfan", "date": "December 27, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 11999775, "likes": {"liked": "— nothing", "disliked": "— the lack of help from the staff"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "I was uneasy booking this hotel based on latest reviews. I was in this hotel before around 1995-1996. The hotel is next door to convention center and its a main reason I decided to stay here. I have upgrade room on 14 floor in North tower and so far I can not make a bad comment. The room is spotless. Everything works. The check in around 7pm was easy with well explanation about free buffet. The parking a little bit far mainly because size of property. Internet is $13/day, but high speed. The food in buffet is plenty, but typical brekfast fare.", "title": "Good Hotel despite reviews", "helpfulness": 1, "user": "VSPE", "date": "January 28, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 94765362}, {"rating": 5.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "First I want to say that overall I thought this hotel was FANTASTIC! The room was nice (except for the attached photo). The staff were professional, courteous and helpful. The breakfast buffet was great and I really enjoyed staying in the hotel directly attached to the Las Vegas Convention Center.", "title": "Check the sheets!", "helpfulness": 2, "user": "TuffSubject", "date": "January 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 94511239}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "However, I was stunned at what I found on the sheets with my UV flashlight. The picture you see in this review is only 1 of *fourteen* of these large stains on the sheet in the bed. I immediately had housekeeping come up and change the bedding (ALL of it!). The new sheets were spotless -- so this could have been an unusual occurrence.", "title": "Another Great Stay!", "helpfulness": 1, "user": "tatita21", "date": "January 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 94155758}, {"rating": 2.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "We have stayed here 3 times, all in January and we really enjoy this hotel. The staff is friendly and helpful, buffet was not huge, but what they have is fresh and hot! We were offered an upgrade for $100 per night for a suite. We took it and were very happy we did. For under $300 a night we had a beautiful suite, Park Lane I think it was called. Nice jacuzzi tub that I used each morning while enjoying my Baileys & Coffee :) The only reason I did not give it a 5 is only because of it being off the strip. However the awesome prices would be not be had if it were so...... We have always had access to the resorts club lounge and I recommend booking for that. This hotel takes good care of their HiltonHonors members, we are gold. Thank you Hilton for another great stay!!! See you Jan 2012:)", "title": "Tired old property that needs updating", "helpfulness": 1, "user": "skitheridge", "date": "January 23, 2011", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 94149493}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled on business", "text": "People stay here for the location at the convention center but it's worth a monorail ride to the strip to move there. Perhaps all would have been better if I'd sprung for the higher room price options but nothing worked in my filthy room - the toilet wouldn't flush right, the tiny refrigerator only worked as a freezer, the HD TV had a snowey picture, the window (strip view) was too dirty to see through. Food at every property restaurant I tried was very poor. This place is not worthy of the Hilton label.", "title": "Not a bad stay at the Hilton LV...", "helpfulness": 1, "user": "BMRosenberger", "date": "January 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 94091157}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Many of the reviews have been scathing so I thought I would calm people down about this hotel. We were treated well and the room was very nice. We are not high maintenance people and prefer to mostly fend for ourselves. We were very happy with the new \"green\" policy where we could forgo having daily maid service and instead receive a $10 voucher for food or drink in the hotel. We attended the Elvis impersonator show (my husband's wish) and even I enjoyed it. We were not willing to frop the big bucks for the big shows. Vegas is not my favorite place by any means but I did enjoy the 2 nights we spent there. Cannot comment on pool as it was too chilly and the casino was lively and fun for a person who only will gamble $20!", "title": "Just fine with us", "helpfulness": 1, "user": "CSturgeo", "date": "March 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125802537}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "If you are looking for an off strip hotel, this is a great choice. We have been staying at this hotel (formerly Hilton) 2-3 times a year for the last 5 + years, it is our first choice whenever we go to Las Vegas. We like to be able by pass all the traffic on Las Vegas Blvd while being close to both downtown and strip. Another reason is that you don't have to go through the casino to get to your room like many other hotels. This is especially nice if you have kids.", "title": "Off strip great choice", "helpfulness": 1, "user": "wen_c82", "date": "March 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125778839}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Check in was easy and fast. The room is your standard hotel size - if you stayed in premium room they have the new pillow top bed that is very comfortable. And the bathroom is a little nicer. As like many Vegas hotel, their rooms are in different stage of 'renovation'. We've stayed at standard room and it's also fine. One thing I did notice that perhaps due to age of the hotel, the air conditioner in some rooms can be louder than some other. If it bothers you just ask to change.", "title": "Great hotel just off the strip!", "helpfulness": 2, "user": "rykelmom", "date": "March 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 125701625}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "LVH casino is smaller than most and tend to be a bit quite, which is just fine with us. Buffet is pretty standard fare, nothing to write home about. It's convenient if you don't want to go out.", "title": "Decent hotel, but they could certainly work on a many things.", "helpfulness": 2, "user": "David C", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 2.0}, "id": 125687016}, {"rating": 1.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "In the past I have overlooked the LVH because it is not on the strip but never again. I have stayed at a few strip hotels and none have been as nice as the LVH. Even though it is slightly off the strip the LVH has a monorail stop right outside the hotel which makes getting to the strip very easy. The hotel lobby are nice with very little smoke and the staff is helpful and kind. Our room was clean and the bed and pillows were comfortable. We will most certainly stay here again.", "title": "The most terrible experience ever. Dirty, old, stinky room, horrible service. Ugly strip view.", "helpfulness": 6, "user": "Helen F", "date": "March 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 2.0}, "id": 125675738}, {"rating": 2.0, "stay_parameters": "Stayed February 2012", "text": "While size of room was a suite, the bed itself was a fold down from the wall. Very hard and uncomfortable. No easy end tables with lamps, TV at awkward angle for viewing. Bathroom very old and tub side high and wide, difficult to get in and out if. Internet access costs additional $14 per day per computer. Business center charges for use too, cost $10 just to print flight boarding passes. Better places and values directly on the strip!!", "title": "Stay someplace else", "helpfulness": 2, "user": "KVanderstouw", "date": "February 26, 2012", "detail_rating": {"cleanliness": 3.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 2.0}, "id": 125233064}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "On check in, I was offered a room in the renovated tower. The room was large and comfortable, no problem there. However, the tub had not been cleaned since the last guest(s?) and had layer of scum and hair in it. A disgusting start to the stay.", "title": "Disappointing", "helpfulness": 4, "user": "Jay M", "date": "February 25, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 125191464}, {"rating": 1.0, "stay_parameters": "Stayed February 2012", "text": "This place has certainly faded since its heyday, but it is convenient to the convention center and a bargain compared to other large hotels in the area.", "title": "Do not spent ur time at that hotel", "helpfulness": 4, "user": "Jodonn", "date": "February 25, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 125173358}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "On check out, I had another surprise. I had logged into the hotel WiFi service from three devices, a laptop, a smartphone and an iPad. The fee of 13.99 per day is clearly to be charged per room, not per device, but they tried to charge me three times the daily rate for each day. I told the check out clerk that this was an error and he insisted that I pay the triple charge. Refusing, I asked him to get the manager. He went to the manager, who did not at this point even come out to discuss the matter, and came back with the \"answer\" that they would only charge me DOUBLE per day. I said this was not what was described on the login page and he insisted again that the charge was per device. I asked him if he had read the agreement...and he said no, he had not.", "title": "Huge room, wonderful staff!", "helpfulness": 2, "user": "theroaminpages", "date": "February 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125099538}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "Now I insisted that the manager come out and I showed them both their own agreement. After all of this, they finally agreed to adjust my bill to reflect the correct 13.99/day charge per room.", "title": "Everything in one hotel PLUS Great price!", "helpfulness": 3, "user": "FamilyFun1708", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 2.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125033202}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I got a weekend deal ($160 for 2 nights, plus fitness room and breakfast buffet), so I don't regret it. But the air in this place made my nose get stuffy and my eyes water. I think my non-smoking room was still getting some sort of smoky air.", "title": "It's Cheap, so don't pay too much", "helpfulness": 2, "user": "Zonkey_12", "date": "March 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 125671030}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "You get less than basic cable TV, the internet is $15/day. And you have a long walk from the parking to your room.", "title": "Seen better days", "helpfulness": 2, "user": "HAF61", "date": "March 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 1.0}, "id": 125669885}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "The fitness room is $20 a day, the buffet is $20... try to get those added in to your deal.", "title": "Don't make the same mistake....", "helpfulness": 3, "user": "MM5757", "date": "March 5, 2012", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 1.0}, "id": 125664593}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I have to agree with the other comments re Hilton, Same hotel just poor and dated rooms. The ground floor is ok and reasonably well presented but the rest is past it's sell by date.", "title": "Good price for the room but too far from the strip", "helpfulness": 1, "user": "salamiboi", "date": "March 5, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 125659764}, {"rating": 1.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "If you are going to Vegas this hotel is off the beaten track and takes a good 10 minutes by monorail to get to the strip. If its the convention centre then fine as a business user just about.", "title": "Time has passed this place by", "helpfulness": 6, "user": "NittanyL", "date": "March 3, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 3.0, "location": 1.0}, "id": 125571178}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "I booked \"Bed and Breakfast\" package that included a free breakfast for 2 on their website. When checking out, Roseanne at the front desk told me that she had been working there for 48 years and never heard of any such package. She was incredibly rude and charged me for all the breakfasts that I had during my stay. Eventually, a manager came over and checked my room rate on the computer. It took me an extra half hour to check out.", "title": "horrible", "helpfulness": 3, "user": "JC4848", "date": "June 20, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 1.0}, "id": 132381519}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled on business", "text": "You can find MUCH better places to stay on the strip.", "title": "Good hotel while in business in LV", "user": "trvlzom62", "date": "June 18, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 132197805}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I was in Vegas on business for 10 days stayed here for 3 of the days.The hotel was clean overall.Large clean room very comfortable....the only complaint I have is the A/C really struggled to maintain a cool temperature and parking is such a walk to the actual hotel.", "title": "Good the Bad and the Ugly", "helpfulness": 1, "user": "blackcuda1", "date": "June 17, 2012", "detail_rating": {"cleanliness": 3.0, "sleep": 5.0, "location": 3.0, "value": 5.0, "rooms": 4.0}, "id": 132185107}, {"rating": 2.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The Good:", "title": "Don't expect the Hilton", "helpfulness": 3, "user": "TJR43596", "date": "June 17, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 132184571}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "The primary reason I stayed at the LVH is that they were honest about the room rate. Other hotels quote a rate, but then tack on a mandatory resort fee which is supposed to pay for the casino and pool and other items which you would expect to be at the hotel. LVH has no resort fees, the price you are quoted is what you pay. The room was large and well furnished. A large TV and a comfortable bed. The bathroom was stylish and roomy.", "title": "Perfectly nice hotel", "helpfulness": 2, "user": "OSUBuckeyetraveler", "date": "June 17, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 132169047}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with family", "text": "After reading some of the Hilton's negative reviews, we were pleasantly surprised at what a good stay we had. While I missed staying on the strip, my husband enjoyed being away from the crowds. Check-in was handled pleasantly and efficiently. The room was exactly what we had reserved; with very comfortable beds, and nice furnishings. The amenities were average, but that's our biggest complaint. The first night when we returned back to the room we even had a lovely welcome basket with fruit, candies and crackers. It was a wonderful surprise, and considering we aren't \"high rollers\" by any means and had never stayed at the hotel, it was a pretty amazing touch. We still don't know what prompted the gift (in my reservation I had noted we were celebrating my birthday- maybe that was it!) but it definitely scored points. The gambling was pretty good, the gift shops are cool to browse in, with a nice selection of unusual items, and the Japanese village was delightful- both Benihana and the Sushi bar provided a great experience. Honestly we didn't experience anything that would warrant a negative review and we would gladly plan a return stay.", "title": "Overall a great stay", "helpfulness": 2, "user": "FamilyTravelFan", "date": "December 5, 2008", "detail_rating": {"front_desk": 4.0, "value": 5.0, "location": 3.0, "business": 3.0, "rooms": 4.0}, "id": 22457982, "likes": {"liked": "— Comfortable room; made us feel welcome", "disliked": "— Relatively far from other casinos"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "From the moment of check in this was a great stay. Was here for my Birthday weekend and it was the best weekend anyone could ask for.", "title": "Great Stay!!", "helpfulness": 2, "user": "ShyguyFresno", "date": "December 3, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 22424019}, {"rating": 1.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Got to the hotel at about 1:30 and checked right in with no issues got a free upgrade, ended up on the 24th floor with a view of the mountains. I choose this hotel as its off the strip so its not as busy and also due to it being on the Monorail line. This is the second time I have stayed here and love it just as much as I did the first time. Every employee came in contact with was nice and always willing to help.", "title": "Don't Stay Here If You Want To Have a Good Time!", "user": "BunnyRo", "date": "December 3, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 4.0, "location": 3.0, "rooms": 3.0}, "id": 22423642, "likes": {"liked": "— probably the room, it was clean, comfortable and they have late check in", "disliked": "— the staff, most of them were rude, condescending and not helpful!"}}, {"rating": 2.0, "stay_parameters": "Stayed September 2008, traveled with family", "text": "I would recommend this hotel to anyone wanting to stay off the strip and away from all the strip hotels. I know the hotels on the strip are newer and all but totally love the LV Hilton will be there again soon.", "title": "Not So Nice at the Hilton", "user": "dpeq", "date": "November 29, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 1.0}, "id": 22292971, "likes": {"liked": "— The buffet", "disliked": "— The room"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2008, traveled on business", "text": "Don't stay here if you want to have a good time! They are CHEAP, CHEAP, Cheap! So the first time that we stayed here things were great. We booked one of their offers which includes the spa entry, buffets and a room for two nights. We stayed her in November and it was terrible. The room was not the room we were given the first time, the bartenders all had attitudes and were very rude..(The sportsbook bar and the Tempo Bar) They act as if they all hate tourists and anyone that asks a question. I mean, why be so nasty to patrons, w/o us you wouldn't have jobs...NO we were not drunk, in fact we were just trying to order a damn drink. So we ended up playing at Bally's, Paris, The Rio and Cesear's. The reservation agents hadn't a clue about anything, and the casino host was also very rude, condescending and very unhelpful. The buffet is ok, but one night they were out of prime rib and the other night their oysters were disgusting. The staff people at the buffet were all nice and yes, helpful. Would not stay here again, even if we do get one of their deals.", "title": "Terrible.....", "helpfulness": 2, "user": "KTfromNC", "date": "November 18, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "location": 2.0, "rooms": 2.0}, "id": 21989269, "likes": {"liked": "— Due to being at CES. The location was good.", "disliked": "— Everything other than the business location."}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled on business", "text": "I visted this hotel in Mid december for a business trip. After reading alot of bad and average reviews on here, I get the impression people expect this Hilton to be something it's not. This hotel caters alot business travelers, and therefore does not provide the typical \"vegas\" experience that many people look for. So if you stay here, dont expect that. Its an older, quiter hotel. But to me basically every aspect of it was accpetable.", "title": "Perfectly fine..", "helpfulness": 4, "user": "icem2829", "date": "January 2, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "location": 3.0, "rooms": 4.0}, "id": 23195951, "likes": {"liked": "— Sportsbook, location.", "disliked": "— Thin walls, closed buffet."}}, {"rating": 3.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "The rooms are what I would consider to be a standard Hilton room. There is no theme...but they are a decent size, clean ( at least mine was), and come with the basic amenities most travelers would want or need. One complaint I would have of the rooms is that the walls are very thin. I could hear talking and other things quite clearly in the next to me. Other then that, the room was fine.", "title": "The hotel was OK but the staff and wait for check in awful", "helpfulness": 2, "user": "OklaOnthego", "date": "January 2, 2009", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 3.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 23177761, "likes": {"liked": "— the price for 4th of july compared to other hotels, but it wasn't hilton with the great price it was another web site hiltons was higher", "disliked": "— check in"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "The casino was never crowded, which to me is a good thing. Blackjack had some very low limit tables, and it was never hard to find a seat. The sportsbook is great here. Its large and has comfortable seats with greats views of the TVs. The dining chocies are a tad limited here, and the buffet was closed while I was here. But as a business traveler ,and by myself, this was never really an issue. I also enjoyed the spa and fitness area alot. I never got to use the pool because it was December, but it seemed to be on par with many other major hotels in Vegas.", "title": "You get what you pay for", "helpfulness": 4, "user": "Thinker_to_go", "date": "January 1, 2009", "detail_rating": {"front_desk": 4.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 3.0}, "id": 23162869, "likes": {"liked": "— Price", "disliked": "— The SPA"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008", "text": "As far as serivce, I found the staff to be very polite. Some other hotels on the strip that I have been to seem to provide somewhat snobby service, but staff here is very proffesional and polite.", "title": "all you need to know!", "helpfulness": 3, "user": "dolphinboy1", "date": "December 31, 2008", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 23132630, "likes": {"liked": "— nice rooms", "disliked": "— charge for safe and internet"}}, {"rating": 4.0, "stay_parameters": "Stayed December 2008, traveled with friends", "text": "Overall its defintly not my favorite Vegas hotel, but seems alot better then many of the posts on here would indicate. For the price I paid I would defintley return. But I warn of one thing, that if you come here you have to expect a more basic hotel. Its not a loud and themed hotel like many on the strip. Keep that in mind and you will probably not have any problems here.", "title": "Great Room Great sights Great service.", "helpfulness": 1, "user": "Jonnyboy1967", "date": "December 20, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 22870516, "likes": {"liked": "— The Room", "disliked": "— The casino........but dont worry about this when deciding your destination."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled on business", "text": "Just got back from business trip to Vegas. I was traveling for business to Infocom. Had a reservation but when I arrived at 2:30pm, they didn't have a room available. The reception desk said they only had 1 room, otherwise told me I would have to wait til 7pm. I asked for non smoking room and the clerk told me that this is a smoking hotel so she couldnt guarantee any room was non-smoking. I took the room and it was a large room., however the room was filthy.", "title": "Absolutely filthy room", "helpfulness": 3, "user": "msh16", "date": "June 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 4.0}, "id": 132108849}, {"rating": 2.0, "stay_parameters": "Stayed June 2012", "text": "Murphy Queen bed instead of a regular mattress/bed.", "title": "Place aged with ugly and uncomfortable rooms.", "helpfulness": 2, "user": "Michaelbcox3", "date": "June 16, 2012", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 3.0, "service": 3.0, "rooms": 2.0}, "id": 132085944}, {"rating": 2.0, "stay_parameters": "Stayed June 2012", "text": "Sheets and bed spread had splatter marks - did not feel comfotable using them.", "title": "3* hotel for 3* price!", "helpfulness": 2, "user": "jvaldes77", "date": "June 16, 2012", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "location": 2.0, "service": 2.0, "rooms": 2.0}, "id": 132075271}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Smelled of smoke", "title": "ok, not fabulous", "helpfulness": 1, "user": "jenichip1", "date": "June 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 132065574}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "Ceilings yellow from smoke", "title": "OK....but not great.", "helpfulness": 3, "user": "L'amour99", "date": "June 15, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 132004971}, {"rating": 5.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "Very nice hotel with great rooms. It is off the beaten path a little but the monorail can get you where you need to go on the strip for 9.00 a day. Casino is nice but the service for drinks is not the best in the world. We checked in at midnight and it was extremely slow due to lack of staff.", "title": "Nice Hotel", "user": "marino22", "date": "January 1, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 3.0, "rooms": 5.0}, "id": 12221999}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled on business", "text": "The Hilton in Las Vegas had very nice rooms. We were upgrade to a sweet for our stay. The room was huge and the view was fantastic. The service was good at the hotel and the hotel coffee shop had great pasteries. The theme of the hotel is Star Trek which is no interest to me, but the hotel was great overall. The montarail has a stop at the Hilton so that is very handy as well.", "title": "Great room but off strip", "user": "dogfriendly2", "date": "January 1, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 12217186, "likes": {"liked": "— The room was great, very big and clean!", "disliked": "— The location was off the strip."}}, {"rating": 5.0, "title": "A Really Great Experience", "text": "We stayed at the Hilton for 3 nights in December and was very pleasantly surprised after reading all the reviews - take no notice of all the bad reviews - this hotel is great very clean extremely comfortable - all the staff were very helpful - we preferred being just off the strip - it is so easy to get anywhere with all the travel options - shopping at the premium outlet was great with only a $10 cab ride away - we could have stayed at our hotel for a week without having to go out anywhere there is just so much to see and do - the casino staff were very helpful and the room service food was great very quick and nicely presented and all for a really good price not ripped off - all in all I would not hesitate to recommend this hotel to anyone and would only stay at this Hilton on my return to Vegas. We looked at most of the other hotels and all they seemed to be were commercial money traps. the Hilton is the best value for money anywhere in Vegas and I would be prepared to pay more for the service we received.", "helpfulness": 2, "user": "shedsWestSussex", "date": "January 1, 2008", "id": 12214757}, {"rating": 4.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "After reading the reviews about this hotel, I was somewhat skeptical, but we were getting to stay there for only $55 a night, so my husband and I took our chances. It was nice. We had a renovated room, which was clean and nicely decorated. Check-in was simple and I checked out on the TV, so it was easy. We ate in a couple of restaurants, but I particularly enjoyed the Brunch buffet at the buffet. Great mimosa's! We attended the $250,00 Game Show. Save your money. Unless you were called on stage, it wasn't much fun. Barry Manilow was awesome, though.", "title": "Better than the reviews!", "helpfulness": 3, "user": "mmeisen", "date": "December 31, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 3.0, "rooms": 4.0}, "id": 12139410, "likes": {"liked": "— Quality", "disliked": "— Location"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2007, traveled as a couple", "text": "On the whole, we would recommend the Hilton for a nice time. A lot quieter surroundings than the strip, not as much hustle and bustle. We do not gamble much, but did lose $20 quickly in the quarter slots.", "title": "Too Noisey", "helpfulness": 2, "user": "mikepYarm_UK", "date": "December 30, 2007", "detail_rating": {"front_desk": 3.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 12079754, "likes": {"liked": "— cleanliness", "disliked": "— noise"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "My partner and I stayed at the Hilton for 4 nights at the beginning of November. The standard room was large, clean, nice bathroom and amenities. They offered us an upgrade for $50 a night, but when you are only sleeping in the room it really does not seem worth it. Only moan is that walls of the rooms are thin - we were situated near an elevator shaft and could hear the sound of the elevators through the stay. The Monorail to the strip is good, it only takes 15 minutes to the bottom of the strip and we found not being directly on the strip a nice change from the noise and bustle.", "title": "Enjoyable stay!", "helpfulness": 1, "user": "GuildfordMisty", "date": "November 14, 2008", "detail_rating": {"front_desk": 4.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21847852, "likes": {"liked": "— Tranquility compared to the strip", "disliked": "— Thin walls of rooms"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled with friends", "text": "Although other reviews have criticised the hotel, we really thought it was a good base for a Las Vegas stay, especially considering the much lower price than some strip hotels.", "title": "Nice place, Good Price, Off Strip", "helpfulness": 1, "user": "mzhawley4k", "date": "November 14, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 21846547, "likes": {"liked": "— Off strip location", "disliked": "— Internet fee was very steep. In room wireless access was 14.00 per day!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "My friend and I left the husbands home with the kids and went to Vegas for 5 days. We stayed at the Las Vegas Hilton. Very nice off strip location. I really liked that we were not downtown on the strip.", "title": "Las Vegas landmark, beautifully maintained", "helpfulness": 1, "user": "Mark43", "date": "November 9, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 21682251, "likes": {"liked": "— \"It has everything\""}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We did the \"50 Dollar Sandwich\" (hand the person at the check in desk your ID and your credit card with 50 dollars in between and ask if there are any upgrades available) and that worked out extremely well. We got an AMAZING room upgrade, from a little room with 2 beds to a HUGE suite with lots of marble and granite. We had 2 separate bathrooms with garden tubs, a kitchen, dining room, and living room as well as the 2 beds.", "title": "Lovley Hotel but Manilow cancelled shows and Donny failed to show", "user": "LadyofGlencairn", "date": "November 5, 2008", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 21577152, "likes": {"liked": "— Clean"}}, {"rating": 2.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "We had a great time. We did notice that no one in Vegas is very friendly, but we still had a blast!", "title": "downhill", "user": "totalh", "date": "November 5, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "business": 3.0, "cleanliness": 1.0, "rooms": 2.0, "location": 3.0}, "id": 21560855, "likes": {"liked": "— convenience to the convention center", "disliked": "— service and room quality"}}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 3.5, "variance": {"poor": 551, "average": 918, "very good": 976, "terrible": 457, "excellent": 497}, "aka": "Lvh - Las Vegas Hotel", "slim_ranking": 0.544444444444, "detail_rating": {"service": 3.5, "cleanliness": 3.5, "value": 3.5, "sleep": 3.5, "rooms": 3.0, "location": 3.0}, "description": "Experience unparalleled value, comfort, and variety at the LVH - Las Vegas Hotel & Casino , a premier off-Strip hotel in Las Vegas, NV, steps from the Las Vegas Convention Center. Offering a unique blend of sophistication and attraction with incredible restaurants, endless entertainment, and the world's largest Race & Sports Book in town, the LVH is ready to excite, entice, and engage all of your senses. LVH - Las Vegas Hotel & Casino boasts some of the most affordable rooms and suites, all while providing direct access to Las Vegas Blvd. by way of the monorail from their convenient off-Strip location."}