{"user_rating": 4.0, "review_count": 176, "name": "Lynton Hotel London Ltd.", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "B&B Located near Victoria. Welcoming hosts, comfortable beds, excellent full English breakfasts. Only downside is we were on 3rd floor (4th to Americans) with no lifts. If you book, ask for lower floor room! Takes VISA but not online booking.", "title": "Cheerful and convenient", "user": "AntonOfOz", "date": "August 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 77047119}, {"rating": 4.0, "stay_parameters": "Stayed December 2009, traveled solo", "text": "The Lynton Hotel was the perfect place while traveling to England. Located within a very short walk of Victoria Station not to mention many resturants/pubs. The hospitality was top rate. Simon was very helpful prior to my arrival and throughout my visit. He cooks an amazing breakfast! The rooms are clean and cozy. On my next trip to London I look forward to staying at the Lynton!", "title": "Very pleasant stay!", "user": "msarandos", "date": "August 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 77027397}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled with friends", "text": "I went in london on the 19th of august 2010 and i staied at lynton hotel. the hotel was very beautiful!! mr simon connor is avery nice person and very helpfull !! the rooms were quiet little but perfect for a stay in london, cleared. the hotel is very near victoria station and in a no noisy place!! the breakfast is very very very good with the traditional english breakfast and other!! see you soon mr simon and london city!!", "title": "VERY BEAUTIFUL STAY AT LYNTON HOTEL", "user": "GabrixCatania", "date": "August 25, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 76813303}, {"rating": 4.0, "stay_parameters": "Stayed July 2010", "text": "If you're looking for a large American-style hotel, the Lynton House is not for you. The rooms are a bit small, the hotel is older and shabby around the edges, and there is no elevator, but it's clean, safe, and the welcome is outstanding. Mark and Simon are so nice and helpful -- it felt like we were coming home every evening, not to a hotel. They are constantly updating the hotel (we went to Bath for two nights, came back and they had updated our television!), and the rooms are kept as clean as anywhere else we stayed. The breakfast is fantastic and cooked to order.", "title": "Great value, Felt like we were coming home every night!", "helpfulness": 1, "user": "historygrlsc", "date": "July 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 71775449}, {"rating": 4.0, "title": "Nice Place and Lovely Area", "text": "Is it the Ritz? No. But for the location (walking times of 5 minutes to Victoria station, 15 minutes to Buckingham Palace, 15 minutes to Harrods and Kensington) and the prices make up for it. Will definitely stay here again! However, probably will splurge the extra pounds on a room with a bathroom.", "user": "sheela7", "date": "May 13, 2010", "id": 64057994}, {"rating": 2.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Spent my last two nights in London here. Although it is a great deal compared to other London accomodations, this place needs alot of work. They are in process of painting and putting in new carpet, but I still didnt feel like it was very clean. You can also hear everything all the other guests are doing. The hosts are very friendly, but almost too laid-back - this place was inherited and like a hobby to them. The best part is its location to Victoria Station and the coach station - just a block away. However, I have stayed in many places and would not return to this one.", "title": "Needs alot of work", "user": "blurred1", "date": "April 5, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 4.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 60438005}, {"rating": 4.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Thank you Mark for all your help, good cheer and dry British wit! We miss you and your hotel already and will definitely be back!", "title": "My new London home away from home.", "helpfulness": 1, "user": "travel1098", "date": "March 28, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 59730507}, {"rating": 1.0, "stay_parameters": "Stayed February 2010", "text": "Our comedic, helpful, friendly, genuine owner and our cozy room #1 (facing the street on the first floor with NO steps to take) made our stay a comfortable and memorable one. Mark is also a very good cook!", "title": "Hotel that nearly ruined our holiday", "helpfulness": 2, "user": "piadimuik", "date": "March 23, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 59299580}, {"rating": 4.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "What price would you pay for local, unbiased, friendly and engaging help by owners with genuine interest in their guests? Did I mention the price was great? Having stayed in two other hotels on the same block last year, Lynton House is by far and away my pick.", "title": "Cosy place with great value", "user": "Shan0991", "date": "February 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 55787137}, {"rating": 5.0, "stay_parameters": "Stayed September 2008", "text": "After navigating Victoria Station’s chaos, walking the short tourist gauntlet down Buckingham Palace Road to Essleston Bridge Road and then to Ebury Street with all the other frenetic luggage toting travelers, then finding Mark to greet and help us, was simply great.", "title": "THE Friendliest hotel in all of London. Hands down.", "user": "alidiacquarello", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45418321}, {"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled with friends", "text": "Had a really lovely 4night stay with a friend at the Lynton. The location is excellent and like said in other reviews, close to Victoria station where you can catch a tube easily to anywhere in London. The area was nice, quiet and safe and a walking distance from e.g. Buckingham Palace, Big Ben.", "title": "Lovely stay - will definitely go back", "user": "Mutrunen", "date": "September 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 43856584}, {"rating": 3.0, "stay_parameters": "Stayed July 2009, traveled as a couple", "text": "Owners were very friendly - Only saw Simon the day we arrived but Mark helped us with anything we asked and believe me, we had A LOT of questions ;)", "title": "Cheap, well-worn B&B but convenient location for central London", "user": "ambough", "date": "July 25, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 2.0}, "id": 35727736}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "The hotel is little worn but we expected that and for us it just added to the charm. Room was clean and spacious. It had the little pod bathroom that some people hate, but since all me and my friend wanted was an affordable, comfortable, clean room with ensuite, we found it served the purpose just fine.", "title": "Great location & rooms with very friendly owners... I'll be back!", "user": "ClevelandCharlie", "date": "July 12, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 34578870}, {"rating": 5.0, "stay_parameters": "Stayed April 2009, traveled solo", "text": "I would definitely recommend the hotel to a friend and will be back myself given the chance. It's an old english period building with a lot of stairs so it's obviously not for everyone but we loved it. It's REALLY hard to find an affordable and clean hotel in London if you're on a budget - believe me, I spent the entire summer looking - so the Lynton was really a great find!", "title": "Compact, basic, clean and great breakfasts...who needs anything else?", "helpfulness": 1, "user": "londongirlie09", "date": "May 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29543541}, {"rating": 5.0, "stay_parameters": "Stayed April 2009", "text": "Maybe my expectations were too high. I read reviews of the Lynton Hotel on TA but I guess I was expecting simple and cheap like a 1980s Comfort Inn. I was disappointed when we walked in. London is expensive so we opted to economize, but you get what you pay for. Next time, I'll spend more money for a nicer hotel.", "title": "Fabulous location, very friendly, spotless rooms", "helpfulness": 1, "user": "Mary2001", "date": "May 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 29235367}, {"rating": 2.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Oh my, hard to know what to say. If you're from the US it'll be hard to believe what $150.00 per night gets you at the Lynton. Our room was tiny, with an old, worn double bed (no queens). Our bathroom (if you can call it that) was an all in one shower/toilet/sink in the smallest possible space, about 3 X 4'. Our bathroom wasn't even clean, the bathmat was left from the previous night (or more??) It was wet and dirty and the shower floor was dirty. Needless to say, we skipped the shower. On the up side, the Lynton has one of the best web sites I've come across with lots of helpful information. Simon was super friendly and helpful and the location is good, especially the proximity to Victoria station.", "title": "Spend a little more and be comfortable", "helpfulness": 2, "user": "penelope23Ohio", "date": "May 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 63846347}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with friends", "text": "I recently stayed at the Lynton Hotel at 113 Ebury Street in London. We arrived at 8 in the morning and the owners, Mark and SImon invited us to breakfast, stored our luggage and got out maps and guides and organized our day. Upon our return, our luggage was in our room! This is an old bed and breakfast in need of constant upkeep but the linens were spotless and the room was clean. Breakfast was cooked to order and when we left Mark and Simon posed for pictures and kissed us goodbye. The location is incredible, a 5 minute walk to good inexpensive restaurants, Victoria Station and the Hop-on, Hop-off bus terminal. If you need a budget accomodation, this is it!.", "title": "I felt like I was staying with relatives!", "user": "Sammysue", "date": "May 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 63830379}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with friends", "text": "Four of us stayed at the hotel and were very happy with the standards and service. If you are looking for a chain hotel where it doesn't matter if you are in London or Louisiana then the Lynton is not for you. It's small and a bit cramped, frayed round the edges with some quirky little aggravations but it is clean, it's ideally located, good value and very friendly. We all said that we will be back next time we are looking for a weekend in London.", "title": "Good location, good value friendly budget hotel.", "helpfulness": 1, "user": "Addicroft", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 63773296}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "A little shabby at first look...carpet in hallway looks half done and DIY etc but room, linen, washroom were clean, breakfast not bad, location perfect, and owners friendly. Price is right for London. I'd return.", "title": "suited me fine", "helpfulness": 1, "user": "clerk2", "date": "May 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 62963625}, {"rating": 2.0, "stay_parameters": "Stayed April 2008, traveled as a couple", "text": "The location was great. The \"host\" were great. The rooms sucked! Dirty, poor condition, linens were in bad shape.", "title": "Good location, good people, bad rooms", "user": "ndrake411", "date": "April 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 62613498}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "variance": {"poor": 9, "average": 13, "very good": 83, "terrible": 4, "excellent": 67}, "aka": "Lynton Hotel London Ltd. England", "slim_ranking": 0.11623246493, "description": "We are a simple B&B located in central London. We have no elevator/lift there are 78 steps from our ground floor to our 4th floor.Some rooms have no en-suite facilities and use shared facilities located on our staircase.The en-suites in the rooms are small but practical for an old building."}