{"user_rating": 3.5, "review_count": 109, "name": "M Vacances - Le Domaine de l'Arselle", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We had a 6 person apartment for 3 adults and one child but nevertheless the apartment was still way too small. The apartment was literally filthy. The toilet had not been cleaned and as for the toilet brush (I wont say). There had been no cleaning done, ever it seems, under the beds, sofa etc. Sheets and towels are not included and after you hire them you have them lug them to your apartment along with luggage. The beds are tiny and the mattress is a 2cm think block of foam. The resort itself is very small and is dead after 8pm. The outdoor pool was great but the sauna size is way inadequate and hard to get in. The main attraction however, the skiing, was great and there are enough slopes to occupy 6 days but the queues for the lifts on most days were very long. Another big plus is that Chamrousse is mainly for French people and the prices reflect this. Overall I would recommend Chamrousse but I would advise NOT staying in Domaine de'L'Arselle.", "title": "Cramped, run down and filthy apartments. Good skiing.", "helpfulness": 1, "user": "AllanBLondon", "date": "March 9, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 154076134}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We rented an apartment for 4 people and we were not impressed when we saw it. There is one bedroom with 2 single beds and the other 2 people had sleep on a pull out sofa located in the kitchen. It was rather irritating as the sofa bed had to be folded up and then taken out everyday. There was hardly any room for any of us. There are no duvets just blankets. There is no oven, kettle and no mugs. There is a TV but you have to hire the remote. There were no ski reps for us so we had to find our way by ourselves. The view we received was of the car park. We were about a five minute walk from the slopes which was lucky. The supermarket has the bare essentials but we had brought most of our food from home. When we tried to eat out we were told that you had to book first so we ended up ordering a pizza from la bachat. On the plus side the runs are wonderful for beginners and intermediates. We did the black olympic run from the top of the mountain which we found easier than some of the reds we had done!", "title": "\"Slopes were great but accommodation was poor\"", "user": "Skilover186338", "date": "March 3, 2013", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 153580875}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "The apartments are located in Chamrousse 1700 and cover a big area, so you may not be located near to ski school and lifts. Our apartment was in Drosiers E, and were about a 2 minute walk from ski school meeting point. We booked directly through the Chamrousse website. The apartment was good value. There were 4 of us but we stayed in a 6 person suite. I think we would have really struggled in a 4 person apartment because of the lack of space. Views from the balcony were great. You need to bring your own bed linen and towels, or you can hire them upon arrival. Not a lot of nightlife. Best place for a beer is K dox. Wifi is really poor all over the resort. Fantastic outdoor swimming pool open from 5 until 7.30 pm. On site supermarket is small but has all the essentials. Skiing itself is good. Fantastic for beginners and those looking to take it easy. Experts and thrill seekers may become bored pretty quickly, although the snow park is extensive. All in all a lovely little resort.", "title": "Good skiing and great views", "helpfulness": 1, "user": "cb_gringo", "date": "February 26, 2013", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "location": 4.0, "value": 4.0, "rooms": 3.0}, "id": 153198495}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We rented an apartment for 4 people privately (not through a tour company) and we were in Epiceas A building which, unfortunately, is the furthest away from the ski lifts and ski school. We did not appreciate the walk to and from them at least twice a day - so make sure you know which building you will be put in and exactly where it is located. Our apartment was very small with very little storage room. We were 2 adults and a 4 year old - I can't imagine how squashed 4 adults would be! The apartment was not clean and even had a problem with water leaking through the lino joints on the floor - yuk. The best thing about our apartment was that it was on the ground floor with a big terrace where we could watch our son playing in the snow. Chamrousse is good for beginners and intermediates. Renting ski equipment was not expensive compared to other resorts. It was too cold to use the swimming pool.", "title": "OK holiday but probably won't go back again", "helpfulness": 1, "user": "Michelle B", "date": "February 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 2.0}, "id": 152706598}, {"rating": 2.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "This place looks much better on the pictures (as usual) than in real life. Had appartment for 4 people. Apartment was not clean (despite cleaned by the company managing the property and not the previous renters). Toilet and washbasin not cleaned at all, layer of dust about 1 cm deep under beds. Generally felt dirty.", "title": "Run down and not well kept with limited amenities", "user": "gladahunden", "date": "February 17, 2013", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 152320182}], "location": {"country": "France", "region": "Rhone-Alpes", "continent": "Europe"}, "variance": {"poor": 11, "average": 30, "very good": 44, "terrible": 13, "excellent": 11}, "aka": "m Vacances - Le Domaine De l`Arselle Hotel", "slim_ranking": 0.2}