{"user_rating": 4.5, "review_count": 892, "name": "Macdonald Windsor Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We stayed here for our wedding night on June 4th. The staff couldn't do enough to help and every single person who stayed was thoroughly inpressed! The rooms are amazing and cannot recommend enough.", "title": "Fantastic service - well done guys!", "user": "Pablo23London", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113069326}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "Thank you to all the staff who looked after us. Job well done!", "title": "Second fantastic stay at this hotel", "helpfulness": 2, "user": "40somethingBelfast", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113042700}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Didnt think our stay could be better than our first as we had been upgraded to a fabulous room with great views of the castle but it was. Although we didnt have a great view from our room it was stylish and extremley clean. The staff made us feel special and were very helpful printing boarding passes and ordering taxi's to the airport. Great value for money including 1 evening meal which was of a very good standard. Hopefully we will get the opportunity to visit again and stay in this fab hotel. Thank you to all the staff for making our stay such a relaxing, pleasant experience.", "title": "Best I've stayed in for a long time", "helpfulness": 1, "user": "SouthCoastBrit", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113025532}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Stayed at this hotel only because the one we usually stay in during visits to Windsor was full. I am so glad. This hotel is spotlessly clean, rooms are relatively spacious, the beds are comfy and the staff are very willing, helpful and polite right from the time we drove into the carpark all the way through our stay to the time we left, even being charming when I confessed during checkout that I had broken a saucer in the room. And it cost less than hotel down the road where we usually stay.", "title": "Nice hotel - great rooms", "user": "Soniab13", "date": "June 12, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 112959800}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "We arrived early and our room wasn't ready, but the receptionist could not have been nicer and was apologetic even though it was our fault for arriving early. We went for a wander around the town and when we got back we were able to check in and our luggage had been taken up from our car to the room, which was a nice touch.", "title": "After an internet booking bungle we received amazing service", "helpfulness": 1, "user": "clarelancaster", "date": "June 12, 2011", "detail_rating": {"service": 5.0}, "id": 112893610}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "This hotel is modern and exceptionally comfortable. If you are staying in Windsor to visit the castle or Eton, you could not have a better location. It is close to both sights as well as very nice restaurants. However, the restaurant in the hotel is itself quite good and handy if you are tired and want to have a fine meal not far from your room.", "title": "Modern and Well-situated", "helpfulness": 2, "user": "Portia49", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 111831760}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Our room had one drawback. It was necessary to step down from the bedroom to access the bathroom and there was essentially no light late at night. The hotel should provide some sort of light to prevent falls.", "title": "Perfect in every way!", "helpfulness": 2, "user": "sticklegs", "date": "June 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111612543}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "We stayed at this hotel with my parents to celebrate their 65th wedding anniversary. The valet met us at the front of the hotel and then valet parked the car which was excellent. We checked in and the receptionist whose name is Gulshan was charming and gave us two adjoining rooms on the 5th floor. While we were admiring our rooms the valet arrived with the suitcases and again he was extremely polite. The rooms were lovely, one with an extremely large king bed and the other a queen bed. We also had a view of the Windsor Eye and the Castle. Breakfast was superb i.e. cereals, fresh fruit, dried fruit, cheeses, meats, danish pastries. You could also order hot breakfast items which were bought to you by charming waitresses. Our thanks go to Laura who looked after us very well for breakfast. Nothing seemed too much trouble. She even bought a plate of danish pastries over to our table which had just been made. Dinner in the evening was lovely with a very good selection of starters, mains and desserts. On the anniversary evening there were 8 of us and we were looked after very well by Donna. Unfortunately we cannot remember the other waitresses names who looked after us at dinner but nothing seemed too much trouble for them and they were charming. We spoke to Gulshan after dinner and she said she had put some chocolate muffins in my parents room for their anniversary. This I thought was a lovely touch on her behalf. I always think that when checking into a hotel and you are greeted by a receptionist with a welcoming smile, it starts your holiday off well.", "title": "Superb!", "user": "gwennan_11", "date": "June 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111463195}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "All the staff which we spoke to are a credit to this hotel and our thanks go to them for making my parents anniversary really special. We would not hesitate in recommeding this hotel to anyone visiting Windsor.", "title": "Good but .........", "helpfulness": 4, "user": "Dublingirl52", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 111138631}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "What a fabulous hotel! All hotel staff were very friendly and extremely helpful from our first greeting at the hotel car park to our departure at reception. We were provided with good information with regards to the purpose of our visit to Windsor by the reception staff. We also chose to dine at the hotel on the evening, the food was excellent and very good value for money. We would have no hesitation in recommending the hotel and look forward to our next visit in the near future.", "title": "Really special", "helpfulness": 3, "user": "LucyBoon", "date": "May 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 109814222}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with friends", "text": "This is a great hotel and we thoroughly enjoyed our 1 night stay here. We arrived on a Saturday morning for a wedding. Once we had managed to get the car to the car park (there was a huge coach tour in front of the car park so it took a while to get down there) a very pleasant valet came to park our car. The room was huge and the bathroom was almost as big as the hotel room!", "title": "Amazing rooms, amazing location, loved it", "helpfulness": 2, "user": "ZeusnGoose", "date": "June 29, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 114877863}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Breakfast was included but we weren't awake in time to take advantage although other friends who were staying said it was great.", "title": "Great location", "helpfulness": 2, "user": "Sauly23", "date": "June 27, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114806489}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Nothing to fault - it was brilliant and well worth the money.", "title": "Windsor's best kept secret", "helpfulness": 1, "user": "DelboyandDonna", "date": "June 19, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 114375274}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "A great hotel in the middle of Windsor. Opposite the castle and close to the shops and restaurants. Only stayed for one night and wish we could have stayed for longer. Only down fall is u can't use their own car park before u check in.", "title": "Excellent must stay", "helpfulness": 1, "user": "gerryHerts", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113248688}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "I should firstly admit that I haven't stayed here but come regularly to drink in the bar. It is a very contemporary setting in the recently renovated building that used to be Caleys, which lends its name to the bar. We come to relax and enjoy a large glass of wine or three on one of the many sofas, which is often accompanied by what must be the best gratuitous \"nibbles\" we have had anywhere. Added to which, the staff are very polite and attentive.", "title": "Out of this world. Loved it!", "helpfulness": 2, "user": "NomadPrincess", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113103898}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "Stayed right after the royal wedding so the town and castle were very crowded. Hotel location is close to numerous shops and great restaurants. Slight traffic noise during the day (I had a street level room) but became quiet at night.", "title": "Great location, quiet and comfortable, easy to reach from London Heathrow", "helpfulness": 1, "user": "beerdrinker2005", "date": "May 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 108342607}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "Comfortable queen bed and pillows. Desk with high-speed Internet (wired and wireless). Flatscreen TV (with A/V inputs) with a dozen or so mediocre channels, no pay movies. Stocked minibar. NOTE: any movement of any item in the minibar will trigger an erroneous change on you room bill (fortunately, easily removed at check-out time). Complimentary chocolates each evening.", "title": "Gracious Staff", "helpfulness": 1, "user": "ladawncp", "date": "April 30, 2011", "detail_rating": {"location": 5.0, "service": 5.0}, "id": 106197815}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Rooms were tastefully decorated with wallpaper and dim lighting. A separate (walk-in) shower. Bathroom with tub and hairdryer. Iron and board in room. Safe worked OKAY once staff unlocked it. Two telephones but no clock or alarm (those features available on the TV). Heat and A/C worked well. UK outlets throughout, with 110-volt North American plugs in bath. Loaner AC adapter available. Bose iPod docking station with good audio (and remote control).", "title": "Beautiful room, perfect service, fantastic location.", "helpfulness": 1, "user": "lovethefreckles", "date": "April 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105997300}, {"rating": 5.0, "title": "Ideal Location", "text": "Breakfast service was leisurely so I opted for the buffet. Many cafes and coffee shops nearby also. Hotel bar with two low-end international beers but a dozen traditional pubs nearby with cask \"real ales\".", "helpfulness": 2, "user": "SarahBenson", "date": "April 26, 2011", "id": 105604129}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Great location for strolling to the park, river or Eton. Very friendly and helpful staff. Made of a very pleasant stay.", "title": "superb service and friendly staff, great assistant F&B manager", "helpfulness": 1, "user": "willorouge", "date": "April 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105540610}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 4, "variance": {"poor": 13, "average": 46, "very good": 182, "terrible": 6, "excellent": 645}, "slim_ranking": 0.0714285714286, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Now open, the new Macdonald Windsor Hotel, situated 2 minutes walk from the gates of Windsor Castle will offer 120 luxury bedrooms in the heart of the historic town. The Royal Borough is home to some of the most well known attractions and the Macdonald Windsor Hotel offers the perfect base to experience them from. Relax in Savill Gardens, situated within Windsor Great Park, soak up the heritage of Eton College with its historic buildings, or indulge in a relaxing boat trip or romantic horse drawn carriage through the park. The Macdonald Windsor Hotel presents business travellers with an ideal base from which to host meetings and conduct business in the south. The hotel will encompass everything guests have come to expect from Macdonald Hotels & Resorts in a fresh and contemporary property just 10 miles from Heathrow, minutes from the M4 and M25 and less than 40 minutes to Paddington from Windsor Central train station. A perfect business solution! Large conferences and events of up to 150 delegates will be accommodated in the main meeting room, supported by a second meeting room for up to 70. Smaller board meetings will be hosted in two executive boardrooms for 25 delegates each, and an additional two syndicate rooms for 10 will be available to book for breakaway sessions."}