{"user_rating": 4.0, "review_count": 153, "name": "Madeira Regency Club", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed for most of a week on a timeshare swap to get some sun and away from the snow. The room was a 2 bedroom and very generously sized. The kitchen was a little basic for our taste. The TV was well stocked with a range of channels for all countries and preference. No Wi-fi in the room was a disappointment but the Lobby had a strong signal. We had a wonderful sea view and a massive balcony almost as big as the apartment. A little road noise and some building going on but not excessive. I personally found Madeiran cuisine quite limited. The staff were very polite friendly and helpful. The local supermarkets, except for the big one, were woefully stocked with most fridges closed down. The Club has a very nice pool area and some limited activities for guests.", "title": "Very good - very quiet", "user": "ukbod", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 4.0}, "id": 150691390}, {"rating": 4.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "It was better than we expected and did the job. Very room studio overlooking the sea, pool area, sea and a view of the harbour. Accommodation was fine - very spacious and much bigger than we had hoped for. Very quiet and restful. However the whole place is a little higgledy piggledy in that you go into reception, up the stairs to the 1st floor, then across the garden, across a bridge over a road and then another lift down to your studio room. We had an end room which had a semi-circular balcony which was delightful. We were next to the lift which we thought might cause a problem but didn't. Everything worked well within the studio room which included a kitchenette and all the mod cons. Large TV with 70 channels most this time in English. Food in the Yacht Restaurant and Bar was delightful - we only ever ate there at lunch times and the staff were lovely. Overall a lovely stay - thoroughly enjoyed our trip to Madeira which has been about our 8th year. Only down point is if you are in the main hotel you have a long walk to the swimming pool area.", "title": "It was a very restful holiday", "helpfulness": 2, "user": "Peggie97", "date": "January 11, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 149440060}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Our fourth visit to Madeira, and the third time at the Regency Club. Things change, a little, but this is still a delightful place that meets most of all our needs. Since our previous review, the breakfast area has been converted, very nicely, into a lounge, and breakfast is now served in the poolside bar/restaurant. This is nice, on nice days, but unfortunately it rained a couple if times this trip and going out and across the bridge was a nuisance. They've also dropped the courtesy bus that used to go into the town centre, which is a big loss, although the walk into town alongside the harbour side has been greatly improved by the authorities and is now very pleasant. Despite these niggles, I don't think we'd want to stay anywhere else. It suits us perfectly.", "title": "Third time - and counting", "helpfulness": 1, "user": "Bill G", "date": "December 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 146718266}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "We have stayed in this hotel a number of times because it suits us. It is quite close to the town centre and overlooks the bay. There are a variety of rooms and suites - we had a 1 bedroomed suite, which also had a lounge (leading on to the balcony overlooking the sea and the harbour), a well equipped kitchen and bathroom. The rooms were well appointed, clean and comfortable. There have been some changes since our last stay - the hotel seems to have separated from the Regency chain, although the branding was still evident. The main difference seemed to be the lack of a minibus to take guests to and from the town centre, which may well have caused problems for some guests. We found the walk to town and back pleasant, albeit hilly - but Madeira is hilly!", "title": "A restful holiday", "helpfulness": 1, "user": "none50", "date": "December 3, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 5.0, "location": 4.0}, "id": 146665453}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "The Pool and restaurant are over the main road, reached by a walkway; this is a pleasant area to sit and have a drink (and sunbathe and swim too).", "title": "location location location", "helpfulness": 3, "user": "zumzumchristy", "date": "November 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 145291531}, {"rating": 3.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We have recently returned from a holiday staying at the Madeira Regency Club. Having read some of the negative tripadvisor reports it was with some concern that we arrived at this hotel/timeshare complex. Check in went smoothly with the pleasant reception staff. Our apartment was spacious, clean and well furnished. There were two bathrooms which is always a plus, his and hers! The kitchen was tiny but as we only needed a refrigerator to keep the drinks cool this was not a problem. From our balcony there was a good view of Funchal harbour and out to sea. The “air conditioning” is 100% useless for cooling purposes. The fans do work and create some air movement which would not be sufficient to achieve comfortable conditions in hot weather. Fortunately, during our stay the weather was just pleasantly warm and the lack of air conditioning was not too much of a problem.", "title": "Fit for Purpose", "helpfulness": 1, "user": "RnBrian", "date": "October 25, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 143690503}, {"rating": 2.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "The complex extends over both sides of the road leading uphill from the harbour and is linked by a pedestrian bridge. It does take a day or so to get used to navigating between the two halves. The pool area is across the bridge from the main building. There is a single adequate pool, bar and pleasant restaurant area. Beyond the pool is a construction that facilitates sheltered sea bathing.", "title": "disappointing", "user": "CAV52", "date": "October 16, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "sleep": 1.0, "rooms": 2.0, "service": 3.0}, "id": 142985906}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "I can appreciate some of the comments in previous reviews. Some areas are definitely looking tired and renovation work is required. There is a weekly €50 utilities charge and a €10 for a safe key. Should you require a taxi, they seem to take forever when ordered through reception. We found it easier to flag one down on the road outside. I almost forgot the mosquitoes, they are numerous and of a minute variety. I was fortunate, they do not seem to like my flavour but other members of our party were very badly bitten.", "title": "A nice surprise", "helpfulness": 1, "user": "TitaCatita", "date": "October 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142556168}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Overall, we had a pleasant stay, we found the location perfect and all members of staff that we came in contact with were always pleasant and helpful.", "title": "Third Party Reservations gone bad", "helpfulness": 1, "user": "Ritter_0623", "date": "September 25, 2012", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 141252623}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Booked this hotel via RCI as an exchange. I have to say that this is the tattiest apartment we have ever stayed at in over 16 years as timeshare owners. The furniture was tired and dirty - our sofa had ink stains amongs others and the beautiful fabric on the armchairs was dirty - particularly the backs which looked as though the many many years of use have seen some people sitting against them with suncream on (thats all I can imagine). The sofa was so bad, I covered it up with a blanket rather than have to look at it. The kitchen units were peeling so a definite upgrade is required. The air conditioning was useless and wasnt functioning during the night because reception said it was too noisey! The pillows on the beds were awful so never had a decent nights sleep. As an RCI exchangee we were made to feel like 2nd class citizens - made to vacate our room earlier than owners and refused a discount card for use in local restaurants etc.... as we were RCI! Plus we were charged 50 euros per week service charge which I feel is a disgusting addition to the holiday costs and 10 euros per week for a safety deposit box. With some investment this could be an amazing resort as the facilities and the location are excellent. I certainly wont be staying there again - there are far far better places to stay where your custom is appreciated!", "title": "Home from home", "helpfulness": 2, "user": "Scott_19460828", "date": "September 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140838763}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Madiera Regency Club sells itself as a 4 star hotel. It's a good clean basic 3.5 stars but in no way a 4. Four star hotels don't charge 2.50 euros a day for umbrella hire in the pool area - or 10 euros a week for use of the safe. This is a block of timeshare (they deny timeshare - it's some kind of certificate scheme) apartments which also lets rooms on a hotel basis. So may guests are self-catering - which may explain the soullessness of the public areas. It is, however, in an excellent location just 10/15 minutes walk into Funchal with a nice cluster of bars and restaurants just outside the back gate.", "title": "3.5 stars, OK if you get a good deal but don't pay 4 star prices.", "helpfulness": 1, "user": "MonaLondon", "date": "July 6, 2012", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 133585561}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The room was spacious and spotlessly clean, the decor was tired and in need of a facelift. The peace and quiet was lovely, not a sound in the night, no mysterious humming sounds, no traffic just peace all night long. Haven't slept so well in ages. You have to PAY 10 euros a week for a room safe.", "title": "It never changes", "helpfulness": 3, "user": "STEVE CLARK", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 133346516}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The common areas also are overdue for refurbishment so while it wasn't decrepit it did not live up to the expectations created by its own website.", "title": "Another lovely holiday at the Madeira Regency Club", "helpfulness": 3, "user": "Nantlais29", "date": "July 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 133334935}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Judging by previous reviews there is an inconsistency in the service being provided by staff members. Pool staff and room cleaners were excellent, friendly and helpful. The restaurant/bar is another matter ranging from indifference to plain rudeness - ie the waiter asking 'how many eggs?' as he was walking away from the table and the waitress lecturing on how we should drink our coffee straight away if we want it hot denying it was cold in the first place. The waitress Celina is the saving grace - friendly, helpful and able to find a moment to pass the time of day. Other guests were having different experiences but i don't want to have to go to the same hotel 3 years in a row before they treat me with some manners.", "title": "Just great....", "helpfulness": 2, "user": "Gallusdomesticus", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132555718}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "The breakfast buffet is excellent with plenty of fresh fruit and a good choice of cereals, bread and pastries. And you can order a fried or boiled egg if you can get a staff member to pay you any attention! The restaurant is often visited by pigeons, many people don't mind that but some do. The staff shrug if you mention it.", "title": "Hotel", "helpfulness": 1, "user": "johno100", "date": "June 13, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 3.0, "location": 5.0, "service": 3.0, "rooms": 4.0}, "id": 131887768}, {"rating": 1.0, "title": "do not book on the internet", "text": "I have stayed at this resort a number of times in the past booked via RCI and had very pleasant stays.In November of 2011 i booked a 4 day stay at the resort due to start on 30/8/12 via the resorts website. I paid my money via credit card and got confirmation e mails etc. In late August 2012 just before we were due to depart i was phoned and e mailed to be advised that a company called strawberry world had operated their internet bookings and had gone into administration and that our monies had not been passed on to the Regency. The regency have taken upon themselves to cancel our booking saying we will have to pay again if we wish to stay. I am disgusted withour treatment when the internet bookings are made there is no indication that a third party is involved. I wouls stringly discourage anyone from booking with them over the internet", "helpfulness": 3, "user": "martin w", "date": "August 27, 2012", "id": 138503161}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "I'm an owner at MRC and can say that it is one of the friendliest and well-kept hotels I've been to (and I have done a lot of travel around the world!).", "title": "Home from home", "helpfulness": 6, "user": "VJC68", "date": "August 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136982095}, {"rating": 4.0, "stay_parameters": "Stayed July 2012, traveled as a couple", "text": "I go at least once a year and it truly is 'home from home'. Joel is the most efficient, friendly and thorough manager I've ever encountered - nothing is too much trouble for him to arrange, whether it's tea at Reids or car hire. We try to support the on-site shop whenever possible and make full use of the lending library.", "title": "Good value for money", "helpfulness": 2, "user": "814Watchdog814", "date": "August 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 136484446}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "There are lots of restaurants nearby but they can be slightly more expensive than those a bit more of a walk away - whether east or west along the coast. You can get some really good bargains if you look. And do try the green wine - can be tricky to find in England so make the most of it in Madeira!", "title": "EXCELLENT!!!!!!!", "helpfulness": 3, "user": "James J", "date": "August 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 136220076}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "There is so much to do on the island and what I love about it is the lack of gangs of youths (there are clubs/discos, but more for the locals) and just a quieter pace of life generally. Also because Madeira does not really cater for families/children the pool tends to be peaceful too.", "title": "brilliant, as usual!", "helpfulness": 2, "user": "xelaward", "date": "August 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 135964588}], "location": {"country": "Portugal", "region": "Madeira Islands", "continent": "Europe"}, "stars": 4, "variance": {"poor": 8, "average": 24, "very good": 69, "terrible": 2, "excellent": 50}, "aka": "Madeira Regency Club Hotel Funchal", "slim_ranking": 0.417582417582}