{"user_rating": 4.5, "review_count": 540, "name": "Madison Concourse Hotel and Governor's Club", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled on business", "text": "The Concourse Hotel is a good, solid, business class hotel -- nothing exceptional, but reliable, with good, attentive staff. I had two rooms -- one on the 8th floor, one on the 10th -- and the contrast between them was considerable. The room on the 8th floor was clean but felt very small & there was no refrigerator; there were also no screens on the window. My second night, I moved up to the 10th floor, and the room felt much bigger; it had a decent-sized refrigerator, which made all the difference to me, as I like to keep water, milk & fruit in the frig for hotel stays of more than one night; there was a screen on the window, which had a great view of the state capitol; so the experience of the two rooms was really very different. The hotel food was decent, but not in any way exceptional, but there are so many restaurants on State Street just a stone's throw away that there's no reason to limit yourself to the hotel restaurant. The meeting rooms were standard hotel meeting rooms; the only really annoying thing was that they were kept at Antarctic temperatures and hotel staff had to be asked to turn down the air conditioning -- ridiculous, given that it was only in the low 70s during the week I was staying there in August.", "title": "A good, solid, business class hotel.", "helpfulness": 1, "user": "savvyworldtraveler", "date": "August 26, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117271448}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Stayed for just one night with my husband as part of a wedding-block. While Madison isn't far from our home, we rarely spend time there, so this was a complete unknown for us.", "title": "Wonderful facility!", "user": "cerwinfam", "date": "August 18, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 116898537}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Hotel was easy to find right in the middle of town and w/in walking distance to the capitol...yes, even in a dress and heels in hot summer weather!", "title": "Understated Elegance", "user": "beerwriter", "date": "August 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 5.0}, "id": 116798782}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "The check-in process was fast and flawless, with very amiable front desk clerk. All common areas (lobby, hallways, elevators, etc) were spotless and well-designed.", "title": "Great location and excellent atmosphere!", "helpfulness": 3, "user": "viajeravoyageuse", "date": "August 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 5.0, "service": 5.0}, "id": 116449407}, {"rating": 4.0, "title": "A Very Good Choice", "text": "Our room was surprisingly spacious, spotless, and comfortably decorated. Bed was REALLY comfortable, and additional seating space was welcome as some other wedding guests joined us for a visit between ceremony and reception. Room was wonderfully cool w/o the usually clunking of ancient a/c.", "user": "djkrun", "date": "August 8, 2011", "id": 116442877}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My husband and I drove up from the Chicago area to spend a night in Madison for our anniversary - wish we could have stayed a week! There is so much to do there. The highlight of our trip was the Madison Concourse Hotel - superb service by every staff member we encountered. I was unfamiliar with this hotel, but reading the Tripadvisor.com reviews was so helpful, so took a chance and booked a Governor's Club level room - and thoroughly enjoyed it. So many reviewer have already highlighted many of the advantages of this hotel, but I want to add that this level room is so worth it. However, any room would be great here, I'm sure.", "title": "Wonderful Hotel - We'll be back!", "user": "NanaCathy", "date": "September 7, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117798791}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled as a couple", "text": "We upgraded to the Governor's Club and it was well worth the extra $40. You have access to a private lounge with snacks, drinks, desert and contiental breakfast. We were given a corner room with great city views. The hotel is located walking distance to the Farmer's market and the capitol square as well as stores, restaurants and night life along State Street. The room was immaculately clean and the desk staff very helpful. I highly recommend this hotel. Comfy beds and plenty of pillows.", "title": "Great location and service in the heart of Madison", "user": "oceanside-Mary", "date": "September 3, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117638967}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled solo", "text": "This was my first outing to Madison. I was scheduled to attend a seminar at the Madison Concourse and was impressed with the service. When I arrived at the tidy Dane County Airport, the shuttle was not available but the hotel picked up the cab fare. Check in was pleasant and efficient.", "title": "Midwest Hospitality Meets Urban Sophistication", "helpfulness": 2, "user": "Molga", "date": "September 2, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 3.0, "service": 5.0}, "id": 117586940}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "My room was located on the fifth floor. Decor was the usual uninspired hotel traditional. The bathroom had some nice touches, ie,sconces, and wood accents. My room had two very comfortable queen beds, a desk, table,refrigerator. Included is complimentary wi-fi. The view was disappointing, an ugly roof top and buidlling with a peek of the capitol buidling.. The air conditioning was somewhat noisy but efficient and I was quite comfortable throughout. Even though the hotel was fully booked, it was quiet.", "title": "Great hotel with superb service", "user": "Knitterforallseasons", "date": "September 1, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117555270}, {"rating": 4.0, "title": "Very Nice Room in Governor's Club", "text": "The gym is located on the third floor along with nice large pool. vending and a microwave were also available there. Unfortunately, the candy in the vending machine was melted (not that that stopped me fromeating it)..", "user": "bakerGirl718", "date": "August 29, 2011", "id": 117428716}, {"rating": 4.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The Councourse is in the central business area of Madison and is just a short walk from the Capitol. The location is quite good and there are restaurants and shops within walking distance. Rooms are spacious and comfortable, but the bathrooms are small and nothing special. My only real complaint is that window-based heater / air conditioning unit is noisy and does not regulate the temperature very well.", "title": "Stately Hotel in Downtown Madison", "user": "joeb1249", "date": "October 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 119259467}, {"rating": 3.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "The hotel restaurant is quite good and is reasonably priced. The cold and hot breakfast buffets are ample and much less expensive than other hotels I've stayed in. Front desk staff were friendly and helpful, and the frequent shuttle between airport and hotel was convenient.", "title": "Average", "user": "jmh7946", "date": "October 12, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 119223657}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled with family", "text": "I stayed here for a conference. Overall it is a nice hotel but I wasn't \"wowed\" by it. The room was a decent size and the beds were comfortable but the bathroom was nothing to write home about. Plus I had to pay for parking - which drives me crazy. In addition, the heater/AC unit was quite noisy. The only plus is the location - can't go wrong there!", "title": "Great location, service and pool", "user": "travelerofworld", "date": "October 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 119159123}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "I have stayed at Best Western and Doubletree here. Cheaper than Madison Concourse, but the Concourse is worth the slightly greater cost. The staff were just terrific, ever accommodating and responsive. The website does not indicate that there is a very good pool (by hotel standards) for lap swimming, so do bring your suit if you like to swim. The club floor had ok small plates and drinks before dinner and an ok breakfast.", "title": "Very nice!!", "user": "Rosadara", "date": "October 1, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 118811751}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled on business", "text": "I recently stayed at the Madison Concourse with my wedding party. We were on the governor's level, which are the top two floors. These rooms are more exclusive and come with access to a free open-bar and breakfast, which were lovely! Overall, I was impressed with the hotel. I don't think the hotel has that much personality, but it is better than the chairn. I enjoyed my stay, as did my wedding party and guests!", "title": "Central location, traditional rooms", "user": "hotelgirl111", "date": "September 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118755014}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "My family was staying from out of town for a wedding. Not having much experience with Madison, I was very insecure. I had two little boys in the wedding and had to have them at various sites at various times. This hotel offered me shuttles to wherever I needed to go with little or no wait. Very convenient for a mom. The shuttle drivers were very courteous and helpful. The rooms were very clean and the beds very comfortable. My children used the pool on two occasions and it was very clean as well. The bar and restaurant located in the hotel was also very convenient. The prices were good. They offered a delicious breakfast buffet every morning. The bar staff again very friendly and very hard working. The cheese curds alone would have me return. Just overall a great experience. Seriously can't wait to go back with friends and enjoy the weekend again.", "title": "very well taken care of", "user": "Collin M", "date": "September 28, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 118711743}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We recently stayed at the Madison Concourse Hotel for the wedding of my niece. All of the family came from out of town, so we all stayed here--and were so impressed with the helpfulness and consideration of the staff, as well as the accommodations. No matter what we requested, we received it--and quickly. The bride's parents had a party room to allow gatherings for all of us for the whole weekend, and it was great. We will definitely stay here again when we come to Madison--maybe for a baby shower?", "title": "Great time in Madison, WI", "user": "Karen C", "date": "September 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 118659413}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Stayed at the Madison Concourse for the 3rd time. Got a great deal on Priceline. This is a very nice, clean hotel that is a stones throw from the State Capital. My wife and I went down for the Taste of Madison over Labor Day weekend. Going to make it an annual event. We have also stayed here for the Madison Farmers Market. A great getaway. The hotel staff is very courteous and helpful. The rooms are clean, tastefully decorated and good size. Couldn't ask for a better hotel in a wonderful city!!!", "title": "Perfect Location - Beautiful Room", "helpfulness": 1, "user": "Farmtowner", "date": "September 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 118498159}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "We stayed at the Madison Concourse for two nights the first weekend in September, for our daughter's wedding. My wife and I have stayed here several times in the past and have always enjoyed our visits. However, this weekend was particularly nice. Our room had an air-jet tub, which was great. The bed was comfortable and the room quiet [although the AC unit was rather loud]. The package we had included access to the Governor's Club for drinks in the evening, along with appetizers and, later, several desert items. All very good. Breakfast is also very good and it's great place to read a newspaper while enjoying the view of the Capitol. The service was excellent, includng a wonderful gentleman on our floor who, when he learned of the wedding, informed us if we needed anything at all, to let him know. We didn't need anything else but he was great. Parking is part of the package and that was flawless. The wedding and reception was great and the Concourse was a big part of our excellent weekend.", "title": "Great place for a wedding weekend", "user": "DonEOshkosh", "date": "September 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 118432014}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "My wife and I stayed here for our anniversary. There was so much to do downtown and we could come back and relax at our room with an amazing view of the Capitol Building. There were some very nice food and drink perks at the hotel as well. The staff was very friendly and the room was very clean.", "title": "Very comfortable and in the middle of the action", "helpfulness": 1, "user": "Brian B", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117960310}], "location": {"country": "United States"}, "stars": 3.5, "variance": {"poor": 13, "average": 41, "very good": 154, "terrible": 7, "excellent": 325}, "aka": "Madison Concourse Hotel And Governors", "slim_ranking": 0.112903225806, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 5.0}, "description": "Welcome to Madison’s hotel. Our staying power is confirmed by our long-standing dedication to being downtown Madison’s premier hotel and we are proud to be named Best Hotel for Business and Pleasure by Madison Magazine. We offer our guests a special Madison experience through our distinctive customer focus and perfect location that cannot be found at a chain hotel."}