{"user_rating": 4.0, "review_count": 663, "name": "Madison Hotel", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Arrived at Hotel around 4:30. Valet parking outside was total confusion. Had to carry our luggage in. Room was not ready. We set in lobby untill 6:30 at which point I went up and asked about our room and was told \"oh yea it's ready\" I was given a key to room, we had to carry our own luggage up. When I opened the door there was already someone elses luggage in room. Had to go back down and was given a different room with no explanation. On day two we returned to our room around 5 to take a break before our dinner reservations to discover our room had still not been cleaned. They came around 5:30 and I was told that the Hotel management had not scheduled properly for the number of guest. The next day we came in late and the room had been done properly but the Toilet tissue had not been refilled so we had to call at 10pm for a refill and we were asked on the phone \"did you look for a spare roll?\". Working for a company with offices in Memphis they normally put people in the Peabody, I thought we would give what was supposed to be the \"other 4 star hotel\" a chance. I must say our first impression will probably be our last.", "title": "Nice but no 4 Star", "user": "Leroy C", "date": "February 21, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 125002656}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "usually stay at the Peabody but they were booked, refered to a sister property, The Madison. A great boutique hotel, the service was remarkable right down to the floor staff! everyone from the front desk personnel, to the valet staff, to the housekeeping staff was friendly and went out of their way to be friendly and helpful! We highly recommend!", "title": "great service", "user": "Pinotboy", "date": "February 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124953711}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My wife and I have stayed at this hotel several times over the past 5 years. However, we haven't been able to go there for a couple of years so we were excited about our stay 2/18/12. We ususally stay in the VIP room, but it was taken so we got a king single. Now, we can't wait to get back with the VIP is available because the renovations they have made are amazing. We love this place! We had dinner at they adjoining eighty3 restaurant. The meal was excellent and the executive chef came out to say hello and check on our meal. All I can say is get the Kansas City Ribeye! We had the brunch Sunday morning and it was just as delightful. Great job! We will definitely be back!", "title": "This place has really improved", "user": "David A", "date": "February 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124865483}, {"rating": 1.0, "stay_parameters": "Stayed February 2012", "text": "Arrived at 6, and the entire lobby is full of people waiting for rooms. Despite a check in time of 3, people have been waiting for hours. Reservations mean nothing. Would love to rate the room if I could ever see it.", "title": "No room at the inn", "helpfulness": 2, "user": "CSid", "date": "February 18, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 1.0}, "id": 124781997}, {"rating": 4.0, "title": "Hotel name should be \"CCS on Madison\"", "text": "The Madison Hotel should change its name to CCS on Madison! My husband and I stayed here on New Years Eve and the evening before. As all the previous reviews state, it is a hip boutique hotel right in the center of everything. I am not going to restate what everyone else has stated, except to strongly repeat how incredible their customer service was for my husband and me. The most specific example was when we returned to the hotel early evening on New Year's Eve with a few shopping bags from Kroger. We intended to have a romantic picnic-style dinner in our room with wine, cheese, crackers and fruit. One of the doormen inquired about the grocery bags. After we informed him of our intention to have a romantic dinner in our room, he proceeded to (without being asked) bring us an ice bucket for our wine, extra ice, wine glasses, etc. I was so impressed that he took the initiative to do all of this for us, without being asked! The Madison Hotel truly has customer service pefected. We will be back!", "helpfulness": 2, "user": "A TripAdvisor user", "date": "February 16, 2012", "id": 124671225}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Was sorry I was only staying 1 night for business ! Beautiful and comfortable room. Clean and quiet. Nice breakfast spread. Friendly service. Would only stay here on return visit.", "title": "Excellent", "helpfulness": 2, "user": "acorn1ma", "date": "February 15, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 124631739}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "From the chocolate covered strawberries at check in, to the beautiful room, to the dinner that was just perfect, this was an evening to remember. The staff was very pleasant and helpful. Everything was perfect.", "title": "Valentines night at the Madison", "helpfulness": 2, "user": "Inloveinmemphis", "date": "February 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124618052}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I have stayed at this property several times. It is an upscale boutique hotel much nicer than average chain hotels. The rooms are well appointed, but the standard rooms are small. On this stay, I had a river view king. It was very nice with a separate sitting room space. This is the only hotel I will stay at when in Memphis.", "title": "The only hotel to consider in Memphis", "helpfulness": 1, "user": "Paul S", "date": "February 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124537331}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "My husband and I wanted to take a short trip for Valentine's Day weekend and we chose the Madison. The hotel was an excellent choice...the staff was wonderful and very friendly and attentive to our needs. There is an indoor pool and fitness center. The door staff was very helpful and retrieved a map for us of downtown Memphis and had great suggestions on where to see live music that turned out to be spot on. The hotel is very quiet and the rooms are much larger than the Peabody Hotel's rooms. You can walk to Beale street as well as most attractions downtown. I would recommend this hotel to anyone and we plan on staying again.", "title": "Worth every penny", "helpfulness": 1, "user": "Jenny M", "date": "February 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124503404}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "When on business or pleasure and looking for first class Hotel in downtown Memphis.........It is the Madison Hotel! Great location downtown. Rooms are beautiful and staff very helpful and friendly.", "title": "Madison Hotel Memphis TN", "helpfulness": 1, "user": "Mark H", "date": "February 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124198789}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Thoroughly enjoyed my 2 night stay at the Madison. Fabulous view of the Mississippi River from the roof. Rooms are ecletic! Will definitely return!", "title": "Wow!", "user": "mymysmema", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125665142}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with family", "text": "This was the hotel that was blocked off for out of town guest. The location was superb, the staff was excellent and the rooms had a great vibe", "title": "DAUGHTERS WEDDING", "user": "derek k", "date": "March 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125651290}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "This place is great for a weekend getaway to Memphis. It's right downtown so you can walk to the Peabody, Rendezvous and Beale Street. They have a great little bar with friendly bartenders, and they made all the right recommendations. Definitely going back...", "title": "Fantastic service, plush rooms", "user": "marcuswhitney", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125564773}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I would have given the Madison a 5 star rating, but for a few little details. First off, let me say that the staff at Madison are top notch! I have never experienced such friendly and helpful people anywhere else, and I travel quite a bit. The hotel is absolutely gorgeous, the rooms are clean, cozy, and well appointed, the bathrooms are large, the hallways and elevators clean (you'd be surprised how many \"nice\" hotels neglect the common areas), the rooftop views are fantastic, the hotel is quiet, you are within walking distance to all the fun stuff, and room service is fairly quick to bring up their scrumptious food.", "title": "Almost Perfect", "user": "SimplyTisha", "date": "February 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125261199}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "All that being said, there were some negatives. We got two room keys, one of which never worked, and the other had to be reactivated several times. Not really a big deal, just an annoyance to have to go back down to the lobby to have it fixed. The free breakfast offered was severely lacking. The fruit was nice, but the bread, namely the muffins, were so dry they had to have been several days beyond edibility. After experiencing their wonderful food through room service, I expected more. The parking fees are outrageous! Thankfully we got a spot at one of the meters out front, and didn't have to worry about parking.", "title": "Madison Hotel - Memphis", "user": "octofire", "date": "February 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 125051969}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "This is a top-class hotel. We booked a King Deluxe room - a bit pricey but actually well worth it, especially after a long-haul flight. Big comfortable bed, spacious seating area, great bathroom. Breakfast is very food - fresh fruit, croissants, toast, various buns, cereals, etc. Friendly, efficient and helpful staff. The bar can be a friendly place, especially in happy hour. The restaurant is also quite good, but not quite excellent. Overall, a top-class experience.", "title": "Top Class", "helpfulness": 1, "user": "salmoneater", "date": "March 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 126280417}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Stayed 3 nights at the Madison Hotel. The facility is an old bank, and gym's walls are made of thick exposed steel and the vault is still present...pretty cool. The lobby is absolutely beautiful. Staff were friendly and everyone makes it a point to greet you when they pass you in the hall or on the elevator. A few minor flaws. When we arrived, we told the bellhop that all of the luggage from the car would be coming into the hotel. He told us to go ahead and he would bring it to the room. But he only brought a few things and still left some pieces of luggage in the car. So we had to go back out and get it ourselves. Also, we were told at check-in that the continental breakfast would be served on the mezzanine...but arrived to find it empty the next morning. After asking at the front desk, we were informed to go to the restaurant. The only issue with this is, it was sit-down service only. We particularly chose a hotel with continental breakfast buffet so we could grab a few things and go back to the room or head out around town. Also, only 3 small draws in the room. Had to leave most things in the suitcase. Small room, but very nice, spaceous bathroom. And the bed was very comfortable! Overall, a good experience. Close enough to walk to Beale Street.", "title": "Friendly staff and clean, modern facility", "helpfulness": 2, "user": "Katie T", "date": "March 16, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126193586}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "The hotel was rennovated 3 months ago. It sits a few blocks of Beale St., but an easy 4 block walk. The hotel was modern, had a great gym, roof top views of the Mississippi River and the entire city, Really delicious breakfast in the AM which incldued fresh granola cereal, fruit, muffins, fresh pastries and fresh squeezed juice (not buffet style, actually served to you). The mattress was very comfortable, nice down covers and sheets. I was upgraded to a king suite just by asking for an upgrade, no strings attached. Sick hotel!", "title": "Highly Recommend", "helpfulness": 1, "user": "JaredBrandon", "date": "March 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 126145264}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The Madison was just what I was needing for this particular 4 night trip to Memphis.", "title": "Comfortable and clean", "user": "shindig7", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125916112}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled with friends", "text": "I was there for an event and I felt comfortable going back to my room each night. That's a big deal to me. The room was clean and staff was great!", "title": "One Great Night in Memphis", "user": "Highwaydude", "date": "March 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125720791}], "location": {"country": "United States", "city": "Memphis"}, "stars": 4, "variance": {"poor": 37, "average": 60, "very good": 163, "terrible": 26, "excellent": 377}, "aka": "Madison Hotel Memphis", "slim_ranking": 0.0222222222222, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "The jazzy spirit of Memphis is brought to life at the Madison Hotel. This boutique luxury hotel dazzles the senses with its striking interiors. Its contemporary style is best defined by its bold use of colors, geometric patterns, and modern furnishings. Sexy yet comfortable, this stylish luxury hotel is the select address for cosmopolitan travelers. It is known as downtown Memphis’ most celebrated luxury venue and the 1st Small Luxury Four Diamond Hotel – The Madison."}