{"user_rating": 3.5, "review_count": 362, "name": "Mahaweli Reach Hotel", "reviews": [{"rating": 5.0, "title": "Must be better hotels", "text": "There is quite a variety in the reviews of this hotel, I suppose it depends on what you were expecting and which hotels you normally stay in. If you are expecting a five star hotel to International standards you are going to be very disappointed.", "user": "RallyMonkey", "date": "September 4, 2010", "id": 78215118}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The over development of the site has ruined the old colonial feel so don't stay here expecting a grand old hotel. On the other hand the rooms are large, there is a decent swimming poor, and it is not at all expensive. If you view this is a reasonably priced local hotel with large rooms and a swimming pool, you may well be satisfied.", "title": "Friendly, comfortable hotel.", "user": "manel54", "date": "August 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 75818285}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The hotel is mainly used by tour groups. So there is a high turnover, and the reception area is in a permanent state of chaos. Management really do not care if individual travellers are happy or not, their relationship is with the tour operator, not many people will stay here twice, so don't expect management to offer a remedy to any problems that you may have. Check out is painful because the charging system is paper based, and you do need to double check your bill.", "title": "Good Property but rooms too old", "user": "KaranKolkata", "date": "August 16, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 2.0, "location": 2.0}, "id": 75412472}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "The restaurant offers a multinational buffet which has to cater for a very wide variety of national tastes. This is a very difficult operation to run, and unfortunately it only succeed in becoming a jack of all trades. Nobody could rate the food highly, but everyone will find something they can eat. If you want to sit outside you need to find the right member of staff ( small man with a colonial style uniform) and tip him. Don't worry, if he thinks you may tip him, he will find you ! You will then get a reserved table outside every time you appear in the restaurant. This is not done with any subtlety and is a little embarrassing, on the other hand the inside is stuffy and depressing and Rs100 will do the trick.", "title": "spectacular views, tired old colonial hotel with some charm", "user": "roya_7", "date": "August 11, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 74832546}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The rooms are large and in need of renovation. The bath room was very small and whilst it had been cleaned, it was not fundamentally clean. There is too much decay and too many cracks to allow it ever to be brought up to International standards of cleanliness.", "title": "reasonable stay here", "user": "JackTheLadva", "date": "August 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 73366547}, {"rating": 2.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The place not to be. I stayed there on the 29th January 2010 and fortunately only for one night. The standards were way below the five star hotel standards and in fact the authorities should downgrade this hotel. Not only that this hotel is of very low standards it is very dangerous too. The door of the closet fell on to my pregnant wife’s head; luckily she was able to hold on to it. In addition is contains unprotected wiring everywhere!", "title": "VERY DANGEROUS PLACE!", "helpfulness": 1, "user": "dinooks", "date": "January 30, 2010", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 3.0, "rooms": 1.0}, "id": 54792109}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "From the entrance it was kind of a disgusting experience. They did not offer us a welcome drink. The room was not prepared. There were ants everywhere including the bed. First of all we had to get the bed linen changed. The ‘tea box’ was full of ants. There was no sugar in it. All the drawers are broken. Either you can’t close it properly or the drawer breaks and comes in to your hand when you open.", "title": "What a great place to stay", "helpfulness": 1, "user": "Thesecrethotelliers", "date": "January 27, 2010", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 54486619, "likes": {"liked": "— The way the room boys did the sheets every morning", "disliked": "— The Sri Lankan food was westernised"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with family", "text": "The rood did not have a Bath Tub but a small shower tray with many tears. There was no shower tap either. The commode seat was broken and it is placed right next to a hub which contains drainage and unsafe wiring with rats and cockroaches running around making noises.", "title": "Excellent Hotel", "helpfulness": 1, "user": "CEYLON_10", "date": "January 21, 2010", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 54024833}, {"rating": 3.0, "title": "Fat bride and wedding party ruined stay", "text": "Only six TV channels were accessible and radio was not working. Piped music? I didn’t hear any music in the room..! The air conditioner was not adjustable and the temperature is set at 26 degrees Celsius. The Radio doesn’t work at all.", "helpfulness": 3, "user": "atme", "date": "January 16, 2010", "id": 53614210}, {"rating": 1.0, "stay_parameters": "Stayed December 2009, traveled with friends", "text": "The rooms were placed just over the polluted river which brings in a very bad smell. This leaves you with no other option but to keep the balcony windows closed. But the funny thing is the management had asked the visitors not to open the windows as monkeys might get in. I didn’t see a single monkey in the area!", "title": "Poor Service, I won't come back, please avoid", "helpfulness": 2, "user": "Rajitha", "date": "December 26, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 3.0, "service": 1.0, "rooms": 4.0}, "id": 51887365}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "Had a brief stay with hubby and grown up children. Rooms were very spacious with beds that were big enough to serve as double-beds. We were accommodated in the new wing, which had balconies at the rear. These balconies were a security risk as someone could jump in from adjoining one, and one could not be too careful in closing the doors to the balcony. Another problem was unexpected company of monkeys. One could occasionally hear firecrackers being exploded to shoo them away. Bathrooms were comfortable though not great. Air-conditioning was not tested as it had rained and weather had become quite cool. Sometimes the door-key would not stick on the magnetic pad with the result the electric supply would not get", "title": "Good facilities... but...", "user": "ku_see", "date": "June 2, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 66183249}, {"rating": 3.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Food was generally mediocre.", "title": "nice location but the rest.................?", "user": "MattvdS", "date": "May 14, 2010", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 64104463}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "The hotel had a path for the riverside and a walk along the Mahaweli river was nice.", "title": "Fabulous", "user": "archiedunlop", "date": "April 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 61643723}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "The bottled water supplied was priced and pricey, with a 500 ml bottle charged at 250 Srilankan rupees.", "title": "lovely hotel", "helpfulness": 1, "user": "jeffandsas2", "date": "April 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 60197156}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "The way to the lift for the new wing was quite circuitous - one could lose one's way.", "title": "Liked...disliked...loved...", "user": "Northernblonde", "date": "February 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 55499436}, {"rating": 1.0, "title": "The WORST hotel I stayed in during my time in Sri Lanka! Definitely NOT 5 Star!", "text": "After arriving from a long trip into Kandy we were given our room keys and went upstairs to our room. The rooms had not been refurbished since the 70's and were a far cry from the 5 stars it suggests it has on its website.", "user": "MadelineSmith", "date": "July 19, 2010", "id": 71571100}, {"rating": 3.0, "title": "Peaceful and clean rooms. OK for only a short visit...horrible massage facility!", "text": "In the very outdated shower door would not even open to enable us to get in and then when we managed to climb up and somehow slide in there the shower did not even work. We called reception to ask them to fix it and they came upstairs and after half an hour they let us know that they would fix it for us the next day. What?!?! We are paying through the nose for what is supposed to be a 5 Star hotel and we can't even shower?!?!", "user": "Asra_Saad", "date": "July 14, 2010", "id": 70868349}, {"rating": 5.0, "title": "Home away from home!", "text": "Already very unhappy we went downstairs to complain and after some discussion we were told they would change our rooms while we had dinner. The restaurant looked terrible (no renovations since the 70s and a dodgy buffet) so we asked them manager to recommend a really nice restaurant for dinner. He asked us if we wanted Chinese and we said NO and then he sent us a half hour drive away for Chinese in the back room of a dodgy hotel!!!! What, how does the manager of a 5 star hotel not know of a nice restaurant in a half hour radius?!", "user": "nanas7dec", "date": "July 2, 2010", "id": 69425039}, {"rating": 4.0, "title": "Clean & peaceful", "text": "When we came back they had not changed our room and we had an argument with them and went upstairs. I was extremely mad at this point and woke up at 6am to leave the hotel (which we were supposed to be staying in for further nights). I had booked two rooms and I let them know that I would be paying for one room but as the other room were not even able to have a shower I did not expect to be paying the full rate. After 45 minutes of arguing and then telling me that it was somehow my fault that they were not able to change my room they advised that they would only be giving me a 10% discount. Then when I went to pay and we had specifically been quoted in Australian dollars they charged me US dollars so we ended up with no discount at all.", "user": "ramerama37", "date": "June 10, 2010", "id": 67067247}, {"rating": 3.0, "title": "Beautiful from the outside... but inside?", "text": "All of this would have been ok if we were staying somewhere cheap and had not been sold 5 star but that was not the case and it left a very bad taste in my mouth.", "user": "katiekins570", "date": "June 4, 2010", "id": 66388962}], "location": {"country": "Sri Lanka", "continent": "Asia"}, "stars": 4, "variance": {"poor": 33, "average": 81, "very good": 119, "terrible": 25, "excellent": 104}, "aka": "Mahaweli Reach Kandy", "slim_ranking": 0.357142857143, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}