{"user_rating": 4.5, "review_count": 26, "name": "Mahoora Tented Safari Camp - Udawalawe", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We booked a 1 night stay with 2 safaris included with Mahoora at Udawalawe. There was a little confusion with finding and meeting our guide, but once we met him we had a wonderful experience. There are so many elephants to see! They come right up close and are amazing to watch. We did not see much wildlife other than the elephants and water buffalo but we knew that this was the case when we booked it and so were happy with what we saw.", "title": "So many elephants!", "user": "lightup", "date": "October 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 3.0}, "id": 180322035}, {"rating": 5.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "Our guide didn't have excellent English but was very friendly and was always able to get his point accross. He was also excellent at spotting different wildlife and birds, and would stop the vehicle suddenly to point out interesting bits and pieces.", "title": "Great Elephant safari experience", "user": "claire g", "date": "October 4, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 179667361}, {"rating": 3.0, "stay_parameters": "Stayed September 2013, traveled as a couple", "text": "We stopped beside a lake for lunch and the scenery was just beautiful. The staff set out a little table and chairs just for us and served us a lovely lunch, it felt really special.", "title": "Expensive but nice", "user": "Ann S", "date": "September 30, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 2.0}, "id": 179181844}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled with friends", "text": "We didn't realise the camp would be so far from the entrance to the park, it is a good 40 minutes drive on rough roads, which was unexpected after a long and tiring day. The camp is a little remote and quiet, with not a lot to see. The tent once we arrived was lovely and comfortable, and had a nice area to sit outside. No hot water, but I didn't really miss it. We were served a nice bbq dinner that night.", "title": "Elephant safari", "helpfulness": 1, "user": "Dawn A", "date": "August 17, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 2.0}, "id": 172605568}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "The next morning we were up early for our second safari and more chances to see the elephants and wildlife of Udawalawe. We stopped mid morning and had a nice little packed breakfast, again taking in the breathtaking views.", "title": "Safari excellence", "user": "Ade2277", "date": "August 14, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 172219863}], "location": {"country": "Sri Lanka", "continent": "Asia"}, "variance": {"poor": 1, "average": 3, "very good": 5, "terrible": 1, "excellent": 16}, "aka": "Mahoora Tented Safari Camp - Udawalawe Sri Lanka/Uda Walawe National Park", "slim_ranking": 0.4, "description": "If it’s the ultimate Udawalawe safari experience you are looking for in the utmost of comfort, Mahoora is the perfect choice for you. Sit back and relax, and allow the Mahoora Team to guide you on the journey of a lifetime you’ll never forget. Udawalawe is the only place in the world where you are guaranteed to see a wild elephant on every game drive. Superb for watching elephant behavior, sometimes at very close quarters."}