{"user_rating": 4.5, "review_count": 97, "name": "Maia Luxury Resort & Spa Seychelles", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed October 2007, traveled as a couple", "text": "To go to Maia, you have already committed to spending a fortune for a luxurious and stunning trip.", "title": "A beautiful resort at outrageous cost", "helpfulness": 7, "user": "LondonJetSetters", "date": "March 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 1.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 26591169}, {"rating": 5.0, "stay_parameters": "Stayed March 2009, traveled as a couple", "text": "That said, your experience at Maia has a great deal to do with how much you would like to spend whilst there. Caesar salad lunch for two (no wine)? 150 euros. Lose your key in the ocean? 300 euros. Bottle of wine? 100+ euros. Total dinner cost? 400ish euros.", "title": "A taste of paradise", "helpfulness": 2, "user": "Bonga65", "date": "March 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 26043265}, {"rating": 1.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "True luxury should make guests feel like a million dollars, rather than reminding them they are paying a million dollars to be there!", "title": "lost all our valuables", "helpfulness": 27, "user": "maryjo04", "date": "December 21, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 22887070, "likes": {"liked": "— lack of security"}}, {"rating": 3.0, "stay_parameters": "Stayed December 2008, traveled as a couple", "text": "That is not to say that the food at the resort is not WONDERFUL. It is absolutely Michellin star quality -- we are still dreaming of our foie gras creme brulee! BUT...the experience would be better on a full board basis --there is nowhere else to go for a meal near the resort (or even not near-- we went into the capital-- the WORST experience ever!), and it is painful to reach for your wallet (at exorbitant prices!) all day long during your holiday. We felt like backpackers wanting to eat a big breakfast and save our pennies for dinner!", "title": "things not said about maia", "helpfulness": 3, "user": "nazay", "date": "December 13, 2008", "detail_rating": {"business": 1.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 2.0}, "id": 22697707, "likes": {"liked": "— rooms", "disliked": "— quiteness"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "Your experience also has a lot to do with the quality of your butler. At the manager's cocktail party, we met a number of other cocktails who had wonderful butlers who highlighted the possibility to have a BBQ in your villa or who arranged for snorkelling gear for them etc... Our butler didn't know how to make scrambled eggs! (and admitted he didnt know how to make them because he didnt like eating them). I think a good butler could make a truly fantastic experience (and wish we had had one-- ours meant well, but he was always napping and when he wasn't was annoyingly overeager without actually providing a useful service).", "title": "We found ourselves again!", "helpfulness": 3, "user": "adafiggy", "date": "November 23, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22112788, "likes": {"liked": "— pure luxury", "disliked": "— there was nothing I disliked"}}, {"rating": 5.0, "title": "Truly exceptional", "text": "My husband and I have just returned from our honeymoon in the Seychelles and Maldives.", "user": "jztravel", "date": "November 19, 2008", "id": 22010687}, {"rating": 5.0, "title": "Maia Resort its the best!", "text": "Throughout our honeymoon, we stayed at 3 other resorts in a similar price range and believe that Maia was truly a step above the rest. Every aspect of the resort was so tasteful - from the decor and design, to the attentive yet unobtrusive service, to the true feeling that you are the only guest there (and that when you do see other guests - e.g. at the restaurant) you still feel like you are given undivided attention.", "user": "elliep32", "date": "October 3, 2008", "id": 20582883}, {"rating": 5.0, "title": "Maia best there is", "text": "We were also extremely impressed by the food - especially considering that this is a 30-villa resort. The quality and presentation of the food rivalled any top-tier restaurant in the world's major cities we have been to. Impressive also given that most ingredients have to be flown in from elsewhere.", "user": "simon044", "date": "July 17, 2008", "id": 17976496}, {"rating": 4.0, "title": "Six nights at the palace of excess", "text": "If you want true luxury and privacy in a mind-blowing beautiful setting, you will love Maia. I cannot think of a more magical setting for a romantic getaway...", "user": "Sevenabroad", "date": "June 1, 2008", "id": 16571593}, {"rating": 5.0, "title": "Best Hotel in Mahe!", "text": "We stayed at this oustanding resort for 4 nights and it wasn't long enough. We couldn't get into the Banyan Tree as we booked last minute but our travel agent told us that the Maia Resort was the best there was and she was right. The only advice we wish we would have taken from her was to stay there second and not first as our second hotel Lemuria even though it was lovely couldn't compare to our little peice of heaven at Maia.", "user": "jilljohnston", "date": "April 10, 2008", "id": 14949713}, {"rating": 4.0, "title": "Your home in paradise", "text": "Just came back from a 5 days stay at Maia. The place is worth of a postal card. The villas are superb and the butlers will make you feel at home. Just as an example, our butler, Surya, went the extra mile for us by letting us use his personal underwater camera in our diving. Always available and with many details to make our stay even better.", "user": "sptravelermadrid", "date": "December 9, 2007", "id": 11400411}, {"rating": 5.0, "title": "Honeymoon Luxury - but still room for improvement", "text": "Flight:", "user": "HardtooPlease", "date": "July 25, 2007", "id": 8235309}, {"rating": 5.0, "title": "Absolutely fantastic", "text": "We flew Air Seychelles in business. Not good. Looks like (and probably is) the business class of British Airways from 15 years ago. Seats would only recline about 45 degrees and flight entertainment was poor.", "user": "LoveTravelling151", "date": "May 8, 2007", "id": 7564633}, {"rating": 5.0, "title": "Outstanding!", "text": "The place:", "user": "dgerm", "date": "February 11, 2007", "id": 6778540}, {"rating": 5.0, "title": "Maia - the best on Mahe Island", "text": "Inmaculate beach and surroundings. Occupancy was just above 50% and we saw very few people at the beach or the main pool. Something we really liked. Sea was rough at times since the beach doesn't have any natural protection.", "user": "ACPACPACP", "date": "November 26, 2006", "id": 6175582}, {"rating": 5.0, "title": "The new place to stay in the Seychelles", "text": "I recently experienced this new hotel. Waouaw...is it a hotel ? your private villa ? your residence ? It is a mix of everything. The villas are simply outstanding, all details are perfect from the armchair set in the private pool to the \"La Prairie\" amenities in the open bathroom, to the welcome champagne. It's perfect, a \"must do and stay\". For sure the butler is at your disposal.", "user": "75000", "date": "October 28, 2006", "id": 6021038}, {"rating": 5.0, "title": "Bautiful location", "text": "The villas are overlooking the bay and you enjoy a scenic view, probably the best in Mahé. It's a pity that you have not to much intimacy as you do see the other villas ( I do remember the stay in Nha Trang at the Hideaway where you are completely secluded)", "user": "DRKR", "date": "October 2, 2006", "id": 5898968}], "location": {"country": "Seychelles", "continent": "Africa", "city": "Anse Louis"}, "stars": 5, "variance": {"poor": 3, "average": 9, "very good": 7, "terrible": 3, "excellent": 75}, "aka": "Maia Luxury Hotel Anse Louis", "slim_ranking": 1.0, "description": "Maia is more than a sanctuary, more than an escape and much, much more than a hotel. It is a place of physical, mental and spiritual awakening, a place of rediscovery."}