{"user_rating": 4.0, "review_count": 252, "name": "Maison Fleurie - A Four Sisters Inn", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "Contrary to some of the recent negative reviews of Maison Fleurie, my wife and I had a wonderful stay for three nights (mid-April 2007). The location is perfect--access to the entire Napa valley, wonderful restaurants within walking distance, all within a charming little village (Yountville). The breakfasts were hearty--eggs and potatoes as well as cereals, breads, coffee. Wine and cheese in the afternoon was great and there is a second floor outdoor patio on which you can enjoy the afternoon treats. Coffee and cookies are available in the evening, as well as chilled soft drinks all day long. The newspaper is delivered to your door each morning. Maison Fleurie is a beautiful 3-building inn with flowers and vines growing all over the property. The hot-tub is nice too. They also have bikes you can borrow and we very much enjoyed leisurely rides on country roads flanked by vineyards. We highly recommend Room 13 in the Carriage House. In sum, Maison Fleurie is the perfect place to enjoy the Napa Valley!", "title": "A Piece of Paradise", "helpfulness": 4, "user": "NCMitchyMitch", "date": "April 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7331115, "likes": {"liked": "— Beautiful Setting, Thoughtful extra touches"}}, {"rating": 5.0, "title": "A wonderful place to stay in Yountville", "text": "FYI--we really enjoyed the following wineries: Artesa (for the views and cool fountains), The Hess Collection (for the art and tour), Clos Pegase (for the tour, art and caves) and Sterling (for the tram ride, views and informative tour).", "user": "eatyourheartout", "date": "April 10, 2007", "id": 7308168}, {"rating": 1.0, "title": "Terrible linens and dirty rooms", "text": "Also, Mustards Grill is great for dinner and the Oakville Grocery has incredible sandwiches!", "helpfulness": 5, "user": "collinsclanny", "date": "April 4, 2007", "id": 7281260}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed here while on honeymoon in April 2005. We were dining at the French Laundry and needed somewhere to stay for the night.", "title": "A Slice of Heaven", "helpfulness": 1, "user": "lbgirl", "date": "April 2, 2007", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 7271212, "likes": {"liked": "— Room, breakfast, staff"}}, {"rating": 3.0, "title": "Okay, but a bit pricey", "text": "Our room had its own front door off the swimming pool/hot tub and was very spacious. The bed was very comfortable and the staff was very pleasant. Another nice touch was the wine reception each evening by the fire.", "helpfulness": 4, "user": "SoCalGal55", "date": "March 21, 2007", "id": 7198984}, {"rating": 5.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "Several months ago, I selected Maison Fleurie for our stay in Napa wine country based on the numerous positive reviews on Trip Advisor as well as the recommendation in Karen Brown's travel book for California Inns and B&Bs. Needless to say, I was somewhat concerned about the recent negative reviews posted on Maison Fleurie.", "title": "A Charming Inn", "helpfulness": 3, "user": "Get out of Dodge", "date": "November 9, 2006", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6093135, "likes": {"liked": "— Charm, charm, charm!", "disliked": "— No vinyard across the street anymore!"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2006, traveled as a couple", "text": "Happily, I can report that we found the property to be charming and everything I had expected. The staff offered much help in making reservations for restaurants and winery tours. Plus, all those little extra efforts, like asking if we needed an umbrella for the day.", "title": "Beautiful stay", "helpfulness": 1, "user": "winelover15", "date": "October 19, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 3.0, "value": 3.0, "rooms": 3.0, "location": 5.0}, "id": 5972708, "likes": {"liked": "— friendly, knowledgable staff", "disliked": "— bathroom"}}, {"rating": 2.0, "title": "Just OK", "text": "We stayed in a cozy queen, #2, on the second floor and it had a stone and a brick wall on two sides. All the others rooms on the second floor were similarly charming and well-decorated. Our room was small but plenty big for the two of us and all our \"stuff.\" It had everything we needed, and items were thoughtfully placed in just the right spot. Our towels appeared new and were quite nice. The soaps and shampoo were wonderful. Yes, we could hear a few muffled voices at night, and floor that creaked some overhead. But to us, this is part of the charm of staying in an old country inn.", "helpfulness": 13, "user": "ktbeighley", "date": "October 4, 2006", "id": 5909597}, {"rating": 1.0, "stay_parameters": "Stayed September 2006, traveled with family", "text": "The breakfast is good with cereals, granola, big bowl of cut-up fresh fruit, breads, English muffins, and two hot dishes that varied each day. They were quite tasty! The afternoon wine and cheese offering was also excellent (fresh veggies, crackers, excellent cheeses, and a tea cake) and one day a representative of one of the wineries was there to do a wine tasting.", "title": "Keep driving", "helpfulness": 6, "user": "outoford", "date": "September 5, 2006", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 2.0}, "id": 5772934, "likes": {"liked": "— the location and the exterior of the building", "disliked": "— It was dirty and run-down, way overpriced"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled as a couple", "text": "My husband and I are world travelers and I always look for places in a good location that are clean, have charm,and offer value. Maison Fluerie certainly fits the bill, and offers even greater value that I had expected. In additon, we booked early and were able to snag a \"Isn't It Romantic\" package that made the stay an even better \"deal.\"", "title": "Wonderful stay", "helpfulness": 5, "user": "ldsgirl519", "date": "August 3, 2006", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 5546706}, {"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "I normally don't add to these reviews unless I see a glaring problem.", "title": "Beware: overrated and in need of cleaning", "helpfulness": 1, "user": "GooseB", "date": "July 18, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "location": 4.0}, "id": 8183714, "likes": {"liked": "— the self serve drinks", "disliked": "— romo quality and staff"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "My husband and I attempted to stay at M.F. about a year ago. Check in was fine, the place looked cute, and the self-service soda/drinks was a nice touch. The decor looks much nicer on the website and when we arrived the place was a little cluttered and worn looking. When we walked into our room I was very disappointed. It was dark, the carpeting had numerous stains on it, the bathroom needed some serious cleaning and updating, and the \"white\" sheer curtains were in desperate need of washing --they were gray. Add to this, the room smelled very strongly of deodorizer. Both of us have allergies / asthma. Within minutes, my husband was wheezing --there was no way we could have spent the night in that room. We brought this to the attention of the front desk who firmly informed us that we should have notified them in advance not to use any sprays in the room. (I've never heard of any such thing). After some discussion, we were given a portion of our $ back, less than half of the cost of the reservation. After the last two \"amazing\" reviews, I finally had to speak up. Beware if you have asthma or allergies and if you want a clean room. Basically, our visit to MF was the most money we've ever paid for a diet coke.", "title": "LOVED it!", "user": "lovetocamp3", "date": "July 8, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 8079532, "likes": {"liked": "— Very \"homey\" feel.", "disliked": "— Nothing!"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This was the coolest place I have ever stayed! The staff was awesome, especially considering they were able to check us in really early when we arrived. We came off 4 days of camping in Sequoia and Yosemite, and this place was fabulous. It was perfectly adorable. They also had great restaurant recommendations. Their wine selection for their evening wine and appetizer reception could have been better, but that was still great! We were even able to check out bikes and ride through a wonderful 6 mile trail through beautiful vineyards that the staff recommended. I was a little leery of the breakfast on first glance in the morning since it was buffet-style, but the food was fabulous! Everything here was great, and I really can't wait to visit it again! It's a perfect getaway for any couple for any amount of time. We were there for one night, but I could have easily stayed for a week! It made our wine country trip well worth it.", "title": "Very nice retreat in the Napa Valley", "user": "Traveler5548", "date": "July 7, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 8074100, "likes": {"liked": "— A beautiful Inn"}}, {"rating": 5.0, "stay_parameters": "Stayed May 2007, traveled as a couple", "text": "Lovely Inn in the heart of Napa Valley. We found the staff helpful, our room was clean and the common areas lovely. The afternoon wine reception was very good and the morning breakfast well above average. Masion Fleurie is a delightful place to stay. My rating is based upon staying in one of the cosier rooms ($173 inc taxes). I am not sure I would have the same perspective if we were in the pricier rooms. The Inn is very nice and in a great location, but not outstanding", "title": "Perfect B&B", "user": "napalover2", "date": "May 11, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 7587774, "likes": {"liked": "— All the conveniences"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "Maison Fleurie is what a B&B should be. We were a little worried after reading some reviews here but our stay was perfect. We stayed in room #8 which was clean, large and very quiet. Hot tub and pool area were beautiful, lined with flowers and private. They thought of everything--wine and cheese in the afternoon, bikes for a ride in the morning, newspaper every morning, towels by the pool and a wonderful breakfast with best oatmeal my husband ever tasted. Obviously lots of care goes into maintaining a property like this which has old world charm with modern ammenities. Staff was friendly and helpful. We will definitely return!", "title": "Wanted to love it, but...", "helpfulness": 2, "user": "bigredbike", "date": "May 1, 2007", "detail_rating": {"front_desk": 3.0, "service": 3.0, "cleanliness": 2.0, "value": 2.0, "rooms": 2.0, "location": 3.0}, "id": 7492138, "likes": {"liked": "— Location", "disliked": "— Dirty and dated"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2006, traveled as a couple", "text": "We visited Yountville primarily for the food, so we weren't looking for an over-the-top hotel. Maison Fleurie fit the bill, promising comfortable accommodations at a reasonable price.", "title": "Fair value, they deliver on their promises", "helpfulness": 1, "user": "tmentzer", "date": "February 26, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 3.0, "location": 4.0}, "id": 6843150, "likes": {"liked": "— Location, friendly staff, comfortable", "disliked": "— Sketchy AC, small (as advertised)"}}, {"rating": 5.0, "title": "Great Stay", "text": "The staff is first-rate, young but very friendly. Couldn't ask for more. The complimentary breakfasts were nice, nothing spectacular but a nice bite before a day of touring. Beverages were available all day.", "helpfulness": 3, "user": "tahoejones", "date": "February 13, 2007", "id": 6787504}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "The room itself was small but pleasant, as advertised. They make no claims of spaciousness. The AC wasn't very effective, and the second floor room got a bit toasty, but not too uncomfortable. The bed takes up most of the space, with a Euro-style sink in the room.", "title": "Great place with nice touches", "helpfulness": 1, "user": "IanStevens", "date": "January 31, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 6720089, "likes": {"liked": "— the add-on services", "disliked": "— nothing"}}, {"rating": 2.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "If you're looking to spend a lot of time in your room, this isn't the best choice. But if you're looking for a comfortable hotel that delivers what it promises, is close to some of the best food Napa has to offer and in the middle of some beautiful scenery, this is a great choice.", "title": "Needs attention", "helpfulness": 3, "user": "pbirdwalter", "date": "January 28, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 2.0}, "id": 6711326, "likes": {"liked": "— Location", "disliked": "— Room"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2006, traveled as a couple", "text": "I was a little thrown by some of the reviews I read of this B&B but I was pleasantly surprised. The staff was friendly and the place was reallly cozy. We were offered a glass of wine upon our early check-in and waited on the couch by the fireplace while our room was being prepared.", "title": "Enjoyed Maison Fleurie", "helpfulness": 7, "user": "vacationMN", "date": "November 21, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6162876, "likes": {"liked": "— Location", "disliked": "— Bed"}}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 15, "average": 24, "very good": 82, "terrible": 7, "excellent": 124}, "aka": "Maison Fleurie - a Four Sisters Hotel", "slim_ranking": 0.428571428571, "description": "Napa Valley's Maison Fleurie, the \"flowering house,\" is situated on half an acre of beautifully landscaped gardens -- welcoming visitors to a Napa Valley inn reminiscent of southern France. Finely crafted furniture, rich fabrics, and a huge stone fireplace lend their ambiance to this historic main building, where a bountiful breakfast and afternoon wine and hors d'oeuvres are served Four Sisters Inn blends modern luxuries and services of a boutique hotel with the traditional amenities of a B & B."}