{"user_rating": 4.5, "review_count": 358, "name": "Maison Souvannaphoum Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled with friends", "text": "We stayed here after weeks of travel and mainly guesthouuse stays. It was a great treat! We booked through the hotel website and immediately received a response. We arranged for airport pickup and were greeted by a staff member and given hot towels on the ride to the hotel. Once we arrived we were given a delicious ginger tea while we waited for our room. We also took in some spa services. The staff and service at this hotel were by far the best I have ever experienced. The room and the hotel itself were stunning and conveniently located to the night market and many temples. I would definitely stay again!", "title": "Stunning!", "helpfulness": 9, "user": "lmcgreg", "date": "August 7, 2006", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 5573771, "likes": {"liked": "— Service and Ambience", "disliked": "— Internet access was not free"}}, {"rating": 5.0, "stay_parameters": "Stayed July 2006, traveled solo", "text": "This is a great local hotel in a restored property. I stayed in the low season and got a good rate and was upgraded to the Maison Suite which is huge. The staff are very frindly, professional and always on top of things. The breakfast buffet was excellent and included seasonal mushrooms which are a real local delicacy in summer. The grounds are neat and well groomed and all in all I would highly recommend this hotel. It is a ten minute walk from the action or a short tuk-tuk ride. My only complaint is that the air conditioner was too loud. In this day and age of highly efficient machines, it shouldn't be loud. That said, I would strongly recommend this hotel in the off season because of the great value. In high season when prices are also high, you should do your homework and check out other hotels as well. The biggest plus to this hotel is that it is a well-run, smallish, non chain-like hotel in the European tradition. Don't go expecting a five star chain and you won't be disappointed. I would give it a solid four stars.", "title": "Great Hotel", "helpfulness": 8, "user": "Abbyx007", "date": "August 4, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 5555396, "likes": {"liked": "— Food and staff professionalism.", "disliked": "— Loud air conditioner."}}, {"rating": 4.0, "title": "Great Service!", "text": "The Maison is a really wonderful property! We stayed at Settha Palace in Vientiane before moving here and would like to comment on the service. The reception staff are the most wonderful and genuine that we have met in our travels. They were really concerned about our well-being and were able to strike rapport with the guests. They really made a difference.", "helpfulness": 7, "user": "badashanren", "date": "July 22, 2006", "id": 5496391}, {"rating": 5.0, "stay_parameters": "Stayed June 2006", "text": "The room was very comfortable with a veranda. However, there isn't a bathtub, except in the suites. For such a wonderful hotel, it is really a great bargain (only $60 during the low season)!", "title": "A relaxing and nostalgic weekend break by the Mekong.", "helpfulness": 14, "user": "cosmicelk", "date": "June 29, 2006", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "service": 5.0}, "id": 5407386}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "We stayed at the hotel on the advice of our travel agency (Remote Lands) and were so glad we did. The room was well appointed and had an incredibly comfortable bed with a sitting area and a large bathroom. We toured all day and, visiting temples and driving into the hills to visit the hill tribes, and given the heat, we really appreciated having such a nice place to come back to.", "title": "A real oasis", "helpfulness": 5, "user": "NYC244", "date": "April 29, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7480643, "likes": {"liked": "— the contrast with relatively poor surroundings", "disliked": "— spa was somewhat noisy"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "The pool was small but refreshing, and the bartender was very competent in mixing cocktails to transition from day into evening. We had breakfast there each day and dinner one night. My wife swears the curry she had was the best in her life.", "title": "Lovely, Lovely, Lovely!", "helpfulness": 1, "user": "Sassypants01", "date": "April 6, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 7286789, "likes": {"liked": "— Lovely grounds & impeccable service", "disliked": "— NOTHING"}}, {"rating": 4.0, "stay_parameters": "Stayed March 2007, traveled with friends", "text": "I noted some of the other reviews called service in to question but we found the entire saff extremely helpful.", "title": "Great Lao hospitality!", "user": "aromas", "date": "March 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 4.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7193335, "likes": {"liked": "— Hotel provided us with bicycles which we used early in the morning - great views!", "disliked": "— The graden should be more lush"}}, {"rating": 2.0, "stay_parameters": "Stayed December 2006, traveled as a couple", "text": "The location was also very good. It sits at one end of the 'town center' and is relatively quiet compared to some of the other places nearer the stores and temple. One day we woke up early to see the monks collecting food and funds (about 6 am) and found that their turnaround point was just 50 yards from the hotel. It only took a few minutes to buy some food for them, get to the line, and join in the proceeding by donating. Some locals showed us how it's done.", "title": "overpriced and disappointing", "helpfulness": 11, "user": "boscobaby", "date": "February 10, 2007", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 4.0, "cleanliness": 2.0, "value": 2.0, "location": 4.0, "rooms": 2.0}, "id": 6777523, "likes": {"liked": "— friendly staff", "disliked": "— the accomodations and their cost"}}, {"rating": 1.0, "stay_parameters": "Stayed March 2007, traveled with family", "text": "We stayed at the Souvannaphoum in late Feb/early March 07. Our room (ground floor, next to fence) was broken into whilst we were asleep. The hotel has no CCTV and what purports to be 24 hour security proved useless. The next day the hotel management called the police who took our passports and subjected us to a rather unpleasant interrogation. We were effectively forced to retract our statements and pay a US$100 bribe to the police officer to get our passports back and just about catch our return flights to Bangkok.", "title": "Very grave security and guest relations concerns - disappointing standards", "helpfulness": 13, "user": "CM002", "date": "June 16, 2007", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "location": 2.0}, "id": 7857956}, {"rating": 2.0, "stay_parameters": "Stayed May 2007, traveled with friends", "text": "The hotel manager assured us at our departure that the hotel's insurance would cover us for the stolen items. Subsequently, he failed to live up to his word and refused compensation. Lengthy email exchanges with Banyan Hotels also proved fruitless, all we were offered was 4 free nights in some remote Chinese hotel.", "title": "location and service was good but.........", "helpfulness": 8, "user": "maxlie", "date": "June 10, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 1.0, "value": 2.0, "rooms": 1.0, "location": 4.0}, "id": 7828766, "likes": {"liked": "— breakfast was tasty, wide range of choices", "disliked": "— cleanliness and bathroom design"}}, {"rating": 3.0, "stay_parameters": "Stayed April 2007, traveled as a couple", "text": "To summarise, we are still in disbelief at the appalling treatment we received from the local hotel manager and Banyan Tree head office. We chose a Banyan Tree hotel for the chain's high standards in looking after guests and to provide a safe comfortable stay - we were left entirely disappointed.", "title": "Disappointing", "helpfulness": 7, "user": "traveller11London", "date": "June 5, 2007", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 3.0, "cleanliness": 3.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 7771265}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "We were somewhat disconcerted to read through the hotel reviews again and come across a February 07 review which noted that \"you need to be suspicious of any hotel that makes you sign a waiver of liability\" upon check-in. We cannot stress this point enough following our bitter experience.", "title": "great staff, nice hotel", "helpfulness": 3, "user": "TokyoDroid", "date": "May 31, 2007", "detail_rating": {"front_desk": 5.0, "business": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 7723846, "likes": {"liked": "— The Staff", "disliked": "— The Shower"}}, {"rating": 5.0, "title": "Charming as expected", "text": "The Souvannaphoum hotel itself is nice enough, but not especially luxurious. You will be disappointed if you expect usual Banyan Tree standards. Apart from the hotel's questionable security, we would mention the overall standard of the accommodation, particularly our rather small substandard bathroom, with some weird plastic and natural stone design which was covered in mould. Overall, this wasn't great value for money.", "helpfulness": 5, "user": "drjeff", "date": "May 19, 2007", "id": 7645532}], "location": {"country": "Laos", "continent": "Asia"}, "stars": 4, "variance": {"poor": 10, "average": 25, "very good": 92, "terrible": 7, "excellent": 224}, "aka": "Maison Souvannaphoum Luang Prabang", "slim_ranking": 0.138461538462, "description": "Maison Souvannaphoum Hotel by Angsana is a boutique luxury hotel in the heart of Luang Prabang, Laos. It's the perfect retreat for the modern traveller seeking style and authenticity. Once the residence of the late Prince Souvanna Phouma, the mansion is an elegant blend of French colonial architecture and Lao motifs with the addition of all the modern comforts. The hotel is an 8-minute walk to the town centre - close the sights, night market, restaurants, bars and river, but away from the bustle and noise. Cool off in the pool, enjoy a drink in the garden, or unwind at the Angsana Spa after a long day of sightseeing. Our attentive staff are always on hand to meet your every need with warm, personalized service. The rooms and grounds are designed to be your home away from home. Maison Souvannaphoum is your private oasis."}