{"user_rating": 4.5, "review_count": 8110, "name": "Majestic Elegance Punta Cana", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We just got back from our week long trip in paradise. This resort was fabulous! Although our flight was delayed more than six hours (so it was 2 a.m. when we got there), the staff was there waiting to accommodate us. The Elegance Club staff was especially fabulous. Thank you to Melody who helped us upgrade our room. We definitely recommend the swim-up rooms. Our Butler, Santiago, was always there to help us with whatever we needed. Our room was always clean, thanks to the staff. While enjoying the outdoor festivites, Maxima, Felix, Rosa and Emmanuel was always there to make sure we were enjoying our vacation. The Entertainment crew was also well...very entertaining. A special thank you to Black Panther for helping us with our Spanish lessons. Our trip would not have been made more memorable without Belkis who did an OUTSTANDING job with our photos. We definitely recommend getting pictures taken while you are there. Even though we just got back from our trip, we cannot wait to plan another vacation at the Majestic Elegance. Thank you to all the staff for making our stay so wonderful and memorable. We not only enjoyed making new memories, we enjoyed making new friendships with other couples at the resort and the staff.", "title": "AMAZING!!", "helpfulness": 2, "user": "Amy M", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166560946}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "The rooms are perfect,relaxing,nice,neat,organized and we loved the hot tubs there are so relaxing to stay there the whole day. the bed matress is so comterble to sleep in. we loved the hotel we are sure going next year again.", "title": "Perfect and the most wonderful hotel ever in my life", "user": "Samantha F", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166551573}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "We just got back from our week in Punta Cana and my wife and I had a blast. The staff there makes the experience that much better! We have stayed at resorts and all inclusives in the past but The Majestic Elegance Club experience tops them all for a fun filled week with plenty of activities and great atmosphere. The beach was clean and well kept , the rooms were 4 star with all the things that you would want. The best part of the experience for us was the Animation Team. These guys were full of energy, great attitudes, and smiles all around. Mosquito, 50 Cent, Black Panther, Coffee Girl, Darihana, BlackyMC, Pita, and Chocolate girl were our adopted friends and made the Olympics, Bikini Contest, and all other activities fun and kept us involved. Not to mention one of the best 4th of July Parties we've ever been to!!", "title": "The Staff Makes it happen!!", "user": "The_Murphys_GA", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 166551307}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "What an AWESOME experience enjoyed at the Majestic Elegance Resort!", "title": "*Spectacular vacation*", "helpfulness": 1, "user": "ESmith91", "date": "July 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166546372}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "I arrived on April 16th and stayed until the 23rd for my sister’s wedding.", "title": "Epic Family Vacation", "helpfulness": 2, "user": "Buzzyblues", "date": "July 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166455235}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "BACKGROUND:", "title": "Good Value in Punta Cana", "helpfulness": 3, "user": "Farmerica", "date": "June 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 68773695}, {"rating": 5.0, "stay_parameters": "Stayed June 2010", "text": "I am a married father of two children (ages 8 and 5). With my wife, the kids, in-laws (wife's parents) and a family friend, we travelled to Punta Cana the week of June 19-26. This was our third trip to the Dominican and second time for the children. Two years ago we stayed at the Majestic Colonial which is Majestic Elegance's newer sister property. There is not much difference between the two properties in design and layout, and we primarily chose the Elegance because it offered one-bedroom suites which the Colonial does not. ( We wanted the kids to have their own space for playing indoors in the evenings) We booked our travel through Costco Travel which we have used before. The all-inclusive package, thru Costco, includes an automatic upgrade and gift vouchers for one excursion and one spa treatment ( which the ladies were excited about)", "title": "We had a fantastic time!!!!!!", "user": "sciencegrl08", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68769769}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "ARRIVAL and CHECK IN:", "title": "Best 40th Wedding Anniversary - and with the same bride!!!", "helpfulness": 1, "user": "buho66", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68765428}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We arrived around 4pm Saturday, unfortunately without luggage due to the lameness of Delta Airlines. Our suite was ready and was ground floor poolside. However, the side of the pool they put us on faced the pool bar which was not desirable to us because, as we knew from previous times, the area gets loud and rowdy mid-afternoon as the resort activity hosts engage people in pool games and dancing contests. In fact, a few days into our stay, my daughters witnessed a small fist fight between some of the meathead male partyers who were playing adult dodge ball. The available upgrade they offered was on the adults only club side and we could not take it because we were with the children. Regarding the rowdy pool bar location, the staff was very apologetic and understanding and even told the pool activity team to tone down the games that impacted our side of the pool grounds. My in-laws and our friend were upgraded to the Elegance Club, but again, the children factor made that upgrade impratical and counter to our purpose of the kids and grandparents spending time together. They were moved to rooms on our side, one facing the pool, one facing the garden, and we adults were all given access to the Elegance club which included private beach, pool, internet lounge and beach bars, so we took turns using those perks. They also had nicer towels.", "title": "Amazing", "user": "roe237", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68747503}, {"rating": 3.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "ROOM, GROUNDS, STAFF", "title": "Not unforgettable, not terrible either.", "helpfulness": 3, "user": "ChinaWallnuts", "date": "June 26, 2010", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 68732670}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We recently returned from a 3 week stay at the ME Club Feb.2-23 and this year was even better than last year. Again the food selection was great, there is something for everyone’s pallet. Some improvements have been made since last year and all for the better. Plenty of beach chairs and palapa’s for everyone and never felt crowded even though the resort was at full capacity. We want to thank EVERYONE at the ME for making our vacation just perfect. A special thanks to Jose who was our great butler last year and now promoted to Capitano Bell Boy, Congratulations Jose, we are so proud of you and know that you will go far. Christopher our charming butler this year, you were amazing from the day we arrived to the day we left, always checking up on us and finding us on the beach and attending to our needs, Christopher, you also will go far and always keep that great smile. Felix, Maxima, Eva, Rose and Kelly at the Elegance Bar, you are all so amazing and cheerful and taking care of everyone, certainly a big asset to ME. Emanuelle the towel man at the Club always with a smile and graciously ready to please, you also my friend will go far at the ME. Roberto at the Lobby Bar always charming and made great drinks. Laura the maid that cleaned our room always to perfection and never a problem with towels. Altagracia at Flavors always greeting you with a beautiful smile. Virginia the Executive Chef and her assistants, great job on the food selections and presentations, again just tastefully done. The Management Team, Jose Maria Castillo, Jordi and Argenis, they are in every corner and always making sure that everything is done to perfection, well done once again and keep up the good work.", "title": "SECOND TIME A CHARM !!", "user": "VNMN_12", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153896514}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "We can go on about how great this resort is but it is something that you must experience, you will never find perfection, not even at home but this resort goes over and beyond to make your stay perfect and by judging all the repeats, you know they are doing something right.", "title": "ME Keeps Getting Better!", "helpfulness": 17, "user": "NBJenny", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153879477}, {"rating": 3.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Again Thank You ME and looking forward to returning once again.", "title": "Something is Missing!", "helpfulness": 3, "user": "barbara j", "date": "March 6, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 153863402}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Val & Maria", "title": "Our Best Resort of 3 in Punta Cana", "helpfulness": 8, "user": "joeymanko", "date": "March 5, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153822033}, {"rating": 4.0, "title": "Amazing beach. Clean. Friendly. Great suites.", "text": "To us, the Majestic Elegance is not just a resort- it’s our home in Punta Cana. The staff are not merely resort workers, they are family. After our third stay at the Majestic Elegance I can honestly say, it just keeps getting better!", "helpfulness": 1, "user": "kirstynmj", "date": "March 5, 2013", "id": 153816027}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Everyone in the funjestic team is friendly and and great entertainers.....hilarious!!!! Jackson is insanely talented,yonny bravo is hilarious,coffee girl is an amazing dancer, and tupac was a great entertainer and funny to listen to....overall an amazing staff", "title": "Great staff", "user": "dannydjp12", "date": "May 30, 2012", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 130924220}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "This was our first trip to the Dominican Republic, & we loved almost everything. The resort was fabulous & scenic, with many pools, restaurants, lounges, bars & the ocean right there. We had champagne waiting for us in the rooms on arrival, & a fully stocked frig with soda, water & various good-quality liquors. We did the Elegance Club, which is adults-only pools, lounges & bars, with other perks that make it well worth the price. The only part I really didn't like was that the description stated we would have a butler. Never having had one, I thought this sounded extra luxurious. There was no butler - we did have a man who introduced himself as our butler, & I liked him, but he didn't come on duty until 3 pm, & we only saw him 2 or 3 times in the 4 days that we were there. He did make dinner reservations twice for us, & ordered us a taxi for when we left, but that was it. We tipped him well, but he was definitely not a butler in any sense of the word. We loved the 70's/80's show with the disco dancers. The casino was small but fun. We loved the Gourmet & the japanese restaurants, but were unimpressed with the steakhouse & the buffet. All in all, we would return here. Maybe not in May - it was REALLY humid - so might return in Jan - Apr.", "title": "Great value, a few flaws, would still return", "helpfulness": 1, "user": "RachGo", "date": "May 29, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130894784}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with friends", "text": "I would like to share my thoughts on the Majestic Elegance in Punta Cana. First off from the reviews I have read on here it seems you either have a great time or you do not like the place at all. For the one who do nlike the place at all I would bet you complain at everything and shpuld probably just stay home. We visited the resort on April 19 through April 29th. We stayed in the Elegance adult section and had a gerat week. Firts of all I would like to say Carlos our Butler was there for us in anything we wanted or needed. He was able to move us to rooms adjacent to the beach so we had a beautiful view each morning. Maximua and Felix were bartenders close to our room. They were surpurb, not only did they make great drinks but thgey remembered us and made what we wanted as we approached the bar. The food on the resort was very good also the varitey was sufficent for all tastes. I espically liked the steak house but the French and Sushi resteraunts were good also. The rooms themselves were clean, everything worked in them and they were cleaned promptly each day. I would highly recommend this resort. we cannot wait for our next vist there as we are definitely going back.", "title": "Relaxing and Fun", "helpfulness": 1, "user": "jtnl01", "date": "May 29, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130850944}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "This was my family's first time to Punta Cana. We had a fabulous time. The hotel is absolutely gorgeous. The staff was extremely friendly and greeted us each day with smiling faces. Omar greeted us at check-in with smile and was kind to us the whole week. Our bell boy, Elvis Espinal gave us a great tour of the place and greeted us everyday with a \"how are you\" and \"what are you doing today.\" He showed a genuine concern for our well being. The food was great. Flavours and 9 Doors (Japanese) were our favorite places. Flavours treated us like royalty while we were there. The white table cloths, stemware and wait staff made this buffet feel like a 5 star restaurant. The staff was very attentive to every empty beverage glass, empty plates and any request. 9 Doors was a fun restaurant with great entertainment by the chefs.", "title": "First Time To Punta Cana", "helpfulness": 1, "user": "8706Austex", "date": "May 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130849464}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "We will definitely return to this island paradise!!!", "title": "Alex in the Gym and Funjestic Team Excellente!", "helpfulness": 9, "user": "Darla W", "date": "May 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130824995}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "My trip was from 6/29/13 through 07/06/13 we were 4 adults and 2 kids 3 yrs and 10 yrs. There are so many positive things to say about this hotel and the staff that i don't even know how to start; food is excellent i did not get to try the french one but the buffet, the Asadito and the one on the sea was outstanding. this is our second time going and definitely we will be returning. At the pool bar there was Cesar Castillo Castillo, what a great service we got from him so nice so kind so perfect just perfect we love you Cesar and also Miguel, and how can i forget the great shows and tournaments with Chocolate, coffee girl and media Libra lol half a pound in Spanish and mosquito, 50 cent black panther and everyone there was excellent.... love u guys i miss you guys already. Going to work hard for next year.", "title": "The best Resort and Service in Punta Cana", "helpfulness": 1, "user": "yayi0318", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166672531}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "This was our second time around at the Majestic. We have found this resort easy to maneuver around. Williams,Henry and Dariza were some of the friendliest bar tenders you can find them at the beach bar. As were all the servers.", "title": "Great times", "user": "Liz S", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166657020}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "If you are a late riser in the morning the breakfast at the beach is served until 11:30-12:00. You can dress for the beach, have breakfast, lunch and snacks. Ladies need a cover up and guys need a shirt.", "title": "Majestic Elegance...the name says it all.", "helpfulness": 2, "user": "KeriMcFaddenLudwig", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166626679}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Most restaurants do not require long slacks for dining.", "title": "Majestic Excellence!!!", "user": "Barbara D", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166614941}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Everyone is very friendly and happy. We will be going back!", "title": "An honest review", "helpfulness": 9, "user": "honestopinion2005", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 166571369}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "This is my fourth trip to the DR , my third stay at a Majestic property and my second review of the Majestic Elegance. The previous was in 2010 for the same time of year and we used Costco Travel once again. I traveled to the resort for 8 days, 7 nights with my wife, two daughters ages 10 and 7 and close family friends with their twin boys, ages 11. We had a direct flight on United and transportation through Hotelbeds.", "title": "Losing its luster", "helpfulness": 5, "user": "Farmerica", "date": "June 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 132676530}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "As with our last trip, we chose the Elegance over the Colonial for the larger 1BR suite room option. They have 12 rooms that are walkout pool suites according to the front desk. However, because of the noise and rowdiness factor on our last stay, we specifically requested a room away from the center pool area. We arrived to find that the room reserved for us was exactly 50 yards from the one we had two years ago. They did offer to move us farther down the pool, but we would have to wait until the third day of our stay. ( I will tell you why we ended up keeping the room in a moment.)", "title": "Birthday Party", "helpfulness": 1, "user": "David K", "date": "June 24, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 132659395}, {"rating": 5.0, "title": "Excellent Vacation", "text": "The room itself was exactly as described in size, furnishings and cleanliness. On the first night, there was power outage at the resort around 10pm. The a/c stayed on ( backup generators, I assume) but the lights stayed off. Because we had travelled from early that morning, we went to bed assuming the lights would be on in the a.m., but they were not. I called twice between before 8am before finally getting a maintenance person to come. He tinkered with the fuse box briefly and left and five minutes later the lights and tv's were off again. I had to run and find him in the walkways and bring him back at which point he called for a more senior helper to eventually replace the circuits and panels. Because of the nearly 12 hours of lost power, the refrigerator stopped working and it would be another two days before it was effectively chilling our beverages and snacks. While these things were happening, we found our jacuzzi tub to not be holding water or producing hot water and our shower heads to be loose and dangling out of the ceiling precariously. My wife, who speaks some Spanish, eventually got to the front desk manager, Starlin, who was extremely competent and efficient in having these room issues addressed. However, my wife and I both felt that we spent so much energy and time in calling and managing the repairs that we perceived there is a sever lack of basic customer service training at the resort. The most glaring example of this came when a maintenance man came by later in the week to replace the A/C filter in the ceiling. He did the work in less than five minutes and left...leaving a pile of plaster and ceiling dust in the middle of the floor. It did not occur to this person to clean up a mess he made in a guest's room without being told to do so. This to me was symptomatic that the Elegance is not putting a lot of time in training their non-front-desk people to use common sense or have customer empathy skills. I write all this in my review to say that we chose not to move to the other room they offered for fear that we would spend the last days of our stay re-living all of the maintenance issues from the old room in a new room. Why bother.", "user": "Fred S", "date": "June 24, 2012", "id": 132651553}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Dining at the Elegance is a good and efficient experience; especially if you are with young children and seniors as we were this year. There is plenty of variety and options and both the buffett restaurants are comfortable and well-staffed. We had wonderful waitresses who were especially friendly and loving to the children. Our oldest had a stomach ache one day and Margherita rushed to get her a seltzer and salt drink. We made sure to thank and tip everyone who took care of us that week.", "title": "Unforgettable honeymoon", "user": "KymandBen", "date": "June 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132649922}, {"rating": 3.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "However, having been before, i knew what types of foods to avoid to not have any gastro issues myself and I believe this was the first year no one returned with a stomach bug of some kind. Of the reservation-required restaurants, 9 Doors remains the best in service and quality of food. The Italian restaurant is average and the steak house fair. With this said, I do have to note that this year I noticed ants around the breads on one day and flies around the fruits on another...and again felt like something had fallen down a notch somewhere behind the scenes in the kitchen.", "title": "Would not go back!", "helpfulness": 3, "user": "Jeff B", "date": "June 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 132620649}, {"rating": 2.0, "stay_parameters": "Stayed May 2012", "text": "We went there based on the tripadvisor reviews and travel agent reccomendation. We stayed in a Elegance Club Junior Suite. From the beginning we had problems wirh check in, dirty forks at restaurant, bad service, and room with mold. We complain by the all these problems and Alondra and Ismael offer us to change to a superior suite but we decided to move a better hotel.", "title": "Disapointing hotel", "helpfulness": 6, "user": "RobertoChile", "date": "May 31, 2012", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "location": 4.0, "service": 1.0, "rooms": 2.0}, "id": 131054850}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Is not a hotel for people having experience in real 5 stars hotels worldwide.", "title": "Very relaxing trip, service was just ok", "helpfulness": 8, "user": "erie477", "date": "May 31, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 131051167}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I just returned from 8 days at the Majestic Elegance with my husband for vacation. Overall our trip was decent. I mean how could it not be with beautiful weather and being away from work?! There was definitely some positive and negatives about our stay at Majestic Elegance that I will break down. I should say that my husband and I have done all inclusive in Jamaica, Cancun, and Cabo before coming to Punta Cana.", "title": "Back Again!", "helpfulness": 2, "user": "lucyAnchorage", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131023730}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We also did the Elegance Club at the Majestic, which I would recommend, which I will explain below.", "title": "Majestic Excellent! :)", "helpfulness": 6, "user": "danielle_s19", "date": "May 31, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131006724}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Positives:", "title": "Experience....", "helpfulness": 1, "user": "L T", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 130986940}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Honeymooned there in April (banner on the door). Resort was in awesome shape, very clean and well kept. While we would definitely go back, we didn't see the need for the additional cost of the Elegance club. EC lounge food was nothing exciting, although did give us web access, but not worth the additional cost. I assume this was felt by others as any doors with banners of \"Welcome Back\" were not located in the EC areas.", "title": "Awesome Resort, had a blast - would return for sure!!", "helpfulness": 14, "user": "Chris D", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130768165}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Not sure the \"pillow menu\" was (so maybe we needed to ask) but the towels and pillows need upgrades. That said, the rooms were awesome, beds were very clean and comfortable.", "title": "great vacation value", "helpfulness": 7, "user": "cbarkkume", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130710335}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Never line ups for bars, beach spots, rentals or anything. Everyone is so nice there.", "title": "New Drink by Kelin Matos!", "user": "Andr_M_12_12", "date": "May 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130690234}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Beaches/water was awesome, walking a few minutes either direction allowed for even quieter and often even cleaner beaches (void of seaweed).", "title": "Felt like we knew the staff for years.", "helpfulness": 16, "user": "Melissa h", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130654896}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Shops (tourist traps) are about a 5 minute walk from the resort, or south along the beach. Prepare to be attacked though.", "title": "Amazing vacation with an amazing staff", "helpfulness": 3, "user": "yovee11", "date": "May 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130628221}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was our second trip to Majestic Elegance and I cannot say enough GREAT things about our stay there! Last year we had stayed a week during late March in the Club section and enjoyed it so much, it almost started to seem like it would be impossible to relive that experience. Well, we were wrong, because we booked this year during the February Presidents Week school break and things were even more enjoyable than last year!! The staff was as friendly and welcoming, the property was as clean and beautiful. We even got the exact room location we requested!", "title": "Second Visit Even Better than the First!!!", "helpfulness": 2, "user": "lswg", "date": "March 4, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125589084}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "I'd like to address some of the quirky complaints that I have seen on this site:", "title": "Very nick hotel", "helpfulness": 1, "user": "miu115", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125573626}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "ILLNESS: I have never seen anyone reporting being sick from food or water at this hotel. We ate and drank all day long and we, nor anyone we met had even the slightest complaint about illness. If your at ME and get sick, its a coincidental stomach virus or you chose to overindulge in alcohol.", "title": "Wonderful vacation", "helpfulness": 4, "user": "charlotte m", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 125565678}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "NO FACECLOTHS: This is the dumbest complaint I've seen on tripadvisor about a hotel and it is simply NOT true. Both trips, we had plenty of facecloths brought to our room. If, for any reason the maid forgot to leave them, all you had to do was ask and they came immediately!", "title": "Great Service, Rooms, Food, and Drinks! Awesome Vacation!", "helpfulness": 2, "user": "Jake G", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125560289}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The only possible improvement I can make for this hotel would be to increase the quality of food served. The food is pretty run of the mill \"all-inclusive\" style fare. Quantity takes the place of high quality. If the hotel would work on this one area, it would be an even more amazing experience, but it would probably drive the price up too. Everything is a tradeoff. There was plenty to eat, no one went hungry.", "title": "Amazing place/Amazing staff", "user": "Wil G", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125560144}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "We visited from June 5-12, stayed in a Majestic Swim out Suite- loved it, except once you got in, no stairs to get out! Subsequently, did not get the full benefit of that experience, but was so pleased with every other aspect of our stay. The resort was at capacity during our stay, but you would not have known it- never waited in line- plenty of chairs, towels always available, did not have to wait at any of the restaurants. Italian and Steakhouse were our favorites- room service was good. Did not upgrade to Elegance Club but did hang out with couples who did, and they felt it was worth the price. I was very well pleased with our room- beautiful, cleaned every morning, plenty of towels. Special thanks to Nelson in the See and Sea restaurant- he asked us our name when he met us and called us by name the entire week we were there and treated us like royalty. Also Ismael and Kayla at the main desk went out of their way to accomodate our requests. The resort is the best I have stayed in, and we have traveled to many in Riviera Maya, Cancun, Puerta Vallarta, and Cabo. We are going back in October! These rooms are awesome, the food is good, we were waited on hand and foot, and it has a beautiful beach area with very gentle water. Book thru Costco- we booked thru Apple and paid way too much. The Apple Rep at the resort was rude and upset that we did not attend her welcome briefing- since we had been to the area before, and booked thru Apple, we thought it unnecessary, but she treated us rudely when we simply inquired about our departure time. Was very pleased overall, and cannot wait to go back! Thanks for a great vacation ! PS- Tipped for service above and beyond- was always appreciated, and never seemed to affect our service. These folks work long hard days- show them some love!", "title": "Total Bliss- Best Trip Ever!", "helpfulness": 1, "user": "raeann4510", "date": "June 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68582387}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "Just returned from 5 nights at the ME with three teens and had a great time despite weather that was just ok. Some sun but a lot of clouds with some downpours. We stayed in two one bedroom suites and were pleasantly surprised with ocean views. Rooms were beautiful but did have a mildewy smell, AC was fine, no bugs, housekeeping was fine and timely. The pool was beautiful as was the beach, really never had an issue finding chairs. The staff were wonderful in particular the bartenders at the beach bar! Was impressed with how well most staff spoke English. We tried most restaurants, the best was the Steakhouse followed by the Japanese, French and Italian. We're from NY so we're used to great Italian food but the steaks there were great! Breakfast at Flavors was great every day especially the omelets freshly cooked. If you like wine it was not good, we ordered one bottle at the French Restaurant ($), and another night we ordered a nice bottle at the French brought it back to the room and enjoyed on the balcony. Only went to one show but it was fun, enjoyed the nightly entertainment in the plaza until 9:45, authentic Dominican. The lobby was beautiful but hot, should have fans, lobby bar was hot. Overall had a great time with staff that were always with a smile!!", "title": "Great Service Great Time", "user": "jvaca22", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 68578234}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "We were there for our son's wedding. It was wonderful. Everything went perfectly. Everyone had a great time. The staff were exceptional everywhere. I took advantage of the yoga/stretching at the gym (with Elsa and Alexander) and really enjoyed it. The whole experience was first class!", "title": "It was awesome and unforgettable!", "user": "arlenecuff", "date": "June 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68567723}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "My family (my husband, son (30), his wife (27), our grandson (4), son (27), daughters (16 & 12) just returned from a seven day visit to the Majestic Elegance. We had three rooms (all one bedroom suites). All and all, it was a great trip. We have traveled throughout Mexico and the Caribbean, but this was our first trip to the DR.", "title": "B+ Rating (Some great highlights, others just average)", "helpfulness": 2, "user": "Jewelpef", "date": "June 24, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68556007}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "As context, we are a family that always enjoys our vacations and makes the best of our time away so we don’t spend much time or energy complaining. You aren’t at work so what’s to complain about! With that said, I won't spend time ranting about any specific irritations, but will give you an honest assessment of the good points and then a couple of areas where they could improve:", "title": "The beach and daily activities were a lot of fun, shout out to Julio!", "user": "cristina8208", "date": "June 24, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 68527512}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Hi, I went to the majestic the for 10 days as of June 2nd,2012..this was my 4th time going and i am already making plans to go back again next year. Me and my wife Denise went with another couple ( Jerry and Linda ) we all had an awesome time. Julio was the man..this guy is everywhere and was always calling me...Roberto...Roberto..wanting me and everyone else to participate in many of the events...we had a great time and he and the others always kept us involved. The food is great..the resort is awesome and i really have no complaints...a shortage of towels as was in the past has been easily resolved..no problems there! The room refrigerator is always stocked and all the workers are very attentive and with good attitudes..I have nothing bad to say about the place. Thanks to Julio and Chocolat for making the trip as enjoyable as it was. The crew from South Carolina that we met..the guys and girls and parents all added to the fun with water polo and just alot of friendly chat at the pool. Julio...i'll see ya next year! Thanks Bob (Roberto..as Julio says lol)", "title": "Another trip to paradise with Bob, Denise, Jerry and Linda.....see you next year!", "helpfulness": 1, "user": "BobJarosz", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132463442}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My wife and I have stayed in this resort three different times and every time was better than the last. We ate all the resturants and saw a major improvement with the quality of the food from the last time we stayed. Service at all the resturants were all excellent. If you are somewhat friendly with them they will return the friendliness x2. People can't be rude to the service and expect them to be friendly back. They after all are human.With that being said there were some servers that stood out above the rest. CARLOS from the flavors buffet #5 was a complete pleasure to see everyday and and works his tail off. JULIO also from the buffet and the Italian was a great person and will go out of his way to please you. FElIX from the beach club bar kept those drinks flowing. When we were making reservations we thought about booking at the Hard Rock just to try something new. But eventually we decided that we wanted to come back to see our friend MAXIMA from the beach club bar. MAXIMA is one of the hardest working people in the resort and does it with a smile. She was our ertainment on a daily basis and is the only reason we came back. Coincidentally, we spent 1 day at the Hard Rock because of a promotion they were doing and because of maxima we made the right decision in not booking at the Hard Rock. If waiting around for trolleys to get to places and over crowded pools is your type of thing, then more power to you. Plus, drinks were way better at the ME. Thanks again PRIMA. We will keep coming back as long as you are there.", "title": "IT KEEPS GETTING BETTER", "helpfulness": 3, "user": "goose__76_12", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 132449028}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We spent 8 night is June, 2012 at the Majestic Elegance Elegance Club and it is definitely worth the extra money. The private pools and beach with cabana beds and private club houses are wonderful amenities. We enjoyed the cocktail parties and the special services of our butler. As for the general property, it is gorgeous, huge, and beautifully kept. The restaurants are good. By US standards, the service is 4 star, not 5. We had a great vacation.", "title": "The Elegance Club, Oh Yes!", "helpfulness": 1, "user": "pbuntarl", "date": "June 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132441960}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My boyfriend and I stayed at the Majestic Elegance Hotel in Punta Cana, Dominican Republic from June 10-15, 2012. I have to say, this was the best vacation that we ever had. I cannot say enough good things about the resort. The Majestic Elegance was quite large, but everything is spread out in a way where you walk through a short, beautifully landscaped area. When we arrived our room was not ready, but the hotel staff kept our bags safe in the lobby, gave us a drink, and sent us on our way! The staff was extremely friendly and helpful in fulfilling any requests that we had. We stayed in the Elegance Club, and because of that we received many perks including our own butler (Bladamir, he was awesome), personalized concierge (Jennifer was super sweet and helpful), special dining and bar privileges, beach/pool towels, reserved pool space, and free WiFi in our own lounges (to name a few). This is an all-inclusive resort, which I think it the WAY TO GO in the DR. There are bars a step away no matter where you are in the resort. Even if you are on the beach, there are usually hotel workers making their way around fulfilling drink requests. Just a tip, bring an insulated cup to drink out of (it is larger than the cups they give you, and will keep your drink cool MUCH longer in the heat). The resort is equipped with many restaurants and buffets. The most enjoyable dining experience we had was in the French restaurant (requires a reservation). We also liked eating/drinking at Sea by Sea because of the beautiful view it had of the water. I have seen reviews saying that you had to be out early on the beach to get a seat, but we did not have this problem. There was a bounty of open beach seats, as well as spots by the pool, every day no matter what time (of course that could be linked to the time of year we went). As for activities, the resort has something going on all the time. During the day there were always cute contests and parties being MC'd, and at night there were shows and big beach parities. The hotel offers many free water actives like snorkeling, wind surfing, and sailing... and of course you have the option for paying for activities/excursions as well. We dealt with Prieto Tours for the excursion that we chose to buy (Papa Tony was our Prieto Tours representative, he was great). We chose to buy an all-day excursion (99$ per person) which took us to a few local towns, speed-boating, party catamaran (BEST EVER), and to Saona Island (our guide was Papa Tito... he's the man). As for late night at our hotel, there are a few bars open until late, and there is a club open until 5am (not really my scene). However, after being out in the sun all day, drinking, doing water sports and hotel activities, etc., we always found ourselves ready for sleep by 2am! In case you have never been to the DR beach before, you should know many locals walk on the beach and try to sell you items like jewelry, cigars, etc. The only reason that I mention this is because they can be quite persistent, and it was a tad annoying to constantly be heckled to buy something over and over and OVER... however, this is really not an issue that has to deal with the resort. Overall, we had an amazing trip! The weather, beach, and general atmosphere of Punta Cana was carefree and happy (everything one could hope for in a vacation)! Our stay at the Majestic Elegance was delightful. I will definitely consider going back, and I would absolutely recommend this resort to anyone!", "title": "Majestic Elegance, Elegance Club June 2012", "helpfulness": 4, "user": "Chickenkix2", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 132422038}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Amazing time and amazing service! The people were phenomenal and I could not have asked for more! The best part was the great entertainment of the Funjestic Team of SO SO, Jackson Mosart, Jasmin Coffee Girl, Chocolate Girl, Yonny Bravo, Super Julio & Pita! They were 24/7 energetic and keeping the crowd full of laughter! They always had great games and funny entertainment sessions! THANK YOU and we cannot wait to go back!", "title": "UNFORGETTABLE FAMILY VACATION", "user": "Diannelys R", "date": "June 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132409296}, {"rating": 1.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "We went on a trip to Majestic Elegance for 7 nights with friends. We had fun with our friends, but the hotel was terrible. We couldn't get room service because they wouldn't answer the phone. Two of the couples called for towels for 3x each and waited more than 4 hours for them. Rooms were not cleaned. Liquor was a lower teir than a well. They did have one bar in the lobby that had Jack Daniels from 5p-10p, but you had to remind the bartender where it was at the bar for them to actually get it for you. They claimed the non-motor water sports were free, but only after you pay them for lessons on some of the activities. Staff didn't really smile with the exception of about 8 of them. Last day my husband cut his foot in the bottom of the pool because they didn't have the drain covered properly. We would not sign a release for fear of infection so they charged us $131 for a bandaid and cleaning solution (they don't have a first aid kit). Two of the couples went through 2 bottles of Pepto while there. It is a beautiful area & beaches. I simply would NEVER recommend this particular resort.", "title": "beautiful area - TERRIBLE SERVICE!", "helpfulness": 6, "user": "rsillman", "date": "June 22, 2012", "detail_rating": {"service": 1.0, "cleanliness": 2.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 5.0}, "id": 132541509}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "My fiance and I celebrated our wedding at the Majestic Elegance and we can't say enough good things about our trip including the wedding, people, resort.....everything!! The resort was absolutely beautiful and we never ran out of things to do during the day or night. We became extremely fond of one of the employees in particular - Mozart (MJ). He always made a point to say hi to us whenever he saw us throughout the resort and made us feel part of the Funjestic Team. He will be missed!!", "title": "Absolutely Wonderful - Funjestic Team", "user": "Kelsey J", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 132534559}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "We can't wait to go back and celebrate our future anniversaries at the resort!", "title": "Beautiful Beach", "helpfulness": 3, "user": "Audrey Z", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132523663}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "My husband and I recently vacationed at the Majestic Elegance. We were a little skeptical reading all the reviews, but it was perfect. We were advised to bring washclothes and I would say that is the only thing that was missing. Our room was clean, didn't smell musty like others had said. We were greeted by our butler Dio, but like other reviews, we never saw him again. Thank goodness for Rafael. He was another butler that stepped up to the plate and took care of our love tub! Thank you Rafael. You made a difference. The beach is the most beautiful beach I have ever been to. The private pools and clubhouse were perfect. I would recommend the Elegance Club. The privacy of the adult onlys club was well worth it. The staff was friendly and our bartenders Kelin and Clara were the best. Very friendly and the drinks were top shelf. They always had a smile on their face and made you feel very welcomed. We thought the food was good, especially the buffet for breakfast. The eggs so fresh. The steakhouse very good, and sea by the sea for lunch was excellent. We didn't have any problems with feeling sick as some people have pointed out. We did take probiotics at the suggestion another review, so if you do have a sensitive stomach, I would advise that. The hotel was booked solid, but you didn't feel like it was overcrowded at the pool, bars or the restaurants. The spa was wonderful too...Maria was fantastic...the massage was excellent. This all inclusive resort was the best resort I have ever been to and I would love to return. My husband likes to try different places, but I would definitely return to the Majestic.", "title": "Great Vacation Spot!", "helpfulness": 43, "user": "webejeepin", "date": "June 21, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 132481505}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "Since there are already lots of reviews of the restaurants, pools, beach, rooms, etc, I will concentrate on answering a few questions that you might have. We were at the Majestic Elegance with 4 other couples in our early 30's from June 2-7. We stayed at the Elegance Club on the first floor and had a great time. Here are some things you might want to know:", "title": "Beautiful Resort", "helpfulness": 1, "user": "MandalynRox", "date": "June 21, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 132476661}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Majestic Elegance was a wonderful destination. The hotel was inviting and beautiful; even better than the pictures online. The room with the jacuzzi overlooking the pool was really nice with a huge king bed; a really nice shower and everything you could need. We found the service great and the staff so nice and hospitable. The entertainment was great. There was plenty of seating on the beach. The food was so-so but we always found something to eat. The waiters were nice and the ambiance was romantic which managed to take away the blandness of the food. The way other people talked you would think you couldn't get a restaurant reservation, but we managed to eat comfortably without one in the steak house, Italian restaurant and the buffet without worrying about getting one. I loved the open air buffet within steps of the beach so we didn't have to leave it on a beautiful day. The sand was like powder and cool to the feet, the water clean and warm and not too much surf. There is a pharmacy there if you get stuck which we did and we were able to find what we needed. The shopping was fun if you know how to barter and there is a direct path outside the hotel to a small shopping area full of goodies. We will definitely return!", "title": "A great trip!!", "helpfulness": 5, "user": "Linda C", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125422455}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Great place to go! We had a lovely time here. Great hotel, staff and food!", "title": "Fun", "user": "Mish1984", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125402917}, {"rating": 5.0, "title": "mostly good 2nd trip few suggestions", "text": "Only problem that we had was that the sun loungers were taken up too quickly and there would be a lot of them 'reserved'! Also the beachside buffet restaurant didn't cover the food up properly, so on the one occasion that we went there we saw flies on the food!", "helpfulness": 2, "user": "GJackJane", "date": "February 29, 2012", "id": 125400201}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": ":(", "title": "Amazing vacation !", "helpfulness": 1, "user": "Mosquito_Genie", "date": "February 29, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 125395214}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was our second stay @ the Elegance club..Just as the name implys..exellent for the most part. Staff standouts...Maxima,Felix,Alajandro and William @ lobby bar, and our buttler Sammy!! Great job all!!! Thanks to each of you for making our stay super. Now for the suggestions and annoyances:", "title": "Great Resort and Fabulous People", "helpfulness": 8, "user": "Jeanne B", "date": "February 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125375029}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We can't stop talking about our vacation at the Majestic Elegance!! We are already planning our return trip next year. We stayed on the Club side and everything was perfect. I could complain about our butler because he basically showed us to our room and that was it, but I won't because it really didn't matter. I'll leave the complaining to the negetive review people who can not be satified no matter what they do in life. If a tile missing in the pool, the musty smell in the room or the square toilet is going to ruin your trip than you should just stay home in your perfect little world.", "title": "Awsome-Can't wait to go back!!", "user": "laulet87", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154086786}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "Maxima, Eva and Yocasti at the club pool bar were the BEST!!! They always had a smile on their faces and hugs in the morning. These girls work very hard to make sure you are having a great time and they always remembered what your drink was. I never had an empty cup.", "title": "Best resort in Punta Cana!", "helpfulness": 1, "user": "scsc2323", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154078585}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The food was great - drinks were great and everyone we met along the way was happy. Not one person we talked with complained about the property.", "title": "Perfect Honeymoon - Detailed review", "helpfulness": 9, "user": "MATTfromCT", "date": "March 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154057851}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "We ate at the buffet, Sea & Sea for lunch, Italian restaurant for a sit down breakfeast, Steak house and French restaurant, every meal was excellent.", "title": "First All Inclusive", "user": "Tina P", "date": "March 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 154055548}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "The beach was beautiful and the wonderful thing was there are no kids on the club side running around kicking up sand. I highly recommend the club side if you have no kids and you are there for some adult time.", "title": "Honeymoon at the Majestic Elegance Punt Cana", "user": "Jean N", "date": "March 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 154029417}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "To start off, this vacation was planned by my parents for me to spend some time with them before I start the work life of 40 hour weeks and 52 weeks a year! The entire resort was magnificent with great service all around and plenty of entertainment. My parents, my sister, and I stayed there from Jun. 20-25. We actually just made it back home this evening with plenty of great memories and great times. The food was great, we had time to try every restaurant out each night and although we are spoiled by the great good in New York City, the dishes were very appetizing and enjoyable. I'm a guy in his young 20s and what really caught my eye were the entertainment and nightlife. The entertainment crew that they have at this resort really know how to have a good time and they made my stay a blast. Even though a couple of days were filled with rain, there were plenty of activities to do during the day out by the beach and pool, as well as in the evening in their theater and night club. Overall I would definitely come back in the future with friends or family and would highly recommend this place to anyone!", "title": "Best summer vacation I've ever had!", "user": "imjeffxp", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68697438}, {"rating": 4.0, "stay_parameters": "Stayed June 2010", "text": "Shout-out to the entertainment crew! Especially Julio Animaro and Yovanka! These guys made it really easy to have a great time!", "title": "Great experience", "user": "livestrong52", "date": "June 25, 2010", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 3.0, "rooms": 5.0}, "id": 68650735}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "--Jeff a.k.a. Bruce Lee & Jacky", "title": "Salmonella Poisoning, Never go back!", "helpfulness": 10, "user": "Greg093", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 1.0, "value": 1.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68645831}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I stayed from June 14th to 20th and we booked the Elegance Club, which I defiitely think was worth the extra price. Brought home a few bottles of liquor we got in the room. We also got a jacuzzi made with bubbles and flower petals and candles for free.", "title": "Relaxing & beautiful", "helpfulness": 2, "user": "jcaetans", "date": "June 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 68627972}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I made good use of the spin class with Elsa, which I really loved. The shows at night were cool and the events were fun.", "title": "A Vacation I will never forget...", "helpfulness": 1, "user": "DenEve84", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68599240}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Had the best vacation i've ever had in one of the best hotels i've ever stayed..the entertainment staff by the pool and beach made this trip unforgettable thank you Samuel Henry, Yoanka, Jasmin, Chanel, Cucurulo, Julio, and Luilly you guys were great! not to mention the food was also amazing", "title": "Majestic Elegance", "user": "nicki825m", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68495382}, {"rating": 3.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "I liked our \"butler\", did anything he could for 6 out of 7 days.... Air conditioning shuts off when you leave the room or stay still for awhile..... Meaning dont go to the bathroom when you are in the room alone, because all the power goes out. Food is awful.... Hot ttubs arent to clean. We asked for pics after the vacation(our memory card broke) and the host never emailed us back. The barteneders and some of the workers are cool and fun. But the best thing is just the beauty of the island/beach. I would give it 3/5 starts the most.", "title": "Beautiful but....", "user": "bboyce2121", "date": "June 23, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 68485967}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "I have traveled quite a bit and my experience at this hotel was indescribable. I never made a review on a hotel I have stayed in and I had to take the time out and give not only the hotel, but also the staff recognition. There are two sections in the hotel and I stayed in the Elegance club. Honestly, if you are on a budget, staying on the colonial side from what I saw was not much different from the Elegance club side just less amenities. My pool view room was amazing, along with my room keeper Maria who kept my room clean everyday with beautifully created swans with ours towels. Thanks Maria. My boyfriend and me really didn't get to enjoy room service because we were always out and about, but the days we did use it they were very quick. We also had a butler by the name of Jose, which was a very different experience for us and he was great. Food was awesome.The Club in the hotel was the best I've seen yet in a hotel and they played a good variety of music. The bartenders Carmen and Leo at the sports bar were amazing and very nice and Manny by the lobby bar was definitely one of the coolest bartenders as well. The contests they play all around the hotel were so fun and great to watch. The dancers Yovanka and Chanel would also help you around the hotel if needed. They worked very hard. Beach was great, casino is small but cool, and the night shows were great, especially the Michael Jackson and The Circus show. The kids are so talented in DR. As I was on the beach I also saw a couple get married on the beach, which was very nice. The weather was pretty good and only rained at night a few days. If it rained during the day the sun eventually came back out. Overall, this Hotel/ Location/ Stay was amazing. Dominican Republic is a beautiful country and a beautiful experience.", "title": "The Best Hotel Experience EveeeeR :)", "user": "Miladyleo", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68473493}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I would specifically like to mention the wonderful tennis lessons (3) that I took during our stay. I highly recommend the tennis pro Toni Morey. He's fantastic. He made the lessons very enjoyable. He'll make you work hard and get the most out of your lessons, but you'll have a great time.", "title": "Our stay at Majestic Elegence was Incredible", "user": "m0na2010", "date": "June 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68456586}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "His small assistants (ball boys) add to the experience: Joselo, Moises, Starling, and Rafita are diligent and attentive.", "title": "Mario at Majestic Elegance - Amazing Bar Service", "user": "help-love-haiti-now", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68333807}, {"rating": 4.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Just got back from a week at the Majestic Elegance for our 10 year anniversary (33 years old). It was a great trip and the hotel was pretty nice. We were in the Elegance Club (EC) and it was worth the extra money in my opinion.", "title": "Almost perfect, but very spotty service and inconsistent", "helpfulness": 5, "user": "Eric_S_Phoenix", "date": "June 23, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 5.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 132597244}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled as a couple", "text": "Grounds: The grounds were very nice. There was always someone trimming something or cleaning up to make sure they stayed very nice. The hotel was pretty good size but nothing that would be considered to big to get from your room to anywhere else at the hotel within 10 minutes. There was always ample seats at the beach (both in the EC area and the non EC area)and you could get one of the bali beds easily before 10am.", "title": "June 16-21, 2012", "helpfulness": 8, "user": "8davidsons", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132591887}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Room: Our room was an EC Majestic Junior Suite (room 3106). These are swim up rooms. The rooms had a pretty musty smell but you could get used to it. I give them a pass on this as it is very humid and everyone leaves wet clothes in them so I can see how this would be difficult to get rid of. Our bed was not that comfortable and the pillows were horrible. Fortunatly most nights sleep was preceded by heavy drinking so it made for an easy way to fall asleep. On sober nights however, it can be tough to fall asleep. There is a blowdryer and ironing board/iron in the rooms.", "title": "Absolutely delightful", "helpfulness": 2, "user": "Chicago49_2012", "date": "June 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132588927}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Room/Maid Service: This and bar/restaurantservice was what makes this hotel 4 dots instead of 5. The service was very spotty. Maid service was very random. Sometimes we would leave our room at noon and not return until 5pm (with our \"Service Please\" card on the door) and they would still not be there. Once they left no new towels and once they left only one. They took the old towels mind you so we had only what they left in the room. How they can leave no towels is beyond me. We ordered room service 3 times and all three times the service was good. 45 minutes - 1 hour which is ample.", "title": "Team majestic", "user": "Christopher W", "date": "June 23, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 3.0, "rooms": 5.0, "location": 5.0}, "id": 132571931}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with friends", "text": "Bar/Restaurant service: Like maid service, this was very spotty. Our EC swim up bar bartender the whole time we were there was named Junior. The first day he seemed fine and everyone was tipping him pretty well. After that though, he was miserable and seemed to hate his job. He would clean up instead of getting drinks, he would say \"no\" when someone asked him to make a specific drink even though he knew how to make it. Numerous times we had new people come up to us and ask \"Is he always this much of an *sshole?\" His level of professionalism and service was completely unacceptable in my opinion. The wait staff and runners in the restaurants were generally pleasant and good. Some were very good (bringing new drinks without even having to ask) and others were so-so. But nothing terrible.", "title": "GREAT STAFF", "helpfulness": 1, "user": "NorthCarolinarenee", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 132555981}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "We just spent 8 days at the Elegence with 2 other couples, had a great time. The resort is beautiful and the weather was perfect. This is our second time so we knew most of the tricks, we recommend you do the below for a great time.", "title": "Fantastic Stay", "helpfulness": 3, "user": "Thomas C", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130980016}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Airport, if you can swing it take a cab from the airport to the resort and back. If you tell the resort you need a cab the night before you fly down when you land they will be waiting with a sign. Costs about $45 each way. Most reservations come with the transfer shuttle, it stops at many resorts before the Elegance which is normally the last once because it's the farthest down the beach. Shuttle bus can take anywhere between 30-90 minutes while a cab is maybe 20. They also never tell anyone that you need to pay $10 per person to enter the country.", "title": "3.5 stars not the best nor worst in the area", "helpfulness": 8, "user": "Jen L", "date": "May 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 130976604}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Bring a thermos or insulated mug for your drinks at the beach or pool. They serve you in 6-8 ounce plastic cups and things get warm real fast.", "title": "\"Mamawana\"", "user": "Thomas C", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130954982}, {"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Bring lots of small bills for tipping, $1,$5, they really appreciate when you tip them even the smallest amount.", "title": "If your looking for a relaxing vacation...", "helpfulness": 4, "user": "Dawn B", "date": "May 30, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 130954352}, {"rating": 3.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Go for the Elegeance club if you don't have kids. Just note the Butler is a non factor, we saw him at checkin and that was it. You get access to 3 private lounges with free wifi access and snacks along with 3 private pools a swim up bar and 2 private bars at the beach end of the resort. The convince of them being right at the beach was great, we would stop in check emails grab a water go outside fill our thermos mugs and hit the beach. The private pools have large cabanas also.You get access to a private section of the beach that is alitte less crowded. They resently expanded the elegance club and I'm pretty sure it's now more than half of the resort.", "title": "Would not return", "helpfulness": 1, "user": "Alison S", "date": "May 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 130946874}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was our second visit to the Majestic last year we were at the Colonial with our grandson. This year we traveled with friends and opted for the adults only elegance Club. Our rooms were lovely and spacious with a very comfortable bed and a balcony overlooking the pool area but set back enough to avoid any noise. The lounges in the club area were always well supplied with drinks and snacks and I don't think we ever had to wait to get on a computer. Special kudos to Junior, Jessica & Jennifer the concierges. Not sure about the butler service as we didn't ask for it but as far as we know we didn't see any butlers. I think had we filled out the request form initially asking for baths to be run and other special services we would have had butler service but we were happy to pop in and talk to the concierge on duty (and stock up with water)", "title": "Excellent Holiday at the Majestic", "helpfulness": 3, "user": "katefin", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125498636}, {"rating": 2.0, "stay_parameters": "Stayed February 2012, traveled with family", "text": "We really enjoyed the buffet particularly as the staff were so friendly and hugely appreciative of our attempts at spanish. Particular compliments to Rudy, Ritchie & Altegracia & Omar- it was lovely to be greeted like old friends. Also the chefs in the buffet were so kind to help us improve our spanish.", "title": "Beautiful weather, questionable resort", "helpfulness": 4, "user": "ny_wahoo", "date": "March 1, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125476013}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "The japanese restaurant was great fun at the teppanyaki(?) table were the chefs juggled and put on an excellent show. The food was fresh and well cooked . We had mixed opinions on the other a la cartes. The meat eaters enjoyed the steak restaurant but found it VERY hot inside. The french restaurant was very elegant and we liked the option of lunch in the italian restaurant. Our only disappointment with the food was our dinner at the beach. It wasn't awful just okay. We had high hopes for it because it was open air and that was probably what we missed most the opportunity to eat outside more.", "title": "Great Location and an Especially Great Staff", "helpfulness": 1, "user": "Scott B", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125464082}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "The drinks were excellent quality, name brands & good wines.We had great service from Miguel & Natividad in the lobby bar. We also really enjoyed the outdoor music & shows on the plaza ( never made it for the 10pm shows - too late for us!)", "title": "Just as Beautiful Second Time", "user": "BryonJames", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125461592}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Thoroughly enjoyed our rounds of golf. We were picked up promptly and had our clubs stored for the 2 weeks. We were lucky enough to get early tee times and thought the course was lovely. The carts come well stocked with water (or pop) and sandwiches are included in the price.", "title": "Great place to stay!", "helpfulness": 1, "user": "medNorthBay", "date": "March 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125445122}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "There are thousands of reviews on this resort so I won't go into great detail about it but I would like to mention a few things.", "title": "Very Good Resort", "user": "laflrd08", "date": "March 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 154028515}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "1) It's HOT in the Dominican and they have a HUGE pool. I do not care about missing tiles. The pool was perfect for the weather down there. My wife and I spent a great deal of time in the pool and pool area. The staff there treated and greeted everyone with a smile. Ismael, Cesar, Miguel and Jahaira were all very good to us and anyone else that we saw around. Loved the pool area.", "title": "Our Wedding!!!", "user": "Josie S", "date": "March 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153979754}, {"rating": 5.0, "stay_parameters": "Stayed February 2013", "text": "2) The room was very nice. We've had nicer rooms at other places (The Royal in Playa Del Carmen) but this one was very nice as well. Good sized, the butler drew our jacuzzi one night, aromatherapy one night, nice shower, comfortable bed.", "title": "Great Trip!!!", "user": "Mo M", "date": "March 7, 2013", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 153970096}, {"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "3) The food was pretty good at the restaurants as well. Depending on whether you value ambience, food quality, fun atmosphere, or what have you you'll find something to your liking here. It's not first class but all in all it was pretty good. To each his own I guess.", "title": "Wonderful Resort", "helpfulness": 7, "user": "Sue A", "date": "March 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 153954247}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "4) The Funjestic team do a good job of keeping the activities lively around the pool. They had quite a few fun games to join in on or just watch and laugh if you want. Again, the pool area was great.", "title": "In my opinion - All good.", "helpfulness": 3, "user": "Kevin B", "date": "March 6, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153900790}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled with friends", "text": "Just returned from a wonderful 7 day trip with 3 families. We all had 6 swim up suites with rooms in the Elle and Ella buildings.", "title": "Excellent Group Trip to Majestic Elegance", "helpfulness": 1, "user": "Bgiants", "date": "July 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 167085471}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "First of all, the Elegance Club is the way to go. The service and amenities of the Club lounge and closeness to the beach made the extra money so much worth it. We also were attended to by Rafael, our concierge. He took care of any issues and reservations we needed. He called each room at least once and made an effort to stop by the pool daily to talk to our group. He made the trip very special to us. The entire staff gave nothing but smiles and we had many, many positive interactions with the staff. For previous reviewers who said the staff was unhappy and inattentive must have been at a different resort. Were there staff who were not overly happy- happy, sure, but they did their job professionally and with respect.", "title": "Excellent but could use one or two improvements", "user": "Kim R", "date": "July 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 167038969}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The food was fine for everyone in the group. There was something for everyone. A few meals were superb and the other meals were fine. For those looking for top gourmet cuisine may be disappointed, but we all were well fed and very happy with the offerings. It was nice to have constant snacks in the Club lounge. We enjoyed a fun dinner at the Japanese restaurant and many of us preferred the Steak House and Italian restaurants.", "title": "Had an amazing trip", "helpfulness": 3, "user": "scotlynn", "date": "July 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166981081}, {"rating": 4.0, "stay_parameters": "Stayed June 2013, traveled with family", "text": "The drink was constant and diverse. We used all of the bars and drink areas. Some bars had higher quality liquor than others, but there was always something for everyone. The staff was attentive and we never had to wait for drinks, even though the hotel was pretty full.", "title": "Good times!!", "helpfulness": 1, "user": "retep145", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 166853755}, {"rating": 3.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "The swim-up suites were excellent rooms. They were very large and comfortable. The robes and slippers were a nice amenity and the in-room fridge was constantly stocked. The floors could be slippery so you had to be aware. The outdoor area was really nice to host the group. We had a large patio and grass area in which we laid out on loungers, the bed, and hung out in the pool. This was so much nicer than having to bring your stuff down stairs and over to the other side of the pool to \"stake out\" your area. Well worth the extra cost - if your going to spend a chunk of money on a vaca, you might as well have your own private poolside space. Outdoor hot tub was nice to have an evening soak after spending the day at the beach.", "title": "Honeymoon", "helpfulness": 5, "user": "Julie061413", "date": "July 8, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 166847739}, {"rating": 1.0, "stay_parameters": "Stayed June 2013", "text": "I've never been to a resort with such horrible guest services. The resort is terribly understaffed at all its restaurants, bars and customer service department. For a 5 star resort I couldn't believe how little English most of the resort speakers spoke. It takes a long time to get served at restaurants and bars and orders are messed up all the time.", "title": "If 5 stars is based on the number of resorts you have to get shuffled around to before you find a room than this is 5 stars all", "helpfulness": 4, "user": "Asdfjkl1010", "date": "July 8, 2013", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "location": 3.0, "service": 1.0, "rooms": 1.0}, "id": 166776781}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The trip started by the resort overbooking and not having a room for us even though everyone in the wedding party I traveled with booked 5 months in advance. We were sent to another resort for the night that did not know what to do with us. We finally found a room at a lower quality place after visiting 4 that did not have room for 3 of us. The resort promised a room upgrade and a 300 dollar voucher for us for the remainder of our trip when we returned the next day. There was no room upgrade and we were told there was nothing available when we arrived. On top of that it changed to being 300 dollars per room instead of per person.", "title": "Go majestic", "user": "Niceguyfromny", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 166743170}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "We had to have a person come to our room 4 times to fix our air conditioning. Each time we had to speak to a translator on the phone who would tell the mechanic what was wrong. There was also a strange smell that hit you every time you enter a room. We figured it was from the drain in the shower as it was strongest here.", "title": "Party of 40 coming from wedding ceremony first week of July 2013", "helpfulness": 5, "user": "Angela M", "date": "July 8, 2013", "detail_rating": {"service": 1.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 166735593}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "When we asked for an extra bed so that the groom in our wedding party could sleep in our room the night before his wedding it took 7 hours to get a bed delivered. After the 3rd time we called we were told that we refused the bed when it was delivered. We were in the room though and nobody ever came. We were hungry and couldn't leave the room because by this point there is only one maintenance person to bring the bed after 11pm and we were told he had other things to do. The front desks solution was for one person to stay behind while everyone else went to eat.", "title": "A true paradise for our 25th Wedding Anniversary", "user": "MexicoCruizer", "date": "July 8, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 166687507}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Despite having forms for a dry cleaning service, when the maid failed to pick ours up we found out after calling to complain 5 times ( 3 of which we were hung up on) and then visiting the front desk, that there is no dry cleaning service. Yet they still have dry cleaning forms.", "title": "Outstanding", "user": "Leef5011", "date": "July 7, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 166684571}, {"rating": 3.0, "stay_parameters": "Stayed March 2013, traveled with family", "text": "Let me start by saying that I don’t understand the reviewers that slam this place for not being a five star resort. It’s a mid-priced all inclusive. It would be pretty foolish to expect the Four Seasons. Prior to the trip I spent a lot of time researching on Trip Advisor and elsewhere. It was pretty much just what I expected.", "title": "Nice Stay", "helpfulness": 3, "user": "vtgambler", "date": "March 10, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 154205861}, {"rating": 4.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "We visited the resort the first week of March for a family vacation. There were eight of us altogether. My wife and I (40, 33); my brother, his wife and two kids (42, 39, 13 and 16 months); and my parents (82, 70s). We may have had both the youngest and oldest guest at the resort at the time.", "title": "Just returned from relaxation in Punta Cana!", "helpfulness": 1, "user": "ErinH631", "date": "March 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 154108122}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Rooms: We booked a one bedroom suite. It was on the ground floor which meant we had a good size patio area with padded loungers and we could jump right in the pool. A “swim up” room. My brother had the same type of room which was great because they could still be poolside while the baby was napping in the room. This was not something we requested so I guess we just got lucky. I would highly recommend it if you can get it.", "title": "what's not to like!", "user": "Huggels1", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154092275}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled with friends", "text": "The suite was huge with a bedroom and separate living room. The bathroom was also large with a double vanity, separate shower and separate toilet. While everything was clean there was a LOT of wear and tear. Among other things we had cracked drywall, worn furniture and a shower head not properly attached to the ceiling so you could see up into the plumbing. We spent very little time in the room and none of this bothered us but it’s not something you would see in a four or five star resort.", "title": "Great Resort", "user": "RHall_11", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154088266}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled with friends", "text": "Since my brother had his kids with him we did not book the club section. I would suggest it if you are traveling with adults only. The club pools were less crowded and had nicer loungers. There was also a section of the beach available only for club people. I believe the rooms themselves are the same.", "title": "Only resort I would reccommend -Marlena & Anthony", "user": "Marlena K", "date": "March 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 154087759}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "This was my first in Punta Cana and I really enjoyed my stay at the Majestic. It has everything you want in an all-inclusive resort. The rooms are spacious, and the pools are wonderful. It was great to wake up every morning and get in a workout. The gym facility more than met my expectation. The hours are great and I never had to wait on a machine. Alexander, the director of the gym facility was always available anytime I needed a workout partner or assistance with the equipment. I'm looking forward to my next trip.", "title": "Nice workout facility", "user": "rwt124", "date": "March 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 125555126}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "This was our second visit to the Majestic Elegance-consecutive years. It is a great property! Rooms are mini suites. Food is good. Restaurants, four of the six, do not need reservations. Just walk in. The Club pool section has plenty of chairs any time of the day. The Club section on the beach also has plenty of chairs, often shaded, at any time. I noticed that the non club section also have chairs available at any time. The entertainment is adequate-if you don't go you are not missing anything. And, the resort staff are extremely friendly and kind-bring plenty of $1.00US bills to leave as tips if you want to. Nobody will bother you for it but the staff deserve it. We took a taxi from the airport for $40.00-therefore we did not have to wait for the bus taking people to multiple resorts. As a courtesy, if you take the taxi you should tell the tour operator representative at the airport that you are not taking the bus so that they don't wait for you. However, going back to the airport we did take the bus-they help you get to the proper gate and take care of any airport fees for you. We would go back unless we wanted to see something new. BTW the walk on the beach is great especially going to the left of the resort.", "title": "Majestic Elegance Doesn't Dissappoint", "helpfulness": 4, "user": "MeirToronto", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125529939}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "We returned for our 2nd visit but with friends this time. We decided not to pay the extra for the Elegance Club so we could compare. Upon checking in, they told us that they were over booked. They asked if we would share a suite with our friends just for the night and they would give us another room the next day with a $200.00 credit for the inconvenience. We agreed. This suite turned out to be a \"swim up\" pool room. The next day, when we got our room it was right next door to our friends. The best thing was they gave us all a \"swim up\" pool room which were better rooms than what we booked. With the credit they gave us we were able to have some laundry cleaned, internet connection in our room and 2 nice bottles of wine at dinner. Our favorite restaurant would be the French called Limited Gourmand. We were greeted with a glass of champagne and a rose. The staff was very friendly and attentive to our needs. The place I would recommend avoiding is the Italian restaurant called Ilbotaccio. The hostess ended up giving our reservation (table) to someone else so that made our wait time even longer. Once seated, no one was friendly. The waiter plopped our dinner in front of us and that was it until we were finished.", "title": "Beautiful Beach", "helpfulness": 6, "user": "Karibbean62", "date": "March 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125523164}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "I just returned from my weeks stay at the Majestic Elegance Punta Cana. This was my first all inclusive resort vacation and I am glad that I choose the Majestic Elegance! The resort was beautiful and clean. Even better than the photos. The beach was lovely. Very clean. The sea weed would come up on shore but was cleaned up each morning. The bar service on the beach wasn't great. I think each day we got back we were asked once or twice if we wanted a drink. However, if you did want to grab your own drink it was a two minute walk from the beach. It was very windy when we were there which made swimming in the ocean a lot of fun. The food was awesome! There were two buffets. Both of them had a wide variety of food. The resturaunts were all great. 9 Doors is the Japanese Resturaunt. You need to make reservations for this restuarunt as there is only nine tepanyaki tables The staff here are really great and full of engery. The food is to die for. The Asadito Steak house was very good. The night we went however was really busy so we got the soup, salad and appetizers at the same time. The See and Sea turns into a Seafood Resturaunt in the evening. I dont like seafood and they only had a vegetarian lasagna for a main course for non seafood eaters. The Il Botaccio (Italian Resturaunt) was very tasty. The service here was a bit slower here than the other restuaraunts but well worth it. The Limited Gourmand (French Resturaunt) was excellent. You also need to make reservation here. I had the beef tenderloin and I highly recommend it. The service here was great and the champagne is awesome! If you get hungry late at night the la B del M is open from 11 to 6 am. It is about a 5 minute walk from your room. They have pizza, burgers, wings, ect. There are tables and chairs outside to sit and eat. It is very nice at night to sit out there. There are lots of things to do at the resort and for being only there for a week I didnt get to do half of the stuff avialable at the resort. There was volleyball everyday, we learned how to dance by the pool (lots of fun! and the instructors were full of energy), parasailing, banana boating, tubing, snorkling, tennis, the casino just to name a few. The shows are night were a lot of fun and it was nice that they started at 10:00 so you could go for a late supper. The dancers in the Micheal Jackson show are phenomenal. The 60's, 70's and 80's show was okay but it was all lip syncing which was kind of disappointing. Ideal Couple was really funny. It is like a game show were 4 sets of couples need to do four games and then the audience determines the winner. It would have been nice if at the Coco Nightclub they played Spanish music instead of American Club music. We went to the Club two nights and it wasnt really very busy even night. I didnt find that there were very many people in there 20's at the this resort so that is probably why the club wasnt as busy. Most of our nights were spend at the Piano Bar in the lobby. Only open until 12. The bartender Roberto is the reason we went to that bar every night. He was super friendly and a lot of fun. He also makes the best drinks and if we didnt know what we wanted he would suprise us! We were never disappointed. Roberto was our favourite staff member but most of the staff were really great! They were always smiling and had high energy. Our rooms were very nice the only thing is the first day or two there were only two towels for three of us in the room. You also have to ask for a face cloth if you want one as they are not put in the rooms automatically. The pillows are very small too. I had to fold mine in half to make it fluffy enough and our fridge wasnt restalked with chocolate everyday. We did the dolphin, stingray and toothless shark tour. It cost $145 for four hours. It was worth it for because I have never done anything like this but the Sunwing representative said that it was only a 10 minute drive to the location and the a ten minute boat ride to the dolphins. It was closer to a 45 minute drive to the location and then another 10 minute boat ride. The represenative also said that you got 3 and half hours with the dolphins, sharks and stingrays. It was more like 30 minutes with dolphins and then 30 minutes with the sharks and stingrays. Once the tour was done we went back to the beach and waited for about 45 mintutes to get picked up again. You get complimentary drinks here but if you want ice cream you have to pay for it. You can also buy a DVD of your photos with the dolphins. It cost $70 USD for a DVD of 5 people. We were told by the representative that it would only be $40. It was nice though that the dolphin resort was away from the Magestic Elegance for me because I liked to see other parts of Punta Cana. I had a really good time and I will defintley go back to the Majestic Elegance. The people, food and beach made this a very memorable trip for me!", "title": "Very happy with my first resort experience!", "helpfulness": 6, "user": "elka_e", "date": "March 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 125508309}, {"rating": 3.0, "stay_parameters": "Stayed February 2012, traveled with friends", "text": "Although service was spotty we had a wonderful bartender at the pool named Maxima. She was so nice and pleasant. She is a hard worker and very kind. She made our vacation quite pleasant as we spent most of our time at the pool. I wish our room was a little cleaner, it had areas that had not been cleaned in a good while. The food was almost always very good. No complaint there. The weather was beautiful. The restaurants and shops, etc. are convenient to walk to.", "title": "overall had a good time", "helpfulness": 3, "user": "Anne S", "date": "March 2, 2012", "detail_rating": {"service": 4.0, "cleanliness": 1.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 125501284}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 263, "average": 719, "very good": 2003, "terrible": 169, "excellent": 4956}, "aka": "Majestic Elegance Punta Cana Hotel Punta Cana", "slim_ranking": 0.178217821782, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Opening in October 2008, the Majestic Elegance Punta Cana is the answer to fulfill the needs of a clientele, which is becoming more demanding of a high-end menu of facilities and services. This spectacular 5 star all inclusive resort is surrounded by the most astonishing landscapes, exuberant flora and fauna, making it an ideal place for Caribbean lovers and first timers visiting the Dominican Republic. In two words “comfort and style”, is the best definition to describe the New Majestic Elegance Punta Cana."}