{"user_rating": 4.5, "review_count": 535, "name": "Majestic View Lodge", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Really enjoyed staying here for a few nights.", "title": "Hotel full of character", "user": "Maeboyce", "date": "May 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 130240103}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Really loved everything about the rooms which are fabulously decorated - very rustic and over the top but brilliant with all natural materials. All the rooms benefit from balconies and stunning views. Our room did have another building in front of it, but we still had great views.", "title": "Majestic View Lodge - Zion National Park", "user": "John G", "date": "May 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 130097024}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "We ate dinner in the restaurant on our last night, and choose steak which was surprisingly good. The only downside, which stops the hotel getting five stars, was that we had several courses - starter, salad, steak and the waitress wanted us to keep the fork we had used for all of these for the dessert as well - yuk. Needless to say, our party explained we would rather not and there was no problem but this should never have been suggested in the first place.", "title": "Don't Go Just for the Views", "user": "Cotta", "date": "May 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 130049324}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "Breakfast was just ok but this is still a hotel I would return to in a heartbeat and recommend it wholeheartedly for its wonderful setting, nice, clean rooms, pleasant grounds, and public areas.", "title": "It was a Majestic View", "user": "quadchickie", "date": "May 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 129990969}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "Great place. Rooms were clean and rustic. Great view from your private balcony. Gift shop has great prices. Also the home of Zion Brewery. Buy one of their six-packs at the gift shop for a great price. The hotel is the furthest from Zion National Park but Springdale is a small town. The hotel is also furthest from the town activities [other restaurants for food] but easy to reach them.", "title": "Wonderful !!!!!!!!", "user": "Rita L", "date": "May 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 129541726}, {"rating": 4.0, "title": "The views certainly are Majestic...", "text": "Beyond that, the room was large and clean. Did not try the restaurant. The staff was helpful and the hot tub was hot. As others have said, slightly out of town but with easy access to Zion and/or the Zion shuttle. Decent value.", "helpfulness": 1, "user": "MikefromSeattle", "date": "April 23, 2012", "id": 128428810}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "The location for the Majestic View is just enough out of town you feel removed from the small town but close enough to drive or catch the convenient shuttle into town for exploring or meals. We stayed five days and had two adjoining rooms with a door between so the kids could have one and we could have the other. The facilities were in great condition, the front desk was helpful with suggestions, and the town magazine lays out all the restaurants and menus. We all enjoyed it and have suggested to a few other friends they visit as well. Although the on-site restaurant was good, a little less fancy menu and lower prices would have provided a little more value - we ate there once and found better value in town.", "title": "Outstanding views and a great time", "user": "Ray R", "date": "April 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128030263}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Had a very good time at the Majestic View Lodge after an easy 2 1/2 hour drive up from Las Vegas over the Easter Weekend. Hotel is as advertised with great views of the mountains surrounding Zion National Park. It is also the first hotel you will encounter before entering the city of Springfield, which is an advantage. It was very quiet and relaxed. Has a definite Western decor, even with a small museum with animals in arranged in dioramas and the occasional wagon wheel lying around. Lots of antlers are hanging from the walls.", "title": "Great view and great time at the Majestic View Lodge!", "user": "onoman", "date": "April 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 127961422}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Check in was easy, staff was very friendly and helpful. Gave us a 10% coupon to use in the restaurant. Room was very quiet, clean and had a great view from the windows/balcony of the Zion mountains. Got two very comfortable queen beds, bathroom with shower/tub and toilet, which was separated from the vanity sink. There was a small refrigerator and a coffee maker.", "title": "Majestic View Lodge was perfect", "user": "Michelle A", "date": "April 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 127930384}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Checked bed--no bedbugs! I always do this.", "title": "Wonderful stay - friendly service in all areas.", "user": "Kapakegs", "date": "April 14, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 127862855}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "I was nervous about coming here after seeing a previous review that mentioned bedbugs. I can say with confidence that nobody in my family of four encountered a single bedbug during our four day stay. The view from our room was indeed majestic. I would recommend this hotel for anyone visiting Zion.", "title": "Nice, clean & quiet", "user": "Saerim", "date": "April 8, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 127475502}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Overall, we had a nice stay at this cute hotel outside Zion NP. The rooms were sizable, with a great porch and view. The lodge is far enough away from the entrance to the park that it's quiet, but close enough that the park is easy to access. The only drawback to our stay was a run in with bed bugs. My husband got eaten alive on our second night. We changed rooms, but the damage was done. If Majestic could resolve the bed bug problem, we'd recommend it in a heartbeat.", "title": "great stay with one setback", "helpfulness": 13, "user": "Melanie G", "date": "March 16, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 126189093}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "Nice looking property, spacious rooms, convenient location to Zion National Park, but banging hot water lines in the ceiling and walls of our rooms (used by many nearby rooms til after 1am) plus other external noise (very lightly sound insulated room) makes it a tough go for light sleepers. We put the hvac on full fan after 1am - though my girlfriend was not excited about that part - to drown-out some of the noises and were able to sleep a bit, but the night definitely suffered. You could hear every door close (inside and outside of nearby units), people walking on the tile floors of their bathrooms, vehicles in the parking lot, etc. Otherwise, nice property, pretty clean and roomy.", "title": "Light sleepers might be better off elsewhere", "helpfulness": 1, "user": "Osdanuwati", "date": "February 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 1.0, "rooms": 4.0, "location": 4.0}, "id": 124946602}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled as a couple", "text": "As the name indicates, the best thing about this place is the wonderful view of the mountains and bluffs to the east, a view enhanced by the walk-out porch or balcony on each room.", "title": "The Name Says it All.", "helpfulness": 1, "user": "plainsrefugee", "date": "February 11, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124435896}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The price was reasonable when we were there, but there was only one other couple in the place, which was kind of creepy. I half expected to see Jack Nicholson dragging an ax through the parking lot saying \"Here's Johnny!\"", "title": "Great view!", "helpfulness": 1, "user": "priscilla001", "date": "January 18, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123255833}, {"rating": 5.0, "stay_parameters": "Stayed May 2012", "text": "The room was amazing and we had the best view. Restaurant was very good and I loved that they had a brewery on site. It is the farthest out of town, but the shuttle service makes it the perfect stay. I would definitely stay here again!!", "title": "Awesome Views", "user": "Wyldreams", "date": "May 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 129234414}, {"rating": 5.0, "title": "Georgeous View", "text": "The hotel is at the beginning of Springdale on the Shuttle line but not in walking distance of town. The rooms are spacious and have a fridge and coffee machine. Each room has a balcony/patio for the truly \"majestic\" view. There is a steak house on the premises not affiliated with the hotel that was to our liking and provided the most spectacular viewing of the surroundings.", "user": "Walter N", "date": "April 30, 2012", "id": 129070689}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We stayed here on our trip to Zion National Park. We chose this hotel based on reviews and we were very pleased. Our trip was in April and the weather was chilly and foggy on arrival so the amazing view was hidden from us until the next day. Staff was very friendly when I was making reservations and on arrival. The room was lovely ( nice decor, great view, refrigerator, coffeemaker...). Ask for the rooms across the street and a top floor room. The Zion Park shuttle stops at the door of these units ( you will hear it ) but so convenient.", "title": "Amazed by the View", "user": "Laura M", "date": "April 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128777802}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "When we travel to a scenic area we want a view from the room. Here we had a great view and a balcony and two chairs to enjoy it from. The hotel also has a laundry area and a pool.", "title": "Nice experience, but.....", "helpfulness": 4, "user": "Connie M", "date": "April 26, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 128652206}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We also enjoyed the Wildlife Museum - which is very tasteful and well done. Its like something you might see at a museum. The gift shop had a great variety. We didn't eat at the restaurant although we were offered a 10% off coupon - it just didn't fit into our plans.", "title": "What a Gem!", "user": "jaydub0425", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128429827}], "location": {"country": "United States", "city": "Springdale"}, "stars": 3, "variance": {"poor": 12, "average": 47, "very good": 170, "terrible": 6, "excellent": 300}, "aka": "Majestic View Hotel", "slim_ranking": 0.466666666667, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Majestic View Lodge has 69 rooms with 3 suites. Located in Springdale, Utah, 3 miles from the South Entrance of Zion National Park. Open year-round. On site Restaurant, Gift Shop, Wildlife Museum, and Zion Canyon Brewing Co. Outdoor Pool open April thru October, Hot Tub open year round. We offer AAA, AARP, & MILITARY Discounts of 10%. We welcome Group Tours, Buses, and Special Events. Our Conference Room seats 50-60."}