{"user_rating": 4.5, "review_count": 272, "name": "Malabar House", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed February 2013, traveled with family", "text": "We stayed 1 night in suite #18 which was comfortable , spacious & beautifully furnished & decorated. we had 2 large balconies high above the attractive courtyard & the small swimming pool.The staff here were superb & went out of their way to fill our needs. Dinner was excellent. This hotel is a lovely peaceful sanctuary from the hustle & bustle of Fort Kochins attractions which are just on its doorstep.", "title": "Kochin oasis", "user": "kathyl l", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 152669231}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "We were blown away by our stay at Malabar House. The stay started well when the charming desk staff upgraded us to a suite because of a mix up with our booking. The suite was staggeringly well designed with gorgeous decor, classic furniture and TWO outside terraces, one with a beautiful swing. The bathroom was immense and tastefully done with beautiful cotton victorian towels.", "title": "Most stylish place in town", "user": "LizzieLucyChapman", "date": "February 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152632045}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We found it very hard to leave the pretty courtyard and ended up spending most of the evening sampling the extensive wine list and delicious indian-spanish tapas (trust me it worked) in the bar. There was live Indian classical music in the garden, by the floodlight pool.", "title": "Boutique hotel that is overrated", "user": "ALandE94", "date": "February 17, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 4.0}, "id": 152351640}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled with family", "text": "My only gripe was breakfast which could have been better - the buffet looked a bit sad. But you could order eggs and dosa off a cute chalk board. Great coffee.", "title": "Malabar House Kochi", "user": "AshokJalan", "date": "February 17, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "service": 3.0}, "id": 152334338}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "This place can't be beaten for location, style, decor, service, facilities and cuisine. Lovely exotic fruit basket in the room...Cute walking tour guide given to us on check in...excellent massage treatments...the list goes on", "title": "Delightful - A Genuine Boutique Hotel", "user": "CitybreakWestcountry", "date": "February 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 152280679}, {"rating": 4.0, "title": "A pleasant stay", "text": "We started our trip in Kerala in Cochin staying here. The courtyard is lovely and looks lovely lit up at night. We didn't eat here in the evening but it looked impressive. Our room was slightly different, probably in need of some refurbishment. Comfortable enough. For lunch the light menu was great. Well positioned to walk into Fort Cochin. Staff were very pleasant.", "user": "lacortanelaLimoux", "date": "February 15, 2013", "id": 152209153}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "I would recommend to friends that this the place to stay in old cochin. We had a spacious roof suite #17 with 2 private balconies. We went to Brunton boatyards for dinner and the Taj Malabar for a drink which made us even more pleased with our choice. The Malabar House is much more cheerful, unique and in a great location with many of the main sites in walking distance. The hotel is 15 years old and could use a few tweaks (replace bath tub, chalk bathroom, upgrade air conditioner) but really it was the nicest we saw. The food was also the best we had in Cochin but not as good as other places we visited in India. Dining outside in the courtyard was very pleasant with local live music. We also liked the bar. I agree the service is not like other Relais properties but one is in India. You'll need to bring mosquito repellent. Go for a suite if its in your budget.", "title": "Lovely, unique hotel", "user": "portiab", "date": "February 3, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151291536}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The Malabar House was recommended by our son, who had worked on a Merchant/Ivory film in Fort Cochin some years ago. Because we made a rather late decision to go to India, we made all the bookings ourselves, and took the Malabar House seven night package, staying at their various properties, including a night on their lovely houseboat, Discovery. This package is tremendous value, including half board, transportation between the different stops, a half day tour around Fort Cochin, a tasting of Indian wines, even an elephant ride. The hotel in Fort Cochin has been beautifully and sensitively restored and extended, and has a first-rate restaurant, with a mix of local and international cuisine. We had a ground floor room the first two nights, with an enormous bathroom and an outside terrace. On our last, extra, night we were upgraded to a suite on the first floor, even more beautiful and enormous, with a wrap-around terrace. The restaurant is mainly outdoors in a tropical garden, near the swimming pool. The staff were delightful to deal with and endlessly helpful. We left determined to return: this is a life of luxury we could easily get used to.", "title": "Exceeded our expectations", "helpfulness": 1, "user": "100traveljunkie", "date": "January 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 151076092}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We are regular customers of Relais & Chateau properties so; we had expectations based on other properties in the ‘grouping’ of small luxury hotels. We were worried by some of the Trip Advisor reviews we had read but decided to give it a try anyway. Our experience was mixed nevertheless we were left with the feeling that it still might be the best property in ‘old’ Cochin. We found the greeting a reception less warm and friendly than had been our experience elsewhere in South India. Our room, a roof garden suite, was spacious which striking décor. The bathroom had little counter space and the rain head shower head was installed very low – at 5’10” I had to bend over to wash my hair. The room was well enough equipped. The private balcony was nice but the chairs very uncomfortable. The laundry service was good. The hotel is centered on a pretty courtyard with a small pool and an excellent restaurant – the best by a long shot of those we tried in Cochin. While the food quality and presentation was excellent, the hotel was licenced to sell only Indian wine and beer (an international beverage licence is expensive) this was a big disappointment because as much as we love Indian beer, the quality of wine does not stand up and often has an after taste. The restaurant was busy in the evening so be sure to reserve a table. Service was inconsistent at dinner and breakfast. There was Indian entertainment at dinner which was very good and enjoyable.", "title": "Not as wonderful as other Relais & CHateau but a pleasant stay just the same", "user": "Edward068", "date": "January 29, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 150927731}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Went with high expectations and was disappointed. Food was all right but certainly nothing to rave about. Service was quite good and outdoor setting was quite acceptable. Best part of the evening was the Sula Vineyards 2012 Chenin Blanc - superb wine. Also, bought the Indian cookery book 'Masala' here - very informative book.", "title": "Restaurant", "helpfulness": 1, "user": "748Anne", "date": "January 27, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0}, "id": 150791913}, {"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "When choosing a hotel, I always like somewhere that is unique - and steers away from the generic - which is why I usually pick boutique hotels. (Casablanca and MAve in NYC) Malabar House is just such a place! With fantastic ambiance, the hotel is chic while retaining a culturally relevant theme. I have been making plans to go to India for the longest time, and everything about this hotel seemed to fit with the way Kerala had been portrayed to me by friends.", "title": "Wonderful hotel, staff and food!", "helpfulness": 2, "user": "ReaThomas", "date": "January 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 150644979}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled with friends", "text": "The food was exceptional, easily on par with some the best restaurants I have eaten in - home and abroad, offset by the traditional classical music playing live.", "title": "Great design and historic location. Food and service disappointing.", "helpfulness": 3, "user": "Harrie J", "date": "January 23, 2013", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 150330233}, {"rating": 4.0, "title": "Better than the large chain hotels", "text": "The gentleman who served us, Harrison, was outstanding in his professionalism and enthusiasm, despite how busy the restaurant was.", "user": "wildswimmer2010", "date": "January 22, 2013", "id": 150248171}, {"rating": 2.0, "stay_parameters": "Stayed December 2012, traveled as a couple", "text": "Highly recommend this hotel, especially if you enjoy somewhere with style and sophistication without the generic blandness of a chain hotel. The staff make it wonderful and the food makes you feel like you've stumbled upon a secret! LOVED it.", "title": "Extortionate prices; poor facilities", "helpfulness": 2, "user": "joeyal", "date": "January 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 4.0}, "id": 149282798}, {"rating": 3.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "The house itself is stunning with beautiful rooms and a traditional courtyard with pool. The tapas restaurant is of a very high quality. I had high hopes for the main restaurant with its many awards however both food and service were incredibly disappointing. I am sure that once upon a time this hotel was fabulous but it feels as if they are now resting on their laurels. The staff felt like grumpy teenagers and often stood in the corner chatting rather than service tables.", "title": "Hot in the Heart of Kochi", "user": "KimCL", "date": "January 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 149256882}, {"rating": 5.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "We stayed here for two nights, one of which was my birthday. This had somehow been noted and I was met with collective greetings at breakfast and, at dinner, presented with a cake and wine. Quite a moving experience, since it was unexpected.", "title": "Happy Birthday", "user": "NatGreen", "date": "March 12, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 154348654}, {"rating": 4.0, "stay_parameters": "Stayed January 2013, traveled as a couple", "text": "Our suite, on two floors and with a rooftop 'sit-out', was very well furnished and equipped and gave us a real sense of luxury.", "title": "Lovely colonial building", "helpfulness": 1, "user": "ScorpioLondon57", "date": "March 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 154083523}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "The young staff were very charming and keen to please and if the service was somewhat laid-back (as, indeed, it was) this was in keeping with the context of relaxed outdoor eating in a delightful courtyard garden listening to local musicians.", "title": "Incredible dining at this hotel!", "user": "triplemuse61", "date": "February 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 153123374}, {"rating": 5.0, "stay_parameters": "Stayed February 2013, traveled as a couple", "text": "Much of the food was outstanding (the tiger prawns in tempura absolutely unbelievable!) with a good Indian wine list to match.", "title": "Lovely heritage hotel", "user": "Midge M", "date": "February 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 152938840}, {"rating": 4.0, "stay_parameters": "Stayed January 2013", "text": "Cochi itself is well worth time spent to absorb something of its colonial history and significance as the gateway to Europe's marine trade with the Orient.", "title": "A little disappointing", "helpfulness": 1, "user": "AliceCristal", "date": "February 22, 2013", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 2.0, "rooms": 4.0}, "id": 152794055}], "location": {"country": "India", "region": "Kerala", "continent": "Asia"}, "stars": 4, "variance": {"poor": 9, "average": 30, "very good": 81, "terrible": 5, "excellent": 147}, "aka": "Malabar House Hotel", "slim_ranking": 0.141975308642, "description": "Malabar House is a charming boutique hotel overlooking the parade ground in the heart of Fort Cochin. The 17 highly individual rooms and suites seamlessly combine tradition and contemporary design. The Malabar House is a member of Relais & Chateaux. Malabar escapes offers the finest circuit of boutique and villa hotels in Kerala. Placed in colonial Fort Cochin, the backwaters and the plantation hills, each escape gives you a distinct experience & flavour."}