{"user_rating": 4.0, "review_count": 270, "name": "Malibu Beach Inn", "reviews": [{"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "Our stay last week was SO BAD at this property, that I am writing a review for the first time. We planned a special weekend for our children and their two friends. We booked a $1,200/night suite and asked if we could check in early, which we were told we could. We ended up waiting three hours to get our room after being repeatedly snubbed by a surly front desk attendant. I cannot begin to tell you how rude this guy was. The GM was not much better - terribly condescending. When we finally got our room, the floor was filthy - covered with pot buds, drops of blood on the bathroom floor and bed cover, ashes in the bathroom (of a non-smoking hotel), toenail clippings and hair had not been vacuumed up! The housekeeping staff did, in fairness, come right in and clean up and they were (along with the valet) the loveliest people at the hotel.", "title": "Hated the Malibu Beach Inn", "helpfulness": 14, "user": "MissHen", "date": "July 26, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 18264664}, {"rating": 1.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "The service at this hotel was so bad, it was almost comical. The overpriced food was terrible. The people in charge of the restaurant really did try to make things right, but that didn't change the fact that the food was overpriced and bad.", "title": "Overpriced Rip off of a hotel", "helpfulness": 11, "user": "momof3boysScottsdale", "date": "July 21, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 5.0, "value": 1.0, "location": 5.0, "rooms": 4.0}, "id": 18113255, "likes": {"liked": "— right on the beach", "disliked": "— way overpriced"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "I didn't mind the cubical sized suite and once our room was cleaned, I was fine with that. I did mind the rude front desk staff, the poor service, the unpleasant GM, and the patio noise. Did I mention that our suite overlooked the dining patio where we heard every word of every conversation going on below us? If I walked past our oceanview window, there were always several people looking up right into our room! We had to shut our blinds (and block out our $1,200/night beachfront ocen view) just to have privacy We spent two really unpleasant nights at a very overrated Inn which is essentially a motel. Shame on the magazines that have promoted this place obviously without even trying it. Shame on the GM for not making our lousy experience right or even bothering to apologize for essentially ruining what was supposed to be a wonderful weekend for our children and their friends. We could have stayed anywhere at that price - and we sadly chose the Malibu Beach Inn. Please don't make the same mistake that we did. I should have looked here first!", "title": "Overpriced", "helpfulness": 6, "user": "Lugageboy", "date": "July 18, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 3.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 17998034, "likes": {"liked": "— It was at the beach", "disliked": "— didn't reach their standard: overpriced to say the least"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2008, traveled with family", "text": "We stayed at this property four nights last week when we had to leave the hotel at Pepperdine which was sold out for a conference. The room was very expensive but we decided to stay there for its beach location and availability. We were vacationing for a beach holiday. What a mistake. From the moment the keys didn't work and the front desk person left us standing at the door, waiting for her (she never did come back and we ended up having to go to the front desk to see what the heck had happened to her) we should have known the stay would be awful. The front desk people have terrible hotel training, if any, and they barely speak English. There was one American front desk person (female) who was wonderful but it didn't make up for the rest who were lacking in customer service and acted as if you were bothering them to ask them a question. The food was priced outrageously and portions and quality were a joke. My son had a plain cheese pizza at the beach for almost $15 and it was basically a microwaved single serving sized pizza. My $18 salad was lame. I mean, if you are going to pay $18 for a salad, have a salad as nice as the half portion salad at the Coogies Restaurant by the Ralph's which was $11. Cut out the fancy amenities like the TINY individual boxed chocolates for turndown (what a waste of a little cardboard box each night). As an afterthought, they tell you there is complimentary coffee and tea in the morning from 5 til 7 (huh? who gets up that early on vacation?) I mean, have the coffee out all day and it will encourage people to come into the restaurant. Or have it in the room. They advertise such an elegant mini bar but who eats a snack bag of potato chips for $3? The bottles of FIJI water in the room cost over $6 each. Huh? The Valet guys were very nice and friendly (Valet is an extra $20 something charge a night) and so how are you supposed to know whether to tip the guys or not? You feel cheap if you don't but my gosh, how much money can they suck out of you at this hotel? At least the Valet guys left a couple of bottles of water in your car each day. We pleasantly complained to the General Manager by phone and received a box of chocolates. That was nice, but hopefully he will make some changes and not just shut the guests up with chocolates. There are a lot of real people out there (not celebrities with money to throw down the toilet) who don't mind spending money on quality if the bang is worth the buck. It isn't here. THE PIECE DE RESISTANCE -- we received a wake up call at 5 a.m. which we hadn't requested. 5 a.m.! The response when we went to the desk later to say, \"What the heck was up with that wake up call?\" was something lame like the person who had requested it had changed rooms. But we had been in the same room three nights prior. Barely an apology. Wouldn't you think the night before someone would have called the room to double check that we really wanted a 5 a.m. wake up call? Save for the location right on the beach, and the sprinkling of celebrity sightings, there was nothing nice about this \"upscale\" hotel. I would never return, other than to say hello to the valet guys.", "title": "Inattentive staff, bad guest service for the money", "helpfulness": 10, "user": "CeeWood", "date": "July 14, 2008", "detail_rating": {"front_desk": 2.0, "service": 1.0, "cleanliness": 3.0, "value": 1.0, "rooms": 4.0, "location": 2.0}, "id": 17870989, "likes": {"liked": "— beach front", "disliked": "— service"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2008, traveled with friends", "text": "This place is hugely overpriced. We were two people staying for two nights. Check in time is 4 pm and you have to be out by 11 pm check out day. Dinner one night at the hotel, breakfast and the valet parking for one car including hotelnights almost reached $ 2000. If you pay that price it has to be outstanding. This was not.", "title": "GReat Service, outstanding location", "helpfulness": 2, "user": "Philippe47", "date": "June 29, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 17331825, "likes": {"liked": "— The service", "disliked": "— service"}}, {"rating": 2.0, "stay_parameters": "Stayed June 2006, traveled on business", "text": "We booked accomodations at the Malibu Beach Inn because we wanted to be a short dirve away from the seminar we were to attend at Pepperdine University. When we went into the inn to the reception area to register, we were left standing there waiting while a gentleman complained about problems with his reservation and the price he was paying. Finally someone else came to the front desk to register us. We were taken to our room by a very polite young lady and she showed us the features of the room which was a nice touch. The partial ocean view was marginal because you overlooked a parking in back of portable buildings which I assume were part of the hotel. It was very unattractive. Next, the \"free\" internet did not work. When I called the front desk , the person who answered the phone gave me a toll-free number to call, but was not able to answer any of my simple questions. I can see the need for tech support, but someone answering the phones should have some general knowledge of the internet set-up in the hotel in which they work. The rooms are very nicely furnished and decorated, but on the small side. There is a patio and glass sliding doors, but no screens. The air-conditioner made a very loud buzzing sound and vibrated our ceiling to such a point that we turned it off. When we went downstairs to have a quick snack on the patio overlooking the ocean, no one came to give us menus nor to take our order even though two restaurant employees walked right by our table and looked right at us. All that they would have had to say was \"I'll be right with you\" or something pleasant to that same effect. We just got up and left. Lastly, the Pacific Coast Hwy which runs in front of the hotel is very busy and impossible to cross. The neighborhood is totally run-down with many vacant, decaying buildings and weed-filled parking lots. I could not believe that this was Malibu and that I was paying over $490/night for a room in this seedy area with only a beach and ocean to its credit. I would be very ashamed to live here. I will never stay here again.", "title": "Disappointed", "helpfulness": 4, "user": "haleybrook", "date": "June 19, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 17038154, "likes": {"liked": "— the decoration and furniture in the room", "disliked": "— the service and the surrounding area."}}, {"rating": 1.0, "stay_parameters": "Stayed June 2008, traveled as a couple", "text": "I was very disappointed with our stay. I should have known the minute I called to book the reservation. I felt like I was bothering them by calling. I had to ask 20 questions to get anything out of them regarding the property's features. With that initial impression, I should have just booked elsewhere. Nonetheless, i went against my instinct and went ahead with the reservation. Big mistake! The room was overpriced, we had to pay for everything! I mean everything! It was mandatory valet, and the parking was literally a few feet away. They managed to charge $26 for that. My car was kept out in the sun, so it wasn't even worth it. The front desk (Eugene specifically) was rude. We ate at the restaurant, and I've had a better NY steak at sizzler. We originally booked a table outside to enjoy the ocean, but it was freezing! No heat lamps whatsoever...go figure. There was no pool, no jacuzzi, no bathtub in the room, and no gym. A tiny bottle of water was almost $6! Give me a break! When you pay that much money for a room, you should have all of the bells and whistles that come for that price. It was a complete disappointment. I've had a better overall experience at a Holiday Inn for 5 times less (no joke). Save your money and stay somewhere else!", "title": "Extremely overpriced, 1 star service, and no amenitites!", "helpfulness": 5, "user": "bobbiinc", "date": "June 5, 2008", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "rooms": 2.0, "location": 3.0}, "id": 16705875, "likes": {"liked": "— The ocean", "disliked": "— Lack of amenities you would expect at that price level"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2008, traveled on business", "text": "This is the second time I've stayed at the Malibu Beach Inn this year (both times for work). It's a very nice hotel, nice amenities, super friendly staff, but for the price I'd expect the staff to be a bit more on it. The first time I was there, my colleagues and I arrived and went to eat at the restaurant. We were literally the only people there. First the hostess took ages to seat us, like she was deciding where to put us! The whole place was empty! Then they kept bugging us during the meal. She seemed really nervous as if this were her first ever job. One of my colleagues asked for a FedEx envelope. Nope didn't have one and for whatever reason couldn't get it the next day either. This time around, my room barely had any hot water. When I spoke with the front desk, the gentleman asked if I wanted the engineer to check it out. Uh, not really a yes or no question. Send the guy. I know this seems petty, but when you're paying for a luxury hotel, I don't want half-a#@ service. But as I mentioned, they are super nice, so it's hard for me to discount them but MBI doesn't beat the Sunset Marquis in the city.", "title": "2nd Visit Was Much Better", "user": "rockstarbaun", "date": "May 19, 2008", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 16218695, "likes": {"liked": "— right on the beach"}}, {"rating": 5.0, "title": "Great Place!", "text": "My husband and I thoroughly enjoyed our stay. Had such a different impression, vs. the reviews I ready on Trip Advisor. I was actually hesitant to reserve a room, but so happy that we did. The setting was perfect - when you sit outside you are literally on the ocean. Our room was spacious, well appointed and clean. Views are sensational. Service might not be the most professional, but they were all really nice. It didn't bother us. It's a casual,boutique hotel and you just feel so comfortable. We barely heard any of the traffic on PCH. Good gym across the street. The Malibu Country Mart is less than 5 min. down the road. Great places to shop, sit and have coffee and have dinner at Nobu or Tra Da Noi. We can't wait to return.", "helpfulness": 1, "user": "LifeisGOOD58", "date": "April 3, 2008", "id": 14774364}, {"rating": 5.0, "stay_parameters": "Stayed March 2008, traveled on business", "text": "Wow! This is a really nice hotel. I loved it at the Malibu Beach Inn. Maybe the weather had something to do with it, I don't know, but it certainly helped to be right on the beach. I was sunbathing in my bikini on the balcony in the beginning of March (!).", "title": "Wonderful views and sound of the waves", "helpfulness": 2, "user": "Foreigner_in_London", "date": "March 12, 2008", "detail_rating": {"front_desk": 4.0, "service": 4.0, "business": 3.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 14226388, "likes": {"liked": "— The location on the beach, sound of the waves, views.", "disliked": "— The noise from the road, having to pay extra for breakfast and the internet, no gym/pool facilities."}}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "My wife and I stayed for three nights in a Queen Ocean View room and it was perfect. Room was very well designed and furnished with a view to die for. We ate two meals in the Carbon Beach Restaurant which were very good together with wonderful relaxed breakfasts. Nice touch was a faxed copy of a London paper outside our door every morning. The lack of a pool is made up for by the perfect beach setting with great loungers and beach side drinks and food service, even the sea is warmish. Location could not be better, staff super friendly, pricey yes but definitely worth it!", "title": "Top class beach hotel", "helpfulness": 3, "user": "mikedjackson", "date": "September 9, 2008", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 19905206, "likes": {"liked": "— Style", "disliked": "— Nothing!"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "I have been to this hotel before in July 08, loved the room, the view, the staff, the attention we received on the private beach and decided to spend my birthday weekend there, the Labor day weekend. My second visit we had the complete opposite impression. The room and view are still lovely. The housekeeping and valet staff are efficient but the rest of the hotel staff (many through no fault of their own) is a joke.", "title": "What a disappointment!", "helpfulness": 5, "user": "TommyBLosAngeles", "date": "September 4, 2008", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 4.0, "value": 2.0, "location": 4.0, "rooms": 4.0}, "id": 19766487, "likes": {"liked": "— The room, the view", "disliked": "— lack of hotel management and lack of staff"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled with friends", "text": "I arrived Friday afternoon and decided to visit the outside restaurant before I unpacked. After waiting 10 mins. I went to unpack and came back down and waited 15 minutes and still no service. After complaining the manager made me a drink. (The funny thing about this hotel is they have no bartender-every waiter makes the drinks and they all make it the way they want so you never get the same drink twice. We even had to argue with a \"bartender\" who said he made a certain drink I've had several times and instead we had a drink I have never had in my life.) On Saturday, the weather was sunny and I am looking forward to going to the beach. There were no beach attendants (seems they fired them all the week before this Labor day holiday weekend). No iced towels, no iced fruit, no service at all. I had to wave to the restaurant for water and then a waitress had to bring me the water, neglecting her other duties. That afternoon they ran out of orange juice. I was paying $900.00 a night (3 night minimum) and this hotel runs out of Orange juice? Management is non compliant ( Will and Peggy are efficient but can only do so much with no other competent back-up, though a new restaurant manger just started) and most of the time non existent.", "title": "Alarming And Reoccuring Theme: Terrible Service", "helpfulness": 4, "user": "mytibt", "date": "September 2, 2008", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 1.0, "cleanliness": 2.0, "value": 2.0, "location": 5.0, "rooms": 5.0}, "id": 19668796, "likes": {"liked": "— Decor and Location", "disliked": "— Service"}}, {"rating": 2.0, "stay_parameters": "Stayed August 2008, traveled solo", "text": "Until they get their act together I suggest everyone stay away from the \"luxory\" property. The only thing luxory about it is the price. I wonder if the owner, David Geffen, knows about all the negative comments this hotel is receiving.", "title": "Only the Location is 5 Star!", "helpfulness": 3, "user": "HighCamp", "date": "September 1, 2008", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 19612708, "likes": {"liked": "— Location", "disliked": "— Lack of interet access, and lack of professionalism and knowlege of staff."}}, {"rating": 5.0, "stay_parameters": "Stayed July 2008, traveled as a couple", "text": "I can't understand how a hotel can try to pass itself off as 4-5 star caliber on account of the decor and location. First off though, I would like to give the Malibu Inn it's fair share of compliments - the decor was very nice, boxed mints at night, fireplace in the room, and great views of both PCH and the coastline all provided for a wonderful atmosphere. The person who handled the design aspect did a nice job. The rooms were decorated in a homey, but not dated way by many means, and Internet access was up and going without a hitch. There is a private area on the beach with wicker beach chairs that lead straight out to the water on Carbon Beach. The hotel is about 10 minutes each way from Geoffrey's, Nobu, Gladstones, and other good dining.", "title": "Beautiful Views but......", "helpfulness": 5, "user": "TommyCT", "date": "August 15, 2008", "detail_rating": {"front_desk": 5.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 4.0}, "id": 18992803, "likes": {"liked": "— the view", "disliked": "— valet parking"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "We were surprised by the negative reviews for this hotel. We’ve spent years (and generations) at the best hotels everywhere. No, it’s not the Hotel Hermitage in Monaco but don’t come here expecting it to be. It’s Los Angeles. It’s Malibu. It’s location, location. It’s the beach. This hotel is one of the best beach hotels, from my experience, in California.", "title": "Amazing Hotel & Supreme in Los Angeles", "helpfulness": 3, "user": "sastudio", "date": "October 9, 2008", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 20742462, "likes": {"liked": "— Beach Luxury", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "Being Angelenos and after a long exhausting birthday weekend, my other half chose this place as a well-earned and needed “rehabilitation” jaunt to prepare for the coming work week. This place is perfect for that! As a small boutique hotel, at the surf, with a staff that understands (if you tell them) why you are there, you can’t beat it in Malibu.", "title": "Wonderful - as usual", "helpfulness": 3, "user": "hollihedge", "date": "October 4, 2008", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 5.0}, "id": 20624575, "likes": {"liked": "— The view", "disliked": "— Liked everything"}}, {"rating": 1.0, "stay_parameters": "Stayed September 2008, traveled with friends", "text": "This “hotel” is about the views to the ocean and the sounds and smells of the surf. Luxury, luxury, luxury - Fête linens, Morton Brown products, hand made chocolates and \"Oh yes\" a fire place. This room was well designed to space and scale. We did not want to leave.", "title": "You can put lipstick on a pig, but it is still a pig.", "helpfulness": 5, "user": "luxuryspotter", "date": "September 22, 2008", "detail_rating": {"value": 1.0}, "id": 20293167, "likes": {"liked": "— The opportunity to share with others not to stay here and be ripped off.", "disliked": "— I did not like the hotel. Period."}}, {"rating": 1.0, "stay_parameters": "Stayed July 2008", "text": "The Inn's service is a pleasure and \"beach\" sincere - it is Malibu not the south of France. Nothing was a problem. We are coming back to the beach retreat in the heart of Los Angeles. The Malibu Beach Inn is a true Angeleno experience at its best.", "title": "Malibu Ripoff Inn", "helpfulness": 4, "user": "veronica1119", "date": "September 20, 2008", "detail_rating": {"cleanliness": 4.0, "rooms": 3.0, "value": 1.0}, "id": 20226510, "likes": {"liked": "— We didn't really like anything", "disliked": "— location , staff, and lack of anything to do or anywhere to go"}}, {"rating": 1.0, "stay_parameters": "Stayed August 2008", "text": "Am amazed to read the negative reviews of the Malibu Beach Inn, as we have just returned from another wonderful stay (our third and first since the hotel has been renovated). Rooms still offer the same \"billionaire's view\" of Carbon Beach with crashing Pacific rollers, but have more mod cons including flat screen plasma TVs, and lots of nice food and bathroom goodies. We breakfasted twice on the patio in the sunshine and the food and ambience were great. We also breakfasted up the road in Malibu Colony Plaza at Coogie's Beach Cafe (also highly recommended). Service was excellent, as usual, and I especially liked the brownie birthday cake and candle that was awaiting my arrival after a long flight and journey in rush hour traffic from LAX - a nice touch. The only slight annoyance was the valet charge of, I think, USD 23, but it seems that you have to pay to park at most hotels in the States, so I suppose this was OK, even though the car park is right under the hotel. Valet staff were however lovely and there was always a cold bottle of Fiji water in the car to greet us every morning with staff being only too willing to offer directions and easy ways to get places etc. We thoroughly enjoyed ourselves (again) and highly recommend the Malibu Beach Inn.", "title": "Fools Paradise/ The Emperor Has No Clothes", "helpfulness": 7, "user": "gwendolyyn_USA", "date": "September 15, 2008", "detail_rating": {"front_desk": 1.0, "business": 3.0, "service": 1.0, "cleanliness": 4.0, "value": 1.0, "location": 1.0, "rooms": 1.0}, "id": 20080224}], "location": {"country": "United States", "city": "Malibu"}, "stars": 4, "variance": {"poor": 17, "average": 20, "very good": 59, "terrible": 17, "excellent": 157}, "aka": "Malibu Beach Hotel Malibu", "slim_ranking": 0.166666666667, "description": "Magnificently nestled right on the sands of famed \"Billionaire’s Beach,\" Malibu Beach Inn is a spectacular ocean-front getaway within minutes of LA. Since its inception in 1989, Malibu Beach Inn has become a beloved destination for both leisure and business travelers. After a complete, contemporary multi-million-dollar renovation, Malibu Beach Inn re-opened its doors as the only luxury oceanfront hotel destination between Santa Monica and Santa Barbara, offering guests unsurpassed levels of luxury and service on the sands of exclusive Carbon Beach. The Malibu Beach Inn is approximately 22 miles from Los Angeles International Airport. The hotel embraces the serene beauty of the Malibu coastline through its landscaping, architecture and interior design. It also embodies the spirit of one of Southern California's most exclusive communities through the warm hospitality of its multilingual, European-trained staff, its signature beach club, and a unique collection of artwork by contemporary painter Glenn Ness. The Carbon Beach Club features California coastal cuisine with Pacific Rim accents that is complemented by an outstanding and extensive list of hand-selected small-production wines from California's premier wine regions. The dining room offers both indoor and outdoor dining, both of which boast breathtaking views of the Pacific Ocean and the sound of the tumbling surf below.Guest rooms feature private balconies, minibars, coffeemakers, hairdryers, bathrobes, DVD players, safes, complimentary high-speed Internet access, fireplaces (most rooms), and private hot tubs (some rooms)."}