{"user_rating": 4.0, "review_count": 115, "name": "Malie Hotel Utrecht - Hampshire Classic", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "We traveled to Utrecht on business and our hosts chose this hotel. it is reasonably well located - the center of town is a 10-15 minute walk. Our room was very small - barely enough room to move, and the closet was tiny, as well. Some colleagues had a bigger room, so they do exist. Beds were twin but comfortable. Bathroom was also small and poorly equiped.....no place to put anything. I have never been in a hotel before that didn't supply guests with a box of tissues - if you stay, you need to bring your own! Also, I asked for skirt hangers (ones with clips)...when told they didn't have them, I asked, \"How do you hang your skirts?\" and the receptionist said, \"I don't have any. I only wear pants.\" \"OK then - no problem for you!\" said I.. The receptionists also wouldn't make change. The ironing board is shared by the floor and an iron is available from the front desk. Although fresh croissants and chocolate make up for a lot, the breakfast buffet was probably the equivalent of US Hampton Inns - again OK but choices quite limited. Free internet was a plus. Bottom line- you get what you pay for.", "title": "Adequate but not a lot more", "user": "stampwife", "date": "March 19, 2010", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 2.0, "location": 4.0}, "id": 58989021}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Lovely hotel. charming and cosy. Wonderful staff. Since the hotel is located in a very quiet street you enjoy the advantages of the city without its noise. Nicely appointed rooms and you can see that the owner takes pride in maintaining his property. A real find!", "title": "Best in Utrecht", "user": "Karl1965", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 55569579}, {"rating": 4.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Friendly service, speaking in fluent English to answer our questions, going out of their way to be helpful. The room was more than we had expected, well appointed, very clean & the on suite bathroom was a delight to use with a shower that had easy access & a shower head that was for once more than a dribble. The Buffet breakfast was very good well above what we had expected also. The only slight downside was the parking, but the hotel provided a permit for us to use for the on street parking. Will use the Hotel again when we return to Utrecht in a years time. A quite well room friendly hotel which I have already recommended to friends.", "title": "Really enjoyed my stay", "user": "Babadowab", "date": "February 2, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 55032849}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled on business", "text": "stayed at malie hotel for two nights in november 2009. the room was basic and somewhat old-fashioned, but everything from radiator to bathroom appliances and the wireless internet worked perfectly. internet was fast and the signal was good even on the 3rd floor. staff members i encountered were nice and helpful. the hotel is located within a walking distance from a shopping street, but the old central utrecht it is approximately 20min, if a bit longer, walk away.", "title": "very cosy hotel with a noisy rooster in the backyard", "helpfulness": 1, "user": "urmsu888", "date": "December 3, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 50547924}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled on business", "text": "the only minus i encountered as a noisy rooster in a hen cage in the backyard, perhaps in a neighbour's backyard. it woke me up at 6'o'clock and kept going until nine. next time i would perhaps ask a room facing the street, as i assume the quiet sidestreet is less noisy than the keen rooster.", "title": "Good room, friendly staff and great location", "helpfulness": 1, "user": "CulturalAttache", "date": "October 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 46561605}, {"rating": 3.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "The rooms are a little dated.", "title": "An Average Hotel plus a little far", "helpfulness": 1, "user": "tiisai", "date": "January 17, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 93480279}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled solo", "text": "But it is comfortable. They don't have queens size bed so they just put 2 singles together. The bed has wheels so you can kick your spouse away.", "title": "Quiet hotel, do not go there for service but a good night sleep", "helpfulness": 1, "user": "Globewarren", "date": "September 26, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 81085166}, {"rating": 1.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Staff do have friendly smiles.", "title": "Appalling customer service - do not stay with Sandton hotels", "helpfulness": 2, "user": "UKGRA", "date": "April 21, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 62056512}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "The elevator was a bit small.", "title": "Comfortable hotel in nice surroundings", "user": "memberHolland", "date": "April 18, 2010", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 61821388}, {"rating": 4.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "Has free internet which is great.", "title": "Clean and comfortable", "user": "9213olivier", "date": "April 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 61227736}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "i went last week for a short vacation, the hotel is located near the centrum, is very nice and the receptionist are a very pleasant person.", "title": "wonderful hotel", "helpfulness": 2, "user": "giuseppe74bs", "date": "May 7, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 107255664}, {"rating": 4.0, "stay_parameters": "Stayed April 2011", "text": "utrecht is a romantic town very nice and not dangerouse.", "title": "A lovely hotel in the best corner of Utrecht!", "helpfulness": 3, "user": "theodeled", "date": "May 3, 2011", "detail_rating": {"cleanliness": 5.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 106709579}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled with family", "text": "at this hotel you can rent a bike.", "title": "Good Times in Utrecht", "helpfulness": 3, "user": "WillyGDorset", "date": "April 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 105471097}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "the country outside is fantastic , near the hotel there are many restaurant for all the tastes and also supermarket", "title": "Wonderful stay and very friendly, helpful staff!", "helpfulness": 2, "user": "Madel0n", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 104327851}, {"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled solo", "text": "The hotel is situated in a great corner of Utrecht,just 10 min away walk from Janskerkhof and around 15 min from the Dom and the Oudegracht! The room was small but it was very clean and comfortable. Our room was situated close to the back yard which was adorable. At night we felt safe and there was a sweet silence! We didnt use the breakfast or the parking service,so i have no opinion about that. The people at the reception were friendly and smily. They offered to keep our luggages after checking out till we leave Utrecht. The only pain i felt about the hotel is the price for this deluxe room. 541eu for 5 night stay (2 pers) without breakfast it's a lot,isnt it? I hope i helped! Utrecht is perfect!", "title": "watch out for parking", "user": "ela66", "date": "April 1, 2011", "detail_rating": {"service": 2.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 102385171}, {"rating": 3.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "Frequent business traveller. Stayed one night in a third (top) floor room. The room itself was clean, but rather small and felt a bit dark. The free WiFi is good, although for some reason it did not allow me to connect to my office VPN. (FIrewall issue?) The rooms do have air conditioning, which was not working especially well in my room. Check-in was pleasant, and the lady behind the desk was very helpful. The hotel has no restaurant service beyond breakfast, and no mini-bar in the room. So, if you are arriving late it may be good to bring snacks from the airport or train station! I was directed to a grocery store about 10 mins walk away. (Out of the hotel door turn left, at the end of the road left again. Walk about 8 - 10 mins and grocery is on the right side of the road.)", "title": "Clean, functional room with friendly staff", "user": "SW10UK", "date": "July 4, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 4.0, "service": 5.0}, "id": 115023892}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "Spent a weekend in May in this cosy hotel while visiting my daughter who studies in Utrecht. Staff was extremely kind and helpfull, the girl at the reception (never heard any foreigner speak better English) made us a list of must sees and recommended us one of the best restaurants in town: Goesting! Though the hotel might need some redecoration, it is truly a warm place. Loved the garden, too bad it wasn't warm enough to enjoy breakfast outside! I will definite return to this hotel in the future.", "title": "Felt like home", "helpfulness": 1, "user": "Diana2096", "date": "June 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 111799229}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled solo", "text": "I stayed in 2 comparably priced hotels while visiting Utrecht for a conference: the Sandton Malie and NH Centre. Both were the same price, but Sandton Malie was by far the best choice. It's in a charming part of town with a welcoming outdoor aesthetic. The front desk employees are incredibly friendly, helpful, and offer services such as foreign voltage converters and FREE wifi. I arrived from Toronto in the morning and the hotel kindly let me check in early. The room was a little plain and minimal, but very clean and the starkness of the room was overshadowed by the warmth of the employees and the elegant character of the building and surrounding neighbourhood. I had a beautiful view outside my window where I'd awake to birds singing and an opera singer practicing her chords who lived in the building next to me. It was like out of a movie!", "title": "The most hospitable hotel I've stayed in", "helpfulness": 2, "user": "NorthTDot", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 111139527}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "In comparison, the NH had no voltage converters and had the most ridiculous system for wifi, where you only had 30 minutes at a time and you had to sit in the lobby to get it. To purchase it for your room, it was overly expensive. While the hotel was stunningly beautiful, it didn't have the same kind of small inn hospitality that Sandton Malie had. For example, the front desk was friendly but not as accommodating as the Sandton because NH had all the kind of rules and annoying policies that a hotel chain tends to have that smaller inns don't. If you're making a choice between the two hotels, choose Sandton Malie!", "title": "A Rare Pleasure", "helpfulness": 2, "user": "carter0013", "date": "June 2, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 111122277}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled as a couple", "text": "Compared to the hellish hotels in Amsterdam, this spacious, modern, clean and affordable hotel with professional and friendly service was a god-send. Close to downtown, the university, and nightlife, we actually considered staying on extra nights at this hotel and commuting into Amsterdam on subsequent days. In hindsight, we absolutely should have.", "title": "Would def stay again :) shame about the decoration!", "helpfulness": 2, "user": "mouigirl", "date": "May 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 110319599}], "location": {"country": "The Netherlands", "continent": "Europe"}, "stars": 4, "variance": {"poor": 7, "average": 32, "very good": 40, "terrible": 4, "excellent": 32}, "aka": "Malie Hotel Utrecht", "slim_ranking": 0.45, "description": "The centrally located 4- star Sandton Malie Hotel is housed in a stylish 19th century building and is an icon in this leafy district. Behind the façade lies a classic hotel with, at the rear, a surprising town garden and terrace. The 45 rooms have air-conditioning and all modern comforts for both the business and private guest. Internet connections and use are included in the (free) service."}