{"user_rating": 4.0, "review_count": 750, "name": "Malmaison Hotel Edinburgh", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Stayed for one night in the Arthur suite, good large suit with plenty of facilities, we were on a Dinner B&B package, this enables you to choose three courses from a set menu or you can choose from the full Al-a-carte menu and £19.95 is deducted from your total bill, this is what we did. The dinner was excellent and also the breakfast in the morning was good, with plenty of choice and good quality products, with various choices for the cooked side. We found all staff very helpful and pollite.", "title": "Class in a quiet spot of Edinburgh", "user": "ShetlandYelly", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 159507804}, {"rating": 3.0, "title": "No extras and small bed - Suite", "text": "My only complaints all-be-it small was that the shower in the suite was not very powerful and while having a bath in the free standing bath in the main room, you cannot see the television.", "user": "PRCBelfast", "date": "May 2, 2013", "id": 159470468}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Minibar prices are very reasonable with a good stock. There was plenty of free car parking space. The surrounding area is peaceful with plenty of resturants and can be a pleasurable stroll walking by the waterside, with Ocean terminal only 5 mins walk along ocean drive to all the facilities.", "title": "Dull, Dark and Over Priced", "user": "MrsGoonan", "date": "May 2, 2013", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 159451249}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "I stayed here with my partner between 26-28 April 2013 - the building itself from the outside is quite classy, it's right on the harbour and it seems a really upmarket area with nice bars literally 40-50 feet away on the water front.", "title": "Great Hotel", "user": "JohnHunter1980", "date": "May 1, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159335748}, {"rating": 1.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "The hotel itself on the inside:", "title": "Breakfast at this hotel", "helpfulness": 1, "user": "Sfrankling", "date": "April 28, 2013", "detail_rating": {"service": 1.0}, "id": 159066282}, {"rating": 4.0, "stay_parameters": "Stayed May 2013", "text": "Certainly there are lots of positives. The hotel is in a beautiful, historic building and has great design. Rooms are spacious, with complimentary WiFi, well priced mini bar, tea/coffee etc... Breakfast is also very good and well priced. There is free parking right next door. Its not in the most central part of the city, but Leith (the old docks) has a lot of character and there are some nice pubs and restaurants in the area. The problem lay a little with the staff - who were not forthcoming or overly friendly. We struggled in and out with a ton of bags and were never offered assistance. The hotel also bills itself as dog friendly. Although we had a lovely welcome basket and bowl in the room, our dog was not welcomed anywhere else in the hotel. I fully understand that dogs should not be allowed in a restaurant, but to ban them from the bar (of a dog friendly hotel) is not the right message.", "title": "Full of character - patchy service", "user": "Globaladventure", "date": "May 10, 2013", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 3.0, "rooms": 5.0}, "id": 160298214}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled on business", "text": "Free WiFi and parking, excellent. The Leith is an alternate location to the city center. There plenty of excellent restaurants nearby. Ocean terminal is a short (7 minute) walk away.", "title": "Thanks for the free Wifi", "user": "JeddaCath", "date": "May 9, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 160170325}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The decor is funny. The corridors are painted very dark with minimal lighting, making them gloomy dark corridors. There is no view from the room. Only the front facing rooms will have a view. Room was quite big and spacious. Minimal in room amenities, but an iron was good.", "title": "Okay - but not as soon as other Mal Hotels", "helpfulness": 1, "user": "Sarahbell87", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 3.0}, "id": 159910963}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The bathroom faucet was difficult to control and splashed a lot. This hotel gives you huge shower gel and conditioner bottles.", "title": "Nice hotel, lovely location", "helpfulness": 1, "user": "Garydavidson", "date": "May 7, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 159900800}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "The staff was fine, nothing amazing nor bad.", "title": "Great atmosphere", "user": "Adam C", "date": "May 7, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 3.0, "service": 4.0, "rooms": 4.0}, "id": 159892060}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled solo", "text": "I was booked into this hotel for the Ireland vs Scotland 6 nations match. I expected it to be like a cattle mart as the city was packed that weekend. However, I found it to be calm, despite being full, and the staff were not over stretched or rude as can happen on these weekend. In fact they were very polite and friendly.", "title": "What's the story with the CDs!!", "helpfulness": 1, "user": "Irish_Traveller085", "date": "April 2, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 4.0, "location": 3.0}, "id": 7271275, "likes": {"liked": "— The room and surroundings of the hotel", "disliked": "— The pretentiousness"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled solo", "text": "Stayed here for a friends 40th. We were eating at Martin Wishart, which is only a 5 minute walk from the hotel. Stayed in a suite which was nice and big, two TVs, only slight complaint is that the room was slightly dark.", "title": "Nice hotel", "user": "Noel74", "date": "May 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159804359}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "Sunday Brunch is very good.", "title": "What happened?", "user": "Tricia B", "date": "May 5, 2013", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 159730773}, {"rating": 4.0, "title": "Nice hotel and great staff but food a bit pricey", "text": "I booked a one night stay for 2 people in a twin room, okay so it was bank holiday but £153 for one night bed and breakfast? The reason why I booked? I have stayed at this hotel in access of 30 plus times in the past. It has been around 3 years since I last stopped but I was VERY dissapointed! First of all a 3pm check in? That was never that late in the past! I had to beg to be allowed in our room at 2pm as we needed to be out for a meal in town at 3.30pm and needed to get ready!", "user": "roj62", "date": "May 4, 2013", "id": 159630828}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "None of the products in the bathroom you could take home, in the past their has always been a label saying you could, not this time and I was too scared to take them in case i got charged extra!", "title": "Good value, great location", "user": "suek94", "date": "May 3, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 159569770}, {"rating": 3.0, "title": "Not the best Malmaison hotel that I have stayed in!", "text": "It just seems to have lost its luxury feel and I was really let down, I had a better night at a hotel in the Scottish Borders the night before for half the bloody price!", "user": "Lorraine S", "date": "May 3, 2013", "id": 159512660}, {"rating": 5.0, "stay_parameters": "Stayed June 2007", "text": "My brother's wedding reception was held at the Malmaison - and from the moment we arrived to a rolled out red carpet and champagne and whisky we knew we were going to be in for a treat!", "title": "Fantastic hotel", "helpfulness": 1, "user": "Daisyboo1983", "date": "June 17, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7868216, "likes": {"liked": "— Location, fabulous bedroom and the freebies in the bathroom", "disliked": "— That we weren't staying longer"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "We stayed room 118 - a fantastic cornor junior suite looking over the front of the hotel and the water. The four poster bed was enormous and one of the comfiest beds I have ever slept in. The selection of goodies in the bathroom (with a note to say help yourself!) iwas a nice suprise. They included the usual shower gel and shampoo but in full size bottles as well as foot lotion, eye mask, eye gel, breath freshener and body lotion! The shower was amazing too - showerhead was the size of a small pizza with fantastic water pressure - just what you need the morning after your brother's wedding!", "title": "Luxurious Haven", "user": "ericai77", "date": "June 11, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "rooms": 5.0, "location": 4.0}, "id": 7832093, "likes": {"liked": "— The decor and comfort", "disliked": "— I'd be scraping the barrel to find something!"}}, {"rating": 4.0, "stay_parameters": "Stayed May 2007, traveled on business", "text": "We preordered breakfast in bed , a bit annoyed that it was only a continental instead of full Scottish cooked breakfast - but we were not dissapointed when itt arrived!! It came in a huge wicker picnic hamper with cereal, fresh tropical fruit salad, freshly squeezed orange juice, croisant, pain au chocolate, yogurt wth fruit compote and real coffee. What a treat! Even though it was included in our room rate it is definately worth the £12 it normally costs - we were still full at lunchtime and didn't eat till dinner!", "title": "Great value as usual", "user": "Lemniot", "date": "May 9, 2007", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 7571100, "likes": {"liked": "— Great position extremely good value", "disliked": "— The cost of the meals"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled on business", "text": "The hotel is wonderfully located - very close to the Leith Terminal Shopping Centre with restaurants, bars and cinema aswell as all the usual shops. Edinburgh really is only a short taxi drive away.", "title": "Fantastic Staff", "helpfulness": 1, "user": "KM26", "date": "April 20, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 3.0, "rooms": 5.0}, "id": 7402457, "likes": {"liked": "— grerat staff", "disliked": "— out of town"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "Yes, it was a bit expensive, but well worth it if you are visiting for a special occasion or are looking for a wonderful location for your wedding.", "title": "Supurb customer service.", "helpfulness": 2, "user": "orange66", "date": "April 19, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7393219, "likes": {"liked": "— Beautiful location, friendly staff."}}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled with family", "text": "MalMaison has to be my favourite hotel in Edinburgh. I have stayed many a time now and have yet to find a better alternative. The shore in Leith offers everything and it makes The Mal a perfect basefrom which to explore the city. It is very good value for money and only a short taxi or 22 bus ride away from all the best places in town. I would certainly recommend this hotel for anyone considering a city break.", "title": "Favourite Edinburgh hotel.", "user": "DRB1983", "date": "April 24, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 158704160}, {"rating": 2.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "We stayed one night and the service was rude at check in. Breakfast was cold and the room we had breakfast in was not clean. We did request a call from the hotel but despite reminders are still waiting. Worst hotel I have stayed in in Edinburgh", "title": "Nice room - lousy service", "user": "Denyse B", "date": "April 24, 2013", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 158682400}, {"rating": 4.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "We stayed at Malmaison in Edinburgh at the weekend - very very disappointed in the size of the bedroom - it must be the smallest bedroom we have ever stayed in - the chair beside the dressing table could not be fully pulled out as there was not enough room as it was tight against the bed! Bathroom also very small with walk in shower no bath - toilet seat a bit wobbly and no room in bathroom to house your toilet bag as it was so small. Having said that room was clean and fairly modern though was looking as if it could have benefitted from a freshen up decor wise. Overall felt the room was very claustrophobic and could only sit on the bed as there was not enough room for chairs in the room. At first my husband thought there wasnt a wardrobe in the room because it was so small and housed mini bar, ironing board and a minimum number of hangers for clothes. As we paid £120 for bed and breakfast and really felt this was very expensive for the size of room - even as a single room would have found it extremely small. Overall the hotel atmosphere and situation was very good and the staff were fine but not sure if I would use this hotel again.", "title": "Not what we expected for the price!!", "helpfulness": 1, "user": "BJK15", "date": "April 23, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 2.0, "sleep": 3.0, "rooms": 2.0, "location": 3.0}, "id": 158625573}, {"rating": 4.0, "title": "Great Location and simply Fabulous!", "text": "We visit Edinburgh frequently and sometimes are disappointed with some hotels, this weekend The Malmaison in Edinburgh delivered! We live in the country and the reason for staying in Leith is peace and quiet. The staff were amazing, more so we were sitting outside and offered sun protection as it was so sunny and warm, most people forget about the suns strength, would we return, simply the answer is YES.", "user": "Rachel F", "date": "April 21, 2013", "id": 158391963}, {"rating": 3.0, "title": "Windy edinburgh", "text": "Stayed at the malmaison edinburgh for two nights, Wednesday and Thursday. We had booked a standard double room and one nights evening meal with superbreaks. The hotel is in a lovely part of leith on the water front with plenty of parking at the rear. On booking in we were informed that because the hotel was quiet that we could have a superior room at a discounted price.we were told that none of the standard rooms have a view and boy was she right, we were faced with faced with a brick wall. Thought it would have been nice as a goodwill gesture if then hotel had upgraded us being it was quiet. The room itself was quite small but very clean and comfortable although very warm.", "user": "Chris T", "date": "April 20, 2013", "id": 158301125}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "stars": 3, "variance": {"poor": 73, "average": 139, "very good": 277, "terrible": 15, "excellent": 246}, "aka": "Edinburgh Malmaison Hotel", "slim_ranking": 0.547945205479, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}}