{"user_rating": 2.0, "review_count": 36, "name": "Mamore Lodge Hotel", "reviews": [{"rating": 2.0, "title": "Disappointing rooms, fabulous area of Scotland", "text": "Mamore Lodge Hotel is in some of the most beautiful countryside in Scotland. We stayed recently and were disappointed in the quality of the accomodation. The rooms in the hotel are quite run down, although with beautiful views. The hotel itself has a certain eccentric charm and the bar area was cosy.", "helpfulness": 5, "user": "A TripAdvisor user", "date": "June 17, 2005", "id": 3572542}, {"rating": 2.0, "stay_parameters": "Stayed August 2004", "text": "A mix up in bookings meant some of our party had to stay in the annex which is a building across the carpark from the hotel. The annex rooms are damp, generally unclean, especially the bathrooms, with electric heaters which smell of burning when switched on. We also couldn't find smoke alarms in these rooms.", "title": "Very Big Missed Opportunity", "helpfulness": 4, "user": "makennedy", "date": "June 16, 2005", "detail_rating": {"cleanliness": 2.0, "value": 3.0, "rooms": 2.0, "service": 1.0}, "id": 3558786}, {"rating": 5.0, "title": "Traditionally Scottish", "text": "As a group we felt we had stayed in better youth hostels for less money than the annex rooms. The hotel rooms represent better value and quality and are more worthy of their 1* status.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "August 24, 2004", "id": 2491639}, {"rating": 4.0, "title": "What a gem of a hotel!", "text": "This hotel with its situation and passing trade on the west highland way could definitely make more of itself.", "helpfulness": 8, "user": "Shadwala", "date": "September 4, 2003", "id": 1273976}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "This \"hotel\" is the kind that gives Scottish Tourism a bad name. It is set in a beautiful area but even this does not redeem it's very poor standard, especially considering the rates they charge. Park you car there (£3) and visit the area, but book your accommodation at one of the beautiful B&B's that are around Kinlochleven.", "title": "Park but don't stay.", "helpfulness": 3, "user": "Bonnie Jean", "date": "May 22, 2006", "detail_rating": {"cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "service": 2.0}, "id": 5187820}, {"rating": 1.0, "title": "Stay Away!!!", "text": "We have just returned from a one night stay at the Mamore Lodge Hotel and can only describe it as appaling! We paid an extortionate £35 each for a very mediocre room decorated in the early seventies.... This may have been forgivable if we had experiened even the smallest hint of hospitality. Instead the impression was that it was a major inconvienience to have us around (a group of 9) and anything we requested was unreasonable. (Even a request for tap water from the bar and coal for the fire was refused). The only friendly person was the bar man on his first night and we fear he won't last long. Otherwise icy stares and cold clipped responses were the norm from the staff.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "April 24, 2006", "id": 5003931}, {"rating": 1.0, "stay_parameters": "Stayed September 2005", "text": "All in all you get the message - it was incredible that a hotel could treat guests in such an unfriendly and discourteous manner - don't waste your money !", "title": "The worst hotel experience I've ever had!", "helpfulness": 7, "user": "MRP149", "date": "September 19, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3914967}, {"rating": 2.0, "title": "Needs TLC", "text": "This hotel was a stop on our walk on the West Highland Way. We were very hopeful of a pleasaant stay after seeing the hotel's website and location. Unfortunately, on every count this hotel fails.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 20, 2005", "id": 3685266}, {"rating": 2.0, "stay_parameters": "Stayed May 2005", "text": "The room furniture including beds are old and extremely shabby. Our bathroom was dirty and the room very cold. The bedclothes and mattress should, frankly, have been thrown on the tip ages ago.", "title": "In desperate need of care!", "helpfulness": 4, "user": "frostybyte", "date": "June 20, 2005", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "rooms": 1.0, "service": 2.0}, "id": 3581837}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "We love Mamore Lodge - we just returned for our 5th stay after a gap of several years and had a feeling of coming \"home\". The setting is spectacular, the beds are really comfortable with good linen sheets and feather pillows and the room was made lovely and warm with an extra heater for our arrival. The welcome from the friendly owners (and their gorgeous dog Billy) was just as warm and dinners are delicious home-cooking with a good choice of wines. I don't know what some other reviewers expected from a 1 star hotel - this place doesn't promote itself as a luxury establishment and you're not paying luxury rates. We can't wait to return!", "title": "Home from home", "user": "HCowes", "date": "March 29, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 3.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7244916, "likes": {"liked": "— Comfortable and characterful"}}, {"rating": 1.0, "stay_parameters": "Stayed April 2006, traveled with friends", "text": "Terrible. By far our worst hotel experience ever.", "title": "Truly Awful", "helpfulness": 9, "user": "thegrimtruth", "date": "September 18, 2006", "detail_rating": {"front_desk": 1.0, "business": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "location": 5.0, "rooms": 2.0}, "id": 5813339}, {"rating": 4.0, "title": "Quiet & Beautiful", "text": "Our stay was comically bad, but unfortunately not entertaining enough to merit a return to what could be a potentially great hotel until it is in new hands.", "user": "steve&denise", "date": "August 13, 2006", "id": 5604879}, {"rating": 1.0, "title": "Worth it for the view! But you really have to like views a lot!", "text": "The proprietors were unwelcoming and rude. I cannot describe some of the incidents that occured as the posting would be removed. Surfice as to say in my medical opinion I do not think the owners should have a licence to serve alcohol.", "helpfulness": 2, "user": "A TripAdvisor user", "date": "July 16, 2006", "id": 5471212}, {"rating": 1.0, "stay_parameters": "Stayed May 2006", "text": "The warm welcome can be summed up in the manner in which we were firmly told not to put any more coal on the fire 'because it was warm enough already'.", "title": "Wish we'd stayed in a B&B", "helpfulness": 2, "user": "HampshireWat", "date": "June 4, 2006", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 2.0, "service": 3.0}, "id": 5297470}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled as a couple", "text": "We were practically the *only* ones staying in the lodge that night. Apparently others had avoided it after reading the spot-on reviews on this website. Staying at the Mamore was a total nightmare. The owner and his wife were extremely unaccommodating, unwelcoming and totally rude for no apparent reason. Alcohol use there was rampant during our stay and it created a very uncomfortable environment for us. We will NEVER go back there again. Ever.", "title": "the worst in the Highlands", "helpfulness": 4, "user": "silly101", "date": "September 5, 2007", "detail_rating": {"front_desk": 1.0, "service": 1.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 4.0}, "id": 8662366}, {"rating": 1.0, "stay_parameters": "Stayed August 2007, traveled with friends", "text": "Don't stay here! It is a damp,dirty,dark,crumbling wreck of a hotel...only used by walkers who can't find anything else in the area they are passing through.It's a miserable example of Scottish hospitality and totally overpriced..not even a bar of soap provided..don't do it!", "title": "don't stay here!", "helpfulness": 3, "user": "charliechuckles", "date": "August 19, 2007", "detail_rating": {"front_desk": 2.0, "service": 2.0, "cleanliness": 2.0, "value": 1.0, "rooms": 1.0, "location": 5.0}, "id": 8451806, "likes": {"liked": "— location", "disliked": "— damp"}}, {"rating": 1.0, "stay_parameters": "Stayed July 2007, traveled with family", "text": "The long approaching drive is rutted, not maintained, & 1 lane. At the end, ours was the only car there! My cousin & I walked through the front door into a completely dreary, scary Stephen King setting. I immediately asked to cancel the reservation noticing the facility has a 1 star rating from the Scottish Tourist Board!! The stone-faced owner refused -- the reservation was not cancellable. After consulting my other cousin & sister, we decided to brave it out. We were told to \"park anywhere\" (no other guests!!); the rooms were appalling (cheap, sleazy hotel-style & moldy bathroom); we blocked the doors into our rooms when we retired for the night: the price was outrageous & our most expensive for the worst accommodation of our entire trip; and I do NOT recommend it. When we toured north, northwest, south, then to Skye and returned to the Loch Leven area days later, we stayed at one of our best accommodations, very historic, beautiful, & wonderful food for less $ (and just a few kms away from this Lodge!!!). On our 3 week trip, we stayed in wonderful castle-like hotel, a real castle, beautiful B&B's, & lovey guesthouses for less $.", "title": "Do not stay here: it is a Bates motel (ref. the movie Psycho)", "helpfulness": 6, "user": "sister-cousins", "date": "July 17, 2007", "detail_rating": {"front_desk": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "location": 1.0}, "id": 8132232, "likes": {"liked": "— Nothing", "disliked": "— Everything from greeter to facilities to room"}}, {"rating": 2.0, "title": "haunted Mamore Lodge", "text": "How does this place rate 2.5 stars when it should not even rate 1 star? Do not stay here, ever. Avoid this place.", "helpfulness": 1, "user": "cathsm", "date": "June 6, 2007", "id": 7795946}, {"rating": 1.0, "stay_parameters": "Stayed April 2007, traveled with friends", "text": "This place is not the place for faint hearted. Stayed here while walking the West Highland Way. In spite of all other accommodation being fully booked we were the only 3 guests in the hotel.....the only living ones that is!! The spirits are alive and well here and willing to play games!! Things were that bad that we took a taxi into Kinlochleven for our evening meal, only returning at bedtime, then sleeping with bedroom light on!", "title": "Awful hotel", "helpfulness": 7, "user": "Beeza", "date": "May 4, 2007", "detail_rating": {"front_desk": 2.0, "business": 1.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 4.0, "rooms": 1.0}, "id": 7545672, "likes": {"liked": "— the views were nice and the food was passable", "disliked": "— the rooms, the no hot water, the attitude to this of the very wierd staff"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe"}, "variance": {"poor": 7, "average": 2, "very good": 5, "terrible": 18, "excellent": 4}, "aka": "Mamore Hotel Kinlochleven", "slim_ranking": 1.0}