{"user_rating": 3.0, "review_count": 16, "name": "Man-O-War Bay Cottages", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed May 2005, traveled as a couple", "text": "Having read the reviews of the man o war cottages i wanted to stand up for the place i loved so much. I am not the kind of person to revisit somewhere but we had such an amazing Honeymoon in the 'Sugar Shack' that we ended up returning for another 2 weeks.", "title": "this isn't the Hilton - but thats whats great!", "helpfulness": 5, "user": "busastep", "date": "January 9, 2007", "detail_rating": {"front_desk": 4.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 3.0, "location": 5.0}, "id": 6567515, "likes": {"liked": "— its location next to the sea", "disliked": "— leaving"}}, {"rating": 1.0, "title": "Dont stay here", "text": "Sure, this isn't the Hilton. There are no flash swimming pools, there are no 'added extras' as you would see in the sandles brochures, but this is such a beautiful place that the 'added extras' are on your doorsteps. the cottages are simple, they have adequate cooking and bedding facilities but the beach is a second from your door. there are sone really interesting little basic restaurants adn the people are fascinating.", "helpfulness": 6, "user": "A TripAdvisor user", "date": "April 14, 2006", "id": 4973390}, {"rating": 1.0, "stay_parameters": "Stayed May 2003", "text": "Life in Charlottesville is very laid back. It sits on its own at the tip of the Island, a world away from the big touristy areas of the Island. and Manowar has a few cottages to chose from. We stayed in 2 different cottages and yes, there are a few insects, yes there is no air conditioning but you are sat on the edge of the jungle in a tropical island. If you want somewhere to relax, sip carib and eat tasty locally caught fish, this is the place for you. If you like all life's luxuries then head for the other end of the ISland.", "title": "Unbearable place; we left early.", "helpfulness": 5, "user": "Celtic_Tiger_Cub", "date": "June 21, 2005", "detail_rating": {"cleanliness": 1.0, "value": 1.0, "rooms": 1.0, "service": 1.0}, "id": 3598738}, {"rating": 5.0, "title": "Perfect Get Away", "text": "There are a few things you should be aware of. The UK govt has reported an increase in crime on the island so make sure you take care in remote spots. We saw an increase in hassle from some of the locals, but they are just trying to make ends meet. At the end of the day this is a 3rd world country and so long as you approach with care and be polite we didn't encounter any problems. Watch out for the Fruit King - whatever he tells you - he wasn't a friend of David Attenborough and the fruit he sells is rubbish!", "helpfulness": 8, "user": "A TripAdvisor user", "date": "March 1, 2003", "id": 906488}, {"rating": 1.0, "title": "Rough and (not) ready", "text": "There are some lovely people in the village and the staff at the cottages were excellent. they are very laid back, but thats the beauty. They cleaned the cottage every other day and were massively helpfiul in getting us information when we were stranded because of all the Sept 11th air traffic issues.", "user": "A TripAdvisor user", "date": "February 27, 2003", "id": 861827}, {"rating": 5.0, "title": "Man-O War Bay Cottages", "text": "Our stay @ Man-O-War Bay Cottages couldn't have been more enjoyable. The 6 cottages are at the waters edge in a spectacular botanical garden that has evolved over the generations of Turpin family ownership.The cottages are located in the village of Charlottsville and offer an opportunity to interact with the friendly & accomidating residents of the island.All cottages have running water, electricity, a sitting area & kitchen.Most are 2 bedroom.The Turpins will help make reservations for island adventures as well as local cooks to come in and prepare meals for an unbelievable low fee. After a week on the island, I was pressed to spend $100.00 US.The exchange rate was approx. $1 US to $7 TT. Once outside of the metropolitan area of Scarboro, prices were not inflated to bridge the difference in the exchange rate. SCUBA diving was great & the island offeres a multitude of opportunities to hike the rainforest, explore the many waterfalls and visit the numerous historical sites. This little island offeres vast opportunities for sightseeing, adventure and relaxing. GNC", "helpfulness": 13, "user": "A TripAdvisor user", "date": "December 1, 2001", "id": 334052}], "location": {"country": "Caribbean"}, "variance": {"poor": 3, "average": 1, "very good": 5, "terrible": 4, "excellent": 3}, "aka": "Man-O-War Bay Cottages Tobago, Trinidad And Tobago", "slim_ranking": 0.333333333333}