{"user_rating": 4.0, "review_count": 2159, "name": "Manchester Grand Hyatt San Diego", "reviews": [{"rating": 5.0, "title": "Great stay....again!", "text": "Once again I stayed at this great hotel. The room itself was a bit dated, unlike my previous stay. What makes this place great is the staff. From check in, house keeping, restaurant staff to operators, everyone is very professional and went out of their way to make the stay wonderful. I had just stayed here last month for business and went back for a mini vacation. I will be returning again soon. My only complaint once again is the lack of free wi-fi. They should have areas of the hotel where you can get free wi-fi to check emails, etc...", "user": "Lawin4cr", "date": "April 24, 2012", "id": 128548689}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "Stayed two days in March for a corporate event. The room was OK but didn't reflect the price they charge, the halls could use a revamp as well as the carpeting on the room itself.", "title": "Bad price/quality ratio.", "user": "Gerardo A", "date": "April 24, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 128546207}, {"rating": 2.0, "title": "Much to expensive for what you get", "text": "Be careful with the tempting water bottle they leave by the big screen LCD TV, it has a nice paper tag that says \"Refreshing\" and you may miss the $5 price tag written in a considerably smaller type below it.", "user": "selsrog", "date": "April 24, 2012", "id": 128522869}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled solo", "text": "On the other hand the front desk people were the most helpful i've ever seen, the halls and the lobby architecture is quite impressive.", "title": "Great views from this hotel", "user": "Globalcitizen118", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128473545}, {"rating": 3.0, "title": "Nice but expensive", "text": "The hotel is at walking distance of Gaslamp District and USS Midway. I recommend visiting the bar at the 40th just for the awesome city views that its windows give you, be warned that drinks up there can be quite expensive...", "user": "Wanderer2662", "date": "April 23, 2012", "id": 128450596}, {"rating": 5.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Stayed here for a conference that was held in the hotel. Great room, excellent staff, clean, beautiful views, nice pool area. Highly recommend this place. Only negative is that you have to pay for wireless internet.", "title": "What a view", "user": "Lawin4cr", "date": "February 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 124226008}, {"rating": 4.0, "stay_parameters": "Stayed July 2011", "text": "We came for the 4th of July. I liked the proximity to Seaport Village and the harbor. I didnt like the cost of the valet parking! We did have fun at the 4th floor pool, outside bars, and overlooking the harbor where we roasted marshmellows and viewed the fireworks.. Overall, pretty nice!", "title": "Had fun, but just above average for a big name hotel.", "user": "Sawdoff", "date": "February 6, 2012", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 4.0, "rooms": 3.0}, "id": 124183439}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "The staff at the hotel is very friendly. The concierge is the most helpful of any hotel I have stayed at. It was also nice to not feel like everything that everybody did for me was for a tip. I never felt like a tip was expected, not even when the bellman loaded my suitcase into the taxi. Every time I met a staff member in the hallway, they smiled and asked how my day was. The breakfast buffet was exceptional and they had different specials each day so it wasn't the exact same thing from one day to the next.", "title": "Great Hotel", "helpfulness": 1, "user": "AdvntrSkr_11", "date": "February 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 124170243}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "I stayed here with family over the Christmas holidays and overall it was a really great choice to explore the city and surrounding beach communities. The pool deck is truly spectacular with amazing views of the harbour and downtown San Diego - go for a late night jacuzzi or hang around the fire pits if it's cold. There's also a really nice gym that also overlooks the harbour and the chilled Eucalyptus towels were a nice touch. The rooms were nice, don't get me wrong, however they didn't really meet that \"Wow!\" Hyatt quality I typically expect from this chain. Also, beware of everything in your room which is chargeable - there were water bottles to welcome us and the \"$5 each\" was printed in such small font that I didn't even realize they weren't complimentary until the next morning.", "title": "Everything very nice, but not quite \"Hyatt-nice\"", "user": "Jetsetter977", "date": "February 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 124161409}, {"rating": 4.0, "title": "Wonderful Hotel!", "text": "The location is really good - you can easily walk to Seaport Village, the Fish Market, and all the downtown night spots. Coronado is a quick 10 minute drive.", "user": "funinvegas99", "date": "February 3, 2012", "id": 124083430}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "Very large, convention hotel in a grea location. Tons to do around the area. Very nice views from all the rooms. We got a great rate that included 2 breakfasts, which were solid.", "title": "Nice hotel in fantastic location. Got a great rate.", "user": "Ottom10", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124076235}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "Went to a meeting here. The rooms were nice, great location to visit San Diego. Right on the water beautiful view. My only complaint is the wireless service is SLOW!", "title": "Great location, nice rooms", "user": "KXB_08", "date": "February 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 124047117}, {"rating": 5.0, "stay_parameters": "Stayed January 2012", "text": "Location can't be beat. Right by Seaport Village walk able to Gaslamp, Petco Park, USS Midway, etc. nice path to run on by the shore right outside the hotel! Only complaint is that the walls in the room were thin. I heard the person next door emptying their closet and moving hangers at 4 am and heard them get ready after that.", "title": "Excellent location", "user": "SJS1972", "date": "February 2, 2012", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 124035788}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "The one-word title of this review pretty much sums it up. The location is great, the lobby is beautiful, the pool area is very nice, but... our room was just OK. For a Grand Hyatt, it didn't even match our room at the Hyatt Place in Mesa AZ (the lower end of the chain). The view from the room was fantastic and walking from the hotel to the gas lamp district and to the boardwalk(?) is very convenient, but the room felt just a tad tired. The concierges (we enlisted the service of 2) were very friendly and knowledgeable, but the service at the top-floor bar was disappointing. If you looked beyond the lobby and the location, you'd probably be a little disappointed. So all-in-all, an inconsistent experience.", "title": "Inconsistent", "user": "DBalestri", "date": "February 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 124024264}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "I really love this hotel! I have stayed 5 times in January for a conference so I cannot really comment on the room rates, but this hotel is impeccably kept and it's location close to Seaport Village is really wonderful. The pool area is nice and the service overall is very good. I would definitely stay here with my own family given the opportunity. One small drawback of this hotel is that it is close to a train and on occasion I was woken by the gate bells at the rail crossing ringing for what seemed like an eternity.", "title": "Good Location", "helpfulness": 1, "user": "MomOfEMM", "date": "February 1, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 123994035}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The Manchester Grand Hyatt is a large hotel perfectly situated on the waterfront in San Diego Bay, a stone's throw from the Seaport Village shopping/dining area. The hotel has two towers, a parking garage, restaurants, health club, pool, tennis, convention area...basically everything you'd ever want in a full-service hotel. The rooms were big and well appointed, you can call room service and get incidentals delivered to the room for free, and everything went off without a hitch. Okay, two minor hitches. Online check-out didn't work, but they did have a checkout kiosk in the lobby which was fast and efficient. And there's a railroad crossing across from the hotel, so whenever a train goes by bells go off as the gates come down to stop traffic. So, I'd ask for the side of the hotel facing the bay rather than the city. Other than that, the Grand Hyatt was pretty flawless. I had dinner at the bar one night and the food was excellent. However, considering how close you are to waterfront dining and the Gaslamp district, I'd recommend hitting the streets.", "title": "Boutique hotel, hidden gem (JK)", "user": "nealwBoston", "date": "August 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 170917778}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "The hotel was nice, staff was very friendly. The rooms where cleaned adequately but haphazardly. Did not refresh things in the room as they should and floors in bathroom not as clean as they should have been. The views where awesome looking over the bay and the navy ships. Enjoyed the stay.", "title": "Avg rooms, great veiws", "user": "terryg517", "date": "August 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 170769466}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Stayed here July 28-Aug 1, upscale hotel, tons of amenities. Rooms very clean, furnishings well cared for, bathroom first class.", "title": "First Class Stay", "user": "TrvAll123", "date": "August 4, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170756750}, {"rating": 4.0, "stay_parameters": "Stayed August 2013", "text": "Restaurant options very good, 40 Floor Top of Hyatt views are awesome.", "title": "Not much to write home about", "user": "Diana B", "date": "August 4, 2013", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 170706553}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled with family", "text": "Definte recommendation!", "title": "Best hotel location in the Seaport Village/Marina/Gas Lamp district", "helpfulness": 2, "user": "Leah H", "date": "August 3, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 170525200}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled as a couple", "text": "Almost every room in this very large and beautiful hotel has a partial city and partial view of the bay. There is tons of shopping and food VERY close to the hotel. There were several tours available too (USS Midway, trolley rides, water cruises, etc.) and are a short walking distance from the hotel. The naval base is right across the bay so it was cool to see battleships, blackhawk helicopters and aircraft carriers. The check-in process was great. I stayed at the Hyatt for a very large conference and the line for check-in was quite long. I expected to be in line for a better part of an hour. To my surprise, this line moved VERY quickly. They easily checked in 20+ people ahead of me in less than 10 minutes! I was very impressed. The staff were very courteous and happy to help in any way they could. The rooms are very modern and the window coverings were easily opened to let in tons of light or closed to completely black out the room. Great job Manchester Grand Hyatt! Keep up the great work!", "title": "Great hotel and great location", "helpfulness": 1, "user": "camandshelly", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170510697}, {"rating": 2.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "I recently stayed at this hotel as it was the venue for an event I was attending. Overall, I found the hotel to be very disappointing, and I would not recommend it. Some reasons:", "title": "What Tier Hotel Is This?", "user": "falconsview", "date": "August 2, 2013", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 3.0}, "id": 170500343}, {"rating": 5.0, "stay_parameters": "Stayed June 2013, traveled as a couple", "text": "1) The rooms weren't particularly clean. The housekeeping staff was very inconsistent. I had washcloths the first day, but once I had used them up, I never got any more. Random hairs and soap residue in the bathroom. When I first arrived, I knelt on one of the chairs by the window, only to feel wet seeping through the knee of my pants. It smelled strongly of window cleaner, which had apparently spilled.", "title": "Best Hotel and Location in San Diego", "helpfulness": 2, "user": "Debbie G", "date": "August 2, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170463473}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "2) Expensive \"extras\" (like water, Nyquil, etc.). Nearest CVS is 6-8 blocks away. There's really nothing overly close - you have to walk up to the Gaslamp district to find less touristy restaurants, etc.", "title": "One of the best hotels on the bay!", "user": "Jestupinan", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170224195}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "3) Poor follow-through on emailing bill - requiring me to call and ask for it to be sent once I arrived home. I got put on hold for 5 minutes in the process to boot. Always enjoyable after a long day of flying.", "title": "Much to love, but...", "helpfulness": 2, "user": "mojoWashingtonDC", "date": "July 31, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170162462}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "This is the second time I've stayed here for a business meeting. Nice big room with a great view (ask for a water view). Service is very friendly. Really like the lounge on the top floor of one of the towers with the skyline view. One of the nicest outdoor pool areas. Food served at our meetings was especially tasty. Nice amenities overall. Only thing I did not like is you still have to pay to use the internet when in your room. Location could not be any more convenient. Easy walking distance to restaurants, shops, the convention center, the waterfront and of course, the Gaslamp District.", "title": "Great accommodations, great location", "user": "nmsmaine", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 170053577}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Super location, within walking distance of numerous restaurants. Beautiful views. Clean, modern rooms. Staff are courteous and well-trained. Meeting rooms are very conveniently located. Breakfast buffet, although pricey, has nice variety.", "title": "Great spot for a conference!", "user": "Tami A", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 170046410}, {"rating": 5.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Had an opportunity to spend several days at the Manchester Grand Hyatt in San Diego. The rooms were very nice and comfortable. Had a great view. The food was excellent and all the staff were friendly and helpful. I would highly recommend this hotel.", "title": "Great view; great comfort", "user": "Deborah G", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169916991}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "We were in this hotel for only one night and have stayed in other hotels in the area. I loved walking out the hotel to Seaport Village. The staff at the front desk were excellent. Our room was a AAA deal and still had a wonderful view of the harbor. We also got breakfast with the room and buffet was quite good. My only complaints were the mattress was really hard and do expect some waits at the elevator. We'd definitely would stay here again when we visit San Diego.", "title": "Great Location", "user": "Carol4travel", "date": "July 30, 2013", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 169898815}, {"rating": 4.0, "stay_parameters": "Stayed July 2013, traveled on business", "text": "Been three years since my last visit. The staff still makes this a gem. Arrived early -- like 6 hours before checkin. But they found us a room (helped for this to be the week after Comic-Con) and, in short order, also replaced the feather bedding as we requested. No matter where you went in the place, the staff were solicitous. Lael's was a great place to have a buffet breakfast. BUT, the hotel needs to update its in-room and other handouts that suggest it serves dinner and other meals -- it doesn't. Redfield's Deli is great for a quick takeout breakfast, sandwich, coffee or snack. However, Redfield's sports bar leaves something to be desired -- understaffed and the menu is, well, scattered and only fair. I like pulled pork, but served with vapid plate of chips for $14 is, well, outlandish. Rooms are comfy, and clean.", "title": "Kudos to staff; a few fixes needed", "helpfulness": 1, "user": "Coastguy", "date": "July 29, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 169774672}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We used to stay at this hotel and stopped because the service had become fair at best. We gave it a 2nd try recently after a few years of not staying there, and EVERYTHING was fantastic! The front desk clerk was overly accommodating, the room service was on time, food was very good, and the attendants were professional, the bellman was over-the-top friendly and took extra time and care to assure us our bags would be safe while being stored; on checkout day, an e-mail was sent to us with a barcode in it that allowed us to quickly check out by scanning it at a kiosk...it was so easy! No waiting in line for the front desk, just to check out! We will definitely stay there again. Someone has done a terrific job instilling \"customer service\" in the staff and it shows in every interaction. In addition, our suite was clean, ready, and beautiful!", "title": "So Impressed!", "user": "D H", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127742699}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "Just returned from a 5 night stay over spring break with my wife and 7 year old daughter. First off the hotel is in a great location near downtown and the is bayfront with access to all the great areas nearby. You can easily walk to the Midway and ferry access to Coronado. We loved Seaport Village out the back door. It has something for everyone and is a great place to people watch, shop, or grab some food. As for the hotel, the lobby is great and makes a nice first impression. Every staff member we dealt with was very helpful and friendly. The breakfast buffett was excellent but if it hadn't been included in our room rate I'm not sure we would have spent the money to eat there. It was over $50 a day for 2 adults and a child, but as I said it was excellent. It is expensive to eat almost anywhere in downtown S.D. so factor that into your stay.", "title": "Great location and great staff.", "helpfulness": 1, "user": "NorcalTraveler", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 127736309}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I would have given 5 stars if the rooms would have had 2 queens instead of doubles, but the beds were comfortable and the rooms were clean. Maid service was a little slow a couple days, but we were there over Easter, so that may have had something to do with it. The water pressure in the shower was the best I have ever experienced anywhere. Hopefully when the upcoming remodel is done, they will get rid of the double beds and bring in some queens. I think the fact that they have alot of business travelers probably accounts for the doubles but it is not ideal for families.", "title": "Manchester Grand Hyatt & Downtown San Diego", "user": "Chris R", "date": "April 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127663521}, {"rating": 3.0, "stay_parameters": "Stayed March 2012, traveled as a couple", "text": "Even with the bed situation, hopefully fixed soon, I would return. We loved the location and nearby activities, and the friendly staff. As for the noise mentioned by other reviewers, it's downtown and all the other hotels have the same problem I'm sure.", "title": "Pros & cons - great location!", "helpfulness": 2, "user": "KTolOttawa", "date": "April 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 2.0, "sleep": 2.0, "rooms": 3.0, "location": 5.0}, "id": 127639197}, {"rating": 3.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Recently spent 5 days at the above facility at a business conference. What a great location & facility on the water & within easy walking distance of downtown San Diego & the gaslamp district. We were equally impressed with the staff and service at the Grand Hyatt. Downtown San Diego has lots to offer with shops and a multitude of restaurants. We also felt very safe walking everywhere and how clean and new everyting seemed.", "title": "came for business...felt like business environment", "user": "k2escott", "date": "April 10, 2012", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127634297}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "We stayed here on the last leg of our trip to California. We thought the hotel lobby was beautiful, and the front desk staff was extremely friendly and helpful. Rooms were spacious and clean...newly updated. The breakfast buffet was pricey, but SO worth it. Everything was fresh and delicious! Hotel location was a plus. We had dinner at the Fish Market and lunch at a little greek restaurant in Sea Port Village, both within walking distance. Loved being so close to the water.", "title": "Great Hotel....Even Better Location!", "helpfulness": 1, "user": "sdl99", "date": "August 9, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171523915}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "I stayed at the Manchester for three nights while attending GBTA conference.", "title": "Nice, but too pricey for what you get", "user": "travelermundo", "date": "August 9, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 171491565}, {"rating": 5.0, "stay_parameters": "Stayed August 2013, traveled with family", "text": "The hotel is nice and grandeur with its two massive towers. Its prime location to the convention center, Gaslamp district and on the water, makes it an ideal place to stay.", "title": "Lots to do!", "helpfulness": 2, "user": "Teadro", "date": "August 8, 2013", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 171361519}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled as a couple", "text": "My king bedded room was a good size with ample closet space which included an executive desk and a small couch. There were also ample electric outlets to plug and charge all devices.", "title": "Very Nice Hotel", "helpfulness": 1, "user": "Anthony M", "date": "August 6, 2013", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 171048366}, {"rating": 4.0, "stay_parameters": "Stayed August 2013, traveled on business", "text": "There was a small coffee maker with free coffee and a small fridge. (no mini bar)", "title": "Good for Conventions", "user": "Smorris18", "date": "August 5, 2013", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 170929121}, {"rating": 5.0, "stay_parameters": "Stayed April 2012", "text": "Loved the hotel & room. I was worried after reading some reviews that the rooms would be old - but to my family's delight they were spotless & very nice. I had a corner room which was the perfect size for a family with 2 teens. Perfect location in the middle of everything- only drawback would be the noisy trains, however, they don't pass every night.", "title": "Great stay at the Hyatt", "user": "ArtMom13", "date": "April 15, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 127898700}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "My kids LOVED this hotel!", "title": "great hotel", "helpfulness": 1, "user": "ruchi527", "date": "April 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 127792908}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "pros: comfortable and spacious room, wonderful location, right by bay, GREAT gym, has tennis courts!, great staff, trolley station is right across the street, can walk to gas lamp district, has taxi line right in front", "title": "Nice place for business or vacation", "user": "getmeoutofthistown", "date": "April 13, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 127780999}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "cons: $$ ($275-300/night), mostly for business and people going to convention center (hotel is not hip), pricey parking", "title": "Central to Everything Great in San Diego", "user": "TeamMama2", "date": "April 12, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 127753493}, {"rating": 2.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Overall: if you have the money, definitely consider staying here! I stayed here on a business trip but will be trying another hotel when i come for vacation next month.", "title": "Aesthetically nice, but very poor management and staff", "user": "ProfessorOnzaga", "date": "April 12, 2012", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 2.0, "sleep": 4.0, "rooms": 2.0, "location": 5.0}, "id": 127744355}, {"rating": 2.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I must say I was sorely disappointed in this property. I was supposed to be headed to Palm Desert for the lovely Hyatt Grand Champion Resort, but had to change plans last minute with two teenagers looking for a getaway. I had to eat the cancellation for the desert property so I booked online at Hotwire...THANK GOODNESS I didn't pay a rack rate or even a AAA rate for this place. The lobby is grand (in size), but the guest rooms are tired, tired, tired...just like I feel today after trying to sleep in this place. I can even look past that knowing a renovation is on the horizon.", "title": "Only Saving Grace is the Location..Definitely not a Grand Hyatt", "user": "LizaA_12", "date": "January 31, 2012", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 3.0, "sleep": 1.0, "rooms": 1.0, "location": 4.0}, "id": 123925345}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The worst part is the lack of sound insulation between guest room walls. As I mentioned, I was traveling with two teenage girls. Not only did we get to hear the evening telephone conversation of the gentleman next door (he was on speaker phone) and the pacing of the guests above us, but we were all abruptly awakened at 1:42 am to the sound of intimate activity in the room next to ours - very loud and continuous intimate activity. This continued until 3:30am and then we were treated to the sound of the pair's showering. Again, the lack of sound-proofing her is atrocious. The staff should forewarn conventioneers that anything they say or do will be heard by their neighbors.", "title": "Good Service", "user": "Sheridan C", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 123889925}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "If you have a business convention here or want to be next to the touristy Seaport Village, then go for it. If you want a good night's sleep - forget it. We won't be returning.", "title": "A Beautiful Facility", "helpfulness": 1, "user": "happytravelerUpland", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123843554}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "Stayed at this hotel with my husband from January 11-15, 2012. I was there for a work function, hubby was traveling with me.", "title": "Stay at the Hyatt", "user": "kbeejay", "date": "January 30, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123833552}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "Check in quick and easy. Got a smoking room like we requested. Spent one night in our room with two double beds and asked to moved to a room with a king bed. Staff moved our luggage for us while we out touring around town.", "title": "Nothing Better in Southern California", "user": "superman622", "date": "January 27, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123699308}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "If you like to work out when you travel, this gym will NOT dissapoint. The restaurants onsite are ok, but pricy. There are tons of little shops and restaurants just outside the back door if you want to get out and enjoy the weather. Sally's makes some of the most mind-blowing sushi I've ever experienced.", "title": "Great location, amazing gym.", "helpfulness": 1, "user": "jasonbulger", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 128410448}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "Stayed 6 nights while my husband was at a nearby conference. Really enjoyed it.", "title": "Lovely hotel", "user": "SydneyBeaches", "date": "April 23, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 4.0}, "id": 128368049}, {"rating": 1.0, "stay_parameters": "Stayed April 2012, traveled with family", "text": "We were on the 14th floor of the Harbor Tower overlooking the pool, views were amazing.", "title": "Ruined our trip to San Diego", "user": "TravelinCari", "date": "April 22, 2012", "detail_rating": {"service": 2.0, "cleanliness": 2.0, "value": 2.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 128365659}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "The freight trains were noisy but it would only be for a few minutes once or twice in the night and then I'd fall asleep again. I'm sure it would be the same from all the nearby hotels.", "title": "Business", "user": "T C", "date": "April 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 128352729}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled on business", "text": "It was a standard hotel room, perhaps a little tired but the rest of the hotel made up for it. The whole experience was a positive one.", "title": "Very nice on all counts", "user": "exeter95", "date": "April 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 128163026}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "An absolutely fantastic stay! This hotel is huge & situated right next to Seaport Village and right by the waterside. With it's distictictive roof design, the Twin Towers of the Grand Hyatt are landmarks of the San Diego skyline.", "title": "An excellent stay!", "helpfulness": 3, "user": "Gow69", "date": "January 26, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 123648744}, {"rating": 3.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "The decor may be a little older in style, and not as modern and hip as other hotels, but the hotel makes up for this with its superb levels of service and hospitality. With beautiful views of Coronado Island and the ocean, it is the perfect location for holiday makers and business travellers.", "title": "HUGE hotel. I think you pay mostly for the view and location :/", "helpfulness": 1, "user": "LMBlancaflor", "date": "January 24, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 123557144}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled as a couple", "text": "Situated 2 minutes walk from the convention centre, 7 minutes walk from the Gaslamp District and about 7 minutes walk to the USS Midway Museum. The rooms are a good size & very comfortable indeed. We stayed in one the Club Room/suites which have lots of extras thrown in. Breakfast at Lael's was something else! A real variety and catering for the health conscious and the not so health conscious. If breakfast is included in your package indulge in the Grand Breakfast buffet....no limit to how much you can eat! Breakfast filled us up for the whole day, certainly until evening hors d'oeuvres. Sally's Seafood restaurant is next to Lael's and has a great menu. From Sushi to the more traditional. Their Fish & Chips are famous, and definitely worth a try, as are their crab cakes! If you have be over-indulged, then take a leisurely stroll along the waterfront! For those fitness lovers, the hotel has a 24 hour gym and 2 swimming pools, and a great hot tub. Getting around is easy, there is a taxi rank outside, and if you hire a car there is a car park on sight, and depending on your package the parking may be included. If you want to hire a car, there is a Hertz Vehicle rental on site. Should you wish to be driven, the Concierge service will arrange that for you. Public transport is easy too. Their is a trolley (tram) stop on the otherside of the road, directly behind the Kansas City Grill, where the \"Great Balls of Fire\" Scene from \"Top Gun\" was filmed!", "title": "Great location and staff", "helpfulness": 1, "user": "Faydra2010", "date": "January 22, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 123471931}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "The hotel has everything you need.. well besides quick food service :). There are some places right outside the side doors that have great breakfasts, lunches, coffee etc.. there is even a Ben and Jerrys. The hotel is more of a \"resort\" type feel as it is HUGE. You can easily get lost in here. Our room wasn't very \"luxurious\" which was a bummer because we paid $238 for the room. The last time we paid that was at the W in downtown New York. There we had location AND luxury. Its a great hotel if you want easy access to get around and have a rental car. It was fun although I would stay here with my family.. not just my spouse.", "title": "Good hotel with great service", "helpfulness": 1, "user": "Aga S", "date": "January 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123455182}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Stayed at the hotel for 5 nights, because it is so big and so close to the convention centre we expected it to be crazy and busy. We were pleasantly surprised - it is big but gives you a very welcoming experience. Staff at reception desk and at the front door are great, very helpful and take the time to give you recommendations. The location of the hotel is great, we were able to walk most places. Restaurants were good, service all around good. Take the elevator to the top for a drink! We would stay again and would recommend it. We enjoyed our stay in San Diego.", "title": "Nice hotel for a good price", "helpfulness": 2, "user": "James W", "date": "January 20, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 123338345}], "location": {"country": "United States"}, "stars": 4, "variance": {"poor": 118, "average": 301, "very good": 777, "terrible": 88, "excellent": 875}, "aka": "Manchester Grand Hyatt San Diego Hotel", "slim_ranking": 0.19557195572, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}, "description": "Under new ownership. The Manchester Grand Hyatt San Diego is the ultimate waterfront urban hotel and spa and largest waterfront building on the West Coast rising high on the magnificent San Diego Bay. Panoramic bay and city views welcome you in all of our 1628 newly renovated guestrooms including 76 suites. A 25,000 sq/ft roof top pool deck overlooks San Diego Bay and has 2-whirl pools, a pool bar, cabanas, fire pit and stage area. The Grand lobby is filled with marble, brass, dark stained woods and several grand paintings all lit naturally by 3 stories of windows, which look out over a massive 5 lane porte cochere giving the guest a sense of arrival not seen outside of Las Vegas. The hotel has two marina-view restaurants, a sky lounge, a lobby bar, coffee house, a deli and a new upscale lounge/restaurant featuring specialty martinis, mojitos and California cuisine. The hotel has 125,000 sq/ft of meeting space, featuring a 34,000 sq/ft exhibit hall, a 30,000 & 25,000 sq/ft ballrooms next to each other, a 10,000 sq/ft Jr Ballroom and 41 meeting rooms and 45 conference suites.Note: The StayFit Gym will be closed for renovations beginning November 25, 2013 and reopening in February 2013. Please visit our Concierge Desk in the Lobby for running maps and alternate gym options."}