{"user_rating": 5.0, "review_count": 2313, "name": "Mandarin Oriental, Las Vegas", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "There is only one word to describe this hotel, that is Excellent. The staff is great, the rooms are beautiful and very functional, the resturant was also very good. The hotel has no casino, so it is pretty quiet, but peaceful. The location is right in the City Center, so a short walk or tram ride gets you to other casinos. Our room was a corner suite,and the views were great, but all the rooms seemed to have views and were a nice size. The technology in the rooms is also amazing, everything can be operated by the remote on the TV. This is a small hotel by Las Vegas standards, approx 400 room, so the service and attention is I think much better.", "title": "Excellent", "helpfulness": 2, "user": "Flyerno.one", "date": "May 20, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161246021}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "As a person who has traditionally shunned the over-the-top sensory overload that Vegas represents, one could not typically spend more than a couple of days on the strip. However, we have discovered the MOLV and it truly takes the Vegas experience to another level - now we WANT to come back to Vegas and will ONLY ever stay at the MOLV. Here are some highlights - little things that make the difference:", "title": "Makes a Non-Vegas Person want to Visit Vegas", "helpfulness": 5, "user": "SpaJunky", "date": "May 19, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161159297}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "1) They way the staff all present items to you with both hands and a slight bow. Respectful without being awkward.", "title": "Amazing First Class Service from every staff member...", "helpfulness": 2, "user": "agbowden", "date": "May 18, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161114107}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "2) The way the front desk and doormen address you by name. Welcome back!", "title": "Simply the Best!!", "helpfulness": 1, "user": "TK26_12", "date": "May 16, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160933758}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "3) The fact that EVERY staff member from concierge to housekeeping greet you in a discreet, warm, welcoming manner as they pass you in the hall.", "title": "High Tea @ The Mandarin Oriental-FABULOUS", "helpfulness": 6, "user": "CoLor349", "date": "May 15, 2013", "detail_rating": {"value": 5.0, "location": 5.0, "service": 5.0}, "id": 160831992}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed at the Mandarin for two evenings. The lobby, room, and overall aesthetics are gorgeous. The room was very modern with very clever technology included. I read a few reviews about the glass window into the bathroom - just a tip, there is a screen that slides over the glass. I do agree that it is still not a private enough, even with a spouse, but it was really beautiful. I liked that everything you would need could be found in various compartments throughout the room - extra pillows and blankets in a beautiful box, etc. Despite the beauty, our first day at the pool had a major impact on our entire experience. The pool was highly understaffed and those that were there (with the exception of one gentleman) would disappear or avoid eye contact at all cost. We had to hunt down somebody to request a lunch menu. When we placed our lunch order (after another round of hunting), our drinks arrived after half an hour. After an hour passed, I went to the desk to inquire about our lunch and was dodged several times. After an hour and a half, our lunch order - one sandwich and one salad - arrived. Yes, it took an hour and a half to receive a $75 lunch that would take about 15 minutes to prepare. We were offered nothing as an apology. We heard all of the visitors around us having similar experiences. We decided to purchase nothing else at the hotel throughout the rest of our stay. On another note, there were several visitors on both days that did not appear to be hotel guests. The hotel needs to do a better job of ensuring all pool guests are hotel guests - we never had to verify proof of our stay or a room key. With a small pool size as the Mandarin offers, they need to be a bit more careful with security - there are a limited number of seats. Overall, the hotel is beautiful but I will go back to the Four Seasons for the service - the Mandarin is not there yet.", "title": "Pretty Hotel with Service Issues", "helpfulness": 1, "user": "freqtrav88", "date": "April 25, 2011", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 2.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105506881}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The Mandarin Las Vegas is not a casino hotel and that's why I selected it over other hotels in Vegas. It is a very nice hotel with numerous amenities and a full scale spa. My room had a panoramic view of the strip and downtown, the bathroom had separate tub and shower. The food was very good, room service good and the staff very impressive. The room rate was a bit high, especially compared to the other hotels in Vegas. But, it is extremely quiet, elegant and has nice views.", "title": "Elegant Alternative to Crowded Casino Hotels", "user": "TravelWarriors", "date": "April 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 105468358}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "Visited for a mini-vacation and winter splurge this past January. We'd wandered into the Mandarin during a prior visit to Las Vegas and had been awed by the tranquility of its non-casino oasis and had greatly anticipated our stay here. The amenities, room and especially the spa all lived up to our expectations. If we hadn't had reservations for dinner and a show, I would have gladly moved into the spa and not ever left. I enjoyed an amazing Oriental massage and signature foot treatment and then soaked for what felt like hours while overlooking the Strip. My husband (usually not a Spa visitor) is still raving about the spa four months later and can't wait to go back.", "title": "Truly incredible spa experience, rest of service a bit spotty", "user": "SDHapahaole", "date": "April 24, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105313559}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "My only real concern regarded the spotty service we received throughout our stay. The property obviously prides itself on excellent service - the Spa employees, doormen, room service, housekeeping, all lived up to this and perhaps even exceeded expectations. The bar, however, was abysmal. It was not a busy evening and after being shown to a table, our friends and I were completely ignored. After we hailed a waitress, our order was taken and 20 minutes later no drinks arrived. We tracked down a manager who apologized, but then still no drinks for over 10 minutes and then no apology when they finally arrived. The waitress then had the nerve to confront us about the small tip we left stating that it wasn't her fault... Maybe just an isolated experience or bad night for that particular server, but from this level of property, I expect more.", "title": "Bliss", "user": "Whytex", "date": "April 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 105210606}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "We then had a similar off-putting experience when checking out which admittedly marred our Zen experience. On arrival we had been upgraded to a suite as the property was clearly not overly full. On checkout, however, we were charged not only for the upgrade but at the level of the suite accommodate above the one in which we'd stayed! It took a request to see the manager and then extensive explaining including production of our email confirmation for the original booking for this to be rectified. Our bill was finally settled to the initially agreed upon amount, however, it was disappointing to have to haggle upon departure. Given the number of other properties available in Vegas, for or next trip we will consider staying elsewhere and returning to the Spa at the Mandarin as day visitors.", "title": "Simply the best.", "user": "maktruk", "date": "April 23, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 105122560}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled with friends", "text": "I just came back from staying at the Mandarin Oriental in Vegas and it truly was a great experience. The service is top notch and you can tell everyone works as a team, as all employees seem genuinely friendly and happy to be working there.", "title": "Relaxation At Its Best", "user": "drw68", "date": "April 4, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 3.0}, "id": 102832820}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled with family", "text": "There are a few suggestions, and comments that I would like to convey and why I didn't rate it excellent vs very good overall. 1. Upon arrival- at approx 2pm- we went to the pool area only to be told incessantly that the pool would be closing at 3pm for a private event. It was quite annoying and I think a major inconvenience for guests as it was packed. I totally understand and appreciate that the hotel needs to make revenue but they should consider clearing out an entire area to set up for a dinner that looked like only for 60 guests from what I could see may not be worth it. Also we left the area at 3pm and went to our rooms and the other guests did not leave until 4pm for after. As I said major inconvenience and maybe can be handled in a different manner like sectioning off an area until the last possilbe moment?? Also the last day the pool was shut down to high winds so we really got penalized coming and going.", "title": "Wonderful Service Experience!", "helpfulness": 2, "user": "spuds", "date": "April 3, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 102693082}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "2. A female employee at the pool did not get her namel-was the same employee that told us the pool was closing did not seem like she knew the hotel facilties. We came down around 10am one day and asked if there was breakfast just where we could grab a coffee and pastry. She said no, that the hotel pool area restaurant opened at 11am. Of course we found out the next day there was a service on the 3rd floor, as I knew that sounded odd.", "title": "So Much Potential...", "helpfulness": 3, "user": "eyechip", "date": "April 3, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 102638171}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "She did not seem informed. I also feel that her and her colleague could have helped people more at the poolside. At the Four Seasons in L.A. they put the towel through a chair holder for you and provided complimentary \"jet lag\" smoothies. Thought it was a nice touch. The two female employees seemed like they just wanted to get through the day. Also one day we came early to eat our breakfast on departure day (7am) and the pool was closed and a male employee let us eat there. Seems late (8am) to open a pool - what if someone wanted to catch an early swim?", "title": "Great location fantastic hotel", "helpfulness": 3, "user": "davemullins2010", "date": "March 31, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 102323942}, {"rating": 2.0, "title": "Poor Service and Food Poisoning", "text": "3. A coupon was presented at check in for a complimentary appetizer, a $25 rebate for a spa treatment and one other service I can't recall. We used it in the bar and received the comp appetizer. I thought it was tacky just being able to choose one option, as the waitress took the coupon. Given that the rooms are pricy, what does it really cost the hotel to extend the other options to guests....", "helpfulness": 3, "user": "JPD8", "date": "March 30, 2011", "id": 102217853}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Such a beautiful hotel down to every last detail. Every part of the hotel is decorated to the highest standard, truly a 5+ star hotel. One of the few non smoking hotels on the strip.", "title": "Absolute Luxury", "helpfulness": 1, "user": "Jetboy787", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121022191}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We are not gamblers so did not mind the fact that there was no casino. Because there is no casino the lobby is quiet and serene. It is located on the 23rd floor with fabulous views of the strip.There is Aria Casino next door if that bothers you..", "title": "Fantastic Hotel - Peace & Quiet coupled with Great Service", "helpfulness": 1, "user": "openminded01", "date": "November 25, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121018566}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "We has Room 2003 with fantastic views of the strip, large room bathroom and walk in wardrobe.", "title": "Resort in the desert", "helpfulness": 1, "user": "TNElvis", "date": "November 24, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121006891}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled with family", "text": "Great gym for a work out. Would defiantly stay here again.", "title": "Great Hotel", "helpfulness": 2, "user": "RBruse", "date": "November 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120972452}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "Our first trip to Vegas was definitely a success due to our choice of the Manadarin Oriental as our base. From the moment we arrived, we were treated exceptionally well - from the welcoming doorstaff and bellboys through to the superb concierge (special mention to Doug who was exceptional), front desk staff and Walter, the excellent chauffeur. It was evident that all the Manadarin Oriental staff had received excellent customer service training.", "title": "Mandarin in Las Vegas", "helpfulness": 1, "user": "airdoug", "date": "November 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120959335}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The Mandarin Oriental Hotel in Las Vegas is, simply stated, the best hotel in Las Vegas. Convenient, elegant, beautiful, quiet, great restaurants (Twist for top drawer dinine; the poolside cafe for a great informal breakfast or dinner). Great bar. Awesome, courteous and helpful staff. Great pool and cabanas. If you want to gamble, Aira is a short walk. Luxury shopping next door. If you want the strip, it's right there. It's also close to the airport. We will be coming back, over and over!", "title": "Best In Vegas", "helpfulness": 1, "user": "Randall W", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160816030}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "By far the most beautiful hotel with the best service, amenities, rooms, spa, and property I've ever experienced. We felt like royalty here. And their food was delicious, everything we tried we had twice! Highly recommend everyone stay here at least once. The property is tucked away behind Aria an I not easily accessible to pedestrian traffic, therefore has a very exclusive, private feel. Also no casino here, it's very tranquil. The spa is fantastic, services were top notch.", "title": "Amazing", "helpfulness": 2, "user": "Heather W", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160813009}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "Treat yourself and stay here!!!", "title": "Our Favorite Las Vegas Hotel", "helpfulness": 1, "user": "Milly6020", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160808217}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "The Mandarin Oriental is by far our favorite hotel in Las Vegas. The service is impeccable and the location is perfect. We stayed last August 2012 to legally tie the knot before our wedding (and I can't believe that I forgot to write a review until now!). Upon check in, they asked why were in town and we told them that it was to get married. At one point during our stay, we came back to our room to find a pastry and card offering a congratulations (it made our day!). Even though we arrived at 9 am, they were accommodating and had our room ready before 11 am. The property is gorgeous and the rooms very well appointed (my favorite feature: the valet closet). The pool is quiet and secluded...a wonderful place to relax and catch some sun. We had great experiences at the pool bar and tea lounge in the lobby. A huge plus is the lack of a casino and smoking in this hotel. It is so nice to come back to a quiet, smoke free place after a day or evening out and about in Las Vegas. The location is ideal: \"mid strip\" and adjacent to Crystals shopping area. Although it can be a bit pricey, it is totally worth every penny to stay here. This is an incredible place to stay and we look forward to returning again and again.", "title": "Oasis of peace on The Las Vegas Strip", "helpfulness": 2, "user": "Bzibzia", "date": "May 15, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160803986}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "The hotel is located on the strip in the CityCenter, but because there is no casino on premises it’s very quiet. The décor and atmosphere promote complete relaxation after a day (or night) on the Strip. The rooms are huge and we had a great view, there is a bar on 23rd floor with panoramic view of the city as well, the cocktails are super tasty and the entire hotel staff exceptionally professional and accommodating. I’ve been to Vegas many times and this is the first time I wished I could’ve stayed one more day (we were there for 3 days). Definitely going back!", "title": "2nd year in a row....we'll be back for a 3rd!", "helpfulness": 2, "user": "Linus815", "date": "May 14, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160747122}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled with friends", "text": "This hotel deserves the 5 stars. Everything is as it should be - and no wonder - they have the brains and civility to fend-off the usual Vegas nonsense while being in the middle of it all. From check-in in their beautifully furnished suites to the peace and quiet afforded to their guests and residents. This place is lovely in a city that can really toss you around; if this is your first trip to Las Vegas there is no place better than MOLV, you could be anywhere; close the curtains and Vegas disappears. No sunlight to wake you up, or thumping techno music to annoy you, just quiet, lovely, friendly service with a genuine smile: the employees seem to really take pride in the hotel and their reputation. Why on earth I ever stayed anywhere else I'll have to check my head. I want quiet - and that's exactly what I get here - it's just perfect. Need something, pick up the phone and it's there.", "title": "Still here and it's perfect", "helpfulness": 2, "user": "Geoff R", "date": "May 13, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 160610776}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "Some may say it's expensive and I'd reply you get what you pay for: why pay 20% less just to stay at some place with a beach club and an annoying voice that tells you how great all of the things are, when the owner sadly can't see what's going on and doesn't have proper assistance to maintain his property the way he intended? I think you know what property I'm speaking about.", "title": "Deserves its # 1 Rating", "helpfulness": 2, "user": "tedoworld", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160505919}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Back to MOLV: they say it's Zen-like and I couldn't agree more. In our suite they've thought of nearly everything, though the dining table is far too big for the room: two guests don't need eight chairs and a long table, I'd rather have seen that made into an office or some other creative use of space. That would be my only change to the room.", "title": "Excellent Hotel", "helpfulness": 2, "user": "tdl119", "date": "May 12, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160439949}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Unlike most Vegas hotels the furniture is comfortable, tasteful, the Control4 system makes it just like home, and it's great to have a fully stocked full-size fridge. They didn't cut corners here in any respect that I can see. Everything is snap snap, quiet and just next to perfect. Why stay at a casino - it's a casino first and a hotel second - this is a Hotel, they know how to treat guests and have a beautiful property. I'm exceptionally impressed, but it's the MO, of course I'm impressed! Stay here and you will have a great time, you can gamble at casinos within a five minute walk. Don't be a sucker and go for some has been casino that's more interested in Macau than in Las Vegas.", "title": "Our home away from home.", "helpfulness": 3, "user": "Chililover", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160324992}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Beds could use a pillow-top or featherbed, a little too hard but everything else is just right.", "title": "Nevada's Oasis, Relaxation at it's Finest...", "helpfulness": 1, "user": "JOSEPHINEandMR", "date": "May 10, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 160272570}, {"rating": 5.0, "title": "Finally a hotel in Vegas to fall in love with!", "text": "Over the last 15 years, I have hotel hopped and stayed at many properties in Vegas for the myriad conferences and meetings I attended. I never particularly liked any of them, as smokey loud gigantic lobbies filled with clanging casinos is not my scene. But with my stay last week at the Manadarin Oriental, I have finally found a home in Vegas that I absolutely love. From the door staff that say \"welcome home\", to the sedate elegant furnishings, to the quiet lobby, to the non-existent taxi lines and helpful bell staff, to the gorgeous rooftop bar with a dynamite view, to the perfect and delicious room service food (separate vegetarian menu if you ask, and minesteone soup is excellent!), to the perfectly appointed rooms with all state of the art amenities, to the lovely pool area, it is exactly what I now will hopefully continue to enjoy on all future Vegas stays.", "helpfulness": 2, "user": "NomadicNina", "date": "May 27, 2013", "id": 162055880}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled as a couple", "text": "Only cons: 1: weirdly on two instances, maid service failed to remove room service trays and left them there entire day; 2: breakfast menu at pool cafe too limited.", "title": "Paradise", "helpfulness": 5, "user": "Ben G", "date": "May 26, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161878174}, {"rating": 5.0, "stay_parameters": "Stayed April 2013, traveled as a couple", "text": "Came here to spend some time alone with my wife and highly recommend! Hotel is fabulous and city ......... Everything here left us speechless! Will be coming back soon! By the way - coffee in this hotel is the best I had in my life so far...", "title": "Heaven", "helpfulness": 4, "user": "Sarah H", "date": "May 25, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161760574}, {"rating": 3.0, "stay_parameters": "Stayed May 2013, traveled with family", "text": "Fantastic location right in the middle of the strip and absolutely outstanding service! The rooms are very modern and have all sorts of technical features - took me a while to work out how to turn off the lights, but it was pretty cool. It is such a nice difference from all the hustle and bustle on the strip when you walk into the hotel - it is so quiet! Perfect place for our first night as a married couple!!!", "title": "Madam don't you know this is Vegas", "helpfulness": 8, "user": "farawaymum", "date": "May 24, 2013", "detail_rating": {"service": 2.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 161748103}, {"rating": 5.0, "stay_parameters": "Stayed April 2013", "text": "Firstly the room was lovely, my request for a strip view resulted in an upgrade to a corner suite which was truly spectacular.Everything was five star, as I expected from a hotel at this price point/brand.However if you have stayed at any high end Asian 5 * hotel you won't be blown away by the place as many reviewers seem to be.I was also very happy with the location, most of the strip was easily walkable , and a quick cab ride from the airport.", "title": "Fantastic Honeymoon Hotel", "helpfulness": 1, "user": "Hayley T", "date": "May 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161745565}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Fab hotel. Great view of the strip. Room spotlessly clean with a fantastic \"spa-like\" bathroom. Bed was probably the most comfortable bed I have ever slept in! Everything controlled by a techno gadget masquerading as an alarm clock! Staff very accommodating. No casino at this hotel... Which suited us. Wifi was $18 per day..which seemed quite expensive. Overall would definitely return to Mandarin as hotel of choice in Vegas.", "title": "Relaxing Oasis", "helpfulness": 2, "user": "C-A63", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120479118}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Liked the room and the tv in bathroom and nice touches, like our names were displayed on tv on our arrival. Everything seemed to be worked by a remote control or another system somewhere else in the room which the wife couldn't master so I ended up trying to do, sometimes it's just nice/and quicker to open the curtains by hand.", "title": "Nice place shame about the position", "helpfulness": 1, "user": "MARTIN r", "date": "November 10, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 2.0}, "id": 120434536}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "Music or mystical oriental type droning in lifts got a bit tiresome after while, it never seemed to be getting anywhere no matter when you joined it. Other than these minor points a very nice hotel, found the food somewhat expensive and having never been to Vegas before actually did think we would have liked the idea of a casino on site, so on reflection most probably wouldn't stay here again. Staff very nice and polite.", "title": "Fantastic", "helpfulness": 2, "user": "burlistic", "date": "November 10, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120431713}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "Really nice, modern and funky hotel. I decided to spoil the wife and book us at the Mandarin for our trip to attend a friend’s wedding. It turned out to be an inspired choice. The service was excellent, the room chic luxurious. I absolutely loved the bathroom and would like to take some of the design ideas to put into my own home.", "title": "An oasis amongst the madness", "helpfulness": 2, "user": "DC10Gooner", "date": "November 9, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 120403709}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "We tried the Asian fusion restaurant, MOZen Bistro and where really impressed. Standard was top. Very happy.", "title": "Outstanding stay in this Zen hotel !", "helpfulness": 2, "user": "Magadeb", "date": "November 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 120400385}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We had a wonderful 3 night stay at the Mandarin. Had booked a stripview suite, when we arrived we had been upgraded to an Apex suite (it was our 10th wedding anniversary). The room wasn't quite ready when we arrived so had a lovely drink in the bar and the room was ready about 45 minutes later. The suite was vast & beautiful. There was a seperate lounge/dining room/bar area then a small kitchen, study area. The bedroom & bathroom were beautiful with great strip views.The room was spotless.", "title": "Gorgeous hotel in fantastic city!", "helpfulness": 1, "user": "Victoria003", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 120636037}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled solo", "text": "We had a drink in the jazz bar on the first night, drinks were first class & the music was great, would definitely recommend.", "title": "Beautiful and Great Service but Noisy", "helpfulness": 1, "user": "mark j", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 1.0, "rooms": 5.0, "location": 5.0}, "id": 120634058}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "We managed to use the sun loungers at the Mandarin on one afternoon, the staff by the pool were lovely & helpful - it was a shame it wasn't warmer as was a lovely bit of calm away from all the hustle of Vegas.", "title": "great hotel, fabulous service", "helpfulness": 2, "user": "jckmd", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120625455}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We didn't eat in the hotel, we ate at Beso over in City Center and despite the mixed views on tripadvisor we thought the food was excellent and there was a nice atmosphere in there. We also took a cab to Roy's one evening - the food here was also excellent.", "title": "You don't have to be part of the 1% to stay here!", "helpfulness": 6, "user": "Wabbit1963", "date": "November 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120621178}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "We would love to return to Vegas & if we did would definitely return to the Mandarin & will certainly be recommending to our friends.", "title": "WOW!", "helpfulness": 5, "user": "irishmannyc", "date": "November 11, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 120481305}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We have just returned from a 6 night stay at the Mandarin. We are very familiar with the Mandarin chain in Asia and the Vegas property does not disappoint. Clean, modern rooms, excellent service, great strip views, large washrooms, etc. Better yet, got a very good deal on Expedia. Really liked the ability to play hard in Vegas at the casinos and then return each night to the oasis of calm that is the Mandarin. No drunken 20-somethings here. Location is in the center of everything. If you are tired of long check-in lines with millions of tourists roaming around (like the Wynn or Bellagio), then highly recommend the Mandarin. Only downside was our horrible experience at their signature restaurant, Twist. Eat elsewhere.", "title": "Very Impressed", "helpfulness": 1, "user": "Commerce90", "date": "April 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 105091915}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "Selected hotel for client meeting as it did not have the distraction of a casino and was non-smoking. Easy walking distance to casinos for night diversions. Rooms were in excellent condition and delighted clients for cleanliness, superior staff response and spaciousness. Meeting support was good, food was healthy. Only drawback was the business center's fee for copying documents.", "title": "Great Client & Business Hotel", "user": "EBudda", "date": "April 22, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 105078710}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "We stayed recently 5 nights at the beautiful Mandarin Oriental Las Vegas. We couldn't be more happier of our choice. The rooms are outstanding. As a younger traveller I really give value for all the high technology they provided in the room. Automatic lighting, curtains etc. but especially the sound system! You can plug in your own laptop to TV and play your music with real speakers and there's even a subwoofer too!", "title": "Absolutely the best hotel in Vegas", "user": "Tuomo79", "date": "April 20, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104842864}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "Bed's are amazing, view to the strip from our 17th floor room and away from all the gambling but still close to everything. Service was excellent except on the last morning when the \"hostess\" lady were missing from the breakfast:) Pool area was excellent where they serve free water and some cooling refreshments during the sunbathing. Fitness center is a big plus too though it should be open later than 8 pm. Overall one of the greatest hotel experiences ever!", "title": "Great hotel and great location", "user": "Leif-Erik J", "date": "April 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 104834775}, {"rating": 5.0, "stay_parameters": "Stayed April 2011", "text": "First time in Vegas and Mandarin Oriental never let you down. Great location on the strip and close to everything, had a great time and their concierge were amazing!", "title": "Fantastic excellent hotel", "user": "australiamagpies", "date": "April 20, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 104832066}, {"rating": 5.0, "stay_parameters": "Stayed March 2013, traveled on business", "text": "Spent five days on a business trip. The check in/check out team was very courteous and friendly. The service was top notch. Staff gave great recommendations for dining and entertainment. The rooms were incredible! I was in a meeting room for the week and had no complaints.", "title": "Incredible Experience", "helpfulness": 2, "user": "Rod F", "date": "May 24, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161679049}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "I travel to Vegas several times a year and always endeavor to stay at the Mandarin. This time around I was meeting up with some friends from university and had initially arranged to stay with them at the Cosmopolitan. The boys wanted a typically tacky Vegas adventure and I thought it would be fun to join in. Then I got scared at the notion of staying in one of Vegas' frenzied behemoths and elected to return to the calming sanctuary that is the Mandarin. Three of us flew in together. I had checked-in, enjoyed a nice snack by the pool, unpacked & showered during the time it took the other two to get their room at the Cosmopolitan.", "title": "Eighth Visit & Still Outstanding", "user": "imperator12", "date": "May 24, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 3.0, "service": 5.0, "rooms": 5.0}, "id": 161661889}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Service is the Mandarin's shining star. It is unfailing efficient and utterly charming. The Front Desk staff is certainly as talented and welcoming as their counterparts at the illustrious Mandarin in Bangkok. I so appreciate having the confidence that the staff will eagerly handle any request I may make and will promptly resolve any issue I may have.", "title": "Exquisite", "helpfulness": 1, "user": "Jayne_WM", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161655262}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I have to admit that there are larger rooms with much more pronounced WOW factors at places like Encore and Cosmopolitan. The rooms at the Mandarin impress with their quiet sophistication and exquisite attention to quality & detail. I've said this in every review of the Mandarin Oriental Las Vegas and it bears repeating: the hotel is located in a particularly seedy section of the Strip and thus the views are nothing special, especially when compared with the spectacular fountain view my friends had from their room at that chaotic mess known as the Cosmopolitan. The Mandarin's cityscape rooms are more peaceful and come with mountain and sunset views; the strip view rooms look out over the prison-block architecture of Planet Hollywood and Monte Carlo as well as the tacky strip malls. I've also mentioned in previous reviews of my disdain for the in-room technology. I had a particularly nasty struggle with the wake-up settings of the Master Computer. Thankfully I was victorious and at 3:15AM, just as arranged, the curtains automatically opened and the TV turned on to a streaming view of sunrises, all set to peaceful Asian music. It was a very civilized way to be woken-up.", "title": "overall awesome stay", "helpfulness": 2, "user": "joshturbo", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161639553}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "What made this stay slightly less stellar then usual was my experience at the Mandarin Spa, which I have loved in the past. My massage was as great as ever but my time in the men's facilities was a bit below par. I sat on water bottle caps in the steam room and stepped on more caps in the shower. And the service, though friendly, was not as attentive or observant as in times past. I sense, however, that this experience was just a hiccup caused by recent staff changes, a frequent occurance at Vegas hotels.", "title": "Unbelievable stay in the middle of the Strip", "user": "crimnole73", "date": "May 23, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161608220}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled as a couple", "text": "We spent three nights in an Executive Suite. The room was fantastic as was the rest of the property. The food in the Hotel restaurant was great for breakfast and lunch, if we were not booked for dinners each night we would have tried it for dinner as well. The comments about the elevators are a non-issue, you get used to switching on floor three or twenty three very quickly. The consierge has pull with the high end restaurants and entertainment as we had great tables and seats for everything. The spa treatments are VERY expensive but they are about 90 min instead of 60, they do not do 60 min treatments. The health club workout area is fulkl of the best equipment. The opening special with one night free is great. You will not be able to stay in a Mandarin at these prices anywhere else.", "title": "Best In Vegas and as good as the best anywhere", "helpfulness": 1, "user": "piatty73", "date": "February 3, 2010", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "rooms": 5.0, "service": 5.0}, "id": 55107795}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "Peaseful oasis is the word for the MOLV. It met all our expectations, quiet, first class, great food, warm & caring staff and wonderful facitlity. We planned this trip for just getting to some warm weather and wanted a first class hotel with no smoking, no casino, no kids and great workout facilities. I found it in the MOLV. We got up early every morning and hit the fitness center for a spin, weights, and running. At 8am when the pooll opened we jumped in for a 4000 yard workout each morning before others where in the pool. The first couple of laps where a little tricky getting the flip turns down with stairs at each end of the pool. I had my garmin swim watch on. so based on my split times, I would call it a 25 yard pool. It was great to have a pool side breakfast and lunch. just relaxed the rest of the day, did a little shopping at high end stores next to the hotel. The staff was wonderful.", "title": "Masters Swim Vacation & Relaxation", "user": "Christopher W", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161408697}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "it will be hard to top a hotel experience after staying at the Mandarin Oriental. my partner and I used all areas of the hotel: pool, spa, restaurants, bar, lounge. the staff and the facilities were amazing. friendly, warm and accommodating in every way. we normally don't spend a lot of time in our hotel room when we travel but this room was so nice that we could have easily done so and been happy. we really had very little desire to leave the property!!! or did we need to. while LasVegas is not my favorite travel destination, the Mandarin Oriental is the number one reason we want to come back!!!!!", "title": "perfection", "user": "jjpdds", "date": "May 21, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161378090}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "Everything was perfect, high quality service especially on the pool, the staff was very friendly. Big and modern rooms. Located next to Cosmopolitan hotel and shopping center with walking distance to Caesar and Bellagio. It's a perfect place for those who are looking for the best service and quite place to relax in Vegas.", "title": "Great location but too calm for Vegas", "user": "margo1234t", "date": "May 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161357219}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled on business", "text": "I stayed at the Mandarin from November 16-20 inclusive. Booked on a promotion via Twitter using the Zen free night giveaway, so I got four nights for the price of three - around $335 a night for the Mandarin Premier Room with a strip view.", "title": "Simply the best there is. If you can afford it, stay nowhere else.", "helpfulness": 1, "user": "v4nnm", "date": "November 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120953182}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Upon arrival, the doormen were prompt, courteous and helped me out with the bags. No pressure to carry them - I am 6'1 and 190lbs so I don't tend to struggle with bags anyway - and they called the elevator and sent me up.", "title": "What a hotel!!! Absolutelly perfect experience!", "user": "AllanMCCosta", "date": "November 23, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120949049}, {"rating": 5.0, "stay_parameters": "Stayed November 2011", "text": "As I stepped out of the elevator into a fabulous lobby, the desk clerk greeted me by name even though I hadn't said who I was - obviously the doorman had called up. Very nice.", "title": "Oasis of calm in a mad city", "helpfulness": 3, "user": "jlmoura", "date": "November 18, 2011", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 120752880}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled on business", "text": "Check in was a breeze and done in under 5 minutes. A few moments later I was taking another elevator back down to the 12th floor for my room. This is the only odd bit - you have to take one elevator to the lobby, and another to your room, activated by keycard. At least it keeps the non-residents out of the hotel I guess, but it is a minor inconvenience.", "title": "Fantastic Hotel !!", "helpfulness": 2, "user": "BforBoy", "date": "November 18, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120751481}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with friends", "text": "The room was well appointed, quiet and comfortable. Huge bathroom, well stocked (and expensive) drinks cabinet, massive comfortable bed. THe only noise occasionally came through the room door but it's not like staying at the Hard Rock; there aren't any real party animals here.", "title": "Mandarin is our choice", "helpfulness": 1, "user": "WestMidsP", "date": "November 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120713192}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The only place to stay in Vegas. Service amazing. You walk in the front door to peace and quiet. Has no Casino which means quiet and no Smoking. To be able to breathe the air is the ultimate. Vegas is very backward and has smoking everywhere. To see little kids having to walk through other casinos to get to hotel breathing in the smoke. MGM was the worst for that. We had a corner suite with the special third night free it made it the same price as other rooms. Loved the Master switch on the wall that closed all the curtains and turned off all the lights. The TV built into the bathroom mirror was fun. Even Rose petals on towel in bath tub.", "title": "Absolute Best", "user": "swoopbns", "date": "April 17, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 104334644}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "My wife and I spent three nights at the Mandarin Oriental and greatly enjoyed our stay. The property is outstanding, extremely well staffed and provides many nice touches that ensure an excellent experience. We plan on returning.", "title": "Oasis amidst the chaos, glitz, frenzied energy of Vegas", "helpfulness": 1, "user": "CharlotteEpicurean", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 104285857}, {"rating": 5.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "We enjoyed a 60 minute massage and having experienced many spas around the world, the spa at Mandarin Oriental is amongst the best we have enjoyed. I left my wedding ring and college ring inside a pocket in the robe. I called the hotel and they put out an all points bulletin for these sentimental items and I was delighted the next day when security called and returned the rings to our room. The pool area is A++++! Staff is plentiful to handle any needs (towels, food, drink), food is very good and venue and overall vibe is stellar.", "title": "Literally an Oasis in the Middle of Vegas", "user": "Upintheairtoomuch", "date": "April 16, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 104257288}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Courtesy car/limo are available for free for transport to points of interest within 3 miles of the hotel, which covered all areas we visited.", "title": "Afternoon tea on the 23rd floor. Soothing and realxing", "helpfulness": 1, "user": "Tommy745", "date": "April 12, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0}, "id": 103785852}, {"rating": 5.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "Overall this is an elegant hotel that lives up to all the hype. Value was decent as we stayed on Zen City package (pay for two nights and get the 3rd night free).", "title": "It was an enjoyable retreat for an anniversary celebration", "helpfulness": 1, "user": "Bearlee09", "date": "April 6, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 103074122}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "This hotel was a pleasant surprise while traveling with my husband on business. From the moment we arrived, we were greeted with professionalism and the utmost warmth. While checking in, we were invited to sample a lovely orchid tea and enjoy moist towlettes to refresh.. reminding me of traveling to luxury game lodges in South Africa. The hotel lobby is impressive and the entire property gives off a calm warmth that is hard to describe. The best way to experience the difference is to step foot in any number of hotel/casino properties on the strip and then return to the Mandarin after a day and night of fun in Vegas. The experience is truly amazing.", "title": "A luxurious and tranquil oasis of calm on the Las Vegas Strip!", "helpfulness": 3, "user": "BellesAZ", "date": "March 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57801176}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with friends", "text": "Our room was stunning and besides the massive King sized bed with the gorgeous feather pillow topper and feather pillows - the hotel has simply thought of everything. Glass enclosed, large bath and beautiful room views really made the stay worthwhile.", "title": "Well done Mandarin Oriental, well done...", "helpfulness": 5, "user": "InstantNoodles", "date": "March 1, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 57393536}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "The hotel has thought of every high-tech feature one could want. Set your alarm using the online screen and awake in the morning to the sound of tranquil music, your drapes and sheers opening wide to let in the Nevada sunshine. Seriously, you wake up with a smile and wished you didn't have to leave.", "title": "A truly unique Las Vegas experience", "helpfulness": 3, "user": "brian714", "date": "February 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57125321}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled with family", "text": "The food in the restaurant on the 3rd floor was absolutely delicious. So fresh and expertly prepared. My husband had the sushi and was very impressed with the freshness of his dish. I had a pulled pork sandwich with Mango BBQ sauce and season slivers of fried onion rings dusted with ancho chile powder that were so delicious!", "title": "They Deliver What They Promise", "helpfulness": 4, "user": "JRWB1960", "date": "February 21, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 56666351}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled on business", "text": "The only negative we might have for this property was our breakfast in the morning. I ordered the blueberry pancakes and they were quite rubbery. My husband ordered the steel cut oats, but they tasted more like regular oats with little flavor and no crunch as steel cut oats should have. Otherwise, everything was perfect and the hotel staff went out of their way to please you.. no matter what the request.", "title": "The most luxurious rooms in Las Vegas and probably in the U.S.", "helpfulness": 1, "user": "WW_CPO", "date": "February 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 55584161}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "Too bad 10 stars can't be awarded to exceptional hotels, because Mandarin Oriental Las Vegas (MOLAS) is truly deserving.", "title": "Best Hotel in Las Vegas - Luxury, Elegance, Comfort", "helpfulness": 5, "user": "yamanote", "date": "March 16, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58688219}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "We stayed a long weekend, having booked our reservation directly through the hotel web site. Having just opened, the hotel is offering extraordinary promotions, which include generous hotel spa and dining credits.", "title": "Best on the Strip", "helpfulness": 4, "user": "Jeff R", "date": "March 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 58657017}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled as a couple", "text": "MOLAS is an island of relaxation and elegance in the heart of the Las Vegas Strip, just minutes from McCarren Airport and is part of the newly opened City Center development.", "title": "The Best!", "helpfulness": 2, "user": "easton1", "date": "March 7, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 57941821}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Arrival is in a private driveway accented by a small bamboo forest. The bell and door staff are very efficient and friendly. Bags and guests are whisked from the street lobby to the 23rd floor sky lobby for check in.", "title": "FANtastic. A true fan of the Mandarin", "helpfulness": 4, "user": "KaspXhotels", "date": "March 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57897986}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled on business", "text": "The sky lobby is the focal point of the hotel and is splendidly designed with dark marble and Asian influences. Check in staff are highly trained, pleasant, and perform the check in ritual perfectly.", "title": "WOW! This is a MUST stay!!!", "helpfulness": 4, "user": "Jorton", "date": "March 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 57801416}, {"rating": 5.0, "title": "A nice break from vegas baby vegas", "text": "You have to love the city with all the hustle and bustle and late night activities. But, if you want to be able to get away from it for the evening, or even day, this is the spot. It is a beautiful hotel and the staff is, of course, terrific. It also has probably the most beautiful bar in the city. The pool is a little stark, but it is very relaxing and there is never a problem getting a place to sit in either sun or shade. all in all a great place to stay. If you have it available, Amex, through their Fine Hotels, generally has great deals at the hotel which includes breakfast. Also, the spa is a great place.", "helpfulness": 2, "user": "Ron M", "date": "May 23, 2013", "id": 161598561}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled on business", "text": "I recently stayed at the Mandarin Oriental Las Vegas for the third time. I celebrated my birthday and found every aspect of my stay to be outstanding. From my arrival to my departure every staff member I encountered at the hotel was so gracious, friendly, and helpful. April (front desk) was so helpful and nice. I had a strip view suite on the 22nd floor. The floor plan was nice, the furniture layout was cozy and spacious. The walk in closet was perfect for storing all my luggage and hanging my suits and blazers along with my shopping bags. The spacious bathroom and large tub was perfect too. Friday morning and afternoon I dined at the Mozen Bistro and the Pool Cafe. Julieta (pool cafe) manager was so sweet and helpful. Friday night I dined on site at Pierre Gagnaire's five star restaurant, Twist. It was amazing as usual. We opted for the 777 menu tasting and it was spectacular. Saturday, relaxed at the pool. I was impressed that the staff members from the day before remembered me by name and also knew what I liked to order. Saturday night went to L'Atelier de Joel Robuchon for dinner. Sunday afternoon had tea in the hotel's Tea Lounge, April was our server and was so gracious and nice. Sunday for my birthday we went to Joel Robuchon for dinner then afterwards returned to the bar at the hotel for a champagne toast.", "title": "The best hotel in Las Vegas - A true jewel!", "helpfulness": 2, "user": "orderdessert1st", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161550114}, {"rating": 5.0, "stay_parameters": "Stayed May 2013, traveled solo", "text": "When I want to booked hotel in Las Vegas i found so diffuclty to choice hotel because with many option so i came back to tripadvisor and booking.com to see the review of people to help me to choice and both site was put Mandarin Oriental, Las Vegas rate one and when i arrived to the hotel i shocked by the entry of the hotel down the earth and need to inter and use left to go to to the small lobbey than i asked my self from what i saw how this hotel got rate one in both famous site but from first sight i noitce the all staff treat u as a king and i inter the room the suprise gone lovely nice big room with every things u need in it .", "title": "surprise", "user": "Abdulla-almeraikhi", "date": "May 22, 2013", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161508978}, {"rating": 5.0, "stay_parameters": "Stayed May 2013", "text": "This was my first time here having previously tried the Bellagio, Wynn, Caesars and Encore.", "title": "Stunning hotel. For me, The best by miles in las Vegas", "helpfulness": 3, "user": "wipeout75", "date": "May 21, 2013", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 161450708}, {"rating": 4.0, "stay_parameters": "Stayed May 2013, traveled as a couple", "text": "I stayed in a standard room facing away from the strip. It was still incredible. Beautifully furnished, comfy bed. Electric blinds that can be set to open at a set time to wake you rather than some terrifying alarm clock blating at you. Great showers.", "title": "Very Good , expected much better..", "helpfulness": 2, "user": "jimyb", "date": "May 21, 2013", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 161445694}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 5, "variance": {"poor": 15, "average": 70, "very good": 271, "terrible": 16, "excellent": 1941}, "aka": "Mandarin Oriental, Las Vegas Hotel Las Vegas", "slim_ranking": 0.0037037037037, "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "description": "Mandarin Oriental, Las Vegas is a luxury 47-story hotel located at the center of the vibrant Vegas Strip."}