{"user_rating": 4.0, "review_count": 5919, "name": "Mandalay Bay Resort & Casino", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We liked the fact that the hotel was right at the South end of The Strip. Far enough away from the constant bustle - but joined to the Luxor and Excalibur by a free tram - so easy to get to the attractions.", "title": "Excellent hotel and great location", "helpfulness": 2, "user": "adeleSpalding_UK", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113163935}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We had a room on the 34th floor overlooking the pools - it was very clean and comfortable - and we would definitely go back there.", "title": "Comfortable, but I won't choose the hotel again", "helpfulness": 1, "user": "CarolinaBlueAngel", "date": "June 13, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 4.0, "value": 2.0, "service": 3.0}, "id": 113145167}, {"rating": 5.0, "stay_parameters": "Stayed June 2011", "text": "Pool complex was excellent - great wave pool, lazy river & lovely, fluffy towels provided.", "title": "Excellent stay!", "user": "Mishishi", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 113113105}, {"rating": 1.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "The Mandalay Bay is a beautiful hotel. I went with my teenage son after purchasing the Lion King package which included 2 nights stay and 2 tickets to the Lion King musical. The Lion King exceeded all expectations. It was incredible! The hotel was a little disappointing. The rooms are stocked with alcohol. The refrigerator is weighted so if anything is removed you are charged. That meant there was no room to place your own items to keep cool. There was no coffee maker in the room. For families on a budget, this could be a challenge since the restaurants are pricey. Our bathroom had a very large black stain on the floor which took away from the appeal of the room. The toilet paper holder kept falling off the wall. On the positive side, the wave pool, lazy river and outdoor resort areas were beautiful. I felt like I was relaxing at the beach instead of being in the middle of the desert. Overall, I would not choose this hotel next time I visit Las Vegas.", "title": "can't recommend this tired hotel", "helpfulness": 2, "user": "Babs414", "date": "June 13, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 1.0, "service": 1.0}, "id": 113112394}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My boyfriend and I got a great deal online 79 dollars a night in a 765 square-foot room. We brought along some friends and booked 3 rooms for 3 nights at that price. It was an awesome and memorable stay! There is so much to do at the Mandalay we had a hard time wanting to hit the strip. Be sure to eat at the burger bar! And hit the house of blues for happy hour!", "title": "ONE MORE GREAT STAY!", "helpfulness": 1, "user": "Alma R", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113078696}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled with family", "text": "We travelled in a group of 10,4 adults ,5 teens and a 10 year old.We had one week over the october 1/2 term.", "title": "Vegas ,just what it says on the box!", "user": "LeedsChip", "date": "September 9, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117880552}, {"rating": 3.0, "title": "Spend more and stay at the newer \"the Hotel\" at Madalay", "text": "The hotel was great ,big and flashy enough ,but far enough away from the centre to feel like you could relax,pools were great ,well manned and quiet. The kids loved it !! we did the grand canyon trip with' maverick ' tours well worth a go ,very expensive but a one in a life time experience. We look in a show while our men folk went gambling (Blue Man ) maddest thing i 've seen but again the kids LOVED IT ,We did all the roller coasters , visited the shops (lots!!) ate at lot's of themed restaurants,all in all Las Vegas is a party town ,which did very well at entertaining the kids as well as the adults.", "helpfulness": 1, "user": "A TripAdvisor user", "date": "September 8, 2011", "id": 117846588}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled solo", "text": "Mandalay Bay is one of the premiere hotels of Las Vegas, however, like many of the MGM properties including Luxor and MGM, it has managed to tarnish its brand and its appeal by reducing room rates that start at just $89 now. A few years ago, you would be hard pressed to find a room for less than $130 even in off-peak days.", "title": "Looking forward to returning", "user": "chicagodoc44", "date": "September 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 4.0}, "id": 117824389}, {"rating": 4.0, "stay_parameters": "Stayed July 2011, traveled on business", "text": "So what is wrong with a cheaper room rate? Well, it means that some of the little things that matter, start falling by the way side. I checked in to the hotel last week, and here are somethings that I found a little disappointing:", "title": "I like it but not loving it :)", "user": "jaclynck", "date": "September 7, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 117808956}, {"rating": 2.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "-- The light switch by the door did not turn on any lights in the room. It turned on a very dim light by the entrance, but I had to find the light knobs on the individual lamps in the dark.", "title": "Im so done with this hotel", "helpfulness": 1, "user": "LIBLK5", "date": "September 7, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 3.0, "service": 3.0}, "id": 117808632}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "This was our first time there and possibly the last. It started bad..I called Sept 4th at 1:00 pm to see if our rooms are ready, they weren't which is fine. I was told it wil be by 3 pm. Okay, we get there the line is 8-10 people deep at the registration desk and there is another 6 desks empty that they could be using. The attendent said the rooms won't be ready for maybe another 1.5 hours! What? I paid for check in at 3pm and they said they can't get me in for another 1.5 hours? I spoke with the manager and she miraculously finds me the rooms I reserved. I also asked why all the registrations desks were not used and how they can allow us to wait 40 minutes in line, yes 40 freaking minutes. Liz's response was that they are breaks. What, its a day before the holiday and you don't have any foresight to staff appropriately? That's incompetence. One of the non-smoking rooms we got was smoked in so I had to request for another one, which they found for me. The rooms are very dated and if there is a concert going on that weekend, don't expect to get any rest before midnight. Yeah, it's that loud and we were on the 15th floor. This is suppose to be a 4 star hotel. I would give it a 3 star at best. Oh, please stop nickle and diming your customers by charging them a \"Resort Fee\" of twenty or so dollars a day for internet service. Ballys don't charge it! Btw, we went on Priceline and got the hotel for $80. I'm glad we didn't pay more than this for this place!!! One more thing, if you have a 6 am departure, don't leave no later than 4 am. The lines were bad and we got on just in time.", "title": "Bad Stay at the Mandalay", "helpfulness": 1, "user": "03rcode", "date": "September 7, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 2.0, "value": 3.0, "service": 1.0}, "id": 117784830}, {"rating": 5.0, "stay_parameters": "Stayed July 2011, traveled with family", "text": "One of the many amazing hotels at one end of the strip. 2000ish rooms and 30 restaurants. Food excellent. Views from the 28th floor are amazing.", "title": "Amazing - worth going just for the wave pool alone!", "user": "Mark C", "date": "September 6, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 117768370}, {"rating": 5.0, "stay_parameters": "Stayed August 2011, traveled with friends", "text": "Our only problem was not having two rollaway beds in the room when we arrived and a bit of an argument ensued. We got there in the end and they gave us $100 off the room bill - so it worked out nicely.", "title": "Superb hotel loved it and loved Las Vegas :-)", "user": "Tondaz", "date": "September 5, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 117714209}, {"rating": 1.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We visited Mandalay Bay for a friends 50th Birthday, we all enjoyed every bit of it :-) the hotel staff were very friendly and helpful, the rooms were spacious and were cleaned every day. The location was good with great links to other hotels either by walking or monorail. There is a lot of choice and variety to eat out; we enjoyed the buffet breakfast in the hotel.", "title": "Never again!!", "helpfulness": 2, "user": "TeamHolt", "date": "September 5, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 3.0, "service": 1.0}, "id": 117710345}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "The beach and pool facilities were excellent but you need to get there early to get beds.", "title": "Mandalay Bay is a great hotel to stay at....so long as you know the tricks.", "user": "skicrystal", "date": "September 5, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 3.0}, "id": 117683043}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "In the past few years, I've been to every hotel on the strip, and none matches the feeling of comfort and elegance of Mandalay Bay. (With the exception of maybe Wynn or Bellagio :P)", "title": "Mandalay Bay is Amazing!", "helpfulness": 2, "user": "WorldEagle", "date": "June 13, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 113312729}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "Anyways, the hotel in itself is palatial, and almost all public spaces are adorned with beautiful details of grand proportion. The colors aren't dark and uninviting, but rather light and airy, but not too light, and still retaining some old charm.", "title": "Great Property Without the Gimmicks", "helpfulness": 1, "user": "JoannaJoySeetoo", "date": "June 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 113245964}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The rooms are a STEAL! However, you must note that they haven't renovated for a while, and some furniture is not in an excellent state. However, the size of the rooms are very satisfactory, with a massive bathroom with double sinks, jet tub, and walk in shower.", "title": "great hotel, stayed for convention", "helpfulness": 1, "user": "MrPearl", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 113223595}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "The beach complex is simply the BEST in Las Vegas, and perhaps ranks among the top in the world for a hotel! They just offer so many amenities, fine dining, entertainment, shopping, that it's simply a wonderful hotel.", "title": "Fabulous place for our Wedding!!!", "helpfulness": 1, "user": "lalab123", "date": "June 13, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 113205334}, {"rating": 3.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "*However, it is located on an end of the strip, but you can easily get to Excalibur using the Mandalay Bay - Luxor - Excalibur free tram that runs all day. From there, it'll be much easier to walk.", "title": "Average at best", "helpfulness": 3, "user": "LoraKay", "date": "June 13, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 113199693}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled with family", "text": "My sister and I decided to stay here because Kings of Leon where scheduled to perform at the event center (then they cancelled part of their US tour). Check in was a little time consuming. Rather than one main line, there are numerous separate lines leading to each check-in person; this seemed to be inefficient when you happen to choose a line with problems... Also, the elevator situation was ridiculous. Thursday wasn't bad, but Friday through Sunday got progressively worse. One trick we learned was to take the elevator from the beach level, rather than the casino level. It's not as easy when you're stuck on your room floor. I waited almost 30 minutes for an available elevator to the lobby when I was trying to check out this morning (the worst by far). I heard many other guests complaining about the same issues. I heard more than one person say the had never experienced anything like this at another Vegas hotel (which I agree with, having stayed at the Bellagio, Bill's Gambling Hall and Casino, and the Venetian).", "title": "Come here if you want to enjoy the pool area.", "user": "runner6326", "date": "September 5, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117682783}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "I found the room pretty average. The room was a good size, but the carpet was worn and there were dark hairs stuck in the bed spreads and shower. Also, there seemed to be a trick to flushing the toilet. Sometimes it flushed great, other times it was half -hearted and took almost a minute.", "title": "Money, money, money...!", "user": "HabesNJ", "date": "September 4, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 117679481}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The pool area is the highlight. I would recommend bringing an inflatable inner tube for the lazy river. They sell them at the hotel, but I'm sure you can get a much cheaper one in your hometown. They have a wave pool, hot tub, and several other pools. I would recommend getting there early, as the lawn chairs are probably full by 10am.", "title": "Fantastic hotel but expensive... hey ho... It's Vegas!", "user": "youkillemwechillem", "date": "September 4, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 3.0, "service": 4.0}, "id": 117677750}, {"rating": 4.0, "title": "We loved the hotel", "text": "This was my first trip to Vegas as my older daughter was getting married in the chapel on a Saturday afternoon. My room was nice, clean, smoke-free, and bright, the beds were comfortable, and the pillows were great. The room had both a shower and separate tub, and there were dual sinks in the bathroom which was a nice touch. There was also a small TV in the bathroom, but it did not work. The view from the room was out over the pools, and the room was essentially quiet.", "helpfulness": 1, "user": "186394NickyS", "date": "September 3, 2011", "id": 117611357}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Now for what I did not like. The elevators were not too bad early in the morning, but by late morning and into the afternoon/evening, they were crowded beyond belief, and the wait time was unreasonable. Regarding the pools, if you did not get a lounge chair at the pools/beach before 10:30am weekends, you couldn't get near the pools, they were that crowded. I saw families head to the pools before 8am just to get chairs, and the pools got pretty crowded quickly. And, unless you thought ahead to bring your own tubes, the hotel charged you $26+ for a tube to use down the Lazy River. I actually went into that pool without one and enjoyed flowing along by myself, so you don't actually need a tube.", "title": "If you look for great service - look somewhere else", "helpfulness": 1, "user": "Petra S", "date": "September 2, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 1.0, "service": 1.0}, "id": 117570051}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We had a great stay here in September, 2012. It is a bit far from the center of the action, but with the trams, it is walkable. I agree that everything is expensive, but I saw lots of people with CVS bags coming into the hotel. At CVS you can pick up reasonable drinks and snacks to take back to your room if you want to save. None of the hotels are within walking distance of the airport, but two shuttle services are available at the airport and it is easy to arrange transport to all casinos from the airport. This casino has a wonderful water park area.", "title": "Great Stay heree", "user": "Janbo47", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 144805615}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Very clean, friendly staff. The brunch on Saturday was awesome. Very nice place, will def come back.", "title": "Great place", "user": "Dee I", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144801750}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "This is our second time staying at Mandalay Bay. Our room was very clean with comfy beds. The bathroom is very roomy and clean. The casino has a variety of slots and tables. The elevators get a little busy at times. It's a little bit of a hike to the strip but can take the train to a certain point so you don't have to walk as far if that's a concern. Would defintely recommend this hotel.", "title": ".", "user": "Susan U", "date": "November 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 3.0}, "id": 144799411}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Attended a business conference over 5 days, this is my 2nd visit and although a great place to visit, the room on the 34th floor was a little tired. Clean but possibly needs a little refurbish. As in the title the staff are very friendly and very willing to help, concierge desk was particularly helpful.", "title": "Friendly and Helpful Staff", "user": "sneferu", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 144797148}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Sorry I cannot review the pool area, as although I walked past it, I didn’t get to use it – business conference got in the way. I would recommend NOT getting a room at the top (not my choice), as you will stop many times on the way up or down!", "title": "Very nice hotel", "user": "cp6113", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144777265}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "I have stayed at 5 star resorts across the world, and really enjoyed a relaxing resort experience at Mandalay Bay. Check-in was super fast (at about 5:30pm on Friday, no waiting in line), and we had a 2 bedroom suite (28-335). The suite had a view of the pool below and amazing mountains with beautiful sunsets every evening. These suites are at the very end of the halls, and double doors open to a beautiful foyer with living room to the left, and dining area and wet bar to the right. Opposite the living room and dining room were large bedrooms, completely separated for optimal privacy. Each bedroom had a king bed, floor to ceiling windows, large flat screen TV, big closets, and huge bath w/TV. Each bath had giant 2-person jacuzzi and walk in shower. The living and dining rooms also had huge floor to ceiling windows. All blinds and curtains in the suite were operated electronically. The minibar was well stocked, and prices weren't totally insane. The suite was very clean. We used the concierge to make phone reservations to Fleur, Stripsteak, and Mix, and all meals were simply amazing (we used restaurant.com discount certificates to all three restaurants!). The pool area was very clean as well, with lots of options for both sunny and shady lounging. Inner tubes for the lazy river ride are $22 at the surf shop, so we skipped buying those and just swam with the current, which was fun. The shopping at Mandalay was also spectacular, with a variety of stores including Urban Outfitters and Lush. I had room service for one dinner and several breakfasts, and meals were delivered fast, hot, and delicious. Tip - skip the long walk to Starbucks (2 coffees for $11) and just have a large pot of coffee delivered to the room in the morning. You can call the evening before to request coffee the next morning. We had a first-rate experience and I would definitely recommend Mandalay Bay for a true resort experience.", "title": "True Resort Experience", "user": "ilona06", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144854253}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with friends", "text": "Loved the beach, everything was great all around!!! Great trip, definately would stay here again!!!!!!!!", "title": "GREAT TRIP", "user": "christine w", "date": "November 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144834994}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "We stayed here for 4 days in October 2012, there were for of us in two rooms.", "title": "Fantastic hotel", "helpfulness": 1, "user": "Claire H", "date": "November 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 144831460}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "This was our first time in this hotel, having stayed in two others on previous trips. We checked in (and out) with no problem at all, no waiting just went straight up to the front desk and did the business.", "title": "Fall Wedding 2012", "user": "Amy W", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 144807048}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled on business", "text": "The rooms were very large and extremely clean and tidy, the bathrooms were fantastic, also very large and clean. We had two very large queen sized beds in each room which were very comfortable. We had free WiFi in both rooms (which was actually quite fast for hotel WiFi).", "title": "Convention hotel with great staff", "user": "Yuubah", "date": "November 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 144806401}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled as a couple", "text": "My first trip to Vegas,not his.Our check in was a breeze, maybe 5 mins. We had a pool side view on the 33rd floor.Smoking room. House keeping was great. We did leave tips though. The only thing we didn't care for was the Red white and Blue.Staff was bad as well as the food.Other then that the staff was great ,I thought. I would not say here again ONLY because of the distance. The tram helped but cab fair adds up quick. If you get the chance go see Love. That show was amazing! Tickets sell out quick so order earley. If it is your first time in Vegas be prepaired for Sticker Shock. Yikes! I had a hard time with that! Enjoy your trip! Oh ya, if your going to work out in the Cardio Room go early to get a machine. The same with a chair at the pool 9:00 - 9:15", "title": "Beautiful Hotel", "helpfulness": 2, "user": "cuddles1111", "date": "June 12, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 112888239}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "We had a fabulous stay at the Mandalay ~ absolutely no complaints whatsoever!! We have stayed at a variety of properties in Vegas: Planet Hollywood, Luxor, Treasure Island, Paris. The Mandalay was definitely at the top of that list!! The room size is wonderful - and we got the very basic room. Loved the separate tub (bring bubble bath!). TV in the bathroom was a nice touch. We had a pool view, which was fun. We stayed on the 14th floor and liked the floor to ceiling windows. Comfy beds. Nice desk with 2 solid chairs. Housekeeping was great; they even accomodated our requests to have the room made up late in the afternoon, promptly brought towels, etc.", "title": "LOVED our time at Mandalay Bay so much, we extended our stay!!!", "helpfulness": 11, "user": "DesertDweller32", "date": "June 11, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 112778626}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "The wave pool was a blast; definitely well-supervised. The lazy river was not lazy; a good-paced current kept you moving. Yes, there's a bunch of people, but it is summer and it is hot!!! We always got chairs in a great location, and more than one each time. Yes, we went in the mornings, but even late morning things always worked out!! Hint: bring your own tube. They will cheerfully inflate it for you. Small tubes run $16, large tubes run $24. We bought ours at the grocery store at home: $2.24!!! Just plan ahead!!", "title": "terrible billing", "helpfulness": 1, "user": "cheated1234", "date": "June 10, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 3.0}, "id": 112665251}, {"rating": 2.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The casino has a good vibe. It was nice to take the tram to Luxor, and Excalibur for more playing options. Or simply take the tram to Excalibur, walk across the pedestrian bridges and you have MGM, NewYork NewYork, and Tropicana for even more choices. We've always stayed more center-strip, and didn't mind the location of Mandalay one bit!!!", "title": "Don't trust the bell desk! They are thieves!", "helpfulness": 2, "user": "kathryn1682", "date": "June 10, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 3.0, "value": 3.0, "service": 1.0}, "id": 112660870}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled on business", "text": "There are a few more restaurant choices in the Mandalay Place Shops, but walk across the street and you have McDonald's for breakfast, and Subway or Panda Express for lunch if you desire economical options.", "title": "One stop for everything", "user": "balajee09", "date": "June 9, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 112354675}, {"rating": 3.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Time for the Mandalay Bay to spend some money on up-keep and customer service quality.", "title": "Not Impressed", "helpfulness": 1, "user": "teach2nd", "date": "September 11, 2011", "detail_rating": {"cleanliness": 2.0, "sleep": 3.0, "value": 2.0, "service": 2.0}, "id": 117943138}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled as a couple", "text": "Long lines everywhere...Elevators, front desk, and even on the phone.", "title": "best pool in vegas", "helpfulness": 2, "user": "bel619", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117924526}, {"rating": 2.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "Cleanliness is lacking. Hallways dirty and worn (at least our floor), room nice, but again carpet worn, torn and in need of update. Pools were nice, but saw them being picked up only one day of our three day stay! Dirty cups, empty plates left everywhere.", "title": "Will not stay here again.", "user": "LoriWynne85", "date": "September 10, 2011", "detail_rating": {"cleanliness": 1.0, "sleep": 3.0, "value": 1.0, "service": 1.0}, "id": 117921705}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "Not enough people on staff and those working, for the most part were very unfriendly.", "title": "fabulous room, brilliant pool area", "user": "harrythedog_9", "date": "September 10, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 117901953}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "We had a very great stay in Mandalay bay. We arrived really late and i did call to let the hotel know but somehow they still cancelled my reservation. on arrival at check in their representative upgraded my room to a suite since they cancelled my room at the same price. The room was beautiful beds comfy. My only complaint was that it took 15-20 minutes just for the elevator at times.", "title": "Labor Day weekend wasa blast, but the elevator service was horrible", "helpfulness": 1, "user": "NurseladyLN", "date": "September 9, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 3.0, "service": 4.0}, "id": 117886880}, {"rating": 4.0, "stay_parameters": "Stayed May 2011, traveled with family", "text": "This is a really great hotel. We only booked the cheapest rooms but they were big with excellent bathrooms & very comfortable beds. There is sometimes a bit of a wait at reception though, but the decor is stunning so you don't really mind. A great selection of restaurants. The Aureole with the Wine Tower (someone abseils up it to get your bottle!) is great fun & the \"taster menu\" of 8 courses is superb.", "title": "Super hotel, very crowded pool", "helpfulness": 2, "user": "hazelha", "date": "June 16, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 4.0}, "id": 113886686}, {"rating": 4.0, "stay_parameters": "Stayed February 2011, traveled on business", "text": "The only fault I would find with Mandalay Bay is that the pool area is incredibly busy & noisy.", "title": "Enjoyed my stay", "helpfulness": 2, "user": "luv2laughnetime", "date": "June 14, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 4.0, "service": 5.0}, "id": 113536421}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "The Lazy River is fun, and there are several pools, but the sunbeds are packed in. It was difficult to find any sunbeds at all in the afternoon, but that is probably because people leave pool towels on them instead of returning them when they have finished. The towels are also tiny, so either make sure you ask for two or bring your own if you want one of a decent size!The music by the wave pool is loud enough on its own - when you can also hear the music from the next door pool club it gets really annoying. It's not a relaxing pool experience.", "title": "Close to perfect!", "helpfulness": 3, "user": "rubyrane18", "date": "June 14, 2011", "detail_rating": {"cleanliness": 4.0, "sleep": 4.0, "value": 4.0, "service": 4.0}, "id": 113497709}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled on business", "text": "While this hotel is at the end of the Strip there is a tram to the nearby Luxor & Excalibur which is good. And it is only a short walk to MGM, Tropicana, New York etc.", "title": "If you love customer service and water this is the place for you!", "helpfulness": 3, "user": "1951LVvacation2011", "date": "June 14, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 113488148}, {"rating": 4.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "It took a long time before our bags were delivered, so I would advise taking them to & from your room yourself.", "title": "Liked it", "helpfulness": 1, "user": "honeybear088", "date": "June 14, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 3.0}, "id": 113453042}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled with family", "text": "Mandalay Bay is a beautiful hotel with exceptional staff. They are well versed in the Vegas area and are willing to express an opinion as to what to see and do on the strip and in the surrounding areas. This is our 4th stay at Mandaly Bay and it will not be our last.", "title": "Excellents at Mandalay Bay", "user": "Barbara P", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144765424}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Everything was fantastic. If I have one complaint, it is trivial, I would like to be able to get the room temperature to go lower for sleeping.", "title": "Great Experience", "user": "Tim V", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144742128}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Extremely helpful and friendly staff.", "title": "Fantastic Hotel!", "user": "AshleyM03", "date": "November 6, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 144710719}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "Spacious room and bathroom - very clean.", "title": "Nice place to stay", "helpfulness": 2, "user": "Michael M", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 144704122}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled as a couple", "text": "Location is quite a far walk from many places but the hotel is worth it.", "title": "Is this heaven ? No, it's the Mandalay Bay Hotel and Casino", "helpfulness": 1, "user": "marlinrambler", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144689749}, {"rating": 4.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I can't complain at all. I was there on business at a greatly reduced rate due to my conference. Rooms were clean, big and comfortable. Soaking tub and a TV in the bathroom. Great for cheap nights in! Large stall shower. Big closets. One word of caution - under normal rates there is an additional \"resort fee\" so make sure you research and understand your total cost. If you intend to go during the summer months to use the pool area - there are many chairs and beautiful pools. The lazy river does not \"need\" a raft, its current is plenty strong. However, if you WANT to float - you are going to have to buy a raft. I'd recommend bringing your own (call to make sure that's ok, I really don't know). Cleaning staff was always friendly. Hint to save cash: head to the lobby desk turn right at the bell desk and go down the escalator at the end of the hall. Out the doors, across the streeet: 24 hour Subway and Mickey D's, liquor store too - that liquor store has AWESOME workers. Very friendly and helpful! Save at all times too!", "title": "Clean, beautiful rooms", "helpfulness": 1, "user": "ms_lisa71", "date": "November 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 144689471}, {"rating": 5.0, "stay_parameters": "Stayed September 2012", "text": "You can enjoy the pools by day. They are amazing!! Don't miss the pool area. There us a wave pool and several other pools for adults only and others for families and children. The clubs at Mandalay bay and The Hotel have fantastic views of the strip. I recommend going up just to see the views but look around fir the free tix to get in.", "title": "Great resort in Vegas for the weekend.", "user": "Guppy2000", "date": "November 5, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 144682128}, {"rating": 4.0, "stay_parameters": "Stayed October 2012", "text": "We really enjoyed staying at the Mandalay Bay, it was a great location and a fabulous building. The deluxe room was spacious with a good size bathroom and had a lovely view of the hotel's beach and wave pool (which was the highlight of the hotel). The resort fee is a little steep ($28 per night) but is pretty similar throughout all the big hotels. Red, White and Blue and Raffles Cafe were excellent restaurants within the hotel and I would definitely recommend anyone to stay here.", "title": "Stunning hotel with great facilities", "user": "EmilyEllis", "date": "November 5, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 144680430}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled on business", "text": "I'd stayed here the previous year as I was attending a conference here. The 2nd time round was just as good as the first. A bit of a wait for check-in and a longer wait for check-out (which I would suggest they address) but the rooms, cleanliness and facilities are second to none, they far exceed the price paid for the room thats for sure.", "title": "2nd Stay Just As Good As First", "helpfulness": 1, "user": "slimboywynn", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144661997}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with friends", "text": "Free Wifi around the resort is great, even at the beach! Plenty of restaurants, shops, starbucks, etc, and getting taxis is a doodle. I found Red White & Blue superb for food, but the best bar by far was the Irish Bar, I recommend the Fish & Chips :)", "title": "Great experience!", "helpfulness": 1, "user": "Ryerye99", "date": "November 5, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144647720}], "location": {"country": "United States", "city": "Las Vegas"}, "stars": 4, "variance": {"poor": 376, "average": 870, "very good": 1940, "terrible": 316, "excellent": 2417}, "aka": "Mandalay Bay Hotel Las Vegas", "slim_ranking": 0.174074074074, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.5}}