{"user_rating": 4.0, "review_count": 442, "name": "Mandarin Oriental Hyde Park, London", "reviews": [{"rating": 4.0, "title": "A Professional & Friendly Hotel", "text": "A wonderful location with exceptional service and friendly staff. A shame they do not have a pool and they definitely need air-conditioning in their bar at night....great if you enjoy a cigar, however.", "helpfulness": 2, "user": "NickBB", "date": "August 22, 2005", "id": 3797466}, {"rating": 5.0, "stay_parameters": "Stayed July 2005", "text": "Both the restaurants are excellent and their pricing very competitive.", "title": "Great hotel", "helpfulness": 8, "user": "asdl", "date": "July 18, 2005", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "rooms": 4.0, "service": 5.0}, "id": 3677222}, {"rating": 5.0, "title": "Great hotel, great location", "text": "Just returned from a three-week family vacation that ended with five days at The Mandarin Oriental. We had four Knights-bridge rooms and we all had a great time. All of our rooms were on the 9th floor, and all of the rooms were different. We enjoyed our views, decor, and baths. All baths were large with seperate showers and tubs. The fabrics were beautiful and I loved the Irish linen sheets. The only complaint was that two of our rooms were on the buildings end and were much smaller and plainer than the other two, though they were all priced the same.", "helpfulness": 4, "user": "A TripAdvisor user", "date": "July 10, 2005", "id": 3654738}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled with family", "text": "We were a friends and family group of 5 women, and 3 young little girls! 8 miami women off in London for the first time! We booked two connecting rooms for a good deal through AMEX. Let me tell you the rooms were impeccable and HUGE!!! The bathtub was incredible, especially when you add the blue soaking salts provided! Let me say the GREATEST thing about this hotel is the location (very close to Harrods and right behind is Hyde Park) and The SERVICE!!! The staff is EXTREMELY friendly and very very helpful!!! Thank you Mandarin!", "title": "Worth the every cent!", "helpfulness": 4, "user": "Christy K", "date": "September 16, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 5807603, "likes": {"liked": "— the staff is great!", "disliked": "— no gym, not much to explore"}}], "location": {"country": "United Kingdom (UK)", "continent": "Europe", "city": "London"}, "stars": 5, "variance": {"poor": 30, "average": 49, "very good": 100, "terrible": 20, "excellent": 243}, "aka": "Mandarin Oriental Hyde Park, London Hotel London", "slim_ranking": 0.184186046512, "description": "Set between the chic shopping of Knightsbridge and glorious, leafy Hyde Park, the iconic five-star Mandarin Oriental Hyde Park boasts London's best hotel location and a firm place in the hearts of well-heeled Londoners. As well as exquisitely furnished guestrooms (many of which have views directly across the park) guests can enjoy the hotel's world-leading spa, destination bar, two award-winning restaurants and a brand new outdoor dining terrace during summer months. Very popular for Afternoon Tea as well."}