{"user_rating": 4.5, "review_count": 853, "name": "Mango Bay All Inclusive", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "This hotel could be good if it stopped trying be be something it really is nt. All the rules and regulations are stricter than Sandy Lane with a dress code stricter than The Cliff.............but with a creek next to the hotel swimming with rubbish and filth they should really stop playing at high standards.", "title": "Should be a Saga holiday (over 70 s only)", "helpfulness": 2, "user": "abijenks", "date": "November 22, 2009", "detail_rating": {"cleanliness": 2.0, "value": 2.0, "location": 4.0, "service": 2.0, "rooms": 3.0}, "id": 49835519}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "The manageress", "title": "Nice place but...", "helpfulness": 1, "user": "ager01", "date": "November 13, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 4.0, "service": 3.0, "rooms": 3.0}, "id": 49128121}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "needs to take some customer service tips from Rondel, Jamal, Earl and Chelton - the bar staff, as these guys know how to improve that place. The service in the restaurant is far too formal- we hardly got a smile out of any of the girls (which I m sure is not their choice but the Hotels so called standards). I tried to give the manageress some feedback only to receive well practised and unconvincing lines such as \"Well we can t please everybody\". Unfortunately for the hotel, in the 10 days we were there we spoke to the majority of guests who all agreed the entertainment was diabolical.", "title": "Total relaxation", "helpfulness": 1, "user": "jcdiaz", "date": "November 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 49064079}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "I am sure that they book dull acts on purpose to send everybody to sleep- during one act more than 3 people were asleep at their table...this is clearly to save them money on the bar. Lights off by 12pm if not earlier when they get the opportunity.", "title": "Mango Bay - An Excellent Resort", "helpfulness": 1, "user": "bda1975", "date": "November 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 49010458}, {"rating": 3.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "This could be a much nicer place to go but as it stands my Grandma (who is 90) would even be bored with the evening entertainment which really lets the place down. We had to take our own suitcases up to our room after waiting over half an hour for them and the reception staff did not get back to us on any of our enquiries.", "title": "Over-rated hotel- sorry :(", "helpfulness": 3, "user": "KP24", "date": "November 11, 2009", "detail_rating": {"cleanliness": 4.0, "value": 1.0, "location": 1.0, "service": 1.0, "rooms": 3.0}, "id": 49005839}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Mango Bay is a beautiful resort located right beside many restaurants- but we never got to try them because the food in the resort was great. Breakfast was nothing special but lunch and dinner were consistently good. I loved the soups! Service at dinner was exceptional- our water glasses were never left empty. I worried that portions would not be enough for my husband (considering dinner is served) but when you are having appetizers, soup/salad, main and dessert it wasn't an issue. Definitely try the coconut ice cream.", "title": "A fantastic place for couples to hang alone or meet great people", "helpfulness": 1, "user": "BrownCND", "date": "October 16, 2009", "detail_rating": {"cleanliness": 4.0, "location": 4.0, "service": 4.0, "rooms": 5.0}, "id": 47052719}, {"rating": 5.0, "title": "Lovely hotel, beautiful spot, great service...", "text": "Our room was exactly as pictured on the website, spacious, king-sized beds, in room safe. I did not find that the rooms were well cleaned each night; basically bed was made, towels changed. The beach & pool are small and I'm sure it would be difficult to find chairs during the busy season. The beach is public so be prepared to deal with peddlers who offer everything from excursions to marijuana- this got to be very annoying by the end of the week (and security doesn't seem concerned). I have been to Mexico, Dominican & Jamaica and the ocean in Barbados was the most swimmable- little-no undertow, not super deep etc. The resort offers many complimentary activities that add great value. Glass bottom boat trip was alright; viewed a lot of the coral reef & they let you off to snorkel with fish. Trip to Bridgetown: shopping tends to be in malls or department stores, super hot that day so we sought comfort in a pub. The catamaran trip was our favorite (free) excursion, beautiful trip towards the south coast and then you jump off and snorkel with turtles! This was my first experience with turtles in the wild- they weren't shy, swam all around us (bumping into our feet and legs) and we even touched their shells.", "helpfulness": 5, "user": "EANYC", "date": "October 12, 2009", "id": 46691894}, {"rating": 5.0, "stay_parameters": "Stayed July 2009, traveled on business", "text": "There is a guest lounge that has books, games and large screen TV- all of which were pretty poor condition but not why I am in Barbados! Only one computer is available but there is Wifi in that room as well. There is also only one small bar but, again, this was fine when we visited but I wonder what will happen during high season. It was at the bar (and on the free excursions) that we met many fantastic couples from the Eastern states & Britain. We're all facebook friends now and visits are being planned. Tell the bartenders that Brad recommends the \"Bajan Smile.\"", "title": "Missing you all", "helpfulness": 1, "user": "J-Heart-Travelling", "date": "October 4, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45779390}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled with family", "text": "Other things we did: Cocktail Party at Mount Gay Rum distillery- very fun, lots of rum, create cocktails and go home with prizes! Actually, if you are buying rum, it was most affordable there (we checked at the local grocery store too). Island Safari tour was also enjoyable- you tour the north of the island in Land Rovers, great guides and at one point you drive very fast down a 'dirt road' for about 15 min of the trip. So, I would suggest saving your money and doing a normal coach tour of the island instead of paying extra for the Rovers. Oistins Fish Fry was also an experience- lots of food booths, jewelery & craft vendors, cheap beer and of course the drug dealers make an appearance too. We paid $35 US/ couple to take the bus from the hotel; if you do meet some people, maybe share a taxi- it would probably cost the same and you could come and go when you please. We also had Spa pedicures down the road (just past the Texaco) at \"Glo Salon & Spa.\" Lisa is the beautiful owner of this clean, relaxing spa- treatments are more affordable than the in-hotel spa and (from what our friend described) the pedicure was better. Saturdays are for \"puddin' and souse\" (I'm not sure if that's how you spell it)- delicous; our taxi took us to a beautiful place on Arbour road (I think) in St. John's Parish.", "title": "Puts big chain hotels to shame", "helpfulness": 2, "user": "geoffChester", "date": "October 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45641588}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Overall, a great vacation location!", "title": "Wonderful hotel - can't wait to go back!", "helpfulness": 5, "user": "lollyminky", "date": "September 29, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 45387141}, {"rating": 3.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "We spent 10 days at Mango Bay. The location is nice, the beach is abit small compared to some of the other beaches further south. The staff we very gracious and accomodating. That said, I booked this through a 3rd party at a heavily discounted rate. This was a nice place, but not a four star resort. The rooms were fairly clean, but the shower was moldy. Decorative pillows had strange stains as well. Towels were abit rough. Minor issues, but really should not exist as hotel costs $$$$. The restaurant was nice. Food was good with pretty good selection.", "title": "Mango Bay Holiday", "user": "melissamccrink", "date": "December 21, 2009", "detail_rating": {"cleanliness": 3.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 51611486}, {"rating": 5.0, "stay_parameters": "Stayed December 2009, traveled as a couple", "text": "Again, the staff were great and the hotel was nice, but not really a 4 star choice.", "title": "What a wonderful relaxing place to stay with staff that are so attentive to needs.", "helpfulness": 1, "user": "Gravesend_KentMills", "date": "December 21, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 51594736}, {"rating": 5.0, "stay_parameters": "Stayed November 2009, traveled with friends", "text": "This was our first landlocked holiday as we normally cruise. We wondered if we would not get quite the same service. WRONG! The staff cannot do enough for you. When the hotel manager is shopping with the chef for your dietary needs ~ that's called personal unobtrusive service! I have numerous dietary problems which generally means I go without - not here. Special attention to detail was made and I did not have to forgo the afternoon tea and slight changes to offer alternatives on the main menu were made. The hotel is wonderfully on the sandy beach and you sit and listen to the ocean while eating in the restaurant in the open air under a veranda NOT 30 FEET FROM THE SEA. So relaxing. The hotel is overall very quiet and a little oasis. It is made clear to all at the manager's cocktail party weekly that if you have a problem they really want to know about it thus making your and future guests stay the best they can make it. It was suggested while we were there one day that a poolside drink waiter walk round and take orders - it happened and continued daily. Everyone makes you feel so at ease and even the gardeners wish you good morning. Shireen the manager is so \"on the case\" in the management of the site and a credit to the establishment. Even on our departure the chef came out to offer me wheat free sandwiches for the plane journey home in case the food was not good! Service over and above and so thoughtful. We would dearly love to go back if we can afford it. One tip: pay the extra and have a superior room; we were offered at no extra charge a complimentary room to wash and change before our flight home which was late in the day. The room was fine but not as large or in such a good location as the superior we had by the pool on the ground floor. Well done Mango Bay.....please keep up the good work.", "title": "This is without dought one of the better hotels I've had a holiday at !", "helpfulness": 3, "user": "peterplace", "date": "December 11, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 5.0}, "id": 51058973}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled with family", "text": "We were originally booked to stay at Mango bays sister hotel, The Island inn, which which was then closed for renovation and were then offered an alternative at the Mango Bay. Looking at the trip adviser reports it mentioned part of the hotel could be noisy, as it backed onto a street of bars and restaurants, particularily at the weekend. we contacted the hotel about this and thay assured us they would not put us in the part of the hotel which could be noisy.", "title": "A fab time and a fab wedding", "helpfulness": 2, "user": "ThePoopsters", "date": "December 2, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 50517128}, {"rating": 4.0, "stay_parameters": "Stayed November 2009, traveled as a couple", "text": "I have to say say that they lived up to their promises as we were put into one of the condos which are attached to the hotel which proved to be very spacious and comfortable. The hotel is all inclusive and it certainly was, sailing,water skiing,catamaran and glass bottom boat cruises etc, the food , service and staff was first class, my thanks must go to Shireen the hotel manager who couldn't do enough for us.I would certainly go back to Mango Bay again.", "title": "marvellous mango!!", "helpfulness": 2, "user": "sauli", "date": "December 2, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 50478587}, {"rating": 5.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Stayed here for 14 nights for our wedding anniversary. Champagne and flowers in room on our arrival. This is a small hotel with a very homely atmosphere. Food was the best we have had on an all inclusive deal. Mostly a la carte with an occasional buffet. Restaurant and bar staff are very hard working and friendly . Once a week the manager has a cocktail party where she makes time to speak to all the guests.", "title": "Great place to relax and chill out.", "helpfulness": 2, "user": "mhairi1", "date": "November 7, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 48715547}, {"rating": 5.0, "title": "Best Place I have ever been", "text": "Hotel organised free trips are excellent especially the catamaran where you swim with the turtles.", "helpfulness": 3, "user": "corby10", "date": "November 5, 2009", "id": 48566082}, {"rating": 4.0, "stay_parameters": "Stayed October 2009, traveled as a couple", "text": "Mosquitos could be a problem but you can get your room sprayed every evening. Also insect repellant is advisable for the evening.", "title": "Great place to stay.", "helpfulness": 3, "user": "LAM35", "date": "October 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47655535}, {"rating": 5.0, "stay_parameters": "Stayed October 2008, traveled on business", "text": "The whistling frogs start whistling as it gets dark but you get used to it.", "title": "fantastic", "helpfulness": 1, "user": "nuttynannynoonoo", "date": "October 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47650390}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "A wonderful holiday and would recommend this hotel to anyone.", "title": "Our Wedding in Barbados", "helpfulness": 1, "user": "LisaAnneD", "date": "October 18, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 47134239}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Well after the freezing UK it was a huge relief to arrive at Mango Bay, from the moment we arrived to the moment we departured. The staff at this hotel really make you feel welcome and are keen to help, this goes right from the bar staff to the manager who reguarly walked around the hotel speaking to guests.", "title": "Excellent Choice", "helpfulness": 7, "user": "ukboi", "date": "February 24, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 25089186}, {"rating": 4.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "The food was just great, only two evening buffets in seven nights with one of those a BBQ. Otherwise steaks, salmon, veal, lamb were served and extremely good.", "title": "Most things are right and they are genuinely keen to sort out any concerns", "helpfulness": 9, "user": "KenWS", "date": "February 23, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 25002479}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Cocktails were good, Big Bannana was the best !", "title": "Another positive review", "helpfulness": 15, "user": "bread", "date": "February 17, 2009", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "location": 4.0}, "id": 24659153}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled as a couple", "text": "Only downside, pool area felt slightly cramped and personally felt the pool was to shallow, and only about one quarter is deeper than four foot. With only 5 feet at the deepest.", "title": "Magical", "helpfulness": 15, "user": "Staffordshire Traveller", "date": "February 14, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24555371, "likes": {"liked": "— The staff and food", "disliked": "— Can be noisy in standard rooms at weekends"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "We were in a standard room, and yes especially on a Sunday night it's you can hear the local nightlife. Only one thing to do, get out their and party ! You'll have a great time.", "title": "chill out", "helpfulness": 6, "user": "jimmyfint", "date": "February 9, 2009", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 24408545, "likes": {"liked": "— Food", "disliked": "— noise"}}, {"rating": 4.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We stayed at MB for 5 nights at the end of January 09. We arrived on the island around 2pm and were greeted by Bajan Car Rentals holding a sign with our name on it. He took us to our car waiting in the airports parking lot, filled out some paperwork and on our way. BCR even went the extra mile and let us follow him to a store that we questioned about so we wouldn't get lost on our way to the hotel. We would use them again only this time we would rent the mini moke and have it delivered and picked up right at the hotel and use the transfer service that was included with our trip. We only used the car 2 out of the 5 days we were there.", "title": "Great time at Mango Bay", "helpfulness": 6, "user": "darlsay", "date": "February 5, 2009", "detail_rating": {"front_desk": 3.0, "business": 3.0, "service": 4.0, "cleanliness": 4.0, "value": 3.0, "location": 4.0, "rooms": 4.0}, "id": 24235082, "likes": {"liked": "— Location", "disliked": "— Having to make dinner & Lunch reservations at breakfast"}}, {"rating": 1.0, "title": "Dirty and noisy", "text": "Arriving at the hotel: We were greeted and given rum punch which was quite good. We were very happy that we booked an ocean front room and were given room 311, which we loved... Our view was GREAT!! The bed very comfortable and shower was hot with good pressure. Our balcony was quite large and had a view of the nightly entertainment. We enjoyed listening from our balcony. Entertainment was ok, not the best but that was ok.", "helpfulness": 5, "user": "GillBrentwood", "date": "February 2, 2009", "id": 24109126}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled as a couple", "text": "The Beach is narrow and you do have to wake by 7 to claim a lounge chair on the beach. This happens most places and how can the hotel stop it?? They can't. We ate breakfast most mornings by 8am. Unfortunately you do have to make your lunch and dinner reservations at breakfast. This we did not like. But there were some days we would show up at different times and they will still take you. After breakfast we would walk the beach which was my favorite part of the day. We would walk for miles either way. Sometimes you would have to walk around some rocky areas but very manageable.", "title": "Mango Bay - Excellent Hotel", "helpfulness": 7, "user": "RobandSally", "date": "January 30, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 4.0}, "id": 24034785, "likes": {"liked": "— The room and the food", "disliked": "— Nothing"}}, {"rating": 3.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "There is a grocery store attached to the mall with some more shops within walking distance. We went to Raggamuffins on a Sunday night and had a great time. Lexy's Piano bar is also a great time.", "title": "Good hotel overall", "helpfulness": 8, "user": "Angelsrising", "date": "January 28, 2009", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 3.0, "value": 4.0, "rooms": 4.0, "location": 4.0}, "id": 23984619, "likes": {"liked": "— Pretty and good food", "disliked": "— The loud evening entertainment"}}, {"rating": 4.0, "stay_parameters": "Stayed July 2008", "text": "Our excursions included the Catamaran trip snorkeling with the turtles (A GREAT TRIP), the glass bottom boat, water skiing. All three of these things were included with your room rate and we definately recommend. The glass bottom boat didn't have much to see but husband and I sat on top deck and enjoyed the boat ride.", "title": "A good choice for an all inclusive hotel", "helpfulness": 9, "user": "chris_hoskins", "date": "January 19, 2009", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 23686783, "likes": {"liked": "— Size of the room and position", "disliked": "— Lack of free internet"}}, {"rating": 5.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "We chose this hotel for our wedding based on the good reviews on this website and we were not disappointed.", "title": "Can't fault it", "helpfulness": 6, "user": "Bubbles55", "date": "January 17, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 23638917, "likes": {"liked": "— Room, food, location", "disliked": "— Nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We upgraded to the Superior room and it was lovely - very spacious too. We had no problems with the food and enjoyed it very much. There was a different menu each night, with the couple of buffet nights. Most of the staff were friendly - always made sure though that our glasses were topped up with wine! There was also a good selection of drinks available too at the bar.", "title": "Great time at Mango Bay", "helpfulness": 8, "user": "gembug", "date": "January 17, 2009", "detail_rating": {"front_desk": 4.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 23632887, "likes": {"liked": "— The beach, the food and the happy people.", "disliked": "— Lack of beach umbrellas at times."}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "We found the availability of sunbeds no problem. If we couldn't get one by the pool, we were able to grab a couple on the beach. The beach was narrow, but this didn't bother us, nor did the swamp. We did a few of the free activities / watersports the hotel had to offer and also hired a car through reception to see the rest of the island.", "title": "Don't Believe The Website!", "helpfulness": 10, "user": "mmkm14", "date": "January 15, 2009", "detail_rating": {"front_desk": 2.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "location": 1.0, "rooms": 1.0}, "id": 23588355}, {"rating": 3.0, "title": "Good but not Brilliant", "text": "Our wedding was perfect - totally exceeded our expectations. The staff were great and did everything we wanted in organising our wedding. Our guests, who were not staying at the hotel, also commented on how great the food was.", "helpfulness": 12, "user": "nickymLondon", "date": "January 15, 2009", "id": 23572936}, {"rating": 4.0, "stay_parameters": "Stayed November 2008, traveled as a couple", "text": "I was sad to leave Mango Bay. We will be returning when we've saved up the pennies as it great holiday with lots of happy and special memories.", "title": "First time all-inclusive !", "helpfulness": 5, "user": "Brian33", "date": "January 12, 2009", "detail_rating": {"front_desk": 4.0, "business": 2.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 4.0}, "id": 23484478, "likes": {"liked": "— Fantastically clean", "disliked": "— Reserved sunbeds"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled with friends", "text": "What a holiday, from the moment we entered the hotel we were made to feel welcome. Certainly the friendliest place we have ever stayed at. The staff go out of their way to please you, the food is excellent and always served to you by a waiter/waitress with a smile. The rooms spacious and clean. Beautiful sandy beaches. When the weather is hot just try their lovely fruit punches to cool down. A well stocked bar if you want something else! Nightly entertainment was very good to. Could not fault this hotel, will definitely go back.", "title": "A lovely friendly hotel", "helpfulness": 7, "user": "Wrightones", "date": "February 9, 2009", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24400694, "likes": {"liked": "— The staff and the cleanliness of everything", "disliked": "— nothing"}}, {"rating": 1.0, "stay_parameters": "Stayed January 2009, traveled with family", "text": "If you do venture out why not try the yellow bus, The Reggae Bus, gets you from a to b very quickly with it blasting out the music, its an experience not to be missed. Great fun.", "title": "Truly terrible", "helpfulness": 11, "user": "bestthingsinlife", "date": "February 8, 2009", "detail_rating": {"front_desk": 1.0, "business": 2.0, "service": 2.0, "cleanliness": 1.0, "value": 1.0, "location": 2.0, "rooms": 4.0}, "id": 24373350, "likes": {"liked": "— Nothing at all", "disliked": "— Where on earth to start - the foul swamp, the dirty old sunbeds, the cramptness, the ugly tree outside our oceanfront room, the look of the food (truly gross) the tatoos everywhere......"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled as a couple", "text": "Definitely a holiday to remember.", "title": "Barbados is a fantastic island and Mango Bay is the ideal place to enjoy it.", "helpfulness": 7, "user": "SJCYorkshire", "date": "February 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 24367826}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "It has really been brought home to us that personal standards inevitably vary - of course they do.", "title": "Mango Bay Rocks ! - Debbie", "helpfulness": 3, "user": "DebbieDorset", "date": "February 6, 2009", "detail_rating": {"front_desk": 3.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 4.0, "rooms": 4.0}, "id": 24317536, "likes": {"liked": "— The wonderful way we were treated by the staff", "disliked": "— I would like to more available electric sockets near the mirror in the bedroom for hairdryers and straighteners"}}, {"rating": 5.0, "stay_parameters": "Stayed January 2009, traveled with friends", "text": "This hotel was accompanied by the words in the brochure - 'Enjoy new levels of excellence at this completely renovoted resort which offers great value for money too'", "title": "Another memorable stay!", "helpfulness": 5, "user": "angela22Oxford", "date": "February 5, 2009", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 4.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 24236152, "likes": {"liked": "— The bar and restaurant", "disliked": "— The umbrellas on the beach were a little 'tired' (but still worked!)"}}], "location": {"country": "Caribbean"}, "stars": 4, "variance": {"poor": 28, "average": 76, "very good": 215, "terrible": 21, "excellent": 513}, "aka": "Mango Bay Hotel Holetown", "slim_ranking": 0.666666666667, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.5, "rooms": 4.5, "location": 4.5}, "description": "Mango Bay Barbados is ideal for those seeking the convenience of an ALL-INCLUSIVE beach vacation combined with the personal and friendly service of a small resort. It enjoys a sought-after beachfront setting in St. James, on the famous west coast of Barbados.There are restaurants, bars, boutiques and cinema just steps away from Mango Bay in lively Holetown, including the brand new, upscale, LIMEGROVE LIFESTYLE CENTRE across the road from the resort. Mango Bay is approximately a 45 minute drive from the airport, and a 25-minute drive south of the hotel takes you to the capital Bridgetown. Mango Bay definitely gives you added value for an all inclusive hotel- included is a complimentary two-hour catamaran cruise to see the turtles, waterskiing & a glass bottom boat ride."}