{"user_rating": 4.5, "review_count": 32, "name": "Manoir de Longeveau", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled as a couple", "text": "I attended the wedding of my son to his beautiful wife in the delightful Manoir de Longeveau and it was such an outstandingly wonderful experience that it is hard to do it justice in words. Over 100 guests were accommodated in luxury over a week in this rural retreat. The management and staff are friendly, courteous and adaptable. The food was top quality on all occasions. The golf, the various pools and play areas, the lovely open expanse of countryside, the exclusivity of having the place to ourselves, the comradeship which the hamlet afforded, the ability to pop in to visit in the many houses, play cards til dawn indoors, walk out the door at dawn and ramble where the whim took you or sleep all day; the big wide bar with pool table and piano was the centre of much fun til the early hours, the vast expanse of the venue made it a wonderful place to spend time in and all age groups were well pleased with facilities all round. Allow two hours from Bordeaux airport for comfort (use Bonne and St. Aulaye route)and go and indulge yourself in this idyllic hamlet in the rolling pastureland of Dordogne/Chartente beside the magical village of Aubeterre-sur-Dronne. The couple engaged the services of a wedding planner from UK who lives locally and is accustomed to working with Longeveau and every minute detail was executed with precision and efficiency so that the bridal couple could enjoy themselves to the hilt and guests were just quietly provided with every comfort and service in a happy, unobtrusive manner. I recommend Manoir de Longeveau to any bride and groom looking for value for money and a good time at a high quality venue where much of the staff speak English. The wedding banquet was held outdoors in the courtyard, and this was early May. The band in the evening were fantastic (as was the duo during the day) and the DJ kept the dancing in full swing til 5am when the bride and groom finally took their leave of the guests. I am so happy that the wedding abroad was such a memorable, enjoyable, positive experience. Thank you Longeveau!", "title": "Delightful Manoir de Longeveau", "user": "jeancan", "date": "June 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 132214520}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with friends", "text": "Longeveau is situated in beautiful part of rural France and offers great facilities - tennis, swimming and a challenging 9-hole golf course.", "title": "Great Location, Great Gites", "helpfulness": 2, "user": "pbeswetherick", "date": "June 11, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131733787}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "Food is available from the restaurant but we can't comment on its quality as we chose to eat out at some really good value restaurants we found in the neighbouring villages of St Severin, Aubeterre and Riberac.", "title": "Manoir de Longeveau", "helpfulness": 2, "user": "StAlbans82", "date": "June 7, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 131467200}, {"rating": 5.0, "stay_parameters": "Stayed May 2012, traveled with family", "text": "But the best part of our stay was the superb quality of our gite, la Petite Ferme. We gather that It had been fairly recently totally renovated and it had been done so to a very high standard. It has kept its rural feel whilst at the same time offering modern comforts (eg excellent en suite showers). The bedrooms and the open plan kitchenand lounge area were all very spacious.", "title": "Great venue, great people", "helpfulness": 2, "user": "Bridgt100", "date": "May 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 130784535}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "Outside there's a lovely shaded eating area which we used every day for our breakfasts and for our late evening night caps.", "title": "Amazing Wedding and Holiday", "helpfulness": 2, "user": "Ray-Eire", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123208740}, {"rating": 4.0, "stay_parameters": "Stayed September 2011, traveled with friends", "text": "I had to write after reading the review from MollyMaloo.", "title": "I will be going back ...", "helpfulness": 3, "user": "UnitedCIreland", "date": "January 12, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122965033}, {"rating": 3.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We spent a week in Manor de Longeveau in September 2011 and enjoyed every moment of it. Everyone is laid back there but not to the point that they are not helpful. We, like MollyMaloo, arrived early and yes we did have to stroll to the bar to find a staff member but once we introduced oursleves we were made most welcome.", "title": "Not as good as it thinks it is..........", "helpfulness": 4, "user": "MollyMaloo", "date": "September 11, 2011", "detail_rating": {"cleanliness": 3.0, "sleep": 4.0, "value": 3.0, "service": 2.0}, "id": 117952889}, {"rating": 5.0, "stay_parameters": "Stayed September 2011, traveled as a couple", "text": "We found the staff at all times friendly and helpful. Not in your face constantly asking if you were ok but when you needed assistance it was given and when you wanted to chat they chatted and were always most helpful.", "title": "A great place to relax in France", "helpfulness": 2, "user": "Alan322", "date": "September 11, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 4.0, "value": 4.0, "service": 5.0}, "id": 117938531}, {"rating": 5.0, "stay_parameters": "Stayed June 2011, traveled with family", "text": "I don't have children so I can't really comment on that side of things.", "title": "perfect wedding", "helpfulness": 2, "user": "wearethebryants", "date": "July 8, 2011", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "value": 5.0, "service": 5.0}, "id": 115149438}, {"rating": 4.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "Regarding the language, I always tried to speak French to all the staff, and despite the fact that some of the staff were English they would always reply in French if I began in French.", "title": "Beautiful", "helpfulness": 2, "user": "DanielleWales9", "date": "May 21, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 109161776}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We stayed at Le Manoir de Longeveau for a week in September as part of a wedding party and had the most relaxing holiday we've had in a long time, a great place to relax with a book and a glass of good wine or beer, and when you feel like activity there is a Golf course, Tennis courts, swimming pool and then you have the wide open beautiful French countryside food enough for the soul, Great for walking cycling or visiting nearby beautiful villages and towns, the whole area is steeped in history", "title": "Beautiful relaxing and very friendly", "helpfulness": 2, "user": "valgdublin", "date": "October 11, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 82984433}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "It is well worth a visit and all I can say is we will be back there as soon as the pocket permits", "title": "Best holiday - already booked for next year", "helpfulness": 3, "user": "acf67", "date": "September 5, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 78376761}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "We have just returned from a really relaxing (but quite active) break with our three kids aged 11,10 and 7. We stayed in Le Potager, one of the gites up the hill (5 minutes walk, 40 seconds down on a bike and about 2 minutes back!) from the main manoir. The gite was well equiped (bathroom and shower room, good sized living area and nice kitchen - two fridges and dishwasher and slept 6 in 3 bedrroms. It had a really nice private garden, equipped with BBQ and table chairs and umberella. The main manoir has the tennis and golf. I chose the place after googling for golf (mainly for me) and tennis (mainly for my wife) in France.", "title": "Beautiful no buts!", "helpfulness": 1, "user": "plattfamily", "date": "August 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 74420670}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled on business", "text": "This is what we liked about it - we were welcomed by Lynne (Rick and Lynne are the owners) who proceeded to tell me all about other children who were staying and were of similar ages to ours. We like to self cater, but the food at the restuarant was all fresh, good and not too anglicised, although a little expensive (but it does save driving out as the place is nicely remote).", "title": "Beautiful but.....", "helpfulness": 3, "user": "DroitwichCaffrey", "date": "August 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 73865628}], "location": {"country": "France", "region": "Poitou-Charentes", "continent": "Europe"}, "variance": {"poor": 0, "average": 1, "very good": 9, "terrible": 0, "excellent": 22}, "aka": "Manoir De Longeveau Hotel", "slim_ranking": 1.0}