{"user_rating": 4.5, "review_count": 347, "name": "Mantra Marina", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "We stayed in a ground floor lake front apartment. The apartment was spacious, very comfortable and beautifully furnished. Very much a home away from home. The views of the snow capped mountains were breath taking. These apartments are relatively new and tastefully decorated.", "title": "FABULOUS!!!!!!!!", "user": "kazkap", "date": "September 17, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 79965271}, {"rating": 4.0, "stay_parameters": "Stayed August 2010, traveled solo", "text": "The apartments are out of town, however, we had a car so this was not a problem to us. If anything it was nice to get away from the hustle and bustle of the town to a quiet retreat at the end of each day, as Queenstown can be a bit of a party zone. It is about a 5 minute drive and would pose a problem though if you did not have a car. We loved the peace and quiet, a nice place to come back to after a busy day of skiing.", "title": "Amazing view from the hotel!", "user": "NYCtraveler1016", "date": "September 13, 2010", "detail_rating": {"service": 4.0, "cleanliness": 3.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 79433165}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "When I first arrived at the accommodation, I couldn't believe the view of Frankton Arm/Lake. It was breathtaking! The bathroom definitely is wheelchair accessible as the door, shower and bathroom were designed that way. I wished my room was more inviting/warm feeling. Also, understanding that the hotel apt is eco-friendly, I had hope for separate hair cleaning product dispensers for the body wash/gel dispenser. Instead, it was a 3 in 1 dispenser. Also, I don't need my linens changed everyday (as I was only there for 2 nights) but would like for the bathroom to be vacuumed. As a girl with long hair, strands of hair are inevitable after every blow dry. I do wish the sink/counter was wider for toiletries. The heated tiles in the bathroom was a nice touch. The heater in the room worked as well. The LCD TV on the wall could have been bigger (13 inches is quite tiny) especially if that's all that is hanging on the wall. The staff (Wayne and Russell) were very friendly and helpful with suggestions and advice. The hotel is a bit far from the town center, but you can easily take a bus there and will take you there in 10-15 minutes. The bus stop is a few steps away. Very convenient. The airport is only a few stops away too. No need to take a cab as the bus fare was only $4NZ to the hotel. Again, the bus practically drops you right in front of hotel. The reception is only open from 8am to 7pm. But if there is something urgent, you can call the \"operator\" and they will respond to your request (I didn't make any calls after 7pm). Overall, friendly staff, nice hotel. If you have more people traveling, you can get an apartment with a kitchen and a view.", "title": "Perfect in every sense in a spectacular part of NZ", "user": "maccanzleeds", "date": "September 9, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 78919708}, {"rating": 5.0, "stay_parameters": "Stayed March 2010, traveled with friends", "text": "From arrival, to enjoying the luxurious apartments, to the friendly and welcoming management we were \"wowed\" in every facet. Our stay here was the highlight of a very enjoyable trip to Queenstown, one that will provide fond memories in years to come.", "title": "Modern, clean, quiet & great views", "user": "travelmystic", "date": "September 4, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 78188380}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We had a 2 bedroom, kitchen & dining area full suite with a balcony overlooking the pinnacles and lake. The apartment was very clean and comfortable with an connecting studio unit, giving us a 3 bed & bath total. This allows for lots of privacy for groups but a communal area for gathering. Our views were excellent but not all rooms would have these same views from inside. We loved being able to walk along the lakeshore early in the morning and at sunset without any crowds but if you want to be in the heart of the nightlife this place is NOT for you. You can walk into town in 30 min. or drive in 5.", "title": "Absolutely Fantastic", "user": "Sheep51", "date": "September 3, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 78169854}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled with family", "text": "OMG, everything about this place is worth raving about! This is by far one of the best places I've stayed in and definitely the best one in NZ for me. The guys at the reception were great, pre-empted us to possible flooding in Queenstown, telling us which areas to avoid, and alternatives for us. I guess it was lucky that we drove so we had no problems getting to Queenstown or the Remarkables Shopping area. The room was in tiptop condition, very modern, very spacious. The ducks that came to our balcony were a bonus and definitely amused my little toddler. It was a real pity that we stayed only 2 nights as I loved every minute of my stay here. Highly recommend it esp for families with kids who can't sit still, like mine!", "title": "Highly recommended", "user": "deminet", "date": "May 10, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63699992}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "This was the nicest place we stayed at on our honeymoon. I had read the great reviews on this website and it definitely did not dissapoint! Fantastic spacious apartments with everything you could need. A wonderful place to stay - we will be back!", "title": "Best Accommodation on our Honeymoon", "user": "Slav_9", "date": "May 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 63157307}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled on business", "text": "Only stayed one night - should have been a week.", "title": "Not cheap but good value", "user": "denboa1", "date": "April 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62833855}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled as a couple", "text": "The room was huge - well, a family apartment actually. Looked like it had just been renovated - it was spotless.", "title": "Modern Apartments complete with Ducks!", "user": "MarkNz", "date": "April 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 62783469}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "Modern, clean, well appointed. HUGE bed.", "title": "Stunning modernity", "user": "VeriHappitraveller", "date": "April 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 61109608}, {"rating": 5.0, "stay_parameters": "Stayed January 2010, traveled with friends", "text": "Stayed here Jan 2010 for 2 nights as part of a birthday treat for our friend. The whole place had the wow factor. Beautiful understated furnishings, excellent equipment , everything you could want in a holiday appartment. Is a bit out of the CBD but that is exctly what we wanted. We had the downstairs lakeside view and it was lovely. May have had a better view up the lake from upstairs but it was still fine. Short drive to a retail park out the airport way where we stocked up at a large supermarket. There are various resaurants there too. You are spoiled for choice for eating places in the town though. Can't wait to go back on our next trip in 2012. Front of house staff were very helpful and friendly.", "title": "SOOO classy", "user": "Jinty Campbell", "date": "July 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 71627825}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "from the time we arrived we were made to feel very welcome.", "title": "absolutley amazing so relaxing", "user": "kiwiiana", "date": "July 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 71079268}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "on entering our apartment it just felt so lovely it was very clean very warm the heatpump must have been turned on prior to our arrival it was just toasty.the outlook was very relaxing out to the lake .The apartment was furnished just beautifully we would stay over and over again thankyou so much karen and john", "title": "Best holiday apartment", "user": "mymumi", "date": "July 6, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 69849808}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled with family", "text": "We recently stayed for 5 days at a Mantra Marina 3-bedroom apartment. We chose the lake view and it was worth every cent! The lake was right at the back. The scenery was unbelievable. Location was excellent, quiet but not too far from the town centre (about 10 minute bus ride, with the bus stop right outside the apartment complex). Our apartment was very clean, very spacious, modern and comfortable. There's an en-suite to every room! The kitchen was fully equipped. The whole experience during our stay was pleasant. My 10-year old boy fed the ducks every day. The only rather unpleasant experience was finding off & expired (from 2008!) milk in the bar fridge in 1 of the rooms. I guess most clients don't use the milk from the room, so it was never checked. Another glitch was because there were 6 of us, one of us didn't get enough hot water for shower 2 of the 5 nights we were there. Still, this is the best holiday apartment we've ever stayed.", "title": "Luxurious & modern!", "user": "jungfraujoch", "date": "June 5, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 66526025}, {"rating": 5.0, "stay_parameters": "Stayed February 2010, traveled as a couple", "text": "We stayed at the Marina Mantra on 7th & 8th May.", "title": "Best accommodation we have stayed in anywhere in the world", "user": "edunhamRedditch", "date": "May 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 64367727}, {"rating": 5.0, "stay_parameters": "Stayed August 2010", "text": "We loved this place! Our family first stayed at Mantra Marina in 2009 and we returned in 2010. I would definitely stay here again! The apartment was modern, spacious, clean, and very well appointed. The kitchen had all the mod cons. Each room had a bathroom of its own. We stayed both times in a 3BR lakefront apartment - the views of the lake and the snow capped mountains are spectacular! It is a located a bit out of town, (which means it is quiet and peaceful) but if you have a vehicle then it isn't a problem, and if you don't, well, there is a bus stop just near the apartments. The staff at reception are courteous, helpful and very knowledgeable about the area. It is a great place to stay!", "title": "What more could you want???", "user": "arewethereyet_16", "date": "September 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 77912551}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "will definently recomend this stay to everyone. went very smooth. was like it was our home.", "title": "very clean,nice and new, very big rooms, awsome... very nice staff too.", "user": "shumackenator", "date": "August 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 77595988}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "thanks", "title": "Beautiful apartment with great views!", "user": "sgpoonch", "date": "August 26, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 76908027}, {"rating": 5.0, "stay_parameters": "Stayed July 2010", "text": "The Mantra Marina was probably the best apartment that we stayed in during our recent NZ trip. The apartment was modern, clean & spacious. In addition to that, we had a great view of a lake & snow-capped mountains. We also had a washer/dryer in the apartment which made washing a breeze... The hosts were great too, helping us book a last-minute helicopter ride in less than half an hour...", "title": "Totally AMAZING,", "user": "Spathiphyllum", "date": "August 20, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 76088517}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "If it was closer to the town center, this apartment would be perfect!", "title": "Total Satisfaction", "user": "KeeperSydneyNSW", "date": "August 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 75241771}], "location": {"country": "New Zealand", "region": "South Island", "continent": "South Pacific"}, "stars": 5, "variance": {"poor": 5, "average": 15, "very good": 51, "terrible": 4, "excellent": 272}, "aka": "Mantra Marina Hotel", "slim_ranking": 0.0533333333333, "detail_rating": {"service": 4.5, "cleanliness": 5.0, "value": 4.5, "sleep": 4.5, "rooms": 5.0, "location": 4.0}}