{"user_rating": 4.0, "review_count": 441, "name": "Mantra Mooloolaba Beach Resort", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled on business", "text": "My husband and I stayed here for only one night for his christmas party and we were pleasantly surprised!", "title": "Beautiful spacious apartments in a great spot!", "helpfulness": 3, "user": "TraceyT5445", "date": "November 5, 2007", "detail_rating": {"front_desk": 4.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 3.0, "location": 5.0, "rooms": 5.0}, "id": 10623217, "likes": {"liked": "— Kitchen", "disliked": "— Small bed"}}, {"rating": 5.0, "stay_parameters": "Stayed October 2007, traveled with friends", "text": "The room itself was huge with a great kitchen, lounge room and bathroom! The bathroom had a spa bath that had a glass wall between it and the bedroom!", "title": "Lovely apartments", "helpfulness": 4, "user": "Bella36", "date": "October 21, 2007", "detail_rating": {"front_desk": 3.0, "business": 2.0, "service": 3.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 4.0}, "id": 10190859, "likes": {"liked": "— Location and Spa bath", "disliked": "— No Restaurant"}}, {"rating": 5.0, "stay_parameters": "Stayed August 2006, traveled as a couple", "text": "The verandah was a little small but the wonderful view made up for it!", "title": "Fabulous beach getaway", "helpfulness": 3, "user": "LouReid", "date": "October 19, 2007", "detail_rating": {"front_desk": 2.0, "business": 4.0, "service": 2.0, "cleanliness": 4.0, "value": 4.0, "location": 4.0, "rooms": 5.0}, "id": 10130089, "likes": {"liked": "— Location is superb", "disliked": "— Staff were snooty and unhelpful"}}, {"rating": 5.0, "stay_parameters": "Stayed February 2007, traveled with friends", "text": "The position of this hotel can not be beat! You're right above the shopping at Mooloolaba with plenty of choices for restaurants!", "title": "Excellent", "helpfulness": 6, "user": "Todd_82", "date": "August 26, 2007", "detail_rating": {"front_desk": 5.0, "business": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 8511747, "likes": {"liked": "— Everything", "disliked": "— Can't think of anything"}}, {"rating": 2.0, "stay_parameters": "Stayed July 2007, traveled as a couple", "text": "We stayed here for 3 nights as part of a 5 week tour to Oz. The Mantra apartments are in a great location on the main promenade and directly opposite the gorgeous beach. There is a nice pool on site with the Coles supermarket accessed from the back door of the complex.", "title": "Nothing special....", "helpfulness": 8, "user": "mbarry", "date": "July 23, 2007", "detail_rating": {"front_desk": 3.0, "service": 2.0, "cleanliness": 1.0, "value": 2.0, "rooms": 2.0, "location": 4.0}, "id": 8224897, "likes": {"liked": "— The location, ocean views", "disliked": "— That it felt like it hadn't been thoroughly cleaned in a while"}}, {"rating": 4.0, "title": "Great facilities and location", "text": "My husband and I stayed at the Mantra Mooloolaba for a week. It was great! Our room was nicely presented, clean and spacious. We had all the cooking/washing facilities we needed, as well as access to a well appointed gym and 2 pools (although it was too cold to use the outside one!).", "user": "Angelco", "date": "July 21, 2008", "id": 18085717}, {"rating": 4.0, "title": "Good times at Mantra", "text": "Car parking is secure and reception staff were helpful and friendly. There are a lot of restaurants very close to the Mantra and a Coles supermarket right nextdoor. No complaints.", "user": "kiwigirlmady", "date": "June 23, 2008", "id": 17166136}, {"rating": 5.0, "title": "Great holidays at Mantra", "text": "My hubbie and I just stayed at the Mantra for a pre baby get away. We requested a high up ocean room view and we got what we wanted. Althought there is actually a high rise in front so it will always just be a partial view. Great balcony with great views for a sunny breakfast and easy access to the esplanade and great ice creams. Would defintely stay again, especially as we got a good price (didn't include servicing though so if you want this check first).", "user": "samnleigh", "date": "June 12, 2008", "id": 16868154}, {"rating": 4.0, "title": "Perfect Position", "text": "This was the third time we have stayed here. We love the location on the esplanade, the ocean views and all the great cafes and restaurants located nearby. Everything has been to our satisfaction. We have found all the facilities first rate. Our favourite restaurant is the moroccan restaurant Semos. We always enjoy eating there. The food is fantastic and the prices are reasonable. We will continue to holiday at Mantra Mooloolaba.", "user": "JofromLondonUK", "date": "May 9, 2008", "id": 15828055}, {"rating": 4.0, "title": "Great stay, enjoyed every minute", "text": "Hubby and I temporarily living on Gold Coast, Australia and needed a few days break, we love The Sunshine Coast for short breaks as only 2 hours drive. We have stayed in a few apartments in this area and this is definitely the best. It is right opposite the beach and is situated on The Esplanade where there are great shops [excellent for beach wear, shoes, bags etc] nice restaurants & coffee bars. A supermarket is right next door and the apartment is kitted out with kitchen facilities so you can mix and match eating out/in. Good outdoor pool and a reasonable sized indoor pool. We had a high room so great view. The one and only comment is that for those slightly infirm the shower is one of those step in the spa bath jobs so please be careful. Would definitely return if the price was right [we had a half price deal.]", "user": "sneezydownunder", "date": "November 13, 2007", "id": 10785668}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled solo", "text": "I stayed at the Outrigger Mooloolaba for 3 nights in Jan 2007 and had a very pleasant experience. The staff was courteous and the room was tastefully outfitted (interesting bathroom; and with washing machine). MP3-stereo, TV. The view (even from the 4th floor) was great overlooking the outdoor pool and beyond that the beach and surf. The hotel is at one end of the main strip with many restaurants and convenience stores; didn't need the car at all. Overall, very pleasant and satisfactory. Would stay there again.", "title": "Very nice relaxing place", "helpfulness": 3, "user": "bc399", "date": "January 23, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 4.0, "value": 4.0, "rooms": 5.0, "location": 5.0}, "id": 6650302}, {"rating": 5.0, "stay_parameters": "Stayed December 2006, traveled with family", "text": "Recently spent a great weekend with family at the Outrigger.", "title": "Spectacular View", "helpfulness": 4, "user": "Errol C", "date": "December 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6349403, "likes": {"liked": "— Balcony views", "disliked": "— Second bedroom"}}, {"rating": 5.0, "stay_parameters": "Stayed June 2006, traveled as a couple", "text": "The 2 bedroom units which we had are located on floors", "title": "Excellent, excellent but not perfect.", "helpfulness": 6, "user": "ARealistic_Traveller", "date": "November 1, 2006", "detail_rating": {"front_desk": 3.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 6043906, "likes": {"liked": "— Spacious quality with ocean views and a spa!", "disliked": "— Two minor hiccups on arrival - nothing major!"}}, {"rating": 4.0, "title": "Is a nice apartment", "text": "12 to 15 so you are guaranteed a spectacular view well above any traffic noise.", "helpfulness": 1, "user": "robert&bobby", "date": "October 18, 2006", "id": 5968028, "likes": {"liked": "— bathroom (it's big)", "disliked": "— no room service"}}, {"rating": 4.0, "stay_parameters": "Stayed April 2006, traveled as a couple", "text": "The unit was very clean with quality modern fittings and appliances. The second bedroom was a little on the small side for two adults but this is the only criticism I would have.", "title": "Great Views and Rooms", "helpfulness": 6, "user": "queenjojo02", "date": "September 26, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 4.0}, "id": 5837438, "likes": {"liked": "— Quality of the room, also has a great pool and two spas", "disliked": "— The light coming into the bed in the bedroom - very annoying!"}}, {"rating": 5.0, "stay_parameters": "Stayed April 2007, traveled with family", "text": "This hotel is an absolute gem. It has everything you could want. We stayed here for 3 weeks during February / March and it was the ideal base to explore South East Queensland. Mooloolaba itself is a lovely resort with plenty of bars, restaurants and shop to satisfy most people. There is a Coles Supermarket at the back of the hotel, which can be accessed straight from the rear of the Lobby area. Shops and restaurants are adjacent the Lobby area….the Moroccan Restaurant was particularly good. If you wanted good value food and drink, then there were two Pubs front and back of the hotel which were well worth visiting. The views from the balconies are all ocean view which is a great plus. The apartments are excellently furnished with everything you need for a long stay. We even managed to cook a few meals during our time there. The hotel has an indoor and outdoor pool, which were not overcrowded, and we used the indoor pool and gym at the end of every day…there was never more than a handful of people using them. During our stay, the hotel switched from being the Outrigger to the Mantra (1st March) we even witnessed the inauguration ceremony at the front of the hotel (see photos). All the staff at the Mantra were excellent, especially the Reception staff, who couldn’t do enough to make your stay as pleasurable as possible. The bathroom had a wonderful Shower / Spa Bath unit, and a clothes Washer / Dryer, which we used regularly during our stay. The Kitchenette had a Fridge, 2-ring electric hotplates, kettle, and toaster and was more than adequate.", "title": "An Absolute Gem!", "helpfulness": 16, "user": "zggb0b", "date": "April 18, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 7390038, "likes": {"liked": "— Everything !", "disliked": "— Nothing !"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The only thing that I could criticise, is that Broadband Internet Access was advertised as available. This was not the case. Fortunately, I was able to take my laptop to the Internet Café which was a block away, about 100 metres to the right of the Hotel entrance, and used the broadband connections there…it was no big deal.", "title": "Still a very good resort", "helpfulness": 6, "user": "redfan", "date": "April 3, 2007", "detail_rating": {"front_desk": 5.0, "service": 4.0, "cleanliness": 5.0, "value": 5.0, "rooms": 4.0, "location": 5.0}, "id": 7276922, "likes": {"liked": "— location and helpful staff", "disliked": "— nothing"}}, {"rating": 5.0, "stay_parameters": "Stayed March 2007, traveled as a couple", "text": "The hotel was in an ideal location to visit all the towns and attractions in SE Queensland. There was some great places to visit in the Hinterland, such as the Glass House and Blackall Mountains, Australia Zoo, Montville, Maleny, Ettamogah Pub, etc. We also visited quite a few beaches..Peregian Beach was our favourite. We also visited Noosa, Caloundra, Maroochydore, and, of course, Eumundi which has one of the biggest Markets in the area. We just loved the whole place and can’t wait to come back. We will definitely be staying at the Mantra.", "title": "Wonderful experience", "helpfulness": 6, "user": "NewZealandTravellers", "date": "March 15, 2007", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 7165600, "likes": {"liked": "— Location and the View"}}, {"rating": 5.0, "title": "Fantastic Mooloolaba!!", "text": "Have just returned from our 3rd visit to Mooloolaba and the Mantra. Although it has now changed hands, the staff have remained and are as great as ever. We had an early check in which is just what you need after a long flight from the UK and a late check out as we were not leaving until middle of the afternoon. The apartments are large enough and the views are fantastic. The whole resort is very clean and well maintained. The location is great, everything you need is nearby. We would recommend this resort to anyone.", "helpfulness": 10, "user": "firebucket", "date": "February 25, 2007", "id": 6839049}, {"rating": 5.0, "stay_parameters": "Stayed January 2007, traveled as a couple", "text": "As a travel agent I had high expectations of this resort and was not disappointed. The apartments are modern with fantastic views out over the beach. The resort is just over the road from the beach and is in a great location. Close to shops, a supermarket and wonderful places to eat. The staff were friendly and helpful and we could not fault our stay at all. The surf club is just a short stroll and great for a good value meal and cold drink, but there are plenty of other options as well. I would highly recommend this resort.", "title": "Great apartment ,excellent value", "helpfulness": 6, "user": "spangle2", "date": "January 25, 2007", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 6692492, "likes": {"liked": "— location to the outdoor pool"}}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 20, "average": 63, "very good": 193, "terrible": 16, "excellent": 149}, "aka": "Mantra Mooloolaba Beach Hotel Mooloolaba", "slim_ranking": 0.363636363636, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}