{"user_rating": 3.5, "review_count": 188, "name": "Mantra on Hay", "reviews": [{"rating": 2.0, "stay_parameters": "Stayed September 2006, traveled as a couple", "text": "We booked the Saville Suites in Perth, Western Australia for 4 nights in September and booked a 1 bed apartment. When we got to the hotel, it was 1:30 in the afternoon and we were told that the room was not ready until 2pm! how pathetic! when we got in the room, we had just come off a 5 hour flight and wanted to go sleep, so we opened the bed and there was blood stains on the sheets and filth on the pillow, and used toilet paper on the toilet, no hand towel although there was a towel rail for a hand towel and there was a massive stain of human URINE all down the side of the toilet!", "title": "Filthy hotel, massive cockroach in rooms!", "helpfulness": 5, "user": "DeVito", "date": "October 18, 2006", "detail_rating": {"value": 1.0}, "id": 5966704, "likes": {"liked": "— Nothing!", "disliked": "— everything!"}}, {"rating": 5.0, "stay_parameters": "Stayed September 2006, traveled on business", "text": "It was proberely the most dirtiest room i have ever seen for a 4* hotel, but then again we have stayed in 3* and 2* and the rooms have been cleaner! We complained to recpetion and they tried telling us that the urine stain was from a rusty nail! yeah right! and that the blood on the sheets was a stain from the washing machine! i have never been told so much rubbish to my face before! We changed rooms and got a bottle of champagne, but the new room was still quite dirty and on the day we left there was a massive cockroach walking around the floor, we got out so quick we were 5 hours early for our flight to Sydney! By the way, Sydney is a much better city than Perth!", "title": "Great hotel for families and couples.", "helpfulness": 4, "user": "JetsettingOzpatriot", "date": "October 8, 2006", "detail_rating": {"front_desk": 5.0, "business": 4.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "location": 4.0, "rooms": 5.0}, "id": 5929022, "likes": {"liked": "— Neat, clean and affordable.", "disliked": "— Nothing really however, some may find it a bit out of the way as it is not in the central CBD such as Sheraton etc."}}, {"rating": 5.0, "stay_parameters": "Stayed May 2006, traveled with family", "text": "Definetly not a recommended hotel, its in quite a rough part of town and alot of drunks and roung people hanging around at night. The restaurant accross the road from the hotel is very poor, they charge the same amount for breakfast as the hotel do and do a buffet, talk about price fixing!", "title": "Staff were fabulous!", "helpfulness": 7, "user": "flo75", "date": "August 30, 2006", "detail_rating": {"front_desk": 5.0, "service": 5.0, "cleanliness": 5.0, "value": 5.0, "rooms": 5.0, "location": 5.0}, "id": 5726217, "likes": {"liked": "— fantastic service", "disliked": "— leaving"}}, {"rating": 4.0, "stay_parameters": "Stayed June 2006", "text": "Not recommend!", "title": "Great service and friendly staff.", "helpfulness": 6, "user": "travelandwork", "date": "June 14, 2006", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "rooms": 4.0, "service": 5.0}, "id": 5349596}], "location": {"country": "Australia", "continent": "South Pacific"}, "stars": 4.5, "variance": {"poor": 24, "average": 45, "very good": 68, "terrible": 17, "excellent": 34}, "aka": "Mantra On Hay Hotel", "slim_ranking": 0.724137931034, "description": "Mantra on Hay is an ideal base for business and leisure travellers visiting the lively city of Perth. Located on the eastern side of Perth’s CBD, Mantra on Hay is within close proximity to several of the city’s major local attractions.Mantra on Hay consists of hotel rooms and one and two bedroom apartments. All rooms and apartments have been styled to reflect the easy-going, laid-back charm of Perth. Apartments have large balconies, fully-equipped kitchens, bathroom and laundry facilities, lounge and dining areas.Guests will enjoy the on-site leisure facilities including a rooftop swimming pool and gym equipment. Cornerstone Kitchen & Bar is conveniently located on-site and is open for breakfast, lunch and dinner daily."}