{"user_rating": 4.0, "review_count": 585, "name": "Many Glacier Hotel", "reviews": [{"rating": 4.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Another of those one of a kind old wooden hotels built in the early days of the National Parks: wood beams, open fireplaces, huge dining room. One of the other guests described it as having a charm similar to that of the old wooden rollercoasters. It's not a luxury resort, but it is on a beautiful lake with access to several walking paths and a couple of long hikes which take you to some spectacular scenery and very near a glacier. The rooms are spartan, but clean and reasonably comfortable. One drawback is that parking is a 10 minute walk from the hotel up a hillside.", "title": "Grand old antique hotel from the early National Park days", "helpfulness": 2, "user": "MandJ-Hawaii", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46323538}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I stayed at the Many Glacier Hotel at the end of August. We had researched this hotel on Tripadvisor and knew what to expect in terms of its age, the type of room we were likely get, services, etc. (no TV, college age servers, noisy) The location of this hotel can't be beat, the view from the porch is unparalleled and to stay there is overall, a very special experience. One of the highlights of our trip was meeting a wildlife videographer while sitting by the fire in the lobby - he had experienced a bear encounter that day resulting in the closure of the Swiftcurrent Trail and this was fascinating. On the flip side, if you take the time to look at the old photographs lining the hallways, you can see that the MG is currently an inappropriately \"updated\" version of its old, authentic self - there are dropped ceilings and drywall covering beautiful old wood and huge beams, things are inappropriately painted and look cheesy, the lobby has a built out gift store that is terribly inappropriate in terms of maintaining an authentic ambiance, the big stone fireplace on the side of the main floor lobby (not the center one that everyone sits around) is actually blocked by trash cans and recycling bins - what?? and many other details that, when taken together, really cheapen the whole national park lodge feeling that could be possible there. Also, the hotel makes absolutely no use of its downstairs level (which also has a big beautiful fireplace), nor the outside area right next to the lake - there is literally nothing there and is completely wasted as a cool place where people would probably love to sit and look at the lake. Clearly, there is a lot of wasted potential there that someone with some money and vision could do a lot with in terms of making this place spectacular. On the whole, the place is a little bit sad, but we enjoyed our time there so we would definitely go back and stay.", "title": "Many Glacier Hotel - perfect location, needs renovation back to old days", "helpfulness": 3, "user": "witgirlDetroit", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 46289023}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "This hotel is one of the classic national park beauties. The rooms are plenty large (especially when the main attractions are outdoors) and have lovely clawfoot tubs that are appreciated after hiking all day. The standard rooms don't have the beautiful view, but the main lobby deck has chairs for enjoying the view so you really don't need to pay the extra $ for the view. The Ptarmingan dining room was excellent and the bar has a nice selection of local brews.", "title": "What a beautiful place!", "helpfulness": 2, "user": "sedwickkj1", "date": "October 8, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 5.0, "rooms": 3.0}, "id": 46283347}, {"rating": 4.0, "stay_parameters": "Stayed June 2009, traveled as a couple", "text": "We stayed here this summer. This was a our favorite hotel in Glacier. Pay for a room with a lake view - with the sun hardly setting in the summer, you get a gorgeous view even if you wake up in the middle of the night. Enjoy a drink on their deck overlooking the lake. Simple rooms. Rustic, cozy place. Lots of bulky tourists inside, but peaceful outside. Very helpful activities desk links you up with free ranger-led hikes each day.", "title": "Stunning Views - so totally relaxing", "helpfulness": 3, "user": "CarolinaGirl27517", "date": "October 8, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 46233714}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "Many Glacier was our first night of multiple nights in the Glacier/Banff/Jasper National Parks. This is an excellent base from which to walk and see many other interesting points in Glacier - not to mention the bears, goats and wildlife that is just so close! Highly recommend having a nice glass of wine to watch the sun go down behind the mountains and then plan for a nice dinner in the main restaurant. Nice level of service and good food. Before staying here you need to understand it is an older hotel, rooms are small, things are not fancy and there are no TVs - you are in a National Park! However, you are right next to nature and beautiful mountains, lakes and such. One thing for sure - steer clear of the coffee in the little self-service store...we all were heating it up in the microwave in order to have decent coffee!! Everything else was very nice though. Be sure to take the very leisure walk around Swiftcurrent Lake and also the trails to Josephine and Grinnel Lake. While several miles, it is low impact and a beautiful walk.", "title": "Great Views and Perfect Base for Beautiful Walks", "helpfulness": 5, "user": "MexCityTravelers", "date": "September 27, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 44996747}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "Incredibly wonderful ate. Hotel old and so-so but offset by location. Took a day trip to Waterton and saw bears with babies -- a must side trip!", "title": "Gorgeous Area", "helpfulness": 3, "user": "mcchrystal", "date": "June 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 3.0, "location": 4.0}, "id": 68360722}, {"rating": 2.0, "title": "If you're looking for luxury or a warm room, this is not the place for you", "text": "The views from the hotel are absolutely amazing. We chose a room with a balcony (unfortunately, the only room available with the balcony had 2 twin beds) that overlooked the lake and the gorgeous mountains. We arrived on a pretty wet and cold evening. The hotel lobby was very inviting and warm with it's huge fireplace. This is about where our experience went downhill....we went up to our room, opened the door and it felt like we had walked into a freezer - I'm pretty sure it was about the same temperature on the inside as it was on the outside. We cut the heat on as high as it would go and it took hours to warm up to an acceptable temperature which was probably 65 degrees or so. The airlines had lost our luggage which became even more painful because we didn't have too many options for adding layers of clothing to keep us warm. Because of our luggage situation (it was delivered the next morning, which was the day we were checking out), we had asked for a late check-out to give us time to shower, change clothes, etc after our luggage arrived and were told it was not possible. We would not have requested a late check-out if not for our luggage situation. I left feeling really disappointed. On a good note, the horseback trail rides that leave from Many Glacier (not operated by the park) are unbelievable and I would recommend them to anyone!", "helpfulness": 2, "user": "Wink2010", "date": "June 21, 2010", "id": 68243920}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "My friends and I LOVED staying at Many Glacier. It's right on the lake and it's a perfect spot to sit and take in the beauty of Glacier National Park. We stayed in a \"value room\" that had a double and twin and we were a little worried before check-in, but once we opened the door to our room all our anxiety left. It was sooooo cute and was perfect for us!", "title": "A great National Park lodge!", "helpfulness": 2, "user": "allovertheplace11", "date": "June 20, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 68125218}, {"rating": 3.0, "stay_parameters": "Stayed June 2009, traveled with family", "text": "Now, let me also say that this is a historic hotel, so, as expected, there was a creaking from the room above and the walls didn't have the best sound insulation, but as I said, you're in a historic hotel, that's part of the package!!", "title": "Awesome Lake View ...Rooms old.", "helpfulness": 3, "user": "Ptourist", "date": "May 17, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 3.0, "sleep": 2.0, "rooms": 2.0, "location": 5.0}, "id": 64447401}, {"rating": 5.0, "stay_parameters": "Stayed August 2008, traveled with family", "text": "We didn't see any of the other lodging for the park during our stay, but all three of us would recommend Many Glacier in a heart beat. It was a highlight of our trip. Oh, and their bellmen wear lederhosen too! What more could you ask for?!?!", "title": "Can't wait to get back", "helpfulness": 4, "user": "BarrettNichols", "date": "April 14, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 3.0, "location": 5.0}, "id": 61287685}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled with friends", "text": "I have very mixed feelings about the Many Glacier Hotel. It’s operated by the park’s designated vendor and offers guests the opportunity to be immersed in the heart of the park’s beauty. But we had numerous negative experiences that made us question our decision to stay there for three nights.", "title": "Definitely can do better", "user": "Muriel12", "date": "July 8, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 2.0, "sleep": 1.0, "rooms": 2.0, "location": 4.0}, "id": 70155748}, {"rating": 1.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "As we pulled entered this side of the park, we were immediately struck by the exaggerated grandeur of the mountains in this area. It was just spectacular. Right before the hotel, we pulled over to take a quick stroll on a path and were greeted by a moose. Minutes later, bighorn sheep walked within 3 feet of us.", "title": "Stay Away from this Lodge", "helpfulness": 8, "user": "HendersonNVTraveler", "date": "July 3, 2010", "detail_rating": {"service": 1.0, "cleanliness": 1.0, "value": 1.0, "sleep": 1.0, "rooms": 1.0, "location": 3.0}, "id": 69569687}, {"rating": 4.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "We were traveling with a group of 6 and had reserved 3 rooms. All rooms had been guaranteed at the time of reservation to include shared balconies overlooking Swiftcurrent Lake (and confirmation letters included this information). But upon check-in, only 1 of the 3 parties was given a room with a balcony. No one at the desk could explain the error, and no one was willing to offer a solution. I finally asked if any of our parties could be moved after the first night and was curtly told “No.” This was the first of a string of experiences with poor customer service.", "title": "Great Hotel", "user": "twokidstwocats", "date": "June 29, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 69135871}, {"rating": 2.0, "title": "Don't visit for the food.", "text": "All 3 rooms varied considerably. Two had wood floors; one had nasty industry carpeting in desperate need of replacement. Two had showers only while one had a shower/tub combo. All three rooms had various sized beds in them. And all three rooms had the sink in the main area of the room, apart from the toilet and shower. Our faucet leaked non-stop, which seemed ironic in light of the “We’re Green” literature that was peppered throughout the room.", "user": "MSRPhoenix", "date": "June 28, 2010", "id": 68985573}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "In comparison to our room at Apgar Village Inn, I was immediately struck by how UNCLEAN our room at Many Glacier Hotel was. I walked by one bed and a stream of dust bunnies poured out. During our 3-night stay, the floors were never swept or vacuumed. The toilet was never cleaned. From what I could observe, the only housekeeping duties performed were haphazard making of the beds and replenishing of toiletries.", "title": "Worth it, Worth it, Worth, it!", "helpfulness": 4, "user": "MTGO", "date": "June 24, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 68565302}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "Great location and spectacular view from this hotel, but I found it \"old\" and not very comfortable as the other hotels in the park that I've stayed. We had to climb three floors (with heavy luggage) to get to our room and the best we could do (with reservations made over six months before) was two twin beds and a view of the parking lot. The beds were not comfortable and the bathroom way cramped. I had to wonder if the Swift Current Hotel would not have been a better choice (closer to most of the hiking trails, a restaurant and grocery) and cheaper. I thought for the exorbitant amount we payed that it would have at least been comfortable.", "title": "a little disappointing", "helpfulness": 4, "user": "arrow628", "date": "January 11, 2010", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 3.0, "rooms": 2.0}, "id": 53212605}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "The location makes the stay worth it, but the same dollar gets you a lot more luxury in the cities. However, this Glacier Park location is unique. It's off the beaten path of the heavily traveled Going to the Sun Road and gives you more of the rustic national park experience you're probably looking for. Try to get the lake side rooms as you'll be spending all your lobby time on that side. Do take the wooden boat ride. You ride the first one to the other end of the lake, walk about a mile to board another wooden boat. No reason to travel all this way and miss this experience.", "title": "Charming and deservingly rustic", "helpfulness": 5, "user": "bibguy", "date": "November 23, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 49900355}, {"rating": 5.0, "stay_parameters": "Stayed June 2007, traveled as a couple", "text": "This place is an incredible place to stay. While on the old fashioned side, the view coupled with the isolation from the commercial world, just can not be beat. We stayed here in June 2006, and returned for a repeat visit in 2007. When people see the pictures (that we took from our balcony) they can not believe we stayed here. They always ask, \"Where in Europe was this taken?\"", "title": "Incredible view, reminiscent of the Alps (where I have also visited.)", "helpfulness": 2, "user": "meorff", "date": "October 10, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 46498045}, {"rating": 5.0, "stay_parameters": "Stayed September 2008, traveled as a couple", "text": "As far as the room was concerned, it did get a little warm in the afternoon, but always cooled off by the evening. Remember, it's old fashioned, so there are only the bare elements here. Also, one must take into consideration the parking lot. From the hotel, it is a four or five flight climb to the parking area. In spite of this, we love to stay here and plan to return next year.", "title": "Many Glacier Hotel has the most spectactular scenery in Glacier National Park.", "helpfulness": 2, "user": "2Travelers59", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 46461815}, {"rating": 5.0, "stay_parameters": "Stayed September 2009, traveled as a couple", "text": "This is a historical old hotel . The lobby is warm and welcoming with a huge center fireplace and many sofas and chairs to sit and look at the view, enjoy a book, or have a drink. There are wall to wall windows with a view of the lake and Many Glaciers. There is a porch with adirondike chairs off the lobby. From the porch you can see bears. There are old historic boats docked here to take scenic tour or guided hikes of the glacier. We saw a family of mountain goats walk by the hotel. There is a grand dinig room with spectacular views. We had breakfast here daily. In the evening, we ate in the pub or the lounge area with a view of the lake. The menu was casual and not as expensive as the dining room. There is also a snack bar at the lower level of the lobby where you can buy food, beer or wine and bring it up to the main lobby, if you want to save money. The hotel is isolated so we didn't want to leave at night to dine elsewhere. The rooms are old, but well maintained and clean. There is no TV in the rooms, so many people enjoy the lobby in the evening. I would defintely stay there again. It is a perfect location to enjoy the surrounding National park. There are short trails around the lake or access to many longer, more difficult trails", "title": "It's all about the setting", "helpfulness": 5, "user": "bnjsmith", "date": "October 10, 2009", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 3.0, "rooms": 1.0}, "id": 46448570}], "location": {"country": "United States"}, "variance": {"poor": 63, "average": 98, "very good": 238, "terrible": 26, "excellent": 160}, "aka": "Many Glacier National Park", "slim_ranking": 1.0, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.5, "rooms": 3.0, "location": 5.0}, "description": "Built in 1914, Many Glacier Hotel is situated on the shores of Swiftcurrent Lake and rests at the base of Mt. Grinnell inside Glacier National Park. The hotel has 214 rooms and offers a fine dining restaurant, lounge, après fondue, gift shop, and snack shop. Red Bus tours, boat cruises, and other activities, including David Walburn’s evening entertainment are available at this Swiss-style lodge. All guestrooms at Many Glacier Hotel are rustic, yet comfortable. In keeping with the era in which the hotel was built, the rooms offer guests modest amenities and old-world style accommodations resulting in a one-of-a kind, National Park lodging experience."}