{"user_rating": 4.0, "review_count": 692, "name": "Mar Ipanema Hotel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled solo", "text": "TripAdvisor once again was a lifesaver in helping me choose this hotel as there are many bad hotels in Rio. This one is clean and safe and exceptionally well located in Ipanema. Hotels in Rio are very expensive compared to most other places, but comparatively this was not over priced.", "title": "Ask to borrow a chair/umbrella/towels for the beach; nice brewpub/restaurant next door", "helpfulness": 1, "user": "sfchris", "date": "January 21, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123416738}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "I have nothing bad to say about this hotel. The staff were very helpful - I accidentally brought the wrong power converter and the man at the desk let me borrow his personal one for several days. They offer free umbrellas, chairs and towels to take down to the beach (about 2 blocks). Fantastic!", "title": "Excellent choice!", "user": "Marc B", "date": "January 19, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123314858}, {"rating": 5.0, "stay_parameters": "Stayed January 2012, traveled with family", "text": "And after sitting in the sun for the day, I liked sitting outside in the adjoining brewpub/restaurant and having a beer and people watching. This restaurant is quite popular with the locals at night. The food was decent as was the mornings breakfast which are also served there.", "title": "Perfect hotel. Best city!", "helpfulness": 1, "user": "Luizasch", "date": "January 17, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 123200459}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with family", "text": "Ipanema is an upscale and safe area, my Brazillian friends in the USA recommended I stay there rather than Copacabana and they were very right. The beaches are cleaner and the atmosphere just feels much more secure.", "title": "Great hotel in a great area", "user": "Sei R", "date": "January 14, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 123084917}, {"rating": 4.0, "stay_parameters": "Stayed January 2012, traveled with friends", "text": "There is a grocery about a block away. The Girl from Ipanema walked to the beach just a couple streets over from here. Enjoy your time in wonderful Ipanema!", "title": "Great location, serviceable hotel, small (but adequate) rooms", "user": "alexisl007", "date": "January 13, 2012", "detail_rating": {"service": 5.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 123038124}, {"rating": 4.0, "stay_parameters": "Stayed December 2011", "text": "The staff were nice and very helpful. The buffet breakfast was quite good, with many options (pastries, fruit, breads, cereals, eggs, sausages). This was served in the restaurant next door, but dont ear there for lunch or dinner, it wasnt very good. There are other really nice retaurants in the area, such as The Market just up the street. The bed was big and very comfortable, but the room was small and the bed took up most of the space. The bathroom was good. The hotel didn't seem to be near public transport, so we caught taxis which was expensive.", "title": "Nice hotel, expensive but good by Rio's standards.", "user": "EVKildog", "date": "December 17, 2011", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 4.0, "service": 5.0, "rooms": 4.0}, "id": 121839339}, {"rating": 5.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "We expected the worst as Rio is extremely pricey and we were travelling during a busy weekend. But after reading reviews on Tripadvisor we decided to book and we were thrilled with our stay. The hotel is right along a busy street and very, very safe (right in Ipanema) - 4 blocks from the lagoon and 1 block from the beach. Plenty of restaurants and shopping right outside the hotel. The rooms were very clean, modern and spacious (there was even a desk, chair and mini bar). While we felt $250USD per night was pricey initially, for the location and service it was worth it = safe neighborhood, clean modern hotel and great service (reasonable price relative to other hotels in area, Rio is just an expensive city for accommodations).", "title": "Way better than expected - great boutique hotel", "user": "spunkypunky", "date": "December 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121783171}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled as a couple", "text": "We stayed in the Mar Ipanema over New Year's 2011. Because it is a very busy time of year in Rio we had difficulty finding accomodation and were worried about Mar Ipanema, because it wasn't one of the highly rated hotels at the time (I see the rating has increased since we were there). Also, due to it being during Rio's peak season, the hotel rates were substantially higher!", "title": "Great location", "user": "LilaSA", "date": "December 8, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121508010}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled with friends", "text": "However, we were pleasantly surprised! The hotel was comfortable, very clean, well-run and accomodating. The room itself was very comfortable with modern wood laminate flooring. My only problem with the room was that the shower in the bathroom was a little bit cramped and the toilet didn't work 100%.", "title": "Perfect Location", "user": "Mojopin66", "date": "December 5, 2011", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 121415727}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled as a couple", "text": "The front desk staff were overall helpful, albeit not always that friendly.", "title": "Nice, clean, convenient hotel but small rooms.", "user": "Succubussoo", "date": "December 1, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 121294522}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "Mar Ipanema Hotel is located in the heart of a busy and safe area, just two blocks from the eponym famous beach. Our room was ok with a nice bathroom, but with a single glass window, noise from the street was very annoying. Restaurant Devassa is a nice place where we had a good breakfast, and also had a couple of drinks later in the evening.", "title": "Could be much better", "user": "AuldCom", "date": "January 4, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 122528124}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "At the end of our stay, we had a midnight flight. We asked for a courtesy room to have a quick shower but the person on reception replied it wasn’t possible, like it was the first time he faced such a request … With little improvements, this hotel could become a good value.", "title": "Great choice in good area", "user": "TheBiffs", "date": "January 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 122509822}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "We stayed here for 4 nights over christmas. We chose a deluxe room which had huge king size bed and large shower. Linen good quality and room smelled and looked clean & fresh (apparently mould can be problem due to humidity). Large breakfast selection and friendly reception. Located 2 blocks from beach on main shopping street in centre of Ipanema with plenty of restaurants & bars around. Would definitely stay here again.", "title": "Excellent hotel, location and great staff!", "user": "Anamasg", "date": "January 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 5.0}, "id": 122433096}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "I stayed at the Mar Ipanema for Xmas 2011 and had a blast. The location was very central , extremely convenient to the beach and shopping. The rooms were clean quite spacious and contemporary in style. The staff was very kind and helpful ,most were fluent in English. I would definitely recommend this hotel and would stay there again tomorrow.", "title": "Perfect Location", "user": "Helder F", "date": "January 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 2.0, "rooms": 4.0, "location": 5.0}, "id": 122394862}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "The good about this hotel is it's perfect location (2 blocks from Ipanema Beach). The area is very secure for Brasil standards.", "title": "Great Location, nice and clean hotel, great staff!", "helpfulness": 1, "user": "KarlSATX", "date": "December 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 122161869}, {"rating": 4.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "My husband and I just arrived back home after a cruise from Rio to Buenos Aires. We flew into Rio a day before our departure and spent the night at Mar Ipanema. The hotel is very clean...the lady at the front desk communicated very well in English. Their website is right on as to what to expect from this hotel. We felt safe at all times walking around in this area. Breakfast was great but very crowded. They assisted us in getting a taxi to the port the next day. I will recommend this hotel to my friends.", "title": "Perfect little hotel in a great location", "user": "Sue A", "date": "December 26, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122120243}, {"rating": 3.0, "stay_parameters": "Stayed December 2011, traveled as a couple", "text": "Great location, but expensive. You're paying to be right by the beach and that's about it. The staff were friendly and efficient and the breakfast just ok. The rooms are badly lit but reasonably sized, and our's was slightly rough around the edges; knobs were faulty and the furniture a bit worn and torn. Overall, our experience was good - but don't expect much more, even though in other places considering the price, you would. You can walk to the beach in minutes, which is a definite plus.", "title": "Perfect location, in the heart of Ipanema - but expensive.", "user": "ethansparty", "date": "December 25, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 122088029}, {"rating": 3.0, "stay_parameters": "Stayed February 2011, traveled with friends", "text": "the location is the highlight of this hotel; it is located in the heart of Ipanema (Rio's trendier beach), but is also walking distance to Copacabana. The hotel is very modest and in North America it would be considered a 2 star. The hotel bar at nights is a meeting point for people from different countries to exchange notes and share trip ideas.", "title": "small and friendly hotel", "user": "adila9119", "date": "December 22, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 122006897}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled with friends", "text": "In an area where you famously do not get a lot for your money, this hotel was a really pleasant surprise. Just two blocks from the beach close to the Ipanema/Leblon border the hotel is in a really vibey shopping area with great restaurants dotted all around. Everything in the room (we booked superior which was not much more expensive) was brand new and the service was impeccable. The rooms were very very small so I'm not sure I'd trust a standard room, and I did ask for a high floor owing to traffic noise which helped. The breakfast is good, in the adjacent bar which is connected to the hotel but quite badly laid out and gets very busy so people were tripping over each other to reach tea/milk/sugar and so on. I think they are trying to save money by not giving you sugar sachets but one big bowl, which just added to the congestion, and this should be looked at. However, for the price I do not think there is a better or cuter hotel in such a good location.", "title": "Great, stylishly refurbished hotel in the heart of Ipanema", "helpfulness": 1, "user": "SamuellaG", "date": "December 22, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 121988710}, {"rating": 5.0, "stay_parameters": "Stayed December 2011, traveled solo", "text": "This hotel is A1 value for money, Ipanema is by far a better area than Copacabana and this hotel is right in the centre of it all. I found the staff extremely helpful, arranging tours, transport and even acting as a translator for me as I arranged a trip to Iguacu falls through a travel agent (they recommened a few for me, as their tour company did not do them). It is a 30 second walk to the beach, amongst amazing restaurants and designer shops, a completely safe and brilliant area. They even helped out with acquiring a UK plug adaptor (I forgot mine). Brekky was great, a mix between hot and cold, the mini bar stocked, wifi access super fast. For a Sth America hotel I would definitely say 4*. I used them for tours to Christ the Redeemer and Sugarloaf, both amazing, It is located more at the far end of Ipanema so is a 30 min lazy stroll down to girl from Ipnamea park and Copacabana, but seeing the beachside life makes the stroll worth it. It is not a honeymooner romantic paradise, but it is absolute bargain for the location and what is on offer. No pool (slight downside, but with the beach so close, who cares)", "title": "Absolutely brilliant value for money !", "helpfulness": 1, "user": "CharlotteBT", "date": "December 21, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 121965039}], "location": {"country": "Brazil", "continent": "South America", "city": "Rio de Janeiro"}, "stars": 4, "variance": {"poor": 27, "average": 112, "very good": 349, "terrible": 19, "excellent": 185}, "aka": "Hotel Mar Ipanema", "slim_ranking": 0.0980392156863, "detail_rating": {"service": 4.0, "cleanliness": 4.5, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}