{"user_rating": 4.0, "review_count": 338, "name": "Mara Sopa Lodge", "reviews": [{"rating": 3.0, "stay_parameters": "Stayed March 2011, traveled as a couple", "text": "We stayed in room #65 for two nights. The location is amazing. Monkeys everywhere. Watched Masaii dancers perform and hyenas feeding. The room was fine – comfy – no telephone or TV. Nice little porch. Water and electricity is available at specific times (no hot water or electricity during the day, no hot water after 10pm). The food is just awful – almost inedible for lunch and dinner – breakfast by far the best, make sure to eat a big first meal. There is absolutely no soundproofing between rooms – you will hear *everything* your neighbors say/do. Staff is nice and helpful. There’s a small bar downstairs, next to hyena feeding area, where the staff goes and there are few tourists – check it out. Have lots of small-bill shillings, as you'll need/want to tip all the time. Had amazing game drives. Loved the ride in, looking at all the Masaii people.", "title": "Amazing location, good staff, bad food, no room privacy", "helpfulness": 2, "user": "MaineIzzy", "date": "April 3, 2011", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 2.0, "sleep": 1.0, "rooms": 3.0, "location": 5.0}, "id": 102678052}, {"rating": 4.0, "stay_parameters": "Stayed March 2011, traveled with friends", "text": "What a great place to relax. We booked this through a tour company Silverbird Adventure Tours and Travel (more on this in a minute). I really did not know what to expect. The rooms are large. They are not modern with no TV's but this doesn't matter when on safari. The food is amazing and the service is excellent. I visited with friends, but I would certainly go back with my family. The lodge is in the park and within 15 minutes you are seeing Lion, Elephants etc etc. Thanks Sopa.", "title": "Great Stay", "user": "saintsUK", "date": "March 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 99419130}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled with family", "text": "Regarding Silverbird Adventure, not again. Out of 5 of us three of our credit cards were cloned as a direct result of booking through them. They may offer reasonable prices but you will run the risk of your credit/debit card being cloned, thus having no money for your holiday of a lifetime.", "title": "Fantastic stay in Masai Mara- 6 star service", "user": "Shellems", "date": "March 2, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 98628327}, {"rating": 5.0, "stay_parameters": "Stayed February 2011, traveled as a couple", "text": "I cannot praise this lodge highly enough. From the beautiful rooms which are kept immaculately clean to the fantastic food and friendly service. The people are wonderful and nothing is too much trouble. It really is like a home from home. All the staff go out of their way to help and make you feel welcome and they are particularly fantastic with children.", "title": "Beautiful surroundings and a wonderful pool", "user": "JumpinJackFlash60", "date": "February 19, 2011", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 97183490}, {"rating": 5.0, "stay_parameters": "Stayed December 2010, traveled with family", "text": "The food was wonderful, so much choice and so well cooked, our waiters Lawrence and Michael were charming, funny and helpful. Our room housekeeper David was polite and helpful.", "title": "Great lodge. Readily recommended.", "user": "HappyTraveller234", "date": "January 29, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 94888292}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "This was our third and final Sopa Lodge and we stayed for 2 nights at the end of a fantsatic safari. First impressions were good, although the lodges at Amboseli and Naivasha are better, in terms of ambience and service. This lodge seemed more crowded and noisier (from the guests) but maybe this was due to the fame of the park, so expected I guess.", "title": "Overall a good stay but some issues", "helpfulness": 1, "user": "EssJayWhy", "date": "October 15, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 5.0}, "id": 83585264}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The rooms were smaller than at other lodges but had a shared interior lounge outside the door between 2 rooms (which we never used) and a nice balcony. This was the only lodge where I had interrupted sleep due to noise from neighbours - banging windows/shutters for ages into the small hours, typical as we had to get up at 4:30 for our game drive! I think if we had gone to Mara Sopa first we would have been blown away- but had been spoilt by the other 2 lodges first!", "title": "Worth the long long drive to get there", "user": "wexbabs", "date": "October 12, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 83215804}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "The food was OK- but again not anywhere as good as the other lodges (quality and choice) and they ran out quite a few times of some things. One time there were no desserts at all left at 9 oclock and we had to ask the chef to bring them all back out of the kitchen! We did however, keep reminding ourselves that we were actually staying inside the Masai Mara park and we all experienced the long and bumpy road to get there- so really we were amazed we had food at all!", "title": "MAGICAL", "user": "Priya080808", "date": "October 10, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 82894728}, {"rating": 4.0, "stay_parameters": "Stayed October 2010, traveled as a couple", "text": "The pool area was small but nice with a fantastic view to the park below. At night there are bush babies that get fed in the main bar area, which was fun to watch as they scamper over the rafters above your head! We discovered another bar on the last night by chance (there are no signs to it!) and played a game of pool followed by a view of the feeding station (and saw a striped hyena and white tail mongoose).", "title": "Good, considering how remote it is from the city", "user": "FIandML", "date": "October 7, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 82510129}, {"rating": 5.0, "stay_parameters": "Stayed June 2010, traveled with family", "text": "The location of the lodge is good- a short drive to get back to the park gate before heading out on the main drag- the park was truly awesome and was definitely our favourite park of the safari. We saw so many lions and cheetahs, with cubs and their kills, and finally got to see those vulltures!", "title": "Excellent Stay", "user": "NYCruiser914", "date": "October 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 81887997}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Quite exotic location and lovely surroundings. Thoroughly enjoyed with very helpful staff", "title": "Lovely intoduction to a safari holiday", "user": "yanhLondon_England", "date": "November 18, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 87459440}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "My 19 year old daughter and I stayed here for 2 nights in early November. It was a great base for our wonderful safari in the Masai Mara! The lodge was close to the safari roads, the staff was very accommodating and the food was very good. Our room was clean and comfortable. In the evenings, we enjoyed watching the feeding of animals including hyenas, jackals and bush babies--a nice touch! If you want a lodge that is comfortable but not over the top, this is a great choice.", "title": "Great Location and Value!", "user": "Chris50617", "date": "November 8, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 86395709}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "We stayed at the Mara Sopa Lodge for 2 nights during our trip to the Masai Mara. The lodge was in a fantastic location to access the game park quickly and easily and from the outside looked quite authentic. On closer inspection the hotel was a bit run down and could have done with a lick of paint. The staff were friendly and helpful but due to the size of the hotel, lacked basic communication with their counterparts and so came across as a slightly disorganised team.", "title": "Nothing to write home about", "user": "Lovemyholidays3", "date": "November 3, 2010", "detail_rating": {"service": 2.0, "cleanliness": 3.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 85810245}, {"rating": 3.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "We arrived just in time for lunch which was buffet style set up in a large airy dining room. Unfortunately the chefs had tried to cover too many food options therefore creating too many less than average dishes which did not improve for breakfast or dinner.", "title": "close to the action", "user": "Glors", "date": "October 22, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 84492247}, {"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "Our room was adjoined to one other room which would have been fine apart from that we could hear almost everything our neighbours were doing! The rooms were spacious though with a large comfy double bed, mosi net, electricity and a huge shower. Unfortunately the mosi net was not long enough to reach the floor so would have been useless if there were more mosis.", "title": "An authentic Kenyan Experience", "helpfulness": 1, "user": "kaveriMuthana", "date": "October 22, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84397601}, {"rating": 4.0, "stay_parameters": "Stayed December 2010, traveled as a couple", "text": "We stayed in two nights here in Sopa Lodge during our safari (I don't actually know how expensive it was to stay here, since transfers and game drives as well as the accomodation were all included in the price of the trip). The journey to Mara Sopa was really interesting (read: the last two three hours were bumpy and we saw many broken vehicles on the way) since the road was in very bad condition, but immediately after arriving it was like another world. Clean, nice place in order.", "title": "Great meals!", "helpfulness": 1, "user": "Jellona", "date": "January 9, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 92306197}, {"rating": 4.0, "stay_parameters": "Stayed January 2011, traveled with friends", "text": "The location of the lodge was just outside the Masai Mara National Reserve, but you don't have to drive through the gate every time you go to the game drives. The lodge is located up on the hill, but the view isn't especially nice, and usually blocked by trees. There are some small monkeys on the area, and many baboons just outside. But the lodge area is surrounded(?) by metal fence, so large animals can't get in, I think. Electricity as well as hot water was available in the morning and in the evenings (electricity also shortly in the afternoon). The rooms were big and nice, bathrooms with shower. The mosquito net around the bed wasn't mosquitoproof, but all the windows were equipped with nets, too. And perhaps they sprayed the rooms daily, at least there was a weird odor inside after the game drive...", "title": "another beautiful unique hotel", "user": "lylialondon", "date": "January 8, 2011", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 5.0}, "id": 92224058}, {"rating": 4.0, "stay_parameters": "Stayed November 2010, traveled with friends", "text": "There was pool, but otherwise there aren't many activities in the lodge. Just a bar... and one tv in the bar, the only one(?) in the whole lodge, I think. So if you come here, make sure your days are full of game drives. But the meals were suberb! Even though I didn't eat any cold dishes (bad experiences from previous trips in other places), I always ate a lot. Especially BBQ dinners with many meat varieties were delicious, as well as warm pancakes (made by a chef in front of our eyes) were my favourites. I really miss those meals... But you had to pay for all drinks (not included)!", "title": "Good start to a wonderful safari", "user": "PWCMD", "date": "December 28, 2010", "detail_rating": {"service": 3.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 90891834}, {"rating": 4.0, "stay_parameters": "Stayed August 2010", "text": "Some people say that the eastern side of Masai Mara isn't as good for wildlife watching as the western side. It's hard to compare if you haven't visited the western side, but I think you can see all the most important animals also near Sopa Lodge. On our second day we drove about 120 kilometres (I had a GPS with me) and didn't go west of Keekorok. Still we saw four out of Big Five. Elephants and lions were plentiful (lions were easy to spot, since usually there was five cars or so around them...) as well as buffalos. We also saw a lonely rhino, so I think we were lucky... We also saw a carcass taken to a tree by a leopard, so those shy cats were somewhere nearby, too... In addition we saw giraffes, many antilopes (wildebeests etc.), warthogs, ostrichs, zebras and so on. We even saw a lonely hippo, which was quite a surprise, since our guide thought that we are not going to see those unless we drive half a day to Mara river (in addition there was some hippos next to Keekorok lodge, but they live in an artificial pool)... The only bad thing in Mara Sopa, considering game drives, is that you have to leave every time to same direction, and to reach Mara river or any western areas of the park you have the spend much of the day for transfer drives... But as I said, you can see actually all the most iconic animals in the eastern side, too. At least if you are lucky...", "title": "Good Lodge but away from wildlife", "user": "godbolem", "date": "December 27, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 90766773}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled with family", "text": "we are happy to live in this unique hotel, it is in Masai Mara national park. but it is difficult to find it because of lack of sign. the room, hotel, clean, food all are good. We checked in in new year eve , happy surprised that there is a free cocktail party! and Masai dancing!", "title": "Good choice in Masai Mara", "user": "goshan", "date": "December 1, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 88750441}], "location": {"country": "Kenya", "continent": "Africa"}, "variance": {"poor": 15, "average": 59, "very good": 161, "terrible": 8, "excellent": 95}, "aka": "Mara Sopa Hotel", "slim_ranking": 0.704761904762, "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}