{"user_rating": 4.0, "review_count": 258, "name": "Mardan Palace", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "A lovely, tranquil property. Stylish, large rooms. Mardan Palace is great from the impeccable service, to the decor, to the elegance. The courtyard is especially beautiful and a great place to chill out. I normally don't like breakfast buffets but this one is not only really good but also is clearly a big draw among the Antalya elite, who come on Sundays with their families. Sitting in the couryard, among the beautiful gardens, is a great way to start any day. Antalya itself has far more to do than one would think. The cultural exhibits alone, from the museums to the archeological sites, are top-notch. Seraser Restaurant, which were recommended by our concierge was a great choice for dinner in lovely Kaleici, oldtown of Antalya.", "title": "A lovely, tranquil property in a great city, Seraser Rest.is a place, where you get a great service and worldclass food", "helpfulness": 1, "user": "Prudiekalmen", "date": "September 8, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 78786370}, {"rating": 3.0, "stay_parameters": "Stayed August 2010, traveled as a couple", "text": "I would not hesitate to return if I were going back to Mexico City and recommend it very highly.", "title": "Nice but I wouldn't go back..", "helpfulness": 39, "user": "wakega11", "date": "August 30, 2010", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 3.0}, "id": 77551530}, {"rating": 5.0, "title": "top hotel", "text": "The hotel looks spectacular, it is lovely and clean (most of it - but I'll get to that), the staff are extremely attentive, the pool is incredible, the breakfast is seriously heavenly and the weather was exactly what we were after.", "user": "ballerina2000", "date": "August 12, 2010", "id": 74866703}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "However...my husband and I aren't the kind of people who worry about money when we are on vacation but when you can't buy a glass of wine for less than 20 pounds or a bottle of water for less than 12 pounds, money tends to sit at the back of your mind.", "title": "The most amazing places of Antalya: Mardan Palace and Seraser Fine Dining Restauran", "user": "IdonyW", "date": "August 3, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73601476}, {"rating": 4.0, "stay_parameters": "Stayed July 2010, traveled with family", "text": "The seafood restaurant costs about the same as a Gordon Ramsay or equivalent restaurant but the quality isn't as high, the Thai restaurant is pleasant. I had read previously that the Bosphorous restaurant was the most popular with other people and I can see why. There is a more than decent selection and it is a reasonable price.", "title": "It depends", "helpfulness": 1, "user": "LetsUsNike", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 2.0}, "id": 73053312}, {"rating": 5.0, "stay_parameters": "Stayed May 2011, traveled on business", "text": "I have been 23 country and stayed many hotels and this was the best l have ever seen, they have perfected many things from my first visit and bufet sellection was superb, night club is extraordinary, it is expensive but if money is no object than l assure you you get the luxury you expect, $17 million Italian restaurant is wonderful with its 4 giant aquarium", "title": "Second time at Mardan Palace and it was better than ever", "helpfulness": 5, "user": "AmerTurk", "date": "May 27, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 4.0}, "id": 110153198}, {"rating": 3.0, "stay_parameters": "Stayed April 2011, traveled on business", "text": "menu was reasonable, wine sellection which l was lucky enough to tour by the Hotel Manager Umit Erdogan who is a friend was shocking, they had $11 million dollars of wine there in a perfect setting.", "title": "Mardan Palace.... A luxurious place need more attention", "helpfulness": 12, "user": "Life1062717", "date": "May 14, 2011", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 1.0, "sleep": 4.0, "rooms": 3.0, "location": 3.0}, "id": 108185073}, {"rating": 5.0, "stay_parameters": "Stayed November 2010, traveled as a couple", "text": "Turkish bath on bottom floor with indoor swimming pool was very very nice,and lobby you will never again see ,with Melochite Piono to Bacarat cristal 4 ton chandeliers ,it is all to perfect,", "title": "Fulfilled our expectations", "helpfulness": 3, "user": "belfastboy09", "date": "January 20, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 93878441}, {"rating": 2.0, "stay_parameters": "Stayed August 2010, traveled with family", "text": "over all you have to see it to belive it, and seen you must at least one time in your life", "title": "Intruder in room, poor food, average service", "helpfulness": 57, "user": "Banker100", "date": "November 27, 2010", "detail_rating": {"service": 1.0, "cleanliness": 3.0, "value": 1.0, "sleep": 1.0, "rooms": 2.0, "location": 2.0}, "id": 88344434}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "I was on a short trip to Antalya, as Lara area was too much crowded by Russians and Germans spending their Ester vacation, my office finally book my last two night stay in Mardan Palace. My first impression was great. As soon as I entered the lobby, it reminds me the Emirates Palace in Abu Dhabi. But it was not like that. This hotel has three wings. I am still unable to understand why they made the European wing in this classic hotel. Unfortunately I was out of time and the weather didn’t allow me to have a swim either on the beach or at pool but it looked good. The best thing I experienced was the SPA. The SPA was very well decorated and staff was really helpful. The SPA manager was so helpful and welcoming. Check in was a little slow, and I had to wait around 30 mins to receive my luggage in the room. Room was very well decorated. The terrace had beautiful views. From air conditioner to all lights were controlled by remote control. Breakfast was really not good. Less choices and I was surprised to have some fruits which were not fresh. Whole LARA area was over crowded and this place was not having more than 10% occupancy. Over all it was a mixed experience but really less than what I was expecting while entering the main entrance and what really this place deserve. It’s the luxurious but lacks the warmth of life in it.", "title": "Exactly what we expected..", "helpfulness": 3, "user": "imperiallwizard", "date": "October 23, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 84526476}, {"rating": 5.0, "stay_parameters": "Stayed April 2010, traveled solo", "text": "I was a guest at a wedding that was set up at the Mardan Palace - a destination wedding...and what an experience !", "title": "The Ultimate experience in Luxury - the Taj Mahal of resort", "helpfulness": 1, "user": "arunkothari", "date": "October 14, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 83426225}, {"rating": 5.0, "stay_parameters": "Stayed September 2010, traveled as a couple", "text": "March is generally an off peak period for tourism in the Antalya area , with hardly any tourist to speak off , but the experience at the Mardan Palace , is something that words cannot describe its attributes fully. From the majestic entrance , the Ballagio style fountains to the absolutely fabulous decor of the lobby and common areas . The rooms are extra large and the bathroom - the size of a Manhattan studio !! ...all marble and granite and done up very tastefully...extravagant to a point , but not gaudy or tasteless. The very comfortable bed and the options of mutiple pillows to suit a guest's any whim/posture... the fresh linen, and towels and bathrobes to commensurate its Turkish heritage, all added up to the one fun filled and enjoyable experience.", "title": "Luxury Accommodation; excellent service; relaxing stay... Also, we were really amazed with Seraser Restaurant", "helpfulness": 2, "user": "Peelferdon", "date": "September 17, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 79901493}, {"rating": 4.0, "stay_parameters": "Stayed September 2010, traveled with family", "text": "This resort has not spared in pampering its guest , from importing white sand from Egypt ( that kept the ground temperature low by reflecting radiant heat) , for the comfort of barefooted sun bathers and beach swimming guest , to the massive out door fresh water pool and many restaurants to cater to any finicky palate - located above ground , below ground in themed restaurants . To top it all the staff was very courteous , friendly and co-operative towards us - a bunch of rather boisterous \"NRI -baratis\".", "title": "All the guts of a luxury resort, but some things are a bit off", "helpfulness": 2, "user": "ChickpeaPA", "date": "September 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 4.0, "value": 1.0, "sleep": 2.0, "rooms": 3.0, "location": 2.0}, "id": 79638375}, {"rating": 2.0, "stay_parameters": "Stayed June 2010, traveled as a couple", "text": "(as a barati - an invited guest , I cannot comment on the \"value\" - so I have posted a non-committal 3.)", "title": "wannabe 5 Stars", "helpfulness": 8, "user": "Chreng", "date": "September 12, 2010", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 1.0, "sleep": 3.0, "rooms": 1.0, "location": 3.0}, "id": 79249428}, {"rating": 1.0, "stay_parameters": "Stayed August 2010, traveled on business", "text": "We've been lucky enough to have stayed at this hotel on two separate occasions this year. Both times proved that the hotel was a lovely haven of peace and tranquility steeped in luxury.", "title": "bling bling of low quality", "helpfulness": 13, "user": "Ferre65", "date": "September 8, 2010", "detail_rating": {"service": 3.0, "cleanliness": 3.0, "value": 1.0, "sleep": 2.0, "rooms": 1.0, "location": 3.0}, "id": 78833760}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "I'm not big on writing reviews, but Mardan Palace warrants one. Excellent food, great rooms, and nearly impeccable service made my bf's and my relatives' stay a real joy! MArdan offers a great atmosphere and they go out of their way to make sure you get the most out of your experience. Everyone in the hotel is accomodative and polite, which is great considering how much of a rarity this is at other hotels at Antalya.", "title": "Everything was above par", "user": "Innanel", "date": "July 30, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 73019447}, {"rating": 3.0, "stay_parameters": "Stayed July 2010, traveled with friends", "text": "If you want to go to oldtown Kaleici, I recommend you not to miss amazing restaurant, Seraser - the best restaurant in Antalya.", "title": "Tasteful food, tasteless design", "helpfulness": 2, "user": "TrophyCollector", "date": "July 24, 2010", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 3.0}, "id": 72158045}, {"rating": 5.0, "stay_parameters": "Stayed May 2010", "text": "To sum up, everything was above par. This is the best hotel stay that money can buy at Antalya!", "title": "Fantastic-Dream come true", "user": "shanros", "date": "June 26, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 68759765}, {"rating": 5.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "Russian-Azerbaijani-Jewish design potpourri that is almost unbearable for western eyes. Must be an investment ruin, if the building cost of € 1 billion plus is true. Pretty empty although in high season. Guests are a wild looking mix of people with money from Eastern Europe and Central Asia. Service is pretty much in that direction too. The hotel's exterior areas are mostly defined by the large pool. Beach and seaside play a minor role, which is again unfortunate. On the positive side: food quality and choice is very good. The Hermes amenities are high-class. The location is close to the airport, however far from Antalya center and at the end of a row of many other theme hotels, like the Kremlin, Titanic, Topkapi, etc. If you really want to see the hotel for whatever reason, go there as a day visitor, but pre-book a restaurant, otherwise the door is pretty tough.", "title": "An Experience well enjoyed but a trifle on the expensive side", "user": "dartanian", "date": "June 15, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 67557655}, {"rating": 4.0, "stay_parameters": "Stayed May 2010, traveled as a couple", "text": "We had organised an Indian Marriage.There were total + 300 guests.", "title": "Expensive palace with high standarts", "helpfulness": 1, "user": "Bastjer", "date": "June 6, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 3.0}, "id": 66603710}], "location": {"country": "Turkey", "region": "Turkish Mediterranean Coast", "continent": "Europe", "city": "Antalya"}, "stars": 5, "variance": {"poor": 19, "average": 30, "very good": 57, "terrible": 10, "excellent": 142}, "aka": "Mardan Palace Hotel", "slim_ranking": 0.171052631579, "description": "On the verdant, green shores of Antalya, beautifully positioned to overlook Turkey's Mediterranean coast, a palatial hotel was built in the spirit of the grand Ottoman Sultans. Crafted for the contemporary international elite, the luxurious Mardan Palace in Lara is a chic resort which redefines the standards of Turkish hospitality. Through its innovative design features, extensive facilities and unparalleled service, it's the new luxury playground for the jet set to explore."}