{"user_rating": 4.5, "review_count": 281, "name": "Marina Beach Motel", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "What a great little place just a short walk from the beach! Recently renovated, we had a queen room with full kitchen and a private patio. A large bathroom just made it that much better. Very good continental breakfast in the morning, with real fresh squezed orange juice. Very friendly and helpful staff and quite possibly one of the best values in town. Would go there again in a heartbeat!!", "title": "Delightful!!", "user": "poco01x", "date": "October 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141948415}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "This is a very nice motel in a great location, and is an ideal place to stop if you are driving the California coast highway. It is only yards from the beach and a short walk into the main shopping area. They lay on a nice help yourself breakfast and also have free bike hire so you can cycle along the back of the beach. I would also recommend Longboards on the pier as a good place for lunch.", "title": "great location", "user": "WalesSteveE", "date": "October 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 141813963}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The Marina Beach Motel has different room configurations so take time out to speak with the front desk about your options.", "title": "Another delighful Stay in Santa Barbara..!!", "helpfulness": 1, "user": "ebrynnie", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 141533968}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "We normally stay in room #5, but on our most recent trip up the coast we knew that we would only spend a few hours in Santa Barbara. Room # 12 served this purpose beautifully. It's fairly small with a king, flat screen TV, table and two chairs, a mini fridge and a fairly large, modern bathroom. Oh...it was also a hot day and the air conditioner came in very handy....:)", "title": "nice rooms, good location, good value", "user": "Superpenni", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 141523090}, {"rating": 4.0, "stay_parameters": "Stayed November 2011, traveled as a couple", "text": "The only thing it lacked was a micro. But...at $124/night in Santa Barbara you'll be hard pressed to find a better deal...!! Santa Barbara is not exactly cheap.", "title": "Good Stay", "user": "d.reid11", "date": "September 28, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 141486463}, {"rating": 4.0, "title": "Super Place, Super Price", "text": "This is my favorite place to stay in Santa Barbara (when I am paying!). It is a classic old California motor court inn, but it has been redone and updated. All the rooms are exceedingly pleasant (I have stayed in several) and most are different.", "user": "Jeremy_S_1973", "date": "October 1, 2008", "id": 20546549}, {"rating": 4.0, "title": "Nice Location", "text": "The location is convenient to everyplace and it is a great neighborhood for just strolling and there is a seating area in the courtyard that is great for sitting out in the evening with a bottle of Santa Barbara chardonnay.", "user": "IdahoSusieq", "date": "September 24, 2008", "id": 20326875}, {"rating": 4.0, "title": "Small but smart rooms close to beach and town", "text": "I have also stayed in their Coronado (San Diego) property, the Crown City Inn (also great).", "user": "JJimBean", "date": "September 22, 2008", "id": 20279772}, {"rating": 4.0, "title": "silver anniversary", "text": "Being a native of Santa Barbara and then moving away 9 years ago, it was nice to come back as a visitor and find a nice place to stay that was a reasonably priced stay and allow my dog. :) The room was clean, nicely decorated although a bit small for 2 people and a dog and our belongings. The Continental breakfast the next morning was wonderful and the location was within walking distance to most of the things we liked to do. We would stay again the next time we are in town.", "user": "Stuartwinter", "date": "September 21, 2008", "id": 20243097}, {"rating": 3.0, "title": "If the beds were better, they'd be fantastic", "text": "Traditional motel layout around an attractive courtyard. Rooms have been fairly recently renovated but are small. As all rooms are ground floor we had to keep the blinds closed unless we were happy for all in the courtyard parking to look straight in. Our room had a very good sized kitchen area but the shower room (no bath) was very small - the reverse would have been preferable as the kitchen was not equipped - there was a sign to say that pots / pans etc could be obtained from reception (presumably at a cost but we didn't find out).", "user": "Topdrawer7", "date": "September 2, 2008", "id": 19680570}, {"rating": 1.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We arrived after a 7 hour drive in Santa Barbara at the Marina Beach Motel, to the desk clerk saying \"Your reservations are next week\", this was our Anniversay trip that we make yearly, we had made the reservations over the phone the previous week, he said that he remembered taking the reservations, but my husband said he spoke to a female, the man was lying, and it was obvious, they must have gotten more money for the room and just decied to lie to us and bump us off....it was Fiesta Week and this is NOT ACCEPTABLE, especially with a pet in tow. well, he called across the street and there was a room, but it was very moldy, smelled terrible, and the street noise was horrific, so I did not get any sleep for 2 nights. Nice anniversay, this ruined our trip. I guess money really is the issue here, and I guess it's o.k. to be a liar now. What really is the bottom line here, the man just stood there and didn't care one bit, nor did he really even try to help in any way, except call across the street, and we had to pay a lot more for our room there......needless to say we will never return...BEWARE everyone when you make your reservations here, get email confirmation so you have it in writing, they never emailed us confirmation, which I thought was strange, soooooo......we have stayed at this motel before, and it is mediocre to say the least, not worth the money they charge. they don't even have a spa to sit in.....my suggestion find another hotel there are plenty of them in S.B....", "title": "Horrible Liars... Beware", "user": "suzzee5", "date": "August 9, 2009", "detail_rating": {"service": 1.0}, "id": 37157844}, {"rating": 3.0, "title": "Great location and facilities. Spotlessly clean. Mixed Customer service.", "text": "Let's face it most Hotels in the area are pricey, but the Marina is well positioned half a block from the beach front and a comfortable stroll from downtown. The kitchenettes are useful but you do have to ask for all the utensils at reception. We have teenage boys and the use of a PC and the bikes are very handy. Acouple of points to note, if you are a family and you are eating in, then there are only 2 chairs in the room to sit on and reception were unable to lend us any. There is, however, a comfortable place to sit in the courtyard, depending on weather or time of day. We have only scored the Marina average as we found the receptionist customer service mixed. The person on the later shift is helpful,patient and spends time to ensure your questions have been answered, however, the same could not be said for the Leading receptionist on the earlier shift. At first we were grimmacing at some of the patronising comments and responses to customers and staff. but after a while we were chuckling to ourselves as episodes of Fawlty Towers came to mind.", "user": "StanleySurreyUK", "date": "August 8, 2009", "id": 37085401}, {"rating": 3.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "This very pricey motel (all accomodations in Santa Barbara seem pricey!!) offers very basic accomodations albeit in a great location in the charming city of Santa Barbara. The rooms are certainly overpriced for what they are...basic motel rooms and the beds and sheets could definitely use an upgrade. On the positive side breakast is served free of charge and bicycles are available free of charge for guests and are great for exploring the coast on a nice bike path that starts just adjacent to the motel. Take the bikes to the beach near the Biltmore hotel which is way nicer than the beaches right in town.", "title": "An OK place to stay in Santa Barbara", "user": "smallface1", "date": "August 7, 2009", "detail_rating": {"cleanliness": 3.0, "value": 2.0, "location": 4.0, "service": 4.0, "rooms": 2.0}, "id": 36980503}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "This is an old motel but has been refreshed and is very acceptable. Room is basic but clean. Continental breakfast had pastries from wonderful local bakery. Minutes to the beach. Only negative was a weirdo knocked on the door at 6am with a bizarre story but essentially asking for money. As the rooms are motel style, it is hard to avoid this even in Santa Barbara.", "title": "Affordable place in Santa Barbara", "user": "Tourist1957", "date": "July 22, 2009", "detail_rating": {"cleanliness": 3.0, "value": 4.0, "location": 5.0, "service": 3.0, "rooms": 3.0}, "id": 35515260}, {"rating": 4.0, "stay_parameters": "Stayed May 2009, traveled as a couple", "text": "Good motel in a great location, minutes from teh beach front. Free bike fire and good breakfast was a bonus. contact teh motel direct to negotiate a discount.", "title": "great location, good breakfast, good value", "user": "Jambo43", "date": "May 26, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 30832553}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Very close to the unspoilt beachfront, this motel lends free bikes so you can cycle along the sand among the palm trees. Pleasant seating areas provided to enjoy the free breakfast - cereal, pastries, yoghurt etc. Near enough to walk into town and enjoy the shops and restaurants as well. Room was fine and clean. Can't remember exact cost - just over $140 a night I think. Fairly near railway - awoken about 6am by train horn but just the once and, as a fan of American railways, didn't mind a bit.", "title": "Great location, would recommend", "user": "Lepoulier", "date": "April 24, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 28674395}, {"rating": 4.0, "stay_parameters": "Stayed April 2009, traveled with family", "text": "Alright Tripadvisor! Another great recommendation. Don't be fooled by the \"motel\" title--it's more like a bed and breakfast. We got the room with two queens and a kitchenette. The room was very cutely decorated and bright. I love the french shutters on the windows. The kitchenette was kind of old and not very welcoming, but a very minor point. The driveway through the motel was cheery and colorful with beautiful flowers. The front office is cottage-like with nice chairs and patio furniture to relax on. There's a rattan couch swing that was relaxing to eat your breakfast on. Nice breakfast setup--croissants, scones, bagels, breads, cereal, yogurt, fresh fruit. They have free bikes but you have to get them early because they were always gone. They have a small surrey that seats two adults and two small children, too. The front desk staff are nice but not enthusiastic--would've liked more hospitality on their end.", "title": "Very nice! We liked it! We really, really liked it!", "user": "petrovich", "date": "April 15, 2009", "detail_rating": {"cleanliness": 4.0, "value": 5.0, "location": 5.0, "service": 4.0, "rooms": 4.0}, "id": 28052552}, {"rating": 5.0, "stay_parameters": "Stayed February 2009, traveled on business", "text": "I would stay here again in a heartbeat. Coming again soon in a few weeks.", "title": "A Guiet Gem at a Great Price", "user": "sedonagirl99", "date": "February 15, 2009", "detail_rating": {"cleanliness": 5.0, "front_desk": 5.0, "location": 4.0, "business": 5.0, "rooms": 4.0}, "id": 24606841, "likes": {"liked": "— Friendly staff; convenient location", "disliked": "— Windows of most rooms facing cars in the parking lot"}}, {"rating": 4.0, "stay_parameters": "Stayed October 2008, traveled as a couple", "text": "If employees make a business, then the Marina Beach Motel will always be a highly successful operation. From the front desk staff, to the house-keepers, to the maintenance guys who were doing some rennovations in nearby rooms, everyone was friendly and attentive. My queen room was small but nicely appointed and very clean. My price ($101 per night) was much more reasonable than I expected to find in Santa Barbara and I know even lower prices were offered to people who arrived on the spur of the moment in the evening hours. Since I stayed several days, I liked that the guest computer in the lobby was available nearly every time I needed to use it. From my perspective, the only ammenity lacking was a mini refrigerator in the guest rooms.", "title": "re: Enjoyed our stay!", "user": "snappyrivera2", "date": "November 25, 2008", "detail_rating": {"front_desk": 2.0, "business": 3.0, "service": 3.0, "cleanliness": 5.0, "value": 5.0, "location": 5.0, "rooms": 5.0}, "id": 22180116, "likes": {"liked": "— The location, cleanliness, hotel rate and being a pet-friendly hotel.", "disliked": "— The concierge was very slow in checking us in. He took forever! But he gave us a good rate, so its worth all the waiting!"}}, {"rating": 4.0, "stay_parameters": "Stayed November 2007, traveled as a couple", "text": "We spent Sunday evening at the Marina Motel. I loved the room!", "title": "lovely motel!", "user": "warlouise", "date": "November 4, 2008", "detail_rating": {"front_desk": 4.0, "business": 4.0, "service": 4.0, "cleanliness": 5.0, "value": 4.0, "location": 5.0, "rooms": 5.0}, "id": 21547728, "likes": {"liked": "— location and cleanliness", "disliked": "— noise from the amtrak"}}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "My teen daughter and I came to check out UC and spent 1 night here. Couldn't have been better. Small size makes it easy (park in front of your room, a few steps to tjhe office...). Free bikes were great & we were able to go for 2 nice bike rides on the beach!", "title": "Great & Easy Stay in Santa Barbara!", "helpfulness": 1, "user": "TeachinCa", "date": "September 13, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 4.0}, "id": 41370301}, {"rating": 4.0, "stay_parameters": "Stayed August 2009", "text": "Room was very comfortable and grounds were charming. We found reception staff to be very nice, and the morning breakast was good. Close to State Street for restaurants/shopping.", "title": "Perfect location, clean, comfortable, and friendly!", "helpfulness": 1, "user": "rctravelin", "date": "August 25, 2009", "detail_rating": {"cleanliness": 4.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 38821117}, {"rating": 5.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "We will stay here again when we're in Santa Barbara!", "title": "A brilliant find!! Great location with good service", "helpfulness": 1, "user": "Fingersinpies", "date": "August 23, 2009", "detail_rating": {"cleanliness": 5.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 38543137}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled as a couple", "text": "My husband and I stayed at this great remodeled motel with our adult children for a weekend. The breakfast was the best continental we've experienced at any hotel with wonderful pastries and breakfast breads as well as a good selection of cereals and yogurt. Bicycles were provided free for guests and were just right for a trip to the shopping area of Santa Barbara. Our rooms were clean and comfortable. The staff were all very friendly and accommodating. For the area, the prices were fair. We will definitely plan to stay here again. We also loved our Segway tour of the area beaches from Segway of Santa Barbara - so check them out if you visit the area.", "title": "Exspensive but worth it!...", "helpfulness": 1, "user": "KenandChrisy", "date": "August 22, 2009", "detail_rating": {"cleanliness": 5.0, "value": 3.0, "location": 5.0, "service": 4.0, "rooms": 5.0}, "id": 38472865}, {"rating": 4.0, "stay_parameters": "Stayed August 2009, traveled with family", "text": "The hotel is in a great location, just 5 mins walk from the beach and 10 mins from the coastal end of State Street (the main street) and Stearns Wharf. We stayed in room 15 which was exceptionally clean and featured a mid sized kitchenette with sink, fridge/freezer etc. The hotel offers great extras such as free bike hire and wi-fi (so strong I was planning our next leg of our roadtrip whilst sat in the hotel gardens!!). The breakfast was advertised as \"extended continental\" which was the usual coffee and juice but complimented with various patries from a local bakery. There was ample room in the reception to enjoy these treats comfortably.", "title": "A lovely location", "helpfulness": 1, "user": "holiday021", "date": "August 12, 2009", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 4.0, "rooms": 3.0}, "id": 37510198}, {"rating": 5.0, "stay_parameters": "Stayed June 2012, traveled with family", "text": "Marina Beach Motel is a great find! Rooms are always spotless and they have just what we need... a wonderful bed, enough room to feel comfortable, a clean bathroom, and a good continental breakfast. The grounds are beautiful and the beach is right across the street. Having bikes right there to use makes it easy to take an beach ride. Close enough to State Streeet to go for dinner... Excellent service & great price! We will be back!", "title": "Our favorite in Santa Barbara", "helpfulness": 1, "user": "TeachinCa", "date": "October 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 143312561}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "We were pleasantly suprised by the hotel. The room was clean and the bathroom very big with a nice bath tub. The location is the beach and Steams Wharf. I recommend this motel to everyone who is visiting Santa Barbara.", "title": "really great motel", "user": "Josmarcel", "date": "October 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 3.0, "rooms": 4.0, "location": 4.0}, "id": 143186348}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "We stayed here for one night on a road trip up the west coast and it was a very welcome stop. Room and bathroom were very clean, with a huge double shower in the bathroom.", "title": "Fantastic motel, great location and excellent service", "helpfulness": 1, "user": "Salby52", "date": "October 17, 2012", "detail_rating": {"cleanliness": 5.0, "value": 5.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 143045680}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Staff were very friendly and helpful and we took advantage of the free bikes to explore along the beach front.", "title": "Two Blocks form the Beach inSanta Barbara", "helpfulness": 1, "user": "Jollymon22", "date": "October 15, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142885856}, {"rating": 5.0, "stay_parameters": "Stayed October 2012", "text": "Easy walking distance to explore the area.", "title": "Very happy with our stay here", "user": "Rebreakfast", "date": "October 12, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 5.0, "service": 5.0, "rooms": 5.0}, "id": 142644777}, {"rating": 5.0, "title": "Wish we had stayed longer", "text": "Flew from Melbourne, Australia picked up a car at LAX and drove directly to Marina Beach Motel.", "helpfulness": 1, "user": "Sarah N", "date": "October 12, 2012", "id": 142611364}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Room ready and checked in early. Comfortable and clean.", "title": "Great location, tidy place, free bikes, and great rates", "user": "sittinginthesunshine", "date": "October 9, 2012", "detail_rating": {"service": 3.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 142431267}, {"rating": 5.0, "stay_parameters": "Stayed October 2012, traveled as a couple", "text": "Fabulous position close to gorgeous beach. Loved garden area where we chatted to fellow guests and had breakfast. Staff very friendly.", "title": "Great place", "user": "hummer_m", "date": "October 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142339895}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "+++", "title": "Excellent motel in Santa Barbara! Free bikes and nice location!", "user": "leonardomrc", "date": "October 7, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 4.0, "location": 4.0}, "id": 142206465}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "Location: we walked everywhere, with the exception of bike rides we took using the motel's bikes (awesome)", "title": "Great little motel", "user": "Amanda253", "date": "October 5, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 142095501}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with friends", "text": "This was my second stay at this motel. My favorite location in S.B.: near the Wharf and Harbor, one block back from the beach front. Quiet, clean and comfortable. Reasonably priced for the area. Bikes and an almost full breakfast make it a little special. This time I walked to about 6 other motels in that neighborhood and still felt this was the best for the money.", "title": "Nicely modernized motor court motel--great location!", "user": "IshPatrish", "date": "September 27, 2012", "detail_rating": {"cleanliness": 5.0, "sleep": 5.0, "location": 5.0, "value": 5.0, "rooms": 4.0}, "id": 141442933}, {"rating": 5.0, "title": "Very lucky find", "text": "We went on a road trip to California and we covered a lot of ground and a lot of miles,we were finding it difficult to get digs then we came across this place,so we booked in for the night,we had a walk around and it was brill, lots of places to eat and get a drink, great shops etc.any way back to the digs, staff friendly the room was clean comfy and modern,it was more than just a room it had it's own kitchen and dining area and had a small yard with table and chairs.at night we went out for a meal and then found a great bar,we had the best night,the bar staff were fantastic, they really know their onions,put ours back home to shame.we could have stayed at this destination for days as there is lots of fun things to do ,any way time came to leave and off we went.the next place we went was not our thing so we headed back to Santa Barbara and we were lucky enough to get same room as before,we don't normally revisit any where as we like to move on and see something new,so you are honoured we are been there done it what's next sort of people,this place is highly recommended ,and we hope to visit again one day.", "user": "Bozzie123", "date": "September 25, 2012", "id": 141266332}, {"rating": 4.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "In route to San Diego we called a friend who used to live in Santa Barbara and said \"hands down..this is the place to stay in Santa Barbara\". The location is great as there are plenty of places near by to eat, drink and visit. The front desk staff was friendly and welcoming. The rooms were clean and offered plenty of space. The parking is free and located right out side of the rooms. We over slept the comp. breakfast since the beds were so comfy and the room was quite. If you are planning an extended stay this is a great choice as it features a full kitchen and dining space. Great place, great price!! Look forward to a future extended return!", "title": "Even a local would pick it!", "user": "TNO73", "date": "September 19, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 140683095}, {"rating": 5.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We picked this motel based on reading several positive review on here. We were not disappointed! This is the absolutely cutest motel. We were coming in late due to traffic issues, called front desk to let them know as they recommend you do so if coming after 5pm. The person answering the phone was very polite, said no problem, seems there is someone at the desk until 10 or 11pm, then it is closed until morning. Arrived and had a very quick and easy check-in.", "title": "Hidden Gem!", "helpfulness": 1, "user": "TheV's", "date": "September 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 140457358}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled as a couple", "text": "The outside of the motel was really cute at night. The parking is right outside your room, a bit of a tiny lot, but you can get around. In the middle is a lawn area with some chairs and table, plus a nice fountain that runs all night. Our room was super clean, which appeared to have been recently remodeled. I understand that not all rooms are the same, but we had a queen bed plus a seperate kitchen room. The kitchen had table and chairs, stove/range, microwave, and medium size refrigerator. Off the kitchen was a totally private patio with a lounge chair, table and another chair. Small, but perfect for just sitting outside. The bathroom was not huge, big enough for one person. Ammenities were fine, although they had shampoo but no conditioner. Shower was fine, towels were okay.", "title": "So adorable! I would definitely return :-)", "user": "soveryblessed", "date": "September 4, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 5.0}, "id": 139381807}], "location": {"country": "United States", "city": "Santa Barbara"}, "variance": {"poor": 9, "average": 17, "very good": 123, "terrible": 6, "excellent": 126}, "aka": "Marina Beach Hotel Santa Barbara", "slim_ranking": 0.15, "detail_rating": {"service": 4.5, "cleanliness": 4.5, "value": 4.5, "sleep": 4.0, "rooms": 4.0, "location": 4.5}}