{"user_rating": 4.0, "review_count": 47, "name": "Maritime Inn Antigonish", "reviews": [{"rating": 5.0, "stay_parameters": "Stayed December 2012, traveled with family", "text": "The staff here went out of their way to make our stay fantastic. The restaurant food is really excellent, and they cater to food allergies (celiac). The rooms have been renovated, and are large, clean and comfortable. I would definitely recommend this place.", "title": "Lovely place to stay", "helpfulness": 1, "user": "cgreno", "date": "December 16, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 147570407}, {"rating": 4.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "i have stayed at this hotel twice once in feb. 2011 and again in nov 2012. this hotel has good tate in interior design with a layout that is different compared to other hotel rooms. i stayed in 203 and 212. the first room room (feb 2011) 203 was good almost had a wow factor because of the different layout. the bathroom appeared dated in this room but it was nice overall. the second room in nov 2012 (room 212) was flipped but looked different. the bathroom was more modren and had a neat texture in the bathtub. Every room is unique in this hotel, they all have the same layout but different paint colour and decor. if you want a hotel that had more room than a traditional hotel but low prices stay at this hotel.", "title": "Good architecture and interior design!", "user": "sollows1", "date": "December 6, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 146897690}, {"rating": 5.0, "stay_parameters": "Stayed November 2012, traveled with family", "text": "Had a great stay. The rooms are great and the people are very friendly. The restaurant is very good as well with great food and service. I would recomend the hotel to anyone that is in the area. I ate in the restaurant alot while we were here and all the food was excellent especially the bread pudding for desert with carmel sauce.", "title": "Antigonish", "user": "John E", "date": "November 8, 2012", "detail_rating": {"service": 4.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 144935332}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "We stayed one night in Antigonish, Nova Scotia on a 2 1/2 week trip to the Mairtimes. This small hotel had a large room, well appointed, white/crisp bed sheets, air conditioning that worked great and an adequately sized bathroom (toilet and tub in one room, sink with mirror in another). The staff was pleasant, helpful and efficient. The attached restaurant served good food at very reasonable prices! The common areas were small but clean and well appointed. This hotel gets an A+ for cleanliness! They should definitely be giving their hotel workers who clean for them a raise! Our room and especially the bathroom just shined! It was in easy walking distance to their downtown area with restaurants and shops. The only drawback to this hotel was no elevator to the 2nd floor, we had to lug our heavy luggage up to the room on the 2nd floor. For those that would not be able to do that, they do have rooms on the ground floor. I'd highly recommend this small hotel, it was comfortable and quiet with all the amenities.", "title": "A little gem in a jewel of a town!", "user": "Cynthia B", "date": "September 3, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139308598}, {"rating": 4.0, "stay_parameters": "Stayed September 2012, traveled with family", "text": "We chose this hotel because of the close location to St.Fx and we are really pleased with our choice. Our room is newly rennovated, clean and spacious. We have a 2 double bed room and they have a small table, and a desk which allows for the spacious feel of the room. Linens on the bed are gleaming white and very comfortable. Staff was pleasant and it is within walking distance to restaurants and shopping. This is a small town, so you will not find a fairmont with marbled bathrooms, but a great find at a great price! Thank you Maritime for a warm comfortable stay!", "title": "Clean, spacious, great staff, good location to Fx", "user": "happy2trvl", "date": "September 2, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 139193130}, {"rating": 1.0, "stay_parameters": "Stayed January 2012, traveled on business", "text": "The floors were dirty (chocolate mm's under the heater), dried tooth paste on the sink, hair in the bath tub and prices are horrible!", "title": "Look for another hotel!!", "user": "NBRUBI", "date": "February 2, 2012", "detail_rating": {"service": 3.0, "cleanliness": 1.0, "value": 1.0, "sleep": 2.0, "rooms": 2.0, "location": 3.0}, "id": 124042277}, {"rating": 2.0, "stay_parameters": "Stayed December 2011, traveled on business", "text": "Would not recommend this hotel and thought about sleeping in the car for the night if it wasn't winter.", "title": "Smelly room.", "user": "50_US_States_2011", "date": "December 9, 2011", "detail_rating": {"service": 4.0, "cleanliness": 2.0, "value": 2.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 121564772}, {"rating": 5.0, "stay_parameters": "Stayed October 2011, traveled as a couple", "text": "The room overall was clean and the staff friendly, but a bad O'rourke kept emanating from the toilet. This smell appeared to be coming from gases coming out of the toilet, as I noticed bubbles in the water. I forgot to close the bathroom door one evening and it smelled all over the room the next morning. I told the staff upon.checkout and they promised to fix it.", "title": "Great place to stay", "user": "flameforever", "date": "November 8, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 120352709}, {"rating": 4.0, "stay_parameters": "Stayed August 2011, traveled with family", "text": "We stayed here in the off season and showed up without a reservation in hand. The front lobby was very accommodating and found us a room in the \"drive up\" part of their inn.", "title": "A welcome sight!", "user": "fortitudeX4", "date": "October 15, 2011", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 119335070}, {"rating": 5.0, "stay_parameters": "Stayed July 2010, traveled as a couple", "text": "Our room had obviously been renovated within the last year or so. New king bed, very comfy for sleeping with new linens, leather chairs, brand new bathroom that was huge. We soon figured out why....we had been given a room for the handicapped. It was the nicest room for the handicapped that I have seen.", "title": "A friendly place with a great location!", "user": "travelpair55", "date": "July 25, 2010", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 72315756}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We stayed at the Maritime Inn this summer while we were in town for a wedding. We requested an early check-in and when we arrived at the hotel, we were greeted by a friendly lady at the front desk who told us our room was ready. The room was modern, comfortable, spotlessly clean, and the bed was very comfortable.", "title": "Great stay, friendly service!", "user": "MissyMissy99", "date": "September 1, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 4.0, "location": 5.0}, "id": 139104204}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We ate breakfast in the café the next morning, and our server took very good care of us. We ordered the lobster eggs benedict and it was fantastic! What a way to start our vacation in the Maritimes.", "title": "Lovely Inn", "user": "DeerParkMom", "date": "August 30, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 138852925}, {"rating": 5.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We were running late for the wedding and realized we had forgotten to wash the car. Normally this wouldn’t be that big a deal but we were going to be chauffeuring the bride and groom around. The maintenance guy was out watering the flowers so we asked if he would give the car a quick once-over with the hose and he was more than happy to do it. Once again, we were pleased with the great service from the staff at the hotel.", "title": "Sparkling bathroom", "user": "Ellie B", "date": "August 28, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 138728594}, {"rating": 4.0, "stay_parameters": "Stayed August 2012, traveled as a couple", "text": "The only suggestion for improvement I would offer is to provide mini fridges in the rooms. But all in all, we had a wonderful experience at the Inn and wouldn’t hesitate to recommend it to others.", "title": "A pleasant surprise", "user": "TravelingGirl43", "date": "August 18, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 4.0, "sleep": 4.0, "rooms": 3.0, "location": 5.0}, "id": 137577684}, {"rating": 3.0, "stay_parameters": "Stayed August 2012, traveled with family", "text": "We are checking out Universities and went to Antigonish to tour St. FX. If anyone has read any of my other reviews, you will know that I planned our trip using CAA Triptik that rates the hotels and provides a description. Then I went to Tripadvisor and read many of the reviews which I found to be informative and sometimes entertaining. Anyway, we were not disappointed and were very impressed with the hotel and cleanliness. We only stayed the one night, and foud it to be quite allthough I think they had a full house. We had a long day travelling to Antigonish, so we decided to eat at their restaurant and everyone in my family was very happy with the food and service. My son was happy with the wireless internet service. I disagree with one of the reviews calling this a motel. I think a motel is where you park your car in front of your room. The building was a two story building and we were on the second floor, so perhaps the rooms had direct access to outside. I have to say I did not notice. On that note, there is no elevator, so if you think you can't manage the stairs you may want to ask for the first floor. The front office staff were more than happy to help get our luggage up or down the stairs. We did not care for the coffee provided in the rooms, but the cafe had good coffee.", "title": "Less than Impressed", "user": "RoadwarriorLynne", "date": "August 11, 2012", "detail_rating": {"service": 3.0, "cleanliness": 2.0, "value": 3.0, "sleep": 3.0, "rooms": 3.0, "location": 4.0}, "id": 136904203}, {"rating": 4.0, "stay_parameters": "Stayed August 2012", "text": "Stayed here on a couple of nights in two separate rooms. All clean and tidy but the walls are a little on the thin side, particularly with reference to the bathrooms. Be aware that this is more of a motel than an inn. Wifi connection is good.", "title": "Bathrooms a little noisy", "user": "Thalweg", "date": "August 11, 2012", "detail_rating": {"cleanliness": 4.0, "value": 4.0, "location": 4.0, "service": 4.0, "rooms": 4.0}, "id": 136878694}, {"rating": 5.0, "stay_parameters": "Stayed April 2012, traveled as a couple", "text": "WOW!!! This hotel has come a long way from the last time we have visited. I can not express how wonderful the food was in the hotel. The staff was friendly and helpful. The decor was lovely. Mingo Group you have outdone yourself again!! Thank you for making this a rich yet cozy place for us the dine and stay.", "title": "Loved the renovations & the food!", "user": "PineappleGirlNS", "date": "June 22, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 5.0, "sleep": 4.0, "rooms": 5.0, "location": 4.0}, "id": 132540077}, {"rating": 4.0, "stay_parameters": "Stayed March 2012, traveled on business", "text": "I booked 13 rooms here in March 2012 and couldn't believe how much the rooms, restaurant had improved over our previous stay. Beds were really comfortable and the comforters made for a good night's sleep. Food in the restaurant was very good, service was quick and friendly. Would recommend to anyone visiting Antigonish.", "title": "Renovations & refurbished rooms terrific!", "helpfulness": 1, "user": "Avjk", "date": "March 14, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 3.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 126110915}, {"rating": 5.0, "stay_parameters": "Stayed March 2012, traveled solo", "text": "I stayed 3 nights midweek and found the staff very friendly and accommodating. The room was clean (apparently recently refurbished) and the bed was very comfortable. I had a main floor room and could park right in front of it. Positives would be the staff and cleanliness, negatives would be a little noise from the neighbors and the price is a bit high. (I didin't research prices at the other motel in town, so it might just be the market there) The restaurant was very good as well and the location was great.", "title": "A nice place to stay", "helpfulness": 2, "user": "rick m", "date": "March 10, 2012", "detail_rating": {"service": 5.0, "cleanliness": 5.0, "value": 3.0, "sleep": 5.0, "rooms": 5.0, "location": 5.0}, "id": 125905729}, {"rating": 4.0, "stay_parameters": "Stayed February 2012, traveled on business", "text": "I stayed here 2 nights on business. Check in quick and easy, friendly desk staff willing to offer info on area and directions. I had a ground room floor with an exterior door and it was nice to park right outside my door and carry my stuff in. Never heard a peep from my neighbors. My room was clean and no weird odors from bathroom as noted in other review. The room service was quick and very good food. I would stay here again.", "title": "Not sure why the negative ratings, I had good experience", "user": "NishTraveller", "date": "February 20, 2012", "detail_rating": {"service": 4.0, "cleanliness": 4.0, "value": 4.0, "sleep": 4.0, "rooms": 4.0, "location": 4.0}, "id": 124900203}], "location": {"country": "Canada", "city": "Antigonish"}, "stars": 3, "variance": {"poor": 1, "average": 4, "very good": 19, "terrible": 2, "excellent": 21}, "aka": "Maritime Inn Antigonish Nova Scotia", "slim_ranking": 0.4, "description": "Enjoy the amenities of our \"Four Star\" Antigonish hotel with all the charms of an inn. Our cozy, full service location in the centre of this bustling university town is within walking distance to campus, shopping, theatre and special events. Choose from spacious double rooms and convenient drive-up rooms."}